{
  "AuthorID": "Gabpj",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
  "Posts": [
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Aug 7, 2013 05:09PM Gabpj wrote: No wonder you feel down. I never enjoyed bra shopping even before breast cancer. I remember when I went shopping for maternity bras quite early in my pregnancy(my breasts seemed to swell immediately). The assistant made some remarks which I found a bit personal and insulting and I cried all the way home! Bra shopping after breast cancer is certainly no pleasure. It is very cruel how we have to be reminded about the impacts of breast cancer all the time. You need to spoil yourself today and get your mind of it. If you can, exercise is also good to get those endorphins going. I was sick last week with a cold and so got out of my exercise routine and life seemed so much harder. Hoping your week gets better. Gab",
      "MessageIndex": 3,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809018",
      "Title": "Feeling down Leah_S chrissyb"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jun 28, 2013 01:17AM Gabpj wrote: I don't have any advice but my prayers and thoughts are with you. Hopefully someone in the boards will be able to answer your questions.",
      "MessageIndex": 4,
      "PostDate": "28/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806856",
      "Title": "Multiple Mets in Multiple Areas CSMommy justjudie"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Apr 9, 2013 03:05PM Gabpj wrote: New member #125",
      "MessageIndex": 144,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "May 22, 2013 10:01PM Gabpj wrote: I have just come back from oncologist and he said don't get too hung up on tumour markers - they can be helpful and may show a trend but you need to bear in mind that you could have blood drawn 3 times on one day and the tumour markers would likely be different in each blood draw (sometimes even significantly so).",
      "MessageIndex": 3,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805057",
      "Title": "tumor marker fluctuation question (in normal range) brandall blainejennifer"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jul 23, 2013 11:20AM Gabpj wrote: Hi Nancy It is very early hours of July 24 in Australia (where I live) and I just wanted to wish you Happy Birthday. You have a great oncologist = great referral network = first rate surgeon = fantastic outcome. Anyway, I just wanted you to know that you have a huge number of people wishing you well and praying for a speedy recovery.",
      "MessageIndex": 71,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807898",
      "Title": "Update on me - brain surgery scheduled nancyh RonnieKay"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Apr 26, 2013 04:56PM Gabpj wrote: Thank you for posting such an uplifting article. I am a newbie on this board but your posts always give me hope - you are living your life to the fullest despite your stage iv diagnosis and I admire you for this.",
      "MessageIndex": 22,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803815",
      "Title": "OT - article about SIL and me at Boston marathon nancyh nbnotes"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Apr 30, 2013 01:54AM Gabpj wrote: He is gorgeous. Hope you get out of hospital soon.",
      "MessageIndex": 6,
      "PostDate": "30/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804017",
      "Title": "Noah's 1st Bday! Trying once again Evans1128 LuAnnH"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jul 17, 2013 06:45PM Gabpj wrote: Nancy, so sorry that the last few weeks have not been kind to you. I have no advice on brain surgery but I will be thinking and praying for you. What a birthday to remember! With the best birthday present being that you beat back those brain mets. Gab",
      "MessageIndex": 5,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807898",
      "Title": "Update on me - brain surgery scheduled nancyh RonnieKay"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Apr 5, 2013 03:41AM Gabpj wrote: Obxk- I have two boys (turning 13 and 10). I love them this age because they are good company. I have also been recently clothes shopping with my 13 year old (he is starting to want to develop his own style much to his father's worry. I explain to my husband that it's ok the 13 year old doesn't want to dress as a miniature of his dad or the same as his little brother.) I hope that your scans go well and your port issues resolve. I had a port put in on wed and all seems fine. Chemo was better through port than veins.",
      "MessageIndex": 136,
      "PostDate": "05/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Apr 16, 2013 08:02PM Gabpj wrote: Karen- wishing you good luck today when you pick up the scans. I hope you have a support person who will go with you as there is nothing more nerve wracking than reading scan reports. Tortoise - I had a tram flap procedure before I was stage I. And never regretted it but it was a big operation and I was not immune suppressed at the time. I would talk to your oncologist about how it will impact your treatment and then speak to your plastic surgeon for suggestions.",
      "MessageIndex": 157,
      "PostDate": "16/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Apr 21, 2013 11:47PM Gabpj wrote: I lost weight ( about 3kg or around 7 pounds) but I can't blame chemo- it was post part iv diagnosis but before chemo started. It was purely due to stress. I hope you get your energy levels back soon.",
      "MessageIndex": 163,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Apr 26, 2013 08:28PM Gabpj wrote: Carolben - I see on another post that you have scans on 9 May. I will be thinking of you and hoping for good news. I am 3 weeks into carbo/taxol. My hair has started to fall out - it just has to last until tonight as we are going to a ball to raise money for the royal flying doctors. My scans are at the end of May.",
      "MessageIndex": 169,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "May 22, 2013 06:56PM Gabpj wrote: Love for life - I am on carbo/taxol so can't comment on gemzar. The carbo week knocks me around a bit (tired and sluggish plus it really elevates my liver enzymes) but if you worked through AC I think that the side effects would be manageable. Just choose the day of chemo so that your off days are on the weekend. There are some ladies on the tnbc site who have done carbo/gemzar and they may be able to help you as well. Good luck and I am sorry you had to join us here.",
      "MessageIndex": 178,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "May 22, 2013 07:36PM Gabpj wrote: Marywh - I will keep you in my thoughts/prayers this week. I hope you get good news with your EKG. Are the other SE of Halaven am manageable?",
      "MessageIndex": 180,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jun 4, 2013 12:40PM Gabpj wrote: Cheri - good luck with your scan on Friday. I am on a similar regime to you ( carboplatin /taxol but without the parp) I had a 6 week scan last week. The MO said at 6 weeks, good news would be stability- The results showed that the mets to the lung had reduced 20%. So, even though we all hope for miraculous regression, stability is not a bad thing. I also have 2 cancerous lumps in my armpit which I can feel - they are not lymph nodes but subcutaneous lumps that formed after axilliary clearance. I spend way too much time examining their size. Please keep us updated with your scan results. I will keep you and your family in my thoughts/prayers. I have another 12 weeks before my next scanxiety.",
      "MessageIndex": 192,
      "PostDate": "04/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jun 6, 2013 06:53PM Gabpj wrote: Thanks for sharing your journey, Lotus Blossom. The only thing that kept me sane between my stage iv diagnosis and first scan was the stories on this site of people good quality lives despite a stage iv diagnosis. When it is someone who is triple negative, it is especially special. Thank goodness, I found this site and didn't have to rely on depressing google searches. Surf dreams- It must be a relief to have good scans. You may be on to something - having a vacation before scans. I think that was Kazzie61's strategy too and she got stability as well. Lucky, I have a lot of mini breaks planned this year ( I have told kids that 2013 is the year of fun and that we will be doing things we would otherwise put off). Our last adventure was climbing the Sydney Harbour Bridge.",
      "MessageIndex": 207,
      "PostDate": "06/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jun 11, 2013 05:00PM Gabpj wrote: Carolben - I hope your rbc climbs this week and gives you extra energy. Meanwhile enjoy your short chemo break. We have rain forecast all week and it is sorely needed in my regional area - but it also means I can't get outside to exercise and I know exercise improves my mood and energy levels. On the positive side, I have a weekend planned with my three bridesmaids (and husbands) to wine country this weekend. They all live away so I don't get to see them too often (one I haven't seen in four years). Mary - I hope that your body adjusts to the iexmpra and that you don't feel like you are hit by a truck next time. Iexmpra is not available in Australia so I don't know much about it. Gab",
      "MessageIndex": 221,
      "PostDate": "11/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jul 11, 2013 09:23PM Gabpj wrote: Mg - I haven't been on Navelbine so can't comment on how long it takes to work. I do have some subcutaneous nodules in my axilla and I know that they play on my mind so I can sympathise with what you are going through. Mine haven't got bigger in treatment but because I feel them so often I am unsure if one of them is getting smaller or stays the same. I hope someone can answer your questions. Brenda - I am brca negative ( or quadruple negative).",
      "MessageIndex": 244,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jul 18, 2013 06:55PM Gabpj wrote: Mary - wishing you luck with your MRI.",
      "MessageIndex": 250,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jul 30, 2013 01:32AM Gabpj wrote: My second diagnosis was multifocal. I had lots and lots of micro tumours spread right through my breast. I think the largest was about 4mm and most were tiny. I did feel a small lump (about 1cm) at the time of diagnosis but I think this was just my breast reacting to the cancer. There was also significant cribiform DCIS throughout the breast. There was vascular involvement (my first diagnosis did not have vascular involvement). So basically my whole breast was speckled with microscopic tumours and that is why it wasn't picked up earlier. I am lucky that I don't have lumpy breasts and so any lumps to me are unusual and I check them out. It didn't stop me from getting to stage iv but may explain why it took 5 years for me to get here. I don't have the brca gene but the genetic professor told me that he recommends that anyone with the gene have their ovaries removed when they have finished child bearing but bmx is a personal choice as breast cancer can be detected early. I am proof positive that early detection is not always enough!",
      "MessageIndex": 269,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Aug 5, 2013 07:06PM Gabpj wrote: Carolben - sending best wishes for your last taxol treatment today. Now you can focus on that visit to your son! Lotus blossom - great news that you are so well and Navelbine can work for so long. You obviously tolerate it well.",
      "MessageIndex": 295,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Apr 9, 2013 06:31AM Gabpj wrote: Karen - so sorry about the progression. I don't know much about xeloda but if you are worried it might be a good time to seek a second opinion. Csmommy - I have lots of minuscule lung mets with only one that can be measured.",
      "MessageIndex": 147,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "May 16, 2013 05:38PM Gabpj wrote: Wonderful news Carolben! Let's hope they all disappear next scan. I'm glad it has given you renewed hope and determination. I find out next week if taxol is working for me and I am also holding on to my hair for as long as I can. I have been on chemo two times before and always shaved early but not this time (as I know chemo is my new reality I want to hold on to some sort of normality as long as I can)",
      "MessageIndex": 172,
      "PostDate": "16/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jun 6, 2013 12:37AM Gabpj wrote: Carolben - I hope your red blood cells rise and you regain your energy. One good thing about being bald in winter is that we have a good excuse to wear beanies and other hats. I just hope I retain enough hair to poke out under the beanie to give the illusion I still have hair- I know it won't last for long Tortoise and surf dreams - glad to see you back on the thread. Lotus blossom - thanks for your inspiration Marywh - good luck with iexmpra Kezzie61 - I am glad xeloda is working for you and Obxk - I'm glad you have so much to look forward to in the coming month and I hope this distracts you from scanxiety. I have only just started to have tumour markers done and my oncologist made me promise I wouldn't get too hung up on them - fluctuations can come from so many things.",
      "MessageIndex": 201,
      "PostDate": "06/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jul 7, 2013 03:01AM Gabpj wrote: Thank you indianadeb for sharing your story. A 4 month chemo break sounds great! Here's hoping xeloda is kind to you. I haven't been on it but from what I have read it seems like a doable chemo.",
      "MessageIndex": 237,
      "PostDate": "07/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Aug 7, 2013 01:06AM Gabpj wrote: Marywh - sorry about the additional diagnosis. I remember when I did my first chemo (ac) and my medical oncologist going through with me all the risks ( you have a 1 in 50,000 chance of getting this this etc). My radiation oncologist didn't do this - just said I should do it. I always thought my medical oncologist was overly pessimistic but she is the only one who predicted at stage I, I could still end up stage iv so I guess in the end she was the most honest even if it is not what I wanted to hear. Not sure if this helps but my mother had an underactive thyroid removed 25 years ago and is on daily tablets as a result. She never had any trouble with either the op or the follow up drug taking - to the extent that it has been pretty much been a non issue for the past 25 years.",
      "MessageIndex": 300,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Aug 20, 2013 09:44PM Gabpj wrote: Sorry to hear your news Mary. i hope the other tumour markers come back ok but they bump up the scans anyway - you are already living in a state of scan anxiety so may as well get it out of the way. How was your trip away?",
      "MessageIndex": 307,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Apr 4, 2013 06:16PM Gabpj wrote: Carolben- sounds like you are having a great time with your son. You will have to let us know how the paragliding goes. I started carboplatin/taxol yesterday. It was a relief to finally get going in treatment - three weeks since stage iv diagnosis, I just wanted to get fighting rather than just feeling sorry for myself. No real side effects yet. Was slightly nauseous but meds took this away.",
      "MessageIndex": 133,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Apr 7, 2013 07:25PM Gabpj wrote: janelle- I was sorry to hear your news and that you had only such a short time without treatment. I am glad that your new treatment plan started so soon after diagnosis. I was diagnosed just before Easter and waited 2 weeks to start - I am a lot better mentally now that I have begun to fight my lung mets. I hope that your treatment goes well for you. Obxk- it looks like 13 year old boys are the same the world over. Your sons clothes sound like they come straight out if my son's wardrobe.",
      "MessageIndex": 139,
      "PostDate": "07/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Apr 26, 2013 06:33PM Gabpj wrote: Mary - I am sorry that Abraxane stopped working. Thank goodness the progression wasn't as bad as it could be and that your liver and lungs are stable. I hope your new treatment works for a long long time.",
      "MessageIndex": 168,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jun 4, 2013 07:20AM Gabpj wrote: Mary - it seems cruel to leave you waiting like this (joys of cancer I suppose). Is there any way to get in contact with the PA, explain your concerns about your condition (lumps growing quickly) and insurance so they can at least get the paperwork started. He has obviously been in contact with the MO and you had discussed alternative treatment before he went away so he probably knows what the next step of your treatment is. On a positive note, you said that the last scan showed your internal tumours were stable so hopefully they are not acting as aggressively as your chest recurrence. Probably a silly question but have you seen a cardiologist about your heart issues? In my ignorance, I don't know if this is a side effect of Halaven or a pre existing condition that has been made worse by chemo. Sometimes I am thankful to live in Australia and not have to deal with these insurance company issues. If it is approved for breast cancer in Australia, it is covered whether you are a public or a private patient. Anko - I am glad that Jennifer could give you advice. I am on taxol (with carboplatin) but have only done 8 treatments so have not got to the annoying part yet. It was a good reminder that I have to start concentrating on my nails ( I think I have been too concentrated on saving what I could of my hair to look normal under a baseball cap). Good luck with the scans and I hope that the results make the nail damage worth it.",
      "MessageIndex": 190,
      "PostDate": "04/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jul 5, 2013 03:53PM Gabpj wrote: Welcome to the stage iv tnbc thread - faith girl. I was diagnosed at a similar time to you. I am up to my 5th round of carboplatin/weekly taxol and like you my main SE seem to be tiredness and hair loss. I have lung mets. Mary- I am sorry to hear about your allergies. Heres hoping the allergist gets it all under control. Thank you ladies for reactivating this thread. Being stage iv tnbc can feel quite isolating so it is always good to hear from other people with tnbc.",
      "MessageIndex": 227,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Mar 26, 2013 12:37AM Gabpj wrote: Hi all, I am an old hand at TNBC - see signature but a first timer at Stage IV. I was recently diagnosed with lung mets and will start chemo (Taxol and Carboplatin) next week for an indefinite period. I am a 40 year old married mother of 2 sons (aged 12 and 9).",
      "MessageIndex": 120,
      "PostDate": "26/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Mar 27, 2013 09:52PM Gabpj wrote: Angela r - I haven't been on the board for long and so didn't get the chance to get to know you but thank you for documenting your journey on the site. The only thing that has given me comfort since I was diagnosed stage iv a couple of weeks ago has been reading about the courageous fights that everyone is putting up against this horrific disease. From what I have read, you truly are a warrior! Good luck in this next stage of your fight. Sugarmagzz- looks like you are at the start of the fight - like me. Good luck for you too and I hope your treatments allow you to get this disease under control.",
      "MessageIndex": 128,
      "PostDate": "27/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jun 7, 2013 09:37PM Gabpj wrote: Letselina - I agree with Kazzie61. When I was first diagnosed stage iv ten weeks ago, I felt lost and hopeless but starting treatment helped and also this site helped me enormously as I saw so many brave women battling bravely against this terrible disease. Every day it gets easier to cope and I can honestly say that I have more happy moments than sad. I am learning to enjoy the little things more. What chemo are you starting? Anko- I hope you are feeling better and that the mo answered your queries.",
      "MessageIndex": 212,
      "PostDate": "07/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jul 5, 2013 11:14PM Gabpj wrote: Csmommy - I will be thinking about you this week and hoping you get into the immunology trial - you really deserve some good luck with all you have been through! Your oncologists sound like they are proactive and at least the molecular test saved you from wasting time and enduring side effects on chemos that weren't going to work. Where did you get the test done? Anyway, I just wanted you to know that I am sorry about your progression but maybe it is just something that leads you to good results from the trial. Take care of yourself",
      "MessageIndex": 230,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jul 10, 2013 04:24AM Gabpj wrote: Caylians wife - welcome to the triple negative thread. We are all in for a real fight and it helps if you have a good oncologist. They are learning things about triple negative all the time and you need your oncologist to be on top of any new developments. I also find this site to be a great database of knowledge. I am 40, married for 15 years with 2 sons. Anyway, good luck with your treatment. I hope it goes well for you.",
      "MessageIndex": 240,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jul 29, 2013 11:19PM Gabpj wrote: Hi. I hope everyone is going well - especially obxk and csmommy - I hope you both find a trial/drug that suits you. Anamerty- I think there are many reasons why people are diagnosed stage iv from the beginning (misdiagnoses, aggressive nature of the cancer etc). I was diagnosed early at stage I with regular check ups and I still managed to get to stage Iv so who knows? Mothersdaughtertnbc - I am sorry about your mothers diagnosis and I hope her scans show regression. I have lung mets so don't know much about liver mets.",
      "MessageIndex": 265,
      "PostDate": "29/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Jul 30, 2013 12:49AM Gabpj wrote: Yes - I am really getting sick of cancer diagnoses! I am through my 5th cycle of carbo/weekly taxol. I re-scan in 4 weeks and if no progression will do another 6 weeks of carbo/taxol. Scan anxiety is slowly creeping in and I am sure it will intensify over the coming weeks.",
      "MessageIndex": 267,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Aug 6, 2013 11:37PM Gabpj wrote: Marywh,Txgigi & kazzie61- good to hear your brain scans were clear - i hate how cancer makes us second guess every ache or pain we have Marywh- have they resolved/ diagnosed your thyroid and bug problems yet? Txgigi- have you started abraxane yet? I hope it suits you as we'll as xeloda did. Gab",
      "MessageIndex": 298,
      "PostDate": "06/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Gabpj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174472/profile",
      "Content": "Aug 27, 2013 05:23PM Gabpj wrote: Karen - I am praying that this treatment works for you and as you say can be an effective treatment for other TNBC women. Do they test for protein via tumour biopsy or by blood test?",
      "MessageIndex": 312,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    }
  ]
}