{
  "AuthorID": "Gabyv",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224510/profile",
  "Posts": [{
    "AuthorID": "Gabyv",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224510/profile",
    "Content": "Gabyv wrote: Hello! I am 30 years old and 29 weeks pregnant. About 2 months ago I developed red areas on both breasts (left one a little more) right about where they touch. They were warm to the touch and tender. I Googled my symptoms and gave myself a heart attack because every article was about IBC. I saw my OB and he was puzzled by the symptoms I was having so he had me take a week of antibiotics. It did nothing and then sent me a steroid cream, and that did nothing. He finally ordered an ultrasound that came back negative except for some skin thickening and a lipoma on the left breast. I went to see a breast specialist after that, and he conducted a fine needle biopsy on the red area and that came back negative. The BS said he was not concerned it was IBC, and that he thought it was just my breasts reacting to pregnancy, and that my breasts were just heavy. He instructed me to get a better supportive bra and apply some cold compresses. Since I started wearing a better bra with lots of support the redness has gone away. I also went to see a breast surgeon, and she said this was not IBC and that I need to stop worrying. I was feeling very good and my worries had gone away. About one week and a half ago I noticed that I now have some orange peel texture to the areas that were once red. Again the left is worse than the right, and when I wake up in the morning it is less visible. As the day progresses the appearance of pores increases. I am terribly worried again, and have not been able to enjoy my pregnancy since this whole ordeal started!!!! Does this sound like IBC? Do the symptoms of IBC improve or come and go? I was not able to find much on these symptoms and pregnancy, so your feedback is greatly appreciated. I have an appointment in two days with the BS again. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "18/11/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/836859",
    "Title": "IBC Symptoms and Pregnant Gabyv Kicks"
  }]
}