{
  "AuthorID": "gah",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198620/profile",
  "Posts": [
    {
      "AuthorID": "gah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198620/profile",
      "Content": "Apr 20, 2014 07:53PM gah wrote: Brenda, we had needle biopsies on the same day! I hope your lung stayed stable! My jerk lung collapsed that night after I got home, so I had to go back to the ER. I thought it was nothing because the pain wasn't as bad as I had been led to believe it would be, so I didn't even bring a cell phone charger or a toothbrush to the ER. Rookie move, obviously.  Anyway, results maybe tomorrow or Tuesday. :-/",
      "MessageIndex": 657,
      "PostDate": "20/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "gah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198620/profile",
      "Content": "Apr 13, 2014 01:34PM gah wrote: Hi all, This is one of my first posts here, but I'm looking for some information on what to expect going forward.  A routine MRI to check on my implant recon found lots of lung nodules that were confirmed by CT. I didn't have symptoms when we found them (almost a month ago), but I have pain now, and a fair amount of shortness of breath and coughing. At first I thought it was anxiety from knowing the nodules were there, but I know now that it isn't. I have a biopsy to get more specifics on Thursday, but I'm trying to figure out what the next steps will be. I did ACT in 2010 at my first (stage II) dx, and have been on tamoxifen since then, though I guess it hasn't worked for me. My initial dx was er/pr+ and her2-. At first I wanted to pretend this wasn't happening, but now that I'm having pain I'm looking forward to getting some kind of treatment that will make it easier.  I'm 28. I just got married in August, and am finishing my last year of law school. I was training for a half marathon. I just want to be able to deal with this so that I have a chance of graduating, passing the bar, and starting the job I have lined up. Even if I won't be able to do it for very long, I want to at least say I did it. Because I'm having symptoms, is it likely that I'll have to go right to chemo, or would it still be standard procedure to yank my ovaries or try stronger antihormonals first? Are the common chemo cocktails for lung mets ones where you lose your hair? It just got back to the length it was before my first dx a couple of months ago.",
      "MessageIndex": 640,
      "PostDate": "13/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "gah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198620/profile",
      "Content": "Apr 14, 2014 09:56AM gah wrote: Hi there CD -- I'm thinking about the possibility of a pleural effusion as well. I had a CT almost a month ago that didn't show anything in the pleural spaces, but I have a call in to my onc about the possibility. Does pleural effusion (and its associated pain) tend to come on so suddenly? ",
      "MessageIndex": 650,
      "PostDate": "14/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "gah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198620/profile",
      "Content": "Apr 22, 2014 06:52PM gah wrote: Jean, maybe your onc could refer you to a larger center that would do a phone consult, and the your onc could try to incorporate those recommendations? I'm sorry to hear you're having a hard time.  Adnerb, I don't have pathology yet back on my mets, so I have no advice, but a lot of empathy for how frustrating it is to not have answers.  I have a question for you ladies: how long did it take from starting treatment to get relief from lung mets symptoms? I'm so sick of coughing and having my lungs hurt if I even speed walk, and it seems to be getting worse so fast. I don't have a treatment plan yet because we're waiting on final pathology, but I'm just getting so frustrated with the waiting game. ",
      "MessageIndex": 671,
      "PostDate": "22/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "gah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198620/profile",
      "Content": "Apr 13, 2014 03:02PM gah wrote: Thanks so much for your response and advice. I'm very happy to have access to the collective wisdom and experience of this group.  My initial treatment was at Sloan (I also used to live in NYC!). I've since moved to Chicago, and though I've been doing all my follow-ups in NYC and am getting opinions at Sloan, I'm also setting things up with an onc at Northwestern so that I can have something close. If anyone is treated at Northwestern I'd love to hear about the experience. I know that all the available statistics are out of date, but the ones I've seen are...frustrating. Particularly since the 18 month number wouldn't even get me to age thirty.",
      "MessageIndex": 642,
      "PostDate": "13/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "gah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198620/profile",
      "Content": "May 15, 2014 10:07PM gah wrote: I had just turned 24 at first dx, and just turned 28 at mets dx. ",
      "MessageIndex": 990,
      "PostDate": "15/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "gah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198620/profile",
      "Content": "Apr 1, 2014 06:20PM gah wrote: Hi all, This is my first post here, but the YSC forums (and Facebook) have such a small sample size, I wanted to take this question to a larger group. I was dx at age 24 with a 2.4cm ER/PR+ Her2- lump in May 2010, and was treated with a bilateral mast with implant recon, AC-T chemo, and tamoxifen (which I still take). I am now 28. At my three year MRI to check on my implants (the first scan I've had since finishing treatment) \"incidental note\" was made of \"multiple bilateral pulmonary nodules\" and a CT was ordered to follow up. The CT also shows \"numerous\" bilateral nodules from 1-10 mm in size, the larger of which are \"relatively more cranial in location\" (i.e. they're more in my upper lung than lower lung, I guess), and have \"multilobular\" margins. I have an appointment with lung specialists on Friday, but I was hoping to hear from ladies who may have had similar findings. While one of my onc's nurses tried to convince me that mets doesn't show up as numerous smaller nodules, that isn't what I've seen in my Googling.  I also just started coughing, but I think I may be coughing and experiencing chest tightness due to the fact that I'm getting pretty anxious. That said, of COURSE I would develop a cough once I find out I have lung nodules. I also went to a spinning class yesterday and experienced cough and shortness of breath afterwards, which is pretty uncommon for me, but I also haven't worked out pretty much at all in the three weeks I've been dealing with this, because I'm afraid. So I guess it could just be decreased fitness combined with an intense exertion.  I recently traveled to Southeast Asia, and I live in the midwest of the US and am fairly \"outdoorsy,\" so there is a chance this could be a weird fungal or inflammatory issue. I'd love to hear from anyone who experienced something similar - whether it was mets or not. I'd like to become as informed as I can.",
      "MessageIndex": 2312,
      "PostDate": "01/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "gah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198620/profile",
      "Content": "Apr 2, 2014 11:33AM gah wrote: Thanks for that info, cypher and carpe_diem! I'm hoping too that it's something I've inhaled that just took up residence. I wouldn't say they are symmetrical, but they are certainly in both lungs. I'm heading to NYC to meet with the Sloan lung people tomorrow and Friday. So...fingers crossed, I guess.",
      "MessageIndex": 2315,
      "PostDate": "02/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    }
  ]
}