{
  "AuthorID": "gaia0132",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216271/profile",
  "Posts": [
    {
      "AuthorID": "gaia0132",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216271/profile",
      "Content": "Dec 5, 2015 06:38PM gaia0132 wrote: Just caught this thread MusicLover. I am in for 10pm. I am not 'religious' but very intentional and believe in the swell that group intentions provide. ",
      "MessageIndex": 464,
      "PostDate": "05/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832394",
      "Title": "Power of Daily Prayer MusicLover MusicLover"
    },
    {
      "AuthorID": "gaia0132",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216271/profile",
      "Content": "Jun 17, 2015 04:56AM gaia0132 wrote: Hi Everyone I just received pathology from my post op report. Had Mastectomy of left breast with 4 lymph removed. 1 positive. Doctor characterized the tumor as very aggressive, but he was pleased with outcome and astounded over my overall health. This has been drastic for me on every level- I am slammed with my own lifestyle and eating practices basically 'failing me'- hatha yoga my whole life- have always sourced and prepared my own food from scratch ( garden/local farmers/organic)- could go on and on - but I think you get it. So here I am- the Dr, seemed to loosely suggest that I may just need hormonal therapy ( not that I want ANY chemicals- but I know I may be facing something) but now I'm faced with sifting through consultations with a range of people- from traditional MO to medical acupuncture I would appreciate any insights, any one commenting if they were able to go 'only hormonal therapy' at such and 'advanced stage'? Mine was classified as IDC- 5cm, IIIA , ER/PR +, HER2-) Also ANY recommendations for NYC practitioners ( NOT SMK). On a last note I had my surgery via laser, with Dr. Vincent Ansanelli- And it's a crime that this option is not more widely available. I was home that day. It's 7 day's post op today, i had NO drugs, No after effects of anesthesia, I'm showering and dressing myself. PLEASE if you unfortunately know of anyone who must face this tell them about him.... but more on that later  Thank everyone in advance for any insights you might offer  CA",
      "MessageIndex": 929,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "gaia0132",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216271/profile",
      "Content": "Aug 17, 2015 05:58PM gaia0132 wrote: Hi All, Wow after I posted on June 17 I kind of took a semi break from visiting everyday so I totally missed that some of you responded to my post. Thank you for responses. It's been 2 months since surgery and I have a PET/CT scan tomorrow. Feeling totally nervous and obviously have to forgo my nerve calming glass of vino tonight. Thank you all again.  warm hugs",
      "MessageIndex": 998,
      "PostDate": "17/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "gaia0132",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216271/profile",
      "Content": "Jun 29, 2016 01:01PM gaia0132 wrote: Evening all. I have mainly been hanging in the background on the bone mets and St IV threads since Dx last summer. But I wanted to send so much happiness your way Rosevalley. May the Abraxane serve your highest good. And to many more cheese sandwich enjoyed while looking lovely in your new shirts. With care and deep respect for all on this journey. Christine",
      "MessageIndex": 1073,
      "PostDate": "29/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "gaia0132",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216271/profile",
      "Content": "May 27, 2015 02:28PM gaia0132 wrote: Hi Maureen  I am wondering if you could speak more about Dr A. I have a consult with him on 6/3. I have had no diagnosis, but have a sizeable mass and have finally made peace that it won't change with natural care. Dealing with a lot of fear of 'what if' but so thankful I found out about Dr A, yet wondering 'is it too good to be true'  Thank you in advance for your kind reply",
      "MessageIndex": 5,
      "PostDate": "27/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826513",
      "Title": "Question about Dr. Ansanelli in NY katcar0001 SOGNY"
    }
  ]
}