{
  "AuthorID": "Gail35",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156357/profile",
  "Posts": [
    {
      "AuthorID": "Gail35",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156357/profile",
      "Content": "Jul 14, 2012 04:14PM Gail35 wrote: Thanks for the reply Etherize. Unfortunately I do not remember the name of the procedure, but it involves placing a wire into the duct to look for abnormalities.",
      "MessageIndex": 2,
      "PostDate": "14/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790576",
      "Title": "Don't know what to do Gail35 etherize"
    },
    {
      "AuthorID": "Gail35",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156357/profile",
      "Content": "Jul 14, 2012 04:37PM Gail35 wrote: Thank you, after doing a little more research I believe the procedure I was thinking of is called a ductogram or galactogram.",
      "MessageIndex": 4,
      "PostDate": "14/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790576",
      "Title": "Don't know what to do Gail35 etherize"
    },
    {
      "AuthorID": "Gail35",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156357/profile",
      "Content": "Gail35 wrote: Hello everyone. I am 35 years old and have been experiencing spontaneous unilateral breast discharge for about 3 months. It started out white, but lately has been clear. Prolactin levels were checked and are normal. Mammogram and breast ultrasound were done. I was told that I had fibrotic breast and a 6 month follow up mammogram was recommended. I had a follow up appointment with my doctor a few days ago. I told him that considering my extensive family history of cancer I do not feel comfortable waiting 6 months for a follow up, so he scheduled a needle biopsy. I was asked to obtain my records to bring with me. My concern is that in reading the radiologist report of the mammogram they mention a focal asymmetry that is only visible on one view, and it is in the same breast which has the discharge. Of course I have googled this and am now worried. I have read about a procedure where they can check the ducts in your breast. Should I ask my doctor about this? Will a simple needle biopsy find cancer if it is in the duct? Any advice is appreciated. I am so lost and scared. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790576",
      "Title": "Don't know what to do Gail35 etherize"
    }
  ]
}