{
  "AuthorID": "gandl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63940/profile",
  "Posts": [
    {
      "AuthorID": "gandl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63940/profile",
      "Content": "Apr 29, 2008 09:11AM gandl wrote: I had a bone scan in Feb. 08 and it wasn't painful at all. There is an injection involved but the scan itself is painless.  For me anxiety was an entirely different matter.  I didn't know what to expect and that didn't help.  The thing you lie on is narrow and has to move your entire body through the sensing area.  You also need to be still, so they velcro your arms down and rubberband your feet together.  The tech told me that most people are more comfortable if they keep their eyes shut.  I wished I had paid attention to that advice after I opened my eyes. The solid metal area about 4 inches from my face was all that I could see.  I started getting a suffocating feeling and panic attack and almost asked the tech to stop the test.  I got through it by visualizing a shaft of air right above my head.  I knew there was no real reason for me to short of air, it was really open on both ends, but I did have this reaction.  I am having another scan on May 11 and plan to keep my eyes shut.  I hope that helps.",
      "MessageIndex": 3,
      "PostDate": "29/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704755",
      "Title": "Bone scan ophelia jeanne46"
    },
    {
      "AuthorID": "gandl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63940/profile",
      "Content": "Feb 23, 2009 11:14AM gandl wrote: Electrloytes are sodium, potassium, chloride, and carbon dioxide.  When my mother-in-law was on chemo her sodium got very low.  She seemed confused and not herself until it was corrected.  I take potassium pills because mine was low.  My first symptom was an irregular heartbeat.  The chloride usually mirrors the ups and downs of the sodium.  A potassium below 3.0 is considered critical and needs to be corrected quickly to keep the heartbeat regular.  Abnormal electrolytes just need to be brought back to normal levels, which generally is not too difficult to do.",
      "MessageIndex": 1,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729580",
      "Title": "Question - Electrolights sydpen2 sydpen2"
    },
    {
      "AuthorID": "gandl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63940/profile",
      "Content": "Sep 26, 2008 10:32PM gandl wrote: I had severe leg pain last year before I was diagnosed with breast cancer.  I went to an orthopedist, a pysiatrist, a chiropractor, a neurologist and my PCP.  The chiropractic treatmant of electric trigger point stimulation would help temporarily by confusing my nerves.  It only lasted a few hours though.  I went three times a week for about six weeks.  I tried shoe inserts, nsaids, and stronger pain meds.  The treatment that finally helped was neurontin. It lasted about 6 hours but was prescribed for every 8 hours.  A couple of months later I was diagnosed with breast cancer.  The onc ordered a bone scan which showed nothing in my leg. It did show a couple of places on my sternum and one rib.  I had regular x-rays of the sternum and rib which didn't show any lesions.  I had a repeat bone scan three months later and the only thing that showed up was the rib.  The neurologist did find \"minimal evidence for an L5 radiculopathy\" From what I understand that is like a pinched nerve in the lower back.  I think sciatic nerve pain is similar.  I know what you mean about worrying about recurrence of BC, but there are lots of other things to go wrong in our bodies also. : )  Anyway, keep looking into it and somebody will find a way to help eventually.  Good luck",
      "MessageIndex": 2,
      "PostDate": "26/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721813",
      "Title": "Leg pain julie26 mthomp2020"
    },
    {
      "AuthorID": "gandl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63940/profile",
      "Content": "gandl wrote: Yesterday I scheduled carpal tunnel surgery for Oct. 13.  I asked the surgeon about doing it when lymph nodes had been removed (I had six removed).  He said that he would place the tourniquet lower on my arm and that it would only be on about 11 minutes.  He said that if I had swelling it would be in my upper arm and that it would go away. How do you feel about his reply? I thought about asking my breast surgeon about it, but the only other time I brought up lymphedma she got kind of offended and said that I only had a sentinal node surgery and was not at risk.  Do you think I should have a referral for arm measurements before I have the carpal tunnel surgery? From what I've read on here, I know you will have good ideas.  Thanks gandl multicentric 6 ILC tumors, extensive LCIS, isolated tumor cells in 1 of 6 nodes, bilat mx 2-13-08, arimidex & actonel 2-21-09, switched to aromasin 8-20-09 Dx 1/28/2008, LCIS/ILC, Right, <1cm, Stage IA, 1/6 nodes, ER+/PR+, HER2- Hormonal Therapy Arimidex (anastrozole), Aromasin (exemestane) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/739133",
      "Title": "carpal tunnel surgery gandl lionessdoe"
    },
    {
      "AuthorID": "gandl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63940/profile",
      "Content": "Mar 11, 2008 11:39AM gandl wrote: Hi Maria,  I will be 4 weeks post-op tomorrow.  My breast surgeon told me that one of the reasons they don't leave the drains in very long is because you are less likely to form scar tissue where they were if they aren't in long.  The drain area just heals better. I had the same feeling about asking the ps to remove the expanders.  But since I've come this far it doesn't really make sense.  After the last fill I'm starting to see some contour to my \"Breast mounds\" and it has actually helped me feel better emotionally.  gandl",
      "MessageIndex": 28,
      "PostDate": "11/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/701538",
      "Title": "Anyone develop a seroma? Kimber 5yrsurvivor"
    },
    {
      "AuthorID": "gandl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63940/profile",
      "Content": "Mar 7, 2008 12:50PM gandl wrote: Hi Kimber, I'm really sorry that your surgeon refused to do the drainage.  I went to my breast surgeon  yesterday and she got 50ml of fluid from the right seroma and 165ml from the left.  It was very minimally painful and very helpful.  My left arm had been aching from the pressure on the nerve by the seroma.  She will see me again in a week to remove what rebuilds.  I am only 3 weeks out from surgery for multicentric ILC. I don't know if that makes a difference on the surgeon wanting to drain it.  Draining the seromas seems to have help my mental health also, just knowing that there is relief.  My breast surgeon did give me a prescription for Keflex which she said to fill immediately if there was any sign of infection such as redness or fever.  Maybe you could talk your surgeon into some kind arrangement like that to quell his fear of you getting an infection from it.  The relief from the drainingi s very worthwhile.  Keeping my fingers crossed for you. gandl",
      "MessageIndex": 19,
      "PostDate": "07/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/701538",
      "Title": "Anyone develop a seroma? Kimber 5yrsurvivor"
    },
    {
      "AuthorID": "gandl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63940/profile",
      "Content": "gandl wrote: Study suggests cancer cells may metastasize earlier than previously believed. The U.K.'s Press Association (8/29) reports that a paper appearing in Science suggests that \"cancer cells may spread around the body much earlier than was previously thought,\" a discovery that \"could prompt a complete rethink about metastasis...and lead to new ways of tackling the disease.\" The medical community had previously believed that metastasis was \"a late event that only occurs when a disease is advanced and has passed certain stages,\" after \"a series of genetic alterations\" made \"them more aggressive.\"         These changes would ensure the cells' survival as they \"journey through the bloodstream,\" and the alterations would also enable the cells \"to initiate malignant growth in their new environment in the new site,\" the BBC (8/28) added. But researchers at the Memorial Sloan-Kettering Center in New York now maintain that \"'normal' cells may carry cancer to new sites long before a tumor develops, lying dormant until key genes are activated.\" Furthermore, these \"cells were capable of traveling in the bloodstream to the lungs\" -- some \"surviving there for up to 16 weeks without expressing any oncogenes.\"         The finding may provide \"an explanation for why some breast cancers, for example, appear to spread throughout the body long after the initial tumor has been treated,\" pointed out the U.K.'s Telegraph (8/28, Highfield). During their experiments, the New York \"team injected mice with normal mammary cells from donor mice that had been experimentally manipulated in a way that allowed the researchers to turn on in breast cells certain cancer genes, known as 'oncogenes,' at various times after injection.\" The \"normal mammary cells traveled in the bloodstream to the lungs\" for nearly four months, however, they \"did not begin growing aggressively in the lungs until the oncogenes had been turned on, by giving the recipient mice a specially treated feed.\"         Notably, the cells did not go \"through the stage of being a primary tumor,\" HealthDay (8/28, Gardner) reported. The team led by Harold Varmus, \"who won the 1989 Nobel Prize for his work in cancer genetics and later went on to become director of the National Institutes of Health,\" then \"injected normal cells without manipulating any oncogenes.\" They found that \"when these normal ectopic cells were injected back into a new generation of mice, they developed into normal mammary glands.\" Co-researcher Katrina Podsypanina, Ph.D., said, \"It's definitely conceptually very profound,\" because \"our data seems to point toward the inherent decision that is made when the tumor is formed whether it is highly malignant or not.\" She added, \"Moreover, since the characteristic might be dependent on the normal cell status, one might imagine that they might be different between individuals.\" gandl multicentric 6 ILC tumors, extensive LCIS, isolated tumor cells in 1 of 6 nodes, bilat mx 2-13-08, arimidex & actonel 2-21-09, switched to aromasin 8-20-09 Dx 1/28/2008, LCIS/ILC, Right, <1cm, Stage IA, 1/6 nodes, ER+/PR+, HER2- Hormonal Therapy Arimidex (anastrozole), Aromasin (exemestane) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720617",
      "Title": "metastasis may occur sooner than previously thought gandl Gitane"
    },
    {
      "AuthorID": "gandl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63940/profile",
      "Content": "Oct 27, 2008 01:48PM gandl wrote: hi. from what I understand perineural invasion has no association whatsoever with disease free survival.  It's not a prognostic marker. The higher the stage of your cancer the more likely you are to have PNI.  Also if you have IDC and axillary lymph node involvement you are more likely to have it.",
      "MessageIndex": 1,
      "PostDate": "27/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723442",
      "Title": "question about pathology report donutswife2003 LuAnnH"
    }
  ]
}