{
  "AuthorID": "ganga",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68710/profile",
  "Posts": [
    {
      "AuthorID": "ganga",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68710/profile",
      "Content": "Nov 1, 2008 10:55PM ganga wrote: hi everyone, she is at queen elizabeth hospital here in hong kong. it's a government run hospital. she is still in hospital. i received a call this morning, she is refusing to eat or drink anything, even medicine. she is not even opening her eyes completely. i am scared. i actually wanted to see her attending dr but the hospital replied back saying that they don't know when the dr's are available to tak. this is outrageous. any advices.",
      "MessageIndex": 7,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723679",
      "Title": "sister in law-urgent ganga ganga"
    },
    {
      "AuthorID": "ganga",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68710/profile",
      "Content": "Oct 31, 2008 08:08AM ganga wrote: hi, she is in hospital right now. strange thing is that the dr asked her whether she want to stay at hospital or not, which is kind a scary. normally, if the case is serious, dr's would not consult with patient whether they want to stay or not. they just admit them, don't they? but why he asked her? i am obviously worried. she has lost a lot of weight in these 8-10 days. cannot eat or stand on her own. she vomits all the time. even now when she is at hospital, she is still feeling nausea and vomiting. dr are very adamant to talk to us. when we asked what the problem with her is, he just says that it is the side affects of her chemo and radio therapy. but her chemo was months ago and she finished her raadio on august, 2008. has anyone have had the same experience? please tell me. i am scared and worried for her. i don't want to loose her. is this the end for her? ganga Hong Kong ",
      "MessageIndex": 2,
      "PostDate": "31/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723679",
      "Title": "sister in law-urgent ganga ganga"
    },
    {
      "AuthorID": "ganga",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68710/profile",
      "Content": "ganga wrote: hi everyone, well, sorry for not being able to write in as often as i want to as i have been double busy with stuffs. my sister in law (brain mets), has been vomitting profusely and have nausea as well. it's been 8-10 days like this. she went to emergency but dr said that it is side effects of her cancer treatment (chemo and radio therapy). just a reminder, she had her whole body scan for cancer on sept, 2008 and it came out negative. so, i am just worried about her condition. she is a lot thinner. i can see the bones on her hip. could this mean somethingelse. could this mean that the end is near for her? please let me know as soon as possible. ganga Hong Kong Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723679",
      "Title": "sister in law-urgent ganga ganga"
    },
    {
      "AuthorID": "ganga",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68710/profile",
      "Content": "ganga wrote: Hi Ladies from HK, Well, I took my SIL to see a specialist in Oncology here in Hong Kong because her previous oncologist was not willing for her treatment. Specialist told us that because she is triple -ve, there is no medicines to treat her cancer at the moment. She said because her PET scan and bone scan both came out -ve, she is ok for now until the cancer comes back which may be in a year or two. For now, she has asked my SIL to do another PET scan on 23rd September, 2008 because her last one was done on 20th June, 2008. She said if the PET scan shows cancer than she will treat her, if not she has to continue to do her PET scan every 3 months so as to know whether her cancer has come back or not. Now, it may sound good but I am still not sure whether it is actually good news or bad. I forgot to ask the specialist whether this means that she can live longer than the 6-12 months period that her previous oncologist have given her. What do you think ladies? Like I said before, I have prayed for you ladies since I have come to know you from this forum and I will continue to do so. You ladies rock!!!!! Ganga Hong Kong Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720932",
      "Title": "new onc for 2nd opinion ganga LumiPojo"
    },
    {
      "AuthorID": "ganga",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68710/profile",
      "Content": "ganga wrote: Hi Everyone from HK, Well, my sister in law, er-,pr-,her/2-, went to see her oncologist today with her whole body PET scan report and whole body bone scan report. Both the report came out negative which is such a relief. She recently finished her radiation on her brain. Now the bad part, the doctor said that chemotherapy would not work on her body and that there are no medicines to treat her. She has now been referred to Palliative care. Unfortunately, i missed her appointment with dr today as i had to attend a meeting. I am quite shocked at why the doc said something like that to her. Why is he reffering her to Palliative care and what actually does Palliative care means. Why is he saying that there are no medicines to treat her body. Does this all mean that she has less less survival chance? One thing he also said to her is that he said the cancer will come back later but he said he cannot tell when. I am deeply saddned and hurt by this news. I wanted to see her doc but in HK, it is impossible to meet doctors in Government hospital unless you have an appointment. For the appointment actually, it is very hard to get and even if we get it, it will take about 4-6 weeks. Such is life here. Please give me your thoughts on this. thanks ganga,Hong Kong Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720671",
      "Title": "urgent advice in need ganga mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "ganga",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68710/profile",
      "Content": "Jun 28, 2008 10:58AM ganga wrote: Hi Kari, So sorry to hear about it. personally, you don't know me but this message board has aquainted us. i just wish you could get better and be strong as ever. this certainly is not fair. i wish god could  help you out. be strong and stay positive. love from Hong Kong ",
      "MessageIndex": 52,
      "PostDate": "28/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708158",
      "Title": "Very bad report KariLynn roseg"
    },
    {
      "AuthorID": "ganga",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68710/profile",
      "Content": "ganga wrote: hi ladies, just want to update you on the condition of my sister-in-law [SIL]. dr said her cancaer has come back again on her brain. they said it's something called leptomeningeal metastates. she had been vomiting and complaining of weakness/nausea for days since october. they admit her in early october and did MRI only on the 2nd week of november. found out that her cancer has come back. dr in palliative care first said they want to try new medicine and did some test. because she cannot even swallow water, they cancelled using new med. now, they said they cannot do anything medically. they have asked us to let her pass away peacefully at home. and they said only few days left for her. now, she is breathing with difficult, lost conciousness, does not even swallow a spoon of water. she is in pain. how can this be peaceful for her. I am devastated by her condition. until early october, she was normal, now she is lying on bed with tremendous pain. i'm loosing my mind. any suggestions ladies? ganga Hong Kong Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725154",
      "Title": "last days for SIL ganga LuAnnH"
    },
    {
      "AuthorID": "ganga",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68710/profile",
      "Content": "ganga wrote: Hi everyone from Hong Kong, my sister-in-law (SIL) was diagnosed with stage 4 brain cancer with brain mets. they did the operation to remove the tumor. they recently finished the radiation on her whole brain. her doc suggested a whole body bone scan. results came out but the appointment date is only on 5th sept. i went through the report. the very last point it says, there is no evidence of bony secondary. does this mean the cancer has not spread to her bones. does is it mean it is not likely to spread to her bones. the other thing that is bothering me is that in june, 2008, her oncologist told us that she may have 6 months to live. that 6 months is coming up soon. i am so worried about her. i dpn't want to loose her as she is a pillar of strength for us. upto now, she is still strong. she can walk, cook for herslef, sleeps well and does her things herself. i need some advice what is going on. is her time really coming to an end. what do you guys think. will she be able to beat this disease or will she loose the battle. thanks ganga Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720313",
      "Title": "urgent advice please!!!!! ganga heatherpalmerton"
    },
    {
      "AuthorID": "ganga",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68710/profile",
      "Content": "Jul 5, 2008 08:47AM ganga wrote: may you rest in peace kari. you are an angel to us.",
      "MessageIndex": 127,
      "PostDate": "05/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708474",
      "Title": "Kari is our latest Angel djd Rocktobermom"
    },
    {
      "AuthorID": "ganga",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68710/profile",
      "Content": "Jul 7, 2008 05:08AM ganga wrote: hi lpojoga, this is awesome news. i can't believe it. god has really listened to your prayers. give my love to your mum. i wish same news could be with my sister in law ganga hong kong",
      "MessageIndex": 8,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708571",
      "Title": "Good news - update on my mom's story LumiPojo mimi1030"
    }
  ]
}