{
  "AuthorID": "ganzgirl2010",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201776/profile",
  "Posts": [{
    "AuthorID": "ganzgirl2010",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201776/profile",
    "Content": "ganzgirl2010 wrote: Two days ago while showering I noticed the area from just under my collar bone extending to my right arm pit is swollen pretty bad. I went to see my bs about it yesterday and her np..I ran into the bs in the parking lot and because I was wering a tank top, I was able to show her the swelling, she did a visual exam and said it was fluid..then I went into the office for my apt with her NP. The np says is the muscle that's swollen. So, which is it, fluid or muscle ??? I was also just on the mayo clinics website and yep you guessed it...right under recurrence ! Im freaked out because they didn't seem concerned about it and Im losing sleep over it ! Ladies...what is going on with me ??? Dx 3/2013, LCIS, 6cm+, Stage 0, Grade 1, ER+/PR+, HER2- Surgery 3/21/2013 Lumpectomy: Left Dx 7/9/2014, ILC, 5cm, Stage I, Grade 2, ER+/PR+, HER2- Surgery 8/19/2014 Mastectomy: Left; Prophylactic mastectomy: Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Surgery 8/19/2014 Lymph node removal: Left, Sentinel Dx 8/20/2014, ILC, <1cm, Stage I, Grade 2, 0/1 nodes, ER+/PR+, HER2- Dx 8/20/2014, LCIS, 6cm+, Stage 0, Grade 2, ER+/PR+, HER2- Surgery 11/16/2014 Prophylactic ovary removal Surgery 1/13/2015 Reconstruction (left); Reconstruction (right) Surgery 6/16/2015 Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Surgery 3/8/2016 Reconstruction (left): Fat grafting; Reconstruction (right): Fat grafting Surgery 9/5/2016 Reconstruction (left): Fat grafting; Reconstruction (right): Fat grafting Hormonal Therapy Arimidex (anastrozole) Surgery Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "16/10/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/91/topics/825471",
    "Title": "Swelling from under collar bone ganzgirl2010 bevin"
  }]
}