{
  "AuthorID": "gapeach79",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210307/profile",
  "Posts": [
    {
      "AuthorID": "gapeach79",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210307/profile",
      "Content": "Jan 20, 2015 02:04AM gapeach79 wrote: I had an adenoma removed back in Feb 2005.  I was awake for the procedure, which terrified me and caused me some discomfort, but it wasn't that bad.  I've since had breast augmentation, which is a lot more painful. My procedure didn't take long.  They didn't put me to sleep (wish they had) which cut down on a lot of time.  I believe it may have taken around 45 mins.  Mine was located on the underside of my breast, slightly towards the center of my chest.  I was actually able to wear my bra home that day and every day thereafter. I only took that day off work, but I would think it would greatly depend on the type of work you do.  I was in slight pain for a few days, but it wasn't unbearable.  I have a slight scar from the procedure, but it didn't change the shape of my breast.  I also wouldn't think it would interfere with breast feeding unless the lump was directly in your nipple.  Let me know if you have any other questions/concerns.  Good luck!",
      "MessageIndex": 1,
      "PostDate": "20/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827695",
      "Title": "Fibroadenoma Surgery Questions? csousaa16 gapeach79"
    },
    {
      "AuthorID": "gapeach79",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210307/profile",
      "Content": "Jan 20, 2015 07:55PM gapeach79 wrote: I will pray for you that your surgery goes well and that everything is ok.  I think I may have been awake for my procedure because I didn't have insurance at the time and had to pay out of pocket.  I think I paid around $800, and if I would have been put under, it would have been like another $1500, which I just didn't have at the time. I've had numerous surgeries and having my adenoma removed was by far the easiest one, even if I did feel some pain and discomfort during the procedure.  The pain afterwards was rather minimal.",
      "MessageIndex": 4,
      "PostDate": "20/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827695",
      "Title": "Fibroadenoma Surgery Questions? csousaa16 gapeach79"
    },
    {
      "AuthorID": "gapeach79",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210307/profile",
      "Content": "Jan 23, 2015 11:37PM gapeach79 wrote: KimberlyAnn0218, Thank you for your response.  I've calmed myself somewhat since this morning.  At this point, I believe I will wait until I have my yearly exam and physical with my GYN this year (in May) and if things are still worrying me, I'll point them out to him.  I'm just very cautious when it comes to my body, after having an aunt die of breast cancer at 39, along with my other health issues I've had in the past, I always feel the need to know what I'm dealing with.  Thank you again.",
      "MessageIndex": 2,
      "PostDate": "23/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827818",
      "Title": "Mammogram Results Back, Not Sure How I Feel gapeach79 mathrules"
    },
    {
      "AuthorID": "gapeach79",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210307/profile",
      "Content": "gapeach79 wrote: Had my mammogram yesterday and got my results back this morning.  To summarize, BIRADS 2, increased density fibroglandular tissue 20% volume.  Noted that there were \"findings\" but appear to be benign. I don't want to say I'm not overacting, but I don't know how I feel about this.  One of the lumps is as hard as a rock and doesn't move.  The others feel flatter, denser, and no real discernible shape to them.  I honestly believe they are benign, but I'm not so sure about the other one. My mammogram was a baseline.  Would having a diagnostic mammogram be worth my time, or do I just hold out another year and hope for the best?  I'm trying to let this not bother me like it does, but honestly, it's eating at me.  I don't know what I should or even want to do at this point. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827818",
      "Title": "Mammogram Results Back, Not Sure How I Feel gapeach79 mathrules"
    },
    {
      "AuthorID": "gapeach79",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210307/profile",
      "Content": "Jan 21, 2015 08:09AM - edited Jan 21, 2015 08:09AM by gapeach79 Lee, how did your ultrasound go?",
      "MessageIndex": 9,
      "PostDate": "21/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827644",
      "Title": "Ultrasound Monday - What to ask, should I have pushed for MRI? LeeCope15 rrs"
    },
    {
      "AuthorID": "gapeach79",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210307/profile",
      "Content": "Jan 20, 2015 02:15PM gapeach79 wrote: Runnergirl29, I had a fibroadenoma removed when I was 25 (I'm 35 now).  The thing grew rapidly within a matter of about 4 months and scared me to death!  The surgery itself was quick, though I did experience a slight freak out (I was awake for the procedure) and some pain (It was down deeper than the dr thought).  Recovery was fast and I had no complications whatsoever.  I pray your doctor is correct.  Good luck!",
      "MessageIndex": 3,
      "PostDate": "20/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/827672",
      "Title": "Biopsy in early 20 or younger ... Any experiences? results? Runnergirl29 Runnergirl29"
    },
    {
      "AuthorID": "gapeach79",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210307/profile",
      "Content": "Jan 19, 2015 03:18PM gapeach79 wrote: Hi Ladies, Back in Oct. 2004, I discovered a lump in my left breast, about the size of a pea.  By Feb. 2005, it was the size of a pistachio still in its shell.  I was 25 at the time and very worried.  My aunt had been diagnosed with breast cancer at age 32, and after going into remission twice, she passed away at age 39.  After having a mammogram and ultrasound, it was determined I had a fibroadenoma.  The decision was made to remove it, mainly because it was still growing and it was located underneath my breast, right where my bra would rub up against it. The surgery itself was petrifying.  I was awake for it, as they used a local anesthetic.  I started crying during the procedure because the feeling of someone cutting into me made me sick.  Furthermore, the adenoma was deeper than the doctor thought, so I was hit with a burning sensation like no other.  After it was removed, the doctor showed me the mass.  Much to my surprise, it actually looked like a pistachio still in its shell. I was relived that I didn't have cancer, but I can tell you firsthand how important it is to get things such as lumps and other symptoms checked out.  They're mostly benign, but never take a chance or dismiss your symptoms.  It truly is better to be safe than sorry.  Also, if you have a doctor who dismisses your concerns, find a different doctor.  A caring and understanding doctor should listen to your concerns and be supportive.",
      "MessageIndex": 2,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827626",
      "Title": "Fibrocystic adenoma questions? sophie23 gapeach79"
    }
  ]
}