{
  "AuthorID": "garbovits",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85479/profile",
  "Posts": [
    {
      "AuthorID": "garbovits",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85479/profile",
      "Content": "garbovits wrote: My 32 years daughter have breast cancer, receptor positive, HER2, invasive ducktail carcinoma, with metastases in her ribs, back, hip, leg and knee. She is the mother of a 10 month daughter and a 4 year old son. She was diagnose beginning May, have had a hip replacement and started Chemo (Vinorelbine) and Herceptin treatment. She is having chemo once every week and Herceptin every 3 weeks, followed by on weeks rest. I have moved to live close by, so I can help her with the kids, and be with her when she go to hospital to get treatments. My problem is that I don't know what to expect for the coming future.We know that she is conical ill, with no hope for a cure. But is there anyone on this chat side there have been in the same situation, who can tell me what to expect, and what I can do so I can be the best help for her. Thanks, Lisbeth Dx 5/7/2009, DCIS, 1cm, Stage IV, Grade 3, mets, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736257",
      "Title": "Help to help my daughter garbovits AnneN"
    },
    {
      "AuthorID": "garbovits",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85479/profile",
      "Content": "Jun 21, 2009 10:55AM garbovits wrote: Dear Elaine.  Thank you for your sweet letter. Yes, you are right we have to take on day at the time. We are waiting for her first scan in August, to se if the treatment that she get have any effect on her mets.  Lisbeth",
      "MessageIndex": 3,
      "PostDate": "21/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736257",
      "Title": "Help to help my daughter garbovits AnneN"
    }
  ]
}