{
  "AuthorID": "gaspasser",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223427/profile",
  "Posts": [
    {
      "AuthorID": "gaspasser",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223427/profile",
      "Content": "Aug 13, 2018 12:45PM - edited Aug 13, 2018 12:45PM by gaspasser Hi, I'm so sorry you are having this pain. I had a BMX TE in end 2015. Since then I've had a pesky postop infection following exchange to my implants and have required numerous wound debridements and now a wound vac on my one side of chest (the other implant is fine, never had infection). The first year following BMX I had a significant amount of nerve pain on the one side. Also very frequent chest wall muscle spasms. I did take valium postop and through the expansion process. I also ended up with PT which seemed to help some of the under arm nerve pain. After about a year much of the nerve pain improved. I did feel the odd trickle feeling down my chest almost like a let down feeling after breast feeding for about 18 months post BMX. At about 18 mon to 2 yrs that went away. I do have some nerve pain still, but if it gives you hope I feel the nerve pain continued to improve up until 2 yrs post and I am feeling better than I did postop. Stretching helped some, exercising what I was able to, but also just the passage of time. Keeping my fingers crossed for you all, Sara (gaspasser)",
      "MessageIndex": 76,
      "PostDate": "13/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860079",
      "Title": "Hypersensitive skin/nerves after mastectomy az2017 Silverpullet"
    },
    {
      "AuthorID": "gaspasser",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223427/profile",
      "Content": "Aug 13, 2018 04:37AM gaspasser wrote: Hi, After my BMX TE it was about 10 lb limit for awhile. One thing I found very helpful when I needed surgery for a wound vac placement recently was using the Shipt service for groceries near me. I'm not sure if there is anything similar near you? The person shops and delivers groceries. You can tip the shopper, but it is up to you and delivery is free if the total is above $35 I think? They even carry them up into your house which would include steps in your case. Target also has the Shipt service. I'm not sure where you live and what is available. It might be one less stress for produce etx.for first couple weeks until you are up and about a bit more? Best of luck and keep us posted! Gaspasser (Sara)",
      "MessageIndex": 12,
      "PostDate": "13/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866532",
      "Title": "After surgery what can you carry?how heavy Jadedjo jenndenino578"
    },
    {
      "AuthorID": "gaspasser",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223427/profile",
      "Content": "Aug 13, 2018 06:52AM gaspasser wrote: Warrior2018 I love that list. Thank you! I'm vegetarian and trying to pack on the protein as well. It's great! I was told 1.5 gm times your weight in kg. So I'm 58kg so 58 times 1.5. I think everyone has slightly different recommendations. Best of luck! Gaspasser (sara)",
      "MessageIndex": 14,
      "PostDate": "13/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866427",
      "Title": "PS instructions to eat 30 extra grams protein Ashweb901 gaspasser"
    }
  ]
}