{
  "AuthorID": "Gator65",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
  "Posts": [
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Nov 24, 2011 01:18PM Gator65 wrote: darlam - When it rains it pours! My hubby had a physical and now he needs a consult with a cardiologist. Something in his EKG did not look good to his doc. Yippee!  Happy Turkey Day everyone! ",
      "MessageIndex": 68,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Nov 29, 2011 02:48PM Gator65 wrote: Thank you Tammie & a hug back at cha, My oncologists office just called to confirm my appt on Thursday at 1:15 and now I am really freaking out.  I know this is stupid but I cannot seem to help myself. ",
      "MessageIndex": 103,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 11, 2011 08:51AM Gator65 wrote: Since we are talking ages here, I am an old bat at 46. lol. Today is Day 11, feel pretty good other than the tongue still hurts and it is hard to swallow, much less open my mouth to talk. If any of you are familiar with the Real Housewives of Beverly Hills, I seem to be talking like Taylor Armstrong, the one with the exaggerated botox lips. It is definitely weird. My DH is like why are you talking like that? I am like chemo side effect?  I don;t know, not doing it on purpose for laughs. lol My other complaint is that my body aches and I am tired, oh well. Feel better ladies! My good friend is taking me to see the Transiberian (sp?) Ochestra today. I hope I don't sleep through it. LOL.",
      "MessageIndex": 338,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 17, 2011 08:49AM - edited Dec 17, 2011 08:50AM by Gator65 Good morning, The nausea train is rolling through my house. Day 2 of Tx 2 and I feel awful. I am piggybacking zofran and compazine and it is not touching it, Was not able to get any Emend this time. GD insurance company. My hair is starting to come out and I feel so sad. I know it it just hair and it will grow back, but it just makes me so sad. I feel very achey today as well. I have so much to get done and I just don't think that I can do it. I hate being weak. I am not a crier and all I have done today is cry. Cancer sucks! I hate that we are all going through this.  Peacock, my mouth was better around day 11. ",
      "MessageIndex": 486,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Jan 4, 2012 11:25PM Gator65 wrote: Hi ladies, I am finally back from chemo hell. Today is the first day that I have been able to get out of bed or off the couch. This was tx 3 and it was awful. The nausea is relentless with 4 different meds and I am piggybacking them every 3 hours. Thank god for Ativan. It knocks me out so I am getting a little bit of rest. I had a weird reaction while doing the AC. In the last 15 minutes or so, I became very itchy and they gave me benadryl but it did not stop the itching, very weird.  I am so sick of being sick!!! I lost it on the phone to my sister last night. I am usually so strong but I swear I don't think that I can do this anymore. I hate this shit and I want to give up. Somebody talk me off the ledge!!  For the ones doing tx this week, my thoughts are with you. ",
      "MessageIndex": 732,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Jan 13, 2012 04:12AM Gator65 wrote: Hello all! I have been reading, just too tired and sick to post. LOL! Was supposed to have my 4th AC yesterday, but was too sick to get it. I wound up getting IV fluids from being dehydrated and IV anti nausea because I had been barfing all morning. I had the bright idea to have tacos for my \"last supper\" and that was a huge mistake. I will be going in today at 2:30 to try again. I am so mad at my insurance company. I finally get them to approve the Emend and I find out that it will be a $150 copay. I guess I will just keep throwing up bevause Zofrana and compazine are not cutting it. Here is the weird thing for me as far as the hair, I shaved my head about a month agao and I have already got hair growing back. It is blond and fuzzy mixed in with stubble that did not fall out. Weird! I have not had to shave my legs or underarms since my last treatment on Dec 28th so that is pretty good. The SE that pisses me off the most besides nausea is the runny eyes and nose. I always look like I am crying. Anyone else dealing with that? I just pray that this last AC won't suck as bad as #3. The good news is that I will be moving on to Taxol after this last AC treatment. I thought I had 4 more AC's. Hallelujah!! My understanding is that Taxol isn't so much nausea. I feel so awful for everyone that has to deal with these SE. I hope it gets better soon for ya'll.",
      "MessageIndex": 808,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Jan 26, 2012 11:47AM Gator65 wrote: Mardibra - I am in the chair as we type. Good luck! I am so jacked up on o. These steroids it is crazy. I am just getting the premeds right now.",
      "MessageIndex": 949,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Feb 3, 2012 09:54PM Gator65 wrote: Hey ya'll. I finally feel somewhat normal again. Taxol sucks more than AC, just sayin. I have been down all week with pain like you would not believe. Between the hot flashes and sweating, unbelievable pain and mouth sores and thrush, I just wanted to jump off a bridge. I was not sure if it SE or getting sick. My DH took me to the MO today and guess what?  I am allergic to the toxicity of taxol. Ha Ha Ha! They are going to decrease my next Taxol by 20% to see if that helps. I now have Dilaudid for pain that does not seem to work either, but then again I am down to mild achey. I can deal with this. The mouth sores/throat is unreal. It is like shards of glass. I have 2 things for that, BTW, I lost 16 lbs in a week not being able to eat. Jeeze!  I hope everyone has a good weekend! Hugs to all!!",
      "MessageIndex": 1048,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Feb 7, 2012 11:42AM Gator65 wrote: Hey ya'll! I am feeling a lot better. I am so tired though. I go for #2 on Thursday. I hope the smaller dose will help so it not so bad this time. So happy for the ones who have finished! Yea!!! I will be in the chair this Thursday too so it will be 2 down and 2 to go. I hope everyone has a great day!! Laura, so glad you are feeling better. See ya'll later!! ",
      "MessageIndex": 1078,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Feb 21, 2012 12:28AM Gator65 wrote: Gracie, I hope you it won't be too bad for you. You will be in my prayers. Looking at your signature line, we were diagnosed 5 days apart and had surgery on the same day! What a coinkydink!! Thank you markat, hope all is well with you. rachel - I know it sucks. I can so relate to the mind wandering \"chemo brain\". My fingertips are a little numb, it is my feet that bother me more. I am usually tired as hell, but I am hopped up on steroids so I feel like I could conquer the world right now. It is 1:21 am and I have to get ready for work at 5:30 am. LOL tomorrow is going to suck!  Kellogs - I know, right? I don't need anymore \"presents\" lol Dougieswife - I am so lealous of your sleep number bed! I would love to get a new mattress but that just is not in the cards... :(  I am going to try and rest for a few. Good night my friends!  ",
      "MessageIndex": 1186,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Oct 2, 2011 08:42AM Gator65 wrote: I was offically diagnosed on the 29th as well. I am still in shock. I am 46 and I found a lump and had a mammogram and ultrasound.  The mammogram came back with 2 masses on my left breast and met with breast surgeon. She did 2 core biopsies which came back IDC Triple Negative. Yippee! She was awesome, I must say. She wrote everything down for me and my husband. I am glad for that because I stopped lsitening after she said cancer.  I have to get a MRI and Pet Scan next week and I guess we will go from there depending upon the size of the tumors and if they are one big tumor or 2 seperate entities. I will have surgery and chemo, just not sure in what order. I never expected this at all because breast cancer does not run in my family at all. I am trying very hard to be strong because I have a 1 yr old granddaughter. My daughters are 23 and 18. I just sent my baby off to college. I will get through this. I am scared but I am determined.",
      "MessageIndex": 6,
      "PostDate": "02/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/775711",
      "Title": "Diagnosed yesterday HSMOM2011 elimar"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Jan 25, 2012 07:45PM Gator65 wrote: Mardibra - me too! I am nervous as hell! ",
      "MessageIndex": 938,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Jan 27, 2012 10:56PM Gator65 wrote: Apparantly not. OMG! It hurt like helll!!!! LOL",
      "MessageIndex": 973,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Feb 19, 2012 09:29PM Gator65 wrote: Thank you ladies. I really appreciate it. I really rely on this board to not feel alone. Mardibra, I know how you feel. My heart goes out to you. If you experience anything like I do, it is hell. I hope this rhuematologist can help me. I am about to lose my mind. LOL The nail on my big toe on my right foot has lifted and is infected. Fun fun. Why me?",
      "MessageIndex": 1177,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 2, 2011 06:27AM Gator65 wrote: Had my first treatment of AC yesterday as well. It was not nearly as bad as I thought. Pretty much the same story as Mardibra, except they had me take emend 30 min before treatment and then I got Ativan by IV, The A came in syringes and then the C was by IV bag, I had the funky taste in my mouth as well and felt a little queazy on the ride home.  It was kinda nice  that the were 4 newbies in there yesterday. There was one lady who pretty much had the exact same dx as me down to being triple negative. We even have 2 of the same docs! Small world, huh? I hope that I will see her again to tell her about our litttle group here. I got home and pretty much slept 12 hours off and on. I feel queazy but not too bad. Just took another Zolfran and I have Emend as well. I have decided to work at home today because I don't want to drive until I kow how all these meds will afffect me. Go back to my MO's office today for the Nueslasta shot at 4:15. I will taking the Claritan cocktail beforehand. LOL! My next tx is scheduled for 12/15. Yippee! As a side note, I got my wig yesterday. At first I did not like it, but as she cut it to my particular hairstyle  I began to like it. The funny part is that when she cut the bangs, both me and my BFF Lisa said, \"Maybe we should have the bangs a little shorter so we have to come back in a few weeks because of how fast your hair grows.\"  Then we both realized that it is a wig, the hair is never gonna!  I swear sometimes it is like \"Dumb and Dumber go to the \"insert whatever medical office that we are at\". LOL Have a great day everyone! ",
      "MessageIndex": 149,
      "PostDate": "02/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 4, 2011 07:50AM Gator65 wrote: Hey Peacock, got you by one year. I am 46. have 7 more of AC then 4 T. If I can do this, you can do this. It is not as bad as my imagination thougjht that it would be. My MO told me to have anyone close to me get flu shots, so that is what I did. So far, so good. ",
      "MessageIndex": 191,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 6, 2011 07:20AM Gator65 wrote: Darlam - I know exactly how you feel. I am in the same boat. I have 3 different nausea meds and nothing makes it stop. To top it off, I have gone from constipation to the runs. This sucks!!!! I am so tired that I can barely hold my head up. I am working from home at least. It has to get better, right????   ",
      "MessageIndex": 232,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 20, 2011 08:01PM Gator65 wrote: Hi ladies!, I am on day 6 of treatment 2 and life is not sucking too bad right now. I buzzed my hair off tonight. My hubby held my hand and I only cried a little. I look so weird! Overweight GI Jane with gray hair on the sides. I am only 46 and the sides of my hair is pretty much gray!! I am so bummed. I do not kow whether to rock the bald or wear my wig.  ?? I had a good dinner with him afterwards and I feel pretty decent. I hope I can go to work tomorrow. I am so far behind it is ridiculous! I can so relate to being overwhelmed. I understand how you feel and I want mine back too!!",
      "MessageIndex": 551,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Jan 20, 2012 09:50PM Gator65 wrote: Thanks ladies. I appreciate the support because my family just doesn't understand. They all tell me buck up. I just want to strangle them sometmes!!  I never connected the restless legs/twitchy feeling to the nuelasta. I thought I really did not have any SE from it.  Wow! I start Taxol on the 28th. Yippee! The steroids scare me. Oh well. I hope everyone has a good, minimal SE weekend! ",
      "MessageIndex": 898,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Jan 26, 2012 11:49AM Gator65 wrote: Thanks for all the advice and positivity.. I really appreciate it. Thank jyou again ladies!",
      "MessageIndex": 950,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Jan 29, 2012 05:23AM Gator65 wrote: It is amazing to me how things change so quickly. OMG, the pain is unreal!!! I think I would rather puke on AC than deal with this pain!!!! I cannot find my leftover Vicodin from surgery, so I have Tylenol. Oh joy!! To add insult to injury, I now have mouth sores,m sore throat and painful gas to go along with this. Yea!!! The softball games went very well. They won 2 out of 3. She played swesome. I am going to try and go back for the last 2 games today. But I am not sure..... Take care my friends. ",
      "MessageIndex": 988,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Nov 29, 2011 12:03AM Gator65 wrote: Hey ladies! The DH has a stress test on 12/9 so we shall soon find out what the deal is. Maybe I am just crazy, but I have been queazy all weekend through today. I guess my tummy is preparing to be sick. LOL!  Jeeze I am scared!! I just want to get this over with!!  I think once we get the first dose and know what to expect, it will be okay, right?? God I hope so...... ",
      "MessageIndex": 101,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 2, 2011 10:03AM Gator65 wrote: Mardibra, I just took the claritan. I am getting the shot this afternoon. I also feel very queazy. I have had a Zolfran and an Emend. I feel like puking as we speak.  gatorade is my best friend right now. ",
      "MessageIndex": 154,
      "PostDate": "02/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 4, 2011 07:46AM Gator65 wrote: markat - 2 things, Don'y worry about your big ole' head because I jhave a big ole pumpkin head and I am prouf of it. LOL! I had to custom order my wig too. Most of the turbans, etc. look wird on me, so my MIL knitted me some caps. We can unite in our big headedness! :) I would call your doc about the steri strips & the cream. I wiould think that the strips would need to be off for the cream to numb the skin. Trust me, you want numb skin. As far as hair shaving party, I am not having one, When it starts to go, the place where I got my wig will buzz it and then they give a massage. How cool is that? I really don't feel all that bad. Yesterday, I went to a \"Tough Mudder\" competition to watch a good friend who I call fire jumping super girl compete. It is a 12 mi. course fill with mud and had over 20 obstacles. She had to jump through fire, climb 20 ft walls, crawl through a pipe in the mud. She is tough!!  Well, I had to walk about 3 miles total to see this feat and I am glad I did.   ",
      "MessageIndex": 190,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 5, 2011 08:15AM Gator65 wrote: I will try the biotene. If if were not for the nausea, I would be fine. I have Moran and I am piggybacking it with compazine. I an getting nowhere. Argh!",
      "MessageIndex": 215,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 10, 2011 09:00AM Gator65 wrote: Julie, you nailed it. My tongue hurts and it is kinda hard to swallow. The side effects are crazy aren't they? I have not had any hair fall out yet, but it is super dry and my scalp feels tight. I will buy the biotene and see what happens. The thought of gargling with baking soda makes me gag. :) Susan, I know just how you feel. The thought of losing my hair makes me very sad, but once it starts falling, I will shave it.  Seacret, I understand about the potential for heart problems with this stuff. My MO made me get an ultrasound of my heart before we started to have a baseline. Heart disease is the big problem in my geneology. I am the first to get BC as far as I know. I hope everyone has a wonderful SE free day! ",
      "MessageIndex": 330,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Jan 14, 2012 12:31AM Gator65 wrote: Well, I survived AC #4, let the games begin! I am jacked from the Decadron, I cannot sleep and I am tired as hell. I have some nausea but it is not too bad at the moment. I am trying out a another nausea med, Kytril. It was a freaking ordeal to get my insurance company to approve it, but I have it. We shall see, I cannot deal with the nausea that I had last time. Gracie - I will ask my onc about this when I go next.  Thank you very much. Bailey - I completely understand how you feel. I hate my wig and I will not wear it because it just looks whacked. My hairstylist has styled it bueatifully, but I just can't do it. I am rocking scarves and a few hats. I learned to tie a scarf that I got from Target. It looked pretty good.   Rachelvk - I don't really taste food either, but my sense of smell has become very keen. Not digging that too much. Everything is magnified 100 times and most smells make me gag. Christine - feel better soon. I have Zantac 150 and I take it everyday. It seems to help although my stomach is on fire as I type. I guess from today's treatment?? I am going to watch some TV and pray that I can fall asleep!  :) ",
      "MessageIndex": 820,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Jan 27, 2012 10:31PM Gator65 wrote: I am doing okay. I woke up today feeling good. Got my nueslata shot today and it hurt like hell. It burned and it has never burned before. IDK. I actually went to see a movie tonight with my girlfriends and had dessert afterwards. I have a little heartburn from the trio of desserts I hogged down, but I feel pretty good. I am going to Clearwater tomorrow to watch my baby girl play in her first college softball tournament. She has a full athletic scholarship to college and is doing very well in the classroom and on the field. I can't wait! I am so excited!! I hope everyone else does well this weekend!! :)",
      "MessageIndex": 971,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Jan 30, 2012 05:52AM Gator65 wrote: I am on DD of Taxol. OMG!!!!! The pain is unbelievable. I am calling my MO today. I found my leftover vicodin and it does not help at all. I barely slept last night at all. ",
      "MessageIndex": 1000,
      "PostDate": "30/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Feb 9, 2012 06:31AM Gator65 wrote: Taxol #2 today. I hope and pray that it does not suck like #1 did.   I have a rash on my shoulders and my back too. Benadryl makes me hyper not sleepy, so I am afraid to take it with the steroilds cause I willl really be bouncing off the walls then. lol  Let's kick cancer's ass today!  ",
      "MessageIndex": 1097,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Feb 20, 2012 07:35PM Gator65 wrote: That is what I keep telling myself. 2 more and I will be done.  More torture on Thursday....... then I will have 1 left. hallelujah!! ",
      "MessageIndex": 1183,
      "PostDate": "20/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Nov 14, 2011 10:12PM Gator65 wrote: Hi, I am new here. I had surgery on October 18, a partial mastectomy with oncoplasty and a simultaneous breast reduction. I also had a sentinel node biopsy and they put in my port as well.  I should be starting chemo this week but I has a few setbacks, shingles and an allergic reaction to Vitamin E. I see my oncologist on Wednesday so I guess I will get my new start date then. I know I will be having 8 doses of AC and then 4 of Taxol. I am not looking forward to this at all, like anyone ever does. I handled the surgery well, but I am so scared of chemo. Losing my hair  along with all the other side effects just plain freaks me out. I guess I will know soon enough. Thanks for listening.....",
      "MessageIndex": 13,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 4, 2011 06:14PM Gator65 wrote: Question, are the mouth sores like canker sores? The top of my gumline feels sore and I feel someting like a canker sore starting. Lucky me!",
      "MessageIndex": 199,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 24, 2011 09:14AM Gator65 wrote: Hi Ladies, Yesterday was my big meltdown day. I feel so ugly. My scalp is so tender that I cannot wear the wig and the scarves/hats hurt as well. I cannot sleep worth a damn cause what is left of my porcupine hair pokes me.  My skin has no color and my lips looks bloodless, I put makeup on and I look like a clown. I cannot win. I realize this is temporary, but it really sucks!!!!!",
      "MessageIndex": 612,
      "PostDate": "24/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 26, 2011 08:49AM Gator65 wrote: Woke up very nauseated and with a sore throat. My toungue hurts again, This is day 11 post tx 2?? Every day is something new. Next tx is Thursday, the 29th. Some Happy New Year, huh?  LOL Christmas very very nice. Had a good time with all. Just feel like crap today so I will work from home.  Have a great day ladies!",
      "MessageIndex": 621,
      "PostDate": "26/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Jan 19, 2012 11:11PM Gator65 wrote: This last AC was super sucky. It has been 7 days and I have finally returned to the land of the living. Still feel like garbage thougjh. I can get out of bed at least. I pray that Taxol is easier. I swear, I just want to quit. ",
      "MessageIndex": 883,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Jan 26, 2012 11:04PM Gator65 wrote: Hi ya'll. It was not as bad as I thought it would be. Appt was at 10:30. I am hyper as hell from the steroids and benedryl. No far no nausea to speak of. I have my shot at 4:30 tomorow.",
      "MessageIndex": 963,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Jan 29, 2012 06:36AM Gator65 wrote: Thank you mom. I did take the claritin. This is unreal!",
      "MessageIndex": 990,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Feb 9, 2012 11:17PM Gator65 wrote: Congratulations to Bailey and Kellogs. I am so happy for you both!! I did okay today. MO dropped my Taxol dose by 20% and my nuelasta shot from a 6 to a 4 in order to combat the SE. I am allergic to the toxicity of Taxol. Isn't that ironic??I have dilaudid as well for the pain, but it was useless. I guess I have a high tolerance for meds because I am allergic to just about everything. Lashes and brows are just about gone. I am so pale, I look like Casper. I have chemopause as well, the hot flashes are the worst! Herre is to a SE free wwkend! ",
      "MessageIndex": 1119,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Feb 18, 2012 05:15AM Gator65 wrote: I have not been on much lately because I am just so bummed. I feel like the I am the poster child for bad SE of chemo. :( They dropped my DD of Taxol by 20% and cut my Nuelasta shot down as well at my last treatment which was on last Thursday and I still had nothing but problems. The pain is unreal! I feel like someone is trying to rip my bones apart, To make things even more fun, none of the painkillers work. Dilaudid doesn't work and that is pretty strong. It really pisses me off that I have to suffer because nothing works! My MO's PA calls me on Wednesday and says that my bloodwork shows that I have an increased level of something that indicates rhuematoid arthritis. REALLY? That may be why I have so much pain. They are referring me to a rhuematologist, Still waiting for that doc to call. MO wants me to take steroids daily now, thinks that will help with pain. I hate the steroids but I will try and see. I am just so mad. I was a pretty healthy person before all this bullshit started and now I am falling apart. I am 46 years old and I feel like I am 80, I have the hand, foot, mouth thing from the Taxol. My skin is just cracked and peeling off my hands and arms. I cannot decscribe how gross this is. My feet are peeling and my big toe on my right foot hurts like hell. The nail is not coming off, but it hurts. Why?? I do not know. I walk like I am 80 and need a cane.  I am so tired of this. I have 2 treatments to go but I don't know if I can survive them.  I cannot seem to stop crying as I type this. Cancer sucks!!!!!!!!! For those who finished this week, Congratulations!  For those who had a tx, I pray for a SE free weekend.  DJ ",
      "MessageIndex": 1168,
      "PostDate": "18/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Nov 19, 2011 09:45PM Gator65 wrote: Got my start date of Dec. 1st. I went ahead and cut my hair super short and I kinda like it. Picked out a wig so we shall see. Turbans and head scarves look ridiculous on my big ole pumpkin head si I guess I will rock hats....  I plan to eat, drink and be merry over Thanksgiving! How about ya'll?? ",
      "MessageIndex": 30,
      "PostDate": "19/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Nov 21, 2011 08:29PM Gator65 wrote: I will be working as well. Chemo on Thursdays, Fridays I can work from home. My job has been very good to me so far. I hope that continues, lol!",
      "MessageIndex": 50,
      "PostDate": "21/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Nov 26, 2011 11:07AM Gator65 wrote: Mardibra & Darlam - I start Thursday, Dec 1st as well. 8 doses of AC followed by 4 doses of Taxol. I don't know about ya'll but I am freaked out. My biggest fear is throwing up. I am not a good puker, I bust all the blood vessels in my face and it looks like someone hit me with a baseball bat. I know I will have these anti nausea meds and all, but it still gives me willies. Tammie, I feel for you. I hope the nausea goes away soon. Hugs to you. Thanks ladies for the support on my hubby, I appreciate it. If it is not one thing, then it is another, LOL! ",
      "MessageIndex": 78,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 2, 2011 06:10PM Gator65 wrote: Mardibra - I have compazine as well. I hear what you are saying about the Emend. What happened to me is that when I turned in my script for Zolfran on Wednesday night, I was unaware that my insurance company requires my MO to fill out a 2 part authorization form for a) use and b) quantity. The pharmacist gave me 4 pills to get through yesterday and today of which I am very grateful.  Here is the kicker, I get my neulasta shot at 4:15pm and they tell me everything has been straightened out about the Zolfran. I call my pharmacy, no it hasn't. :(  The really nice pharmacist advances 12 pills to get through the weekend.  What a blessing! Thought that getting the neulasta shot in the stomach was interesting. They also told me today to check and see if my insurance company will let me give it to myself at home since I drive almost an hour each way and I was there for like 10 minutes. I still feel like crap, but I can manage. gatorade and crackers, dinner of champions....... :) Honestly,  I was scared out of mind yesterday. My BP was like 160/90 because I was so scared. I kinda feel ridiculous now. It was nowhere as bad as I thought is was going to be. I had visions of it burning like lye when it goes in. It was really not the big deal that my mind made it out to be. Like darlam says, 1 down and 11 to go! Talk to you soon ladies! ",
      "MessageIndex": 160,
      "PostDate": "02/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 3, 2011 07:08AM Gator65 wrote: For the ones that young children my heart truly breaks for you.  I cannot imagine doing this and having young children. My girls are about the same age as Kelloggs, they are 23 and 18. The 18 yr old is in college on a full athletic scholarship playing softball. Thank god she has zero time to sit and worry. LOL Her sister does it for her, :) Well, this is day 3 and I feel blech. I still have nausea, but it is not too bad. Other than that, I am okay. The thought of food makes me want to hurl, though. I think that my chemo weight loss plan may have some merit, hahahahaha ",
      "MessageIndex": 168,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 8, 2011 11:09AM Gator65 wrote: Hi Ladies! I finally feel decent today, minimal nausea, just very tired. I am writing from my desk at work where I am freezing my butt off. Have a great day ladies!",
      "MessageIndex": 275,
      "PostDate": "08/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 9, 2011 08:17PM Gator65 wrote: Hi Ladies! I see some new girls. Hope everyone is well. Day 8 and I feel pretty good. No nausea, just tired as hell. Is anyone else have issues with like jaw pain or canker sores? That is my only complaint other than my skin feels tight. I just feel weird. Nest treatment is next Thursday, Yeehaw!!! Hope everyone has a great weekend. To those who started this week, I pray the SE ease up for ya'll.",
      "MessageIndex": 323,
      "PostDate": "09/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 11, 2011 11:04AM Gator65 wrote: I just wore a v neck t shirt and a zip up hoodie. They did the same as mardibra",
      "MessageIndex": 349,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "Gator65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137087/profile",
      "Content": "Dec 16, 2011 06:49AM Gator65 wrote: Hi ladies! I have really been working hard this last week so I can take today - Saturday off for chemo recovery. I had my second AC treatment yesterday. Pretty uneventful, although I was feeling very queasy by the time I got home. Met some really interesting folks in the treatment room. I am very tired and just trying to stay ahead of the nausea which is not too bad at this point. I would like to report my chemo diet seems to be working as I have lost 13 lbs. The days that I feel good, I eat pretty well. LOL I have still not lost any hair, which I think is very strange as those of you who started at the same time as me are having shaving parties this weekend. I guess it will go when it goes. I hope everyone has a great weekend. Here is to minimal side effects!  ",
      "MessageIndex": 476,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    }
  ]
}