{
  "AuthorID": "gb2115",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
  "Posts": [
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 10, 2018 10:26AM gb2115 wrote: Mine knew right away. They knew I was going in for the mammogram and then the biopsy. And then I got the call with the bad news at work during lunch. I'm terrible at hiding things so it was easier for me to have everyone know what was going on. We are a small work environment and we are all pretty much friends (like we'd be friends outside of work). Everyone has been great.",
      "MessageIndex": 5,
      "PostDate": "10/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/861498",
      "Title": "Telling friends at work about your diagnosis Axolotl sswp"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 23, 2017 04:27PM gb2115 wrote: Get it checked, but honestly, because it's on both sides it sounds like something hormonal... our bodies can be so weird!!",
      "MessageIndex": 5,
      "PostDate": "23/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856337",
      "Title": "Let Down Feeling...Not pregnant! HELP! BDW DKim"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 8, 2018 02:02AM gb2115 wrote: Have to jump in here that mastectomy does not at all remove the need for hormone therapy. Hormone therapy is preventative for metastatic spread, which would be super bad to have happen. Because of my age I take tamoxifen, and have been on it for 1 year with tolerable side effects. I'm thankful every day for a pill to take to lesser the chances of this stuff showing up in my bones someday. You will read horror stories on the internet (you can find a horror story about everything and something to fear about everything in life). I recommend taking all of that with a grain of salt (unhappy people are more likely to share their stories---which is why I like to come on here and say that it's been ok taking the meds), try it, and if it doesn't work out, then she can discuss stopping. But most people really do fine on these drugs. Sorry about your wife's diagnosis. Hope the surgeon's visit goes well!",
      "MessageIndex": 5,
      "PostDate": "08/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/863037",
      "Title": "Wife = Er+ Pr+ Her2- Options besides hormone therapy? jabberwocky57 Jons_girl"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 8, 2018 04:08PM gb2115 wrote: I think tamoxifen can. In my experience anyway they are not touching anything in there, I am just taking the pills. I am 39 and very much premenopausal. That said my OB made an off hand remark about if she \"gets an excuse she will take it all out.\". I didn't ask her to explain at the time because I knew my MO is following standard of care and I am comfortable with that.",
      "MessageIndex": 9,
      "PostDate": "08/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/863037",
      "Title": "Wife = Er+ Pr+ Her2- Options besides hormone therapy? jabberwocky57 Jons_girl"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 17, 2018 02:43AM gb2115 wrote: It sounds like you need to nap a whole lot!!!",
      "MessageIndex": 2,
      "PostDate": "17/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865932",
      "Title": "How can I start feeling better???? GreenEyes81 GreenEyes81"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 26, 2018 03:19AM gb2115 wrote: In my experience they do regular clinical breast exams, yearly mammogram, and see if any symptoms pop up. My oncologist said they don't do routine scans anymore unless there are specific symptoms that need to be checked out.",
      "MessageIndex": 1,
      "PostDate": "26/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866178",
      "Title": "Treatment after it's all over Deamo1 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 26, 2018 09:31AM gb2115 wrote: You might not even get blood work. My oncologist doesn't do any.",
      "MessageIndex": 10,
      "PostDate": "26/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866178",
      "Title": "Treatment after it's all over Deamo1 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 7, 2019 12:15PM gb2115 wrote: I had a boost to the scar area. They said most recurrence (local) happens there which is why the do extra. It wasn't harsher radiation, just a few more treatments just to that spot. It didn't cause me any extra trouble.",
      "MessageIndex": 9,
      "PostDate": "07/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870873",
      "Title": "Did you have Boost at end of radiation jessie123 dl1129"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 7, 2019 12:16PM gb2115 wrote: Oh and I think my margin to the chest wall was 0.9 mm.",
      "MessageIndex": 10,
      "PostDate": "07/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870873",
      "Title": "Did you have Boost at end of radiation jessie123 dl1129"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 19, 2017 12:35PM gb2115 wrote: Seriously don't beat yourself up. It does no good. Without knowing 100% what \"caused\" your cancer (impossible to figure out), there is no way to know if you did anything wrong to cause it. And until they figure out what causes breast cancer, there's not a lot anyone can do to avoid it. They are obviously not close to figuring it out, because \"healthy\" people continue to be blindsided by cancer--so clearly lifestyle choices do not give us ultimate control. Also, there is disease in our world---eventually everyone's body is going to have some sort of problem. You live long enough, it will happen. This really can't be avoided. So, if you don't want to drive yourself completely crazy, you might start trying to think along the lines of \"it is what it is\" and just do your best to take care of yourself. ",
      "MessageIndex": 6,
      "PostDate": "19/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/857105",
      "Title": "Childless athlete from a healthy family got BC at 65 bigsky2 Racy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 9, 2019 05:42PM gb2115 wrote: I think if your skin is completely (like completely) healed, swimming would be ok, but if it's still healing where you could pick up infection, maybe not the best idea. I would cover up the area when in the sun. They sell sun protective clothing. My RO said to always cover the area, she said the treated area has had it's \"lifetime radiation dose,\" so no sun. :-(",
      "MessageIndex": 6,
      "PostDate": "09/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870911",
      "Title": "Vacation after Radiation Therapy skirts keywestfan"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Sep 15, 2017 06:52AM gb2115 wrote: I guess what it comes down to is your wife needs to decide what level of risk is worth it to her. I had a lumpectomy plus a positive lymph node, so there was really no avoiding radiation for me. 7 months out I have some shoulder stiffness and pain coming from the lymph node area near the shoulder that they radiated, that comes and goes (mild, not enough to medicate). There was dermatitis during treatment, for sure. Skin problems are common but they usually heal. Mine did and required dermatological care. But it healed. However, that said, having already experienced radiation I would do it all again in a heartbeat if it meant improving the likelihood of the cancer not returning--especially with that positive lymph node. For me, having been through cancer once already, it's recurrence would be my worst case scenario and one I would like to do anything to avoid. So I deal with the shoulder pain. I think it was worth it, but that's my opinion from my experience. Good luck---it's hard enough to be going through cancer let alone having to be forced to make treatment decisions without being able to see the future! ",
      "MessageIndex": 4,
      "PostDate": "15/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/858622",
      "Title": "Radiation therapy or not random_monkey marijen"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 11, 2019 03:14AM gb2115 wrote: My breasts don't react to hormonal changes anymore....and I am definitely still premenopausal. But come to think of it, they really haven't since I had my child. Huh...",
      "MessageIndex": 1,
      "PostDate": "11/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870945",
      "Title": "Radiated Breast Still Sensitive to Cyclical Changes? kec1972 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 27, 2019 12:35PM gb2115 wrote: I would put money on it being probably because of the lymph node. I didn't have those tests until after surgery, when they found a positive lymph node. Before surgery they thought the lymph nodes were fine---surprise! They just want to be sure it didn't travel anywhere else. It's hard waiting on those test results, but she will get through it.",
      "MessageIndex": 4,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/870657",
      "Title": "Doctor wants CT/Bone scan before 1st oncologist/surgeon meeting? dadof3ohio kber"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 7, 2018 06:56AM gb2115 wrote: I had a very large hematoma from an MRI biopsy that happened a couple of days before surgery. The hematoma was extremely painful. Getting the mammogram for the pre-lumpectomy wire placement with a hurting hematoma was loads of fun. It was awful. They tried to drain it during surgery, but like yours it had already started to get thick. I did have bruising keep appearing later, and they told me it was because of blood from the surgery/biopsy sinking to different areas of the breast. The bruising took a long time to go away, but it did. So I had no treatment really, for the hematoma. I still had radiation on time. They said it wasn't a problem. But the hematoma was mostly away from the surgical site (the biopsy that caused it was on the other side of my breast, done before surgery to rule out multiple spots of cancer, which I ended up not having). So that might have been the difference, but my RO was not bothered by the hematoma. I got the hematoma early November and I think it didn't fully dissolve until well into radiation, maybe January, late January. ",
      "MessageIndex": 1,
      "PostDate": "07/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/863026",
      "Title": "Tell Me Everything About your Hematoma Sekerim gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 24, 2017 03:53AM gb2115 wrote: If it's solid and they end up doing a core needle biopsy, make sure you can spend your afternoon at work icing the area, seriously.",
      "MessageIndex": 3,
      "PostDate": "24/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853681",
      "Title": "37 and worried MangoODU gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Sep 27, 2018 10:47AM gb2115 wrote: Hi Bella2018--welcome to BCO! Sorry to hear of your issues after lumpectomy. Sounds like your surgeon is taking care of your hematoma. Hematoma is one of the risks of having lumpectomy. It doesn't necessarily mean that anyone made a mistake. I had a huge hematoma after an MRI biopsy, it just kind of happened. They had trouble getting me to stop bleeding initially---stabilized me and sent me home, and then it opened back up inside and started bleeding. It was hard as a baseball like you described. I was able to have lumpectomy, during which they tried to drain the hematoma but couldn't (it was already solidifying)--and I had that huge hematom until about halfway through radiation when it started dissolving. Your radiation oncologist will assess you and decide whether or not to delay radiation. Mine wasn't delayed, and my hematoma was sizeable. I imagine it depends on the location and whether or not they think your breast will shrink significantly. I was worried at the time and surveyed the available literature and learned that they are ok waiting up until about 12 weeks (I think, might have been longer but I really can't remember)--so if you do need to wait a bit for them to start radiation don't worry too much about it. They will start radiation even if you're seriously bruised from surgery---the radiation beams can go through something like that. As far as the drains go, I don't think it's normal to get a drain put in after lumpectomy---that's for mastectomies. I didn't have a drain. Hematomas are not typical, but some women can develop something called a seroma, which is fluid built up in the surgical cavity. That is normal and will reabsorb over time. I've heard of some having to go get that drained. I had some in there, but it reabsorbed. I imagine you'll feel better after you see your radiation oncologist. They should be able to alleviate some of these fears. Hope you feel better soon!",
      "MessageIndex": 1,
      "PostDate": "27/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867465",
      "Title": "Hematoma after lumpectomy Bella2018 Bella2018"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 20, 2017 12:02PM gb2115 wrote: I wonder in the absence of matched gene mutations amongst mother daughter pairs, if 1) it's something they just haven't found yet, or 2) a similar environmental exposure. My mom and I had exactly the same cancer, but I had a good genetic test other than one gene mutation of unknown significance. I feel like there is something they aren't seeing.",
      "MessageIndex": 10,
      "PostDate": "20/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/859487",
      "Title": "Tamoxifen or no? Randi74 eyecaresource"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 5, 2018 11:05PM gb2115 wrote: I had 2.1 mm in one node and didn't get chemo because of my mammaprint results. Different but similar to oncotype. I was 38 at the time too. They did radiation to all my lymph nodes though, as a result.",
      "MessageIndex": 3,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865043",
      "Title": "Micromets in node - chemo or no? Staceybee Margot62"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 18, 2017 03:29PM gb2115 wrote: Tamoxifen for preventative purposes in women at high risk for breast cancer is termed \"chemoprevention\" even though it has nothing to do with chemotherapy. https://www.mayoclinic.org/diseases-conditions/bre... I'm not sure what I would do in your case. That's a tough decision. It would be so much easier to just be able to see the future, right?!",
      "MessageIndex": 2,
      "PostDate": "18/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/859487",
      "Title": "Tamoxifen or no? Randi74 eyecaresource"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 27, 2018 12:18PM gb2115 wrote: I have one for flying but haven't needed it (haven't flown anywhere... I hate planes so I try to avoid it). Honestly the OT assessment is good, they should measure your arm and keep an eye on you. I was monitored for over a year before developing lymphedema in my chest. We spent so much time on keeping the arm safe, it's kind of funny it popped up elsewhere. I had a suspicious mole removed from the side of my radiated breast and apparently my lymph nodes couldn't handle it. But it was nice to have someone to call when I noticed fluid (oh no!). Do know that a preventative sleeve (and gauntlet) for flying appears to be controversial. My OT said there is no harm in wearing one (without diagnosed lymphedema) as long as it fits correctly.",
      "MessageIndex": 1,
      "PostDate": "27/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/862826",
      "Title": "Sleeve for Left Arm Veeder14 Veeder14"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 25, 2018 03:01AM gb2115 wrote: I take Ativan before some of my tests and it really helps. If you want to take something call your doc and discuss. You can't drive yourself home safely on the doses they give for things like this.",
      "MessageIndex": 2,
      "PostDate": "25/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/865430",
      "Title": "Should I take xanax before my biopsy? Laladie Laladie"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 26, 2019 10:52AM gb2115 wrote: They radiated me with a huge hematoma. They waited a week to see if it would shrink (it didn't), then started radiation. It eventually started dissolving sometime during radiation. The radiation oncologist never seemed really concerned.",
      "MessageIndex": 1,
      "PostDate": "26/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870626",
      "Title": "Hematoma and radiation sagelady gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 30, 2017 09:10AM gb2115 wrote: I was scared of general anesthesia too, never having had surgery before, but it really was ok. It's weird how fast you fall asleep and then literally wake up in recovery. I was highly anxious but about a second after them putting that mask on, I was out! ",
      "MessageIndex": 6,
      "PostDate": "30/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/853501",
      "Title": "Not scheduled yet...help me think this through! buffyjc gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 28, 2018 03:07AM gb2115 wrote: Radiation is standard of care after lumpectomy, they should have told you that while discussing surgical options...even with clean margins they can't guarantee that they got all the cells out, especially along the biopsy needle track and the surgical incision. Hence radiation. My risk of recurrence (that they told me) was dramatically higher without radiation. You'll be ok on the 3rd...the actual process of radiation isn't too bad, just keep an eye on your skin and get rest.",
      "MessageIndex": 6,
      "PostDate": "28/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868572",
      "Title": "Radiation confusion Dreamer54540 viewfinder"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 26, 2019 01:03PM gb2115 wrote: You too! Hang in there!!",
      "MessageIndex": 3,
      "PostDate": "26/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870626",
      "Title": "Hematoma and radiation sagelady gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 16, 2018 04:27PM gb2115 wrote: Isn't it a conflict of interest to refer someone to your spouse doctor? Maybe it isn't, I don't know. Sorry about your bad news. I saw a surgeon first then was referred to oncology after surgery. A lot rides on what your pathology report says... sometimes they give chemo before surgery but the surgeon you see should have a grasp on whether or not you should be sent to oncology first. I saw a local general surgeon who does a lot of breast surgery. She did a great job. She's now in the process of becoming just a breast surgeon. So yes a specialist, but there are some good general surgeons out there too. The beginning is quite a whirlwind but you will get through it!!",
      "MessageIndex": 6,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/864584",
      "Title": "43 and Diagnosed This Morning maiyen Mquara"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 7, 2018 04:48PM gb2115 wrote: I had a rash like that, took a couple of weeks to go away. I didn't do anything to treat it, just waited it out. I wonder if you have a hematoma or seroma. If you have active bleeding from your incision you might want to call your surgeon's office and speak to whomever is on call to see if that's normal. I had a hematoma after biopsy and it was painful pressure.  ",
      "MessageIndex": 1,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/863820",
      "Title": "Not much pain ...at first Blackhawk41 Benaya"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 26, 2017 06:23AM gb2115 wrote: For me the isotope injection was not much more pain than a flu shot, but I did feel kind of funny afterwards, like I could feel the isotope moving around in there. The true misery was the wire placement. So much pain, inadequate local anesthesia, and the radiologist did not appear sensitive to the fact that I was truly having a panic attack (I was already on the edge with anxiety about the surgery) when I realized they were going to smash my sore, hard to the touch severely bruised hematoma filled breast into a mammogram for the placement. He just did it anyway, not explanation or soothing words. Even the surgeon thought they would use an ultrasound (and winced when I told her the radiologist chose another method), so that's what I was prepared for. The radiologist even seemed like he didn't want to be there. The mammogram tech was nice though, I think she felt bad. This still really bothers me, can you tell??!! :-) It didn't have to hurt like that, I don't get why they didn't make that right. ",
      "MessageIndex": 70,
      "PostDate": "26/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746169",
      "Title": "Nuclear Injection pre-surgery pagowens Accepted2018"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 29, 2017 03:12PM gb2115 wrote: I don't think mine fell off until January. My surgery was the first week of November last year. So at least 8 weeks, probably longer.",
      "MessageIndex": 1,
      "PostDate": "29/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/859760",
      "Title": "How long 'til your lumpectomy incision scabs fell off? AngelaJL JoniB"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 25, 2018 04:32AM gb2115 wrote: Does it have vitamin levels in megadoses or regular doses (i.e., you only need 60 mg of vitamin C in a day, a megadose would be way more)?",
      "MessageIndex": 14,
      "PostDate": "25/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854617",
      "Title": "Supplements to avoid during Radiation treatmenr erinr28 Valentina7"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 29, 2017 08:24PM gb2115 wrote: no, I was not told to avoid anything.",
      "MessageIndex": 2,
      "PostDate": "29/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854617",
      "Title": "Supplements to avoid during Radiation treatmenr erinr28 Valentina7"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Aug 11, 2017 08:34AM gb2115 wrote: Yay!!! What is the next step for you?",
      "MessageIndex": 8,
      "PostDate": "11/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857724",
      "Title": "MRI this Tuesday, scared queenofwands Mojojennijo"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Aug 7, 2017 11:09AM gb2115 wrote: Hey, welcome to BCO.....yeah, scan-anxiety. Yup, that's pretty much what happens. Think of it this way...the pre-surgical MRI is rather standard (but not all doctors order it---but many do)---they are just covering their bases to make sure they have missed nothing before opening you up. If you have to get cancer removed, you want to make darn sure they are getting all of it so you only have to get put under once! Plus if you have problems in more than one location, it might change your treatment plan. I was scared too. I asked my surgeon for Ativan and easily got it. That was helpful. The MRI was pretty easy. The worst part is the IV, but it's not really claustrophobic because they have you face down and you can see out a hole in the table. It was loud and pretty boring, but not bad. The contrast was weird, but not really in a bad way. It's hard to describe. I did have to go back for a second biopsy based on the MRI, but it was out of an abundance of caution--they thought it was probably ok but wanted to make sure---I was ok with that because I didn't want any surprises later. If your worst fears are founded, you will do what you need to do, one thing at a time. Let us know what happens, ok?!",
      "MessageIndex": 2,
      "PostDate": "07/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857724",
      "Title": "MRI this Tuesday, scared queenofwands Mojojennijo"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 4, 2019 11:41AM gb2115 wrote: I was worried about this too, because I started at about 8 weeks. I had a large hematoma so they were waiting to see if it would decrease. It didn't, so we did radiation anyway. But at the time I was worried and researched, and saw a study where they said within 12 weeks is best.",
      "MessageIndex": 5,
      "PostDate": "04/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869670",
      "Title": "How Long After Surgery Should Rads Start? kec1972 AliceBastable"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 12, 2018 09:19PM gb2115 wrote: Sounds like everything is on the right track. The tamoxifen is important to take. Maybe try taking it with a meal? With many drugs the digestive side effects do ease as your body gets used to the medication. But if it doesn't get better definitely touch base with her doctor. If the tamoxifen is making her vomit they would want to know.",
      "MessageIndex": 2,
      "PostDate": "12/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/863175",
      "Title": "Looking For Medication Advice TucsonBill TucsonBill"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 29, 2017 10:32AM gb2115 wrote: I did not lose my voice, but I did have a scratchy throat for the first couple of weeks. Would start a couple hours after treatment and get better over the weekend. I also got supraclavicular lymph node radiation. I asked the techs if I could put my chin up further during treatment (to get farther away from the beam), and they said no problem. It went away after that. My RO denied that radiation could cause a sore throat, \"impossible\" she said. I also had nausea, mild but undeniable. The RO said impossible and offered to send me to GI (??!!) but the MO said lots of women complain of nausea. It went away too. Hope your throat gets better!!! :-) ",
      "MessageIndex": 1,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/853780",
      "Title": "Lost Voice?? adawn24 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 21, 2018 08:56AM gb2115 wrote: Yes. I had swelling at the beginning of radiation within a couple of treatments. It did go away eventually. I also felt \"hot\" in my breast hours after treatment, the first week or so. They denied that radiation could cause that. It wouldn't hurt to get your surgeon to take a look if you are worried, just to make sure nothing looks odd. But yeah, sore and swollen--only the breast though w/ swelling. I had my lymph node areas radiated too (under arm and under collarbone), but those areas never became swollen although I did have tenderness. The under collarbone area is still tender, a year later. They will probably deny that radiation can cause that (the denial of side effects drives me batty with these ROs). However, if you think about it, it makes sense that radiation could cause an inflammatory reaction of sorts. Especially right off the bat. For me, that mostly tapered off right as the skin irritation was starting. ",
      "MessageIndex": 1,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862692",
      "Title": "Swelling of surgical site and underarm since beginning rads? LittleLori LittleLori"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 15, 2017 10:39AM gb2115 wrote: I worked through rads. I have a flexible schedule/job and work right across the street from where I had my treatments, so that helped. I'd go to work for a couple hours, go to treatment, then come back. No one at work cared that I came and went. My boss said to do whatever I needed to do. I couldn't wear a bra after awhile, but I wear scrub tops (and am small chested) so no one noticed. I think I wore a zip sweatshirt over that too. That's something to consider though. Physically it was ok. You get tired by the end of the week. I had a scratchy throat and nausea for most of the 6 weeks, but I was still able to work. I realized I wouldn't feel better by sitting at home, so it was at least nice to be around my friends at work and get out and about a bit. I toyed with taking FMLA because I had a terrible time with dermatitis, but right when I was thinking of announcing I was taking time off I was able to get an emergency dermatology appointment and a cortisone shot that worked like magic. That helped quickly so I was good.",
      "MessageIndex": 5,
      "PostDate": "15/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/860158",
      "Title": "Working during Radiation Therapy CMary CMary"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 3, 2018 03:40PM gb2115 wrote: I couldn't tolerate a bra after lumpectomy. Had surgery on a Friday afternoon, by Monday I was so fed up with wearing a sports bra I called the office and got the surgeon's blessing to not wear anything. I was braless until I went back to work, at which time I had to find a bra that didn't come up anywhere near the armpit incision. I still can't tolerate anything touching that. Some nerve damage remains there and I get this tingly prickly feeling whenever that incision is touched, that I can't stand. I don't think I wore deodorant until completely healed from radiation. Just kept it really clean. I wonder if it has to do with breast size? I am small chested, so gravity doesn't play a huge role. Maybe that's why they let me take the bra off. Or maybe it's just whatever the surgeon wants. Mine is pretty laid back, but it turned out ok.",
      "MessageIndex": 2,
      "PostDate": "03/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867577",
      "Title": "Wearing bra advice Neon55 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 4, 2018 10:19AM gb2115 wrote: I have a Coobie too, that I wear sometimes. Ordered it from Zappos. I cut out the part around my armpit incision so it doesn't rub. Most of my bras have a cut out portion now, except for some Hanes that are cut lower. Might have to buy a bunch of things and experiment. I sent my husband out with a general size idea, and had him buy a bunch of bras from Target (poor guy) so I could try them on at home. That how I found that the Hanes were ok. He returned everything else.",
      "MessageIndex": 6,
      "PostDate": "04/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867577",
      "Title": "Wearing bra advice Neon55 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 17, 2017 09:35AM gb2115 wrote: Ok so it's constriction or tight enough to leave marks!!! Got it, thanks!!!",
      "MessageIndex": 6580,
      "PostDate": "17/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 14, 2018 05:00AM gb2115 wrote: Hi Carrie, I most definitely had nausea from radiation. The radiation staff denied it was possible, said I had the flu (for 6 weeks with no other symptoms yeah right), saw my medical oncologist who said it can absolutely cause nausea, said she hears it a lot. I can't remember how long it took to go away after radiation finished, but it eventually did. Hang in there!!",
      "MessageIndex": 16,
      "PostDate": "14/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862049",
      "Title": "12 hour shifts and Radiation treatment sammi2006 sammi2006"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 8, 2018 06:31PM gb2115 wrote: I think if you can swing the time off with your leave of absence, definitely consider it. Those are long haul shifts, with physical work, and radiation is long haul treatment. You will be tired and will need rest to heal your \"cooked\" breast. I worked but have an extremely flexible work schedule, and was right across the street from where I had treatment. And worked short days a lot of the time. Even with that I was wiped out and almost went on FMLA. Honestly the --only-- reason I didn't is because I wanted to save vacation time for actual vacation. I would have preferred to be off. For radiation the machine (linear accelerator) rotates around you. No being enclosed or claustrophobic. Side effects were not fun but the actual treatments are easy.",
      "MessageIndex": 11,
      "PostDate": "08/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862049",
      "Title": "12 hour shifts and Radiation treatment sammi2006 sammi2006"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 17, 2017 07:35AM gb2115 wrote: Question for you all...for LE prevention, they say not to wear tight clothes. Does this mean everything needs to be super baggy and barely touching your skin, or is it to avoid constriction and clothing that leaves a mark? Like a tight cuff or when you push your sleeves up and it's really tight. I have clothes I'm afraid to wear, and not sure it really matters. I don't like tight clothing anyway, but a shirt that fits where it's partially or lightly touching the skin, but not super tight---like you can fit fingers underneath it, that's ok right? Wow I worry too much---I see this just typing this question out!!!",
      "MessageIndex": 6578,
      "PostDate": "17/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 16, 2018 03:59PM gb2115 wrote: I agree it sounds like lymphedema. I get a band of fluid next to my breast under my armpit that comes and goes depending on what bra I wear. You can definitely get this treated! So far I am lucky that if I go braless it goes away but I have a lymphedema person I can get in quickly with in the event that it doesn't go away. Definitely see if you can find a specialist!!",
      "MessageIndex": 2,
      "PostDate": "16/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/863247",
      "Title": "Opinions needed Egads007 hugz4u"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 17, 2018 04:13AM gb2115 wrote: Hey Hugz...how often do you increase your weights?",
      "MessageIndex": 5,
      "PostDate": "17/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/863247",
      "Title": "Opinions needed Egads007 hugz4u"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 19, 2018 03:14AM gb2115 wrote: I think it really depends on the lab. I had a skin biopsy (negative) that took 2 full weeks to come back. And then it needs to be reviewed by the ordering physician. After my first MRI, my results sat on my surgeon's desk for 2 days before she had time to call me, and her staff wasn't authorized to tell me the results (when I called to enquire). It is so hard to wait!!",
      "MessageIndex": 3,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/864057",
      "Title": "How long for lab results to get reported? Prairiedog claireinaz"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 13, 2019 10:45AM gb2115 wrote: Bruising can be very delayed. I was bruised for about 2 months after my surgery, and the bruising definitely changed over time. It was scary looking at the 4 week mark when I went to see the radiation oncologist for the first time. The bruises can also sink to the bottom of your breast. I was a hot mess because I had an MRI biopsy 3 days before my lumpectomy, on the opposite side of the same breast. That wouldn't stop bleeding then developed a massive hematoma. They were still able to do the lumpectomy because the hematoma was separate from the surgical area. Tried to drain it during surgery without success, it had already started to congeal I guess. In any event, so I had extensive bruising from that awful MRI, and then from the lumpectomy. I joked that I had my own personal Superfund Hazmat site on my chest. It all eventually went away. Definitely keep an eye on it--you can always keep bugging them to get re-evaluated one more time. My understanding with IBC is that it just rapidly gets worse, rather than staying the same or getting better. Or call your surgeon, tell them you're worried it's IBC, and they can tell you why they think it isn't (or maybe they'd get you into the office again). It might ease your mind. I google a lot as well, so I totally get it.",
      "MessageIndex": 3,
      "PostDate": "13/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870346",
      "Title": "After Lumpectomy and Sentinel Node Biopsy morningdove morningdove"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 21, 2019 03:12AM gb2115 wrote: Glad to hear it!!!",
      "MessageIndex": 8,
      "PostDate": "21/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870346",
      "Title": "After Lumpectomy and Sentinel Node Biopsy morningdove morningdove"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 26, 2017 04:21PM gb2115 wrote: I felt like that too, drove me crazy to have the tumor in me for an entire month before surgery. I'm a little younger than you, but have a 4 year old daughter who has witnessed this process. I did not get chemo because of a low risk mammaprint. Did lumpectomy plus 32 rads. Rads was particularly hard because I became allergic to most things touching my skin (not the norm don't worry).. I was systemically sick from allergic dermatitis for weeks. She knew something was up but we just referred to it as mommy's boo-boo. I think she was worried. But we got through it and she is a normal 4 year old. My point is even if you need to do chemo, your little one is so young she will be resilient. She may not even remember... how much do you really remember from that age?",
      "MessageIndex": 4,
      "PostDate": "26/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/856422",
      "Title": "Is this normal? CA-Sunshine kira1234"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 3, 2019 03:40AM gb2115 wrote: above poster had good suggestions. You probably don't need any tests or blood work. They are going to ask about how you are doing with the tamoxifen. You don't need bone scans because of the tamoxifen...with the other meds they scan to check bone density, which isn't an issue with tamoxifen. They aren't brushing you off....they just can't justify constant checking for things....tumor markers aren't necessary for early stage disease, and any other scan is overkill unless you are having symptoms that require investigation. My oncologist said any symptom lasting 3 or more weeks should be brought to her attention, then they investigate. I hope that made sense. Basically they can't tell if it's spreading throughout your body until it happens and you would be having symptoms. So the routine follow up appointments are monitoring for symptoms. ",
      "MessageIndex": 3,
      "PostDate": "03/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/870790",
      "Title": "What to ask at your 3 month follow-up? Jen2Mom gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 1, 2017 11:51AM gb2115 wrote: I don't think the pathology report will list the stage, because staging takes into account more than just that particular pathology at the time. My stage was never verbalized to me, but it was easy to figure out.",
      "MessageIndex": 6,
      "PostDate": "01/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855667",
      "Title": "was your stage of cancer noted on your pathology report? melissa233 chipilonadog"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 28, 2017 11:22AM gb2115 wrote: I am normal weight so that is good. My RO pooh-poohed lymphedema risk from the radiation, but she pretty much pooh-poohed any possibility of ANY side effect. I'm still annoyed by that to this day, which is why if I have any issues with anything I'll just go straight to the medical oncologist or the surgeon. I am trying to slowly start using my arm more normally now that I'm a couple months out from radiation. I had a hard time with radiation, so was pretty inactive the entire time other than walking around the neighborhood when weather permitted over the winter. I work in the medical field, so I have to lift heavy-ish patient charts. I have been favoring my left arm for this but am now trying to use both arms a little more often. But I'm doing it in little bits (it's not something I have to do everyday either)---all of my work stuff is very much at my own pace which is nice. Opening doors with the affected arm, etc. I figure also I will take the workouts slowly but add more of the arm movements as time goes on. I am trying to be good with daily stretching too. I'm pretty sure I have impressive scar tissue from radiation and surgery going on in there---I can feel it--very tight.",
      "MessageIndex": 3,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/853781",
      "Title": "Constant fear of lymphedema--VENT gb2115 ChiSandy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 24, 2017 10:27AM gb2115 wrote: I don't think they should laugh off the LE risk. My rad onc did that too, with oh you won't get it, it mostly happens along with obesity. Well, they should never say you won't get something, because they really don't know. And I think it's a genuine thing to be fearful of. I will be in a situation where there will definitely be sun, and possibly mosquitos, this weekend, so I'm gearing up for that. Skipping this would definitely not be living life (there's something we've already told our little girl we're going to do, so we're doing it), but I can't say I won't be worried about it. Sunblock and bug spray, but for sure I'll swelter under a sweatshirt in order to keep that arm out of the sun. It's supposed to be hot too. I need to buy some of those UPF rated shirts, or a parasol or something. ",
      "MessageIndex": 27,
      "PostDate": "24/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/853781",
      "Title": "Constant fear of lymphedema--VENT gb2115 ChiSandy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 8, 2018 12:11AM gb2115 wrote: I think maybe the port films they do right before the first treatment would at least verify correct treatment... right? I am surprised though that they want to do simulation so early. Maybe they will repeat after chemo to double check (I would hope so). I would ask the RO how they will know the treatment will still be effective with such early simulation. There has to be a way to verify it I am sure. Maybe the port films. My simulation was a brief CT scan, followed by getting tattoos placed. No claustrophobia, the CT was very open. It was fast too. Some women get molds made to hold them in position, that might take longer. I did not have molds...they just used the tattoos to line the beams up.",
      "MessageIndex": 3,
      "PostDate": "08/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862314",
      "Title": "Radiation Simulation Questions Vera1966 Katiejane777"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 22, 2018 04:44PM gb2115 wrote: Hi Nyr, Do you mean hormone therapy like tamoxifen? I have been taking it for over a year and I honestly don't think it's that bad. All medications can have side effects. I have some (it's not all puppies and rainbows) but find them tolerable and preferable to having my cancer come back!! ",
      "MessageIndex": 1,
      "PostDate": "22/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864153",
      "Title": "Post radiation. Hormone replacement Nyr4evr Nyr4evr"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 7, 2019 02:58AM gb2115 wrote: Yes you can suddenly become allergic! And yes it could be the adhesive. What will be interesting to see is if you are now sensitive to other adhesives? I rash out with any kind of adhesive but only in the treated area. So a bandaid on my finger is ok, but anywhere that radiation scatter went will break out. Super fun, right?!",
      "MessageIndex": 7,
      "PostDate": "07/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/871392",
      "Title": "Sudden allergy to surgical tape? Jerz_0035 MelissaDallas"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 2, 2017 04:37PM gb2115 wrote: definitely rest if you feel tired, and do not feel guilty. You had surgery!!! It took a couple weeks for me to really feel better.",
      "MessageIndex": 1,
      "PostDate": "02/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/859089",
      "Title": "Lumpectomy Friday - did I push too hard today ekb88 ekb88"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 11, 2017 03:35PM gb2115 wrote: Where do you get the little antibiotic cream packets from? And the mini sunblocks? Everything should be available in miniature....love it!!!",
      "MessageIndex": 16,
      "PostDate": "11/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/854069",
      "Title": "Can rash indicate anything? itfinallyhitme vlnrph"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 30, 2019 05:05AM gb2115 wrote: Sorry about your kitty. We lost a 4 year old orange tabby (greatest cat ever) to kidney failure about 6 years ago and I still miss him. It's so hard. I hope the antibiotics help quickly for you!!!",
      "MessageIndex": 10,
      "PostDate": "30/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870346",
      "Title": "After Lumpectomy and Sentinel Node Biopsy morningdove morningdove"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 6, 2017 06:14AM gb2115 wrote: I had one positive node and was given radiation to the lymph nodes, both the ones under my arms and the ones up near the collar bone.",
      "MessageIndex": 4,
      "PostDate": "06/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/853194",
      "Title": "Radiations needed with one positive node scaredashell07 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 28, 2017 12:03PM gb2115 wrote: Well, the mosquito didn't get me...THIS time lol. I guess I need to keep bug spray in my office... :-)",
      "MessageIndex": 6,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/853781",
      "Title": "Constant fear of lymphedema--VENT gb2115 ChiSandy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 29, 2017 05:38AM gb2115 wrote: Thanks everyone! I will try not to stress over too much. I did another walking workout last night and my arm feels fine. I think I do have really tight scar tissue though, I will ask the oncologist about it at my next followup. I know you can't rub or massage radiated skin, so that's probably out, so I guess the stretching is the best thing, like the post-op exercises they give you. I do those every morning after I shower.",
      "MessageIndex": 11,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/853781",
      "Title": "Constant fear of lymphedema--VENT gb2115 ChiSandy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "gb2115 wrote: Ok, lumpectomy + 3 nodes removed, and radiation to ALL the lymph nodes. I have already seen a lymphedema therapist twice as part of an ongoing monitoring program (she takes measurements every 3 months or so). No swelling yet. Yet I live in <<constant>> fear of lymphedema. The list of precautions is almost overwhelming, everything that needs to be done to protect the arm. Every paper cut freaks me out. And activity...from what I read activity prevents lymphedema, treats lymphedema, and causes lymphedema. My therapist said to increase activity gradually. Ok, I'm trying to do that, but feel like it's a crapshoot. I did a Leslie Sansone walk away the pounds DVD yesterday (30 minutes) and did about 1/3 of the arm moves she was showing (trying to ease in). Was it too much, I have no clue. Although if lymphedema develops from such gentle arm work, it's probably going to happen anyway and therefore such a person is generally screwed. I used to be soooo active, this makes me want to cry. I might be tearing up... And the \"don't injure your arm\" bit. Short of living inside bubble-wrap, how do you do that? I'm at work, and there is a giant mosquito flying around the break room. I will be afraid to go in there to eat lunch, lest I get bitten and end up with lymphedema from a stupid mosquito. I would ask someone to go in there and kill it for me, but they'll think I'm nuts. They already probably do. Sorry, I'm really frustrated. This is no way to live. I could use a pep talk if anyone can help. Dx IDC in October 2016, stage 2A, 1.2 cm ER/PR+ Her2-, Grade 2, 1/3 nodes. Mammaprint low risk luminal A, Lumpectomy + radiation + tamoxifen. Age 38 at diagnosis. Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/853781",
      "Title": "Constant fear of lymphedema--VENT gb2115 ChiSandy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 24, 2018 08:23AM gb2115 wrote: I did go braless, it really helped! Hang in there you are almost done! The boost didn't make my skin any worse--it just got darker but didn't hurt worse or anything",
      "MessageIndex": 12,
      "PostDate": "24/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864153",
      "Title": "Post radiation. Hormone replacement Nyr4evr Nyr4evr"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 26, 2018 04:31PM gb2115 wrote: The redness took a couple weeks to go away I think. I would think you can put gauze in your bra if you want. The first few weeks of radiation I had to use constant nonstick gauze in my bra because my surgical wound had weeping dermatitis on it. You just have to avoid adhesive!",
      "MessageIndex": 24,
      "PostDate": "26/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864153",
      "Title": "Post radiation. Hormone replacement Nyr4evr Nyr4evr"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "gb2115 wrote: Ok, lumpectomy + 3 nodes removed, and radiation to ALL the lymph nodes. I have already seen a lymphedema therapist twice as part of an ongoing monitoring program (she takes measurements every 3 months or so). No swelling yet. Yet I live in <<constant>> fear of lymphedema. The list of precautions is almost overwhelming, everything that needs to be done to protect the arm. Every paper cut freaks me out. And activity...from what I read activity prevents lymphedema, treats lymphedema, and causes lymphedema. My therapist said to increase activity gradually. Ok, I'm trying to do that, but feel like it's a crapshoot. I did a Leslie Sansone walk away the pounds DVD yesterday (30 minutes) and did about 1/3 of the arm moves she was showing (trying to ease in). Was it too much, I have no clue. Although if lymphedema develops from such gentle arm work, it's probably going to happen anyway and therefore such a person is generally screwed. I used to be soooo active, this makes me want to cry. I might be tearing up... And the \"don't injure your arm\" bit. Short of living inside bubble-wrap, how do you do that? I'm at work, and there is a giant mosquito flying around the break room. I will be afraid to go in there to eat lunch, lest I get bitten and end up with lymphedema from a stupid mosquito. I would ask someone to go in there and kill it for me, but they'll think I'm nuts. They already probably do. Sorry, I'm really frustrated. This is no way to live. I could use a pep talk if anyone can help. Dx IDC in October 2016, stage 2A, 1.2 cm ER/PR+ Her2-, Grade 2, 1/3 nodes. Mammaprint low risk luminal A, Lumpectomy + radiation + tamoxifen. Age 38 at diagnosis. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/853781",
      "Title": "Constant fear of lymphedema--VENT gb2115 ChiSandy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 29, 2017 12:20PM gb2115 wrote: I'm being really cautious with the arm parts of those workouts since I'm only 2 months out from radiation. Like taking them at half pace if they are fast movements, or only doing part of a set, while doing the entire leg part. Nothing fast or jerky on the arms. I like her workouts because you can either use the arms or not. It's still a good workout and more interesting than a treadmill walk. I picked up a couple of her DVDs from the library but might buy some to have. I used to use the FIRM DVDs pretty exclusively, but am not sure about using weights yet. I feel like it's way too soon. I will see the specialist again in June, but she's an OT. I wonder if they can put me in touch with a PT who knows what they are doing, for some structured guidance. I also see the MO in April, so maybe earlier. Do you know if they sell long gloves for gardening? Our backyard is pretty buggy but I want to plant some vegetables in our raised bed this year. Or I can send my husband back there to plant them! Maybe this is the year to get our yard treated, but I worry with our little girl running around and playing.",
      "MessageIndex": 13,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/853781",
      "Title": "Constant fear of lymphedema--VENT gb2115 ChiSandy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 31, 2017 06:45AM gb2115 wrote: That is very helpful! I'm thinking of calling my therapist for some more specifics. I see her again in a couple of months for measurements, but don't really want to wait that long. I might see if I can pop by and see her when I go for my oncology follow-up in a couple of weeks. You know what I love? Aerobic dance, like Zumba and things like that. I have a hip hop cardio DVD that I really miss doing. Maybe someday. I had to stop doing Zumba because of a lot of ankle problems prior to my cancer diagnosis, so I don't know if getting back in the game is in the cards for me.",
      "MessageIndex": 19,
      "PostDate": "31/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/853781",
      "Title": "Constant fear of lymphedema--VENT gb2115 ChiSandy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 25, 2017 08:15AM gb2115 wrote: I got a medical bracelet too, just in case. I figured that's one thing I can control...at least if something happens to me, maybe EMS will see it and not put a BP cuff on my at-risk arm. I got a boring Medic Alert one, but that's because it was inexpensive. :-) They were nice though...it arrived with a clasp I had trouble opening, so I sent it back in and they put a different type of clasp on, no problem!",
      "MessageIndex": 32,
      "PostDate": "25/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/853781",
      "Title": "Constant fear of lymphedema--VENT gb2115 ChiSandy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 1, 2018 04:38PM gb2115 wrote: Sorry you have found yourself here but welcome!! Seeing a specialist sounds like a good idea and they will probably do a biopsy. You won't get any satisfying answers until they do that because the only way to rule out cancer is a biopsy. It's hard but try to stay busy to distract yourself during the upcoming two weeks! ",
      "MessageIndex": 1,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/864336",
      "Title": "What just happened.. From routine Mamo. Results to a surgeon Taralynn8869 Egads007"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 27, 2018 11:36AM gb2115 wrote: When I found out my biopsy results, all the radiologist knew was that it was IDC and grade 2 (intermediate grade). The rest had to be processed by pathology and I didn't find out specific tumor biology until 5 days later when I saw the surgeon and started discussing treatment options. I didn't find out about my positive node until after surgery. In any event it honestly could be they don't have additional information for you! Hang in there!",
      "MessageIndex": 2,
      "PostDate": "27/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862823",
      "Title": "Biopsy Diagnosis, received.. Curious dsueb dsueb"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Aug 24, 2017 11:37PM gb2115 wrote: It might have to do with how the nerves were affected by the SNB on one side compared to the other. If they cut a nerve, or even irritate it by touching it a lot, I think that can really affect things. So the surgeries might not have been exactly identical on both sides. That's my thought anyway, kind of makes sense. I was extremely tight after my SNB, and still have numbness in the armpit and tingling if I touch in certain places, 9 months later. Definitely keep those exercises up, it will help---I didn't think I'd ever get ROM back, but I eventually did! :-)",
      "MessageIndex": 3,
      "PostDate": "24/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/858151",
      "Title": "Pain more in one arm/armpit after mastectomy with SNB? beach2beach beach2beach"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 7, 2017 10:44AM gb2115 wrote: Before lumpectomy they place a wire leading to the area of the tumor. The marker will help the radiologist find the area to place the wire. I would think if you had a big old tumor they would still be able to easily put the wire in. Maybe it's different with small areas of calcifications? Keep in mind that surgical steel and titanium are very different metals. I am allergic to stainless steel (even medical grade) but have at least one titanium marker. There might be two. .not sure what they did with the surgical site.",
      "MessageIndex": 1,
      "PostDate": "07/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859928",
      "Title": "No titanium marker in sterotactic biopsy = mastectomy? cathybee1 cathybee1"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 4, 2017 08:18AM gb2115 wrote: You definitely need to get that evaluated. I did a quick google search for what to do if you can't afford a mammogram, and found this phone number: 800-462-9273--it says it can help find low cost or free services. Otherwise, check to see if you have a local community health clinic. I wouldn't put this off any longer, it may turn out to be nothing, but as many of us young cancer survivors (who felt fine prior to diagnosis) can tell you, it very well could be something.",
      "MessageIndex": 1,
      "PostDate": "04/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859134",
      "Title": "Cell phones and bc? Hgg12 Hgg12"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 14, 2018 06:41AM gb2115 wrote: I have a sleeve and gauntlet for flying, but haven't worn them yet since I have not flown. My CLT said to not wear them for the first time on the actual flight but to try them out ahead of time. How long is long enough to try them out? I have no plans to fly, but you never know. I'm afraid that the sleeve will <<give>> me lymphedema that I don't have (I have a tad of truncal that is pretty well controlled), but I'm not sure it's a valid fear. She did check the fit of the sleeve when we got it.",
      "MessageIndex": 10,
      "PostDate": "14/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/865151",
      "Title": "Flying for the 1st time tlgio17 tlgio17"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 6, 2018 05:59AM gb2115 wrote: If I were you I would try to get an appointment with a dermatologist (the appointments can be hard to get), and in the meantime start saving money to pay for the visit. dermatologists are good for odd looking skin, it's what they do!",
      "MessageIndex": 1,
      "PostDate": "06/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861376",
      "Title": "Breast pimple mark has been here for almost a year? worried247 MelissaDallas"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 15, 2019 12:02PM gb2115 wrote: One of mine was I think 0.9, but it was on the chest wall and she said she got as close as possible.",
      "MessageIndex": 2,
      "PostDate": "15/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869354",
      "Title": "Are these really \"clear\" margins? kec1972 AliceBastable"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 15, 2019 04:12PM gb2115 wrote: Glad you got a reasonable explanation!!! Now you can rest easy!!",
      "MessageIndex": 6,
      "PostDate": "15/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869354",
      "Title": "Are these really \"clear\" margins? kec1972 AliceBastable"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 10, 2018 02:01PM gb2115 wrote: I haven't heard of any, but perhaps there's someone out there that has. Sorry to hear of your diagnosis!",
      "MessageIndex": 1,
      "PostDate": "10/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867708",
      "Title": "False positive biopsy? Raysal WC3"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 13, 2017 11:52AM gb2115 wrote: Part of my MRIs (I had 2) were denied, because the radiologist used \"computer assisted\" technology which they deemed experimental. I was able to get the insurance to get the hospital to write off the part of the charges they didn't cover, but when I think about it, it's not really fair to the hospital. So the regular MRI charges went through, but $600 of each MRI they wouldn't cover. I know for me there were appeal procedures I could do, but didn't have the energy. Maybe if your surgeon's office calls the insurance company they can figure out what to do.",
      "MessageIndex": 3,
      "PostDate": "13/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/853071",
      "Title": "MRI denied Laureneliz gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 7, 2018 03:28PM gb2115 wrote: I think they really do a great job considering---it's kind of like predicting the weather. No one can really see the future, they just do the best they can!!",
      "MessageIndex": 134,
      "PostDate": "07/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 16, 2017 01:25PM gb2115 wrote: Anxious to the max---I am so glad that helped you. Hoping for the best for you!",
      "MessageIndex": 48,
      "PostDate": "16/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 13, 2017 10:34AM gb2115 wrote: Has anyone tried using GABA for anxiety?",
      "MessageIndex": 109,
      "PostDate": "13/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 26, 2018 01:02PM gb2115 wrote: For me it's the waiting...the phone could ring at any time, with good or bad news...that drives me nuts!!!",
      "MessageIndex": 143,
      "PostDate": "26/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 18, 2018 12:45PM gb2115 wrote: Ok cool. I have a very active imagination so I was imagining problems.",
      "MessageIndex": 5,
      "PostDate": "18/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/863293",
      "Title": "Radiation tattoos and MRI gb2115 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "gb2115 wrote: I have a screening MRI this week. I read online that tattoos can cause problems by heating up and causing burns. I have the two tiny tattoos from radiation. Should I be worried about this?? Dx IDC in October 2016, stage 2A, 1.2 cm ER/PR+ Her2-, Grade 2, 1/3 nodes. Mammaprint low risk luminal A, Lumpectomy + radiation + tamoxifen. Age 38 at diagnosis. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/863293",
      "Title": "Radiation tattoos and MRI gb2115 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 19, 2018 12:37PM gb2115 wrote: Katiejane, I was pink all over too after the first few treatments. I also had mild swelling. This all went away after the first week or so, then started coming back as the regular burn around week 3 (which is when they said it would start). Just wanted to throw that out there, in case anyone sees this thread and is wondering. They told me it was \"impossible\" to be from the radiation because it was too soon. I dunno, I don't normally have pink swelling skin anywhere else, but you know... :-)",
      "MessageIndex": 3,
      "PostDate": "19/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/863302",
      "Title": "Side effects of rad treatment Rozzie_1 macb04"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 23, 2018 06:08AM gb2115 wrote: Does your food taste bad in a specific way, like a metallic taste?",
      "MessageIndex": 2,
      "PostDate": "23/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/865392",
      "Title": "Making food taste better GrooGruxQueen Frog-on-the-lilypad"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 26, 2017 05:11PM gb2115 wrote: Hi Chyree, I had nausea pretty much the entire way through rads....rad onc said impossible, med onc said lots of women experience nausea during rads. You are not crazy, it will go away. I get so irritated that rad oncs deny all of these side effects.",
      "MessageIndex": 26,
      "PostDate": "26/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/679444",
      "Title": "Radiation causing nausea and dizziness marymary897 Motherofall6"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 18, 2018 04:30PM gb2115 wrote: Thanks everyone!!!",
      "MessageIndex": 7,
      "PostDate": "18/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/863293",
      "Title": "Radiation tattoos and MRI gb2115 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 27, 2018 11:32AM gb2115 wrote: If you are taking anticoagulants together, it wouldn't take much of a knock to the breast to cause a small hematoma, which can feel like a lump followed by a bruise. If you are still concerned I would go back to the physician who ordered your mammogram and ultrasound to discuss with them, and yes, make sure they know all the medications you take.",
      "MessageIndex": 10,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/861985",
      "Title": "Radiologist says Lump is a bruise but Rolle Rolle"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 18, 2018 08:25PM gb2115 wrote: I was clinically at risk with a positive lymph node and high ki67, was grade 2 and had a low risk mammaprint result. The oncologist recommended against chemo so I didn't do it. They left the ultimate decision up to me but basically told me what the best choice was. I appreciated that.",
      "MessageIndex": 3,
      "PostDate": "18/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868422",
      "Title": "Mammaprint - should I believe a low score LillianGish LillianGish"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 18, 2017 06:40AM gb2115 wrote: hey Epic...My radioactive injection didn't hurt any worse than a flu shot, really. And only the shot hurt...i thought the radioactive isotope in there felt weird but it didn't hurt. And you won't feel the blue dye they give you during surgery. Be prepared for a bright blue breast and blue pee when you wake up though! I was anxious too though. Maybe think about asking your surgeon for an anxiety med...my surgeon gave me a 6 pill Ativan prescription for moments just like that. It's not like you would take it all the time. And if you need to then it's time to talk with someone. There are excellent therapists out there (I have a super helpful one that I adore), and anxiety can be successfully treated. Cancer sucks and will make you anxious, but if you can take steps to ease that it's worth it for your own emotional comfort. Incidentally, I barely slept for a month after diagnosis...Sat up most nights watching movies. It eventually got better. This is a horrible season but you will get through it. Think of it like a season...Seasons come and go like waves on the beach. Please keep us updated!",
      "MessageIndex": 113,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/769441",
      "Title": "Radioactive Injection into Nipple NOT TERRIBLE waynesgirl50 Motherofall6"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 13, 2017 09:45AM gb2115 wrote: Does anyone else get anxiety when they have to make a phone call? I need to call to make a routine doctor's appointment today, and I'm dreading it. I know that's weird, but it is what it is. Been like that for a long time. Anyone else?",
      "MessageIndex": 63,
      "PostDate": "13/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 13, 2017 12:03PM gb2115 wrote: Yeah, I finally made the phone call (had to leave a message but she called me back), so I have my appointment scheduled---this is for my first set of films since surgery--but it's not for a couple of months still. But now I'm second guessing whether or not I wrote the right time and date down. Of course I did, when I go over it in my mind. I wrote it down right on the day in my planner as I was talking to the doctor's office, so why would I write the wrong thing down? But in my head it's this \"oh no.\" Ugh. Classic anxiety. Will give me something to talk with my therapist about next week I guess!!! :-) I was doing so well with my anxiety until cancer came into my life. Thanks for listening MT! I really like this thread...I feel very much less alone in the world! ",
      "MessageIndex": 65,
      "PostDate": "13/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 26, 2017 12:00PM gb2115 wrote: I have been in therapy for pre-existing anxiety for a couple of years, so I am well versed in the CBT techniques. I was actually feeling normal levels of anxiety (after having weaned from meds) and was about to cut the cord with my therapist when, oh surprise, you have cancer. So I continue going, but it's extremely helpful and I'm thankful I hadn't cut that cord. What I've found the most helpful, for my anxiety, is what she calls \"big picture,\" though re-framing might be the actual term, not sure. Spanning out in your mind, to look at a problem or event with a more global view, or to see it from another point of view. I also picture events as a big wave...it will crest and feel awful, but I will eventually be on the other side of it. I am also a christian, so we do a lot of \"God is in control\" point of view. That helps the most, honestly. I also watch funny movies if I've had a really bad day. Get Smart makes me laugh like silly every time. Great thread!!!",
      "MessageIndex": 6,
      "PostDate": "26/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 9, 2017 03:34PM gb2115 wrote: So glad to hear that Epic...I have been down that road before, and it really does help. I think it takes a lot of courage to make that first appointment and go, but it helps so much. :-)",
      "MessageIndex": 20,
      "PostDate": "09/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 26, 2018 03:09PM gb2115 wrote: I got a call that it was normal, I am so relieved! Off the hook until my mammogram in the fall! Whew!",
      "MessageIndex": 145,
      "PostDate": "26/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 5, 2017 08:26AM gb2115 wrote: Probably wouldn't hurt to talk with your oncologist. They might prescribe something or send you on to someone in mental health (or both). Mental health isn't what an oncologist specializes in but anxiety is indeed common amongst cancer patients so they should be well versed in handling it, or at least have someone in mind to send you to.",
      "MessageIndex": 12,
      "PostDate": "05/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 14, 2017 05:54AM gb2115 wrote: my therapist suggested magnesium for anxiety but I didn't feel a difference...not even placebo, lol",
      "MessageIndex": 33,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 14, 2017 04:20PM gb2115 wrote: Ah, that makes sense. Thanks for the link---that was an interesting article. I tired that Natural Calm powder stuff a couple of times and then gave up on it. So it's more of a long term effect!",
      "MessageIndex": 37,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 15, 2017 09:59AM gb2115 wrote: Hi Anxious to the max.....I was like that too....cried and cried and cried--it's what had to happen. It's ok to do that! Hoping for good results for you!",
      "MessageIndex": 43,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 5, 2018 01:33PM gb2115 wrote: Is anyone else having anxiety about this stupid flu season? I'm starting to feel really anxious about this--partly because I work in healthcare so it's like a ticking time bomb. I did get a flu shot, but yikes it seems like a bad year. I am so afraid of taking the flu home to my young child. :-(",
      "MessageIndex": 127,
      "PostDate": "05/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 21, 2018 12:36PM gb2115 wrote: So...the every 6 month \"scan anxiety.\" After a clear mammogram in October, I get an MRI tomorrow. Might have to wait a couple of weeks for results. I don't know if they'll call me or I'll get them at my surgeon followup appointment in April. I guess if they find something maybe they won't make me wait. Not sure. Does this start to get easier? I'm worried about the MRI because it's so specific, I feel like if there's the hint of anything they will biopsy. I understand that. But I don't want to have to deal with anything. And my last MRI biopsy was a nightmare. And now I have truncal lymphedema, so digging into that breast just sounds like a really sucky thing....sigh. I know you all understand.",
      "MessageIndex": 138,
      "PostDate": "21/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 18, 2017 06:26AM gb2115 wrote: Maybe call the place you are having the MRI done at...if they already have the order from your doc they may be able to call your doctor to obtain the correct order that includes contrast. Might save you a return trip to the doc. My doc botched my mammogram order but the radiology department was able to handle the fix over the phone for me. Honestly, if you have normal kidney function I wouldn't worry too much about the contrast. ",
      "MessageIndex": 5,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857061",
      "Title": "MRI without contrast? Reliable? JessD Claudia30"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 22, 2018 03:07AM gb2115 wrote: That's great to get some reassurance and direction from your RO!! I have yet to see any shrinkage. My radiated breast is slightly larger than the other (which is the opposite of how it used to be). However it's not noticeable through clothing. I see my RO for 1 year follow up next week. I will tell her about the tenderness but honestly don't expect her to say much.",
      "MessageIndex": 3,
      "PostDate": "22/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862692",
      "Title": "Swelling of surgical site and underarm since beginning rads? LittleLori LittleLori"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 15, 2018 04:31PM gb2115 wrote: My radiologist actually examined me and repeated the ultrasound herself. She said (about the tumor) \"I want to find out what that is.\" It wasn't until immediately after the biopsy that she told me she was worried about it. I appreciated her honesty but it sure ruined the rest of the day, wiping away all hope. At that moment I knew she knew exactly what she was looking at.",
      "MessageIndex": 2,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858192",
      "Title": "How much time the Rad spends with you djmammo MelissaDallas"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 23, 2019 11:58AM gb2115 wrote: Yes, increased sweating (and associated yuck) for sure after sentinel node biopsy and lumpectomy. It eventually went away.",
      "MessageIndex": 5,
      "PostDate": "23/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869407",
      "Title": "Armpit sweat and pain Labmom3 Spookiesmom"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 14, 2017 06:30PM gb2115 wrote: Yes I think you wait and cross your fingers... that's what they are doing with me! I was told call if I have weird symptoms that last for more than 3 weeks. Otherwise mammo yearly, MRI in 6 months--i think that was added because I expressed concern that a close family member was just diagnosed with a stage 4 recurrence after a long long time NED. I'm not sure they would have chosen that otherwise but I am ok with it because the last tumor appeared and grew to 1 cm after a clear mammogram. I feel like more frequent checks is the way to go!!!",
      "MessageIndex": 27,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/857303",
      "Title": "Monitoring for recurrence - what do your doctors suggest? mellee gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 26, 2018 04:56AM gb2115 wrote: Yes, the bra near the sentinel node problem. This happened to me. I ended up cutting a half moon shape out of the side of my bras and camisoles to remove the fabric that was hitting the area. I still cut that part away, a year and a half later because I can't stand to have anything touch it or put any pressure on the area. So there's that. I also found some Hanes bras at Target that were a little lower cut on the armpit, didn't have to chop those up. ",
      "MessageIndex": 3,
      "PostDate": "26/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865420",
      "Title": "Postop sentinel node surgery suggestions needed for bra Duffys_Mom Duffys_Mom"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 13, 2019 05:48PM gb2115 wrote: I chose a lumpectomy because I had a relatively small tumor and I wanted an easier recovery time. If I had had more than one area that needed to be removed, I would have done a mastectomy. That's how I chose.",
      "MessageIndex": 12,
      "PostDate": "13/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/870338",
      "Title": "Lumpectomy vs mastectomy how did you decide? April0315 April0315"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Dec 10, 2017 07:56PM gb2115 wrote: mine was sunken for awhile after surgery, but that eventually went away",
      "MessageIndex": 4,
      "PostDate": "10/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860760",
      "Title": "Underarms different after surgery? Guenhwyvar Peregrinelady"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Sep 5, 2018 09:24AM gb2115 wrote: I think it could feel bigger because of swelling/inflammation around the tumor. It did get a needle stuck into it. I feel like mine felt bigger, but it was definitely irritated. I kept poking it too (I guess to keep checking it), so that probably didn't help. I had 4 weeks in between my imaging and my surgery, and my tumor grew by only 0.1 cm. So, 1.1 cm to 1.2 cm. ",
      "MessageIndex": 1,
      "PostDate": "05/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867015",
      "Title": "Tumor became BIGGER after biopsy!!!!!!!!!!!!!! Danaqtr Jiffs"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 4, 2017 09:29AM gb2115 wrote: Sorry you are going through this. Are you going through a breast center that has a nurse navigator? I had one and found talking with her to be just the thing when I was overwhelmed (which was a lot---I called her a lot!)",
      "MessageIndex": 2,
      "PostDate": "04/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853971",
      "Title": "Diagnosed yesterday with IDC and I'm feeling overwhelmed Kmbrll54 Msjackiefan"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 20, 2017 06:58PM gb2115 wrote: Where do you live? Waiting weeks for a diagnostic mammogram seems like an awfully long time.",
      "MessageIndex": 1,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Dec 20, 2017 03:00PM gb2115 wrote: I was pretty normal there after and during radiation, but for a couple weeks after surgery, it was like a dead animal in there. Seriously. I'm glad that went away. I think our bodies just react to things in weird ways sometimes.",
      "MessageIndex": 8,
      "PostDate": "20/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/755901",
      "Title": "Strange smell from radiated armpit? LVLinda Staceybee"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Sep 25, 2018 06:23AM gb2115 wrote: If it were me I would still go to be completely sure.",
      "MessageIndex": 1,
      "PostDate": "25/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867411",
      "Title": "Breast lump that has gone down in 24 hrs ARW1987 ARW1987"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 8, 2017 06:38AM gb2115 wrote: My story is similar in that my gyn found the lump. Almost exactly a year ago. The crying and numb feeling is normal. I remember thinking it felt weird that the world just kept turning while my personal world stood still. Its going to be a difficult time waiting for your tests, the surgeons appointment and then for results. Waiting for this stuff is torture. One day, one moment at a time. Cry as much as you want, it's not weakness it's normal. I found it easier to tell close friends, but I am terrible at hiding things. So that worked for me. Have you scheduled your mammogram yet? If possible see if you can find a place that does same day results (not always possible). It helps cut some of the waiting anxiety torture time. ",
      "MessageIndex": 1,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859221",
      "Title": "My gyn found a mass deep in my left breast on Fri Oct 6th lifeisabeach59 lifeisabeach59"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 8, 2017 03:04PM gb2115 wrote: My mass was pretty deep too! My surgeon isn't strictly a breast surgeon either...she also covers emergencies for the hospital and does some general surgery, but she does a whole lot of breast cancer surgery. So much my oncologist was very familiar with her, and my gyn recommended her to me. She did a great job and I trust her. Hopefully you will like this doctor!! And if you don't you can always get a second opinion!!",
      "MessageIndex": 8,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859221",
      "Title": "My gyn found a mass deep in my left breast on Fri Oct 6th lifeisabeach59 lifeisabeach59"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 8, 2019 07:40PM gb2115 wrote: They do like you to heal first. I think I had about 8 weeks in between. They don't like to go longer than 12 weeks.",
      "MessageIndex": 7,
      "PostDate": "08/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870248",
      "Title": "Radiation after lumpectomy Karmic108 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 11, 2019 06:04AM gb2115 wrote: I don't know. I used to get zingers but it doesn't seem to happen anymore. I do get a whole lot of aching in the area though. I figure that will be with me forever at this point.",
      "MessageIndex": 2,
      "PostDate": "11/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/870947",
      "Title": "Zingers..??? Rrobin0200 Rah2464"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Dec 11, 2017 06:00PM gb2115 wrote: Sorry. :-(. It's hard to believe, but you will get through this. I had a positive lymph node too and it ended up being ok in the end, no indication that it spread anywhere else. It only added extra radiation to my treatment plan. So next step is meeting with the team and you already have an appointment so that's great. Do you know any more detailed pathology (like hormone receptor status) or tumor size?",
      "MessageIndex": 1,
      "PostDate": "11/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860791",
      "Title": "Just got the call LBoyMom claireinaz"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 26, 2017 07:39AM gb2115 wrote: I think I read somewhere that the risks for MRI contrast are much lower than that of CT contrast. They will do kidney function tests prior to make sure your kidneys can clear the dye. Don't worry. I did two MRIs and they were way easier than some of the other tests!!!",
      "MessageIndex": 4,
      "PostDate": "26/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/854503",
      "Title": "MRI Questions bowoky gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Dec 11, 2017 05:51AM gb2115 wrote: Hmm... questions really depend on what they find! I suspect you'll get an ultrasound done too--if you've got a radiologist looking at everything on the spot. I think they are often done in tandem for diagnostic purposes, especially since you are young and likely have denser tissue. Hang in there...let us know what happens!!",
      "MessageIndex": 1,
      "PostDate": "11/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860775",
      "Title": "Mammogram tomorrow, any suggestions on questions Will0w MTwoman"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 1, 2018 07:49PM gb2115 wrote: My advice is to keep up with your post surgical stretching. Radiation will tighten up your scar tissue. Keep it stretched and moving!!",
      "MessageIndex": 4,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864333",
      "Title": "Radiation prehabilitation? ChelseaSculler ChelseaSculler"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 20, 2017 03:04PM gb2115 wrote: I don't think that necessarily means it's something bad, even if it's out of the same office. It could just be standard practice that radiology results get resulted by the doctor whereas blood work results can be given by a nurse or medical assistant. I've seen it both ways. I also work in a clinic environment, and I know for us, we'd discuss blood work because it's pretty routine, but if someone was sent out for a scan, that's up to the doctor to discuss---even if we can see the scan results. I think the problem is giving you results for something like an ultrasound could generate questions from you that the nurse or whoever can't answer. It puts them in a bad place.",
      "MessageIndex": 6,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/854323",
      "Title": "Waiting for ultrasound results samiiwaters samiiwaters"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 12, 2018 11:29AM gb2115 wrote: I had pain for awhile after surgery, especially the underarm area. Has your surgeon evaluated the hard area? Could be a seroma in the surgical area.",
      "MessageIndex": 1,
      "PostDate": "12/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867735",
      "Title": "Still painful 3 weeks after surgery and lump Danaqtr Britspeech"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 27, 2018 12:29PM gb2115 wrote: I told my parents and gave them permission to tell whatever family they thought appropriate so I didn't have to deal with it. And then I let the news spread at work and church just so that people wouldn't wonder why I was walking around looking so unhappy. It was easier for me to have people know. My coworkers really needed to know---that was the biggest thing, but I work in a small clinic and we all know each other pretty well. It would have been hard to hide it. And I didn't really want to anyway. However, I did not do a general announcement, like on Facebook or anything, since I don't like to draw attention to myself. There are many people I know that don't live near me, that have no idea I was diagnosed. And I'm ok with that. Honestly, tell whoever you want to tell. There's no right or wrong choice there.",
      "MessageIndex": 4,
      "PostDate": "27/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868555",
      "Title": "Who do I tell? Suzyshacklechick AliceBastable"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Sep 23, 2017 02:04AM gb2115 wrote: Flu shots are IM injections...get it in your rear!!",
      "MessageIndex": 12,
      "PostDate": "23/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/858828",
      "Title": "Flu and/or other shots? Nodes Removed In Both Arms woodstock99 woodstock99"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Dec 10, 2017 06:12AM gb2115 wrote: My radioactive injection (I think I just had one) didn't hurt more than a flu shot. For the wire placement they numb you up like before your biopsy. For the wire placement, if something hurts let them know!!!",
      "MessageIndex": 1,
      "PostDate": "10/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860757",
      "Title": "Scared about radioactive injections for SX Nurzrobin DownNotOut"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 15, 2017 02:42AM gb2115 wrote: Your nerves get all messed up with these types of surgery. It will take awhile probably to go back to normal. I still get weird tingling in my armpit and down my arm if I touch a certain area on my breast--and my surgery was 7 months ago. It's so weird. But you're only 3 weeks out...so you are still very much post-op.",
      "MessageIndex": 6,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856100",
      "Title": "Post Lumpectomy - veru sensitive breast Valencia1 Beachygirl31"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 17, 2017 07:58PM gb2115 wrote: I wonder if it's more due to her age, not sure just an idea. Are they trying to figure out why her blood counts are unexplainably low? They might have standards of care that really do prevent them from doing certain things at certain levels. My career is in a different medical field than heme/onc, but we have restrictions like that, not set by any insurance provider but just good practice. Being one or two points off something in the blood work really does change the plan. I don't know much about counts and chemo though. You could ask the doc for a deeper explanation, or definitely the second opinion!!!!",
      "MessageIndex": 1,
      "PostDate": "17/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/855210",
      "Title": "Mother just diagnosed. Searching for info and options for her Googler007 MTwoman"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 10, 2019 06:28AM gb2115 wrote: I think I gained 5 or so pounds during radiation, they never weighed me or seemed to care. ",
      "MessageIndex": 14,
      "PostDate": "10/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/774202",
      "Title": "Radiation and Weight Loss mary7 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 8, 2017 06:38AM gb2115 wrote: Oh and welcome to BCO!!",
      "MessageIndex": 2,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859221",
      "Title": "My gyn found a mass deep in my left breast on Fri Oct 6th lifeisabeach59 lifeisabeach59"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Dec 29, 2017 09:50AM gb2115 wrote: I think with mastectomy whether or not they recommend radiation has to do with the location of the tumor, especially if it's close to the chest wall. I think they also like to sometimes radiate the scar area. I'm not sure what makes them do that though. However, it kind of makes sense. If cells are remaining they are likely to be near the surgical scar, or near the biopsy track. Even with a mastectomy you still have some breast tissue remaining, even if a teeny tiny amount. Your tumor was also pretty large, so maybe that plays a role?? I would ask your doctor (radiation oncologist) to explain their reasoning. They probably have a specific reason and it might help you a lot to make a decision (one way or another), if you can fully understand why they are recommending it.",
      "MessageIndex": 2,
      "PostDate": "29/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/861157",
      "Title": "Anyone declined Radiation and why? notinuse Shenandoah"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 26, 2019 06:16PM gb2115 wrote: I had allergic reactions after surgery, to the skin prep, then the glue, then the radiation lotion. The only thing that helped my itching was cold wet washcloths. I eventually had to get a steroid shot to calm it all down. But the washcloths can help even if very temporarily.",
      "MessageIndex": 2,
      "PostDate": "26/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870045",
      "Title": "Itchy Skin..... Ugh! Mom2Sarah Marymc86"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 7, 2018 05:51AM gb2115 wrote: That's really neat that you can get the clothes dipped, I may look into that. I've looked at the Columbia shirts, glad to know someone else is finding them effective!",
      "MessageIndex": 2,
      "PostDate": "07/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/862189",
      "Title": "Has anyone tried bug repellent clothing? gb2115 meg2016"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Sep 20, 2017 04:12AM gb2115 wrote: I wonder if whether or not you still get radiation depends on what they find in your lymph nodes?",
      "MessageIndex": 1,
      "PostDate": "20/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/858782",
      "Title": "ALND with radiation Jnnmn7 xxyzed"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 31, 2018 07:29AM gb2115 wrote: Yes, delayed bruising definitely is normal!! It may take a very long time to go away. And over time gravity might pull the bruise down to the bottom of your breast. That was my experience and they told me it was normal!",
      "MessageIndex": 3,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/862098",
      "Title": "Bruising after Lumpectomy Veeder14 Veeder14"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 18, 2019 07:52AM gb2115 wrote: My scar tissue is still tender to the touch, and my surgery was Nov of 2016! I try my best not to touch it, lol.",
      "MessageIndex": 1,
      "PostDate": "18/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/871077",
      "Title": "Painful Lumpectomy Scar Tissue? kec1972 kec1972"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 18, 2019 03:00PM gb2115 wrote: No problem! Take care!",
      "MessageIndex": 3,
      "PostDate": "18/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/871077",
      "Title": "Painful Lumpectomy Scar Tissue? kec1972 kec1972"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 5, 2018 12:26PM gb2115 wrote: My sentinel node biopsy hurt a lot, and the painkillers only helped a little bit. It's because they end up disturbing the nerves in the area during surgery. And painkillers don't help much with nerve pain. I think after a couple of weeks it got better. Sorry you are uncomfortable, hang in there!!",
      "MessageIndex": 21,
      "PostDate": "05/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/743290",
      "Title": "pain after sentinel lymphnode biopsy mimi1964 Kushie"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 27, 2017 10:25AM gb2115 wrote: I don't understand why they aren't doing a biopsy honestly. And yes the nail polish thing is weird. Seems like a harsh substance to put on delicate nipple tissue. Do you think she said that in the hopes it would cause the discharge to build up so she could get a better sample?",
      "MessageIndex": 2,
      "PostDate": "27/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859693",
      "Title": "Clear Nail Polish on my nipple... HollyErin HollyErin"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 3, 2018 07:20PM gb2115 wrote: Yay for good news!! Sorry about the itching. Have you tried a cool compress? Take a washcloth and rinse it with cold water, wring it out and put it on the itch. I did that on some severe dermatitis I had last year. It took the edge off but I eventually had to get a steroid shot to calm it down. Maddening itching that was. Make sure they list that as an allergy for you!! Definitely go back if it doesn't turn a corner (allergic dermatitis has to run it's course). There are things they can do.",
      "MessageIndex": 8,
      "PostDate": "03/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/863674",
      "Title": "Rash post procedure wildflowerjoy INFJen"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 9, 2018 05:33AM gb2115 wrote: Should be no problem at all...the radiation beams don't extend beyond the radiation field. So if your sunburn is forehead level or down by your side it shouldn't be near the radiation unless they are doing things very wrong!!  ",
      "MessageIndex": 1,
      "PostDate": "09/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864477",
      "Title": "Got sunburn on lower arm-is it a problem in radiation? JosieO JosieO"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 9, 2018 07:25PM gb2115 wrote: I get paranoid about things too... I worry about lots of things so I get it!! :-)",
      "MessageIndex": 3,
      "PostDate": "09/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864477",
      "Title": "Got sunburn on lower arm-is it a problem in radiation? JosieO JosieO"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 28, 2017 03:23PM gb2115 wrote: I think core needle biopsies can also be punch biopsy. Sometimes they use a spring loaded gadget that kind of punches the tissue out. I think...don't quote me on that though. Or they can use vacuum suction, which they used on me. I wasn't prepared to be vacuum suctioned out, since I had been prepared mentally (by what I read) for the clicking of the spring loaded gadget. I remember laying there thinking, there is a vacuum cleaner in my breast....how odd.",
      "MessageIndex": 5,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851848",
      "Title": "Worrief Momof6kds MelissaDallas"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 19, 2017 12:03AM gb2115 wrote: Yes, I had one. My Onc said she preferred it to Oncotype. And since that time, it has been added to the standards of care for the ASCO. It came back as low risk luminal A. That meant, even though I had one positive axillary lymph node, we decided to not pursue chemotherapy because that would have added only 2% to the long term survival. So instead of 95% it dropped to 93% (or something like that.) I hope it was the right choice, I had a family member just have a metastatic recurrence after 17 years NED from the same type of breast cancer. But we are trying to predict the future and that's so hard when we are not at all in control of it.",
      "MessageIndex": 4,
      "PostDate": "19/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/859482",
      "Title": "Mammaprint-who has had one? LizabethM gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Dec 5, 2017 05:13AM gb2115 wrote: TaRenee---I totally get what you said---I had those same thoughts. I actually found myself worrying about not getting chemo, and didn't understand why my MO's nurse was so happy for me to not get it. But yes, like FarAwayToo said, Mammaprint shows little benefit. And that's what my MO said...she said the risk of side effects outweighed the benefit for my luminal A cells.",
      "MessageIndex": 27,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/859482",
      "Title": "Mammaprint-who has had one? LizabethM gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Dec 6, 2017 01:30AM gb2115 wrote: Amelia01---that's interesting that they aren't using the Mammaprint more in Europe. It was invented in Europe--Netherlands I believe. You'd think it would be popular. Things are definitely so different. I think here in the US, tumor markers aren't often routinely done unless the cancer is advanced or they are monitoring metastatic disease.",
      "MessageIndex": 29,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/859482",
      "Title": "Mammaprint-who has had one? LizabethM gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 3, 2018 01:02PM gb2115 wrote: They can also give it to you in your rear end, I think. Not pleasant, but it's better than risking lymphedema! And if you go to the doctor for it (vs a pharmacy), it should be behind closed doors.",
      "MessageIndex": 4,
      "PostDate": "03/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/867564",
      "Title": "FluMist tsoebbin hugz4u"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 2, 2018 10:16AM gb2115 wrote: Hi LiveWellToday---I had a sore throat through much of radiation (also had the nodes near my collarbone radiated). It went away shortly after radiation stopped. Hopefully the antacid will start to work and give you some relief. Have you tried something like Boost to try to get some nutrition in? There's a higher calorie one---Boost Plus. You can also find store brand equivalents right there next to it on the shelf. I come across this in my career and sometimes people with poor appetites and taste changes do better with a liquid supplement, especially if it's nice and cold. Maybe a popsicle for the throat? They can also give you a mouthwash to swallow that can numb long enough for a meal. Doctor would have to write a prescription. Hope you feel better soon!",
      "MessageIndex": 1,
      "PostDate": "02/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/867548",
      "Title": "Stomach Pain & GERD from radiation? LiveWellToday Bgville"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 31, 2017 01:58PM gb2115 wrote: Yes, it's amazing how much bruising can pop up! You may even see bruising showing up at the bottom of your breast that wasn't there before. The blood inside can sometimes drift over time with gravity to the bottom. It's weird.",
      "MessageIndex": 25,
      "PostDate": "31/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 14, 2017 07:20PM gb2115 wrote: I knew my results the next day, but I think it's usually slower than that. If it helps try not to search so much. There's really nothing you can do until you have the biopsy and get some answers. Until then you wait. Try to fill your time with pleasant distractions!!",
      "MessageIndex": 20,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/859886",
      "Title": "Scared to death Shyann30101 Georgia1"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 5, 2018 03:11AM gb2115 wrote: Sorry that your boss won't work with your schedule, I think it's mean to not try to give someone with cancer a little lee way. Do you qualify for FMLA? By the way, I am one year out from radiation and my radiated breast is larger than the other one. Not enough that you would notice with clothing in. It definitely did not shrink....",
      "MessageIndex": 14,
      "PostDate": "05/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862183",
      "Title": "Invasive Ductal Carcinoma Mrsmcg BarredOwl"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Dec 6, 2017 07:26AM gb2115 wrote: BarredOwl--thank you for clarifying!! :-)",
      "MessageIndex": 32,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/859482",
      "Title": "Mammaprint-who has had one? LizabethM gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 3, 2018 06:12AM gb2115 wrote: I had an enormous hematoma that didn't leave a lump. However, if yours does leave a lump it's not the end of the world--at least you will know what it is!!",
      "MessageIndex": 1,
      "PostDate": "03/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865587",
      "Title": "Hematoma after lumpectomy sunshine2609 mchappy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 14, 2018 07:11AM gb2115 wrote: The next day you'll probably be fine. Make sure your grandson is gentle around you though!!!",
      "MessageIndex": 1,
      "PostDate": "14/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863957",
      "Title": "Day after core needle biopsy Fixyourdog Fixyourdog"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 19, 2018 08:04AM gb2115 wrote: Mine didn't go down in size until well into radiation. I had a big hematoma though. Now, 2 years post surgery my cancer side is slightly larger (perkier lol), but has a slight dent where the scar is.",
      "MessageIndex": 2,
      "PostDate": "19/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867857",
      "Title": "Size of breast after surgery EdithMary gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 23, 2017 02:19PM gb2115 wrote: Trying not to cry and having to act normal is indeed torture. Do you have a place you can go and just let the emotion out? A good cry might really help, and it's totally ok to do that. ",
      "MessageIndex": 2,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 25, 2017 03:02PM gb2115 wrote: Did they give you an idea of when you might hear results?",
      "MessageIndex": 20,
      "PostDate": "25/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 26, 2017 09:30AM gb2115 wrote: That is indeed a long time...maybe you'll get lucky and hear a little sooner. I was told 48 hours, but knew at less than 24. However, I'm not sure that was a good thing...I think it was moved along because it was bad news. I don't know. Do whatever you need to, to get through---some people try to stay busy, it's also ok to Netflix binge watch, or do something to pamper yourself.",
      "MessageIndex": 23,
      "PostDate": "26/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 21, 2017 11:34AM gb2115 wrote: Oh you poor thing! Itching is the worst! There are lots of skin problems that are super itchy. If you don't already have a dermatologist, definitely see your PCP because they might be able to get you into a derm more quickly than if you called one yourself. Or maybe the PCP can even diagnose and fix the problem. There are things they can do to help your misery depending on what the issue is! I have gone through some horrid rashes in my time, some more recently, and have found that cold compresses can help the desperate need to scratch. The problem with scratching is you can open your skin up to infection, which you definitely don't need! Hope you feel better!",
      "MessageIndex": 3,
      "PostDate": "21/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857202",
      "Title": "Could this be symptoms? leslievasquez19 Daliddle1"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 11, 2018 07:05AM gb2115 wrote: The not wanting you to use coconut oil is because it's hard to completely wash off and will just make your burns worse. If any is left on your skin it will act like a boost on the skin surface, which is not what you want. And you can't scrub that off radiated or peeling skin. With lidocaine I think there's something about it being dangerous applied to broken skin, I don't know, maybe you absorb more of the active drug. I don't have an answer... I had problems during rads that took a dermatologist to fix. They couldn't help me at radiation because I ended up being allergic to the one product they wanted me to use. It was frustrating. If it were me, tomorrow I would bust in there and make them help you. I feel like there is a special bandage you can put on peeling skin to soothe it, but I don't know what it's called. I had to threaten going to the ER for sedatives...that got me an emergency derm appointment. But yeah if they specifically tell you to avoid a product definitely consider listening. And if you need the painkillers there is no shame in that. Hope you feel better! ",
      "MessageIndex": 2,
      "PostDate": "11/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862395",
      "Title": "Radiation doubts StageThree macb04"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 10, 2018 07:56PM gb2115 wrote: Every medical treatment comes with risk, but that doesn't mean those treatments are bad or poor decisions. And if you had had a mastectomy you still might have ended up with radiation. And mastectomy doesn't always come without problems. I am over a year out from radiation and honestly I am more scared that cancer cells escaped before surgery and are lurking somewhere else than I am of secondary cancer. These are things though that we just can't control even though we desperately want to. I have to tell myself stuff like this everyday--you are not alone. Try to rest in the realization that what is done is done, what you are worried about is really low risk, and celebrate that you finished radiation!!",
      "MessageIndex": 7,
      "PostDate": "10/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864498",
      "Title": "Radiation regrets...could use some emotional support:) Mama2boys Mama2boys"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 30, 2018 07:14AM gb2115 wrote: Did you go to the primary care doctor about your mouth and throat yet? I have dry mouth from tamoxifen and they have me using biotene. Maybe the biotene gel before bed would help. I have woken up with my tongue stuck to my retainer before, that is super fun. During the day, ACT lozenges are pretty good but not long lasting, just takes the edge off.",
      "MessageIndex": 13,
      "PostDate": "30/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/867548",
      "Title": "Stomach Pain & GERD from radiation? LiveWellToday Bgville"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 3, 2018 11:14AM gb2115 wrote: I agree seeing a GI sounds like a good idea. Your chronic sore throat prior to even getting radiation (if I understood you correctly) is something that really should be evaluated. ",
      "MessageIndex": 7,
      "PostDate": "03/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/867548",
      "Title": "Stomach Pain & GERD from radiation? LiveWellToday Bgville"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 18, 2019 02:07PM gb2115 wrote: Hi Mom2Sarah--- I think you can never really know if something is the right choice, you just make the best choice you can with the information you have at the time. Standard of care is generally based on the results of the Oncotype test (or in my case, Mammaprint, which is different but similar). Especially with negative nodes, if your Oncotype indicates you won't benefit from chemo, they'll probably recommend you go straight to tamoxifen. I had one positive node, but my Mammaprint results indicated that chemo would only reduce my risk of metastatic recurrence by like 3%, so my oncologist recommended against it. It was a choice that worried me at the time (like what if I really needed it but didn't get it), but in hindsight she was trying to spare me from a lifetime of damaging side effects that were more likely to happen than the 3% extra risk of the cancer returning. I think, also, I read somewhere that tumors that turn out to be low Oncotype and low Mammaprint are the kind that don't respond well to chemo...so giving it in those instances is a whole lot of treatment for something that doesn't work very well. I think I read that....I hope that's accurate. It's hard though---these are tough decisions. Once you get your oncotype results back, then you can have a better conversation with the oncologist about your choices. Make sure you tell them that you are worried about not making the right choice...they will probably know the best way to calm your fears on that. And about your tumor tissue---I believe that the pathology department of wherever you had surgery keeps a sample of your tissue on hand. I don't know how much they keep or for how long they keep it, but they do for some time. I had my Mammaprint test ordered about a week and a half after my surgery, so my hospital had kept my tissue as well. I'm sure there's some sort of time period that's standard. Definitely let us know what happens!!! ",
      "MessageIndex": 1,
      "PostDate": "18/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/870434",
      "Title": "Chemo Questions Mom2Sarah Runrcrb"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 16, 2018 02:37PM gb2115 wrote: Do they mean that the surgical margins weren't sufficient? That's information that comes about a week after surgery, once the surgical pathology comes back. I know my surgeon warned me prior to my lumpectomy that if the margins weren't good (meaning cancer cells found too close to the edge where they cut), there would have to be a second surgery. I think they do the best they can, but since cells are microscopic sometimes it doesn't work out on the first try.",
      "MessageIndex": 1,
      "PostDate": "16/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868377",
      "Title": "Found more cancer right AFTER lumpectomy viewfinder viewfinder"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 2, 2018 10:00PM gb2115 wrote: Yup, that's exactly what I had. Sorry about the itching. Maybe the Zyrtec will kick in soon!!",
      "MessageIndex": 6,
      "PostDate": "02/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/863674",
      "Title": "Rash post procedure wildflowerjoy INFJen"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 7, 2018 11:13AM gb2115 wrote: If you ate a chicken with cancer you would digest the cells. The cells would be broken down and destroyed by gastric juice. So no, I don't think it would make cancer markers go up. For the same reason nursing moms who are diagnosed haven't passed their cancer onto their nursing baby. I would not avoid eating chicken because of that fear. And I worry about a <<<whole>>> lot of things. :-)",
      "MessageIndex": 4,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/863752",
      "Title": "Tumor Marker tests Recap Egads007"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 2, 2018 06:14AM gb2115 wrote: Could it be a reaction to whatever prep they used on you in surgery? They clean the whole side I think. So up your arm, to your neck. I had a rash pop up everywhere they used whatever they used on me (could never get a name in order to list it as an allergy). Mine didn't itch thankfully but took about two weeks to fully disappear. Benadryl... I would call your surgeon this am. Let them know (they would want to know). They can advise but might want to see you.",
      "MessageIndex": 1,
      "PostDate": "02/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/863674",
      "Title": "Rash post procedure wildflowerjoy INFJen"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Dec 15, 2017 03:19PM gb2115 wrote: It sounds like whatever they saw before maybe disappeared? that's a good thing, right? Sounds like retesting in 6 months is an excellent plan!! :-)",
      "MessageIndex": 1,
      "PostDate": "15/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860923",
      "Title": "Ultrasound Findings - Confused need help Bmcocean RachaelJM"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 27, 2017 01:24PM gb2115 wrote: Ice it however they instructed you too, and try to get some rest. Try not to bump your breast if you can help it.",
      "MessageIndex": 47,
      "PostDate": "27/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/859886",
      "Title": "Scared to death Shyann30101 Georgia1"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 17, 2017 06:20AM gb2115 wrote: That was so nice of your doctor to call and check on you!!!",
      "MessageIndex": 27,
      "PostDate": "17/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/859886",
      "Title": "Scared to death Shyann30101 Georgia1"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 26, 2017 07:11AM gb2115 wrote: Just FYI with mammaprint if you don't have insurance coverage Agendia will subsidize the out of pocket cost so it's not horrible. I got a letter stating that but then insurance picked up the cost. Don't know if they do it for Canadians though--but maybe look to see who provides the mammaprint in Canada, might be Agendia, don't know. If so I bet they would help.",
      "MessageIndex": 11,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857327",
      "Title": "Oncotype Test Not Covered... worth it to pay out of pocket? JennD Traveltext"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 14, 2018 12:32PM gb2115 wrote: I used unscented lubriderm after, and that worked well.",
      "MessageIndex": 4,
      "PostDate": "14/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/861616",
      "Title": "What cream to use after radiation Tigger51 Sydsym"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 2, 2017 04:05PM gb2115 wrote: Ehhh...my surgeon sort of spearheaded my care but really the MO drove the bus for awhile after surgery. RO doing her thing separately. Now I alternate seeing MO and surgeon, with RO followups stuck in between. Surgeon decides on imaging, MO monitors tamoxifen, and they do a breast exam whenever I come in. Seems to be working ok. I don't know how much they communicate about my care though. No PCP involvement but I don't trust them anyway so it's ok.",
      "MessageIndex": 3,
      "PostDate": "02/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859827",
      "Title": "Who is main Dr that gets updates from all others after surgery? Ellyn27 Ellyn27"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 11, 2018 09:12PM gb2115 wrote: Yup. My RO said rads compromises the oil glands in the skin. I get like that still a year later. Every couple of nights I put some Vaseline on the dry areas before bed and it helps. Aquaphor would do the same thing, I just can't use it because I am allergic to lanolin.",
      "MessageIndex": 3,
      "PostDate": "11/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/863133",
      "Title": "Dry, itchy, chapped skin 3 months post-radiation? AngelaJL TWills"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 17, 2017 11:43AM gb2115 wrote: I have been using a body pillow since surgery. I sleep on my side (non-affected side), and because my lumpectomy scar is on the opposite far side, gravity on the scar area was really hurting. So I snuggle up to the body pillow and put it between my breasts to keep the scar tissue level. It works well, but sure takes up a lot of room in bed. I haven't been able to find a smaller pillow that's at the right height for what I need.",
      "MessageIndex": 12,
      "PostDate": "17/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/859187",
      "Title": "Breast Cancer Pillow's vampeyes BellasMomToo"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 30, 2018 12:48AM - edited May 30, 2018 12:49AM by gb2115 I had morning radiation (around 11 am), 32 treatments) I went to work for a bit, left to go to radiation ((right across the street), then went back to work. It was ok except fatigue towards the end of the week. I had a super flexible work schedule and a very relaxed and supportive boss, which really helped. Don't know if you will be able to ride your bike. I wasn't able to exercise like I did pre diagnosis, but I had some serious skin issues going on. I couldn't wear a bra and the feeling of a shirt rubbing while exercising (and as you mentioned the feeling of sweat) would have driven me batty. I did manage to get some walking in though.  ",
      "MessageIndex": 3,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864911",
      "Title": "Radiation scheduling and exercise advice? JLim5 JLim5"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Sep 6, 2017 01:47PM gb2115 wrote: I too had an MRI one that hurt a lot because of the location, though my ultrasound guided one barely hurt. I think it can be normal depending...but is it painful and rock hard/swelling, or just painful? Did they give you icing instructions, and advice on painkillers (i.e., Tylenol?)",
      "MessageIndex": 3,
      "PostDate": "06/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858467",
      "Title": "Just had biopsy..SO MUCH PAIN swg EveryTime"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 25, 2017 06:39AM gb2115 wrote: i think your axillary nodes can be reactive. Mine did that after lumpectomy, it was visible on my CT scan where the presurgery MRI was normal. No one was concerned.",
      "MessageIndex": 8,
      "PostDate": "25/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/850262",
      "Title": "Enlarged axillary lymph node after breast core needle biopsy Mahsa_sh akayb"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 3, 2019 09:08AM gb2115 wrote: Glad you are feeling better!!! Sneezes can be awfully hard on your body, funny as it is. You just never know. I threw my back out this summer spitting toothpaste into the sink. Bodies can be weird.",
      "MessageIndex": 8,
      "PostDate": "03/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869097",
      "Title": "Rib cage pain from radiation treatments Tinkerbell14 Tinkerbell14"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 15, 2018 11:03AM gb2115 wrote: Statistics drive me nuts. So I was diagnosed at age 38...my risk of developing BC at that point was mind-numbingly low (I can't remember the % but is extraordinarily low). But it happened anyway. And everyone pooh poohed my risk of developing lymphedema because I <<only>> had 3 lymph nodes removed (I was told the % risk was very low--RO even said \"it won't happen\"), and now I'm getting edema in my chest a year later. So it happened anyway. And I have a close family member who for all intents and purposes (statistically) shouldn't have developed a stage 4 recurrence 17 years after original diagnosis, but it happened anyway. Anyway, I laugh in the face of statistics. I guess being on the wrong side of statistics so many times will do that for you...make you expect the worst and wish to prevent it.",
      "MessageIndex": 39,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862397",
      "Title": "Is Tamoxifen Worth It? Dustien msphil"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 5, 2018 11:08PM gb2115 wrote: I have never heard of something like this. I don't think it works like that. If lots of areas require contrast vs no contrast it would be hard to do it all at once I think. It would also take forever...my last breast MRI a couple of weeks ago took forever. Imagine your entire body... ",
      "MessageIndex": 1,
      "PostDate": "05/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/863761",
      "Title": "Full body MRI? NTS chronicpain"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 16, 2017 04:03PM gb2115 wrote: The lidocaine feels like any other shot but really it wasn't bad. They get you nice and numb. I am a very nervous person too and I was upfront and told them about my anxiety so they took steps to calm me. I think that helped. Hopefully you won't need a biopsy! But if you do it'll be ok.",
      "MessageIndex": 2,
      "PostDate": "16/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857022",
      "Title": "Nervous Dreamspirit Abfmom77"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 1, 2018 01:57PM gb2115 wrote: I agree...if it's solid they won't get much on a FNA. Not sure why they don't want to just do a core needle biopsy.",
      "MessageIndex": 2,
      "PostDate": "01/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862148",
      "Title": "Solid nodule - should I see breast surgeon or have FNA first? Svet Rachel888"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 15, 2017 07:07PM gb2115 wrote: Sorry you have a hematoma... I developed a large and painful one about 6 hours after an MRI biopsy....that was the worst pain...it took about 3 months to fully dissolve. We sure go through a lot!!!",
      "MessageIndex": 7,
      "PostDate": "15/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856983",
      "Title": "Developed a hematoma after my lumpectomy LLS1993 Moderators"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 12, 2017 03:57PM gb2115 wrote: What exactly do they mean by high or low clinical risk?",
      "MessageIndex": 2,
      "PostDate": "12/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856861",
      "Title": "ASCO Adds MammaPrint to Adjuvant Treatment Decision Guidelines Moderators BarredOwl"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Sep 17, 2018 09:30AM gb2115 wrote: I feel like a lot of us on here have chosen lumpectomy.",
      "MessageIndex": 11,
      "PostDate": "17/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867240",
      "Title": "Why majority choose mastectomy not lumpectomy?? Danaqtr Bagsharon"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 25, 2019 11:39AM gb2115 wrote: Yes, I get a little fluid that collects on my flank, sort of under the armpit and sort of near the breast. It started after a deep skin biopsy near the area. I also had 3 lymph nodes removed. To control this, I either skip wearing a bra so the area drains, or I put a gauze pad in my bra for light compression on the area. It has been ok since I started doing all of this. I think I'm lucky that it's been controlled easily.",
      "MessageIndex": 1,
      "PostDate": "25/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/870578",
      "Title": "Flank lymphedema cattledoglv Rah2464"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 2, 2019 01:32AM gb2115 wrote: I didn't have a drain after lumpectomy/sentinel node biopsy. I had my procedure on a Friday, took the next week off work then went back the following Monday. It was too soon and I probably should have taken 2 weeks. I had a lot of pain from the node areas that needed pain meds for a couple of weeks. I guess it depends on which nerves get affected. The breast itself was fine with minimal pain Everyone is different but I definitely didn't bounce back quickly the way others have, and I was in great shape (taught aerobics) prior to diagnosis. I didn't get back into exercise until radiation was over. Even then the arm/shoulder just isn't the same. So you never know. I would plan on a solid week with a back up plan in case you need to take it easy longer.",
      "MessageIndex": 6,
      "PostDate": "02/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869094",
      "Title": "Recovery Time for Lumpectomy with sentinel node biopsy? kec1972 kec1972"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 2, 2019 04:53AM gb2115 wrote: Hopefully they will just take a couple of nodes. Probably unless they do in the OR pathology and find something. I had three taken out but I believe they were super close together so all considered sentinel. I had one with cancer found in it, so I had to get radiation to the node area. There was no indication that I had a compromised node based on imaging, so the 2.1 mm hanging out in there surprised everyone. Make sure you do the post surgical stretches they give you to prevent a frozen shoulder. I was allowed to start that at day 7 post op and still do them every morning. Otherwise it still tightens up 2 years later.",
      "MessageIndex": 11,
      "PostDate": "02/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869094",
      "Title": "Recovery Time for Lumpectomy with sentinel node biopsy? kec1972 kec1972"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 5, 2017 01:20PM gb2115 wrote: You could also ask another treating doctor...if your wife has a primary care doctor, or an OB. Ask their opinion. Many many many docs all know each other, and know the quality of each other's work, and who they'd go to themselves, or who they'd not go to. I have been working in healthcare for the better part of 2 decades...surgeons are not known for award winning personalities. That said, my surgeon is an absolute sweetheart AND does good work, but my understanding is this is an unusual combination.... :-)",
      "MessageIndex": 3,
      "PostDate": "05/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856669",
      "Title": "How to assess a surgeon's expertise/quality MLScott CGG"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 9, 2018 04:38AM gb2115 wrote: I also had immediate pinkness and some light swelling at the very beginning. It went away after a few days. They said it was unusual. It think maybe it happens more than they think. Then the real \"sunburn\" set in around week 2 or 3, can't remember now. Haha... proof that you get through it and it becomes a distant memory!!",
      "MessageIndex": 6,
      "PostDate": "09/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864413",
      "Title": "Infection and radiation Dac9969 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 5, 2017 07:46PM gb2115 wrote: How old are your girls?",
      "MessageIndex": 7,
      "PostDate": "05/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/859886",
      "Title": "Scared to death Shyann30101 Georgia1"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 13, 2019 02:59PM gb2115 wrote: Could it be from all the table laying you've had to do for the tests?? I ached for days after an MRI because of how I was positioned.",
      "MessageIndex": 5,
      "PostDate": "13/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/869305",
      "Title": "Pain after testing is this normal? gkidsnana gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 13, 2017 02:59PM gb2115 wrote: Hello!! I'm 38 and was diagnosed in October 2016. Finished radiation and am now on hormonal therapy. I have a young daughter, work full-time, and this is not how I envisioned spending her childhood or the prime of my life. It is hard for sure. And a lot of people don't understand, which I think makes it all the harder.",
      "MessageIndex": 11,
      "PostDate": "13/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853241",
      "Title": "Enjoying your 30s...and breast cancer! Jsut9802 Ella77"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 30, 2017 05:55AM gb2115 wrote: Adelozier---not necessarily with the age thing. Were you early stage, like 1 or 2? With the er/PR positive tumors they usually send the tissue out for genomic testing to see if chemo helps. Your doc might have you do it anyway, but mine didn't--i was lymph node positive but the genomic testing said little benefit from chemo so my MO skipped it. Please update us with what happens! Make sure your doctor knows about the numbness, but it's normal because the nerves around the armpit are irritated from surgery. It took a couple of months for mine to calm down, and even now it's still a little numb. I know it feels weird!!",
      "MessageIndex": 54,
      "PostDate": "30/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853241",
      "Title": "Enjoying your 30s...and breast cancer! Jsut9802 Ella77"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 30, 2017 11:00AM gb2115 wrote: I wonder...the fact that they sent it out for Oncotype/Mammaprint means someone is checking on that. You know, I had the surgeon telling me that I'd definitely get chemo (because of age plus positive node), and went as far as trying to set up an appointment to get a port. The MO got wind of that and put the hold on everything until the Mammaprint came back. It's not that the doctors didn't agree, but chemo decisions just weren't up to the surgeon and she made an assumption based on older information. She was beyond thrilled for me when we decided no chemo. It will be interesting to see what your oncologist recommends. In any event, don't stress yourself to the point of hysteria (I know, easier said than done). I remember that first appointment with the MO and the anxiety of the day, but you will get through it. One day you will look back with amazement at all you went through, and will know you are stronger than you could have ever imagined. And if you do end up needing chemo, make sure they are aware of your tendency towards allergy. They can handle that!!!",
      "MessageIndex": 58,
      "PostDate": "30/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853241",
      "Title": "Enjoying your 30s...and breast cancer! Jsut9802 Ella77"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "gb2115 wrote: I'm looking at these online and wonder if they work. I don't want to fear going outside like I did last year, but at the same time, I've managed to develop some truncal edema unfortunately over the last couple of weeks. So I clearly have unhappy lymph nodes. I want to make sure I protect the arm as much as possible so that that doesn't develop as well. :-( Anyway, I got some sun protective clothing last year and really like it. Wondering if the bug repellent clothing works well too. I feel like in a buggy area, I'd rather have something actually cover the skin rather than just spray with bug spray. Dx IDC in October 2016, stage 2A, 1.2 cm ER/PR+ Her2-, Grade 2, 1/3 nodes. Mammaprint low risk luminal A, Lumpectomy + radiation + tamoxifen. Age 38 at diagnosis. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/862189",
      "Title": "Has anyone tried bug repellent clothing? gb2115 meg2016"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 7, 2018 08:58PM gb2115 wrote: Thought about getting the yard treated too, for mosquitoes, but I am not sure because my daughter plays outside. I haven't delved into whether or not that's a concern.",
      "MessageIndex": 4,
      "PostDate": "07/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/862189",
      "Title": "Has anyone tried bug repellent clothing? gb2115 meg2016"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 21, 2018 01:07PM gb2115 wrote: I don't think you can radiate the same area twice. My radiation oncologist said I should always protect the area with sunscreen because that skin has received it's \"lifetime radiation dose.\" I would not use this info to skip radiation after a lumpectomy though, if it's what they say is needed. I think the risk of it coming back if you skip radiation is a lot higher than coming back in the radiated area. However maybe it's different for DCIS. For IDC you really have to do radiation after lumpectomy or you're kind of asking for it...",
      "MessageIndex": 1,
      "PostDate": "21/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864130",
      "Title": "Radiation a second time? 1Daisy9 Lula73"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 2, 2019 07:26AM gb2115 wrote: My doctor used both blue dye and a radioactive isotope to locate the sentinel node. I am glad she did because I had a positive node, so super glad that was taken out!!!!",
      "MessageIndex": 1,
      "PostDate": "02/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870129",
      "Title": "What are the dyes used in your surgery Karmic108 Karmic108"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 29, 2018 10:06AM gb2115 wrote: I had what was almost a micromet in one node...2.1 mm, so slightly larger. I had radiation to all the node areas. They didn't give me a choice, it was just the treatment planned. I was honestly glad to have it, because I didn't do chemo. I would worry that there were more cells hanging out in that area that they didn't find.",
      "MessageIndex": 5,
      "PostDate": "29/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865533",
      "Title": "Radiation recommendation for micromet in sentinel node Staceybee LeesaD"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Dec 2, 2017 10:34PM gb2115 wrote: Honestly yes surgeon makes sense to see first. For most women I think the first step is to remove the offending cancer (we all want it OUT). Some tumor sizes and pathology types do better with chemo first to shrink but I think the surgeon would have a grasp on that and refer to onc as needed early on. I had my surgery consult hours before final pathology reported and a lot of the conversation revolved around waiting to see what the pathology was before making any decisions. Once that came back there was no reason to see onc until later. I also think she presented my case behind the scenes at a tumor board. They all talk amongst themselves, pretty routine in medicine.",
      "MessageIndex": 12,
      "PostDate": "02/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860556",
      "Title": "Surgeon vs Oncologist First? DagnyT stexas"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 9, 2017 04:52AM gb2115 wrote: My lump started to hurt after the mammogram. I think it was because I kept poking at it. The biopsy did not hurt except for the numbing injection, which was extremely brief. My breast was also a little tender after the biopsy, but not enough to require pain relief after that first day. Ice is good. They should give you icing instructions. And be careful to not bump your breast afterwards. The lump was also a little swollen after the biopsy, and remained that way until the surgery a couple of weeks later. I don't think it liked being messed with. Sorry you are having to go through this. :-( As you can see, so many of us have been there...you will get through this!!!",
      "MessageIndex": 9,
      "PostDate": "09/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855975",
      "Title": "Worried in Louisiana AmyluvsAnt AmyluvsAnt"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 31, 2017 12:55PM gb2115 wrote: Wow...sorry to hear that. That's a lot to deal with. Having your case presented at the tumor board is a good thing though...that means your case will be discussed among the doctors so it's like getting a bunch of opinions at once.",
      "MessageIndex": 60,
      "PostDate": "31/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853241",
      "Title": "Enjoying your 30s...and breast cancer! Jsut9802 Ella77"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 26, 2017 08:58AM gb2115 wrote: Hi Danielle--welcome to BCO and so sorry that you've made your way here...that is definitely devastating news. It's completely understandable that you don't know what to feel. How old are you? I have a daughter too, but she's 4 (almost 5). If there's anything we can do to help, let us know. There is also a stage IV area of the BCO that is active, if you want to pop in there and introduce yourself.",
      "MessageIndex": 80,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853241",
      "Title": "Enjoying your 30s...and breast cancer! Jsut9802 Ella77"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Aug 3, 2017 07:03PM gb2115 wrote: Canadamom, so they need to make it official but it sure seems they typically have a good idea what they are looking at. But hopefully they are completely wrong, right?! Pathology is the next step. The type of cancer will play a major role in your treatment plan. Staging typically isn't final until after surgery. A lot of pieces need to come together and it's usually pretty slow so hang in there. Incidentally when breastfeeding (I pumped exclusively for 1 year) I only got half the milk out of the side that eventually grew cancer, compared to the other side. Makes me wonder if it was already growing in there, blocking ducts or just defective cells or something. I've heard of other women like this too. It's interesting.",
      "MessageIndex": 87,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853241",
      "Title": "Enjoying your 30s...and breast cancer! Jsut9802 Ella77"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 19, 2017 10:16AM gb2115 wrote: My mother had it, and paternal grandmother. Both are fine. My genetic (BRCA) testing was negative.",
      "MessageIndex": 27,
      "PostDate": "19/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853241",
      "Title": "Enjoying your 30s...and breast cancer! Jsut9802 Ella77"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Aug 3, 2017 11:51AM gb2115 wrote: Hi Canadamom, welcome to the boards! I am 39 with a young daughter (was 38 when diagnosed). Sorry you are here to join us...have you been diagnosed with breast cancer or are you waiting for the word from pathology on that?",
      "MessageIndex": 83,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853241",
      "Title": "Enjoying your 30s...and breast cancer! Jsut9802 Ella77"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 22, 2017 06:45AM gb2115 wrote: Hi Raque510, welcome! We just celebrated our 10th in September too and I also have one kid but she's 5. Well, on some days 5 going on 15, lol. Sorry you are here. I have no advice on the hormone therapy... having receptors at 5% kind of throws a wrench into easily following medical advice. Did they go over statistics one way or the other? I was 100% positive so that part was easy... ",
      "MessageIndex": 103,
      "PostDate": "22/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853241",
      "Title": "Enjoying your 30s...and breast cancer! Jsut9802 Ella77"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 1, 2019 07:13AM gb2115 wrote: Sorry you are in pain, talk to your doctor when you go for your next treatment. There's also a chance you just pulled a muscle in there!",
      "MessageIndex": 4,
      "PostDate": "01/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869097",
      "Title": "Rib cage pain from radiation treatments Tinkerbell14 Tinkerbell14"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 21, 2018 12:01PM gb2115 wrote: I would say the entire situation is stressful, but the stress definitely does not decrease once you get a diagnosis.",
      "MessageIndex": 1,
      "PostDate": "21/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867900",
      "Title": "Is it possible Dyannah Carol2018"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 6, 2017 10:24AM gb2115 wrote: I would think you would hear personally from your doctor about pathology following lumpectomy. Is this a phone call in advance of a regularly scheduled follow-up appointment after surgery? Did they say they'd give you the results in the office but are instead calling you?",
      "MessageIndex": 2,
      "PostDate": "06/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/859904",
      "Title": "pathology report jknight73 MTwoman"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Aug 29, 2018 03:10PM gb2115 wrote: Sorry to hear of your troubles. For about a year or so after surgery (and radiation), I had a lot of problems with sensitive skin. I reacted to pretty much everything that touched my body, and I still can't wear most jewelry. I developed an allergy to the radiation lotion. It was like allergy overdrive. During radiation, I itched so bad in the treated area (from the lotion) that my earlobes started itching and turning rashy. I had to get a steroid shot from a dermatologist to calm it down. I was never like that before surgery, and I haven't had problems within the past year (I use hypoallergenic everything). I have no idea what's going on with you, but I feel your pain because i remember that awful itching. Do you have any swelling of your left limb, or only the rash? Have you tried something like a Zyrtec?",
      "MessageIndex": 1,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/866902",
      "Title": "Post radiation skin issues-away from site? ctmbsikia ctmbsikia"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 22, 2019 06:03AM gb2115 wrote: I think I had pain after... I still do but not if I don't touch the breast. If I squeeze it gently it hurts. The lumpectomy scar area and the entire armpit have always been sore, and my collarbone lymph node area is sometimes tender. I am 2 years out and they just nod when I tell them about all of this. I think it's normal but keep an eye on it. Sorry you are in pain... hopefully it will lessen for you!! If it makes a difference, I eventually got used to it... I feel it but it's like normal life now.",
      "MessageIndex": 1,
      "PostDate": "22/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869466",
      "Title": "Breast achy and sore, 8 weeks past rads? Normal? kksmom3 Ingerp"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 3, 2017 01:36PM gb2115 wrote: Hi Adelozier---of course you can join. When were you diagnosed? I was diagnosed at 38 (will turn 39 pretty soon)---my daughter is 4. It's hard.",
      "MessageIndex": 37,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853241",
      "Title": "Enjoying your 30s...and breast cancer! Jsut9802 Ella77"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 25, 2017 12:51PM gb2115 wrote: Glad to hear your surgery went well! Definitely try to get some rest....it will probably hurt for awhile. My lymph node biopsy incision hurt for a good while afterwards.",
      "MessageIndex": 52,
      "PostDate": "25/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853241",
      "Title": "Enjoying your 30s...and breast cancer! Jsut9802 Ella77"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 6, 2019 03:15PM gb2115 wrote: I took Ativan for one of my biopsies and it helped a lot. Do what you need to do!",
      "MessageIndex": 6,
      "PostDate": "06/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869164",
      "Title": "Anti-anxiety med for stereotactic biopsy? Muffkin78 Muffkin78"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 25, 2019 01:50PM gb2115 wrote: Definitely! My OT is great. It's good that you are getting it looked at, there are all sorts of things they can do to make that better.",
      "MessageIndex": 3,
      "PostDate": "25/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/870578",
      "Title": "Flank lymphedema cattledoglv Rah2464"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Aug 28, 2018 09:28AM gb2115 wrote: Yeah, maybe a breast surgeon just for peace of mind. Maybe they'd order an MRI, which is super specific and good for dense tissue. I think they're probably right though, if they can't find anything on imaging, it's hard to biopsy because they won't know where to put the needle. They can't just stick a needle in an area that the patient says is tender, without something on the screen to guide them. It does sound like they are trying to help you and have made appropriate choices but can't really find anything specific.",
      "MessageIndex": 2,
      "PostDate": "28/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866872",
      "Title": "Should I get a second opinion? Dancing_on_the_moon Erinashley19"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 7, 2017 07:11PM gb2115 wrote: I actually wear my medic alert bracelet on the unaffected arm (left). I'm right handed and have to write a lot at work and use the computer mouse a lot. After one day of wearing it on the right wrist, I couldn't stand the way it was pressing on my skin all day. It's not tight at all, but the way I hold my arm/hand and write at my desk I guess caused the metal to dig in. Not great on an at-risk arm. This is the way I see it--ems will either read it or not. If they read it they will see it says to avoid the right side. If they don't read it, it wouldn't have mattered anyway because they will have ignored it no matter where it was. ",
      "MessageIndex": 18,
      "PostDate": "07/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/855275",
      "Title": "Alert bracelet for EMS & others not to touch affected arm.. Artista928 ksusan"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 19, 2017 10:44AM gb2115 wrote: When you read about it online, it seems they use it up to three positive nodes! I don't think the actual nodes being positive will affect your actual score though, meaning it won't make your score higher. If it's high it's high because of the cell biology. Hoping for the best for you!",
      "MessageIndex": 1,
      "PostDate": "19/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857112",
      "Title": "Does positive lymph nodes effect Oncotype DX score LoveBig MamaFelice"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 11, 2018 09:38AM gb2115 wrote: I have been on tamoxifen for nearly a year and my side effects are also bearable. Truly not awful and I have never once wished the pills away. I honestly don't remember what % survival the tamoxifen adds for me, but watching a close family member go through painful stage 4 recurrence makes it absolutely worth it to me. It comes down to what level of risk you are willing to take, and for me the couple % risk of blood clots, etc are better than the risk of this monster popping up in my bones. I also had one positive node which scares me. However my stage 4 family member had negative nodes many years ago. These cells just sit dormant until they decide to wake up. I'm slated to take tamoxifen for 9 more years. I honestly hope in 9 years they have something else I can take. I would not want to be without cancer prevention.",
      "MessageIndex": 4,
      "PostDate": "11/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862397",
      "Title": "Is Tamoxifen Worth It? Dustien msphil"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Sep 27, 2017 07:16PM gb2115 wrote: I know someone who developed LE after 16 years.",
      "MessageIndex": 13,
      "PostDate": "27/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/858943",
      "Title": "Does Likelihood of Lymphedema Go Down Over Time? Jojobird dsteaparty"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "19 hours ago gb2115 wrote: Yup sounds about right!!!",
      "MessageIndex": 8,
      "PostDate": "04/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/871869",
      "Title": "Is my oncologist doing everything possible LBG10 exbrnxgrl"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 23, 2017 10:38AM gb2115 wrote: Hey Epic---I had rads to all the lymph nodes after lumpectomy and a surprise positive node found on sentinel node biopsy (tumor was not large). My RO downplayed the lymphedema risk...she said it increases but only slightly, and said if I avoid being obese (I'm on the smaller side), that will help. I worry about it though. I have tightness and tenderness through the entire area, but doing my post-surgical stretches helps a lot. BUT, that all said, for me it was a no-brainer to get rads. I don't want a cancer recurrence, and for me, without rads the risk of local recurrence was just too high. I don't want to go through this ever again, so if that means my life changing in the future due to lymphedema, then I know I will get through that as well. You just never know where life will take you. I guess it just comes down to what level of risk you are comfortable with.",
      "MessageIndex": 2,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/855375",
      "Title": "Chance of lymphedema from rads? EpicSquirrel ksusan"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 13, 2018 09:22PM gb2115 wrote: I think it just means they are really not sure. Mine told me flat out she thought it was cancer, right after the biopsy. There's not much you can do but wait. I know that's not helpful and you want answers. Try to stay busy and distracted. Hope it all comes back good for you.",
      "MessageIndex": 2,
      "PostDate": "13/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/867754",
      "Title": "Radiologist predict the outcome? Lauraak JaBoo"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Aug 30, 2018 12:54PM gb2115 wrote: Feel better soon!!",
      "MessageIndex": 4,
      "PostDate": "30/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/866902",
      "Title": "Post radiation skin issues-away from site? ctmbsikia ctmbsikia"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 10, 2017 07:33PM gb2115 wrote: lol it's the opposite for me...they always want my right arm (which is the at risk one). The worst is the nurse at the RO office...she always gives me the blankest look when I tell her to use the other side. It's like she's never heard of lymphedema...",
      "MessageIndex": 6,
      "PostDate": "10/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/855275",
      "Title": "Alert bracelet for EMS & others not to touch affected arm.. Artista928 ksusan"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 27, 2019 08:38PM gb2115 wrote: They will ask you a ton of questions about family history of cancer, then discuss the risks/benefits of genetic testing. Then if you agree, they'll draw a vial of blood. It took me about 2 weeks to hear about results.",
      "MessageIndex": 2,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/870631",
      "Title": "Question about Genetic Testing MsRukia Yself"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 13, 2019 07:51AM gb2115 wrote: I was exhausted for about two weeks after my lumpectomy, I think the anesthesia messes you up for a bit, plus you use energy to heal. If your body is telling you to nap, you probably should. Hang in there!!",
      "MessageIndex": 19,
      "PostDate": "13/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869094",
      "Title": "Recovery Time for Lumpectomy with sentinel node biopsy? kec1972 kec1972"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 12, 2018 09:26PM gb2115 wrote: Mine didn't volunteer the information until I went to my 6 month follow up and asked why it was taking so long for the darkened skin to finish flaking off (I was afraid to peel it off). Then she shared with me the oil gland tidbit. So ladies, if your flaking radiated skin is just hanging out, no worries! A year out mine is almost back to normal skin. It took THAT long!! :-)",
      "MessageIndex": 9,
      "PostDate": "12/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/863133",
      "Title": "Dry, itchy, chapped skin 3 months post-radiation? AngelaJL TWills"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Sep 7, 2017 02:37PM gb2115 wrote: Grammy2be---don't panic! I think it hurting like that is the exception, not the rule. I had an ultrasound guided core biopsy with very little pain (only the numbing shot hurt like any other shot does). Minimal pain afterwards too. My MRI biopsy was slightly more painful, but that was because they had to do extra shots because of the location compared to where they had to go in because of machine positioning, so that got old pretty quickly. I don't remember the actual biopsy part hurting now that I think about it. Most people really do fine with these things I think.",
      "MessageIndex": 14,
      "PostDate": "07/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858467",
      "Title": "Just had biopsy..SO MUCH PAIN swg EveryTime"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 21, 2017 11:14AM gb2115 wrote: Hmm... I wonder if the cells cleared the sentinel node but then got caught in others? Yeah, the presence of cancer in the nodes will probably send you to radiation after the chemo. I wouldn't be surprised. I had one positive node and they radiated the axillary nodes plus the ones under my collarbone just in case. But they will eventually send you to a radiation oncologist for consult, so see what they say? But I don't know if it's a guarantee. Anyone out there have positive nodes but didn't need rads?",
      "MessageIndex": 1,
      "PostDate": "21/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857196",
      "Title": "Lymph node involvement Margaret67 Margaret67"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 12, 2017 04:10PM gb2115 wrote: Ok, BCO says this about the update: \"However, such patients should be informed that a benefit from chemotherapy cannot be excluded, particularly in patients with greater than one involved lymph node.\" It's not really the same thing...there is a big difference between someone being told they would likely benefit, and being told that the benefit could not be excluded. I'm nitpicking here, but I feel like BCO changed the wording, which I interpret differently when I read it. Yes, you have high clinical risk and at least one positive lymph node---therefore no one can guarantee that you won't have recurrence after skipping chemo--that is a very good thing for a doctor to explain to a patient. That's why the benefit can't be excluded (i.e., no one can see the future), but to say that they are likely to benefit is an extremely predictive statement that the ASCO doesn't make. Unless I am reading the ASCO statement (on the ASCO website) incorrectly.",
      "MessageIndex": 3,
      "PostDate": "12/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856861",
      "Title": "ASCO Adds MammaPrint to Adjuvant Treatment Decision Guidelines Moderators BarredOwl"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 10, 2019 03:16PM gb2115 wrote: Glad you didn't sneeze!! Hoping for good results for you!",
      "MessageIndex": 15,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869246",
      "Title": "What if I sneeze? Stereotactic biopsy Muffkin78 reflect"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 1, 2017 09:57AM gb2115 wrote: I had very little pain with the core needle biopsy. Ice it afterwards and follow their instructions. I think I took Tylenol later that night, but didn't need any the next day. And I was ok at work the next day, though I did continue the icing just in case. I don't remember the experience being particularly painful.",
      "MessageIndex": 8,
      "PostDate": "01/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855660",
      "Title": "Core Biopsy Tomorrow - need advice LadyTL djmammo"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 6, 2017 12:04PM gb2115 wrote: Hi Mooshi, It sounds like I had a similar path to what you're going though---except I was grade 2. I had one positive node (just enough to be bigger than a micromet) with the other 2 clear. They sent me for a CT and bone scan as well...thankfully I was able to do those on the same day, so only one IV. It was hard waiting for results because I had to wait through the Thanksgiving holiday. But thankfully, everything was clear. Don't have any resources for you---but keep in mind that even with a positive lymph node, many many doctors don't send early stage breast cancer patients for the scans anymore because they usually turn up with clear results. My surgeon sent me for tests, but I get the impression the oncologist didn't find them necessary. Just a thought. That helped me worry **a little** less! I still worried though. You are not alone! :-) The bone scan was easy by the way!!",
      "MessageIndex": 1,
      "PostDate": "06/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/855831",
      "Title": "Unofficially Stage II - Waiting for CT Scan and Bone Scan Mooshi nye1980"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 22, 2018 11:19AM gb2115 wrote: I was about 21 or so when my mom told me she had breast cancer. She already had her diagnosis. It turned out ok, and I wasn't upset for not knowing about the biopsy in advance. I don't know what you should do, but thought I'd share that. With my own cancer/biopsy, I ended up calling my parents to let them know ahead of time, but struggled with whether or not that was the right choice. I almost didn't tell them. ",
      "MessageIndex": 2,
      "PostDate": "22/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862725",
      "Title": "When to tell adult children Jat1228 Jat1228"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 21, 2019 05:45AM gb2115 wrote: When is your surgery? You could be pretty sore. I had a ton of pain but not everyone does Maybe have a bunch of button down shirt. Taking shirts off was the worst. And set it up where you only have super light things to lift.",
      "MessageIndex": 5,
      "PostDate": "21/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/871004",
      "Title": "Questions after surgery. Sattaylor AliceBastable"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 18, 2017 05:56PM gb2115 wrote: Sorry you have to go through this. When is your ultrasound?",
      "MessageIndex": 2,
      "PostDate": "18/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854280",
      "Title": "Slightly worried. Any advice/experiences Freshmustard Freshmustard"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 12, 2018 09:49AM gb2115 wrote: Not sure, but tamoxifen is a widely used generically available drug so it should be on the lowest tier of your plan if you have a tiered drug plan. If it's not, I do believe it's on the lower cost formularies at some of the retailers (I think I saw it as $9 on the Target formulary). I have a Cigna commercial plan (via employer) and my tamoxifen is actually free. It's considered preventative. That's pretty smart for them to do that. It costs them a lot less to pay for my tamoxifen than to pay for a stage 4 recurrence... ",
      "MessageIndex": 20,
      "PostDate": "12/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862397",
      "Title": "Is Tamoxifen Worth It? Dustien msphil"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 29, 2019 06:13PM gb2115 wrote: I had 6 weeks of radiation, including the nodes. I also had breast radiation so I don't know if it's different when they only target the nodes. They might go after your supraclavicular nodes too.",
      "MessageIndex": 2,
      "PostDate": "29/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870709",
      "Title": "How long is a Course of radiation for axillary nodes? B-A-P RebzAmy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 5, 2019 09:59AM gb2115 wrote: I was fatigued, but generally not until Fridays. It was significant on Fridays though. I work full-time, but my job was kind to let me kind of come and go as I needed during radiation. I probably went home early those days, I can't remember.",
      "MessageIndex": 6,
      "PostDate": "05/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869684",
      "Title": "How Fatigued were you during rads treatment? kec1972 Carol2018"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 26, 2018 07:40PM gb2115 wrote: I wear a medic alert bracelet telling them to stay away from my right arm. I developed truncal lymphedema after being assured and reassured by my medical team that having only 3 lymph nodes removed meant my risk was extremely low. So the bracelet goes on every day!!",
      "MessageIndex": 9,
      "PostDate": "26/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/862676",
      "Title": "Blood draws and BP on effected arm Beachygirl SummerAngel"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 31, 2018 02:34PM gb2115 wrote: Do you think no creams because it's only 15 sessions? My skin damage didn't show up until a few weeks into my 6 week run of radiation. I don't know, just speculating. Maybe have your mom ask her radiation oncologist what the thought process is. I'm sure the 4 day a week thing is whatever protocol they are using. Out of 6 weeks I had two that were 4 treatment weeks, because I did radiation over the holidays and I think one Friday their machine was broken. Gotta do what you have to do...",
      "MessageIndex": 3,
      "PostDate": "31/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868063",
      "Title": "Our Rads center is wierd !!!! Danaqtr gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 21, 2017 10:26AM gb2115 wrote: It's a tiny bit painful---the lidocaine shot hurts like any other shot, but I don't remember it hurting anymore than that. Otherwise, I know for mine I didn't feel anything once it got numb. The anxiety was worse than the actual procedure. You will be sore afterwards, once the local wears off. Mildly sore like needing Tylenol. They also have you use ice packs on a rotating schedule.",
      "MessageIndex": 8,
      "PostDate": "21/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857022",
      "Title": "Nervous Dreamspirit Abfmom77"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 3, 2019 05:27AM gb2115 wrote: What does your radiation oncologist make of it all?",
      "MessageIndex": 1,
      "PostDate": "03/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870795",
      "Title": "Chest feels like it's on fire after 8 weeks out from Radiation gwydiana gwydiana"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 14, 2018 12:32PM - edited Jan 14, 2018 12:32PM by gb2115",
      "MessageIndex": 5,
      "PostDate": "14/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/861616",
      "Title": "What cream to use after radiation Tigger51 Sydsym"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 24, 2018 04:02AM gb2115 wrote: I also would try to get all 3 biopsied, might as well if they are already in there. I also agree that once you're numb, it's not a big deal. The biopsy itself is actually pretty quick",
      "MessageIndex": 7,
      "PostDate": "24/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867948",
      "Title": "2 or 3 biopsies?? What should my daughter do? Sanddollar7 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 25, 2019 02:05PM gb2115 wrote: My sentinel node incision was right near the armpit and further away from the breast than what it sounds like a lot of people had, but I think it's individual depending on which nodes \"light up\" while they are checking for the sentinel node. If your nodes were close to your lumpectomy incision, that's great for them to use the same incision. I wish I had only had one incision because that one near my armpit has been very annoying because of where it is.",
      "MessageIndex": 9,
      "PostDate": "25/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870027",
      "Title": "incision for sentinel node removal? jessie123 leftduetostupidmods"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 31, 2019 05:57PM gb2115 wrote: I would say if your job lets you stay out, might as well. I worked through 32 treatments, but my job has a flexible workload.... meaning I could put stuff off until later if I needed to. I wouldn't say the fatigue got worse at the end, but my skin certainly did. I had weird allergic reactions to the miaderm though, so maybe if that hadn't happened it would have been easier. In hindsight it might have been easier to just FMLA the whole thing, I don't know why I didn't. I just kept working. Oh well!!",
      "MessageIndex": 5,
      "PostDate": "31/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871820",
      "Title": "Going back to work Amybb Amybb"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 30, 2019 08:13AM gb2115 wrote: I think they hesitate to use the word cure because they can't say it for sure. The problem with breast cancer is that cells can linger and lurk undetected for a really long time before starting to grow. With no good ways to detect rogue cells. So if they say you're cured...and then a decade or more later it shows up in your bones because it was there all along, you would be very upset with your doctor....but I thought you said I was cured? I can see why they go for NED instead.",
      "MessageIndex": 5,
      "PostDate": "30/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870709",
      "Title": "How long is a Course of radiation for axillary nodes? B-A-P RebzAmy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 27, 2018 01:48PM - edited Mar 27, 2018 01:48PM by gb2115 I was really scared before my first biopsy too. I am the biggest wimp there is, but the ultrasound guided biopsy really was pretty easy, all things considering. You'll have a teeny pinch while they inject the lidocaine. After that, you shouldn't feel anything. I was minimally sore the next day. You just want to be sure not to bump your breast afterwards to give it a good chance to heal up. Not sure about the MRI. For me, the progression was diagnosis via the ultrasound biopsy, and then an MRI afterwards to take a closer look and make sure there was nothing else hiding. Not sure if an MRI would save you from a biopsy or not. They'd probably want to do one anyway. Especially since the radiologist would have recommended an MRI if they thought it was needed. But anyway, the biopsy really isn't that bad. I promise. I think the IV you get before an MRI hurts more. I had an MRI last week and am still badly bruised from the multiple failed IV sticks.",
      "MessageIndex": 11,
      "PostDate": "27/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863374",
      "Title": "Doctors have difference of opinions. Nckat INFJen"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 26, 2017 11:49AM gb2115 wrote: Totally agree with MTwoman...your daughter could totally get her own blood tested. With her family history, I can't imagine they would turn her away from that.",
      "MessageIndex": 2,
      "PostDate": "26/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/855491",
      "Title": "daughter pressuring me to have genetic testing. soami123 farmerlucy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 26, 2019 04:10AM gb2115 wrote: Yup, blue dye. I had dye as well as a radioactive isotope injection before surgery. She used both together to find the sentinel node.",
      "MessageIndex": 13,
      "PostDate": "26/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870027",
      "Title": "incision for sentinel node removal? jessie123 leftduetostupidmods"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 5, 2018 11:45AM gb2115 wrote: I was issued a sleeve and gauntlet for flying but haven't had to use it yet (haven't flown and my LE is in my trunk). My LE therapist said the same thing--to gradually build up wearing it. I I guess so there are no surprises on the flight?! If I were in your place, I would call and tell them it's sore, and ask if that's expected.",
      "MessageIndex": 1933,
      "PostDate": "05/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 9, 2019 04:36PM gb2115 wrote: Lol, I asked about sneezing at my biopsy, and the ultrasound tech asked if I had been sneezing a lot. When I said no, she said just to let them know if a sneeze was coming. I agree a brochure for crazy questions would be good, some of us think up these things and get really concerned!!",
      "MessageIndex": 12,
      "PostDate": "09/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869246",
      "Title": "What if I sneeze? Stereotactic biopsy Muffkin78 reflect"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 15, 2017 04:05AM gb2115 wrote: I remember my surgeon saying that waiting 6 weeks was ok.",
      "MessageIndex": 7,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/856132",
      "Title": "Just Diagnosed - Surgery Timing purplestargazer purplestargazer"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 10, 2017 10:51AM gb2115 wrote: It was a hard decision. I never considered bilateral mastectomy (though if I have been BRCA positive I might have, I don't know, probably not though). I did consider mastectomy then realized I wanted a less invasive surgery--I tend to go for the path of least resistance in life, so lumpectomy sounded better to me. My surgeon also seemed to be a fan of a lumpectomy for me, though she offered to do whatever I wanted to do. So I went with lumpectomy plus radiation. Remember that a mastectomy doesn't necessarily guarantee you will not need radiation. Sometimes they still do it, depending on location of the tumor, margins, lymph nodes....sometimes they radiate the mastectomy scar line. It just depends. It is such a tough choice. Picking your surgery when you can't see the future. I feel for you, I remember what that felt like. I don't think there's a right or wrong decision in this, honestly.",
      "MessageIndex": 1,
      "PostDate": "10/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/859286",
      "Title": "Can't make a decision mudd gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 8, 2018 05:29AM gb2115 wrote: I have found I have to apparently wear an undergarment that is not necessarily tight (like compression), but is absolutely smooth on the side. If the fabric wrinkles at all, fluid will fill the wrinkle in one area. Truly the most bizarre thing. I don't get bra strap indentations, just this fluid ridge. For right now I am making an effort to smooth the side of my bra during the day, and take it off when I get home. Seems to help. Planning to shop soon to try some different items. Maybe a loose cami. Gut feeling is that loose is best. I'm pretty small so could get away with it.",
      "MessageIndex": 7,
      "PostDate": "08/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/862089",
      "Title": "Lymphedema in the breast angiepie angiepie"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 7, 2019 04:25PM gb2115 wrote: Interesting that you were low risk and they still did chemo!",
      "MessageIndex": 3,
      "PostDate": "07/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869738",
      "Title": "Mammaprint test women where are you ? Nadouch78 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Feb 7, 2019 03:08PM gb2115 wrote: I had a Mammaprint done when i was diagnosed back in 2016, and it came back low risk luminal A. I probably would have had chemo if I hadn't had that done since I am young and had a positive lymph node.",
      "MessageIndex": 1,
      "PostDate": "07/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869738",
      "Title": "Mammaprint test women where are you ? Nadouch78 gb2115"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 5, 2018 12:40PM gb2115 wrote: That is so sweet of them. Honestly if it were me (having gone through it), gift cards for food---like carryout places (for when you are too tired to cook), or Starbucks. I don't know if you like coffee, but I often stopped at Starbucks after treatment before going back to work--I felt like baring my breast daily for 6 weeks made me REALLY deserve a latte...lol.",
      "MessageIndex": 3,
      "PostDate": "05/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862977",
      "Title": "Wellness Basket? operamom1 OCDAmy"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 24, 2018 12:55PM gb2115 wrote: Waiting for the oncotype results before making a chemo decision (for hormone positive cancers) is pretty much standard of care these days I think. Sounds like you are on the right track! Hopefully you won't need chemo!! I'm surprised they have left you on the bc pill being estrogen positive. Have your OB/GYN or Onc weighed in on that? I was told I can't use any kind of hormone bc being ER/PR positive.",
      "MessageIndex": 1,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/864824",
      "Title": "Diagnosed & Waiting on enough information to make decisions Vermonster Vermonster"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 16, 2019 03:59AM gb2115 wrote: I was in college when my mother was diagnosed. I happened to be home for vacation. I think I would have been upset had they concealed it from me (which they unsuccessfully tried to do). I guess it depends on your kids. Sorry about your diagnosis. :-(",
      "MessageIndex": 3,
      "PostDate": "16/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/869371",
      "Title": "Need help on when to tell my children Toyamjj BrinkOfEternity"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 22, 2018 08:17AM gb2115 wrote: That all sounds really weird. Sounds like \"pounds\" is a typo and it should be kilos. But you're talking about breast surgery, which should not be affected by weight. Yeah, if you're digging down into the abdomen for elective surgery on an extremely obese person, it can be beneficial to lose some weight. They delay organ transplant all the time because of needing to lose girth around the middle, for good reason. But they should be able to take a breast tumor out no matter the size of the breast (and who says that the 10 pounds would even be lost from a certain area). I think they can dose chemo drugs to any size. I've never heard of someone being turned away from life saving cancer treatment because of needing to lose 10 lb. Now, if she's really 98 lb and then needs to GAIN 10 lb (maybe \"lose\" was the typo), I can see the advantage of having put some extra weight on. But it should still not delay treatment for cancer. And the cancer can most definitely spread in the meantime, no matter what weight you are. That's weird. Something is not right. I hope that's not standard of care in Japan....I would seek a new doctor, immediately. Good luck, sorry about your mom!",
      "MessageIndex": 4,
      "PostDate": "22/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/861850",
      "Title": "Doctor does not recommend chemotherapy or surgery carlosq1 KBeee"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Aug 31, 2017 02:12PM gb2115 wrote: If it were me, I'd prefer a scheduled follow-up visit. I don't know...I found out my results via phone the day after the biopsy...the radiologist who did the test called me with results. I appreciated the quick turnaround time, but waiting for the phone to ring was difficult to deal with. It's hard. ",
      "MessageIndex": 1,
      "PostDate": "31/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858348",
      "Title": "How would you rather receive your results? FarAwayToo Susug"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "2 hours ago gb2115 wrote: My question is how did you make it through 2 fittings and not end up with garments that fit correctly? Sounds like someone different needs a go at that!!!",
      "MessageIndex": 4,
      "PostDate": "04/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/871883",
      "Title": "Help!! Sleeve HURTS! And Gauntlet Purple fingers! QueenB44 QueenB44"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 16, 2017 07:23PM gb2115 wrote: Good!! Ice it and get rest. Try not to bump your breast!! Did they give you an idea on when you might hear results?",
      "MessageIndex": 4,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860189",
      "Title": "I'm here in the breast center waiting to have biopsy. pamelakp pamelakp"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jun 15, 2018 08:00AM gb2115 wrote: For how long have you been trying to lose weight?",
      "MessageIndex": 1,
      "PostDate": "15/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/865224",
      "Title": "Tamoxifen and Weight Runnergurl exercise_guru"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 30, 2018 07:25PM gb2115 wrote: I don't have any advice, but I think I have breast LE too, developed over the last week. It goes away when I don't wear a bra but am having trouble figuring out what type of bra is best because I would prefer wearing one. I have a call out to my CLT, hoping she can help.",
      "MessageIndex": 2,
      "PostDate": "30/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/862089",
      "Title": "Lymphedema in the breast angiepie angiepie"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Apr 11, 2018 07:51PM gb2115 wrote: What do you do with a chip bag?",
      "MessageIndex": 15,
      "PostDate": "11/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/862089",
      "Title": "Lymphedema in the breast angiepie angiepie"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 6, 2018 01:00PM gb2115 wrote: You can also use a washcloth soaked in cold water, and wrung out. Place it gently on the itchy areas, and then when the wash cloth warms up, repeat. It's safer than ice, and may provide some temporary relief. I had severe allergies to the surgical glue they used on me during surgery. I ended up having to get a steroid shot from a dermatologist to calm it down. Those were rough times. I hope you feel better soon.",
      "MessageIndex": 6,
      "PostDate": "06/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865684",
      "Title": "Allergic reaction to drapery adhesive Moonrabbit59 Moonrabbit59"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Nov 16, 2017 09:49AM gb2115 wrote: Deep breaths. It'll be over before you know it!!! It's hard and it's a lot of waiting, but someday you will be on the other side looking back!",
      "MessageIndex": 1,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860189",
      "Title": "I'm here in the breast center waiting to have biopsy. pamelakp pamelakp"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 28, 2017 10:11AM gb2115 wrote: Yup, they like the MRIs when you have dense breasts, and especially with that type of family history. Sounds like they are just being thorough. I had one, well two actually (because one was a biopsy), before surgery so they could double-check to make sure they hadn't missed any other areas. It was easy, honestly. I didn't feel claustrophobic at all, because of being face down. You are basically staring at the floor. I also had a bone scan which was much more claustrophobia causing, because you can actually see the machine coming really close to your face. The contrast wasn't a big deal at all. Not like CT contrast which I think makes you feel awful. The MRI contrast felt like a wave through my body, but wasn't unpleasant. It was more weird than anything. Like I could feel it going through my lips and eyes...like a weird wave. LOL They will probably check a stat BUN/creatinine before the MRI, unless you have blood work (chemistries) that are less than a month old. So don't be surprised by that. ",
      "MessageIndex": 5,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/853766",
      "Title": "Why is Breast MRI Needed? Michele327 Michele327"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 8, 2018 07:26AM gb2115 wrote: Could be because sometimes breast surgeons are staffed at breast centers. The breast center I go to now is part of a surgeon's office, so when I go for my mammogram, an appointment with the surgeon is assumed. However, it's good news that you get to see an expert right away! Hang in there!",
      "MessageIndex": 6,
      "PostDate": "08/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/863051",
      "Title": "Process Question Fighterdeb Recap"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Sep 9, 2018 04:48PM gb2115 wrote: For what it's worth I had my lumpectomy during my period (which came a week early apparently due to stress), and it was really a non-issue. The medical team is equipped to handle it. You can't wear a tampon of course. They had me in hospital panties and a pad. Woke up with it either still on, or put back on. Not sure about the in-between. This doesn't help your other concerns of course, but don't worry about bleeding during surgery.",
      "MessageIndex": 9,
      "PostDate": "09/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867073",
      "Title": "Got a tentative surgery date and I'm pissed Jadedjo Jadedjo"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jul 4, 2018 06:52AM gb2115 wrote: Sounds like you are seeing the procedure report which is not the same as the pathology report, which would be the biopsy results. I imagine they will call you before releasing the results on to the portal.",
      "MessageIndex": 3,
      "PostDate": "04/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/865624",
      "Title": "Confused and Anxious Ken1018 Ken1018"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Oct 15, 2018 02:32PM gb2115 wrote: Did they tell you how long it would be before you heard results?",
      "MessageIndex": 24,
      "PostDate": "15/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867074",
      "Title": "MRI Biopsy Needle Guided Imsolost JoTheGreek"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Mar 9, 2018 08:37AM gb2115 wrote: Sorry you are joining us here! Hang in there, someday you will be on the other side looking back at all of this!",
      "MessageIndex": 6,
      "PostDate": "09/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/863096",
      "Title": "Can I join this elite sorority? sillyoldrabbit LeMo"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "Jan 25, 2018 11:33AM gb2115 wrote: My tech were nice, but I had problems with the radiation oncologist. My first \"skin check\" involved her asking me how I was doing in passing in the hallway. I didn't realize that was my \"appointment\" with her so it never went further than pleasantries. I had to fight to get face time with her the rest of the 6 weeks, and probably came across as a b**** doing so. But seriously, how can you bill insurance for small talk in the hallway and sleep at night....?! I was told that my appointment time was scheduled during her lunch break. And this was my problem....how exactly?!",
      "MessageIndex": 7,
      "PostDate": "25/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/861454",
      "Title": "Grumphy McAsshole feelings re: my rads team. And you? Sahmeranah ksusan"
    },
    {
      "AuthorID": "gb2115",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247211/profile",
      "Content": "May 14, 2018 05:52AM gb2115 wrote: It won't spread much by waiting a week to see the doctor. She will wait a bit for surgery too, be ready for that. The process is slow and they say bc doesn't travel fast like that.",
      "MessageIndex": 3,
      "PostDate": "14/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/864572",
      "Title": "Mom diagnosed with breast cancer, did they drop the ball? magneto YYC_Girl"
    }
  ]
}