{
  "AuthorID": "gd2shuz",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167599/profile",
  "Posts": [
    {
      "AuthorID": "gd2shuz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167599/profile",
      "Content": "Mar 1, 2013 09:41AM gd2shuz wrote: Hi.  I don't think I've posted here before.  I thought I was going to have chemo so I became part of that forum, and have more or less remained there.  But I have a question now.  Oddly enough, since my surgery 1/7/13 (bmx) I have had a horrible taste in my mouth, queasy stomach and after just a few bits I am  full.  I am a GI Nurse by profession, so I automatically think along those lines.  I am not on any meds other than what I was taking routinely for years before my surgery so I do not attribute the bad taste or queasiness to medications.     All of a sudden, this morning, I realized that what happens is that I can \"feel\" food going down my esophagus, and it feels as if I have a narrowing in my esophagus.  I know, as a GI nurse, this can cause the bad taste and the queasiness/nausea.  I am going to see my SO and I am going to ask my GI doc to do an upper endoscopy, but I wanted to know if this is unusual or if anyone here has experienced anything like this after their surgery?",
      "MessageIndex": 1126,
      "PostDate": "01/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "gd2shuz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167599/profile",
      "Content": "Feb 2, 2013 07:06AM - edited Feb 2, 2013 07:14AM by gd2shuz Hi girls. My name is Sue, I am 66 years old and was diagnosed in early December. It was only the right breast, they thought, but the preop MRI showed that I also had it in the left. I had a BMX on 1/7 and went home from the hospital on 1/8. I live alone. I had a 4 year old cat and 2 days after I wad discharged I got up in the middle of the night to get a drink of water and found that my cat had died, and I have no idea why. As if I needed anything else. I had a very stormy relationship with my daughter which started to smooth out a couple of years ago, but she is dealing with trying to make her own ends meet with no husband and 2 kids, so she is pretty much not available. I have a triple negative, but my onc says I have a rare one that only requires surgery and no chemo. I don't understand why I feel queasy often even tnough I take no meds that I wasnt taking before, and I suffer from constipation ever since the surgery even though I don't need any pain meds. It's been just over 3 weeks since the surgery and I went back to work. I am tired. Maybe I'm crazy, but I am more depressed over my financial situation than I am about this cancer. I was on the chemo forum for a while but now that I wont need chemo I don't go there much, just once in a while to keep up to date with the women I met there. I wish us all the best.",
      "MessageIndex": 935,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "gd2shuz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167599/profile",
      "Content": "Feb 2, 2013 12:37PM gd2shuz wrote: Glad to hear your good news! I grew up in St. Louis. Went to elementary and Jr. High in U. City, went to high school in Ladue...lived in Olivette during high school.",
      "MessageIndex": 938,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "gd2shuz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167599/profile",
      "Content": "Feb 2, 2013 12:45PM gd2shuz wrote: Josie hate to say it, but Florida sucks. Haven't found any help. I've gotten calls from people saying they would have someone get in touch with me but then never heard from anyone. Sent emails and left voice mails, and gotten apologies and promises. Whoop dee do. I think my karma is to do this alone like everything else. Not having a pity party, just stating what seems to be the way it is. You girls who have spouses that love and support you are very blessed.",
      "MessageIndex": 939,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "gd2shuz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167599/profile",
      "Content": "Feb 5, 2013 04:33PM gd2shuz wrote: I had a nice visit last night from someone from \"A Buddie for You\", and she told me to contact the Susan G. Koman center and another center I can't think of at the moment.  I slept a lot today so I didn't make any phone calls, but hope to tomorrow.   I got a few toys in a goodie bag...a nice blanket, a pillow, a little teddie bear lol, and a couple of other little things.  The blanket is soft and keeping me warm around my shoulders, feels good.  I will be calling a couple of places tomorrow hopefully.  Hope you all feel well tonight, blessings to all.",
      "MessageIndex": 978,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    }
  ]
}