{
  "AuthorID": "geekness",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/222516/profile",
  "Posts": [{
    "AuthorID": "geekness",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/222516/profile",
    "Content": "geekness wrote: I just wanted to see if anyone else has experienced this. I'm just second guessing my doctor and probably being overly paranoid. I do trust him and believe I have an amazing medical team, but just having anxiety. I begin my third round of chemo this upcoming Wednesday. I have three lumps in my breast (invasive ductal) and one in my lymph nodes (left side). I had some pretty severe pain in the armpit and lymph node area after my first round of chemo, but I also was recovering from pain and discomfort from biopsies. My second round, the pain didn't start immediately, but about a week and a half later. It's been extremely strong now for a week. I can barely raise my arm. If I touch this area, the tumor (which I had to hunt around for to feel before and was probably pea sized) is just massive...or at least something in there is massive. I have had no pain in the lumps in my breast and I can physically tell those have gotten smaller already. Could it just be that inflamed and swollen? I am just having some massive anxiety the last few days that the tumor isn't being affected, but actually growing now as it's aggressive to being with. My oncologist says I shouldn't be worried is \"most likely\" because the drugs are attacking the cancer calls and they are screaming help me. The area is just so painful and so large now, I am concerned. I can also see dimpling in this area now in my skin as it wasn't there before. Can the chemo drugs just build up in this area as it targets the cancer calls? At this rate, I feel like my next round would make something in there pop!!! :) I have 4 more rounds of chemo to go. Chemotherapy 9/1/2015 AC + T (Taxotere) Dx 8/2017, IDC, Left, Stage IV, metastasized to bone/lungs, Grade 3, 0/15 nodes, ER-/PR-, HER2- Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "09/10/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/835647",
    "Title": "Intense Pain - Swelling/Growing? of Tumor in Lymph Node geekness Tomboy"
  }]
}