{
  "AuthorID": "geiru2011",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131866/profile",
  "Posts": [
    {
      "AuthorID": "geiru2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131866/profile",
      "Content": "Jul 26, 2011 03:41PM geiru2011 wrote: I appreciate reading about everyone's different stories. Just be careful about saying, \"Oh, you can work while in treatment,\" since we have no idea how each of us will be affected by it. My oncologist told me that some people experience fatigue that's so bad it'll \"knock you on your kneecaps.\" At this point, I may or may not need chemo (oncotype DX is in the lower range of the medium-risk group--how's that for inconclusive?). But I'm glad to hear about the full range of possible effects. It makes it feel much less scary if I do go that route, so thank you for the question and the answers!",
      "MessageIndex": 32,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771494",
      "Title": "Poll: How many ladies worked through Chemo? Chrys23 Chrys23"
    },
    {
      "AuthorID": "geiru2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131866/profile",
      "Content": "geiru2011 wrote: I'm new to this discussion board, so it may be that this has been discussed. I had a lumpectomy and sent-node biopsy just a week ago. The soreness at the incisions has died down some, but now the bandages are off, and the skin all the way from my nipple out to my armpit (about 2 inches beyond the incisions) is incredibly sensitive--almost like it itches or is sunburned...like when I was first nursing my son and couldn't stand the feel of the shower hitting my nipples. Fabric rubbing against my nipple is especially uncomfortable. Does that go away? Ibuprofen doesn't help. Any remedies, if you've felt this? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/771210",
      "Title": "hypersensitive skin post-lumpectomy geiru2011 Flamingo305"
    }
  ]
}