{
  "AuthorID": "gem4jewels",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134056/profile",
  "Posts": [
    {
      "AuthorID": "gem4jewels",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134056/profile",
      "Content": "gem4jewels wrote: I have lurked here all week and saw the fantastic support everyone here gives each other.  I have not been diagnosed with breast cancer, but going for a biopsy has certainly changed my life forever.  I went for a normal mammogram last week and thought I'd be out of there to pick up my son from soccer practice, no problem.  Not only did the radiologist xray my right breast 5 times, but she also did an immediate sonogram and then asked me to go for a biopsy.  To let you know my frame of mind that day, I almost canceled this mammogram because I'd had one last year. I am 42 years old.  I am very small breasted, 34B, and never felt a lump.  I just had a well woman exam a month and a half ago. I never expected this to happen.  It was like a verbal slap or a life slap.  It hit me hard and I never saw it coming.  I'm sure no one does.   I am feeling like I need to take a step back and look at my life. Do I really like where I'm working?  Have I been a good mother?  I have a new perspective and I'm not even diagnosed.  I'm very very very anxious, however.  In addition to this, since March, I have also had right side quadrant pain.  The urologist (even with known kidney stones , one as large as 4mm) sent me to the gastroenterologist who ordered a biliary scan and some other CT scan, showing no abnormalities.  A simple blood test for liver function was normal.  My right ribs hurt when you press on them from front to back and sometimes I feel like something doesn't belong in there.  Liver?  Now this.  I am hoping they are not related.  I think this alone is what is causing EXTREME anxiety.  My aunt who previously had breast cancer and was a nurse has been very supportive and helpful throughout all of this, but I am scared.  The gastro doc eventually sent me back to urologist saying I had kidney stones.  I had lithotripsy last month for the 4mm stone, so it's gone.  The pain came right back.  It does seem to be centered around the lowest rib,a bit to the side and front.  It feels irritated there and hurts on its own sometimes, so I can only think it is gall stones.  But why do my ribs hurt to the touch in certain spots all the way up to about the underside of my right breast?  I'm hoping I don't have bone cancer and breast cancer.  See how the mind wanders?  I also have had constipation througout all of this(from March xrays forward to today) lots of gas, but no yellowing of eyes or pale stools.  My new gastro wants to target the constipation first after I get my biopsy tomorrow.  I had to leave work today I was so stressed.  Well, it is only a temp agency job...but I was hoping it would eventually lead to full time.  I picked up a copy of my mammogram today after I left work.  It said, \"Density in the upper outer posterior right breast without sonographic correlate.  Sterotactic biopsy is recommended for further evaluation of the finding.\" Elsewhere it said, \"Suspicious microcalcifications or architectural distortion to suggest development of malignancy.\" Result code:4, follow up code:  4 So, I have hypothyroidism, PCOS, possible breast  cancer, and ??  My thyroid has a multi nodular non-cancerous nodules.   I had that biopsied in April. Anything you can say to put me at ease will help.  I am going to go crazy. It's a miracle I'm functioning at all today. Thanks for any and all replies! Gem4jewels gem4jewels Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772931",
      "Title": "Biopsy Tomorrow on Right Breast & Rib Pain gem4jewels solange49"
    },
    {
      "AuthorID": "gem4jewels",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134056/profile",
      "Content": "Aug 11, 2011 11:19AM gem4jewels wrote: Well, I'm back from the Stereotactic? biopsy.  After squashing me for xrays another 6/7 times, they could not find the 7mm area.  I was pretty happy until I called my aunt.  She said that when they first saw hers on the xray and then sent her for a biopsy they poked her 17 times trying to find the correct location (over 10 years ago).  She waited a year and it had grown to the size of a nickel.  She told me that I should not give up so easity-to request a real biopsy instead of waiting another 6 mos?  I know this is ultimately my decisioin, but hope to hear from others in the same predicament.  Thanks for all the encouragment and support!",
      "MessageIndex": 5,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772931",
      "Title": "Biopsy Tomorrow on Right Breast & Rib Pain gem4jewels solange49"
    },
    {
      "AuthorID": "gem4jewels",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134056/profile",
      "Content": "Aug 11, 2011 08:07PM - edited Aug 11, 2011 08:07PM by gem4jewels Dear annettem,  I would be very confused too.  That said, the internet is your friend for finding a good oncologist if you dont like the one you are seeing and so is word of mouth.  I have not yet been diagnosed, but I do know something about anxiety.  Until you know for sure, keep seeking the treatment you want, and ask for it. Walk away from the doctor telling you to wait; it's not his life he's gambling with but yours.  Ask for the treatment you want specifically.  \"Please order a blood test for tumor markers.\"  I don't know the exact terminology or procedure to use here, but with your history, you are certainly justified in being concerned and justified for wanting more done.  As for your pain, make sure you discuss that asap with the doctor you choose.  I hope by now you have already seen the doctor! Sending lots of hugs your way!  Take care and relax.  Worrying will not help.  I've learned that the hard way. We are are here for you! ",
      "MessageIndex": 1,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772953",
      "Title": "Confused! annettem zouping"
    }
  ]
}