{
  "AuthorID": "gensi",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125864/profile",
  "Posts": [
    {
      "AuthorID": "gensi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125864/profile",
      "Content": "Mar 25, 2011 03:59AM gensi wrote: Hi Lanus, I agree with the others on the recommendation. U/S are supposed to be very good at determining cysts. If the cyst had any hard stuff in it, they would have been more likely to aspirate/biopsy it and check the contents. Going for a 6mo check will give an idea of whether it's a problem cyst, but will also give you the opportunity to get checked up on again in a shorter period of time. My NP sent me to an u/s and told me they would probably do a biopsy of my lump at the same time. When I got there I learned that the only way our hospital does them is from a GP's requisition order. Still waiting on the results from the u/s so now, if I do need a biopsy, I have to get a second app't made for that. So the message I was being given changed too, but I chalk that up to differences in the politics of the workplaces... If you are concerned about the impression you were given by the clinical exam and then the dx from the u/s, maybe ask to meet with your PCP and find out why they thought what they did about your cyst- so that you can be armed with more information when doing self exams in the future...",
      "MessageIndex": 8,
      "PostDate": "25/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766585",
      "Title": "Lump found, not sure what to expect or do... Lanus Lanus"
    },
    {
      "AuthorID": "gensi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125864/profile",
      "Content": "Mar 24, 2011 01:28AM gensi wrote: Thanks for the link kpthfaith2 and to add to wonderfullymade's comment,  My grandmother and 2 aunts all passed away from breast cancer. My aunts were in their 30s. None had genetic testing so those details are a mystery to the family however, another aunt and a cousin have both been tested for the BRCA genetic mutation and were negative. There have been 4 other cancers in the family as well. Still, the genetic counsellor position on this is that there is definitely a genetic link in our family but that gene has not yet been mapped in genetics, so a postive BRCA or not, counselling is a wise decision for the full picture.",
      "MessageIndex": 3,
      "PostDate": "24/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766538",
      "Title": "FYI/genetic testing for cancer kpthfaith2 gensi"
    },
    {
      "AuthorID": "gensi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125864/profile",
      "Content": "Mar 24, 2011 08:17AM gensi wrote: Hi Megan, Know that you're not alone. I'm just waiting on my ultrasound results from a lump and I'm just shy of 32 years. I've had shingles, cysts, and broken my back once, neck twice, for no known reason. Too many times I have felt like a fragile elderly body and all in my twenties, despite being so young at heart. I was hoping that my back problems, once over, gave me a free ticket for a carefree life from thereon in. No such luck. Keep focused on your family at home right now, and rack up those long distance bills if need be - I'm sure your parents would love to hear from you just as much as you want to be there with them. Hopefully this will all be a short lived and benign scare for you and you will be able to talk later with your husband about making serious plans to move closer to family. If it's more than that, we're all here to vent to about that too :)",
      "MessageIndex": 4,
      "PostDate": "24/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766551",
      "Title": "Didn't realize.... maddyandzekesmom FindingMyself"
    }
  ]
}