{
  "AuthorID": "georgia67",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255454/profile",
  "Posts": [
    {
      "AuthorID": "georgia67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255454/profile",
      "Content": "Sep 13, 2017 02:50PM georgia67 wrote: Ravzari, Did you have the swelling under you arms and did this help?  At times I feel like I have a band tightening up around my chest.",
      "MessageIndex": 5,
      "PostDate": "13/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858524",
      "Title": "Compression clothing after bilateral mastecomy? georgia67"
    },
    {
      "AuthorID": "georgia67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255454/profile",
      "Content": "georgia67 wrote: I had bilateral mastectomy Sept 1st.  I have been wearing a tube type compression around my chest they put on at the hospital.  I went to surgeon yesterday and had one of 3 drains removed.  He told me to keep wearing the compression but the problem is it slips down and leaves some of the incisions showing above the garment. I was cut all the way under my arms towards my back  I also am very uncomfortable under my arms that still have swelling (it fells like roll on one side)  The left breast which had the tumor had a group of 3 or 4 lymph nodes removed and I have nerve damage down the underside of my left arm that may or may not go away.  I have seen other women talk about wearing under armorer compression t-shirts.  Have any of you had experience with this and what has helped?  I know my surgery is new but just trying to keep ahead of lymphedema.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858524",
      "Title": "Compression clothing after bilateral mastecomy? georgia67"
    },
    {
      "AuthorID": "georgia67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255454/profile",
      "Content": "Aug 7, 2017 05:07PM georgia67 wrote: Trishyla did you have problems with leg and feet swelling from the Taxol?  My leg pain is getting better but still have swelling in feet and legs.",
      "MessageIndex": 5,
      "PostDate": "07/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857746",
      "Title": "Anyone have double mastecomy after having chemo georgia67 Legomaster225"
    },
    {
      "AuthorID": "georgia67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255454/profile",
      "Content": "georgia67 wrote: I finished 12 rounds of weekly Taxol after 4 bi-weekly rounds of AC July 26th.  I had almost every side effect it listed.  Taxol was not my friend except it seems to have taken care of the tumor.  So maybe it was.  I am having swelling of my feet and legs and fingers but feet are worse. I also feel bloated in my stomach.  I also have feet and leg pain that is worse at night.  Question is does swelling get better over time?  My 10 pound dog left paw prints on my thighs the other day after sitting in my lap.  I don't have anything but Velcro adjustable sandals that fit anymore.  I have surgery scheduled for Sept 1 for double mastectomy so does this have anything to do with likely hood or not of having lymphoma after surgery?  Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/857577",
      "Title": "Leg and foot problems after Taxol georgia67 georgia67"
    },
    {
      "AuthorID": "georgia67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255454/profile",
      "Content": "georgia67 wrote: I am having surgery Sept. 1.  Doing a double mastectomy, my choice, instead of lumpectomy.  I am still very tired after doing chemo ( AC and Taxol)  especially after 12 Taxol treatments.  Legs and feet still swelling and some small breathing issues.  I don't know if this is because red blood cells still low or what.  I am a little worried about energy levels not being up and then being down again after surgery.  I am also concerned about leg and feet swelling.  My oncologist says it is the Taxol and given me some Lasix but it doesn't seem to help with my toes and ankles.  I can drop about 2-3 pounds after taking it.  I guess my big issue right now is energy and after trying to exercise, mop floors etc I get out of breath.  Is this normal?  Four weeks to go so I hope all of this gets better.  What was your experience?  I am 67 and usually pretty good at staying active and doing what I want. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857746",
      "Title": "Anyone have double mastecomy after having chemo georgia67 Legomaster225"
    },
    {
      "AuthorID": "georgia67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255454/profile",
      "Content": "Aug 7, 2017 05:00PM georgia67 wrote: My last chemo was July 26th.  My counts were done last on 8/2 with red count 3.75.  The lab before that was 3.12 so it is coming up a little at a time.  Legs feel like I have run a marathon so I hope that gets better.  I have been bouncing on a trampoline to get leg strength but can only do a couple minutes.   ",
      "MessageIndex": 4,
      "PostDate": "07/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857746",
      "Title": "Anyone have double mastecomy after having chemo georgia67 Legomaster225"
    },
    {
      "AuthorID": "georgia67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255454/profile",
      "Content": "Aug 13, 2017 09:36AM georgia67 wrote: Thanks for your replies.  I am still waiting on the ankle and foot swelling to go down.  Its not terrible but can't wear my normal shoes and they burn and itch after they swell and at night hurt.  My fingers also get tight at times so I know there is minor swelling there.  I take a 20 fluid pill but can't tell a huge difference in ankles.   I am still low on energy and get up in the morning as tired as when I went to bed.  Still have 3 weeks until surgery so hope it gets better by then. ",
      "MessageIndex": 9,
      "PostDate": "13/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857746",
      "Title": "Anyone have double mastecomy after having chemo georgia67 Legomaster225"
    },
    {
      "AuthorID": "georgia67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255454/profile",
      "Content": "Sep 25, 2017 06:41AM georgia67 wrote: redesides, I was on AC then Taxol.  Two weeks after starting AC I started losing my hair mainly around the sides and back.  I would run my fingers through it and come out with bunches stuck between my fingers.  I had it shaved after that.  I never lost all of my hair but after shaving it it didn't grow any longer and felt like beard stubble.  It got sore in patches too.  Mine started coming back during Taxol and now it is about 1/4\" long.  I finished Taxol at the end of July.  One thing I have recently noticed is a beard, white and fine along jaws and chin.  I don't know if it helps or not but I mix castor oil with Rosemary oil and other essential oils that are supposed to help with hair growth. I put it on over night or a couple hours before I shower.  It is sticky so I make sure I don't get it on furniture.  I am just hoping that the top fills out since I have more around the sides.  I had thin hair on top before and was hoping one good thing from treatment would be a full thick head of hair after it was over.",
      "MessageIndex": 25741,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "georgia67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255454/profile",
      "Content": "Sep 25, 2017 02:16PM georgia67 wrote: Dogersgirl, I had surgery Sept 1, double mastectomy.  Pain was less after surgery but drains were sore. Got a little sorer about 3 weeks out but not bad.  My worse problem is nerve damage under my left arm and the feeling like I have lumps or balls under each arm.  I didn't take very much pain meds mostly Tynol.  The only time I take anything now is if the chemo induced neuropathy in my feet kick in at night. ",
      "MessageIndex": 189,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "georgia67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255454/profile",
      "Content": "georgia67 wrote: I am having surgery on Sept 1.  I chose a double mastectomy due to my age, high Ki-67 (75%) and I just don't want to worry and I didn't want 6 weeks of radiation.  My tumor was 2.5 on left side grade 2 score 7/6.  There was a question pf pleomorphic lobular carcinoma in some small cells in the original needle biopsy.   I am 67, widow and live alone.  I had chemo before surgery that ended July 26th. the tumor no longer shows up on ultra sound and haven't felt it in about 3 months. Taxol was not my friend.  My legs and feet still hurt and still swell.  My surgeon has not told me much except it will probably be a over night hospital stay and I should need help for about a week.  I am tape sensitive so that is a concern.  I lose skin from tape on my chest so I don't know what to expect as far a bandages goes.  I see people talking about wearing bras after surgery.  Why?  What will I be able to do at home and what won't I be able to do.  I have a Yorkie I have to care for so is bending over a problem?  Will I need blood for the surgery?  Will I need any type of dressing supplies?  Any suggestions to make the second week without help easier would be appreciated. Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857555",
      "Title": "Caring for yourself after bilateral mastecomy georgia67 KCMC"
    },
    {
      "AuthorID": "georgia67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255454/profile",
      "Content": "Aug 3, 2017 03:07PM georgia67 wrote: Thanks for your replies.  I am not have reconstruction.  Chemo still has me feeling really tired and still have fluid in my legs and feet with some feet pain.  My sister will stay with me for about 6 days then she has to go back home and to work.  Did you feel ok sleeping in bed or was a recliner your choice? ",
      "MessageIndex": 6,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857555",
      "Title": "Caring for yourself after bilateral mastecomy georgia67 KCMC"
    }
  ]
}