{
  "AuthorID": "Georganne",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81630/profile",
  "Posts": [
    {
      "AuthorID": "Georganne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81630/profile",
      "Content": "Apr 30, 2009 12:41PM Georganne wrote: Hi Ladies, I agree that the genetic testing is a great tool and helps you make informed decisions. I am BRCA 1 + 2 positive. I learned this in 2007 while my mom was dying of ovarian cancer and I was asking myself why ALL the ladies in my family have died from breast or ovarian cancer.  Since then, I've have had prophylactic ophorectomy (hysterectomy + ovaries + tubes, ALL) in 2007 and almost 2 months ago I had a bilateral mastectomy.  I was also using MRI's and mammograms and breast exams every 3 months and I lived with FEAR all the time.  Last August 2008, I was told I had a pathaloma in the milk duct in my left breast. The BS called it pre-breast cancer; so I did the bilateral mastectomy and now I'm going through reconstruction with implants. It is liberating to finally be in control of the monster. I can live without FEAR.  I think one's age is irrelevant. If you have a dreadful family history and are BRCA positive - think closely about taking control through surgery.  It's been inconvenient, but not awful. I thank God I can live to maybe see 70. No woman in my family on either side has ever done that. I am 47.  God willing I can help other women. And Ladies, BTW I thank all of you for your thoughts.  This site is wonderful. I'm keeping all of you in my prayers! Georganne",
      "MessageIndex": 6,
      "PostDate": "30/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733177",
      "Title": "preventitive bilateral mastectomy staceyroberts2007 BrandyWK"
    },
    {
      "AuthorID": "Georganne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81630/profile",
      "Content": "Jul 14, 2009 01:03AM Georganne wrote: mandi - I have to agree with the above ladies about the importance of you knowing if you are BRCA positive. I have basically the same horrific family history for cancer as you do.to explain -   In 2006, while my mom was in the final stages of ovarian cancer, both of us were tested for BRCA because my wonderful gyno told me he didn't like my family history. This revealed the possible reason for all the cancers in my family - BRCA 2 mutation. Sadly mom succumbed to her cancer in March 2007, and in July 2007 I had a total oophprectomy (hyster + all OUT). Last Aug. 2008, when I had my yearly mammogram, I was told I have many hyperplazis and a pathaloma in a milk duct. A lumpectomy was recommended by a breast surgeon. I went to see him, and he looked at the BRCA mutation, family history, and my current issues, and basically asked me how I felt about my breasts and then led me to realize that with the combined issues (BRCA + history) I was playing with fire. Since then, I've had my bilat mastectomy, I went through expansions, I had my exchange to implants 2 weeks ago and now am healing and waiting for nipple reconstruction.    Mandi, I KNOW this is a lot to deal with, but if you get tested for BRCA and determine that this in in your corner too, the insurance will definitely WANT / HAVE to cover everything. Your breast surgeon and the plastic surgeon's offices will take care of all of the predetermined costs.  Frankly speaking it will cost less to cover you to stay healthy. I'll be remembering you in my prayers - HONESTLY. Please do this and stay healthy. Money is NOT that important. If you have to, pay for testing, get peace of mind, do it. God Bless you!!!! Georganne",
      "MessageIndex": 13,
      "PostDate": "14/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/737131",
      "Title": "Help...Doc recommends elective mastectomy... Mandi322 Georganne"
    }
  ]
}