{
  "AuthorID": "georgie61",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
  "Posts": [
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Nov 9, 2016 05:16AM georgie61 wrote: You sound like an amazing, caring daughter. It sounds like she needs to let go and vent a little, and she knows you are going to understand. There is no magic you can offer her, other than to just keep telling her you love her. I also am scarred and misshapen, It just plain sucks., mainly because every time we look in the mirror we are reminded....",
      "MessageIndex": 7,
      "PostDate": "09/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/849460",
      "Title": "How to provide emotional support? Lynn5479 georgie61"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Apr 23, 2015 04:51PM georgie61 wrote: I am now 7 days post my first AC treatment. The fatigue is overwhelming. The first day I was very nauseous that night. I have to keep up on the meds and seems like all I do is sleep. I am scheduled every 2 weeks. Am I likely to get energy in between AC treatments? I made a large pitcher of water with lemon juice, orange juice, orange slices and mint - I pour about half a glass of that chilled and top it with Club Soda. It has been a life saver for keeping me hydrated. I haven't noticed hair loss yet. Coming soon, I'm sure. My next trip to the chemo bar in SLC is May 1st , Friday.",
      "MessageIndex": 768,
      "PostDate": "23/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Jul 7, 2015 04:28PM georgie61 wrote: I'm sorry I haven't written in a while. Sometimes, I just avoid everything - but it doesn't work there's not a moment in the day when I'm not keenly aware that \"I have Breast Cancer\". It would be nice to escape it. This Friday is another Taxol treatment and then I will have one more - my last Chemo - on July 22nd! I'm starting to see the end in sight. Since I did neoadjuvant chemotherapy - chemo before surgery - I'm going to start meeting with my surgeons - breast and reconstructive and after that of course Rads. The side effects have been a little better with Taxol than they were with AC. Still some nausea - and bone pain from days 2-6 post chemo - but neither one are unbearable. Just enough to make me feel a little under the weather, and to remind me that I'm not well. The chemo has shrunk my tumor, thankfully. Originally it was 4 cm - walnut size - hard and easy to detect. Now we can't even feel it. Even if they say I'm a candidate for a lumpectomy, I'm feeling pretty committed to BMX with recon - just for my mental health. I have moments when I'm reasonable - but too many when I'm an emotional wreck. Does anyone else feel that way about the BMX? It's nice to know I'm not alone here - but I wish all of you nice ladies were not dealing with this either. Take Care. xoxo",
      "MessageIndex": 3029,
      "PostDate": "07/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Jul 12, 2015 04:28AM georgie61 wrote: Wow. Once again I am so happy to hear these real stories and to hear that I'm not alone. I'm so glad you did what you did, and you are giving me the strength to do the same. Thank you!",
      "MessageIndex": 3106,
      "PostDate": "12/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "May 12, 2015 10:58AM georgie61 wrote: Karen....I also have my 3rd AC treatment this Friday and like you my eyes have suddenly become more sensitive. i was wondering if it's because my lashes are thinning?? Have noticed a runny nose which supposedly is from losing the hair inside the nostrils. I have to say, i love not having to shave my legs or under my arms though , so a few positives!",
      "MessageIndex": 1357,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Jun 2, 2015 06:45PM georgie61 wrote: Little Blue flowers - it looks like we may be in the same boat here. I finished my last dose of AC on Friday and feel like crap right now. The metallic taste in my mouth is the worst. I can't get rid of if with mouthwash, brushing teeth, I tried gargling with soda and salt - but it won't go away. I can't find any food or drink that tastes ok. I was going to do weekly Taxol but they changed to Dose Dense to accomodate my travel - it is 220 miles one way - so my first of 4 Dose Dense Taxols will be June 12th. Does anyone know if it will be better with the Taxol - as far as the metallic taste? What a trip. I'm definitely growing weary.",
      "MessageIndex": 1997,
      "PostDate": "02/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Jul 19, 2015 06:25PM georgie61 wrote: That is awesome! That is about how mine feels as well. That is a big advantage of having the chemo first - knowing it was working! congrats!!",
      "MessageIndex": 3324,
      "PostDate": "19/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Aug 6, 2015 04:44AM georgie61 wrote: GKO , I had a similar praying experience, although mine wasn't as public. My primary care physician, who is a nice christian lady, asked me when I was in her office if she could pray for me. I just thought she meant she would keep me in her prayers. She had her hands all over me invoking the powers of God and Jesus to remove my cancer. My husband was there. It was definitely odd, but since it came from a good place I was ok with it. But at the UPS counter??? geez!",
      "MessageIndex": 3740,
      "PostDate": "06/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Jul 19, 2015 12:41PM georgie61 wrote: Did anyone else in the group have Neo-Adjuvant Chemo (chemo before surgery)? I feel like I'm now in a different phase than most of you and I'm still dealing with the lumpectomy / mastectomy decision and not getting the information I need to make it. I'm very frustrated. Either way, my MO said I am getting radiation. I just can't get anyone to admit to me that I would have a decreased risk of local occurrence with BMX than with lumpectomy. I have an appt with BS Wednesday and I'm hoping she will be more helpful. She did a breast MRI pre-chemo and maybe with a repeat one we can see how much things have shrunk, etc..",
      "MessageIndex": 3313,
      "PostDate": "19/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Jul 19, 2015 09:44PM georgie61 wrote: Dizzparkmom, I will let you know on the MRI results when I get them - but I sort of like your approach BMX even with good response and shrinkage. Will you be getting Rads after surgery? I was told I will have 6 weeks of Rads - 5x per week - so I will have to find a place to stay by the hospital. Too far to drive every day. I sure appreciate sharing your story and reasons - this is all helping.",
      "MessageIndex": 3330,
      "PostDate": "19/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Apr 11, 2015 08:22PM georgie61 wrote: So, I went to my Appts for the first time with my MO and BS. I really liked everyone and they seem to have a plan in place. They want me to do neoadjuvant therapy - chemotherapy before surgery. I begin this coming Friday. I need to get well enough for chemo though. All of the stress has wiped me out - I caught a terrible cold, cough, sore throat and have completely lost my voice...I can't utter a word. I was lucky enough to have my husband and both of my brothers with me during all of the consultations which really helped. I will begin with AC every 2 weeks for 4 cycles; then 12 weeks of weekly Taxol treatments. Besides the chemo, I need to travel 220 miles 1 way for these so we will be putting lots of miles on the vehicles and trying to figure lodging out that won't bankrupt us. I'm still incredibly overwhelmed. The first inkling of a problem was only 3 weeks ago. Everyone has been very supportive here and it means a great deal. I don't know quite what to expect sitting in the chemo chair, but I guess I will find out soon enough. It sounds like I will be doing it regularly for the next 5 months!",
      "MessageIndex": 362,
      "PostDate": "11/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Jul 11, 2015 05:56PM georgie61 wrote: Hi Everyone! I just finished my DD Taxol yesterday - my last Neulasta shot today - and in 12 days I have my last DD Taxol. The SE's are just starting to hit - nauseous, tired, and losing my taste buds - but knowing the end is in sight is helping psychologically. I'm glad that the chemo is almost done but know I'm overwhelmed with my next stage - Surgery. It will be scheduled at my next appointment when I meet with BS. As much as I feel good about my doctors and the care I've got so far - I can't seem to get an answer that makes sense on choice of surgeries. I'm 95% sure I'm opting for double mastectomy with reconstruction but they keep telling me that there is no evidence that a lumpectomy wouldn't offer me the same protection. That doesn't even make sense to me. I'm triple negative, at least 2 lymph nodes were positive, and tumor was 4 cm's when I started. They emphasized how fast growing everything was at the beginning; how can it not be better to remove all of the breast tissue? Anyone else have a similar experience?? They told me I for sure am getting radiation either way. I guess my feeling is - I think I need it for my mental health. I want to know I did everything I could with no regrets. Does that make sense? I cracked up with all the eyebrow stories. My right one has just thinned a little - but my left one has completely disappeared on the outside about half way...so I feel like I need to draw it on before I go out. My eyelashes are sporadic so I quit wearing mascara - it just draws more attention to them. If I thought there was even a chance that I could put on false eyelashes successfully I'd try it - but I know myself too well!",
      "MessageIndex": 3096,
      "PostDate": "11/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Jul 11, 2015 07:36PM georgie61 wrote: Thank you for the support on this Jackbirdie! I would love the easier recovery of a lumpectomy - but I think the extra recovery time will be worth the peace of mind. I'm glad I'm not alone on this.",
      "MessageIndex": 3099,
      "PostDate": "11/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Jul 19, 2015 05:49PM georgie61 wrote: Thanks Bluedog - Since we are basically in the same boat. That is the same information I've been getting and I would love to have the easier surgery. Since I can't get hard numbers from my doctors - I've been googling - which could be a huge mistake. I saw the following on a website www.atlantabreastcare.com - which may or may not even be accurate. Risk of local recurrence Approximately 5-15% with Lumpectomy and Radiation Approximately 2-5% with Mastectomy Overall Survival Rate of Lumpectomy With radiation, same as mastectomy So, from what tI think they are saying is there is a higher risk of local recurrence - but it wouldn't affect survival rate - because they could treat it again?? Did you have a good response on the tumor shrinking from chemo? I know mine has shrunk but they haven't done a follow up MRI yet, so I don't know how much. I know, I'm making myself crazy. I wish I could relax and trust that things will be ok - but since I already got so unlucky with this bit of bad luck - ( the out of the blue diagnosis) it's hard to not think my luck may continue this way.",
      "MessageIndex": 3321,
      "PostDate": "19/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Jul 19, 2015 05:54PM georgie61 wrote: Ankledolphin - I couldn't agree more about the surgical studies. The only ones I've agreed to are the ones where they can just have access to my records, etc... But when asked to do things that require more procedures than necessary, a possible placebo, or more trips ( we live 220 miles away) I've said no. We need to take care of ourselves first - even though I know we both appreciate the research being done.",
      "MessageIndex": 3322,
      "PostDate": "19/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Oct 16, 2015 11:32PM georgie61 wrote: I too love rubbing my head. I just got done spending 4 days with my daughter in a hotel room. She would reach over in bed and pet my head!",
      "MessageIndex": 5094,
      "PostDate": "16/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Jul 24, 2015 07:59PM georgie61 wrote: DONE WITH CHEMO!! Just finished my last Taxol on Thursday. I was so looking forward to the big production I've been hearing - the nurses would sing a song - patients rang a gong - cookies or something else yummy were brought around. My chemo didn't get done til 6 pm Thursday night - one nurse there left - and no big production. I rang the gong for me and my husband! He brought me flowers. Oh well, I'm still done! After that, at 6:30 I had my post-chemo MRI and I'm just waiting for result of that which should be in Monday or Tuesday. ( Friday is a Utah Holiday and everything is closed) From all of the exams I had from the BS and MO - they can't feel a thing where my walnut size tumor was - so I'm optimistic that the MRI will be positive news. I also didn't have to get a neulasta after this last treatment so...maybe no bone pain this time??? it would be nice! I also met with BS and scheduled my double MX with initial recon for August 28th - so I'm looking forward to over a month off from treatment. I'm going to try to visit some family members and have a little fun. Congrats to everyone else that is finishing up this phase and I hope the SE's get better. xoxo",
      "MessageIndex": 3487,
      "PostDate": "24/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Aug 6, 2015 04:39AM georgie61 wrote: I love the picture Steph. What sweet, sweet faces! My kids are 24 and 26 now and I can't even think of them that age without getting emotional right now, for some crazy reason.",
      "MessageIndex": 3738,
      "PostDate": "06/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Aug 19, 2015 03:22AM georgie61 wrote: Rpayton - my fingernails look EXACTLY like that now - and it didn't even happen until 2 weeks after my final chemo. Up til then my nails were better than ever. ??? Go figure! I'm not usually a manicure gal either - bought some pale pink polish today. :)",
      "MessageIndex": 4029,
      "PostDate": "19/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Apr 28, 2015 06:22PM georgie61 wrote: I woke up with terrible throat sores today. It hurts to even swallow my own saliva let alone eat anything. I'm forcing myself to drink club soda even though each swallow is painful. I'm taking L-Lysine and using Biotene dry mouth wash and toothpaste. Do you have any other suggestions? I'd like to get well before Friday for my second sit in the lovely chemo chair.",
      "MessageIndex": 952,
      "PostDate": "28/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Oct 23, 2015 12:39PM georgie61 wrote: Dizz, CONGRATS ON THE PATHOLOGIC COMPLETE RESPONSE!!... and Happy Healing!!",
      "MessageIndex": 5161,
      "PostDate": "23/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Jul 28, 2015 02:04PM georgie61 wrote: I just got a call from my BS - and the results of my post-chemo MRI are in. COMPLETE RADIOLOGIC RESPONSE! No cancer could be seen in breast or lymph nodes! I have BiMX with recon scheduled for August 28th - so they could still get small amounts on pathology at surgery - but I needed the good news! Nice to know that all those trips to the chair were worth it. My best goes out to all of you that are finishing chemo and hope you have the same great response!",
      "MessageIndex": 3560,
      "PostDate": "28/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Aug 6, 2015 04:37AM georgie61 wrote: Addie, I have had great luck with melatonin and with benadryl - either one Although I have been using ativan. Did they not prescribe any of that for you? Maybe your MO doesn't want you taking it for some reason. I hope you find something that works for you; sleep is so important. :)",
      "MessageIndex": 3737,
      "PostDate": "06/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Aug 23, 2015 12:39PM georgie61 wrote: Ksusan - I am so sorry that you had to deal with that pharmacist. That was completely inappropriate. I live in a small town and the pharmacist and her assistants all know me and that I am going out of town for cancer tx so I get a lot of support. The old guy seems to forget that you didn't just show up with a Rx that you found on the ground - that you actually met with a specialist, discussed it in great detail, and you thoughtfully showed up at his pharmacy to retrieve it. Still, I know how you get emotional about encounters like that. I get emotional at anyone who doesn't know me well that tries to put their 2 cents in. I hope today is a better day for you, your wife and the cat!",
      "MessageIndex": 4075,
      "PostDate": "23/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Sep 29, 2015 12:38AM - edited Sep 29, 2015 12:43AM by georgie61",
      "MessageIndex": 4800,
      "PostDate": "29/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Jul 12, 2015 12:39AM georgie61 wrote: Kbee - I'm so sorry you had a recurrence despite the BMX - I realize there is no guarantee - but like yourself I know I won't regret that decision. Like you, I have pretty small breasts and I'm pretty sure the lumpectomy would leave me deformed on the left side. Hopefully this will leave me whole again.",
      "MessageIndex": 3101,
      "PostDate": "12/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Sep 17, 2015 05:45PM georgie61 wrote: QMC. They need me to be done getting fills before rads. I'm going every week. If for some reason I'm not ready they will move my rads back.",
      "MessageIndex": 221,
      "PostDate": "17/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Oct 30, 2015 08:01PM georgie61 wrote: I am 14 weeks PFC.",
      "MessageIndex": 1266,
      "PostDate": "30/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Sep 17, 2015 04:23AM georgie61 wrote: Can I be added to the group? I am scheduled for my planning session on October 23rd and 25 rads after that. Thanks! Marcy",
      "MessageIndex": 206,
      "PostDate": "17/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Sep 17, 2015 01:01PM georgie61 wrote: Thanks Queenmom....I still have one drain left...grrr..but get to start my fills next week. TE's dont seem so bad so far. Just happy that that said I was NED! Rads should be just an extra kick to show cancer who's boss.",
      "MessageIndex": 210,
      "PostDate": "17/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Oct 30, 2015 07:44PM georgie61 wrote: Day 2 of Rads - so far so good. But even more exciting - my husband will be here in town any minute. We decided to have him come here instead of me going home so we could go to the Utah Utes vs Oregon State Beavers football game. ( DH & I met at OSU!) While I am waiting for him I just took some pictures of my hair progress....so exciting to finally see some growth!  ",
      "MessageIndex": 1264,
      "PostDate": "30/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Nov 3, 2015 10:53PM georgie61 wrote: 4 down....11 to go. The worst part is just having to live away from home while its going on. Rads takes 15 minutes - as you know - and then ---what to do with the rest of my days and nights - alone? I'm going to a gym every day, library alot - trying to keep busy, and be positive. Just getting tired of it all at this point. So far my skin is holding up, and fatigue hasn't hit - but I'm sure its all coming. The reality of being at the end of all of this is hitting as well - which is bittersweet. Of course, I want it to be over - but it has been my life since March and it's going to be hard to turn it off and move on, I'm sure. I'm going to head home this weekend, which will be nice. It's a 3 hr drive and home got 5 inches of snow today - so hopefully the weather will cooperate. On top of everything else, I'm trying to hold up my parents - in their 80's. They are aging a lot and everyone keeps telling me how worried they are about me even though I've been nothing but positive with them. Sorry for the random comments....I'm a little lost! xoxo",
      "MessageIndex": 1322,
      "PostDate": "03/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Oct 26, 2015 11:03PM georgie61 wrote: Hi Everyone - We got me moved over to Salt Lake City and checked into the Hope Lodge yesterday. When I met the RO a couple weeks ago he told me I would be getting 25 doses - so that's what we planned. Imagine my surprise today when we showed up for the simulation and tatoos - he told me he only wanted to give me 15 now - and no boosts! I had such a good response to chemo, and a clear path report - so there was even some discussion about whether I even needed rads - so it actually makes sense to me that I don't need the whole enchilada. My first one is this Thursday the 19th - which means I should actually be done and home before Thanksgiving. Yeah!!!! I have learned so much from all of you that I have my aquaphor, vitamin e, emu oil and mepilex dressings all ready. Oh yeah, a cooling towel too. Good to be prepared!",
      "MessageIndex": 1180,
      "PostDate": "26/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Nov 2, 2015 12:30AM georgie61 wrote: JCtreehugger - that is great that you are in Beaver nation! are you in Corvallis - Willamette Valley area? The game was a lot of fun. The crowd was fun - and although Utah won - the Beavs held their own. Thank you everyone for the words of encouragement and support for my isolation. I am definitely doing better. It was great having my DH here with me - and while he was here they got the wi-fi working, and dvd players installed - so now that he is gone - its much less lonely. I've only had two treatments so far and haven't noticed any side effects yet. Hopefully, if I'm not too tired for the 3 hour drive - I'll be able to head home on Friday after rads for the weekend. I hope everyone had a great weekend and has smooth sailing for treatments this week! xoxo",
      "MessageIndex": 1285,
      "PostDate": "02/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Nov 5, 2015 12:31AM georgie61 wrote: Thanks everyone for the words of encouragement and the company! # 5 of 15 done today. Tomorrow I have an appointment with Genetic counselor and we will see if I will be getting testing. I have had no breast cancer - or cancer period in my family - but I've heard that being Triple Negative may make me a candidate - so we will see. I sure want to give my 24 year old daughter any information that may help her. It's humbling staying at this Hope Lodge - American Cancer Society - I'm meeting people with all different cancers - as a matter of fact I haven't run into anyone with breast cancer . Many are much \"sicker\" than I am. I try to be grateful for these things when I find myself getting down. I've been going to the gym every day - the library - and today I found a beautiful yarn shop and decided to pick up some knitting needles again. Best wishes to everyone on this road. xoxo",
      "MessageIndex": 1351,
      "PostDate": "05/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Nov 6, 2015 05:02PM georgie61 wrote: Thanks HappyHammer! I think Knitting and Crocheting are one of those things - like riding a bike. I can go years without doing one - get reminded how to do it - and away I go. I wish I would have thought of it sooner - I'm finding it very therapeutic- especially with some gorgeous yarn!",
      "MessageIndex": 1403,
      "PostDate": "06/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Apr 24, 2015 12:22PM georgie61 wrote: what is mmj? Can't think.",
      "MessageIndex": 794,
      "PostDate": "24/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Apr 24, 2015 07:52PM georgie61 wrote: I was told to take Claritin for the first 5 days. For whatever reason, I did not have any bone pain from the Neulasta. Also, I think today was the best day I've had. So, maybe the next week until my next AC treatment will be a little more positive??? A girls gotta dream. My 26 yo son is driving to see me this weekend and use his computer skills to set up a home office network so I can get some work done from home. Hopefully the weekend will treat us all well!",
      "MessageIndex": 818,
      "PostDate": "24/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Jul 19, 2015 11:11PM georgie61 wrote: They do have a Ronald McDonald house, but its only for families with a sick child.",
      "MessageIndex": 3333,
      "PostDate": "19/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Sep 23, 2015 01:31AM georgie61 wrote: Laura, I'm so terribly sorry about your husband. It is a nightmare. I hope you can get some comfort knowing all of us are thinking of you. I hope you have family and friends nearby to support you . xoxo Marcy",
      "MessageIndex": 4660,
      "PostDate": "23/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Oct 7, 2015 06:13PM georgie61 wrote: Dizz....You poor thing. Im sure the ear surgery will go well, but I know how difficult the travel can be. I have had to travel as well for every little thing. Right now I am travelling to Salt Lake City once a week for TE fills. Just got back Monday, and Im heading back Friday. I am actually going to have a little fun this weekend. My 24 year old daughter is flying from Portland, OR to SLC to hang out and have a girls weekend!! She is even going to go to my fill appointment with me Monday before she has to head back. I am also looking forward to her opinion on how big my fills are and how many more I should get. My husband is way too easy going. He honestly could not care less if I was an A cup or a DD.....which is nice, but not real helpful. I apologize to everyone for not posting more, I get a lot of support from all of you ladies and think of you often. xoxo",
      "MessageIndex": 4962,
      "PostDate": "07/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Oct 30, 2015 12:42AM georgie61 wrote: Hi everyone! I had my first of 15 rads today.  So far so good - the only disappointment is the way they have to schedule me. I don't have consistent appointments.  Tomorrow is 7 am (!) Monday 5:15 pm - and they have all the others scheduled - and they are everywhere in between.  Oh well.  Also, I'm away from home.  Staying at the Hope Lodge her in Salt Lake City- which is new and nice - but they don't have the bugs worked out.  No consistent wi-fi - ( I'm at a public computer)  No cable TV hooked up, They were nice enough to say they were going to put DVD players in our rooms so we would have something to watch until they cable could get sorted out - but that was 3 days ago and no news yet.  I'm very lonely - and starting to get a little depressed.  I have books to read - but find my wind wanders to dark places enough still that it is hard to stay focused on my book.  I'm trying to stay positive.  I love all of the tips and advice from everyone...thank you!",
      "MessageIndex": 1242,
      "PostDate": "30/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "georgie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213621/profile",
      "Content": "Nov 5, 2015 08:19PM georgie61 wrote: Queen Mom - the name of the store is Blazing Needles - and it is just gorgeous. They have luscious works on display and the most beautiful, soft yarns! I told the saleslady that I want to start up again - after not doing it for a couple years - and what did she recommend?...she gave me a simple pattern for a beanie ( perfect for my almost hairless head). Since I'm headed home this weekend I will pick up the circular needles that I need I also got some gorgeous fine cotton that I will use to crochet edgings on pillowcases. I have worked on these pillowcases while here - but this is just inexpensive crochet thread that I got at Michaels. The new stuff is super soft - and deep burgundy and deep purple to go with some quilts I've made. If I really decide to splurge - there was a gorgeous, plush scarf - that was a very simple design - but with 7 skeins of yearn @ $26 / skein ----well, let's just say I need to contemplate that one a little before I commit! Here are my pillowcases so far :  ",
      "MessageIndex": 1383,
      "PostDate": "05/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    }
  ]
}