{
  "AuthorID": "GeorgiaMom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
  "Posts": [
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Jan 27, 2013 09:10AM GeorgiaMom wrote: Talk to your doctor about your fears and your family history, request a thorough mammogram and ultrasound and go from there. From what you have described it sounds like normal hormonal changes from your cycle mixed with intense fear due to the loss of your mother. Is there any way you can verify what type of bc she had? I don't think it is out of line to request genetic testing but unless you have multiple family members with bc or if you are diagnosed yourself under age 50, your insurance may not pay for it. A PET scan would be many steps ahead and I doubt any doctor would order one without a bc diagnosis first. I know how hard it is to not worry about every ache when you're worried about bc, but it really doesn't change anything. Try not to worry until or unless you have something to worry about. I wish you the best news possible with your mammo this week. Please keep us updated!",
      "MessageIndex": 1,
      "PostDate": "27/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799504",
      "Title": "Complete understanding of what is going on: smart, or madness? ATLgadgetgrrl SelenaWolf"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Sep 10, 2012 01:04PM GeorgiaMom wrote: I had the Mammosite radiation in February. It was a tough week but then it was done. No regrets. Mine went extremely well and recently when I had a mammogram the radiologist couldn't even tell I had it done. She was amazed! Good luck with your decision!",
      "MessageIndex": 3,
      "PostDate": "10/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/793299",
      "Title": "mammosite radiation mishka mishka"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Jan 13, 2013 02:02PM GeorgiaMom wrote: I was diagnosed a 1b because my tumor was right at 1 cm. It was not multifocal and there was no dcis. It was classified as micropapillary which is a rare subtype of IDC. I had a lumpectomy, internal Mammosite radiation and 4 rounds of chemo. My lymph nodes were clear but oncotype score was 20 so I did chemo. I'm just 1 year from diagnosis but so far NED. I know you we're looking for 1a but I was just 1mm away from that.",
      "MessageIndex": 1,
      "PostDate": "13/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Apr 5, 2012 12:06PM GeorgiaMom wrote: I'm 47. Diagnosed with IDC stage 1, with no node involvement. My Oncatype score was 20 and my onc recommended chemo. I'm halfway done with my four rounds. Deciding factor was my age. I have a 13 year old and 11 year old daughter and I felt like I had to do everything possible to prevent recurrence. Such a personal decision - the main thing is to make your decision and go with it without looking back! Good luck to you!",
      "MessageIndex": 8,
      "PostDate": "05/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/784432",
      "Title": "58 y/o, Oncotype Score of 20, No Chemo Blessed58 shuf"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "May 14, 2012 05:31PM GeorgiaMom wrote: I hope I'm not jinxing myself but I'm 6 days post tx #4 and so far it's been the easiest round yet! I hope that gives everyone some hope! I did break out in hives again and had to go back on a steroid dose pack but I've had NO bone pain at all this time and that is usually my worst SE. Maybe the steroids have helped- like the Claritin? Don't know but I sure am happy about it!! Another bad side effect I've had after each tx has been heartburn. And I mean HEARTBURN!!!! My MO recommended Prilosec and it has worked wonders! So... After a horrible round #3 an easy, breezy round 4. I hope everyone else fares as well!",
      "MessageIndex": 333,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Jun 7, 2012 09:22AM GeorgiaMom wrote: Hello Everyone, Haven't checked in for awhile.  I took a little hiatus from the boards to try to focus on my post cancer life.  But I can't stay away... It's been a crazy busy few weeks since my last treatment. Getting through the end of the school year was very hectic - both as a parent and a teacher.  My youngest daughter \"graduated\" from fifth grade and just like that my 7 years as an elementary school parent are over.  I now have two middle school daughters and all the drama that comes with them - please pray for me!  2012 continues to throw challenges at me as I'm now officially unemployed.  My part-time teaching position was cut for budget reasons.  My principal is trying to find something for me, and I think she will, but right now I am in limbo.  I had my port removed last week and that was a very happy day.  Also heard the words \"No evidence of cancer\".  Love that.  However, I'm finding that being done with treatment doesn't mean being done with the whole ordeal.  Been having a bit of trouble coping lately.  I think I just dove into treatment head first without thinking about it and now I'm finally coming to terms with the fact that I have, or had, cancer and that my life will never be the same. For example, at my last onc. appt. I mentioned that I had some congestion in my chest and a weird asthma like cough.  Of course, that earned me a ticket to a chest CT to rule out a pulmonary embolism.  REALLY? Can't it just be a little congestion (which it was - completely gone now). I'm grateful to know that everything is okay but I feel like for the rest of my life we will have to rule out \"worst case scenario\" for every little physical ailment. On a positive note, I started Tamoxifen last week and so far, knock wood, I have had ZERO side effects! Hope that trend continues.  Also, my husband shocked me this week by planning a surprise trip to the beach this weekend to celebrate his birthday. He wanted to go to the mountains but booked the beach trip because he knows how much I love (and NEED) the beach.  He is a good guy! CAN\"T WAIT to put my toes in the sand even though they are slightly numb due to neuropathy! SO HAPPY for all of you that have finished treatment!  Did a little happy dance for all of you.  For those that are almost done, halfway done, or just starting you've got my prayers.  You will all make it through before you know it.  Hope EVERYONE has minimal (or better yet, no) side effects.  Have a great day! Jeanne",
      "MessageIndex": 613,
      "PostDate": "07/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Jun 9, 2012 10:26AM GeorgiaMom wrote: Hiker- on a positive note - I had NO bone pain during round 4 and I think it was because of the steroid dose pack that I started on day 2 after treatment. Hope you get to finish up. For anyone who us losing eyelashes and wants to use Latisse - you might want to wait until a couple of weeks after your last treatment to start. Apparently your eyelashes get \"confused\" and don't know whether to grow or fall out. If you wait until after your done you should have more success. I'm one month past my last treatment and my hair is growing but it will be a very long time before enough comes in to look fairly normal. I guess it's a good thing that I really love my wig! If anyone knows of a product to help speed it up, I'd love to hear about it! Hope everyone has a great day! I'm about to park my butt on the beach for the day!",
      "MessageIndex": 636,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Dec 28, 2012 04:55PM GeorgiaMom wrote: It is really hard to guess your treatment plan until you have more info. There are plenty of women your age that have hormone sensitive cancer. Don't know why your dr. would assume otherwise. If you are Er/Pr+ you will have five years of hormone therapy (tamoxifen probably) but triple negative is not the end of the world either. Don't worry about that unless you have to. I was diagnosed almost a year ago. Right after diagnosis I had a bilateral breast MRI to determine if there was any hidden cancer in my very dense breasts. I also had a PET scan because in my initial pathology report it was unclear if it was a primary breast cancer or if it had spread from somewhere else. That was probably unusual and my bs thought it was ridiculous the way it was worded in my report since that would have been highly unlikely, but it bought me peace of mind when it showed no metastasis. The MRI made it clear that there was just one small tumor so I had a lumpectomy with sentinel lymph node dissection. Lumpectomy was a breeze and I was back at work teaching elementary school the same week. I was able to do Mammosite internal radiation and breezed through that. I had twice a day radiation for five days and worked in between the am and pm treatments. I thought I was finished then (which would have been 7 weeks after diagnosis) but my oncotype score came back in the intermediate range so I chose to have chemo. I had 4 rounds and finished in May, just 4 1/2 months after diagnosis. I worked throughout chemo, and continued my normal hectic lifestyle of carpools, soccer games etc. I chose to wear a wig because I didn't want to look like a cancer patient and because it would have freaked out my adolescent daughters! That is a personal decision you may or may not have to make. I finished chemo in May and ditched the wig in November. I have a short, very curly hairstyle now- not a look I would have chosen but it is all mine! Sorry to be so long winded but wanted you to know that you can get through it. At 1 year from diagnosis I can look at the whole ordeal as just a bump in the road. Just try to take it one day at a time!",
      "MessageIndex": 42,
      "PostDate": "28/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/797989",
      "Title": "Just Diagnosed- MerryChristmas (sarcastic) smethot Kimberly1965"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Feb 8, 2012 03:41PM GeorgiaMom wrote: Hi Kfontaine, I was just diagnosed on January 3, and now just one month later the picture is so much brighter.  My original diagnosis stated that they \"couldn't be sure it was a primary breast cancer\" and that it may have started somewhere else.  Suddenly, I found myself wishing that it was \"just breast cancer\".  How crazy is that?  Of course then, every ache and pain scared me even if I'd experienced it a thousand times before. Because of the initial report, my surgeon ordered an MRI and a full body PET scan and they discovered that there was no more cancer anywhere.  I had a lumpectomy on January 31st and they got clear margins and found no cancer in my lymph nodes.  Still don't know if I will  ndeed chemo, but it looks like I may be lucky enough to skip that process and just have radiation. The hardest part of this whole scary disease is the WAITING.  Once you know what you're dealing with and have a plan, you will feel so much relief.  Praying for you that your surgery goes well and that you will soon have great news and a PLAN! :) Stage 1 IDC (Micropapillary). ER+, PR+, Her 2-, grade 2 node negative, 0/3",
      "MessageIndex": 22,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/781657",
      "Title": "Diagnosed and scared kfontaine bluepearl"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Apr 4, 2012 02:29PM - edited Apr 4, 2012 02:35PM by GeorgiaMom Janie- I'm spending a lot of time on the \"throne\" too. Not fun. Happy Birthday (a few days early) to you. I hope you get that nice meal and glass of wine and that you enjoy it! Catherine - you look beautiful!!! Today is my 14th Anniversary and we're supposed to go put for a yummy Italian meal. I think we may postpone until the weekend so I can enjoy it more. One thing I know for sure is that my wonderful husband is handling the \"sickness\" vow beautifully. I feel so lucky to have him in my life! I hope everyone has a great day! Jeanne",
      "MessageIndex": 37,
      "PostDate": "04/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Apr 13, 2012 06:44PM GeorgiaMom wrote: Catherine- sorry you had a hard time again but glad they didn't have to alter your treatment (of course even if they did we'd want you to hang out here anyway). Once you figure out your SE's and when to expect them you don't want to start on something else. Slak- I love that you named your wig! I'll have to come up with a cool name for mine sinec it will be a part of my life for a long time. I really like mine and find it makes getting ready in the morning so easy. I've gotten a lot of compliments on it from people who don't know it's a wig but I find it hard to just say \"thanks\". Today someone asked me where I got my hair done and I confessed that it was a wig. What's wrong with me? Anyone else feel weird like that? And yes 2012 has been a crappy year so far but I'm hoping to have the best summer of my life. Will you all please remind me of that when I start complaining about how hot my \"wonderful\" wig is? Have a great weekend everyone! Jeanne",
      "MessageIndex": 72,
      "PostDate": "13/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Mar 31, 2012 12:32PM GeorgiaMom wrote: Hello everyone, Jumping in from March 2012 site. I'm doing TC X4 also. Started on March 9 and had second treatment on the 28th. Bone pain has set in but is not too terrible yet. In addition to my cancer woes I fell off my bicycle 2 weeks ago and badly broke my wrist. Had surgery this week and am doing so much better. Won't be doing anything too adventurous for a while. Wearing a wig is hard enough- putting it on with one hand is even harder! But it has really helped me keep things in perspective. - if I can stay out of the ER this round should be a breeze! Likeachickadee- I look just like my brother too! When I first saw my buzz cut I just had to laugh! Also,I grew up in the DC area and my husband lived in Columbia. I'm in Atlanta now but can sympathize about the long hot summer ahead of us! Looking forward to chatting with all of you! Have a great weekend! Jeanne",
      "MessageIndex": 16,
      "PostDate": "31/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Mar 31, 2012 01:46PM GeorgiaMom wrote: Well Valerie - While I was riding my bike I failed to mention that we were riding to a pizza place where we pigged out on pizza and garlic knots. Stupid accident happened because I was carrying a small box of leftovers and couldn't break properly. I'm calling it a chemo brain moment. But it was good pizza... Good for you for going to a spin class. I'll be staying away from stationary bikes as well. I'm going to hope for a chemo induced weight loss instead! As for hair loss - I'm 23 days out from first treatment and still have lots of stubble. I'll be pretty ticked if I shaved my head and look like my brother for nothing! I think day 17 is a big loss day for many! Jeanne",
      "MessageIndex": 18,
      "PostDate": "31/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Apr 1, 2012 12:37PM GeorgiaMom wrote: Janiemomof2- I've heard that a teaspoon of extra virgin olive oil helps with the metallic taste. I haven't tried it myself yet but it might be worth a try. Glad you made it through your daughter's B-day. My oldest daughter turns 13 on Easter. Hoping to feel better by then. Enjoy your Sunday!",
      "MessageIndex": 23,
      "PostDate": "01/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Apr 11, 2012 07:29AM GeorgiaMom wrote: Janie - you look beautiful! Catherine and Likeachickadee - good luck on your treatments today. I hope it is uneventful and that you have minimal side effects! Likeachickadee - I'm sorry you are going through so much right now. I'm glad you have a great support group behind you. It makes a huge difference! I'm a week away from treatment 3 and feeling great. I've been so lucky so far . The bone pain is the worst SE for me and for treatment 2 I only had half a Neulasta shot and it made a huge difference. Still had the pain but only for about 1 day instead of 4. My hair has not completely released yet. I had it buzzed 2 weeks ago to about a quarter inch but about half of it is still hanging on. It looks hideous! Don't know whether to leave it alone or shave it. I think there may even be some new growth. Anyone else still hanging on to some of their hair? I'm so excited to be getting my cast off today. I will have a removable splint for a few weeks but I will be able to shower again without plastic! I think I will also need physical therapy. Just what I need - more dr. appointments! Oh well, this too shall pass! Have a great day everyone! Jeanne",
      "MessageIndex": 59,
      "PostDate": "11/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "May 15, 2012 08:37AM GeorgiaMom wrote: Catherine - your artwork is beautiful!!!! I'm artistically challenged in so many ways. I am in awe of your talent!",
      "MessageIndex": 349,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Jun 9, 2012 03:19PM GeorgiaMom wrote: Stay Shiny- we might have the same wig lady- did you get yours at Northside's Women's Center? I have some lotion for my scalp- I wonder if that would help. I was pretty zoned out last timeI was there because they had just buzzed my hair. I don't think i paid enough attention! Let me know what you find out.",
      "MessageIndex": 640,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "May 9, 2012 10:18PM GeorgiaMom wrote: Wow, it's been a long time since I posted.  I actually wrote my last post during treatment # 3, three weeks ago.  It was a long post and I lost it in cyberspace and haven't posted since.  Round 3 was the toughest for me.  None of the SE's were horrible, they just lasted longer and there were more of them.  Bone pain lasted longer, more fatigue, horrendous  heartburn, constipation and diarrhea were about the same but I ended up with an uncomfortable hemmoroid (TMI ?), and finally I started itching horribly on my hands and feet, and later broke out in hives so was put on a steroid dose pack.  The toughest part was that it all started to affect me mentally.  I'm just so over everything and ready to get back to feeling normal again!!! So today was my last chemo!!! So excited!  I thought about doing cartwheels out the door but was afraid I'd end up with another broken bone for an even stupider reason than riding my bike with a pizza box in hand so I sort of skipped out instead.  Coincidentally, I met a fellow March/April chemo member several weeks ago when we were getting our lab work done and she asked me if I broke my arm riding from a pizza place. Small world! We've chatted each time since then and today I found out it was StayShiny!   I hope you fare better with round 3 than I did.  BTW, which doc do you see? I hope everyone is doing well and having minimal side effects.  I'll try to be better about posting but I've got a ridiculously busy couple of weeks ahead of me.  Hoping it will distract me from the side effects.  I know I can do it now.  I did the 5 day mammosite partial breast radiation before chemo so I will move on to Tamoxifen in a few weeks and hopefully seriously cut down on doctor visits!!! For those of you just starting out, I promise you, you can get through it and it will go by quicker than you expected! Take care everyone!  Jeanne",
      "MessageIndex": 286,
      "PostDate": "09/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Jun 7, 2012 10:53PM GeorgiaMom wrote: Stay Shiny- I think my hair is starting to grow a little but I think it willl take forever! Slak- I got so excited when I read your post about sunlight because I live at the pool in the summer with my kids. But... I have yet to leave my house without my wig and I'm guessing the sunlight would have to reach my bald head, huh? My drama queen girls would FREAK out if I left the house bald!",
      "MessageIndex": 617,
      "PostDate": "07/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Jun 8, 2012 07:36PM GeorgiaMom wrote: Hiker- really sorry to hear about your allergic reaction. I had a much milder allergic reaction, or sensitivity, after the 3rd treatment. My hands and feet itched like crazy and I broke out in hives. It was about 10 days after treatment. My onc prescribed a steroid dose pack. Went ahead with round 4 and had the same reaction on the second day after treatment. Prescribed steroid dose pack again. Definitely doesn't sound as bad as yours but I swear it was my body saying \"enough already!\" Hope you feel better soon and they figure out what to do for you. Keep us posted!",
      "MessageIndex": 629,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Apr 14, 2012 09:55PM GeorgiaMom wrote: Welcome Jaebon! My first treatment was on a Friday and I started to feel bone pain on Sunday afternoon. It Lasted for a couple of days. Had my second treatment on a Wednesday so I could have the worst SE's on the weekend when I don't have to work. Scheduled for Tx #3 this Wednesday. So far, the SE's for me have been very tolerable and I haven't missed any work. Hair loss is a real tough one - probably the hardest part of the whole cancer ordeal for me but it will grow back. Hope your side effects are minimal! Hang in there! Jeanne",
      "MessageIndex": 75,
      "PostDate": "14/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "May 15, 2012 02:27PM GeorgiaMom wrote: Janie- so sorry you've had such a hard time. I struggle with the\"big D\" but have not had it as bad as you. I seriously questioned whether I should go ahead with the last round because I felt like my body was trying to tell me something with round 3 - like \"enough already!\" I developed hives which seemed like a loud and clear message that my body was done with chemo. But... I went ahead with it anyway and am glad I did. Even if the last round is tough you'll know it is the last time and that makes it so much easier to deal with mentally! Hang in there - you are so close!!!!",
      "MessageIndex": 357,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Jul 19, 2012 06:26PM GeorgiaMom wrote: Good question. If they are doing a biopsy then nursing may be uncomfortable but that is not necessarily a reason to stop. Did you ask your doctor? I wish I had an answer for you. I do hope all goes well and that you can wean your babies when you're ready to. Good luck and keep us posted!",
      "MessageIndex": 1,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790812",
      "Title": "question about biopsy carlz carlz"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Jan 3, 2013 10:17PM GeorgiaMom wrote: I'm so sorry! I was diagnosed one year ago today. It was a hard and scary year but I got through it. This is the hardest part. You will feel better when you have a treatment plan and are actively fighting the cancer. I don't know how old your daughters are but I can tell you they will probably take their cues from you. If you can find a way to remain strong and positive it will help them. Come here for support when you need it and try to take it one day at a time. You will discover so much about yourself on this journey! Hugs!",
      "MessageIndex": 3,
      "PostDate": "03/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/798347",
      "Title": "Just got Biopsy results Nellie5 new2bc"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Feb 19, 2015 08:08PM GeorgiaMom wrote: I was in a similar situation. I think the difference of opinion is related to the specialties. Oncologists want to treat with chemo and surgeons think surgery is enough. My oncotype was 20 and oncologist recommended chemo. It was a tough decision but I did the chemo. Whatever you decide to do, try not to second guess yourself. Once the decision is made, don't look back and have no regrets. Good luck with your decision!",
      "MessageIndex": 2,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/828670",
      "Title": "Chemo or Not? Moderate Level #19 CM53 CM53"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Jul 15, 2012 09:04PM GeorgiaMom wrote: I know exactly how you feel. I was diagnosed in January. I had a lumpectomy and internal radiation and then had chemo until May. My first mammogram was 2 weeks ago and it was very nervewracking. The radiologist also requested an ultrasound which would have freaked me out more but she explained it was just a precaution and from now on I will always do both mammo and u/s. Fortunately everything turned out fine and I feel so much better knowing I really am NED. I don't think I will ever again have a worry free mammo again but I feel reassured knowing I will be watched extra carefully from now on. Try to relax and think about how great it will feel when you get the \"all clear\". Good luck and let us know how it turns out.",
      "MessageIndex": 2,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/790611",
      "Title": "First mammogram on Friday after diagnosis/treatment Angel123 Girl53"
    },
    {
      "AuthorID": "GeorgiaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144630/profile",
      "Content": "Jul 15, 2012 09:29PM GeorgiaMom wrote: Angel- I'm not sure if the u/s is standard procedure for all doctors but this radiologist missed my cancer last summer and she didn't want to miss anything again. Plus I have very dense breasts making it harder to see. So you may only have the mammo but don't worry if they want u/s too. Chances are very good that everything will be good! I would love to not stress all the time but I haven't figured out how to do that yet. Maybe years of clear mammos will help us!!!",
      "MessageIndex": 4,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/790611",
      "Title": "First mammogram on Friday after diagnosis/treatment Angel123 Girl53"
    }
  ]
}