{
  "AuthorID": "Geosomin",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195589/profile",
  "Posts": [
    {
      "AuthorID": "Geosomin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195589/profile",
      "Content": "May 16, 2014 05:55PM Geosomin wrote: my last chemo was March 29 and my hair is coming back but it's so patchy. I currently look like my dad- the sides are coming in ok but it's mostly bald still on top with little salt and pepper coloured sprigs. Bleh. Hoping my eyelashes return soon too. I am hoping me starting tamoxafin and recovering from my mastectomy don't slow down the hair too much. I was fine going hatless when I was an egghead. This just looks dumb...it's getting warm and I can't wait to go hatless again as soon as it it even. The patches will grow in right? Right?",
      "MessageIndex": 20296,
      "PostDate": "16/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Geosomin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195589/profile",
      "Content": "May 16, 2014 05:57PM Geosomin wrote: my last chemo was March 29 and my hair is coming back but it's so patchy. I currently look like my dad- the sides are coming in ok but it's mostly bald still on top with little salt and pepper coloured sprigs. Bleh.  I am hoping me starting tamoxafin and recovering from my mastectomy don't slow down the hair too much. I was fine going hatless when I was an egghead. This just looks dumb...it's getting warm and I can't wait to go hatless again as soon as it it even. The patches will grow in right? Right?",
      "MessageIndex": 20297,
      "PostDate": "16/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Geosomin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195589/profile",
      "Content": "Mar 25, 2014 04:09PM - edited Mar 25, 2014 04:10PM by Geosomin This started for me after my second taxotere dose too. First time it lasted a week. This time it's been 2 weeks and it's driving me nuts. At a time when I'm bald and have no eyebrows or lashes left it would be nice to be able to wear a bit of makeup and not have people look at me with deep concern whenever I feel up to being out! I am hoping that after my last dose it will fade away relatively soon...it's honestly the most annoying side effect for me. Aches and nausea I can deal with but this for some reason just takes the cake! I found Systain lipid eye drops do help with the gritty dry feeling, but they still tear away...",
      "MessageIndex": 19,
      "PostDate": "25/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/785509",
      "Title": "Watery eyes? Whatashocker3 Leatherette"
    }
  ]
}