{
  "AuthorID": "Germanfrenc…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142811/profile",
  "Posts": [
    {
      "AuthorID": "Germanfrenc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142811/profile",
      "Content": "Jan 10, 2012 05:29PM Germanfrench wrote: shila... thanks for your help !!!!",
      "MessageIndex": 10965,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Germanfrenc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142811/profile",
      "Content": "Jan 10, 2012 09:41PM Germanfrench wrote: Jo and shila thanks .. my story here in the usa is on ....very unbelieving story. I was thinking and i have beginning to write on book over this. 3 yaers my husband is no feiting against me... and it have cost me all my Money ( but my atorny Lady ist for brastcancer.. but she also make me very high bills....) first my hasband planing to abandit me over 6 month behind my back.. have contact to his Exwife ( one norse for alderly poeple ..:-)))) than he have closed all the acaunt and let me 1000 $ ( for my ticket back to germany..) he have after the Hurrican one bad bad house wat i have with helping from friends from Germany have make livelbel .. he have all my funitur ( antik ) from Germany and France ... and after all this is beginning the great Story. he ambendet me for his Ex-Wife... he have now on nice clean house.... and i have only Problems. I have loust my good work in Germany my healtincurenc .. my hous, all .. now i standin in the USA.. with a Visa for 10 years .. BUT.... sorry this all is going to emotionel for me .. i like to tell my story later .... more.. you are helpfull womens.. this is wat i need. In Germany i creat on very good Forum for brustcancer ....and we was very productiv to helping many womens .....",
      "MessageIndex": 10977,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Germanfrenc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142811/profile",
      "Content": "Jan 10, 2012 05:27PM Germanfrench wrote: thanks for the inviting to this place. I am here ..:-))) Germanfrench the complete Websides is in my eys... and i must lerning to handeling this .. found aut all the sides, poeples and how i can send messiges to anybudy ... thanks for all your help..... ",
      "MessageIndex": 10964,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}