{
  "AuthorID": "gerrib",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144875/profile",
  "Posts": [
    {
      "AuthorID": "gerrib",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144875/profile",
      "Content": "Apr 25, 2016 06:53PM gerrib wrote: Hi all. I am about 6 weeks out for umx for 2nd diagnosis of BC. I am second guessing my decision not to have chemo. The MO said that it would give me a 5% improvement in survival rate. This time I had ILC, The nodes were neg and size was 2cm. But the tumour was somewhat unusual. It was only weakly Er+ (30%) Pr neg and the Ki67 was 20%. It was characterised as pleomorphic which sounds scary when you Google, but neither the surgeon or MO seemed too concerned about 'pleomorphic', saying it was just the shape of the cells. The surgeon said he wouldn't have chemo if it was him and I came away confident that I would not require chemo. Then I went to MO and she gave me 2 options AI alone or chemo followed by AI. I dismissed the chemo option as to me 5% improvement in survival rate did not seem great to me for the discomfort associated with chemo.. But now I have become concerned about the Ki67( mine was 20%) and the only weakly positive Er+ and neg Pr. HER is neg. I am 65. my MO did not seem concerned that I decided not to have chemo. and of course I would prefer not to. I am in Australia and Oncotype testing is not done here. I would welcome any comments about whether I should reconsider my decision not to have chemo. I have commenced Arimidex and so far (3 weeks) no SEs. Thanks Gerri",
      "MessageIndex": 27,
      "PostDate": "25/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/843451",
      "Title": "To Chemo or Not ElleD Artista928"
    },
    {
      "AuthorID": "gerrib",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144875/profile",
      "Content": "Apr 26, 2016 03:18PM gerrib wrote: Thanks for your reply ElleD. I'm sorry you have had problems following your BMX. I'm pretty much in the same mind as you wrote in your first post. I vacillate between accepting the odds and fear of dying of mets to one of my major organs. I'm seeing my MO again in about 10 days. I think I will probably stay with my decision not to have chemo though. Keep us updated on your progress and decision making. Gerri",
      "MessageIndex": 29,
      "PostDate": "26/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/843451",
      "Title": "To Chemo or Not ElleD Artista928"
    },
    {
      "AuthorID": "gerrib",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144875/profile",
      "Content": "Mar 12, 2016 01:03AM gerrib wrote: I had a breast MRI to get a better picture and it showed another small area of ILC in same breast. it is not Medicare or insurance rebatable in Australia but I consider it AUD$350 well spent. i could not face having another core Bx and waiting around for more results so am having a umx on Wed.",
      "MessageIndex": 7,
      "PostDate": "12/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/842129",
      "Title": "MRI to chase down any other affected areas Ausbear vbishop"
    },
    {
      "AuthorID": "gerrib",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144875/profile",
      "Content": "Jan 26, 2017 02:53PM gerrib wrote: I wear amoena prosthesis on one side. I feel quite happy with the result. Have decided not to go ahead with having other side removed.",
      "MessageIndex": 81,
      "PostDate": "26/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/827945",
      "Title": "How is life with one boob? mtrebtoske316 Bekadawn1"
    }
  ]
}