{
  "AuthorID": "Gigicat",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237885/profile",
  "Posts": [{
    "AuthorID": "Gigicat",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237885/profile",
    "Content": "Gigicat wrote: Hi everyone! I need advice please. I had a mammogram then went to a breast surgeon who looked at a suspicious lump on his ultrasound machine in his office. Then he sent me to get another mammogram with an ultrasound at the radiologist office. The results were a hypoechoic vascular mass 13 millimeters. Birads 4. The doctor said it was spiculated. I told him I had a cat jump on my breast from a high ledge and I felt my breast was injured and it was very painful. I had a heating pad on it for days before my mammogram. He said he had been around the block more than once, an injury can't do that nor can a cat, and \"that's cancer!\". I said well okay then..so he did a core needle biopsy. I braced for the inevitable. Results of biopsy.... benign breast tissue with fibrocystic changes and fragments of benign cyst showing intracystic hemorrhage usual ductal hyperplasia without atypia pericytic fibrosis and chronic inflammation. No malignancy identified. The doctor said my results were\"discordant\" and said he wanted an MRI and another mammogram to be sure. How many mammogram tests do I need? And I had 2 ultrasounds and a biopsy...He was surprised he was wrong... The question is this...I have googled it and usually the biopsy is AFTER the MRI. Anyone have this experience? I feel like he was just surprised the tissue sample didn't match his visual diagnosis. Cost IS an issue. If necessary I will find $. But if it's an ego thing? I'm confused and unsure. Advice? MRIs are expensive and have a high deductible. MRIs are more accurate than biopsy Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "18/08/2016",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/847054",
    "Title": "An MRI After a negative biopsy? Is it really necessary? Gigicat marie5890"
  }]
}