{
  "AuthorID": "gildedcage",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182942/profile",
  "Posts": [
    {
      "AuthorID": "gildedcage",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182942/profile",
      "Content": "Aug 25, 2013 12:30PM gildedcage wrote: This is such a personal decision based on so many factors: cancer profile, feelings about body issue, how much risk one feels like living with, etc. For me, a mastectomy was the thing I feared the most. I always liked my breasts and the idea of seeing them go was really difficult for me. I was lucky that lumpectomy was an option. I was amazed that my breast looked completely normal after surgery. I was scared to take off that final bandage. I've got a scar but I'm completely ok with that. I was hoping I could eek by with only surgery and radiation but it turns out that there may be some microinvasion and I have a high Oncotype score so now I'm doing chemo too. I've talked with a few women who chose mastectomy over lumpectomy and they had good reasons for doing so: young children they need to live for, lack of attachment to their breasts or a really serious cancer diagnosis. I don't think there is any right or wrong on this one. Just take some time with it and the answer wil come. ",
      "MessageIndex": 55,
      "PostDate": "25/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/808846",
      "Title": "How did you decide on lumpectomy or mastectomy/ livingwithit IrishDancingMom"
    },
    {
      "AuthorID": "gildedcage",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182942/profile",
      "Content": "Aug 13, 2013 06:21PM gildedcage wrote: I don't know if it's possible but you might want to try a second opinion or even just change doctors. You can't mess around with this stuff and it's too hard to go on with life with anxiety about this. I'd pursue it until I felt that my concerns were addressed. Good luck. ",
      "MessageIndex": 2,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/809283",
      "Title": "getting nowhere and getting very frustrated!!!! jushavinfun jushavinfun"
    }
  ]
}