{
  "AuthorID": "GillieN",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247622/profile",
  "Posts": [
    {
      "AuthorID": "GillieN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247622/profile",
      "Content": "Feb 24, 2017 02:51PM GillieN wrote: PS. TartletMom, my back (right side) was KILLING me ever since I got the news about the mammogram in January. I tried stretching, exercise, massage and osteopathy. All helped a bit, but I am sure it was caused by tension - I was instinctively tightening my right side in anticipation and worry. I really truly believe our minds can exacerbate or play a big role in relieving disease..so I would recommend doing whatever you can to make yourself laugh and feel comforted. Have 5 baths a day if you want. Ask your kids to play the drums on your back (mine used to walk on my back when they were little :o). Find ways to soothe your stress - you deserve to be nurtured (even while you're nuturing your children). And try not to read too much online. It is good to be informed enough in order to ask all the questions you'll want to ask, but don't go down the \"what if\" road. Deal with what you know. I don't know where you live, but in Canada, the cbcf has a hotline you can call and someone will call you back to offer support. These ladies have all had breast cancer and survived, and can be your wise voice of reason in a crazy time of life.",
      "MessageIndex": 18,
      "PostDate": "24/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852889",
      "Title": "Suspicious mammogram, waiting for biopsy, very scared TartletMom cattledoglv"
    },
    {
      "AuthorID": "GillieN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247622/profile",
      "Content": "Feb 24, 2017 02:39PM GillieN wrote: Hi All, I just joined today and the Mods directed me to this forum. I can truly empathize with everyone on here! Here's my story. I'm 54 years old. Last July, I had my regular bi-yearly mammogram. I was recalled because of a suspicious area in my right breast. The second mammogram showed calcifications in a linear pattern within one duct (a tiny 1.3 cm lesion) and the radiologist recommended biopsy. Three weeks later, I had a stereostatic core needle biopsy, and I'll tell you, the anxiety created by the anticipation of this event was way way worse than the actual procedure. My breast was well frozen and I barely felt anything - only a \"tug\" when the 6 biopsies were taken. I had minimal pain afterwards. I know everyone is different and I cannot promise that the procedure is painless for all, I can safely say, it was the easiest of the three procedures I've had so far. The biopsy showed only two samples of ADH, no DCIS. The four other samples were clear. So I decided to watch and wait. Come January 2017, my follow up mammogram showed no change, and the report indicated BIRAD 5 - excisional biopsy (aka lumpectomy) suggested. Let me tell you, I had a tough time making a decision on what to do next. Should I just go on assuming there was nothing wrong? If I did, and a few years down the road, I was to discover that I had invasive bc, I would have kicked myself (or worse!). But what if I had the lumpectomy and everything came back normal? Would i be premanently disfigured for nothing? The mind can go to very dark places if it wants to. I was confused, stressed and so very disappointed with my body. I'm not perfect, but I do eat well and exercise, and I stopped smoking 25 years ago...why was this happening? Was it because I had estrogen dominance most of my life (uterine fibroids, heavy periods, ovarian cysts and weight gain in my breasts over and over as the years passed)? If so, why aren't doctors screaming about the dangers of excess estrogen and hormonal imbalance caused by environmental factors (in our food, personal care products and medications, to name a few)? To make a long story short, I decided to go ahead with the lumpectomy. It's been two days now, and I'm home recuperating. I'm in a bit of pain - especially when I move around. The weight of my breasts seems to be tugging at the incision. I'm trying different bras, but nothing seems to be right. My lesion was deep behind my nipple so I think they had to do a bit of \"digging\" to get at it (sorry for those who are surgically squeamish). I have been taking painkiller meds and they do help, but they also make me a bit stoned and cause constipation. (sorry for the gory details). I just didn't think it would hurt this much! Maybe it is becuase they cut along a previous scar (from breast reduction done over 30 years ago)...maybe that makes it worse! A little humour for you - I had a radioactive seed implanted near the lesion the day before the surgery - so the surgeon could locate the miniscule area - and apparently they lost the seed during the surgery and had to get an employee from nuclear medicine to locate the seed with some kind of geiger counter!! Can you believe it?? They found it on the floor of the operating room (and if you're wondering, I was treated at a large metropolitain hospital that specializes in bc treatment). Wonders never cease. I hope I haven't dragged on too long here. It does feel good to let it all out. I hope I haven't scared anyone by describing everything in detail. Suffice to say, I am now waiting to find out if I have DCIS that might require further treatment (i.e. sentinal node biopsy and radiation) or have nothing at all and can go on with my life with a little less breast but a lot more reassurance (and gratitude). I won't know until March 21. Four weeks away. I am going to have to keep myself very busy, once the pain subsides. Thanks for \"listening\". I look forward to learning of other people's experiences, and offering my support wherever I can.",
      "MessageIndex": 17,
      "PostDate": "24/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852889",
      "Title": "Suspicious mammogram, waiting for biopsy, very scared TartletMom cattledoglv"
    },
    {
      "AuthorID": "GillieN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247622/profile",
      "Content": "Feb 24, 2017 01:17PM GillieN wrote: Hi. I just had a lumpectomy two days ago and I'm going through post-op blues at the moment. Right breast mammo showed microcalcifications pattern leading to \"suspicion of DCIS\" in July 2016 and Jan 2017. Core needle biopsy came up with ADH only, but surgery was still recommended. I feel lucky in some ways to have not had to have a sentinal node procedure along with it. Might seem like nothing in comparison to what so many ladies are going through, but it's still a big deal for me. I'm large breasted, and I am sure I'm going to look lopsided when all is said and done. (If they find DCIS in pathology, I'll likely need radiation - dreading the thought of that). Next appointment with my surgeon isn't til March 21!! I might be able to see my pathology results before that online, but I'm afraid of what I'll see. The pain is much worse than I thought it would be (although I'm sure it's nothing compared to sentinal node removal or mastectomy pain). I live alone - have been looked after by my sister since Wed, but I'm back home now and feel quite alone and blue. Is there anyone out there who'd care to chat?",
      "MessageIndex": 2373,
      "PostDate": "24/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    }
  ]
}