{
  "AuthorID": "Gina2014",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196184/profile",
  "Posts": [
    {
      "AuthorID": "Gina2014",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196184/profile",
      "Content": "Feb 11, 2014 11:57AM Gina2014 wrote: Hello again. Well I got the call today. It is cancer both in the lump and the lymph node they biopsied. Im seeing a surgeon Thursday morning. I understand they won't know what stage it is until after surgery. Another wait. I'm starting to see how this disease can eat away at you simply by waiting for answers. They said I would need chemo. I am worried about how sick it makes you feel. Any thoughts or advice?",
      "MessageIndex": 12,
      "PostDate": "11/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/817775",
      "Title": "Waiting and scared... pagemans Nettie1964"
    },
    {
      "AuthorID": "Gina2014",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196184/profile",
      "Content": "Feb 12, 2014 08:30AM Gina2014 wrote: Hi everyone! I'm slowly coming out of the fog. My husband will be with me at that appointment so I will have an extra set of ears. I pick up my labs today so maybe I can find out what kind of cancer I have. I will check back in to let you know how it is going. Thanks for all your support! <3 Gina",
      "MessageIndex": 15,
      "PostDate": "12/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/817775",
      "Title": "Waiting and scared... pagemans Nettie1964"
    },
    {
      "AuthorID": "Gina2014",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196184/profile",
      "Content": "Feb 10, 2014 07:42PM Gina2014 wrote: AZ85048 Thank you for your kind words and support. I will certainly submit a follow up post once I know.",
      "MessageIndex": 11,
      "PostDate": "10/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/817775",
      "Title": "Waiting and scared... pagemans Nettie1964"
    },
    {
      "AuthorID": "Gina2014",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196184/profile",
      "Content": "Feb 10, 2014 06:59PM Gina2014 wrote: Hi everyone. I am new and thankful that I found these boards. I'm 49 and in perimenopause.I had a mammo in July and it was clean. Had my doc do a breast exam in August and there was nothing. The day before Thanksgiving I found a lump in my breast while bathing. I went to my GP and she called it mastitis, sent me home with antibiotic and I breathed a sigh of relief. I did some research and realized when the lump wasnt gone by January that this probably wasn't mastitis since I wasn't lactating and breast feeding! I went to my gyne and he said I shouldn't worry but to get a diagnostic mammo right away. That same day I went for the mammo and an ultra sound. After that the Dr  was \"concerned\" and ordered a biopsy. I had a fine needle biopsy on the lump and a lymph node under my arm Thursday last week. I was supposed to get results today (Monday) or tomorrow. I called the nurse today and was told that my results weren't back but that doesn't mean anything. I shouldn't read into it and she would call when she got the results. So far no phone call and I feel absolutely paralyzed with fear and anxiety. I too did a lot of internet diagnosing and freaked myself out. Then I realized someone else must be going through this and I searched for a community. Here I am. It's comforting to know I am not alone. My maternal grandmother died of breast cancer in her early 50s in the 1950's. I am hoping that I can beat this if I have it since she wasn't so lucky. I am not only taking care of my kids (youngest ages 9 and 11) but my aging father who has chronic kidney disease. My mom passed a couple of years ago of pancreatic cancer. I'm grateful to you for reading my story. ",
      "MessageIndex": 9,
      "PostDate": "10/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/817775",
      "Title": "Waiting and scared... pagemans Nettie1964"
    }
  ]
}