{
  "AuthorID": "ginasamb",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139947/profile",
  "Posts": [
    {
      "AuthorID": "ginasamb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139947/profile",
      "Content": "Nov 22, 2011 06:26AM ginasamb wrote: Hi!  I would like to join this group if possible.  Am doing first round of 4 infusions of TC on Friday, Nov 25th - black Friday.  (one infusion every 3 weeks.)  All the cancer is gone but doing this to improve my risk for recurrence down to 3%.  Eegads, what have i signed up for?  :o) Am very nervous, but excited to get this over with.  I read here that there are items to buy ahead of time at the pharmacy - does anyone have a master list available? Does anyone have any experience or knowledge of what kind of supplements - vitamins, herbal and/or minerals that minimize side effects?  Is it ok to take a valium during chemo? I plan on working through this as the thought of sitting at home in a robe watching Dr Oz is a side effect I have to avoid.  Any tips hints? Boy am I nervous!  But I am jumping in!  Thank you in advance for your time and thoughts!",
      "MessageIndex": 55,
      "PostDate": "22/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "ginasamb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139947/profile",
      "Content": "Dec 1, 2011 07:45PM ginasamb wrote: hi!  first tc infusion was black friday. was doing well but now ive got a bad itchy blistering chemo burn up my arm at the infusion site.  my back aches and my head wont stop pounding, ibuprophen takes the egde off, but i am lying on the back with a heating pad.  im so achey that i dont feel like using caps or spelling my contractions right.  need to vent.  i dont know what to do with the burn.  cover it or leave it open?  dr said hydrocortizone and leave it open, but my gut says neosporin covered with a sterile pad.  i am confused. help!",
      "MessageIndex": 140,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    }
  ]
}