{
  "AuthorID": "GinaNP",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94843/profile",
  "Posts": [
    {
      "AuthorID": "GinaNP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94843/profile",
      "Content": "Dec 24, 2009 11:38PM GinaNP wrote: Hi Texas, Thank you for your reply. Yes, it does seem like a crap shoot doesn't it. My BS didn't seem too worried about it -- they're not her breasts though ;) I think the fact that it's the holiday season doesn't help either. I want to be happy and celebrate life and family, but I have moments of this dx looming over me. I'm going to try hard to not think too much about it though. Thanks again. ",
      "MessageIndex": 2,
      "PostDate": "24/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/745776",
      "Title": "ALH + ADH found during rimoval of fibroadenoma GinaNP leaf"
    },
    {
      "AuthorID": "GinaNP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94843/profile",
      "Content": "GinaNP wrote: Hi there, I had no idea I was on this journey until Monday, but here I am.  I found a lump in May and really didn't think much of it because I have fibrocysitic as well as dense breasts and finding lumps is not out of the norm. Every time I've found one, it's been a cyst that shows up on the US. I opted to wait until my annual physical in July to see what my GP said about it.   He felt the lump right away and scheduled a mammo (my last one before this was in sep/07). In early Sept they did a mammo and an US. I was fully expecting the usual dx of cyst. The said it was likely a fibroadenoma. They also said I had some calcifications that had increased in number since my last mammo in Sept/07. That was news to me, as the calcifications were never mentioned on the report in '07. They said to come back in 6 months. My GP is more conservative than the radiologist, so he sent me to a breast specialist and I decided to have the lump (suspected fibroadenoma) taken out. I had that done on Dec 11 and was given the results this past Mon. Dec 21.  The report said fibroadema (1cm). It goes on to say - Adjacent breast tissue shows ADH and ALH - Margins of excision are negative for atypia - fibroadenoma extends to the inked surgical resection margin When I saw the BS, she said my report came back really good. I assumed everything was ok. As almost an aside, she said there was something interesting on the report and she pointed out the ADH/ALH remark. I was shocked that she was so cavalier about it. I had done some research on the interweb beforehand and had read about atypical hyperplasia. I wasn't too concerned, because everything I read said it was rare. I figured there's a possiblility, but the odds were greatly in my favour  for me NOT having it. I asked her what this dx did to my risk of developing bc and she said with dense breasts and this, about 25% over my lifetime. She mentioned tamoxifen, PDM and watchful waiting.She thought that at this point vigilance would suffice. She also mentioned that the fact that it wasn't found beyond the margins was a good sign and that maybe it was the only place in my breast that had it. she said it wasn't uncommon for fibroadenomas to show this pathology. I did read online also, that sometimes atypia is a reaction to the FA.   I hate being blindsided like that at drs visits. I wish I had asked more questions. Does the fact that I had both types of atypia up my risk factor or are they lumped together. I'm not sure what the technical terms are for what I'm asking, but hopefully you know what I mean.  I'm supposed to schedule another mammo for March because of the calcifications they found in sept. The BS said that the calcifications may or may not be clustered according to the the radioligist saw and reported, but it definitley needs to be done. The fact that they were growing in size was a good sign she told me. At this point I'm not sure about much.  Any comments, advice, wisdom would be greatly appreciated. I hope some of you can answer some of my questions and perhaps put my mind at ease a little bit. I'm trying not to freak out, but peri-meno has been kicking my butt for the last 4 years and sometimes I'm a mess anxiety wise.  I don't know family history...adopted, but I did read in one of the posts here that family history really doesn't come into play with a dx of AH. I think it was a Mayo clinic study. thanks so much for reading and listening to me. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/745776",
      "Title": "ALH + ADH found during rimoval of fibroadenoma GinaNP leaf"
    }
  ]
}