{
  "AuthorID": "gingen424",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111166/profile",
  "Posts": [
    {
      "AuthorID": "gingen424",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111166/profile",
      "Content": "Nov 15, 2010 10:45AM gingen424 wrote: Hi there~been a while since I posted. Today will be Day 18 out of 30. Up 'til now, pretty smooth, altho I am now noticing that I am starting to get itchy. I upped my use of the Miaderm to 3x/day. I see this is fairly common from other posts. I will mention this to my onc tomorrow. Feel like I'm slowing down by the end of the day, but that seems reasonable given the fact that I leave the house at 7am, work all day, drive 45 min. each way for treatments, and get home at 5:30 to figure out something for dinner. I should be finished during the first week of Dec. and hope my energy returns for Christmas! My rad techs aren't that bad, not very communicative, but they do okay. I'll start with the generic Arimidex mid-December, and am slightly nervous about those side effects! It's a real journey, alright.",
      "MessageIndex": 452,
      "PostDate": "15/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "gingen424",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111166/profile",
      "Content": "Oct 15, 2010 10:06AM gingen424 wrote: Thanks, DiamondGirl...actually, I had originally hit Grade 1 instead of Grade 3...which I am. I was told the \"lymphvascular invasion indicated\" on my pathology report was different than having it show up in the lymph nodes themselves..this apparently was seen in the tumor itself, and had nothing to do with the lymph nodes under the arm... I appreciate your reply, as I have been slathering the Vit E oil on every night as I wait for the miaderm to come in the mail. I feel relieved today as I talked to the principal at the high school I work at yesterday as she was making her rounds. She let me know that I can \"call for help\" anytime during the radiation therapy if I need to go in my office and put my head down...(I'm the librarian). That was a major relief as I gear up for next week. I have also perused the AI hormone therapy message boards here, as that is the next thing I'll be looking at once the radiation is over...I think the hardest thing to get my head around is that there is always another \"thing\" down the road to learn about and worry about...this journey never ends. But, again, I try every day to take a moment just to be glad I'm still here!! Thanks again. ",
      "MessageIndex": 209,
      "PostDate": "15/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "gingen424",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111166/profile",
      "Content": "Oct 14, 2010 10:13AM gingen424 wrote: Hello, I am jumping in here. I had my simulation/tattoos yesterday and will have the dry run on Oct. 20, with the 1st \"real\" treatment on the 21st, followed by a total of 30 treatments altogether. I had a lumpectomy (with a bonus gall bladder removal because the MRI showed gallstones) on Sept. 2, then another surgery on the 21st of Sept. because the margins were not clear. Have Stage 1, Grade 3, IDC, w/ \"lymphvascular invasion\". I was convinced I would have to have chemo, but the Oncotype DX test saved me. My score was a 16, so chemo was not necessary. I had myself steeled emotionally for it..so I burst into tears when he said I didn't need it! I feel extremely lucky and admire all of you who have or are continuing to push thru it. I may be naive, but I am not THAT worried about radiation. I know I will be tired, that my skin will have complications, but...I am thankful that I was able to avoid chemo and that I will be around to see my kids get married and eventually have kids of their own! (I'm 54 with a 24 yr old son and 20 yr old daughter)...I try to keep everything in perspective. My rad onc gave me the Aquifor (sp?) and Miaderm samples...I ordered the Miaderm last night online and have begun moisturizing the area in preparation. The rad nurse told me to get the skin in the best shape I can before I start. I live in Tucson, and we are ALWAYS treating our skin for dryness! I was also using Vitamin E oil recommended by my surgeon to treat the incisions from surgery...I wonder if anyone continues to use that into rad treatment? Anyway, hello, and thanks for all your great insights and recommendations. I will print out the NEJM article about shorter treatments to bring with me next week! ",
      "MessageIndex": 199,
      "PostDate": "14/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "gingen424",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111166/profile",
      "Content": "Oct 25, 2010 09:42AM - edited Aug 20, 2013 03:01AM by gingen424 Good morning! Had my first 2 treatments last week, and then the weekend off. I wonder if anyone else feels as tho the environment for the treatments is similar to being abducted by aliens? (Haha). I really felt like I was being subjected to an alien probe. From the very cold steel atmosphere, to the binding of the feet, the way they draw on you, and use the laser pointer tool..to being exposed and your arms and head positioned. Then they scurry out of the room and the hum and movement of the machine. Really! I never thought I would react emotionally to these treatments. I was so thankful that I avoided chemo, that I thought this would be a piece of cake. I assume that by the end of this week, after I've completed 5 more treatments, that I will be somewhat desensitized to it...but it really makes me feel creepy. And, I swear, I can feel it entering my body..I know in reality I can't, but it sure feels that way. Hoping the miaderm cream will be worth it...been using 2x/day for over a week, just in preparation. Also use Tom's natural deodorant...hope that's ok. At least I'm too old to be implanted with their alien spawn! LOL ;-) ",
      "MessageIndex": 306,
      "PostDate": "25/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    }
  ]
}