{
  "AuthorID": "gingeel",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
  "Posts": [
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Apr 22, 2015 01:01PM gingeel wrote: Hello ladies! Getting my first AC today. Feeling just fine. Good luck, Shari, and anyone else hitting up the Chemo bar today.",
      "MessageIndex": 704,
      "PostDate": "22/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "May 5, 2015 01:09PM gingeel wrote: Hi ladies, sorry I've been MIA. I realized that I didn't want to completely immerse myself in all things cancer, which sounds stupid, maybe, but it actually made me feel \"normal\". Like Lemonade, I was in a dark place after my first round of AC, and it was a very icky feeling aside from the physical side effects, it was not a fun place for my mind. So, after 4, 5 days of fatigue, I felt like myself again.....and pretended that none of this was going on. That was my way of coping. And damn! I think the last time I left off we had 25 pages, now we are up to 39! Don't know if I can catch up, but I wanted to say hi, and let you all know I'm thinking of you. I've got #2 tomorrow. Hopefully, it will go as I expect. Gonna try to be counterproductive this time with the SE's. Hair is starting to thin.....I haven't cut it yet, but there is hair all over my bathroom floor when I brush, shower, etc. I noticed a little tenderness in my scalp in some places, so I'm sure it'll happen this week, maybe? I also got my period! That was the one SE that I was hoping would happen right away, but maybe next month will be it. Who knows. It just sucks not being able to wear tampons. I loathe pads! So, I've caught you up with my life. Hope everyone is doing great. xoxo",
      "MessageIndex": 1199,
      "PostDate": "05/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Apr 24, 2015 04:59PM gingeel wrote: Hi all! day 3 after first AC...starting to feel like myself. I sent my mom back to NJ, and did some light housework, walked to school for pickup, and ate 2 pepperoni slices from papajohns! The fatigue is what is so annoying. It's like the moment I sit or lay down, I could fall into a deep sleep. Also, if my stomach is feeling fine, do I stop taking the zofran and composine? I'm afraid if i stop, I'll get sick....Should I wean off of them? Littleblue....are you smoking the mmj? or is it in a pill form? Just curious...",
      "MessageIndex": 805,
      "PostDate": "24/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "May 5, 2015 04:44PM gingeel wrote: I didn't actually get the word from my MO, but I read it on one of the \"cancer packets\"......of course now I can't find it, but I guess it's to prevent infections.",
      "MessageIndex": 1207,
      "PostDate": "05/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 9, 2015 12:55PM gingeel wrote: I still \"smooth my hair back\", ready to find a pony tail or something. Or I go to loosen my imaginary pony tail cause it feels too tight. Weird.",
      "MessageIndex": 2210,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 12, 2015 06:39PM gingeel wrote: Ha, Ladies....I get the prognosis question too....\"Are you going to be ok?\"......geesh. And I always get, \" Well, you look healthy and you sound great!\". Well, that's cause you don't see me when I feel like shit. I have IDC, but not DCIS. Lynne, great song. I never knew all the lyrics, but, Rush is one of my favorite bands. I don't get emotional often about cancer, but, when I hear \"Fight Song\", which is a pop song and I don't even know who it's by, I get teary. It makes me remember that I'm really fighting cancer. Who'd have thought? And it is good advice for getting through the next 50 years we have left! KBee, I hope he doesn't need surgery! Praying! There are charities that offer free meals and free house cleaning? Sign me up! Is there any charities that I should be taking advantage of? I'm not savvy on that sort of thing. Andrea, maybe it'll be good for you to have the house to yourself. Enjoy the peace. You can binge watch season 3 of Orange Is The New Black on Netflix! Still having trouble sleeping at night. Anyone else with this problem? When I lay down, I can feel my pulse throughout my whole body, and I guess my heart is beating faster than usual while at rest. I'm more than a week out from last AC. Just curious.   ",
      "MessageIndex": 2313,
      "PostDate": "12/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 16, 2015 09:40PM gingeel wrote: Had Taxol #1 today. The Benedryl hit me hard and made me sooo drugged and sleepy, but luckily I had no reaction either. Went in at 9am, didn't walk out til 4. Loooong day. Came home, went to Target with my mom, watched some tv, put kids to bed, and now I'm on here, feeling pretty good. I know I'll crash soon from the steriods. I'm just happy I feel so good. Glad you those of you that went in today also had an uneventful morning. Littleblue, get it checked, stat! But, I'm sure like Stephmoen said, you're on chemo, so recurrences are probably unlikely. Don't stress yourself. Relax and deal with it tomorrow. Nothing you can do about it tonight, right? Stay positive. I'll be praying. Night ladies.",
      "MessageIndex": 2411,
      "PostDate": "16/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 24, 2015 02:15PM gingeel wrote: KBee, you are our rock and voice of reason on here! Sending lots of love your way, and we are here for you to vent. Praying that you and all of us live to 100! Littleblue....oooh, I'm actually really excited for a trip like that. I feel like I know all of you just from reading your posts, and it would be good for us to meet and enjoy nature at it's finest. I've never gone on a hiking trip, sounds amazing.....and to respond to your question a few pages back, doing dose dense taxol. 3 more to go! It seems everyone is doing weekly? Re husbands being insensitive: I can relate, although my husband is pretty good 99% of the time, after this last treatment because I looked and acted \"fine\", he didn't even ask how I was doing or seemed concerned at all. (went with my SIL) Well, that pissed me off and hurt me. He did, however, make up for it over the weekend when he asked me if I would like him to throw me a bday party. Sure, as long as I don't have to do much! Addie, congrats on your little one graduating K! Andrea, I didn't sleep too great last night either. Never quite got into a deep sleep. It is a perfect morning here in NY....going for a walk in the park with my 4 yr old.",
      "MessageIndex": 2619,
      "PostDate": "24/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 26, 2015 01:02AM gingeel wrote: Littleblue, did your nose stop bleeding? Thanks for the kind words, KBee and Woodburns. Littleblue, you crack me up...little children are creepy....hahah Awe, Sheshe so happy you got good news! Lynne, lucky you! Go on vacation and enjoy every minute of it. You deserve it! Andrea, my 4 year old told someone yesterday, \"my mommy has no hair because she got a shot\". I thought it was cute. That's what he can understand from all of this. Sunshine, I hope you get some relief soon from your legs and hands. Can you take an ativan? I wonder if that would help. re food. I'm ridiculous. I lost weight with AC, which wasn't an unwelcomed SE, although I hated being sick and nauseous all the time, but now I feel the weight slowly creeping back on. ugh. I'm sure you are all experiencing this? I really don't want to have to watch what I eat right now. But, I also don't want to come out of this heavy. Ok, done venting. Feeling good, been busy with my 3 kids. Did notice some residual aching in my legs today. Just thought I'd mention that.",
      "MessageIndex": 2665,
      "PostDate": "26/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Apr 19, 2015 03:22PM gingeel wrote: Lynne, I was told that I can't shower for 5 days after placement! And not one person mentioned keeping my port iced! That gets me mad cause these last few days could have gone smoother had I known that. I wondered to myself about icing it, but I figured I must not have to, since they didn't instruct me to! ARGH! Thanks for all of the wonderful advice ladies! Enjoy your Sunday! xoxo ",
      "MessageIndex": 597,
      "PostDate": "19/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 4, 2015 11:12AM - edited Jul 4, 2015 11:19AM by gingeel I'm behind a page, but thank you Kbee for reassuring me. I'm still extremely fatigued...just making my bed was a chore, but mentally I'm better and my tummy is settled. As far as exercising, am I not supposed to use weights if i have a port? Good for you Andrea!!!! God bless. Happy 4th everyone!",
      "MessageIndex": 2936,
      "PostDate": "04/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 6, 2015 10:37AM - edited Jul 6, 2015 10:38AM by gingeel Welcome Samaileko, glad you found us, and happy that you are finished with chemo! KSusan, that picture is great. It's wonderful news that having your port out is as good as I imagine. lol Lynne, your vacation sounded perfect! How old is your DD2? My son is 11, and I've noticed how defiant he's become. It's like he's found his voice, and he's gonna use it! Argues about everything! KBee, hope chemo treats you well, glad they saved you a copay. Littleblue...how you feeling today? I laugh at you for complaining about letting your upper body go....hello!? You hike 3-5 miles with a pack! Girl, give yourself some credit. I've never really been hiking, but I can't imagine its light work! Had a great 4th of July. Was feeling so bad Friday....crying, hurting, exhausted.........then woke up Saturday still a little weak and light headed, but it's like the fog lifted by midday. I imagine that my counts were low Friday thru Saturday morning, and then Boom! they were up, cause I felt like a million bucks Saturday night. Went to 2 bbq's and watched Fireworks and even danced with my kids under the stars. I was so grateful to have felt good. And still am! Those moments of feeling so good, when you've felt so damn bad, really stand out. That's just me feeling happy to be alive. Happy Monday, ladies!",
      "MessageIndex": 2985,
      "PostDate": "06/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Apr 24, 2015 09:08PM gingeel wrote: really beautiful pic!",
      "MessageIndex": 820,
      "PostDate": "24/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 9, 2015 12:53PM gingeel wrote: Addie, our kids are almost the same age. 11, 7, 4. and whereabouts in NY do you live? no, I'm not a stalker.....just pretty crazy how similar our stories are.",
      "MessageIndex": 2209,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 10, 2015 05:35PM gingeel wrote: KBee, Yes, I'm up for Taxol #1 on Tuesday. Sorry your son broke his foot. My son broke his wrist a year ago like 2 weeks before his show (he's a drummer), and well, we dealt with it. Kids are so resilient! His cast was off in a month! Sex, something I've touched on before......we haven't had sex once since I've started chemo. But, it's ok. He feels too weird and so do I, that it just hasn't come up, so to speak. We hold hands in bed and hug a lot, and peck each other, but chemo has sort of spoiled the mood for romance, ya know. Spent all day outdoors for my daughter's picnic, and I'm pooped. Long day.",
      "MessageIndex": 2264,
      "PostDate": "10/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 22, 2015 12:13PM gingeel wrote: Caught up after being 3 pages behind! Gingerchi, hope you are well, and on your way out of the hospital! Man, when the bone/ body pain from Taxol #1 hit, boy, did it hit hard. I think Lynne, had described it as tiny explosions. That is exactly what I've been feeling. The pain moves from your finger to your back then your elbow, etc. I even had a lot of abdomen pain.....like in my ovaries or something. I've been taking Aleve and Claritan, but, need something stronger to sleep. Day#7 post chemo, and I feel pretty good. Still got some aches here and there. My appetite is back! My MO also didn't mention a thing about avoiding raw fruits and veggies, but, during AC, I wasn't eating much of that anyway. My BS recommends radiation...which I will begin in September. Sheshe I hope you get those results today. Waiting is the worst. Karen, I feel flabby as hell, too. I'm thinner, but flabbier. ugh. Need to do some weight training or something. KBee, sorry for your friend. It breaks my heart to hear what ppl have to go through.",
      "MessageIndex": 2558,
      "PostDate": "22/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 26, 2015 02:55PM gingeel wrote: Wow, Gingerchi, Glad you're out of the hospital, but sorry it was such a big production for you. At least you know you are in good hands with Home Care and all. Get well soon! Alibeths, I get fluids during my chemo, but I don't make a separate trip.",
      "MessageIndex": 2679,
      "PostDate": "26/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 28, 2015 09:45AM gingeel wrote: Lynne, I know what you mean about having a tv, etc. We went to FL last year and the hotel, which was beautiful, didn't have order in movies, or movie channels, and we felt like our arms were cut off. Enjoy your time with your family! re Alcohol, I'm not a huge drinker to begin with, but since I get migraines, the last thing I want to do is purposely make myself hungover, or headachy. Every day I feel good is a blessing right now! Good for you Ksusan and Rockerwife. Getting on with our normal lives is healing. Littleblue, how did date night go? Hubby and I had the house to ourselves last night (Grandparents took them), and it was nice to reconnect with him. ",
      "MessageIndex": 2737,
      "PostDate": "28/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 1, 2015 12:39AM gingeel wrote: Sorry Princess about your reaction. Ok, so I went to have Taxol #2...I was scheduled for dose dense. I mentioned the TC regime that you all mentioned and she said it can be done, however, it's not the standard treatment, and they did do a study for neoadjuvent (forgive my spelling) chemo. It did shrink TN tumors a bit faster, she said. There is no evidence of it changing the survival rate. She also said it wouldn't be recommended for adjuvent treatment. I had my surgery prior to chemo. She did change my dose dense Taxol to weekly Taxol because she said it does give me a better outcome by 2-3%. So, I thought I would be putting this chemo behind me July 28, not the case. I have 8 more weekly doses. It's ok! I want the absolute best damn treatment! Hope that helps Littleblue. RPayton it's nice you got to away to see your son! Addie, I'm on FB, too! ",
      "MessageIndex": 2809,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 1, 2015 01:16PM gingeel wrote: It's so frustrating how one Dr. says one thing and another Dr. something different! Ugh. Well, I'm putting my trust in her, and hoping that I'm not extending my chemo for no reason. Was looking forward to being done, but didn't want that to make up my mind for me. Oh, well. I'm going for it. Lynne, I'm sorry that you don't feel support from from your family. I think they are just used to what is going on and feel like they can act \"normal\" around you. If your not complaining, then they must think your ok. I do notice that with my own husband. If I'm walking around ok, then I must be! Positive Spirit, enjoy your mini vacation and your Anniversary! Hopefully it will get you out of your slump. Feel better! Today, cause I'm feeling good, and my mom is here to watch the kids, I'm going to meet up with a few friends for the afternoon. Haven't seen some of them since April, and they are all off today from work. Looking forward to some catching up! Enjoy your day ladies, and good luck to all heading to the chemo bar.",
      "MessageIndex": 2831,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 6, 2015 10:43AM gingeel wrote: Sorry, Addie and Littleblue for the crappy morning. How can they not show up? I would have been furious! Well, you should keep your sitter and run your ass to the mall for some therapy shopping, or better yet, get a massage. Hope you feel better Littleblue. I cry more now on Taxol than I did with AC....guess it's the steriods. Gotta go.....I'm not paying attention to my kids, and my little one is having a fit.",
      "MessageIndex": 2986,
      "PostDate": "06/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 8, 2015 08:19PM gingeel wrote: What?! Allicat...why on Earth would they want to keep our ports in....heck no, I want it out as soon as I'm done! I missed everyone's bday...Happy Belated Birthday. I finished AC#4 last Wednesday and it was definitely the hardest one. I even threw up yesterday, which I haven't done since I started. But, today, I'm almost feeling like myself. I'm looking forward to not being nauseous all the time. I can't wait to be done! 2015 has been an effed up year! Commenting on the aversion to water...it's crazy. I have such a hard time drinking plain ol' water, when it was once the only thing I COULD drink. And the thought of chemo, everything that involves it, literally makes me sick to my stomach, too. But, like so many of you said, it is a necessary evil, so to speak. I actually have yet to wear a wig. I just rock the head scarf or hat, and that seems to do me just fine. When people comment on my new \"haircut\", I laugh, and then tell them how it's not by choice, and then explain to them what's going on. I have 3 wigs, that are for fun, but I haven't really felt compelled to wear them, yet. I'm doing pretty ok. I have my moments of weakness, which basically comes from severe fatigue, and when I have 3 young kids and a husband to take care of, it can become overwhelming. My husband has been so great. He doesn't complain when I don't cook, cause, I literally quit cooking altogether. I can't stomach preparing meals anymore. We eat what my mother in law makes or takeout. Tomorrow is his birthday, and do I think I've planned or bought anything? Heck no. I wish I had the energy to do something nice, but, I just don't. Have a great night ladies. xoxo ",
      "MessageIndex": 2178,
      "PostDate": "08/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 9, 2015 09:35AM gingeel wrote: Sunshine, yeah, my doctor never mentioned staying away from sugar....I even met with a nutritionist, and she said everything is ok. But, I have been hearing more and more about how cancer loves sugar. WTF! Why aren't our doctors telling us this? Scares me! I'm going to def do some research, cause I have 3 kids and they love the sweet snacks. Addie, yeah, I tested neg for the gene. It sucks that you have to get everything removed. Are you planning on removing the other breast as well? I've been lucky with the mouth sores. I burnt my tongue once to check if the pasta was al dente, and I had issues with the tip of my tongue for about a week. Swished with baking soda and saltwater. That seemed to keep it at bay. Oh, and this would be the time for my period to show, and I'm just spotting, but...boy, oh, boy.....I'm getting hot flashes! It's like an internal heat, and then 2 min later, I'm cold again. Very strange feeling.",
      "MessageIndex": 2195,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 9, 2015 01:24PM gingeel wrote: Lol Leighrh, I had hair down to my butt, so I know, girl. Although, once my hair comes back in, I think I'm gonna leave it short. So much easier! Don't feel bad about having your son sleep with you. He's 2 1/2. No biggie. I give each of my kids a turn to sleep with me....usually on the weekends. Sometimes, they all end up in bed with us! They're not going to be young forever! ",
      "MessageIndex": 2216,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 9, 2015 03:47PM gingeel wrote: Ankledolph, I'm in Valley Stream, right outside of Queens. Both you and Addie are prob 5 or so hours away. Dizzpark, the only thing I can drink is something with flavor! Iced Tea, Gatorade....bring it.",
      "MessageIndex": 2221,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 10, 2015 12:09PM gingeel wrote: Morning ladies! Feeling good, day 6 after last AC treatment. Haven't been sleeping good the last few nights, was wondering what that was about, until it just dawned on me....hello!? I've been drinking a ton of Peach Snapple Iced Tea! Duh. Hopefully tonight will be better. The hot flashes aren't really helping either.... Co-hosting my 2nd grade daughter's picnic today. Gonna be a scorcher here in NY. So, glad I got my energy. Have a nice day ladies!",
      "MessageIndex": 2244,
      "PostDate": "10/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 28, 2015 12:35PM gingeel wrote: Congrats Lynne on finishing up today!!!!!",
      "MessageIndex": 3556,
      "PostDate": "28/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Aug 4, 2015 10:15AM gingeel wrote: Hi ladies! Sprite, just read your horrible ordeal! I'm so sorry you had to endure that. But, its great that u are done. It must be a huge relief for you. Dizz, all that u go through just to have chemo! Your storm stories are exciting though. kbee...almost done, girl! Little, yes...get on FB! Positive, love your pic! You've inspired me to do some cross dressing for fun. think im gonna raid my 11 yr old's closet! Ksusan & Gko.....pretty funny encounters! Especially someone praying for you in the damn store! I would have been mortified!!! I hate any attention when it comes to my DX. And, Like Scarlett, I haven't come out on FB, either. I just get the strange stares, and ppl commenting on my \"cute haircut\". I now just thank them and go on my merry way. Addie, feeling any better today? I still haven't attended a LGFB class. But the next one is the 12th. Gonna try to mske that one. Lynne, hows DD? Howss the pool? The other day my FIL told me I looked pale (love his brutal honesty) but realized it was because my brows were barely there, so I went out and got a brow pencil from CVS. After messing with them, I achieved the look I wanted. But, it was no easy task. Spent more time on my brows then the time I take in the shower. Hitting the chair today. 3 more Taxol's left! Feel good ladies!",
      "MessageIndex": 3694,
      "PostDate": "04/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Aug 11, 2015 10:51AM gingeel wrote: Need to catch up on posts.....but, Big congrats Steph!!! Beautiful sign, awesome shirt! Thanks Lynne for the sweet words! I sure as hell dont feel feminine. I suppose I could pass for a pre teen being that i have a small head, and Im only 4'11. Addie, I agree with Lynne...unless its your preference, those damn docs shouldn't be so stingy with the meds. I dont take Ativan every night, but I don't get full night's rest without it right now. It sucks. Sitting in the chair! I know some of you are joining me. Kbee, I think this is your last one?! I only have 2 left after today, but, Im taking next week off to fly out to MN for a family reunion. You ladies always put a smile on my face and have really helped me get through this. Thank you for being here!",
      "MessageIndex": 3858,
      "PostDate": "11/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 20, 2015 05:12PM gingeel wrote: Hi there ladies, miss talking with you. It's been a week since I posted last. Over that, actually. Ive read through most of what I missed, but had to take a break. Congrats to Littleblue and Ankle for being done, done, and Done! So happy for both. Love the pics. Stephmoen, hope you get well soon. Lynne and Kbee hope you feel better. Positive, glad u are trying to stay above it all. Im sure Im leaving some of you out....ill get back once ive read everything. Im doing ok. Threw a bday party for my 8yr old daughter Friday night. Was success, started to feel shaky from Wednesday's chemo, then spent all day Saturday sleeping on the couch. Sunday woke up still really exhausted and not feeling like myself. Picked a fight with hubby because he didn't pay an attention to me nor seemed concerned with my well-being. Took kids to another bday at the local pool out of spite. Then later made up with hubby because I may have overreacted. Hey, I'm allowed. I have cancer.",
      "MessageIndex": 3351,
      "PostDate": "20/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Aug 12, 2015 08:43PM gingeel wrote: Happy belated Birthday, Blue! Your eyebrow adventures crack me up! I too have trouble getting them on straight. I scared my 4 yr old when he looked at me after I drew them on. ksusan, love the earrings... Positive beautiful pictures! And yes, I would like to know about this retreat!? Katy, congrats on your new home. Hope you're feeling better. Big congrats to Slv and our founder, Kbee! Ginger, sorry you have wait...but, I love the pic. That'show I'm gonna feel! Lynne, yeah, I think you should have gone, too....but I know you're already basking in the ocean. Your pool is looking awesome! Andrea, how r you feeling? I suffer from migraines. I take Trexemet for them. Maybe you're not getting enough fluids? Speaking of peeing....you ladies always make me laugh, I don't have any bladder issues, but since I've gone bald \"down there\", it doesn't flow in a nice neat stream anymore. Samaileco, that camp sounds pretty cool...sorry you're still having issues so far out, but our bodies have been put through the ringer that it shouldn't be a surprise. Feel better!",
      "MessageIndex": 3887,
      "PostDate": "12/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Aug 14, 2015 08:03PM gingeel wrote: Renee, I'm so sorry about your Father in Law. Praying for your family! Ankle, what a horrible coincidence. Like someone said, right when you are \"wrapping\" things up. I agree with Karen, you should still go on with your surgery. I'm sure your mom would want you to. Praying for you guys, too! In fact, I pray for all of us every day! Lynne and Lorraine....I'm so jealous! It would be nice to meet you ladies in person! It's really awesome that you got together. Ksusan.....everyone has said that rads is a cakewalk compared to chemo.......do you agree? Lynne, Blue, Scarlett, I think it's fair to say that none of us are feeling like ourselves. I hate the way I look, too. Sometimes I care, sometimes I don't. I had my mom go in pick up some takeout that I had just ordered, and I told her, just tell the guy at the front it's for the ugly, bald, limping lady who just came in. We both laughed. So, stupid me has a hard time sitting still and just spending all day indoors, especially on a nice day. I took my mom and kids out for a bike ride, while mom and I walked of course, to a nice hilly trail. We've never been, so I had no idea how hard it was gonna be to go uphill for the kids. We just kept pushing through. Coming back, going downhill, my 4 yr old picks up speed, and in every effort to catch him, running after him, my calf muscle spasms and cramps, giving me excruciating pain. I've had problems with this calf ever since I've started Taxol. So, luckily, he slowed down, but I couldn't walk anymore! And we were already 1 1/2 miles in! We pull over, and I rest, almost faint, cause now I'm hurting and outta breath from Tuesday's treatment......I ended up having to ride my 11 yr old's bike all the way back. I'm still limping. Lesson learned here: Don't fool yourself thinking that your body can do what it once did.....and don't be an idiot thinking you can catch your 4 year old flying downhill on his bike. Well, at least they weren't inside playing videogames all day.",
      "MessageIndex": 3954,
      "PostDate": "14/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Aug 15, 2015 02:00AM gingeel wrote: hell yes!",
      "MessageIndex": 3967,
      "PostDate": "15/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Aug 16, 2015 06:36PM gingeel wrote: Happy Sunday beauties..... Blue, loved the eyebrow vid...hilarious. I especially loved the uneven brow bit! Gonna have to check out her tutorials. She's great! And, listen, from what I know from this discussion board, you are a witty, intelligent, and beautiful person...no boobs needed. Just saying. Rockerwife, I think your students are so cute and sweet. They are smart, too! I like that you had that discussion with them. I have a 6th grader (my kids start 9/2), and he is pretty aware of all that is happening. Hope you have a good class. Gko, my calf is still sore, but I'm not limping anymore! I have my own pharmacy too. I actually have a ziploc bag full of my pills! Andrea, how's the head today? I bet you can't wait for your MRI tomorrow.....Hopefully, it'll be a nice treat being with your mom, but the boyfriend situation is pretty funny. My mom comes out almost every week from NJ to help me, and I appreciate having her around. Lynne, your family tradition sounds lovely. Happy that you guys didn't skip on it for freakin' cancer, even though it wasn't on your actual Anni. Your family is beautiful. Mamajan.....love your pic. You look so happy. Good luck on your last chemo! Well, I had a beautiful Saturday. Went to the beach with kids and my SIL, who is also my best friend. We went around 3, and stayed til 7! The ocean was so peaceful and soothing to the soul when the sun is starting to set. Goes to show you, Friday I was limping from calf pain and almost fainting, and Saturday I was on a boogie board riding the waves...no joke! It's crazy what chemo does to you. I told my mom I literally live day to day. After the beach we went and grabbed some chorizo tacos from a food truck.....it was an awesome day. ",
      "MessageIndex": 3993,
      "PostDate": "16/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 24, 2015 04:37PM gingeel wrote: Kbee, great song! Hope you had a great night as well. Littleblue, gonna check it out. Right now, I feel great! It's a full week post T#1, and my energy is full, which is good, cause the kids have a 1/2 day today, and go in for 1 hr tomorrow, and then they are finished with school! Taking them to the pool after lunch. The SE's from Taxol didn't hit me until day 4, I think. The abdominal cramps, the bone/ body pain, runny nose, headache, sore throat on one side, and unable to taste food. My pinky toes are tender, and I guess my lashes and brows are thinning, but you are right, those damn unwanted hairs! I still have a few pubes hanging on for dear life. Just fall out already. Stacy, I gotta make port removal appt too! Congrats to you for actually knowing when it's coming out! Went to the pool yesterday, took off my hat, in the shade of course, and a little girl was walking by, and stopped right in front of me and STARED at me for a good minute or so. LOL I wanted to say \"SHOO!\"....I guess I looked like a freak. haha",
      "MessageIndex": 2630,
      "PostDate": "24/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 27, 2015 04:26PM gingeel wrote: Addie, so very sorry about Sarah. I saw you posted that on FB.....so tragic. It really upsets me that these Drs play with our lives! How can they dismiss something so quickly, when they should know that it could be cancer. Why take that chance? Just order the tests! I have a friend who was concerned about a lump and pain, and a BS actually told her it \"felt\" benign. He didn't order a biopsy, and her lymph nodes are swollen. She is getting a CAT scan. Does that sound right? Littleblue, even though I had my tumor removed, clean nodes, and a clean PET....I'll consider myself cancer free when I'm finished and done with all of my treatment. Addie & Mel, you deserve a vacation....we all do. I had to cancel my planned to Mexico for this, so I will absolutely reschedule something else! I am going on a mini vacay with my kids (hubby can't come) to MN Aug 19-26. My Dad, bro, and most of my aunts, uncles, cousins, and only living Grandfather live there as well. We are having a big bday for Gramps....he turns 94 this year, and he is still as sharp as nail! KBee, I also had met with my RO back in April before they decided to do chemo. He was the one that gave me the news that I was triple neg. Good thing you pushed on the RA and got some real answers. Why did they even have her meet with you? Sheesh. I suppose I should consider myself lucky, although, I'm probably jinxing myself.....I have no neuropathy and my nails are still intact. They look like shit, and are dark and purple, but they don't hurt. Nor do I have or really have had any mouth issues. Thank God. Dizz, awesome that you saw Imagine Dragons. I missed the Foo Fighters and U2 because I didn't want to be stuck to something so costly in case I felt like crap. Boohoo....I should have just gotten the tickets! I did watch a crappy Journey cover band on Saturday. he he I'll be thinking of all the Tuesday ladies joining me at the chemo bar.",
      "MessageIndex": 3541,
      "PostDate": "27/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 1, 2015 01:18AM gingeel wrote: Glad to have put your mind at ease, even slightly. My husband doubts everything. He wonders why they didn't recommend this from the beginning? I asked my MO that, and she said we discussed this, however, I don't recall. Who knows why. I'm also told the SE's are more mild with weekly Taxol, and I won't need the injection the day after. I worry about metastasis too....but, I don't put too much into it. I just try to stay positive and live my life. ",
      "MessageIndex": 2812,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Apr 14, 2015 03:49PM gingeel wrote: Well, hello, ladies! I'm new to this group, but I've been following you all from Day1. I just didn't want to jump in until it was official. I start my AC/4 on 4/22, then T/4. I'm 36, married with 3 kids (4, 7, 11), triple neg, but luckily had clean margins and no node involvement. Getting my PET, ECHO, and Mediport starting tomorrow. I never do self exams. Well, God must have told me to check myself, cause, I found a lump, and after Mammo, Sono, Biopsy, Lumpectomy, SNB.....I'm here! I have to say, that this group has given me a lot of information that the Docs don't tell you, and a great deal of comfort. It's so helpful to hear what you are all going through from your first day, and how you are handling it, preparing, etc. I feel lucky to be a part of this group, of course not lucky we have to meet under these circumstances. Wishing those that are starting today, best of luck, and for everyone else, min of SE's. -Gingee",
      "MessageIndex": 439,
      "PostDate": "14/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Apr 15, 2015 12:06AM gingeel wrote: Alibeths! My fellow 30 something! Whereabouts in LI did you get married? I'm sure I know the place. I also lived in FL while in Middle School...Cape Coral. Karen30 I have really long hair, like down to my butt, long, and it's been hard to imagine losing it. I'm going to try to have a wig made from my own hair as well, Hopefully I will have that option. Littleblue You have actually got me thinking of just rocking the bald look....you look really hot! Allicat Sorry you're in the hospital. KBee Hope I feel as good as you next week! I thought about doing coldcaps, too, but it's not worth it. Seems like a lot of trouble, and it's too risky. I want my whole body to receive the meds.",
      "MessageIndex": 452,
      "PostDate": "15/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Apr 16, 2015 06:41PM gingeel wrote: I got my PET scan today. No big deal, just sucks that I can't hug my babies! My 4 year old actually said, \"Mom, when are you gonna stop going to the doctors?\" .....awe, made feel a bit sad. I suppose things could be waaaay worse. Alibeths, I was orginally ER+.....was told I probably wouldn't need chemo, had my lumpectomy, then BAM....got the oncotype score of 70! They said it was the highest score they've seen, but it's because I am now triple neg, and those tests are usually not sent out for TNBC. I was kinda pissed....how did that get messed up? Well, I'm told it has to do with the dye that is used in the lab. Ooookay? KBee, wanted to say that I really think it's cool what you do....being a Fireman, and all. Starrgirl, I'm probably gonna cut mine this weekend too. :) Stephmoen, glad your treatment went well..... Karen30....you worked in S.Africa??? Very cool.",
      "MessageIndex": 517,
      "PostDate": "16/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 6, 2015 06:09PM gingeel wrote: Congrats Stacy for almost being done! Positive, hugs back, girl! RPayton, I'm happy that you are able to take time from work to be home and focus on you. Relax and enjoy it! Gko, like Sue said, maybe try weekly Taxol? KBee lucky you! you're almost done! I still have 8 more left. Well, actually, after tomorrow...7. Andrea, of course you should still be here. You stay as long as you want. I know I will. And, I'm glad you're not staying home and going to that music fest! You need to get out, girl! Why let hubby have all of the fun? Littleblue, hmmm....moms. I don't blame you for being miffed about what she said. I would have been, too. Sometimes people say things without really thinking about what they are saying. They don't have a filter. You just have to excuse things like that.",
      "MessageIndex": 2998,
      "PostDate": "06/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Sep 9, 2015 02:43PM gingeel wrote: addie, my nurses were so great throughout. On my last chemo, they threw confetti at me and gave me hugs. I also brought them cookies and a card. They seemed to appreciate it, cause they were all eating them. ",
      "MessageIndex": 4367,
      "PostDate": "09/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Sep 11, 2015 09:46AM gingeel wrote: Wow, never really looked at how much all this is costing.....but, like you said, thank God for insurance. I'm so excited for hair after looking at all of your hair pics! It's coming in, though...but mostly peach fuzz. So, I've been feeling like garbage. Don't know what it is, but since last Friday's last chemo, my stomach hasn't been right, I'm having all of these weird aches and pains and even muscle weakness, I've had headaches, and my I even feel like I'm about to break out on my cheeks. My skin is all flared. Don't know why I'm having all these lingering symptoms now, when I've gone this whole time without most of these. I usually feel great by day 7. ",
      "MessageIndex": 4412,
      "PostDate": "11/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Aug 14, 2015 10:21PM gingeel wrote: Good to know that I'm not the only one! I feel like I tore something! Neuropathy? It doesn't surprise me if that is what it is. Slv, I hear you....I get winded making my bed on bad days. Which is why I really shouldn't have taken that walk today cause its my \"bad day\". Thankfully, not as bad as last week. And no, I've been lucky don't have any numbness anywhere. Actually. when I'm sleeping my hand will go numb from sleeping weird, but that is it. Renee, those damn mosquitos ruin everything! Wouldn't it be great to sit outside and just be able to enjoy the fresh air without getting bit....things will get better in the fall. Karen, enjoy the parties! I hope you are full of energy and feel like yourself. Italy, hope your legs recover completely! I remember following the March group before I jumped on this one, and I was reading how you worked out a lot. The Princess, maybe we need potassium. You know thinking of it now, I used to eat at least 1 banana a day before chemo. Once I started A/C I couldn't bare to look at one. Blue, going back a couple of pages and days ago, I also would love to buy a shirt designed by your bro for our group.",
      "MessageIndex": 3961,
      "PostDate": "14/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 23, 2015 10:29PM - edited Jul 23, 2015 10:30PM by gingeel Happy birthday gals! I, too am a July baby..7/11. And my sign is Cancer ! That's real funny. I can appreciate a smoking hot nurse or even some sexy amputee vets...thank you! Good for u Positive for asking your friends to do something special...you deserve it! Alibeths, hope you recover soon...feel better. Kbee, take care of that toe! Addie, I know that we had treatment the same time this week, so you prob feel like I do, right about now. I always get a leg cramp in the same spot every week, and today it was so bad, I was limping! Starting to feel like garbage. Shaky and yucky. Tomorrow is my bad day, so thankfully, a friend has offered to take my kids swimming, so I can sleep and not have to do anything.",
      "MessageIndex": 3466,
      "PostDate": "23/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 24, 2015 10:28PM gingeel wrote: Congrats Georgie!!! Happy you are done and Done! I don't think they have a bell at my hospital either.....never heard anyone ring one. Awe, Bluedog, sheesh! Skin cancer. Like you don't have enough on your plate. I should get my skin checked. Kbee, cute bootie. My bad day is usually day 4-5..., so today would have been my worst day, however, I've felt pretty good most of the day. Yes my teeth hurt, and I had a horrible cramp in my calf muscle, but, I actually felt pretty decent. Last week, I felt much worse. Figured it would be the same every week. Addie, hope you get the rest you need tonight and this weekend. Little blue, I hear ya about your guilt and fears. But, don't allow yourself to feel guilty to be alive. Renee, love your sign.",
      "MessageIndex": 3494,
      "PostDate": "24/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 28, 2015 09:06PM gingeel wrote: So happy for you Georgie! Fantastic news. ",
      "MessageIndex": 3571,
      "PostDate": "28/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 29, 2015 09:14PM gingeel wrote: Argh! I'm so pissed. I wrote this whole huge post, and deleted it accidentally! Basically was saying that I'm happy for you Positive that things are looking on the up and up for you. You sound like your feeling pretty good about things. Rocker, that's really awesome that parents are helping you out. Lynne, big smiles! Glad your done. ",
      "MessageIndex": 3586,
      "PostDate": "29/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Aug 4, 2015 01:34PM gingeel wrote: Dizz, yes! Im constantly saying\" um.....um...the, you know, thingy!\" While snapping my fingers trying to find the right words. Having major trouble articulating. Im usually pretty witty....and quick, but not now! Hope you have minimal se's. Addie, sorry your head is killing you! Make sure u take something. I've been getting headaches, er, migraines a lot lately. I have Trexemet to take for them. Feeling groggy from benedryl. Mom is here to help with my family today..",
      "MessageIndex": 3697,
      "PostDate": "04/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Aug 13, 2015 02:36PM gingeel wrote: Oh, Andrea! Something is triggering them. Something your eating? Maybe your sleeping different? I hope they get to the bottom of it, cause I know how debilitating they are. I'm praying for you! Your Grandbabies are beautiful! Gotta run to get a Neupogen injection. Wish me luck!",
      "MessageIndex": 3901,
      "PostDate": "13/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Aug 14, 2015 10:36PM gingeel wrote: Yay! (my sarcastic enthusiasm) Not looking forward to the itching and burning. I didn't realize the fatigue was so bad. Great. Wishing you smooth sailing.",
      "MessageIndex": 3963,
      "PostDate": "14/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Sep 4, 2015 02:23PM gingeel wrote:",
      "MessageIndex": 4301,
      "PostDate": "04/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Apr 16, 2015 09:07AM gingeel wrote: Oh Lynne, that sounds very scary! Glad you are ok, though, and it's good that your having your EKG, or Echo today. Did they give you a reason as to why your body reacted that way? I know I do horrible with procedures while I'm awake. I get nauseous, shaky, etc. Hope all your pretests go smoothly. Thank you to everyone who offered your insight and advice. Telling ppl is always very uncomfortable, because I have had tears shed before me, then I go into, the \"I'm fine! I'm okay!\"....lol, so it's great to hear that you guys have the same experience. I made an appt with a wigmaker Saturday, but, he only makes custom wigs with synthetic.....I would prefer to use my own hair, cause I have so much of it, why not? I had my ECHO yesterday, my PET scan today, and my port placement tomorrow. I start #1 of AC on Wednesday. My last weekend of normalcy......that is until I've kicked Cancer's butt! Another question for you ladies....has anyone tried or considered Cannabis, marajuana, whatever term is being used, lol, for cancer treatment? My husband wants me to make brownies or whatever it takes to help my situation. I haven't \"done\" that since High School, and really don't want to. But, I was curious what your stance was on it. Greenae, looking good! Littleblue, you're funny....try Aloe Vera juice for the heartburn. I drink it for any stomach issues, and it always helps, of course not sure if it will help from chemo induced acid reflux, but I suppose it's worth a try?? Good luck Stephmoen! -Ging",
      "MessageIndex": 497,
      "PostDate": "16/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Apr 18, 2015 12:42PM gingeel wrote: Stephmoen, Hi! I was injected with a radioactive isotope and given a sugar drink. The isotope remains in your body for 24 hrs. Did you get an injection? If so, they told me to stay away from infants, pregnant women and my 4 and 7 yr old......",
      "MessageIndex": 565,
      "PostDate": "18/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "May 8, 2015 06:00PM gingeel wrote: My mother just buzzed my head with a #1. But I look like a patchy cat. lol Can I go closer? I've read from you girls that it can cause foliculitis and such... ",
      "MessageIndex": 1264,
      "PostDate": "08/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Aug 5, 2015 09:01AM gingeel wrote: lol, Gko......tell her to pray for me too. Hey i actually believe in the power of prayer, but that was too funny and ridiculous! Wow, Lynne. . glad it passed you! almost there, Steph!!! hope you get through this last one unscathed. Gingerchi, I was groggy and sleepy all day, then when it came time to actually go to sleep, I was wide awake. I eventually gave in and took an Ativan, but it didnt really help. Hope you had a nice walk! Think Im gonna do the same.",
      "MessageIndex": 3710,
      "PostDate": "05/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Apr 15, 2015 12:07AM gingeel wrote: oh, and Alibeths, It sucks that you're having to do this all over again. Cancer sucks!",
      "MessageIndex": 453,
      "PostDate": "15/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Apr 15, 2015 02:34PM gingeel wrote: I actually don't know where the Crescent Beach Club is. lol I have a question for all you ladies, How do you \"break\" the news to everyone you see on a daily basis. My kids attend a music school weekly, and I see the teachers, parents, etc. I also pick them up from school. So, I see these ppl everyday.....Do I one day just show up with a headwrap? Or bald? How did you handle this? I know this is something so very trivial....but, I've always been a social, bubbly person, so this is one of many things that is bothering me. Thanks! Gingee P.S. Thanks for adding me Lynne!",
      "MessageIndex": 464,
      "PostDate": "15/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 1, 2015 08:25PM gingeel wrote: Hey ladies! You all have been very busy! Way to go Kbee! That tshirt actually got me a little emotional. I'm heading for AC#4 on Wednesday. The fatigue has been cumulative with me. It took me slightly longer than a week to recover and feel like myself again. But, when I finally feel like myself....girls, I feel good! I'm guessing from everyone's posts that #4 is the worst? I'm just happy to be halfway done. I've noticed my fingernails have started to blacken and the bottoms of my feet are sore, like when you've been out dancing all night. I even have small dark sporadic spots on the palms of my hands. and yes, littleblue, I can't wait to get my port out too! It's in a weird spot and sits right under my sit belt. And isn't the most attractive sight when trying to wear a tank. Good luck to anyone heading to chemo!",
      "MessageIndex": 1957,
      "PostDate": "01/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Aug 15, 2015 02:47AM gingeel wrote: Thanks for sending us those! It's good to see what the blisters actually look like, cause I pictured huge water filled blisters. Although it still looks painful. Didn't realize how far along you are. #26! Almost done! Andrea, maybe your low platelet and hemoglobin count is giving you the migraines? Have a great night everyone. I'm beat. Gonna rest my calf.",
      "MessageIndex": 3971,
      "PostDate": "15/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 15, 2015 09:39PM gingeel wrote: Littleblue, what a view, I want to move to Montana! Hope your back is feeling better. Scarlett, I realize that some people just don't know how to deal with cancer. My father whom I used to speak to every week, has sort of become a bit distant. We definitely don't talk as often as before. Andrea, you should absolutely tell your husband how you feel. He's not thinking of how this is effecting you, and you don't need that. Once in a while is fine, but not every night. Congrats KSusan on finishing chemo! Addie, you and I both start Taxol tomorrow!",
      "MessageIndex": 2377,
      "PostDate": "15/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 17, 2015 01:13PM gingeel wrote: I'm still feeling pretty great, as well. I was a little weepy today, though. Maybe I'm coming down from the steroids? I'm going to get my injection in a couple of hours. Guessing soon after that the pain and fatigue will kick in? It is great not being nauseous all the time! Was thinking of you too, Addie! KBee, I've been going out more and more without a hat. Because sometimes I forget, or just don't feel like wearing one. Embrace it. Kids don't care what we look like. They probably think it's neat!",
      "MessageIndex": 2430,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Sep 4, 2015 02:26PM gingeel wrote:",
      "MessageIndex": 4302,
      "PostDate": "04/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 18, 2015 09:20AM gingeel wrote: Oh, Gingerchi, sorry about your night....hope your tummy settles down today.",
      "MessageIndex": 2455,
      "PostDate": "18/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Sep 9, 2015 02:37PM gingeel wrote: Congrats melb and Karen30! So happy that most of us are finished. Dizz, almost there! Littleblue, don't let yourself go there! Taxol did some havoc to our bodies.....my calf continues to hurt, and it's always in the same spot. Now I'm getting some weird shooting pain in my back near my kidneys...so, you're not alone! Susan, I'm jealous of your beautiful head of hair. Bald, I could handle...but having no brows and lashes is really getting to me. And I know you ladies too. I refuse to pencil them in anymore, cause I end up looking \"uncle leo\" (Seinfeld). Plus, there's nothing to even fill in. And I plan on having sex in the next couple of weeks when I feel more like myself. I wonder if Ill ever get my period back? Not that I'm complaining, but should I throw out the tampons? Going on Friday for my rads SIM. Then deportation on Mon. ",
      "MessageIndex": 4366,
      "PostDate": "09/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Sep 11, 2015 06:29PM gingeel wrote: Thanks, gals....actually Karen, I'm done with chemo! Finished last Friday. I just went in today for my rads sim. They said 4 weeks. Addie, that is a cute idea.....",
      "MessageIndex": 4416,
      "PostDate": "11/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 29, 2015 09:52PM gingeel wrote: Littleblue, I also am only getting AC+T for TN. What the....???.Seriously, I want the BEST treatment. I'm heading to the chemo bar tomorrow, so I will absolutely mention this to her. Your husband is gonna be gone for 21 days? I like those songlists ladies. Mel, hope your new port fares much better! I bought some L-Glutamine tablets today at GNC. You ladies have been talking about the powder form....hope this is just as effective. How many mgs are y'all taking? KSusan, good luck on your port removal, hope you heal fast. I'm curious what the downtime is for the removal. I know that having put in was a bitch!  ",
      "MessageIndex": 2773,
      "PostDate": "29/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 1, 2015 01:37AM gingeel wrote: I was exhausted from bendedryl too. But, I just pushed through it, and ran some errands with hubby. We are doing a landscaping project in the front. I feel pretty good, just a little headachy. Took some Naproxen. Gonna indulge in some chocolate cake and ice cream while things still taste good! ",
      "MessageIndex": 2814,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 2, 2015 09:59AM gingeel wrote: Littleblue, good luck today. Happy Canada Day to y'all Canadian ladies! KSusan, so happy to hear that port removal is much easier than port placement. Glad you are feeling good. KBee, thanks for all the insight on Dose Dense vs. weekly. I suppose changing to weekly will fare better anyhow. Body is hurting and fatigue is pushing through, but, it ain't that bad. Addie, I know how you feel about the weight gain. It sucks! Why do we have to be stressed about that too! ",
      "MessageIndex": 2854,
      "PostDate": "02/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Sep 28, 2015 01:58PM gingeel wrote: Hmmm....I love the reference to Princess Bride. You are so right! Besides, have they themselves actually experienced this? Probably not. So, there you go. haha ",
      "MessageIndex": 443,
      "PostDate": "28/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Sep 30, 2015 08:11AM gingeel wrote: Thank you so much for the advice, ladies! I'm mentally preparing myself for the worst. Hey, if I can do surgery and chemo....I can do this too, right? I hope all of you are feeling good today. And I really appreciate what this site does for me. This information is invaluable!",
      "MessageIndex": 508,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Sep 27, 2015 08:54AM gingeel wrote: Hi there, Ladies.....Been reading your posts and waiting for the right moment to jump in. I am 37, a TN, finished AC+T on 9/4, and I go in for #4/20 rads tomorrow. I'm handling it pretty well. I've not had any anxiety or stress about the treatment. Like Ksusan, I have always gone to treatment with a smile on my face and always used the time in the chair as \"me time\". I have 3 kids (4, 8, 11). And since now I'm on the table for only 10-15 min, I don't mind it. Now, my tune may change once I start to really see and feel the SE's. On day 2 I did notice pain and burning.....like stabbing pain in my right breast, but it stopped and I haven't really felt anything other than itching, but I'm chalking it up to the layer of Aquafor I've slathered on.",
      "MessageIndex": 408,
      "PostDate": "27/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Sep 29, 2015 01:42PM gingeel wrote: If you are finished with chemo, then I don't see why they wouldn't remove it along with your lumpectomy. Why go under the knife more than necessary?",
      "MessageIndex": 482,
      "PostDate": "29/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Oct 2, 2015 07:10AM gingeel wrote: My son had a 2nd degree burn and was prescribed silverdine for him and he healed beautifully and was in no pain. So, I know it works wonders! Didn't know to use it in our circumstance. Thanks for the heads up. At least now I know I've got my guns ready. Skin still holding up at #7.",
      "MessageIndex": 562,
      "PostDate": "02/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Apr 18, 2015 12:49PM gingeel wrote: Hey everyone, haven't had a chance to read through posts from yesterday, but I got my power port yesterday, and that little bugger hurt like hell! The procedure went well, but I felt like crap all day yesterday, and from where it's been placed (up right next to my clavacle), it hurts to swallow, talk loudly, etc. I guess I'm straining those muscles or tendons or whatever sits there. They only told me to take tylenol, which, seems to have worked better than the Oxycodene I had left over from my Lumpectomy. I had a killer migraine last night which didn't help my case, but finally feeling physically \"better\". Mentally? Not so much. Have been extremely irritable and weepy today. Making myself sit outside cause it's a beautiful 72 degrees in New York. Gonna have to read through your posts.....xoxo",
      "MessageIndex": 567,
      "PostDate": "18/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Apr 21, 2015 03:51AM gingeel wrote: Lynne, good luck tomorrow. You seem fully prepared! I had booked a trip awhile back with the family to Mexico, and surprisingly MO says I can go, but I'm with you, I have no idea how I'm gonna feel, and I'd rather take a vacation when I'm feeling great. Kids are sort of selfish, and I'm sure your daughter doesn't quite realize what you will be going through. My 11 and 7 yr old says things sometimes that make me go, \"really?\" It's day 4 after port placement, and still a bit sore, but it's nothing Tylenol can't handle. I also got PET scan results...no malignant cells, no Mets, no cancer! So I am beyond relieved! Still gotta get chemo, but I enter this process with a much happier outlook. I can really beat this! I don't care that it's gonna suck and hurt and really SUCK!....I just want to live for my 3 kids and my husband. Good vibes a positivity your way, ladies!!! We got this.",
      "MessageIndex": 656,
      "PostDate": "21/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Apr 21, 2015 12:43PM - edited Apr 21, 2015 12:45PM by gingeel Mamajancoz, I'm not looking forward to the hair loss, but, I send you well wishes in getting through it. Hope you have a good \"day after\" your infusion today.",
      "MessageIndex": 660,
      "PostDate": "21/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 9, 2015 08:21AM gingeel wrote: Awe, Steph, I'm also on antidepressants, and can't imagine what I'd be like without them! Both pills and God has gotten me through this. Hang in there, you're not alone....we have a reason to be mad! and sad! Addie, We do have the same diagnosis! We had a shitty Valentine's Day! I was diagnosed Triple neg after I had my lumpectomy, and considered having a mastectomy, but BS said it wouldn't change the fact that the cancer could show up somewhere else in my body. Don't beat yourself up for gaining weight. This is the one time that you deserve some pleasure, let it be food, if that's even possible! I've lost about 5-10 lbs since I've started, and I'm not gonna complain! I haven't really been exercising, like so many of you. I don't know where y'all conjure up the energy. I walk to pick up kids from school, and do yardwork, etc, but running marathons??? You ladies amaze me.",
      "MessageIndex": 2186,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 9, 2015 12:48PM gingeel wrote: Yeah, I do believe that what we put in our bodies does impact how healthy we are, etc., but, yeah, when you feel like shit, and can't stomach anything 'cept crackers, so be it! At least while we are enduring this. Addie, I forgot to comment on Vday. I'm glad you still went out for your Anniversary. I know my husband was too devastated at the time to even think about being romantic. Come to think of it, we haven't had sex since I've started chemo, but who really wants to? And yes, I still wrap my head in a towel! Although my showers are literally 5 minutes long. And it feels pretty good not to have to style or brush or anything my hair. Just saying. I had a plumber come today to clean my pipes, haha, but what is funny is I stayed bald around him and he was actually flirting with me! I had no makeup on, and was still in my jammies, as is usual, and he told me I was attractive with or without hair. Thought I'd share that with you ladies. We don't look as scary as we think.",
      "MessageIndex": 2207,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 18, 2015 09:15AM gingeel wrote: Morning ladies! Hope everyone is having very little SE's today. I'm still waiting for the punch. Day 3 post Taxol, and I still feel pretty normal, aside from tender to the touch skin.....I had a migraine yesterday, and took Trexemet, and became really achy all over from that, but I think it was the meds, not the Taxol. My throat is a bit sore, though. I did take Ativan at night for sleeping. But, haven't needed Compazine or Zofran. My MO didn't even recommend L-Glutamine. Should I be taking it? Littleblue, thank God, it is just scar tissue! Glad you can breath now. Lynne and Kbee, thank you for saying that. I've only shaved my head once right after AC 2, and I have peach fuzz hanging on. I think I'm going to rock my purple wig this Saturday at my son's Best of the 90's show. (He's an 11 yr old drummer) It's certainly appropriate for a concert. lol Dizzpark, listen, soak up all the help and attention while you can. I've sometimes felt, \"do I really need my mother law here today to clean and cook?\"....I too, would feel guilty, but I try to sit back and just let it happen. I'm grateful for the help. My husband just finished renovating our bathroom and basement, and it drove me nuts (even though I'm sooo thankful for it being done), it was too much stress for him and me while I'm doing chemo. So, I can relate. If any of that makes sense. Ksusan, yeah, my hands and feet are jacked up, too. Even my converse hurt my feet. My thumbs are dark and ugly. Oh well. BAT, happy for your good news.",
      "MessageIndex": 2454,
      "PostDate": "18/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 26, 2015 10:51PM - edited Jun 26, 2015 10:53PM by gingeel The only weird symptom I had before my DX was a strange burning sensation in my skin over my heart. This was on my left side, and my BC was on my right. But, I went to Dr. and they thought it was Shingles, even though I never broke out with anything, just had the pain. They even gave me meds for it. Said my immune system was weak for someone so young to have Shingles. Crazy. Love that \"Note to Self\"....need to remind myself of that. Allicat, so sorry for all the health issues you and your son are having. BAT, good news on your wife's tumor! Also, Littleblue, I was on birth control pills for years before my first son was born.",
      "MessageIndex": 2692,
      "PostDate": "26/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jun 27, 2015 09:49PM gingeel wrote: I take 37.5 mgs of Effexor XR, and have been for a few years now. No change in how it affects me.",
      "MessageIndex": 2730,
      "PostDate": "27/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 2, 2015 02:07PM gingeel wrote: Very curious to see how that black bean pasta turns out!",
      "MessageIndex": 2859,
      "PostDate": "02/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 3, 2015 11:34AM - edited Jul 3, 2015 11:35AM by gingeel Andrea, so happy your getting your last infusion! Kbee, you answered my question before I had to ask. Having a really bad day today...Emotionally, I'm a mess, and I feel pretty awful. Just walking and talking gets me winded. I've gotten used to having a week off from treatment. Wanting to know. .will i ever feel good? Does everyone get a neulasta shot after weekly taxol? Im no longer getting it.",
      "MessageIndex": 2901,
      "PostDate": "03/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 4, 2015 12:05PM gingeel wrote: Good to know. I don't recall any advice on exercise. But, I wouldn't be surprised if I just can't remember.",
      "MessageIndex": 2938,
      "PostDate": "04/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 8, 2015 11:32AM gingeel wrote: Lynne, beautiful pics, btw.....you all inspire me to go on my yearly trip to visit Dad and family in MN. I was really second guessing whether I should even go, cause I'm now on weekly Taxol, but, my kids deserve it, and hell, so do I! Sorry that you are having marital stresses at home. I think you can benefit from counseling, and I wish you and your family the very best. Marriage can be rough! I've been married near 12 years now, and there have been many times I wanted to hit the road, but in the end I stuck it out. And ouch on the toes! Littleblue, are your eyebrows completely gone? Mine have seriously thinned out about 70-80%, but I do try to fill them in. Yesterday, I went out with no makeup on, and I caught myself in the mirror, and thought, \"yikes!\" Thank God for makeup, man. I looked like a bald (patchy) little man. I'm 4' 11\". Yeah, I'm short. I hear you ladies on the hot flashes! I feel it mostly on my head. re Vitamin D, my MO has me on 4000 IU because I'm VD deficient. Gingerchi, hope you heal up fast so you can be done sooner than later. RPayton, geesh on the accident! Good thing no one got hurt. I went for Taxol yesterday, it is technically #3, however, since I changed from DD to weekly, I only have 7 left. Well, wouldn't say ONLY. Feels so far away! Infusion went well, it was the first time I went solo, and I ended up sleeping most of the time! Got home at 6....ate like a pig, and relaxed. Kids were at Grandmas for the night. Still are there! Kinda nice having the house to myself! ",
      "MessageIndex": 3035,
      "PostDate": "08/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 21, 2015 10:22AM gingeel wrote: Congrats Alibeths and Mysunshine on being done with chemo! Good luck Littlblue on port removal today! You painted a perfect picture of the skateboarding story......cracked me up. Dizzpark, so sorry you're having such a hard time with your mouth. Hope you get some relief soon. Kbee feeling better from the antibiotics? Glad it didnt keep u from hitting the chair. Lynne, i prefer the ativan over compazine and zofran, at least while being on Taxol. Zofran gives me headaches and compazine constipates. When I'm not feeling well, I'll take sedation. Georgia, I remember how hard it was to decide between LX or MX. I wanted a clear cut decision made for me, but they leave it in your hands. I ultimately went with lx, and so far i have no regrets. Ksusan, i too cancelled a trip that was planned last year....MX! Waiting to find out if they will refund our deposit, but I ill absolutely re book when all this is said and done. Hitting the chair today, been waiting an hour already. Im pissed cause i brought my kindle only to find that the battery is dead....arg!!! So Im doing all my typing and reading on my phone. My eyes are starting to hurt. I wanted to catch up on some netflix, which is funny, cause i won't be awake very long once they've given me benedryl. My SIL drove me, and I told her to come back when I'm done, cause what's the point? I'll be sleeping the entire time. Thoughts are with anyone who is joining me.",
      "MessageIndex": 3372,
      "PostDate": "21/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 21, 2015 09:54PM gingeel wrote: Andrea, love the mountains! Enjoy your mini holiday. Alibeths, kudos to you for sticking with the cold caps. I wouldn't have had the patience for it. I have to say, while I know how hard hair loss was for so many of us...for me, it's not even an issue anymore. It's easy, and more comfortable in the heat. And it's one less thing to deal with. With that said, your hair looks great....and full. Renee, your right..... it's good to put the electronics down and just relax. I had a nice nap, kbee...ate a burger and fries..devoured it actually. Came home, slept for several hours and then picked my kids up from their Aunts house. Ready to sleep again. Princess, it's good to remind ourselves to take one day at a time. I remember the night of first AC...how horrible I felt at the time, because I didn't do the right regimen of meds at home, but I was thinking and looking ahead saying,there is no way I can do this! but the next few days I started to feel like myself again . And now here I am more than halfway done. Little blue, enjoy your first night sans port! ",
      "MessageIndex": 3400,
      "PostDate": "21/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Jul 31, 2015 10:48AM gingeel wrote: Congrats Renee! Great pictures with your son and hubby. Lynne, sorry about the strep.....Really sucks! Hope she gets well soon, and that you stay healthy! Littleblue, thanks for the song. Hope your husband has a safe trip fighting fires! My 11 yr old had me listening to NOW by Paramore, great song, and very fitting. Dizz, wow......major drama! I would have been freaked out. Hope someone gets that dog. Kbee, that's really great that you are meeting up with your friend for the first time! Enjoy it. Addie, hope your boobies feel better. I cannot imagine what that feels like. Gingerchi, my nails look like crap....not splitting but darkening, and yeah, I just paint over them. I look freaky enough with sparse eyebrows and lashes. Not feeling so great, but not horrible, either. Just that icky, shaky feeling and my teeth ache. Gonna do laundry and try to entertain my 3 kids.",
      "MessageIndex": 3623,
      "PostDate": "31/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Sep 29, 2015 01:29PM gingeel wrote: LOL....chickens, rotisseries.....you ladies are funny. Huh, the techs do no such drawings with sharpies or any sort of marker before getting zapped. I just have the 5 dot tattoos. Wonder why? On the radio today while on the table, \"Here Comes the Sun\" by Mr. Lennon was playing...... Skin still holding up on #5/20. When am I gonna really start to hurt, girls? My port site, that is still healing, has been bothering me more than my radiated boob. Should I get that cooling towel yet? What do I have in store for me? Ya know, stuff that the doc doesn't tell you....",
      "MessageIndex": 480,
      "PostDate": "29/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Sep 30, 2015 12:06PM - edited Sep 30, 2015 12:06PM by gingeel Congrats Girlonfire! And yes, Sewbutton....don't beat yourself up about your husband. Our significant others don't get it sometimes. Well, most of the time. And when they don't quite give us what we want or need, we lose it! I know I do! My husband frustrates me sometimes, and other times, he's perfect. I hope you have a better day.",
      "MessageIndex": 511,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Oct 1, 2015 07:12AM gingeel wrote: Goofyfoot just awful to be in pain and be so uncomfortable for so long! I really hope today is much easier! ",
      "MessageIndex": 533,
      "PostDate": "01/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Sep 28, 2015 01:08PM gingeel wrote: Yes, Queen, please add me in! And thanks for the little welcome-wagon. LOL Ok, You ladies are scaring me a bit. With all the talk of having to walk around topless. This is what I have to look forward to? Yay! I noticed my tummy hasn't been right the last couple of days, and I even felt a little tired in the afternoon, but when I asked my RO nurse about nausea, etc, she said \"No, no nausea\", and poo-poo'd my being tired, saying that I shouldn't get any fatigue until wk 3. This is why having this thread is so important. We get advice and info first hand and in real freakin' time. I did go to Target for some new soft bras, cause they advised me that I will regret it if I continue to wear underwire bras. Still feeling pretty good. I did notice the temp difference between my 2 girls. Thanks for that tidbit, whomever that was. I am feeling a little uncomfortable, but nothing to cry about.....yet. And my tummy is queasy.",
      "MessageIndex": 440,
      "PostDate": "28/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "gingeel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212371/profile",
      "Content": "Sep 30, 2015 02:56PM gingeel wrote: Good advice, Karen. I mean, it's scary that had you not been ontop of it, they wouldn't have gotten that last tumor spot. I hope your skin holds up! Give it everything you've got!",
      "MessageIndex": 513,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    }
  ]
}