{
  "AuthorID": "gingersnaps…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258835/profile",
  "Posts": [
    {
      "AuthorID": "gingersnaps…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258835/profile",
      "Content": "Jan 7, 2019 02:59PM gingersnaps15 wrote: For those who don't want or can't get to a gym I recommend the FItness Blender website. The videos are free and for all fitness levels. You can also buy their fitness programs designed for specific fitness goals. I purchased the booty workout and it definitely helped. It took a little time before i was able to complete an entire workout without pausing it but I was happy with the results. Throughout the past 18 months of treatment I have mainly been hiking and walking to stay active and keep fit (including walking over 2.5 miles to the hospital and back for radiation treatments). I'm slowly adding back in weights and HIIT workouts with Fitness Blender. My expander exchange surgery is next month. After that I should, hopefully, be finished with all of my treatments besides the continuous Herceptin/Perjeta routine. Looking forward to getting my body back into tip top shape for 2019. ",
      "MessageIndex": 2061,
      "PostDate": "07/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "gingersnaps…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258835/profile",
      "Content": "Aug 30, 2017 10:52PM gingersnaps15 wrote: My dietitian told me to make a paste from L-Glutamine powder (which is an amino acid) and put it on the sores. She also told me to use it as a mouth rinse. I haven't had any mouth sores yet, but I've done some research and others seem to have had luck using it. You can buy it at GNC, Amazon and other health food stores. Now Foods L-Glutamine Pure Powder is available on Amazon.",
      "MessageIndex": 28,
      "PostDate": "30/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858258",
      "Title": "Mouth Sores rdeesides ChemicalWorld"
    }
  ]
}