{
  "AuthorID": "ginnysue",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
  "Posts": [
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "Dec 4, 2008 08:51AM ginnysue wrote: Thank you for the information. Being new to all this I am still totally confused. I am still waiting on the Oncotype DX results.. My doctor told me that because of the location of my tumor inside right breast and the size 2cm, and that because of the underarm nodes being negative didn't mean it hadn't spread. He recommended the test and said that if the resulting number was over 20, that he recommended chemo. Now I am wondering if I should question him in depth when the test comes back about the need but I truly do trust the man. It is the chemo that freaks me out here. ",
      "MessageIndex": 1,
      "PostDate": "04/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725433",
      "Title": "Oncotype DX Score - shocked at oncologist recommendation kmab15 otter"
    },
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "Oct 29, 2008 07:16AM ginnysue wrote: Thank you all for your comforting words. I appreciate each and every word. I am a journaler and have been since I was a child. Today I plan to buy yet another journal, but this one will be about this journey. I find it helps a lot. I am heading out in a couple of hours for PATesting. Nice to get that out of my way. Tammy, it's funny you mentioned Ya Ya Sisterhood. I have been called YaYa or Ya for several years because some friends and I have such a special bond and do rock and roll road trips several times a year. In fact, that is what my 6 and 2 year old grandkids call me.",
      "MessageIndex": 12,
      "PostDate": "29/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723527",
      "Title": "Got Diagnosis today ginnysue Harley44"
    },
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "ginnysue wrote: I had my biopsy today and even though I will not have the 'actual' 100%, my doctor told me it was 90% sure thing. On Monday i will go in for a sentinel biopsy and lumpectomey. I was given 2 choices for my radiation treatment, and I have opted for the cathether if it is something doable. Friday is when I should find out exactly where I stand regarding the stage. I have yet to get upset, maybe I am in a state of shock or maybe I wanted to be strong for my husband who is obviously not going to do well with this. So, this is where i am right now. I definitely was one of those who believed this cannot happen to me. Dx 10/24/2008, IDC, 2cm, Stage IIB, 0/0 nodes, ER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723527",
      "Title": "Got Diagnosis today ginnysue Harley44"
    },
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "Oct 10, 2010 03:03PM ginnysue wrote: It's been a while since I've checked in, A long while. :-) I think I am trying to put all this out of my mind and concentrate on other things.Thank you for your responses and I hope everyone is well. I go next week for another mammo, hopefully everything is ok.  I was wondering if anyone has ever had spots show up on their chest and neck? Blackish, crusty spots. Can one still get radiation side effects over a year after finishing radiation? Just curious. I suppose it could be age spots but I just hadn't noticed them until about a week or so ago. Take care. Ginny",
      "MessageIndex": 11,
      "PostDate": "10/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/750709",
      "Title": "Possible Recurrence ginnysue kira1234"
    },
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "Oct 23, 2010 01:13PM ginnysue wrote: My mammogram did indeed show a *very jagged edged* spot. I went to my surgeon yesterday and on Tuesday I go for yet another biopsy. I am aware what a jagged edged lump can be so I am prepared (I think) in case of a recurrence. It is on the same breast and i know that it could be scar tissue or whatever. Funny thing.  My original diagnosis was October 24, 2008, yesterday was October 22, 2010. I just found this funny.",
      "MessageIndex": 12,
      "PostDate": "23/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/750709",
      "Title": "Possible Recurrence ginnysue kira1234"
    },
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "ginnysue wrote: I am not sure really where to post this but I am going to go for here, I was diagnosed in October 2008. I had a lumpectomy followed by weeks of radiation. It is now April, 2010, almost 18 months later and I am dealing with the possibility of a recurrence. I will go in for another MRI with a needle biopsy next Friiday. What caused my concern was in the past month a considerable difference in the boob. The MRI I had last week showed a 3/4\" probably benign *something* in the other boob. In the affected one was a thickening that my doctor had never seen before plus a deep cavity underneath the original site. Where he believes it probably scar tissue he said he could not rule out a recurrance. Has anyone had anything remotely similar to this? Dx 10/24/2008, IDC, 2cm, Stage IIB, 0/0 nodes, ER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/750709",
      "Title": "Possible Recurrence ginnysue kira1234"
    },
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "Oct 26, 2010 04:31PM ginnysue wrote: I had the core biopsy today. i was told that it is most likely scar tissue but we won;t know until the results on Friday, more waiting! Anyway, my doctor removed a marker which I didn't know I had! I have copies of several records and read nothing about a marker being there. I learned through googling that a small amount of patients develop some kind of reaction to the marker, that it could cause horrible pain in the breast, headaches, itchy scalps (?) and other symptoms. So I am hpoing this is what has caused the severe breast pain. I also wonder if it had anything to do with the jagged spot on the mammo.And the painful chest wall.  I am so tired of all this, the sticks, the probe, the squeezing and all. Well, I know you all understand! Good luck Patti tomorrow. Good thoughts your way.",
      "MessageIndex": 14,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/750709",
      "Title": "Possible Recurrence ginnysue kira1234"
    },
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "ginnysue wrote: Why is it necessary to have an ultrasound in the middle of radiation therapy? I just finished regular, had the CT scan in preparation for the 'boost', went home was called and told not to come in until I had an ultrasound that has been scheduled for tomorrow. I've not talked to anyone who had had one in the middle of treatment but considering I have only talked to 3 people i guess that really doesn't count. Is it customary to have Ultrasound between regular radiation treatment and the boost? Thanks Dx 10/24/2008, IDC, 2cm, Stage IIB, 0/0 nodes, ER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728172",
      "Title": "I have a question ginnysue JulieC"
    },
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "ginnysue wrote: Apparently the treatment originally planned for me is not going to happen. On Monday I went in to have my first treatment via Mammosite. It was discovered when they did the PET/ct, that air pockets had developed just outside the mammosite bubble. Not only that, apparently the margins between the bubble and my skin had diminished. I will go in tomorrow, have another PET/CT and find out if I qualify for the Mammosite trestment I thought I was going to have. I realize that I will have to do the daily 6-8 week treatment if things do not go as I hope. Also, I am in line to meet with a Cheno man. Because of this, I am not as positive thinking as I have been in the past. I am now thinking of myself as a cancer patient! And that is something I do not want to believe. Guys, for the first time I am actually scared and I have to remain positive for my family. All I really want to do is fall apart. Ginny Dx 10/24/2008, IDC, 2cm, Stage IIB, 0/0 nodes, ER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724305",
      "Title": "treatment change ginnysue LisaAlissa"
    },
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "Nov 1, 2008 03:14PM ginnysue wrote: Ya know, this is interesting. My marriage has had it's share (well maybe a little more) of ups and down in 32 years, but I am the mother of a child now 29, who was diagnosed with a severe mentall illness when he was 17. It was only just diagnosed at that time. But has been going on almost since birth so this makes me wonder if stress, desperation and depression due to a situation of our control might lead to a person being more susceptable to illness due to a less active immune systrem? Humm...",
      "MessageIndex": 12,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723726",
      "Title": "Does desperation play a role in developing breast cancer? HeatherBLocklear dlb823"
    },
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "Nov 5, 2008 08:35AM ginnysue wrote: Surgery went well. It began 2 hours late which brought me out of recovery after 5, That plus the fact that I had a hard time coming down off the anestetic made the doctor keep me overnight. I had excellent results. Even though i go on Friday for a post op check and learn the pathology reports, I was told that it was not in my lymph nodes and only in the lump and a little surrounding tiussue. So everything is good. I have very little pain. I took a Lortab once and it made me deathly nauseous so the fact that I am not in pain is a good thing! The catheter is not really comfy but that may be because I know it is there! I begin my radiation treatments on Monday.",
      "MessageIndex": 4,
      "PostDate": "05/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723768",
      "Title": "Surgery tomorrow ginnysue teresaob"
    },
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "ginnysue wrote: The sentinel biopsy is set for 11:30 and the lumpectomy 1:30 tomorrow. I wanted to post this and let you all know. I've only been a member here a few days but I have felt profoundly touched by the concern and caring you give. I have good feelings about the whole thing..  Now the worst part, I have people coming to visit. DH emailed everyone he knew since birth I do believe. LOL! I told him I preferred NOT, but well, there you are! It will be ok because I do not plan to be a hostess..  I'll be back i touch the first chance I have. Ginny Dx 10/24/2008, IDC, 2cm, Stage IIB, 0/0 nodes, ER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723768",
      "Title": "Surgery tomorrow ginnysue teresaob"
    },
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "Oct 30, 2008 12:44PM ginnysue wrote: I'm with you, results for me due today! I didn't think the biopsy was as bad as I expected, either. Let us know!  Waiting is indeed rough!",
      "MessageIndex": 6,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723575",
      "Title": "back from my biopsy lexio ginnysue"
    },
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "Oct 30, 2008 06:21PM ginnysue wrote: I am a newcomber to the board and have been reading a lot of what people have written. This topic is close to my heart. I lost my beloved 13 year old Shiz Tzu in February. I did not think I was going to survive that one. Anyway I had a dream the night he died, of my best friend who passed in 2006. He told me to get another dog. I did, about 2 months later, even though my husband was bucking. This dog has been the greatest joy to us. He has saved me. We named him Billy after my lost loved one. Anyway, Billy kind of knows things, even though he is only 9 months old. He senses things. I don't know about anyone else, but I am probably going to lean on this little dog through out my days fighting this disease. Surgery is Monday and I think he knows! I swear! XXOO Ginny",
      "MessageIndex": 9115,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "ginnysue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74114/profile",
      "Content": "Oct 31, 2008 07:29PM ginnysue wrote: portiasprout, you just helped me to understand more regarding the passing of my best friend when you put up the Cushings and dogs.He suffered from Cushings, empesema and osteoporosis.  I am continually amazed by the wealth of information I am getting here!  Oops gotta go, I think my first trick or treater is her.  XXOO  Gin",
      "MessageIndex": 9132,
      "PostDate": "31/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    }
  ]
}