{
  "AuthorID": "Girlie81",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177138/profile",
  "Posts": [
    {
      "AuthorID": "Girlie81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177138/profile",
      "Content": "Girlie81 wrote: Hello all, I am sorry if I am wasting any of your time, but I recently turned 18 years old, and I am sick to my stomach just writing this. For as long as I can remember, I have had an indent/pucker like line on the lower inside end of my left breast. I may be imagining things, but for some reason, I remember having this indent when my breasts were still developing too like in my early teens, but that could just be my anxiety talking and trying to justify this. The indent has never seemed to change or get any bigger either. I have fairly small breasts so the dent is easy to see, and visible when my arms are on my sides, but when I raise my arms it is less noticeable. About a week before I get my period, my breasts get very sore because they are very dense/fibrous, and the area with the dent gets sore as well, so that's why I have always just thought it was my hormones or something causing the dent. In the past, I have gone to my mom to ask about certain lumps that i've felt that she reassured me were just my normal fibrous tissue. At that time, she felt for these lumps and wasn't concerned but I don't think she every saw the indent. Anyway, does this sound like breast cancer?? I have been keeping this to myself for so long, and never really thought about it, but because I have recently read about the warning signs of breast cancer I have been freaking out. I plan on telling my mom and hopefully she will make an appointment to get it checked out but it is a busy weekend coming up, as I just graduated high school and my family plans on celebrating, plus it is father's day weekend. I just can't get up the courage to tell my mom, even though I know I have to. However, I plan on telling her after this weekend once my family leaves and I can talk to her alone. Sorry for such a long post, but I guess I'm just looking for some comfort or reassurance. Thank you xx Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/845241",
      "Title": "Think I have breast cancer at 18? Girlie81 Moderators"
    },
    {
      "AuthorID": "Girlie81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177138/profile",
      "Content": "Jul 14, 2016 05:03PM Girlie81 wrote: Hello, I am 18 years old, and have had an indent in my left breast on the inner side (medial i guess) close to where the contour of breast is I guess. There are no hard lumps in its vicinity except for a few moveable ones that are quite small, and feel similar to those in my right breast. I have had this dent for quite sometime which alarms me even more, making me practically paralyzed in fear because of the time I have wasted worrying about this, instead of getting it checked out. The reason I've waited so long is because I am more terrified to tell my mom, as to not worry her either. Everything has been chaos in my house and every time I have a minute alone with my mom, we get interrupted or I chicken out in showing her. My question is Magdalena, how did you confront your mom about your breast problems? Thank you so much, I truly appreciate it and I am hoping for all B9 results to you! P.S- anyone know of B9 reasons for a small breast indent, especially in someone my age?? ",
      "MessageIndex": 11,
      "PostDate": "14/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/845761",
      "Title": "20 years old with lump under edge of breast tissue! Magdalena20 Magdalena20"
    },
    {
      "AuthorID": "Girlie81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177138/profile",
      "Content": "Jul 17, 2016 08:19PM Girlie81 wrote: I really hope you're right.. All I can think about is what if it spread if it is cancer.. I've waited too long because of stupid fear and now that I've waited I'm even more nervous! Why would I let my nervousness and self consciousness get in the way of taking care of my health :( Your appointment will go well I'm sure! It's just another stepping stone to calming your nerves I will say a prayer .. Please keep me in yours.",
      "MessageIndex": 17,
      "PostDate": "17/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/845761",
      "Title": "20 years old with lump under edge of breast tissue! Magdalena20 Magdalena20"
    },
    {
      "AuthorID": "Girlie81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177138/profile",
      "Content": "Jul 15, 2016 03:13PM Girlie81 wrote: ugh. I hate that this is on our minds.. When we should be enjoying ourselves! Google is the worst. I just hate that I have this indent and everything online points to cancer. And since I've waited so long to get it checked I just pray that it is not in advanced stages if it is cancer. I should be planning for college but right now i am sick to my stomach thinking about what my future has in store for me.",
      "MessageIndex": 15,
      "PostDate": "15/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/845761",
      "Title": "20 years old with lump under edge of breast tissue! Magdalena20 Magdalena20"
    },
    {
      "AuthorID": "Girlie81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177138/profile",
      "Content": "Jul 15, 2016 09:15AM Girlie81 wrote: Magdalena, Thank you so much for your reply. I truly do appreciate it and your words of encouragement made me feel so much at ease! Since it is Friday, and the doctor's office closes early, and I would have to wait another weekend to get another appointment anyway, I plan on scheduling perhaps next week for an appointment and also going to my mom with my concerns. What makes this situation worse is that I plan on going to college in the fall. I can't imagine what I would do if this turns out to be anything but benign. How do you stop your mind from going to the worst case scenarios?? :(",
      "MessageIndex": 13,
      "PostDate": "15/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/845761",
      "Title": "20 years old with lump under edge of breast tissue! Magdalena20 Magdalena20"
    }
  ]
}