{
  "AuthorID": "Giselle7",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96207/profile",
  "Posts": [
    {
      "AuthorID": "Giselle7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96207/profile",
      "Content": "Feb 23, 2010 09:41AM Giselle7 wrote: I had my first fill yesterday after bilateral mastectomy on 2/2/10. Quite painful I might add! I think it was the pain I experienced that precipitated the dream I had last night. I dreamt I had Dolly Pardon size breasts. Very funny considering I have been a size A most of my life. ",
      "MessageIndex": 5,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748785",
      "Title": "When you dream, do you have breasts or not? barbe1958 barbe1958"
    },
    {
      "AuthorID": "Giselle7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96207/profile",
      "Content": "Feb 23, 2010 08:52AM Giselle7 wrote: Hi bookart: My BMX with reconstruction was on 2/2/10. Yesterday I posted a question about just this problem of extra skin under my arms. It is driving me crazy. When I put a jacket or coat on I feel like a linebacker. I have a thin upper body, so visually it is noticeable in the mirror. I too hope this goes away or else I will be very disappointed, to say the least. My PS says this will work itself out. I am skeptical.",
      "MessageIndex": 9,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748642",
      "Title": "BMX, discomfort just starting 2 weeks out? lovemygarden lovemygarden"
    },
    {
      "AuthorID": "Giselle7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96207/profile",
      "Content": "Feb 20, 2010 12:58PM Giselle7 wrote: Hi lovemygarden, I had my bilateral mastectomy on 2.2.10 and still feel like a have the widest and tightest ace bandage around my chest. I have been really working hard on my breathing exercises as it would be easy maintain shallow breaths. I am still wearing the surgical bra that I came home from the hospital with as it is by far the most comfortable. The sunburn and prickly feeling I have, particularly on my SNB side drives my crazy. From what I have read, all this is perfectly normal. I cannot wait to put some vitamin E on my skin. Sometimes reading to much about all this can be a detriment. I have, more than once, had to put materials away because my mind would start reeling. Can't wait to sleep on my side again! Giselle ",
      "MessageIndex": 4,
      "PostDate": "20/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748642",
      "Title": "BMX, discomfort just starting 2 weeks out? lovemygarden lovemygarden"
    }
  ]
}