{
  "AuthorID": "Gitane",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
  "Posts": [
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 11, 2011 04:11PM Gitane wrote: (((((Pee)))))",
      "MessageIndex": 76,
      "PostDate": "11/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763127",
      "Title": "Seems as if time is running out... pee vision2020"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 24, 2008 10:23PM Gitane wrote: Joining the rest of the sisters here at bc.org in wishing you well deserved rest after the biopsy and, of course, the best possible results.  Calm, warm, loving, hugs to you.",
      "MessageIndex": 167,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/706997",
      "Title": "not good you guys Fitztwins Lindaip"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 11, 2008 11:55AM Gitane wrote: Oh, Amber.  The choices are so hard.  I don't know what to say.  You must decide what is best for you.  Is there no other chemo that might keep your cancer stable for just until school starts?  Does it have to be Taxol if that makes you feel so sick and miserable?  I suppose these are dumb questions, you probably talked all this out with your doctor. Maybe you just need more time to think, and the decision will come. As the doctor said, nobody can see the future, there is no wrong decision.  I am thinking about you and sending you love and caring and HUGS.  ",
      "MessageIndex": 2,
      "PostDate": "11/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708891",
      "Title": "Progression for me :o( What to do, what to do???? mrs_X_Sunneedazee Barb-FightingBC"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 9, 2008 07:13PM Gitane wrote: Can't say more than the others, just add me in, too. I hate cancer, and that's putting it mildly. Wish I had everybody's gift for words so I could say what I feel. We are all holding on tight for you and hoping for the best tomorrow. Lots of love.",
      "MessageIndex": 33,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/706997",
      "Title": "not good you guys Fitztwins Lindaip"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 15, 2008 11:07PM Gitane wrote: Rayne, The oncotype test will give you an estimated probability of recurrence, the likelihood you would benefit from chemo based on primarily the proliferation rate of your tumor cells, the levels of ER and PR that gives you some information about the likelihood of responding to endocrine therapy.  All said, though, nobody really knows because we're all different.  Even high ER and PR do not guarantee response to endocrine therapy.  Even high proliferation scores do not guarantee a response to chemo.  I had a very low proliferation rate, an intermediate recurrence score, and had a great response to chemo.   Even a low recurrence score does not mean you won't have a recurrence. We have to make decisions we can live with.  ",
      "MessageIndex": 7,
      "PostDate": "15/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721266",
      "Title": "need help rayne_23 Shirlann"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Mar 18, 2010 04:26PM Gitane wrote: Hi Tamara, I've been thinking of you, too.  I'm glad your test went well and it's over.  Back to waiting, but what can we do.  Things lighting up is normal, it's how they light up that matters, I think. Hard not to worry, but do your best.   I was glued to my computer; I needed the information and wanted to know everything.  It took time, but I wanted to be informed.  I agree with you when you say that just trusting the professionals is not so good.  There is nothing wrong with agreeing with your doctors, but it doesn't hurt to have them explain things and be able to judge their responses intelligently.  There are choices to be made, and knowing the right questions to ask and looking further into things really helps us make the best choices.  There is a great deal of not-so-helpful information out there too, so choosing reputable sites is good advice.  Hugs! ",
      "MessageIndex": 8,
      "PostDate": "18/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/749906",
      "Title": "Radioactive! llanabeth llanabeth"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 22, 2009 06:19PM Gitane wrote: Contratulations on completing your master's degree and on your progress toward your chosen profession.  I'm very impressed by your energy and commitment.  All the very best!  G",
      "MessageIndex": 6,
      "PostDate": "22/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/739297",
      "Title": "Finally Finished Masters DCMom apple"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Mar 4, 2008 10:45PM Gitane wrote: Look at the love here Deb. Amazing. Just wanted to say how much I admire you. Strength and love to you and your family, Gitane",
      "MessageIndex": 88,
      "PostDate": "04/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701345",
      "Title": "I never wanted to post here, but what do I do now?? AlaskaDeb heatherpalmerton"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 5, 2012 09:30PM Gitane wrote: I was glad to read your update, Diane.  It's good to hear your voice around here.  Hugs,  G.",
      "MessageIndex": 17,
      "PostDate": "05/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/795952",
      "Title": "Shout out to stage III peeps; update diana50 victoriasecret"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 6, 2008 10:58PM Gitane wrote: I was able to feel good about my surgeon by calling the pathology department at the hospital where my surgeon worked and talking to someone there. That person was very candid and gave me the information I needed. I don't know if all pathologists work that way, but this one was fantastic.",
      "MessageIndex": 3,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/706876",
      "Title": "Advice on surgeons CSflorida myheidiscrapbooking"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 19, 2012 07:15PM Gitane wrote: I had cellulitis after my SNB.  I was totally wiped out by it.  I have never been so weak in my life.  My breast and side were red and hot.  After IV antibiotics and oral antibiotics it cleared up.  I haven't had a recurrence of it since, and am so grateful.  It's scary.  I'm really sorry you are dealing with this and hope they can come up with successful treatment for you.  Hugs.",
      "MessageIndex": 5,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/790705",
      "Title": "Chronic Recurring Cellulitis Treatment(s) Katarina Katarina"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Oct 27, 2012 08:17PM Gitane wrote: Will be thinking about you this Thanksgiving !!  Ten years, how fantastic is that!!!  ",
      "MessageIndex": 41,
      "PostDate": "27/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/794824",
      "Title": "Postcard from the edge of ten years out.... weesa lifelover"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 20, 2011 05:26PM Gitane wrote: You are so kind to let us learn from your visit.  Many of the topics you discussed will be the same at my next visit.  It helps to know what others have learned.  I am so glad to hear you are doing well and have such a good prognosis.",
      "MessageIndex": 14,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763687",
      "Title": "Update from Oncologist Visit Today LindaLou53 AnacortesGirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 10, 2010 08:51PM Gitane wrote: Ilene,  Thanks for sharing the 4 year anniversary. Congratulations!  That elevated blood test may be just fluctuation caused by other stuff.  Like you, I hate this worry, seems like there is always something there to remind us.  4 years is good!  ",
      "MessageIndex": 5,
      "PostDate": "10/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/760592",
      "Title": "Four years today, but.... Ihopeg AnacortesGirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 14, 2010 09:32AM Gitane wrote: Kimber, I'm so glad you shared and everyone jumped in here.  It makes me feel better knowing that the \"sneak attacks\" of these feelings are happening to everyone.  My PS (routine check up) opened the file with the pictures of my boobs as they were pre-mast.  It was me talking, but I swear it felt like someone else.  I said in this weak, wobbly voice, \"That's me!\"  Then I felt this sweeping sadness.  Later when I was alone the tears came.  It's been 5 years, and I never once have regretted having bilat. and recon.  I still don't.  I never had any emotions around any of it, then WHAM!  Guess I know I did what was right for me, but that doesn't take away the loss.  Anyway, all this to say, Kimber, that there is no logic, the emotions come when they need to.  I felt better after. I hope you did, too, and that the mammogram shows that all is well.  Hugs. ",
      "MessageIndex": 22,
      "PostDate": "14/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761725",
      "Title": "Stupid mammogram made me cry kimber3006 Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 29, 2011 08:46PM Gitane wrote: This is amazing.  I haven't heard about Herceptin for Her2+1, but I have heard that there is some controversy about it working for more women than they thought it would in some trials.  I know they give hormonal therapy if you have even 1% ER positive. It's great that you have had such a good response already to treatment.  Best of luck as you tackle the next phase. Please let us know more when you know more.  G.",
      "MessageIndex": 2,
      "PostDate": "29/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772395",
      "Title": "Confused-am I triple negative or not? bak94 Bren-2007"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 1, 2008 10:02PM Gitane wrote: Sites of breast cancer recurrence • Local recurrence – Cancer reappears at the original tumor site.  • Regional recurrence - Cancer has spread past the breast and underarm (axillary) lymph nodes. Regional recurrences can occur in the chest muscles, in the lymph nodes under the breastbone, between the ribs, above the collarbone and surrounding the neck.  • Contralateral recurrence - Cancer has spread to the other breast. • Distant recurrence (metastasis) – Cancer has spread to other parts of the body.",
      "MessageIndex": 13,
      "PostDate": "01/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/702427",
      "Title": "If it comes back...wil it be stage 4? Naomi Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 1, 2011 06:26PM - edited Aug 1, 2011 06:56PM by Gitane In the NSABP B-31 study,  available blocks were tested centrally with FDA-approved Her2 FISH assay.  Surprisingly, there was no association between Her2 gene copy number and benefit from trastuzumab (interaction p=0.60)  Even patients with normal gene copy numbers appeared to benefit from Trastuzumab treatment (RR- 0.40) This finding was studied, restudied and scrutinized extensively by many experts in many ways.  Independent study results clearly suggest that the benefit may not be restricted to Her2 positive patients as currently defined. They don't know if current clinical essays are not precise enough or if there are other molecular determinants of response besides Her2.  The current thinking is that the latter is true.  Another possibility may be that there there are micromets that are Her2+ in patients with Her2-  tumors.  This has been demonstrated by several investigators in small-scale studies that measured Her2 in circulating tumor cells.  I am sorry, but I don't have those studies, but I'm sure your oncologist can find them. Analysis of NSABP B-31 outcomes did not find any genes or sets of genes or clinical variables (like age, ER, size, nodes, etc.) that predicted benefit, but they found that women with ER+, 1-3 positive nodes, and t-size <2cm didn't seem to benefit statistically, even those that were Her2+. There is an experimental assay, the NanoString-based HER2 assay, that the NCI is recommending be used in the NSABP B-47 protocol.  It has identified a set of genes, measures their mRNA, and seems to identify those that may benefit from trastuzumab better than other measures.  I believe that this either is or was written up in The New England Journal of Medicine, but I haven't looked for it yet. I was able to get all this info by googling NSABP B-47, then downloading a PDF document (30 pages long) I found on page 3.  It's called \"Final Progress Report for Research Projects Funded by Health Research Grants\" about research done between 2/08 and 12/09, then presented to NCI in 2/10.   I know this is long, but if it will help you I'd be very happy,  Hugs, G.  Edited to add this great discussion I found. http://podcast.researchtopractice.com/podcast/pdf/bcu/BCUTT1_09.pdf Starts talking about Her2 and B-31 down on page 9 with lots of references/history for your oncologist.   ",
      "MessageIndex": 8,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772395",
      "Title": "Confused-am I triple negative or not? bak94 Bren-2007"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 31, 2011 02:44PM Gitane wrote: http://www.nsabp.pitt.edu/B-47.asp Just lost a long post I wrote about the history behind this trial and how I found out about it.  Anyway,  it's exciting because there IS evidence that there is benefit in Her2 - and Her2 low patients for Herceptin.  This link is to a new trial NSABP B-47 , patients are randomized to TC or AC plus/minus Herceptin (for 1 year I think).  Exciting stuff.  You're breaking new ground here! I've also read that Avastin can have good effect in triple negative, especially BRCA +.  The PARP inhibitors look good, too.     Will be thinking of you.  Hope your treatments really do the job,  B. ",
      "MessageIndex": 4,
      "PostDate": "31/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772395",
      "Title": "Confused-am I triple negative or not? bak94 Bren-2007"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 16, 2009 04:53PM - edited Sep 16, 2009 04:54PM by Gitane Huge congratulations on your good news, Carol. Yes, it is funny when we say \"only\" 2 nodes, or something like that. I've caught myself doing it, too. Life is good, you said it!",
      "MessageIndex": 1,
      "PostDate": "16/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/740499",
      "Title": "I am back again.....Good news Mamita49 KerryMac"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 2, 2012 03:55PM Gitane wrote: Best news ever!",
      "MessageIndex": 12,
      "PostDate": "02/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791419",
      "Title": "I'm back...... orlandpark1965 HLB"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 27, 2010 07:18AM Gitane wrote: It's so heartwarming to see these pictures.  Such looks on your faces,  a little shock and lots of joy.  Sort of like, \"Wow, we did it!!!\"  Of course we all know that you, Jen, have come through this with flying colors.  You should be very proud.",
      "MessageIndex": 51,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747382",
      "Title": "Pics of Baby Kilian Pure Meece"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 24, 2010 07:10PM Gitane wrote: Oh, you gave me such a good laugh.  It wasn't funny for you, though.  Sorry!  I've never heard of this before.  Could it be something they used to wash the wig?  Scarves and hats can be a lot more fun and are so much more comfortable. My goodness, just what you need, a new mystery SE.",
      "MessageIndex": 2,
      "PostDate": "24/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747282",
      "Title": "I'm allergic to my wig! kimber3006 Leah_S"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 29, 2009 09:33PM Gitane wrote: Hi Merry,  I just am adding my voice to the many encouraging voices here.  You are among people who have been there and understand.  That feeling you mentioned, about it seeming like a bad dream, kind of unreal, is very common.  Hold on to hope.  It's not false hope, either.  Listen to the wonderful women, here, they know! ",
      "MessageIndex": 16,
      "PostDate": "29/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744663",
      "Title": "Help. So scared! merryheart AnacortesGirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 13, 2009 08:35PM Gitane wrote: Hi Phoenixsmom,  In some ways our diagnosis is similar.  I had more than one tumor, in fact many tumors, spread over an 8 cm area of my left breast.  This is a bit different than an 8 cm tumor, at least that was how it was explained to me.  I also had some DCIS.  I was told that DCIS combined with ILC is not that common.  Chemo did not get rid of my DCIS.  Unlike you, I didn't have a complete response in the invasive part; there were residual scattered nests of cells.  I had a SNB before my chemo; there were individual tumor cells in one node, a few small clusters < 2mm in one node, and a micromet of 1mm in one node.  In all 9 nodes were removed, the other 6 were clear.  No more nodes were removed after chemo.  I am telling you all this because my oncologist did not recommend I have radiation.  He said in my case it would be a local control issue and not affect distant recurrence.  I got a second opinion, and was told it was a hot issue among oncologists and really was my decision.  The risk would be potential damage to the heart, lungs, and ribs.  I also had a bilateral mastectomy with saline implants.  Since the professional opinions I was getting leaned strongly toward the benefit being small and risks being huge, I decided against rads.  I'm 4 years out now.  I guess time will tell if I decided correctly.",
      "MessageIndex": 28,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 2, 2012 02:08PM Gitane wrote: Keep living your happy life, Mamita.  Big hugs on this special anniversary.  Thanks for sharing; we love to know you're doing well.  G.",
      "MessageIndex": 13,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782024",
      "Title": "3 years , and many more to come Mamita49 Mamita49"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Oct 1, 2010 04:17PM Gitane wrote: What a warm feeling I had watching your video, Karen.  Your cat was there just at the right time and was just what you needed.  Luke is so beautiful, and so are you.",
      "MessageIndex": 18,
      "PostDate": "01/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/758148",
      "Title": "My cat and my BC Karen09 jenn3"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 16, 2009 08:05AM Gitane wrote: Ben,  How kind of you to let us know about rooni.  Words are not enough, I know, because nothing can take this sadness away from you and your family.   So very sorry. ",
      "MessageIndex": 42,
      "PostDate": "16/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737409",
      "Title": "my beloved rooni has went home to the lord rooni janie44"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 17, 2010 10:26PM - edited Sep 17, 2010 10:27PM by Gitane Karen,  The story of you and Luke coming together when you needed each other most really hit home with me, too.  Smokey (see my Avatar) showed up on my front porch just after I was diagnosed.  He was thin and weak having at some point been badly injured and then healed over; awful and I nobody knows how he survived. even the vet.  After surgery he recovered right along side me as I went through chemo.  For me, too, he was companion, comfort, and inspiration.  He helped me more than I can say, and probably, in his own way, more than anyone else could have.  Our animals are really special.  What a great photo of Luke!  Thanks.",
      "MessageIndex": 9,
      "PostDate": "17/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/758148",
      "Title": "My cat and my BC Karen09 jenn3"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 17, 2012 08:48PM - edited Jan 17, 2012 08:48PM by Gitane I so welcome this happy post about living, planning for the future, and loving life.  Thank you for coming here to share your anniversary with all of us.  G.",
      "MessageIndex": 29,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781155",
      "Title": "4 YEARS!!! DCMom Kay_G"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 26, 2010 07:05AM Gitane wrote: Billynda,  When you dropped off the radar I figured Buddy was making his entrance.  It's wonderful that you are both doing fine  (if we just ignore that excruciating headache, that is).  New life.  How it helps us to share in this.  Pictures would be great.  Take very good care of you.  Warm hugs. A while back I copied this from another poster.  I'll put it here, although I've never tried it.  Hopefully someone who knows more than I do will be along to help. How to post a picture on BC.ORG   Go to: http://register.photobucket.com/ Register....Its free.  Then when you login there will be a prompt to Upload Images and you click on choose files. Browse to where your picture is on your computer.  After your picture is uploaded to photobucket you will see the picture, and several options below the picture as follows:  Email & IM Direct Link HTML Code IMG Code  Click on Direct Link and that copies the picture to the clipboard.  Then when you come back to the post a reply window at Breast Cancer.org and you are ready to paste that picture in....click on the little green tree up by the smiley emoticons and where it says image url put your cursor in there and just hit [control c] and and it will automatically paste in the url in from photobucket.  Give this a whirl.....it is not that hard but might take you some trial and error.  Anyway...give that a try. ",
      "MessageIndex": 36,
      "PostDate": "26/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747294",
      "Title": "Clint \"Buddy\" Warren Griffith II is here!!!! Billynda lkc"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 30, 2010 07:11AM Gitane wrote: Billynda,  I, too, will be thinking of you, as so many of us will.  Sending calm vibes and reassurance.  Your pictures are so heartwarming.  Thank you for posting them for us. G.",
      "MessageIndex": 61,
      "PostDate": "30/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747294",
      "Title": "Clint \"Buddy\" Warren Griffith II is here!!!! Billynda lkc"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 2, 2010 01:39AM Gitane wrote: Hope you had good results today, Billynda.",
      "MessageIndex": 76,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747294",
      "Title": "Clint \"Buddy\" Warren Griffith II is here!!!! Billynda lkc"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 20, 2008 06:25AM - edited Jun 20, 2008 06:25AM by Gitane Hi Econmom, First I want to congratulate you on finding your own breast cancer. You did everything right. Second, as others have said, you have found the right place for support. Third, I want to share an information source you might want to use. I don't know how to post a link, so I'll do my best here. The website is www.cancercare.org, when you get there, go to \"Telephone Education Workshop Podcasts\", Click on \"Cancer Type\". There will be a list of workshops given by experts that you can listen to on your computer. The one I think might interest you is the one recorded on 6/4/08 with the title Medical Update on Triple Negative Breast Cancer. It contains very good info. Best of luck to you. PS Happy Birthday, Nash!",
      "MessageIndex": 9,
      "PostDate": "20/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707642",
      "Title": "Joining the boards econmom omo"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 15, 2010 10:45PM Gitane wrote: I'm crying, too.  \"How I wish I could save you.\"  Deep, powerful thoughts for one so young.  Please tell him how much the song he chose and his words have touched us all.  ",
      "MessageIndex": 21,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746804",
      "Title": "My Son made me cry yesterday kim40 Rhonda1966"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 13, 2012 08:31PM Gitane wrote: Good news, Sharon.  It made me happy to read your post.  You are doing so well.  I'm really gld you checked in.",
      "MessageIndex": 12,
      "PostDate": "13/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/796273",
      "Title": "3 Years Out pupfoster1 Bugs"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Apr 29, 2008 07:19PM Gitane wrote: Bibbie, I had 6 rounds of chemo, also. I, also, could not do tissue transfer. But I didn't have radiation, so our cases aren't exactly the same. I was able to do the expansion and implants. However, there are others who have had the implants after radiation, so it is possible. I'm glad I had the reconstruction, but probably would have been just as happy without. Bobbie, Lisa, MissShapen (love the name), my staging went from probably stage 1 based on core to Stage 2b/3a based on MRI and post mastectomy pathology, not sure because of neo adj chemo. Seemed like over the first year each time I talked to someone my prognosis dropped and the staging was worse.",
      "MessageIndex": 18,
      "PostDate": "29/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/702880",
      "Title": "From Stage 1 to stage III a Bibbie Lindaip"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 9, 2010 08:45PM Gitane wrote: Yes, Wendy, you are still standing, going forward without having the leash to that treatment center. 6 years is huge; I'm glad you are feeling so good.  We are all very happy for you!",
      "MessageIndex": 10,
      "PostDate": "09/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761777",
      "Title": "Last visit wih oncologist today wallan amlg1"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Gitane wrote: Hi Twink, I started this because it's easy to slip out of touch with all the bad news that has been happening around here of late. I am thinking about you and hoping you are feeling better today, maybe a little stronger. Hugs, love, and hoping for the best. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707179",
      "Title": "Twink, we are thinking of you Gitane TripleNeg"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 29, 2011 11:25AM Gitane wrote: Happy first year, Jackie.  Each day is a gift.  May you have many more.  G.",
      "MessageIndex": 2,
      "PostDate": "29/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764117",
      "Title": "First year cancerversary jdootoo jdootoo"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 8, 2008 07:38PM Gitane wrote: That news about the kidney working so well is fantastic.  You have a treatment that is working and that makes a big difference.  I'm so happy.  Keep us posted, please!",
      "MessageIndex": 12,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708730",
      "Title": "Xeloda still working!!!!!! waterlily JoyRebecca"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 27, 2010 09:29PM Gitane wrote: Great thread, Bugs, and I am so happy to see you and your son.  Thanks for posting the picture.",
      "MessageIndex": 25,
      "PostDate": "27/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762518",
      "Title": "Sick of the bickering..on to something good! Bugs kimber3006"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 15, 2010 10:27PM Gitane wrote: I had bilat, too, so no mammos here.  However, I do understand the anxiety.  Once we've been diagnosed, nothing is just routine anymore, is it?  I like the MRI, it's just lots more sensitive.  You can always decide when/if you want to have the other side done.  For now,  I will be thinking of you, hoping you get through tomorrow with the least amount of stress possible.  G.",
      "MessageIndex": 10,
      "PostDate": "15/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748380",
      "Title": "Help, Tomorrow another Mammgram at Stage III Shanagirl pupfoster1"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 9, 2009 09:36PM Gitane wrote: Kimber, Remember, your body chemistry is totally out of wack with what you are going through.  This really takes a toll on us emotionally and physically.  I found the effects were cumulative as your nurse said.  Every one of us is different in how this affects us, but we all need to take very good care of ourselves. The fatigue can be overwhelming as you have discovered.  I took time off from work and slept a lot!",
      "MessageIndex": 40,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744994",
      "Title": "I'm so happy to find you guys! kimber3006 tchmuzik"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 18, 2010 01:51PM Gitane wrote: This picture is overwhelmingly beautiful as was Caerli herself.  She has shown us the way.  ",
      "MessageIndex": 60,
      "PostDate": "18/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746933",
      "Title": "River is an Angel now. Fitztwins susanmary"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 6, 2009 09:46PM Gitane wrote: Hi Kimber, Welcome to this wonderful group.  You are about the same age as my daughter.  It breaks my heart when women are diagnosed so young.  However, your youth and strength will help you through this and your recovery will be faster, too!  I had mastectomies and AC every two weeks, too, so I know what it's like.  Like Bugs and Carol, I'm about 4 years out from my diagnosis.  I think it's natural to look back and wonder about \"what if\"..... but don't spend a lot of energy there.  We will never know the answers to our questions.  You couldn't have found a better place for support.  Come here often, we're here to help.",
      "MessageIndex": 17,
      "PostDate": "06/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744994",
      "Title": "I'm so happy to find you guys! kimber3006 tchmuzik"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 17, 2009 08:42PM Gitane wrote: Kimber,  All the advice stuff is covered by these wonderful people.  Just want to add my support and good wishes.  Doin' good getting those AC treatments behind you!  Yep, I was crazy on Decadron, too!",
      "MessageIndex": 61,
      "PostDate": "17/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744994",
      "Title": "I'm so happy to find you guys! kimber3006 tchmuzik"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 1, 2009 01:29PM - edited Nov 1, 2009 01:31PM by Gitane",
      "MessageIndex": 81,
      "PostDate": "01/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 1, 2009 01:36PM - edited Nov 1, 2009 01:36PM by Gitane I copied this from the American Cancer Society website.  It was updated in September 2009.  I had to delete it the first time I posted because I cut/pasted and just got junk.  So here is what they said: www.cancer.org/docroot/cri/con...  AMERICAN CANCER SOCIETY, DETAILED GUIDE: BREAST CANCER What are the key statistics for breast cancer? Breast cancer is the most common cancer among American women, except for skin cancer.  It is the second leading cause of cancer death among women after lung cancer.  The chance of developing invasive breast cancer at some time in a woman's life is a little less than 1 in 8 (12%). ",
      "MessageIndex": 82,
      "PostDate": "01/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 15, 2008 03:24PM - edited Dec 16, 2008 09:27PM by Gitane You obviously hit a soft spot in all of us mentioning those brownies. It was naive of me not to understand the marijuana aspect, but I'm learning.  Wishing you many good days. HUGS.",
      "MessageIndex": 26,
      "PostDate": "15/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725899",
      "Title": "I got my brownies! TripleNeg AnnNYC"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 27, 2013 02:59PM Gitane wrote: What a happy message you send us, Linda!  All the best to you; keep up that happy lifestyle; it must be just what you need.    Hugs, G.",
      "MessageIndex": 69,
      "PostDate": "27/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/785646",
      "Title": "Would love to hear from some long term Stage III survivors... lanagraves jenni__ca"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 21, 2008 06:41PM Gitane wrote: Courage Deb.  We love you.",
      "MessageIndex": 232,
      "PostDate": "21/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719376",
      "Title": "OK...the docs have a plan. AlaskaDeb LuAnnH"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 28, 2008 10:22PM Gitane wrote: You have been through the ringer, Deb.  I am hoping the worst is over and you will be restored to more calm and are able to rest up from this.  We love you and are holding your hand through cyber space.  Please know how much we all care.  Love, Gitane",
      "MessageIndex": 273,
      "PostDate": "28/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719376",
      "Title": "OK...the docs have a plan. AlaskaDeb LuAnnH"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 16, 2009 10:13PM Gitane wrote: I'm in Orange County.",
      "MessageIndex": 3,
      "PostDate": "16/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745481",
      "Title": "Anyone else in So.California? Mom3 worry0ct9"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 7, 2009 11:58PM Gitane wrote: Oh, PureE, this is just what I needed to hear tonight. Thanks!",
      "MessageIndex": 5,
      "PostDate": "07/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745052",
      "Title": "Interesting News Pure Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 8, 2012 09:20PM Gitane wrote: You sound so happy and healthy, Mamita.  I'm inspired.  Don't think I could start running at my age, but walking would help me.  I need to get going. It's good to read your post.",
      "MessageIndex": 2,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/788721",
      "Title": "The running room Mamita49 Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 15, 2008 03:27PM Gitane wrote: Many top oncologists feel this drug has lots of potential.  May it do its stuff for you, Watson!",
      "MessageIndex": 9,
      "PostDate": "15/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725936",
      "Title": "Started New Clinical Trial Watson hipchik47"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 16, 2008 01:38AM Gitane wrote: Just adding my thoughts and love to those above.  Healing hugs! Gitane ",
      "MessageIndex": 24,
      "PostDate": "16/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721221",
      "Title": "requesting your prayers and insight KiminJax TripleNeg"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 19, 2013 09:02PM Gitane wrote: Since you have had chemo, I'm assuming chemo is allowed. I didn't read \"chemo\" above, but for high risk patients, I can't imagine a trial without it. The only other question I might have is whether they would allow you to take more than 5 years of endocrine therapy. That may be a consideration for you. The SE's of Everolimus can be a bit rough. I think it inhibits your immune system. What is your oncologist saying?",
      "MessageIndex": 5,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/814737",
      "Title": "S1207 Clincal Trial: Anyone in this trial? peacestrength yogamama"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 21, 2008 11:51PM Gitane wrote: Stephanie and Shen,  This is so hard.  Sending all the love and prayers I can your way tonight. Deb,  Glad you felt up to a short post.  We are all holding you in our thoughts.   Gitane ",
      "MessageIndex": 51,
      "PostDate": "21/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721550",
      "Title": "Morphine all day everyday - Things are getting serious TripleNeg lewisfamily503"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 8, 2009 06:33PM Gitane wrote: marshakb,  no information to share.  Just lots of love and hugs. ",
      "MessageIndex": 3,
      "PostDate": "08/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727018",
      "Title": "PET/CT shows bone and liver mets marshakb nancyc"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 1, 2011 09:02PM Gitane wrote: Will be thinking of you tomorrow BlueCowgirl.  Take good care, G.",
      "MessageIndex": 10,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772334",
      "Title": "Can I just vent, please? BlueCowgirl GirlFriday"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 10, 2008 10:31PM Gitane wrote: emursen, Ask for the MRI. Other screening technologies are not nearly as reliable, especially if you have dense breasts.  Ask to have the MRI done at a good facility with someone reading it who has experience with breast MRI. This will help you to know more about why those microcalcs are there before they do the biopsy.  Biopsies are useless if they aren't fishing in the right spot, or if the cancer they may be fishing for is not a tight solid tumor.  Many times cancer can be diffuse and the biopsies that are not MRI guided might miss it altogether.  You want as much info as you can get right now.",
      "MessageIndex": 3,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/724241",
      "Title": "Should I request an MRI? ernursen dlb823"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 5, 2010 08:17PM Gitane wrote: Well, DCMom, a totally uneventful visit, way to go! Mary, Check in.  Hope all went well. ",
      "MessageIndex": 13,
      "PostDate": "05/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746252",
      "Title": "First Follow Up for 2010 DCMom weesa"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 11, 2009 11:54PM Gitane wrote: Kerry and Mamita,  One day I realized we were driving in the direction of the hospital where I was treated.  Got a wash of sadness over me that kind of took over and I started tearing up.  Wow.  Talk about feelings coming out of nowhere!",
      "MessageIndex": 28,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743618",
      "Title": "Loosing it... Pure Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 28, 2011 11:03PM Gitane wrote: Hi BlueCowgirl,  What an ordeal you are having.  I know how you feel when you say you are beyond crying to laughing.  There comes a point where there is no room for another level of stuff to deal with.  You just have to throw up your hands and go with what's happening because you have no choice. Been there!!!  I really hope the biopsy is just benign nuisance stuff and that your mastectomy goes well.  Mine was not that bad, honestly.  If you had told me beforehand I'd say that I wouldn't have believed it, but it was really O.K. It seems surreal right now, but you will get through this. Hang in there, and please come back to let us know how you are doing.  G.",
      "MessageIndex": 1,
      "PostDate": "28/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772334",
      "Title": "Can I just vent, please? BlueCowgirl GirlFriday"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 20, 2008 01:43AM Gitane wrote: I can't help you with clinical trial information, I'm sorry, but hopefully others will know more.  Rad001 was used by my oncologist as part of an earlier trial with Letrozole.  I understand the side effects were mouth inflammation and reduced white cell counts.  The doses were reduced when this happened.  ",
      "MessageIndex": 1,
      "PostDate": "20/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721485",
      "Title": "RAD0001 Clinical Trial - Cisplatin/Pacitaxel TripleNeg Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Oct 27, 2013 02:39PM Gitane wrote: Karina, I wish you didn't have the anxiety about the visits, but I know exactly what you feel. I have it, too. It's been years, but that deep emotional stuff roils up when it's time to revisit that setting and remember why I'm there. Hugs, and support going your way. G.",
      "MessageIndex": 8,
      "PostDate": "27/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/813217",
      "Title": "Struggling emotionally for a check up Karina Octobergirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 30, 2008 02:47PM Gitane wrote: Hi Janene, I'm just popping in to say I think your tumor being Progesterone Receptor positive makes it very probable that it is Estrogen Receptor positive, also. Even if it isn't, it is still very likely that you will be given an endocrine (hormone) therapy, because the Progesterone Receptor being positive indicates that the estrogen receptor pathway is still functional and endocrine therapy will probably work. The estrogen receptor status can be confirmed and if there is any doubt retested. You will not need a blood test, this is all done on the tumor sample in the pathology lab. I don't know if mistakes like these are made often. I don't think they are, but sometimes the communication between labs, doctors, and patients isn't what it should be. Isn't it frustrating that you and your treating physicians are made to wait? The waiting seems to be the hardest thing because it delays getting on with treatment. In any case, I think the results will indicate you can benefit from endocrine therapy and that's good.",
      "MessageIndex": 15,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706256",
      "Title": "FRom A 11 to Iv in 30 seconds Dragonfly-4 Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 24, 2010 08:56PM Gitane wrote: Hi Wallan,  This is nothing but good news!  6 years out is good; I sincerely hope to reach that mark in 2 years.  You inspire me!  Being able to hear well now must change so much in your world.  I'm very happy this surgery was able to do this for you.  It's also wonderful to hear that the depression is slowly beginning to lessen it's hold.  It takes time.  The exercise will really help move things along, too.  Your update has made my day. Thanks. G.",
      "MessageIndex": 6,
      "PostDate": "24/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748905",
      "Title": "Checking in wallan SoCalLisa"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 8, 2009 05:53PM Gitane wrote: You know PureE, the more I read over that thing I posted the more confusing it seems.  However, it seems to be saying that rads cuts the risk of any kind of recurrence in half after mastectomy.  At least that's how I read it.  That certainly makes rads an important treatment.  I don't know the answers to your questions, though. This article just doesn't give the good specific information that you need. If I can find anything more and it's less confusing than this one, I'll post it. Hopefully others know more and can help. G.",
      "MessageIndex": 45,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743370",
      "Title": "Random Comment Pure momtobkandsd"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Mar 28, 2010 08:57PM Gitane wrote: Hi there, Patsy.  I'm so sorry you and your family have been hit with so much.  It's especially hard to take when you are already down physically and emotionally.  Nobody's ready for this diagnosis, yet we all find our way.  The ability to share our ideas on this site really helps, so please come here often.  Upstaging during all the surgery and testing happens to many of us; it happened to me, too.  I did dose dense AC, too.  No fun, but worth it if it improves our prognosis.  Also, sending hugs from CA.  G.",
      "MessageIndex": 6,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750439",
      "Title": "New Diagnosis & Upcoming Chemo peverson robinri"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Mar 26, 2010 09:07PM Gitane wrote: I had the flu-like symptoms, very mild.  I also had sinus pressure and mild headache.  However, the burning sensation/tingling was not something I had for any of my infusions, even the first one.  I don't remember being told to expect this SE.  Everyone reacts differently to meds.  Could it be an allergy?  I will be interested in seeing what others say.  Hope this doesn't last long.  Maybe a call to the oncologists office???",
      "MessageIndex": 1,
      "PostDate": "26/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750367",
      "Title": "ZOMETA ? cubsfan cubsfan"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 12, 2010 01:27PM Gitane wrote: Feroza,  Thinking of you today and hoping that your tests were not too hard on you.  We will be waiting, too, and hoping for good results.  Hugs.",
      "MessageIndex": 18,
      "PostDate": "12/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746638",
      "Title": "Our new girl needs some support! Let-It-Be dee1961"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 26, 2012 05:30PM Gitane wrote: Happy 2 years to you, Kathleen.  I think it's normal to be still tired.  I know I was.  Exercise does help with fatigue and depression, especially the daily walking.  Lots of good thoughts going your way!",
      "MessageIndex": 7,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791152",
      "Title": "Today is my two year anniversary! kathleen1966 overjoyed4life"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 6, 2009 09:40PM Gitane wrote: My onc said after my chemo and bilat mast that he thought I shouldn't have rads.  He said there was a chance it would help me avoid local recurrence.  He also said there was a chance it would damage my ribs, heart, and/or lungs since they would be radiating the chest wall.  I had tissue expanders at the time, but the significance of that on reconstruction was never discussed, I don't remember why.  Seems like I should have been asking more questions about that but I didn't.   I got a second opinion at UCLA.  That onc said that getting rads in my situation was controversial.  He felt it was really impossible to weigh the pros and cons as too much was still being researched and unclear.  I also heard the 5 cm size as a cut off.  My tumor was multifocal over an 8 cm area.  Well, I didn't have rads, we'll see, I guess, if I made a good decision.",
      "MessageIndex": 25,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743370",
      "Title": "Random Comment Pure momtobkandsd"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 7, 2009 11:58PM Gitane wrote: I found this little blurb about rads in a 2007 Medscape article so I thought I'd just post it. http://cme.medscape.com/viewarticle/560671_7 Postmastectomy Radiation Therapy 2007 Do all patients require postmastectomy radiation therapy (PMRT) after neoadjuvant chemotherapy? In the International Journal of Radiation Oncology, Huang and colleagues will soon present data suggesting that the MD Anderson Hospital prognostic index can be applied to mastectomy patients. Dr. Buchholz reported the risk for locoregional recurrence following neoadjuvant chemotherapy and mastectomy at 19% of patients with local failure of pCR vs 28% of patients with residual cancer, suggesting that selection of patients for PMRT cannot be based on response alone.[22] With the addition of PMRT, the recurrence rate in patients with stage III disease declined from 20% to 9%, but did not significantly decrease in patients with stage II disease (which declined from 9% to 5%).[23] Among patients treated with mastectomy in NSABP B-18, none of whom received PMRT, the recurrence rate was 0% in patients with pCR but 10.5% in patients with residual cancer in which the cancer had not metastasized to the lymph nodes and 20.3% in those in which it had. However, most of these patients had T1 and T2 tumors,[24] suggesting that initial stage, degree, and location of residual disease should be used in determining the need for PMRT after neoadjuvant chemotherapy. I hate stats, but it looks like they have learned a lot about rads in the years after my diagnosis.  I bet they're much better at giving the rad treatments safely, too. ",
      "MessageIndex": 37,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743370",
      "Title": "Random Comment Pure momtobkandsd"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 9, 2009 10:08PM Gitane wrote: Barb, Hugs!  I'm sorry that you are dealing with this again after a short time.  Don't look back.  (easy to say, I know)  You did what you felt was right.  Now you will do so again.  It's all we can do.  Nobody has THE answer.  We do the best we can.  Please let yourself look to the future with the expectation of being healthy and having a great life.",
      "MessageIndex": 68,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743370",
      "Title": "Random Comment Pure momtobkandsd"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 3, 2011 08:56PM Gitane wrote: Feels good to get this news.  Very, very happy for you!!",
      "MessageIndex": 43,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762625",
      "Title": "first scan since dx tomorrow kimber3006 geewhiz"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 30, 2010 08:32PM Gitane wrote: Well, Kimber, it will have to be Monday, then.  I think it's pretty crumby that they make you wait, but I think it's a good sign, that the results are positive, as expected, and there's no big rush.  By all means, put it out of your mind and enjoy yourself.  Hugs, and if we don't hear before then, Happy New Year.  G.",
      "MessageIndex": 25,
      "PostDate": "30/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762625",
      "Title": "first scan since dx tomorrow kimber3006 geewhiz"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 2, 2010 09:56PM Gitane wrote: So happy to hear this.  I hate these things.  Glad they came back down.  Probably was the cellulitis.  Hugs!",
      "MessageIndex": 15,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747703",
      "Title": "Tms everyminute Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 8, 2010 03:52PM Gitane wrote: People want us to \"be positive\" and I think that is asking a lot.  I even tend to think the person who says it doesn't understand what they're saying if they haven't had BC.  However, this person would drive me crazy.  Nobody can convince me that  \"positiveness\" is a cure for BC.  As much as we all try so hard to take care of ourselves, we don't need someone else to try to make us feel guilty or inferior.  Glad I don't know Miss Perfect.",
      "MessageIndex": 1,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746483",
      "Title": "20 years NED? Shanagirl Diana63"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 28, 2010 09:12PM Gitane wrote: 'Till tomorrow's results are in I will be thinking of you.  G.",
      "MessageIndex": 2,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762625",
      "Title": "first scan since dx tomorrow kimber3006 geewhiz"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 24, 2008 10:30PM Gitane wrote: Fantastic questions.  Our system of studying and treating cancer is far from what we need.  Finding out about the treatments under consideration is very difficult, getting access to treatment, getting it paid for,  all of this is very poorly organized.  You are so right.",
      "MessageIndex": 1,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707980",
      "Title": "Clinical Trials zilpah ElaineD"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 29, 2010 05:20PM Gitane wrote: Well, shoot!  One more day.  I'll be checking on you tomorrow.  Hugs, G.",
      "MessageIndex": 15,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762625",
      "Title": "first scan since dx tomorrow kimber3006 geewhiz"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 9, 2008 03:34AM Gitane wrote: Fantastic, Watson. This is good!",
      "MessageIndex": 23,
      "PostDate": "09/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708709",
      "Title": "My New Plan Watson jansdaughter"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 12, 2011 04:46AM Gitane wrote: You are lookin' good, everyminute.  May you have many, many more wonderful days ahead.!",
      "MessageIndex": 11,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/771450",
      "Title": "3 years ago today everyminute NancyD"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 21, 2009 02:46AM Gitane wrote: delaine and friends,  I hope you don't mind if I jump in here with a comment.  Way back when (this time of year, 2005) I had adriamycin/cytoxan dose dense x 6.  Ya, it was lots of fun. I was treated with Emend and it was very helpful, and drank lots of fluids. However, I wanted to share with you that the very best drug for me to take for the queeziness/nausea was Kytril.  As the infusions continued I needed something that would help me.  I tried some others, but the Kytril really worked much better than anything else.  What didn't work, and actually made it worse, was Compazine (is that how it's spelled?)  Anyway, I have to say I'm out of the loop with the new drugs, there may be much better ones now, but it did the trick for me. G.",
      "MessageIndex": 29,
      "PostDate": "21/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738978",
      "Title": "Starting chemo September 2009 krcll sanaisa"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 11, 2009 03:18AM Gitane wrote: You and baby are without doubt a tough combo!  Don't worry about no SE's, it means nothing. Glad you are feeling good!",
      "MessageIndex": 11,
      "PostDate": "11/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745177",
      "Title": "Baby Update and Personal Update Pure SpunkyGirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 19, 2009 06:53AM Gitane wrote: Hi delaine,  Since I can't seem to get you over to the ILC board I came looking for you here with all your IDC chemo pals.  Thanks so much for your good wishes.  I really appreciate it.  I'll be checking on you.  Hugs, G.",
      "MessageIndex": 19,
      "PostDate": "19/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738978",
      "Title": "Starting chemo September 2009 krcll sanaisa"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 27, 2010 04:53AM Gitane wrote: Albino Leopards, what else?",
      "MessageIndex": 4,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747419",
      "Title": "ok.. i'm an idiot apple Beverly11"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 29, 2010 05:35AM Gitane wrote: Just jumping in here to say, \"HI\".  I was treated for ILC, too, when I was 57 years old.  I didn't use any relaxation CD's, but I'm sure they would have helped me.  The surgery thread sounds like a great idea, and if you have ILC questions there are many helpful ILC sisters on that thread.  Hugs. G.",
      "MessageIndex": 7,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762599",
      "Title": "Another January Surgery crog234 marie5890"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 22, 2010 03:47AM Gitane wrote: I'm really sorry to hear about your dad.  Even if you were not close, it's difficult.   My father died of Alzheimer's, too, Barb, just after my 3rd AC treatment.  Holding you close in my thoughts tonight.  G.",
      "MessageIndex": 8,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747133",
      "Title": "My Dad Passed Away Yesterday Shanagirl Frankie_"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 20, 2012 11:31PM Gitane wrote: Yea. on the fatty liver.  (That doesn't sound right, but you know what I mean.)  It ain't mets 'til they prove it.  So happy the support center is helping.  I'm keeping everything crossed here for a cancer free PET and bone biopsy.  Whatever the news, we all are here to support you.  Thanks for updating. Hugs.",
      "MessageIndex": 24,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/790566",
      "Title": "moving on to stage IV orlandpark1965 Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 16, 2012 03:19AM Gitane wrote: Hello orlandpark1965, You are an ILC sister and a stage 3 sister.  We are here for you.  There are so many things to say and yet none will turn this around right now.  Just know we care.  I hope you will accept a huge hug and hold on to the thought that the overwhelming feelings you are having right now will pass; not all at once, and it will take time, but you will feel better.  I say this knowing you are probably thinking, \"She's not stage 4.\"  That's true, and maybe I'm out of line here, but I wanted to respond. There are ILC women on the stage 4 board.  lulubee, lovinmomma, Frapp, CoolBreeze, BetteE, and alesta29 are some who post there. ILC treatment is not really different than IDC, though, so the stage 4 women will have lots of information and support to give no matter their type of BC.  I hope your oncologist will meet with you soon and get your plan in motion.  That will help a lot I think.  Sending sincere warm hugs your way.  G.",
      "MessageIndex": 12,
      "PostDate": "16/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/790566",
      "Title": "moving on to stage IV orlandpark1965 Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 27, 2010 09:19PM Gitane wrote: Well, I have to admit, Kerry, like so many others I look for your posts. I know how scary it is when the path reports are full of dire things and Dr. Google tells you how doomed you are.  Many women here on BC.org gave me hope. It's a gift you really can't get elsewhere.  It has to come from others who are living with the uncertainty.  You have a way of giving comfort and realistic hope.  Very special!  Hugs, G.",
      "MessageIndex": 23,
      "PostDate": "27/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762526",
      "Title": "Two years ago.... KerryMac geewhiz"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 2, 2008 02:06AM Gitane wrote: Blather away. Try not to stress??? ya.... right! We all should be able to control our minds so well. Waiting with you, too. Lots of hugs goin' out to you.",
      "MessageIndex": 11,
      "PostDate": "02/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706593",
      "Title": "OK...I know this is so predictable, but I'm spooked! AlaskaDeb deborye"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 28, 2008 06:45PM Gitane wrote: May warm breezes blow across Denial Island this week.  Thinking of you. Gitane ",
      "MessageIndex": 19,
      "PostDate": "28/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720249",
      "Title": "Scans Today LuAnnH heatherpalmerton"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 20, 2009 09:57PM Gitane wrote: \"...extremely well.\"  I like the sound of that.  It's a such a warm feeling to hear the onc say you are doing fine, like a knot inside that gets untied.  Good news!",
      "MessageIndex": 6,
      "PostDate": "20/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744248",
      "Title": "6 month followup news BonnieK clariceak"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 5, 2009 02:58PM Gitane wrote: apple,  I would just like to say that our minds can only accept so much at once.  Ultimately our minds seem to know what is best for us, and we are wise to take the steps we are ready to take as long as we seek the counsel of the experts and people we can trust. That means, of course, getting the treatments we need.   Being gentle on ourselves, denying what we are not ready to explore yet, absorbing our waking hours with the stuff of life, our music, color, relationships,.... This is what makes us strong, what makes us human.  I like your story about the surgeon and anaesthesiologists' conversation and their reaction to being overheard.  Thank you for sharing that.",
      "MessageIndex": 13,
      "PostDate": "05/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/726756",
      "Title": "a further introduction apple everyminute"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 24, 2010 08:44PM Gitane wrote: LindaLou,  I take such strength from reading your posts, and I know others do, too.  I'm so happy that this scan confirms that you're NED.  Letting go of the worry is something we all have to work toward.  Taking action to move beyond all the cancer stuff is what I need to do, too, and I work at it every day.  Congratulations on losing the weight, getting healthy, and living as fully as you do.  I'm very, very glad you come here and share with us. It helps us all.  Thanks.",
      "MessageIndex": 12,
      "PostDate": "24/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/755785",
      "Title": "CT Scan Results are in! LindaLou53 SusieMTN"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 26, 2008 07:38PM Gitane wrote: MsVirgo, Hello again from Calif. I just wanted to reach out once again and hold your hand. Think of us sitting there with you, just talking, trying to share some of the weight of this the best we can. There is nothing fair about what is happening. You have the right to every one of your feelings. These powerful emotions are our lifeline at times. Anger, fear, sadness, feelings that overwhelm us, are ways for us to bring down the intensity so we can get on with our life. Crying is such a necessary release. Sometimes the treatments make the emotions even stronger. Losing the estrogen in your body has profound effects. I was very sad, aching all over, and was very disturbed by the onset of each hot flash, almost like it took me over before I could pinpoint what was happening and calm down. All of this in the midst of the stress of having bc can be so hard. Knowing what is going on, though, that the treatments are causing some of those feelings, too, is important. Your sleep gets messed up, too, just when you need it most. Be good to yourself and go gently forward. We are here to listen, come again. Gitane",
      "MessageIndex": 32,
      "PostDate": "26/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/705266",
      "Title": "Here I Go Again? msvirgo828 redheadace1"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 8, 2008 10:27PM Gitane wrote: Interventional radiology biopsy. I don't even know what that involves, but, course you are afraid. Fear seems to be like a cloak we wear. No advice. That would be way beyond me. Only love and caring. I am sending you this from the other side of the U.S., but I want you to feel it up close. It's meant that way. Come back on line often, talk to us. Warm hugs tonight.",
      "MessageIndex": 2,
      "PostDate": "08/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/705266",
      "Title": "Here I Go Again? msvirgo828 redheadace1"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 11, 2014 08:12PM Gitane wrote:",
      "MessageIndex": 12,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/826086",
      "Title": "5 Years Ago Today............ pupfoster1 Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 31, 2012 06:51PM Gitane wrote: Hi LindaLou, I always learn from your posts.  Thanks for letting us share your experiences.  You do have a way of communicating that helps us all.  Your quilts are beautiful.  G.",
      "MessageIndex": 4,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791380",
      "Title": "Annual Update - LONG ONE...but Still Good News! LindaLou53 NancyD"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 2, 2008 04:17PM Gitane wrote: I just read yesterday that about 25% of Her2 negative will have mets that are Her2 positive.  That's a lot. From what I'm reading here it can switch back and forth.  Makes you think the Her2 drugs might work on more people than we think.  Lapatinib is being used in a clinical trial in Italy right now with Her2 negative stage 4 just to see if it helps, even though it's a Her1 and Her2 inhibitor.",
      "MessageIndex": 19,
      "PostDate": "02/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708373",
      "Title": "New Options Watson mthomp2020"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 18, 2008 10:51PM Gitane wrote: I have been feeling very fatigued, too.  I'm three years out from my diagnosis and still need tons of sleep and lack energy.  I will admit, though, that I could exercise more than I am doing now.   I have been blaming it (fatigue) on the battering the surgeries and treatments have caused to my body and the Femara.  Frankly, I don't expect it to get any better than this if it hasn't done so by now.  My onc acts like it's no big deal.  I am so glad to be alive, the fatigue is something I will adjust to. The thyroid information is interesting, though, I'll look into it.  Thanks!",
      "MessageIndex": 16,
      "PostDate": "18/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/719657",
      "Title": "Still have the fatigue after 2 years. Mary-Lou Molly2013"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 8, 2013 05:36AM Gitane wrote: Those years between dx and the milestones are really the time we learn to live it seems.  You are so kind to come here and inspire others.  Congratulations and many more years of good living.  Hugs,  G.",
      "MessageIndex": 4,
      "PostDate": "08/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/804354",
      "Title": "Lucky number 8. lkc hopefour"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 8, 2009 06:45PM Gitane wrote: I chose a bilateral mastectomy with expanders/implants.  Only one side was prophy, the other was necessary because of the nature/position of the cancer.  I never regretted it.  I was otherwise healthy, too.  If your oncologist is recommending it, I would seriously consider it, as long as you agree with his reasoning.  Second opinions and soul searcing are in order, of course.  Good luck. G.  ",
      "MessageIndex": 1,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/738657",
      "Title": "Prophylactic bilateral mx after \"successful\" treatment? thegoodfight Daudine"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 3, 2009 12:40AM Gitane wrote: Oh, waterlily.  You are way overdue for some good news like this.  I think of you daily and wonder if you are doing O.K.  May this be the start of some very good times.  LOTS of HUGS!",
      "MessageIndex": 3,
      "PostDate": "03/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726656",
      "Title": "Abraxane/Avastin may be working waterlily Reneepals"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 7, 2008 02:13PM - edited Jun 7, 2008 02:14PM by Gitane EXAIMA, No words can help, I know, but it's all we have here. Love to you and your family.",
      "MessageIndex": 22,
      "PostDate": "07/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706848",
      "Title": "My mom is an angel now EXAIMA omo"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 3, 2009 02:53PM Gitane wrote: Hi Sea,  Your MRI angel reminds me of mine.  She also was compassionate and kind.  I'm so glad she was there for you when you needed her.  I agree with nella48, they seem to always be there when it matters most!!  That MRI will help you know what your next steps are.  Let us know what's what.  G.",
      "MessageIndex": 26,
      "PostDate": "03/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736584",
      "Title": "When do I cry? seaofhope one-L"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 2, 2009 09:25PM - edited Jul 2, 2009 09:29PM by Gitane Hi Sea,  From what you have written here about the find needle biopsies: 1.   There are some cancer cells in the under arm area, in the tail of the breast.  They are probably in a lymph node.  They don't say how much they saw, just \"cells\" which doesn't tell you much about size.  This is very limited information so far about your nodes. 2.  The \"mass\" biopsy, contains some IDC.  This is the most commonly found kind of breast cancer.  Cancer cells are outside the duct so it's called infiltrating. There is no information about how much they saw. Again, this doesn't tell you much about size, so you really have no idea about how much invasive cancer is there.  It says the cells are moderately differentiated; this means they are Grade 2 or intermediate grade cells. 3.  Behind the areola they found an extremely tiny focus of IDC, also Grade 2.  Tiny is good, very good. 4.  In the top outside quarter of the breast they found some cancer cells, and calcifications inside the duct, also Grade 2.  This means the cancer is contained and hasn't spread outside the duct.  This is good.  Again they don't say anything about size.  The other things they found like fibrocystic change, adenosis, etc. are not cancer. These fine needle biopsies give you very preliminary information.  What are your next steps? ",
      "MessageIndex": 21,
      "PostDate": "02/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736584",
      "Title": "When do I cry? seaofhope one-L"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 21, 2008 01:30AM Gitane wrote: Wow, Deb. We don't want to believe that doctors can make these mistakes when the stakes are so high.  How in the world do we trust them after this, yet what choice do we have? You would think a \"team\" of surgeons would be backing each other up during the surgery and that this couldn't happen. At the very least the follow up should have caught this much sooner, before you endured so much.  Hold on to your courage, Deb, but let the temper fly!  This is just unbelievable.  I am sending you all the warm hugs I can.  Love, Gitane",
      "MessageIndex": 64,
      "PostDate": "21/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 24, 2008 12:40AM Gitane wrote: It's hard enough to work the system when you feel good. When you feel like crap it's more than you should have to do, that's for sure.  You and your husband have climbed mountains in dealing with this.  U of W sounds like a real possibility here; a date you can count on in the NEAR future.  No such thing as TMI, if you can't talk about puking to us, who understand it only too well, who's left?  Thanks for letting us know what's happening, we're right there with you.  Huge HUGS, Deb.  ",
      "MessageIndex": 101,
      "PostDate": "24/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 9, 2008 09:15AM Gitane wrote: You are in our thoughts, Deb.  Lots of love.",
      "MessageIndex": 411,
      "PostDate": "09/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 3, 2008 11:30PM Gitane wrote: Sending you lots of love, Deb.",
      "MessageIndex": 402,
      "PostDate": "03/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 27, 2010 04:13PM - edited Aug 20, 2013 06:16AM by Gitane shelbytroy,  You need to rely on what your doctors are telling you.  They have the experience to put it all together for YOU.  So, that said, here's how I interpret what I have found through my research. What does an intermediate Oncotype indicate for an ILC patient?  It puts us in a category where they don't know what will/won't help us in terms of treatment.  It is NOT HELPFUL.   1.  Untreated, an intermediate has about the same prognosis as a high.  It's our \"possible\" response to endocrine therapy and lower rate of proliferation that separates us out as having a better outcome. (Our relapse may be later rather than in the first 5 years as is more frequent for high)  Not everyone with ER+ BC will respond to endocrine therapy and those who respond initially may become resistant later.  This is especially true for Tamox.  which may not be as effective as AI's. 2.  Oncotype scores, by their own research, are not prognostic beyond 5 years, and slow growing tumors (like ILC usually) are more likely to relapse after that time frame. 3.  ILC does not necessarily act like IDC.   Oncotype may not be as accurate for ILC, especially in terms of response to treatment. In fact, ILC has never been studied in terms of Oncotype and response to treatment.  Some research indicates that classical ILC (Grade 1) is less likely to have a pathologic complete response to chemo.  This does not mean that ILC patients are not helped by chemo. So, where does that leave us?  Traditional prognostic factors indicate that Grade 2 tumors greater than 1 centimeter should be offered chemo. even if the nodes are negative.     ",
      "MessageIndex": 6,
      "PostDate": "27/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/761205",
      "Title": "Onca type 25 - what to do? shelbytroy12 IllinoisNancy"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 27, 2010 01:22AM Gitane wrote: I know these years have not been easy for you.  We have been fortunate to have you with us, helping us and supporting us along the way.  Congratulations on this landmark day!  May you and your family enjoy a happy, peaceful, loving future together!  ",
      "MessageIndex": 3,
      "PostDate": "27/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/757273",
      "Title": "5 years out lexi4 stacys_mom"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 31, 2008 11:46PM Gitane wrote: Well, Heather, This isn't the motherly advice you would like to hear, but here goes. I'm old, 60 years old, and reading about \"prom night\" brought back many memories for me of my little girl's happy days here at home. She's just turned 36 years old this month. She's living on the east coast now, so far away. I'm on the west coast far south of your storm tonight. Yet your story brought us all closer together somehow. I know this has nothing to do with the reason you wrote, or the help you seek. I just wanted to tell you that you brought some memories back home for me. I'm sitting here in her old bedroom right now writing this. Thanks. Amidst the melt down, the freaking out, the tears, memories are being born. If you can, enjoy them and hang on to them. These are the stuff of life!",
      "MessageIndex": 3,
      "PostDate": "31/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706552",
      "Title": "Help I need your motherly advice heatherpalmerton heatherpalmerton"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 26, 2008 06:19PM Gitane wrote: Just another person in the virtual waiting room, here.  We are all holding cyber-hands right now and sending strong healing vibes to you, Deb.  I wish we could do more.   Gitane ",
      "MessageIndex": 171,
      "PostDate": "26/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 7, 2010 02:34PM - edited Aug 20, 2013 06:21AM by Gitane Kathleen,  I think it is possible to have your slides sent to another pathologist,  not in your same network/facility, to have them re-read.  I think you could start by calling a major facility, such as M D Anderson in Texas or Sloan-Kettering in NY, and telling them what you want to do, ie. have the slides and reports reviewed and get a second opinion.  They will be able to guide you.  I think all insurance will pay for a \"second opinion\", but I'm not sure how it works if treatment has already begun.  It might just be to help decide on treatment.  Anyway, I don't think it is too late to get another opinion, or even change oncologists.  I hope others who know more about this, and there are many on this site, will help you.  Just keep asking your questions, on other threads, until you get your answers.  Don't feel that there is something wrong with you for wanting to know more.  Your health is very, very worth following up on.  It seems like we need to give ourselves a crash course in breast cancer when we are least able to cope with stuff.  We have been where you are, and we understand.  Write to us, ask, and ask again.  Hugs.",
      "MessageIndex": 8,
      "PostDate": "07/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/761477",
      "Title": "Need emotional support kathleen1966 Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 19, 2008 11:20PM Gitane wrote: LuAnn,  Your letter is what is needed, full page spread in every major publication.  If we want breast cancer awareness, then let's make people aware of the reality.   I watched a public television program yesterday where the organizers of a huge breast cancer walk were presenting information about BC.  These were women were representing the Komen foundation. Even they seemed afraid to say how many women will get bc and didn't even come close to explaining what a diagnosis means for the woman and her loved ones.  We can't even get the real picture out there when represented by women with BC. The same seems true of many books written by \"survivors\".  I just don't see a realistic presentation of breast cancer anywhere.  Your letter rings brave and true!",
      "MessageIndex": 23,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721482",
      "Title": "Long, but need your opinion LuAnnH mom2acat"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 29, 2011 11:07PM Gitane wrote: Anna, This is such sad news.   AZKIM if you read this, please know we send all our strength and love to you.  G.",
      "MessageIndex": 3,
      "PostDate": "29/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764136",
      "Title": "So Sad About My PM Buddy amlg1 amlg1"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Apr 12, 2009 12:54AM - edited Apr 12, 2009 12:56AM by Gitane These are some studies (mostly just ATAC) that look at response to endocrine therapy by ER, PR, HER2 status.  People are not sure about this yet, even though the study was done a while back.  The controversy seems to be that PR- may or may not mean more growth factor activity for some tumors.  They don't seem to be able to sort out the effects of this on prognosis without treatment, so they don't know what is or isn't related to the treatment.    http://jco.ascopubs.org/cgi/content/full/26/7/1059   http://jco.ascopubs.org/cgi/content/full/24/9/1482   http://www.unboundmedicine.com/medline/ebm/record/16234518/full_citation/ Retrospective_analysis_of_time_to_recurrence_in_the_ATAC_trial_according_to_hormone_receptor_status: _an_hypothesis_generating_study_   On the last one, click on the \"full text\" tab to see the article.",
      "MessageIndex": 11,
      "PostDate": "12/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/731537",
      "Title": "Stage 3 ER+PR-HER- Survivors aly Jane_M"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 29, 2012 08:00PM Gitane wrote: Jackie,  Seems like it's hard not to think about the sad along with the happy.  All the same, congratulations on this special anniversary.  I'm happy for you.  G. PlantLover,  I like that proverb. Thanks. ",
      "MessageIndex": 11,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781814",
      "Title": "2 Year Cancerversary! jdootoo Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 17, 2008 09:26PM Gitane wrote: Hi Monique, Love and hugs tonight. I'll be thinking of you, hoping for the best. Gitane",
      "MessageIndex": 2,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707515",
      "Title": "Need an angel to ease the pain Monique42 LumiPojo"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 19, 2009 07:15PM Gitane wrote: Goin' home.  It's so nice to hear.  Thinking about you, Deb.   Traci, Thanks. ",
      "MessageIndex": 448,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 17, 2014 07:10PM Gitane wrote: jenni_ca, YATCOMW, notagaintoo,  Huge congratulations and thank you for coming here to share your wonderful news.  Hope to be joining you in another year or so!  Hugs,  G.",
      "MessageIndex": 60,
      "PostDate": "17/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/815407",
      "Title": "Stage III Cancer Survivors .... 10+ Years and Out AlwaysHope karen1956"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Apr 26, 2009 01:55AM Gitane wrote: I have read that it would take between 300 to 600 slides to sample an entire breast.  It is just too time consuming and expensive and labs don't do it.  I think standard practice is to make multiple slides of the primary lesion and surrounding tissue, sample the skin, nipple and areola, then take random samples from the other quadrants of the breast.  Multiple sections are also done on lymph nodes.  Slides are kept at the pathology dept. for 10 years in most hospitals.  Frozen sections are not routinely kept except as part of research protocols.  I think that's how it is.  However, others probably know more.  Seems that having more tissue stored would be to our benefit, especially for future biomarker testing for new treatments or genetic studies.",
      "MessageIndex": 5,
      "PostDate": "26/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733050",
      "Title": "Help! Need 2nd pathology opinion who's the best pathologist/lab? laughlots Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 2, 2012 02:11PM - edited Feb 2, 2012 02:11PM by Gitane",
      "MessageIndex": 29,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781814",
      "Title": "2 Year Cancerversary! jdootoo Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Mar 26, 2008 01:07AM Gitane wrote: Was just reading tonight, and there it was, the words to Amazing Grace. The song has always been in my life, but reading the words tonight... they just seemed so true, and right, or... I don't know how to express it. Anyway, I then saw that your name was there, Tender. I'm very glad you have come back to us.",
      "MessageIndex": 69,
      "PostDate": "26/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702319",
      "Title": "Where is Tender ? riverinerabbit Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 27, 2010 07:21PM Gitane wrote: In relation to Oncotype,  I like the way Genomic Health has placed the relevant information about their OncotypeDX test right on their website.  They have links to the important studies they have participated in.  The two studies on node negative Tamox. treated patients are B-14 and B-20, in B-20 they also looked at chemo.  This is from the NEJM, a good overview. www.nejm.org/doi/pdf/10.1056/N...  There are presentations made at the ASCO and SABCS events and you can get information by reading the abstracts of smaller studies that have been done.  This is an abstract presented in 2005 at ASCO by the same author as the above article.  He used Oncotype to score patients who did not have any treatment (no Tamox).  You can see that in these patients, intermediate and high had the same survival. http://www.asco.org/ascov2/Meetings/Abstracts?&vmview=abst_detail_view&confID=34&abstractID=34214 Thank you for asking about me.  I had neoadjuvant chemo (AC, 6 rounds).  I responded very well.  I am taking Femara and getting Zometa infusions every 6 months.  So far I am fine.  I know how hard this is.  You are being very careful in your decision making which I think is fantastic.  I hope I have helped you and not frightened you.  It's so hard to find a balance.  All the best.  G. ",
      "MessageIndex": 8,
      "PostDate": "27/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/761205",
      "Title": "Onca type 25 - what to do? shelbytroy12 IllinoisNancy"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 7, 2008 01:16AM Gitane wrote: MUGA scan measures your left ventricle (sp?)  ejection fraction, meaning, I think, how well your heart is pumping out the blood.  A radioactive substance is injected before, given time to circulate, then you are placed on a table and slid into a doughnut type thing where measurements are taken.  This is a very unscientific way to explain it; I'm sure you would be able to find more info about it if you google it.",
      "MessageIndex": 3,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723972",
      "Title": "Adriamycin - Whar are everyones side effects jobu TPPJ"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 11, 2009 06:35AM Gitane wrote: I was in the drugstore picking up my prescription, wearing a wig, not that comfortable in it.  In walks a beautiful woman, bald as you please, with her two daughters.  Nobody in the store batted an eye.  I was in awe of how she seemed so unselfconscious and looked so nice.  She just had jeans, a t-shirt, no make up or any jewelry.  Simply herself in all her glory.  That night I kept looking in the mirror thinking, \"I could do that, I could do that...\"  Nope, never had the courage.  Of course, I'm no beauty. Old and gray actually. Old enough to know better.  I really don't think other people care, and yet I always had my head covered.  Nobody ever called me, \"sir\", but I know I got some strange looks due to my less than wonderful head coverings.  ",
      "MessageIndex": 22,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743547",
      "Title": "Got called \"Sir\" this morning... Christine2000 americanpinay"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 12, 2008 02:56PM Gitane wrote: Miracles do happen.  Thank you for sharing this happy news.",
      "MessageIndex": 5,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724304",
      "Title": "Totally Great News! luvtotravel JerseyMom"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 20, 2008 01:08AM Gitane wrote: Wow, what a roller coaster. ((((((HUGS))))))) We collectively hold your hand as you live through the latest bc events. All our love and strength go out to you. Stay connected here, and let us help if we can.",
      "MessageIndex": 14,
      "PostDate": "20/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/706982",
      "Title": "Ready To Hear PET results LongHornSurvivor crazydaisy"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 1, 2012 07:22PM Gitane wrote: Charlotte, Your post is so eloquent and speaks from the heart.  Thank you for this.  May you have a long cancer-free life! ",
      "MessageIndex": 13,
      "PostDate": "01/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797000",
      "Title": "Grateful! -Celebrating My 3 Year Anniversary as a Survivor CharlotteMe hmh23"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 17, 2010 12:19AM Gitane wrote: SpunkyGirl,  Big warm cyber hugs going out to you tonight. You are an experienced campaigner, so I'm sure I'm not telling you stuff you don't already know.  However, I'll say it anyway.  You absolutely must take time away from your responsibilities to reconnect with yourself.  Put yourself first, Bobbie, and don't feel you are being selfish when you do it.  You can't keep on keeping on at the rate you are going.  I know that's easy to say and very hard to do.  I wish there were concrete ways we could help out.  Just remember, we are here and we care.  ",
      "MessageIndex": 15,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748393",
      "Title": "I Get \"Wigged Out\" SpunkyGirl Bugs"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 13, 2013 01:56PM Gitane wrote: Congratulations, Bobbie.  This is such an awesome anniversary.  Thanks for sharing it with us and inspiring the newbies!  ",
      "MessageIndex": 19,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/810712",
      "Title": "Sweeeet Seven SpunkyGirl YATCOMW"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 14, 2008 03:57AM Gitane wrote: There is nothing like getting away to change our frame of mind and mood. This will be good, I can feel it in your words. Have a wonderful trip.",
      "MessageIndex": 11,
      "PostDate": "14/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707262",
      "Title": "A Breath of Fresh Air JoyRebecca Traci-----TripNeg"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Mar 3, 2011 10:27PM Gitane wrote: What a scary thing these wacky blood test results can be.  I'm sorry the calcium isn't behaving, weesa.  Looks like DCMom has some pretty solid \"Not-to-Worry\" information there.  Let us know what happens.  We'll be checking back!  ",
      "MessageIndex": 19,
      "PostDate": "03/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765669",
      "Title": "gosh...what next... weesa weesa"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 11, 2009 11:57PM - edited May 11, 2009 11:58PM by Gitane Hi bohemiansol,  I think you will learn more if you put your post in the Stage 4 forum.  The ladies there are wonderful.   Going there will help you get the advice and support you seek.  I wish I could say more, but I don't know enough.  This is a shock for sure. We all go to the internet to find out what's what, but it can sometimes be frightening and not too helpful because it is so hard to know what applies to you, especially when a lot of the information is old or not from reliable sources.  Be cautious, don't frighten yourself unnecessarily.  I will say that the diagnostic process is always slow, or so it seems. On the other hand, more information is better for all concerned.  I will keep you and your sister in my thoughts and check back to see how you are doing.  ",
      "MessageIndex": 1,
      "PostDate": "11/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/734023",
      "Title": "stage 4 breast cancer bohemiansol Katalin"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 21, 2010 09:22PM Gitane wrote: Thanks for sharing your happiness with us.  Congratulations, Kimber, and may you have many, many more happy anniversaries. G.",
      "MessageIndex": 23,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747079",
      "Title": "Today is my wedding anniversary kimber3006 Claire_in_Seattle"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Mar 26, 2009 01:52AM Gitane wrote: LynnW,  I'm very glad to see you posting here.  I very much understand how you feel the need to gain distance.  It would be nice if we could at least depend on the professional relationships to be supportive, but that's not always the case.  My PCP is like yours.  I have had several conversations with him about how he might help me if/when the time comes and I need him.  He doesn't shy away from this conversation.  His mom had BC, too.  That reassures me.  I know he will help. Reading comments on this thread has caused me to look back at my relationship with my oncologist. He talked down to me, and downplayed every aspect of my case at our initial meeting, exaggerating the survival stats to look unbelievably great.  I knew better, and I lost trust over time that he would be truthful.  I confronted him with this eventually.  The more I asked specific questions, the more he started saying, \"There's no way of knowing.\"  At least I do believe that.  I have received good care from him, but there isn't much of a relationship otherwise.  paige-allyson,  Like your oncologist, my oncologist would tell me that my \"anxiety over this\" was not helping, and that I needed to move on.  Honestly, my \"anxiety over this\"  (this was, after all, my life we're talking about) was huge. No doubt I do need to get a grip!  Too bad there is no magic way to do this.  My pace seems to be much slower than most, the adjusting and adapting part.  I am, after all, me. So I do what I can in my own way.   Each day I learn and change.",
      "MessageIndex": 28,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/731187",
      "Title": "patient-doctor relationship: your thoughts and experiences paige-allyson KerryMac"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 10, 2009 10:08PM Gitane wrote: Hi there, azs40.  You are almost a veteran rather than a newbie.  I'm sure you've got lots to add here, and we welcome you with open arms.  I didn't find this site right away, wish I had, but I'm so glad to be here now.  It's great that you are posting now, we'll be hearing from you often, I hope.  G.",
      "MessageIndex": 13,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745185",
      "Title": "Introducing Myself, Finally... azs40 Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 21, 2012 01:54PM Gitane wrote: It sounds like your appointment went well.  Wonderful that your daughter is there to help listen and give her slant on things.  A second opinion sounds like a good idea, too.  Thank you for letting us know your news.  I am keeping you in my thoughts.  Hugs, G.",
      "MessageIndex": 54,
      "PostDate": "21/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797357",
      "Title": "Cancer came back Mamita49 hopefour"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 21, 2011 07:04AM Gitane wrote: Hi Moving_forward,  Welcome. It helped me to be super gentle to myself, give myself permission to learn to live this new life without any guilt or expectations.  The transition takes time, and we are changed.  Femara caused my body to hurt all over, it caused depression, it made me tired.  All of that while healing from the surgeries and chemo and learning to live with a cancer diagnosis.  I think talking to others who were going through this (as we do here on this site) would have helped me, but at the time I didn't do it. I did exercise, though, and swimming especially was helpful.",
      "MessageIndex": 4,
      "PostDate": "21/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/769241",
      "Title": "Tips for Transitioning from Active Treatment Moving_forward Moving_forward"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 13, 2009 02:03PM Gitane wrote: Cheryl,  My receptors are just like yours. ER+PR- Her2-.  I've been on Femara 3 years and 8 months, but who's counting.  I don't like all the SEs, but I'd never stop taking it.  If there is any possibility it will help me I'll take it.",
      "MessageIndex": 5,
      "PostDate": "13/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/740251",
      "Title": "Receptors all back need help ... victoriasecret Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 26, 2013 12:10AM Gitane wrote: I really hope Tom Gentile of GE (and the powers that be in his company) heard you Mary.  You really are speaking for all of us and we appreciate it.  Those of us with ILC who had humungous tumors that were not \"seen\" on our mammos and ultrasounds are pretty sensitive about this.  Yes, the best machines in the world do us no good if they aren't available to us and/or if the technicians and doctors don't use them well.  How in the world would he expect the patients themselves to force this to happen?  If a giant like GE can't do it.......    Thanks for getting in there and giving our pitch for us!  ",
      "MessageIndex": 7,
      "PostDate": "26/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/805062",
      "Title": "GE Medical Equipment mary625 KSil"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Mar 11, 2008 02:37AM Gitane wrote: Hi Deb, Comes down to the simplest things sometimes. I dropped a little ceramic light house one day, bent down and saw it was broken, and cried about it for an hour. Just the trigger I needed to let it out. No logic there, but there never is. So you got a new hairstyle, I fixed my light house, and on we go.",
      "MessageIndex": 43,
      "PostDate": "11/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/700832",
      "Title": "OK....How about a laugh at my expense.... AlaskaDeb footprintsangel"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Apr 30, 2008 10:45AM Gitane wrote: Desi, Let us know what happens Friday. It sounds like there is a lot to discuss yet, and perhaps more scans and surgery before you can start drawing any conclusions about this. Where in S. CA? Gitane",
      "MessageIndex": 8,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/704769",
      "Title": "Question about my path report S3K5 SpunkyGirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Apr 21, 2008 03:56PM Gitane wrote: Remember, your emotions are out of control right now. You can't control them like you could when you weren't under so much physical and emotional stress. This is new territory for your body and brain. Be good to yourself. Get lots of sleep, go slowly, do only what you feel you can, cry when you need to, give and get all the hugs you can. I was told so many important things that I couldn't take in or understand, yet with time I look back and understand what people meant. There is a time when you will begin to understand what all this will mean for you, but it isn't during this early period. Now you just have to have faith in your ability to meet each day's challenge and let peace come to you when it will. Very gradually it seems to come more often and stay longer. It happens. I am slowly learning over time what works to give me peace so I can live each day and worry less. I was diagnosed almost 3 years ago and I am still learning and changing.",
      "MessageIndex": 20,
      "PostDate": "21/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/702404",
      "Title": "Recurrence ? Firelady Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 20, 2012 10:25PM Gitane wrote: Here's hoping the appointment went well today.  Warm hugs.  G.",
      "MessageIndex": 49,
      "PostDate": "20/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797357",
      "Title": "Cancer came back Mamita49 hopefour"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 24, 2012 10:53AM Gitane wrote: (((((Carol)))))",
      "MessageIndex": 63,
      "PostDate": "24/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797357",
      "Title": "Cancer came back Mamita49 hopefour"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 12, 2009 12:01AM Gitane wrote: Not Identified means the pathologist did not see any evidence of it on the slides that were examined.  Chances are if it wasn't found it's not there, but, of course, it's impossible to know for sure.",
      "MessageIndex": 4,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733996",
      "Title": "Vascular invasion??? bookgirl bookgirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 8, 2012 12:20AM Gitane wrote: Oh, Mamita... sending warm, loving hugs to you.  I am holding you in my thoughts.  Let us know what the plan is.    I so wish you did not get this news.  G.",
      "MessageIndex": 15,
      "PostDate": "08/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797357",
      "Title": "Cancer came back Mamita49 hopefour"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 18, 2012 11:34PM Gitane wrote: I sincerely hope you can stay out of the dark places that your mind wants to go.  It's normal to think too much, but it's just thoughts, not reality. There will be many good times ahead for you and your family.  Hold on to that!  You do not have to be brave, you just have to take another step, do what comes next, and live each moment as fully as you can.  It warms my heart to read about your wonderful family, the \"new horse\", the love you all share.  Know we are here, we care, and want to listen and help.  Lots of good vibes going to you in Montreal tonight. G.",
      "MessageIndex": 37,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797357",
      "Title": "Cancer came back Mamita49 hopefour"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 13, 2009 11:28AM Gitane wrote: Heidi,  I don't post on Stage IV anymore.  However, I have held you in my heart for days, and I just have to tell you that I am sending you all the love and hope I can.  Please know that, like me, women everywhere are sending you the same message.  G.",
      "MessageIndex": 64,
      "PostDate": "13/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 18, 2009 11:55PM Gitane wrote: Peace Heidi.   G. ",
      "MessageIndex": 454,
      "PostDate": "18/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 3, 2011 05:19PM Gitane wrote: 2 years is a huge anniversary, Pure.  May you and your family continue to be happy and healthy.  G.",
      "MessageIndex": 16,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772594",
      "Title": "2 Years for Me Pure Pure"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Apr 8, 2016 01:42PM Gitane wrote:",
      "MessageIndex": 3,
      "PostDate": "08/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/842937",
      "Title": "For those needing hope... Lucca06 mary625"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 27, 2013 05:55PM Gitane wrote: Hi Diane,  I'm pleased to read you are stable.  Thanks for coming here as you do, checking on everyone and giving us your news.  Living life one day-minute-second at a time is what I do, too.  Sending good vibes your way.  G.     ",
      "MessageIndex": 25,
      "PostDate": "27/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/806309",
      "Title": "I wonder how my stage III gals are doing? diana50 pupfoster1"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 27, 2010 08:04PM Gitane wrote: ((((((Bobbie)))))) The Big C makes us paranoid.  Still, listen to you body.  Give yourself lots of TLC.",
      "MessageIndex": 12,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747431",
      "Title": "Dragging SpunkyGirl Pure"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 3, 2008 10:36PM Gitane wrote: Sleep well, tonight.  Lots of warm hugs and love goin' up the west coast to you tonight.  I'll be thinking of you, sending all the strength I can your way.   ",
      "MessageIndex": 138,
      "PostDate": "03/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720346",
      "Title": "Dear Lord, I just scheduled brain surgery AlaskaDeb heymoose"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 14, 2008 11:57PM Gitane wrote: That cell count is something to celebrate.  The headache being better and the nausea improving shows your body is recovering.  It takes time, but it must seem like forever already.  I'm sorry the vision symptoms are not improving yet.  Not getting enough sleep is hard.  The steroids are to prevent swelling?  Hopefully you can cut back on those soon.  Thinking of you, Deb.  Love and hugs!   ",
      "MessageIndex": 328,
      "PostDate": "14/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720346",
      "Title": "Dear Lord, I just scheduled brain surgery AlaskaDeb heymoose"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 12, 2008 09:56PM Gitane wrote: wishiwere, I have wondered the same thing.  The AIs make us hurt, that's just a fact.  I have also notice that I have to move.  If I stand around my body doesn't want to support me.  Today I was in a bookstore.  After about 40 minutes of looking at books I flat out had to find a place to sit.  My skeleton hurt just from holding me up.  I'm O.K. if I move. I work in the yard, for example for hours without the hurting, but then I pay for it later with increased aches.  I get afraid that it's mets sometimes.  It has been going on for so long without getting worse, though; I hope it's just the meds.",
      "MessageIndex": 13,
      "PostDate": "12/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721012",
      "Title": "how do they tx bone mets kathy8429 wishiwere"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 22, 2009 09:07PM Gitane wrote: Hope you get lots of sleep.  The emotions are hard on your system. It's overwhelming.  You are zeroing in on what you have to deal with and getting that plan in place. It helps, it really does, to feel like you are acting against the BC.  Come here and talk.  Hugs, G.",
      "MessageIndex": 8,
      "PostDate": "22/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/739301",
      "Title": "Back from ONC victoriasecret Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 9, 2008 12:07PM Gitane wrote: Lifestoshort,  HUGS. I hope they find just the right treatment for you!",
      "MessageIndex": 3,
      "PostDate": "09/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725659",
      "Title": "Lung Mets Lifestooshort Lifestooshort"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 21, 2008 01:57PM - edited Feb 21, 2008 02:03PM by Gitane Hi Pandora, It sounds to me like you are a strong person, and ahead of the knowledge curve in many ways because you, and people you care about, have dealt with BC before. That gives you a place to start. I believe, we should protect ourselves from BC in every way we can. Each of us makes hard decisions about that. We want to be able to look back and say we did our best, and look forward knowing that is the truth. That said, I think it's important to remove any guilt from our thoughts. We are all human. Knowledge is power, but getting the knowledge we need isn't easy. This knowledge exchange board has helped me with that. I wish there wasn't so much uncontrollable uncertainty, but that's the way it is until we conquer the BC beast. Good luck to you.",
      "MessageIndex": 3,
      "PostDate": "21/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/700673",
      "Title": "Lumpy breasts pandora1962 lvtwoqlt"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 10, 2009 04:14PM Gitane wrote: Happy Day, Christine!  It's so great to be at the end of that very long road, isn't it?  Separating from all the drama and wondering what's next is quite an adjustment, at least it was for me.  Let joy into your life in every way you can! HUGS!",
      "MessageIndex": 11,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745172",
      "Title": "almost DONE! Christine2000 Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Oct 25, 2013 05:50AM Gitane wrote: Hi weesa! I love that you are checking in with us. The emotion and wisdom within your words really resonated with me, all while I was inwardly chuckling at the list of the drawer contents. I've got very similar contents, right down to the deteriorating rubber bands. Our histories really do reside in our junk! Sort of an archeological find. Your post really was fantastic. I'm so happy for you. May we continue to be healthy and share the good news when we can. Hugs to you! G.",
      "MessageIndex": 19,
      "PostDate": "25/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/813321",
      "Title": "Postcard from the edge...of eleven years out... weesa Fallleaves"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Oct 28, 2013 08:04AM Gitane wrote: tuffgirl - Hugs to you and congratulations on the 6 year milestones. G.",
      "MessageIndex": 24,
      "PostDate": "28/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/813321",
      "Title": "Postcard from the edge...of eleven years out... weesa Fallleaves"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 26, 2010 07:34PM Gitane wrote: Hello loving_mother,  I thought this source had good information. http://www.cmaj.ca/cgi/content/full/167/2/154/DC1/1 Wishing you the very best.  This process is drawn out and very hard on us.  Let us help you any way we can.  Hugs. G. ",
      "MessageIndex": 16,
      "PostDate": "26/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762500",
      "Title": "Just Diagnosed :( loving_mother nwest125"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 28, 2010 01:15AM Gitane wrote: loving_mother,  Most of us got all the diagnostic information from our pathology reports.  There is information here on this site about reading the pathology report.  These are written after our surgeries (lumpectomy or mastectomy, sentinel lymph node biopsies and/or axillary lymph node dissection), usually, but some of the information can come from biopsies, too.  If you have had these procedures, there should be pathology reports, you can ask your doctors for copies and ask your doctors to explain everything in the reports.  The pathology will tell you what kind of breast cancer you have.  IDC (invasive ductal carcinoma) and ILC (invasive lobular carcinoma) are the most common types.  If there was cancer within the ducts or lobules as well these are called \"in-situ carcinoma\" which means the cancer is contained and has not spread into the stroma of the breast, DCIS (ductal carcinoma in-situ) LCIS (lobular cancer in-situ).  The cancer cells may have receptors on them, ER (estrogen receptors) PR (progesterone receptors).  If the cells have these receptors it means they may be more likely to respond to an endocrine therapy like Tamoxifen or an Aromatase Inhibitor.  Without receptors the cancer cell would not respond to these treatments.  Another test is for Her2.  If cells overexpress Her2 protein or the Her2 gene is amplified, the cancer may respond to Herceptin, without Her2 Herceptin doesn't help.  My doctors used a PET/CT scan (or they may order a PET scan) to see if the cancer had spread to any organs.  If there is a cancer deposit that is very small, though, the scan won't probably see it.  Also, to check the bones, a bone scan is used. ",
      "MessageIndex": 29,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762500",
      "Title": "Just Diagnosed :( loving_mother nwest125"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 28, 2010 12:10AM Gitane wrote: Hello Gabrielle,  Looks a bit chilly out there in PA.  I remember the hope your post last December brought to us all.  Thank you for coming back this year with the good news of another year of health.  Congratulations on earning your degree, and best of luck with your dissertation.  You are right, keeping hope alive is very, very important.  Sounds like you're goin' strong.  I'll look forward to next year's update.  Hugs, G. ",
      "MessageIndex": 47,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745637",
      "Title": "10 years ago at Christmas.... Gabrielle Mimidi"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 27, 2010 06:47PM Gitane wrote: Hi Lemongrove,  I, too, want to give you what support I can and welcome you.  Your feelings are normal.  We have those feelings, too.  That doesn't make them easier, but at least you know you are not alone.  You can see by reading here that we learn each day to live with the unknown and appreciate the life we have.  Please come here and spend time with us.  We can help each other.  HUGS!  G.",
      "MessageIndex": 11,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747448",
      "Title": "Newly Diagnosed and scared Lemongrove arnie2two"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 27, 2011 12:06AM Gitane wrote: Hello Leighsa,  Welcome.  No advice.  You being a health care nurse have probably more advice to give to us!  It is such great news that your nodes are clear, the margins are clear, and that you are recovering from your surgery.   I'm glad you are getting such good care there at Mass General.  I had to laugh when you said you were a terrible patient.  Is this generally true among health care professionals?  Maybe you guys just know too much and question things a lot.  I have to say I researched a lot, too, and still do.  I think that's the case more than not; at least it seems to be among the women on this site.  Of course you are not fine.  Good grief... look what you are going through.  What ever you feel, it's O.K.  My feelings where all over the place.  I've never experienced anything like it.  It takes time for us to wrap our minds around the reality of all this. And, since our bodies are going through so much, it just makes it worse.  Be patient and compassionate with yourself.  Lots of TLC.  Hugs,  G.",
      "MessageIndex": 2,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772209",
      "Title": "Newly diagnosed and trying to keep it together Leighsa Joan811"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 10, 2009 12:39AM Gitane wrote: Thank you, Apple.  Like all of us, I'm missing Deb.  I loved reading this, even though it brought back the tears.  G ",
      "MessageIndex": 343,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 12, 2009 02:33AM Gitane wrote: John, thank you for letting us read the article and see those memorable pictures of Deb.  I have read that we each have a core, a self deep inside that nothing, not even breast cancer, can ever harm.  Frankly, I really didn't believe that until I got to know Deb through her posts.  That beautiful \"core self\" of hers was able to shine its light through many dark hours for many people.  She was Deb, through and through, no matter what. We were very fortunate here to have known her.",
      "MessageIndex": 352,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 18, 2008 06:33AM - edited Jun 18, 2008 06:36AM by Gitane",
      "MessageIndex": 47,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707172",
      "Title": "New Phase in the journey?? Fitztwins wallan"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 18, 2008 06:34AM Gitane wrote: Fitztwins, Love the avatar. Says it all!",
      "MessageIndex": 48,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707172",
      "Title": "New Phase in the journey?? Fitztwins wallan"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 6, 2008 03:38PM Gitane wrote: Another voice, Kasey, among so many, saying I care, too.",
      "MessageIndex": 52,
      "PostDate": "06/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725446",
      "Title": "Now under Hospice/Palliative care Kasey RobinWendy"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 29, 2011 05:37PM Gitane wrote: Christy,  You are so smart to take the steps you are taking.  We need to listen to our bodies and our hearts, not ignore them and push on.  I don't think all the effects of the BC experience are felt up front.  I think our bodies and psyches recover as they are able and that takes lots of time.  Hugs, G.",
      "MessageIndex": 6,
      "PostDate": "29/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772338",
      "Title": "Back on disability AnacortesGirl pupfoster1"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 21, 2010 07:50PM Gitane wrote: Tiffany,   We know so well the thoughts and emotions you are expressing as we have had them, too.  The people in our lives are guilty of wishful thinking to some extent; they want so badly to believe that there will be a time when \"it's over\" and everyone can \"get back to normal\".  We can't reassure them or ourselves of that.  So we come here and share with others who understand. There are up days and down days.  I am in most ways very different than I was. One thing that has happened, as years pass, is that I'm learning to allow more wonder into my life.  By that I mean, I am more open to just seeing what may come, and trying to control it less.  Sometimes I have been pleasantly surprised that good things have unexpectedly happened as a result of this openness.  I know what you mean when you say you want your life back.  The life you are living now may be different, but it doesn't have to be totally worse.  Have faith that time will heal your body and your spirit. ",
      "MessageIndex": 10,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747023",
      "Title": "Tired of hearing it's almost over! TiffanyF4 Diana63"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 2, 2010 01:21AM Gitane wrote: A proud moment for sure.  Congratulations!",
      "MessageIndex": 3,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747679",
      "Title": "Proud Mama!!! jenn3 NancyD"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 19, 2009 01:23AM Gitane wrote: Was just looking back at the number of people who have posted here who were diagnosed in 2005, or even before.  How wonderful!",
      "MessageIndex": 32,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/734339",
      "Title": "I made it to 4 years!!! lkc candie1971"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 9, 2010 10:54AM Gitane wrote: Wow, what a good way to \"take control\".  What a model you have become and how good it must feel for you to give this hopeful message to others.",
      "MessageIndex": 8,
      "PostDate": "09/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/756403",
      "Title": "My 15 mins of fame....some of you have already seen this on FB everyminute apple"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Mar 14, 2013 06:09PM Gitane wrote: I bought an electronic keyboard that I'm learning to play.  The music I've learned so far is very simple, but I enjoy it.   I've learned to knit, and do that at odd moments. I've begun reading again, nothing heavy, just mysteries, something I stopped doing when dx with BC. Today I made Madelleine cookies, and am making paella for dinner,  YUM. I've put up a bird feeder and a humming bird feeder and have birds galore in the backyard.  My cats can't get them, but are sure entertained. Spent some time pulling weeds in my mom's back yard.  We got to talk.  It doesn't sound like much but was really a special time. We're enjoying some warm, sunny days.  I love California on days like this!",
      "MessageIndex": 4,
      "PostDate": "14/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/801797",
      "Title": "whats on your bucket list? fredntan Ihopeg"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 19, 2009 08:07PM Gitane wrote: Gabrielle,  We all wonder, but will never know why.  Thank you for sharing your 10 years of health and the journey you've had. Strength to you, too.  G.",
      "MessageIndex": 1,
      "PostDate": "19/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745637",
      "Title": "10 years ago at Christmas.... Gabrielle Mimidi"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 4, 2008 09:20PM Gitane wrote: Dear Faith23,   I can only say I am sorry this is happening to your mom.  Sharing your feelings is important.  You were right to come to this forum.  Love to you both.",
      "MessageIndex": 2,
      "PostDate": "04/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723873",
      "Title": "Doxil and Avastin??? faith23 faith23"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 24, 2011 10:44PM Gitane wrote: I don't think it's your imagination; I've noticed that, too.  I wonder why.",
      "MessageIndex": 2,
      "PostDate": "24/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765201",
      "Title": "ER+PR- kindone SpunkyGirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 1, 2010 01:35AM Gitane wrote: Wish this had not been so traumatic.  Of course you need to vent, and of course your DH could not possibly understand the way we would.  Had you known what to expect it might not have been so stressful for you and triggered this attack.  Sometimes that cold world of doctors/hospitals/treatments is just too much for us.  I had a similar experience with a biopsy that was supposed to be no big deal, so I went alone, but that's another story.  May that little port make your life easier from now on!",
      "MessageIndex": 1,
      "PostDate": "01/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757480",
      "Title": "Port Placement Horrendous - for me! LuvMyLab Cowgirl13"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 5, 2008 05:01PM Gitane wrote: Thanks for telling us the news.  We'll be thinking of Deb today.",
      "MessageIndex": 198,
      "PostDate": "05/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720346",
      "Title": "Dear Lord, I just scheduled brain surgery AlaskaDeb heymoose"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 17, 2011 02:54PM Gitane wrote: Before treatment my WBC was usually 7.5-8.0.  After treatment it stayed at 3.5-4.5 for 3 years, then crept back up to 4.5-5.5.  It stays about there now, 5 years out.  I guess it has never recovered from treatment. Zometa infusions were continued for me, also.  However, I'm postmenopausal and was when I went through treatment. Sounds like your onc visit was good.  I understand about the worry, though.  I do it, too. ",
      "MessageIndex": 2,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765058",
      "Title": "Low White Blood Cell Count - Over Two Years Out? azs40 TammyLou"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 15, 2009 11:55PM Gitane wrote: You are right.  These special days are landmarks and deserve to be celebrated.  Congratulations and Happy Anniversary.... and many, many more.",
      "MessageIndex": 2,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/740423",
      "Title": "Another goal reached! sugarplum Rainenz"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Mar 22, 2012 10:06PM Gitane wrote: What a difficult time you have had with the chemotherapies.  I'm sorry you have had to endure this.  I'm glad the latest one is working so much better and that you have the side effects under control now.  I don't think this protocol was used in 2005 when I was treated, or at least I don't remember it being an option for me.  I wonder if it might be more common with Her2+.  Have you asked on that forum, too?  Hoping for all the best for you, Julie.  Hugs, Gitane",
      "MessageIndex": 1,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/784456",
      "Title": "TCH Or ACH Jlaraujo Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 12, 2012 10:40PM Gitane wrote: Hello Mamita,  I came here specifically looking to see if you had posted, and here you are!  You have been in my thoughts every day. I wish I could come over there and give you a big hug.  I've got family right there in Montreal, so I can visualize a bit where you are.  Next week you'll know more.  Keep us in the loop, we all want to support you. Sending hope and BIG Hugs!!!  G.",
      "MessageIndex": 27,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797357",
      "Title": "Cancer came back Mamita49 hopefour"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 29, 2011 04:33PM Gitane wrote: Christy,  I never took Aromasin.  Although I know it's very different in it's mechanism of action, I really don't understand the differences between the AI's.  I have been on Femara for over 5 years now.  The first 2 years on it I was really miserable physically and emotionally.  It affects so many aspects of our life!  Swelling and headaches are symptoms that you are wise to check out.  The joint, muscle, and bone pain are a lot more prevalent and serious than the doctors/pharma companies make public in my opinion.  I sincerely hope that your onc can investigate and come to a plan that will help you.  Some kind of endocrine therapy seems to be required for us, so we need to keep trying.",
      "MessageIndex": 5,
      "PostDate": "29/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/770977",
      "Title": "AIs - am I going to have to go on disability? AnacortesGirl AnacortesGirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 22, 2011 05:40PM Gitane wrote: First of all, congratulations on getting through 2 years, no small thing!  I'm glad that you are still O.K. and getting such good care from the pros. If only you could get back a decent quality of life.  Drugs can be a huge part of the problem instead of the solution.  I don't think anyone, even doctors, have a clue as to what these drugs can do to us.  When we are dealing with major, major stresses, like a parent with dementia, headaches and SE's, our own hormones being all over the place, sleep disturbances, etc., etc., etc.  we feel like our world is a mess.  At least I have felt that way.  You are going to have to give yourself all the compassion, tenderness, and care you need.  I hope the counselor is wonderful and can help.  Don't feel guilty about things, don't be hard on yourself about anything, trust that your body will get through this, YOU will get through this.  Been there... still there but not as bad as before.  Hugs,   G.",
      "MessageIndex": 17,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/770977",
      "Title": "AIs - am I going to have to go on disability? AnacortesGirl AnacortesGirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Mar 1, 2012 02:50PM Gitane wrote:",
      "MessageIndex": 36,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/783260",
      "Title": "Diana50!!!!!! ck55 kimf"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 18, 2011 06:57PM Gitane wrote: I hope your visit went well.  For me those visits are always a bit unnerving.  G.",
      "MessageIndex": 3,
      "PostDate": "18/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/778265",
      "Title": "Onc visit momand2kids momand2kids"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Oct 29, 2013 11:19PM Gitane wrote: Hurray Kerry! I am happy for you and celebrating your good health. Hugs, G.",
      "MessageIndex": 8,
      "PostDate": "29/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/813718",
      "Title": "Five years!! KerryMac Pure"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 31, 2011 03:00PM Gitane wrote: It's hard to put into words the feelings that this diagnosis brings to a person, to a family.  You have all dealt with so much hurt these last years.  I'm glad to read your good news.  All the best, G.",
      "MessageIndex": 2,
      "PostDate": "31/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764193",
      "Title": "Finally kim40 DCMom"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 19, 2009 12:05AM Gitane wrote: Hello Deb,  You are in my thoughts daily.  We know that each precious moment of life holds unexpected treasures. The suffering is sometimes too much, but the golden moments keep us who we are.  Love and the warmest hugs, G",
      "MessageIndex": 75,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726695",
      "Title": "Deb C Update nosurrender LuAnnH"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 2, 2009 02:14AM Gitane wrote: HI Lori,  I'm sorry you hit a posting limit.  I didn't even know there was such a thing.  I don't have IDC, but there are some other things that are similar about our situations.  I was a little older than you are, I was 57 when diagnosed. (I'm 61 now.)  My multifocal tumors covered an 8 cm area.  I wanted to be treated at UCLA but my insurance wasn't accepted by them.  I did go there to get an evaluation and second opinion from a surgeon, Dr. Chang, and an oncologist, Dr. Glasby, and then took their recommendations to my treating doctors.  That gave me confidence in my decisions.  I also had neoadjuvant therapy and bilateral mast.  I had a SNB before chemo. I had AC not TC.",
      "MessageIndex": 14,
      "PostDate": "02/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/736829",
      "Title": "Newly diagnosed and don't know how to navigate this site NewportLori xpectmiracles"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 5, 2009 02:35PM Gitane wrote: From my MRI after neoadjuvant chemo I may have had a pCR, but after the mastectomy the pathologist could see viable cancer still in the breast.  I'm not sure anything short of surgery can assure you of a pCR, even if the surgery is a lumpectomy of the former tumor site.  For this reason a clip is often placed in the tumor before neoadjuvant therapy, so the surgeon will know exactly the site of the tumor if it disappears.",
      "MessageIndex": 4,
      "PostDate": "05/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743301",
      "Title": "Neoadjudvant Chemo no surgery needed precioustime mumito"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 23, 2011 12:19AM Gitane wrote: I'm so happy for you, sweetbean.  Lots to celebrate!  Hurray!",
      "MessageIndex": 25,
      "PostDate": "23/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779842",
      "Title": "Clean Scans! Merry Christmas to me! sweetbean Ellie1959"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 24, 2009 01:59PM Gitane wrote: It is so good to hear you are at home.  I hold you in my heart daily.  G.",
      "MessageIndex": 165,
      "PostDate": "24/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 21, 2011 11:40PM Gitane wrote: What a beautiful cat your Rascal is.  I can almost hear him purr.",
      "MessageIndex": 17,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763235",
      "Title": "Anyone do Neoadjuvant AND Adjuvant chemo? NannaBaby anna4969"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 15, 2009 03:12PM - edited Dec 15, 2009 03:13PM by Gitane Hi Daisy,  I'm another California person.  I'm 4 years out now.  I was reading that you have become so healthy and been running.  Good for you!  I'm taking vitamin D, drink green tea, take CoQ10, use Benefiber, eat fiber cereals (mostly Fiber One), take vitamin B complex, and of course my meds, Femara and Celebrex. Also, I eat prunes and drink pomegranate juice for antioxidants.  It's nice to see all these ILC ladies meeting here and getting so healthy.  You guys will help me stay healthier, too.",
      "MessageIndex": 4,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745394",
      "Title": "ABOUT YOU.. Mom3 jenn3"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 18, 2011 02:33PM Gitane wrote: Wow bugs, thanks for the warm wishes and this beautiful family photo.  Hugs to you and your family.  G.",
      "MessageIndex": 1,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779684",
      "Title": "Happy Holidays Bugs Octobergirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 29, 2010 12:29AM Gitane wrote: I don't know if the surgeon would recommend this for you, but I had an MRI before my surgery.  It's helpful to give the surgeon a clear picture of where the cancer is in your breast.",
      "MessageIndex": 44,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762500",
      "Title": "Just Diagnosed :( loving_mother nwest125"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 24, 2011 04:59PM Gitane wrote: This is the most inspiring photography I have seen in a very long time.  Thank you for this link.  I will be sharing it and watching it again and again.  What a nice gift you have given us.  G.",
      "MessageIndex": 1,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/778619",
      "Title": "Giving yourself permission to be inspired Miles2Go ptdreamers"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 18, 2010 01:07AM Gitane wrote: Hi Trish,  I'm so glad you checked in. I'm very, very happy to hear that you are doing so well.  Each year you come back makes me so glad we have this board to communicate with one another.  7 years and going strong!  Please let us know when it's year 8, 9, 10..... well, anyway, I love that you came here to share and wish you many years of good health and happiness.",
      "MessageIndex": 3,
      "PostDate": "18/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/758178",
      "Title": "Celebrating 7 years! Trish03 karen1956"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 17, 2010 11:14PM Gitane wrote: lago,  The way I read this is that if you have about 30% ER or above you may benefit.  Super high ER numbers, above 50% don't increase probability of benefit.  I have similar numbers to you;  I am taking my Femara daily and Zometa every 6 months. The SE's are something that I don't like living with, I worry that they are rapidly aging my body, but I'm much more afraid of mets.  I feel lucky to be NED right now, and hope it will last.  I don't know if the drugs are helping, but I wouldn't stop them.  ",
      "MessageIndex": 58,
      "PostDate": "17/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/759924",
      "Title": "Early stage BC and Zometa kathylev weety"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 26, 2013 12:01AM - edited May 26, 2013 08:26PM by Gitane Hey, Bugs, the newbies will love reading your post!  You have accomplished a lot in these 7 years!  Congratulations!",
      "MessageIndex": 18,
      "PostDate": "26/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/805195",
      "Title": "Life really DOES go on! Bugs SpunkyGirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 8, 2008 01:33AM Gitane wrote: I didn't know Kimmie, but I am so sorry this has happened.  She was so very young.  How tragic and sad.  I am at a loss.  Love and peace to Kimmie's loved ones.",
      "MessageIndex": 27,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708542",
      "Title": "Kimmie 39 ozzie2 mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 18, 2009 12:33AM Gitane wrote: Linda,  Long, happy, beautiful, life!  Thank you for coming here to share it with us.   Julie,  Congratulations on three years, almost.  Many fun-filled years to you, too.  Don't be superstitious.  You can't jinx this; you are goin' strong and will continue to do so. ",
      "MessageIndex": 15,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/734339",
      "Title": "I made it to 4 years!!! lkc candie1971"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 14, 2009 05:43PM Gitane wrote: Oh, Judy0, I do identify with you.  The sadness and fear that come with this diagnosis can be too much to bear at times.  Sometimes I feel that my type of cancer is so rare, the presentation was so unusual, there was so much tumor, the treatment probably won't work, etc., etc.  I wanted them to know better than to give me HRT, I wanted them to see it earlier (It was on my mammo 2 years before it was diagnosed.), I wanted them to know my prognosis, I wanted them to have a cure, I wanted them to care.  Ultimately, I realize what I want and what I get are very far apart.  Sometimes I drive myself, and people I love, crazy with this.  Then I feel guilt, shame, overwhelmed.  I wonder why I can't grow up, be grateful it was caught and I was treated, get over it, etc.  Because other major tragedies have happened to close family members, and other major life events have happened to me as well, it has taken years, but I'm starting now to get where I can let it go, do other things, and even start to feel more alive and happy.  The strong, sad, emotion comes back, of course, but less frequently and doesn't last as long. In my opinion the transition can't be rushed.  We are all different.  I know women who haven't taken nearly as long to adjust as I have, but that's them.  I am me.  You are you.  I wish you many more healthy, happy years of life.  I hope you will be coming back here to share what's happening, knowing that we all understand and care.  We are sisters.",
      "MessageIndex": 3,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/734190",
      "Title": "One year ago JudyO JudyO"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 8, 2009 10:25PM Gitane wrote: Cheryl, I had DCIS and lobular, too.  There aren't that many of us, are there?  I had tumors spread over an 8 cm area and nothing showed on those mammograms and ultrasounds until it was very large. Whatever you do, don't blame yourself.  Not only is it not true, it drives you crazy.  I won't lie and say I didn't look for things I or others could/should have done differently.  I sure did, we all do.  Ultimately, though, it doesn't help us.  We have to get on with what we can control.  Since you have experience with cancer, I'm sure you know all this.   The emotions really are all over the place.  That's why this site helps us.  We can share and sort of normalize a very not-normal situation for us.  Hugs, G.",
      "MessageIndex": 16,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738559",
      "Title": "moving over again..it just keeps.. victoriasecret Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 7, 2008 11:20PM Gitane wrote: Hi C, I'm glad to hear your mom is doing well post surgery. She is lucky to have you to support her. Is anyone else helping you out? You need to pace yourself. My father had Alzheimers and spent time in the hospital. His confusion was greater then, but as he recovered he returned to a less confused state. It sounds like you had a good experience with hospital staff. It should be better for your mom now that she is back in familiar surroundings and in recovery. Hopefully her future treatments won't interfere too much with her QOL. Just a suggestion, but you might want the neurologist involved in monitoring the interaction of meds as she takes on whatever new treatments, if any, are suggested.",
      "MessageIndex": 10,
      "PostDate": "07/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/706452",
      "Title": "Alzhiemer's and breast cancer cgraham cgraham"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 9, 2011 04:18PM Gitane wrote:",
      "MessageIndex": 12,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764571",
      "Title": "Why some need chemo after surgery, some not??? Karina Karina"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 4, 2011 07:47PM Gitane wrote: Karen,  Thank you for coming here to share this 5 year milestone.  It's good for our spirits to know that others have gone down this road and are doing fine... better than fine.  Many more years ahead.  Hugs, G. Wendy,  Congratulations to your on 6 years of love and life.  We are changed forever but truly appreciate what we have.  Lots of happy times ahead with your family and friends.",
      "MessageIndex": 13,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764397",
      "Title": "MY life changed forever on 02/03/2006 karen1956 JacquelineG"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 3, 2008 05:41PM Gitane wrote: Kari, So much love is going out to you.  I hope you feel it.  Peace. Gitane ",
      "MessageIndex": 145,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708158",
      "Title": "Very bad report KariLynn roseg"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 13, 2008 08:23PM Gitane wrote: Bump to top.",
      "MessageIndex": 57,
      "PostDate": "13/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721061",
      "Title": "Feel stuck in place....venting AlaskaDeb RIV54"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 19, 2008 12:17AM Gitane wrote: Hi Deb, Been thinking about you today.  Hoping for the best. Lots of love and hugs.",
      "MessageIndex": 82,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721061",
      "Title": "Feel stuck in place....venting AlaskaDeb RIV54"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 22, 2009 09:13PM Gitane wrote: The love is just shining from your faces.  It makes me feel warm inside.  ",
      "MessageIndex": 5,
      "PostDate": "22/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744354",
      "Title": "A pic to share Bugs Momcat1962"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 31, 2011 04:52PM Gitane wrote: It's so good to know you are going strong.  You remind us of how much change is inevitable.  Thank you for sharing your journey with us.  G.",
      "MessageIndex": 14,
      "PostDate": "31/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/769656",
      "Title": "3 years ago today... everyminute gillyone"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 2, 2011 04:31PM Gitane wrote: Hi Christy,  I really hope those headaches clear up in the next week or so.  They are such a drain on your energy and mood, I'm sure.  The brain MRI being clear is great.  No brain?  After chemo I've felt that way sometimes.  I don't know where I read it, but there were some issues somewhere about ILC and Tamoxifen.  I'll have to look through my piles of files to see what it was.  Maybe someone on the ILC board would remember.  Anyway,  I think trying a different hormonal is logical if it turns out the Aromasin is the problem.  Let us know what happens.  Hoping you feel much better very soon,  G.",
      "MessageIndex": 8,
      "PostDate": "02/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/770977",
      "Title": "AIs - am I going to have to go on disability? AnacortesGirl AnacortesGirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 18, 2010 12:39AM - edited Jan 18, 2010 12:40AM by Gitane Hi Jeanne,  These are such an important questions, but I don't know the answers.  I remember that AC really affected my immune system.  I had an outbreak of shingles, but it was handled quickly with treatment.  Unlike you, I didn't go on to take Herceptin and have no experience there.  Have you posted these questions on the Her2 forum?  I bet women there could help you.  Giant, giant hugs.   ",
      "MessageIndex": 1,
      "PostDate": "18/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746915",
      "Title": "Toxic Pneumonitis + Herceptin/Taxol JeanneG AnacortesGirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 21, 2009 11:08PM Gitane wrote: That's something that takes a while to adjust to after chemo/rads; they kind of cut us loose and we go, \"Wait,  now how to make sure it's gone???\"  Answer:  \"Well......\" For me they do exactly what you have described.  They do blood work, physical exam, and of course watch for symptoms.  I didn't get scans at all, and frankly, I'm just as glad not to get them.  However, some people ask for them if they have unusual symptoms that last more than 2 weeks and oncologists are usually pretty good about doing scans then. Once you've finished your Herceptin there may be no more treatment for you.  Some of us are getting Zometa infusions every 6 months.  You might ask about that. Congratulations on being done with the major stuff.  That has to feel good at least, even if we can't make the worry go away.  This has been a very long road.  Lots of love, Amig.  I'm happy for you. ",
      "MessageIndex": 2,
      "PostDate": "21/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745715",
      "Title": "All Done amlg1 amlg1"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 30, 2008 08:42PM - edited Nov 30, 2008 11:21PM by Gitane This is a recent article that discusses the current controversy over using anthracycline therapy or not.   http://www.cancernetwork.com/display/article/10165/1352529 Dr. Murphy is a special senior fellow at MSKCC. Dr. Seidman is professor of medicine at Weill Medical College of Cornell University and attending physician, Breast Cancer Medicine Service at MSKCC. ",
      "MessageIndex": 30,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724317",
      "Title": "AC&T vs T/C? EleanorJ Seabee"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 1, 2011 05:22AM Gitane wrote: Hello Tundra,  We are here to help you.  It's overwhelming at first, I know.  Hugs, G.",
      "MessageIndex": 7,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764225",
      "Title": "hello Tundra jenn3"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 11, 2011 06:24PM Gitane wrote: Sounds like you are on your way!  Will be keeping you in our thoughts.  G.",
      "MessageIndex": 7,
      "PostDate": "11/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763223",
      "Title": "Off For Recon PreOp Tests/Consult pupfoster1 Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 28, 2010 11:45PM Gitane wrote: flagstage3,  This is THE question that I had to learn to answer for myself, I think, because there is no answer.  In some ways I have improved my ability to live with this uncertainty, in other ways not.  Each day is a new chance to get stronger and learn what works for me.  Like so many of us I keep trying things, like this BC discussion board, books that help me learn about how my mind and emotions work, taking wisdom from others and inside myself when I can find it. BC changed everything, and made me look at my life and my world with totally new eyes.  The transition to this new way of being has been hard, no doubt about it.  The reality is, there is no going back.",
      "MessageIndex": 3,
      "PostDate": "28/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761291",
      "Title": "how do you move on flagstage3 amlg1"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 16, 2009 11:42PM Gitane wrote: There is nothing better for us than to share these very happy milestones.  Thanks for letting us be part of this special day!  G.",
      "MessageIndex": 20,
      "PostDate": "16/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745496",
      "Title": "Today is my 5 year cancerversary kimf maryannecb"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 28, 2009 01:08AM Gitane wrote: I only just read this.  My heart is so very heavy upon hearing this news.  Our world has lost a beautiful, unique spirit. I feel an emptiness that is very profound. To Deb's family, my heartfelt condolences.  ",
      "MessageIndex": 265,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 1, 2008 12:34PM Gitane wrote: I needed to get back on the boards this morning to address something I wrote last night.  It has been making me think, and I worried about anything I said influencing anyone else.  I wrote, \"\"tumors with low levels of ER and/or PR respond better to adriamycin\".  Now I think I may have misinterpreted what I read in the research.  I read that tumors with low hormone receptor levels \"benefit\" from AC.  This might mean that because they don't respond as well to endocrine therapy they may need AC more than the others and benefit from chemo because of that. I don't know.  This is a question for the oncologist.",
      "MessageIndex": 34,
      "PostDate": "01/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724317",
      "Title": "AC&T vs T/C? EleanorJ Seabee"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 1, 2008 11:04PM Gitane wrote: cebula,  Getting the decision making out of the way must be a relief.  All the very best to you!  ",
      "MessageIndex": 36,
      "PostDate": "01/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724317",
      "Title": "AC&T vs T/C? EleanorJ Seabee"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 19, 2009 08:32PM Gitane wrote: Sending good vibes, too.  Hope you get the news soon and that it's all good!",
      "MessageIndex": 4,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/734431",
      "Title": "MRI roxy42 DCMom"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Oct 28, 2008 12:16AM Gitane wrote: I guess you could call mine a bit mixed.  I had DCIS and pleomorphic ILC in my left breast.  I know the pleomorphic ILC is considered somewhat rare, I don't think a DCIS and ILC together would be rare.  I don't know about IDC and ILC.",
      "MessageIndex": 5,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/723261",
      "Title": "mixed type Stage III breast cancer, anyone else? tsherner Naomi"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 20, 2010 11:42PM Gitane wrote: I, too, experienced very sad times, depression, for at least 4 years.  What has helped me more than anything else is finding two books that helped me understand better why the moods/feelings had me spiraling down into depression.  These are not books to just read but also give you steps you can take to help yourself.  The first one is the one that helped me the most with my unhappiness because it focuses specifically on depression, while using parts of the program presented in the second one.  The second one, however, is very important because it goes into much more detail.  I have been reading these and using them daily for about 2 years now.   The Mindful Way Through Depression, Freeing Yourself from Chronic Unhappiness, by Mark Williams, John Teasdale, Zindel Segal, and Jon Kabat-Zinn  Full Catastrophe Living, by Jon Kabat-Zinn  Everybody is different.  There is no set timeline, or path that anyone should take.  Our feelings are important, and there is nothing wrong with us for having them.  We just need to learn ways to keep them from taking over.  It can be done.  Hugs, G. ",
      "MessageIndex": 10,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762264",
      "Title": "4 years later and I'm still Devastated! bluesky Ellie1959"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Oct 27, 2008 11:03PM Gitane wrote: It's wonderful to celebrate two special days like this.  We are all celebrating with you. YEA!",
      "MessageIndex": 13,
      "PostDate": "27/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/723340",
      "Title": "Two years ago... Zzap Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 14, 2011 12:19AM Gitane wrote: Sharon,  I'm glad to hear the US came out fine. Hope all continues to go well.  G.",
      "MessageIndex": 26,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763223",
      "Title": "Off For Recon PreOp Tests/Consult pupfoster1 Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 17, 2008 01:55AM Gitane wrote: It means so much to get good news like this Trish.  Thank you, from one ILC girl to another, for coming here to share this with us.  ",
      "MessageIndex": 13,
      "PostDate": "17/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/721296",
      "Title": "5 years - NED Trish03 2angels"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Mar 28, 2010 11:07PM Gitane wrote: My husband's aunt was diagnosed at 55 years old, had a radical mast. as her only treatment.  She is alive now at 85 years old.",
      "MessageIndex": 18,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750429",
      "Title": "80 years old......???? Mamita49 ruthbru"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 8, 2008 09:31PM Gitane wrote: Welcome home!  This great news has made my day.  I'm so glad.  Rest up.",
      "MessageIndex": 35,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708729",
      "Title": "Welcome home, Stephanie(TripleNeg)!!! AnnNYC badboob67"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 8, 2010 07:02PM Gitane wrote: I'm just adding a hello here.  Everybody has the bases covered.  It takes time.  I can't emphasize that strongly enough.",
      "MessageIndex": 7,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746463",
      "Title": "im out of hiding Aim4th Aim4th"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 12, 2008 03:56AM Gitane wrote: I have read that it is not appropriate or even possible to look at overall survival when evaluating a treatment used in metastatic breast cancer for all of the reasons Lumi so beautifully explained above. Treatments must be evaluated on their usefulness to an individual patient.",
      "MessageIndex": 10,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707114",
      "Title": "hard question...chemo statistics???? waterlily Nico1012"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 3, 2013 07:34PM Gitane wrote: Giant congratulations, Julie, and you, too, Karen.  What great news!  Thank you for sharing it with us.  We love it!!!!   ",
      "MessageIndex": 21,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/803968",
      "Title": "well THANK HEAVEN-made it to seven! sugarplum sciencegal"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 21, 2014 01:15AM Gitane wrote: Wow, Naaomi, that's GREAT!  Thanks for letting us know.  Love to hear good news like this.",
      "MessageIndex": 14,
      "PostDate": "21/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/821571",
      "Title": "Hey.....9 years!!!!!! Naomi Momine"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 16, 2008 12:46AM Gitane wrote: daisyhope,  I have been through exactly what you are describing.  Nothing anybody could say or do made me feel better.  It seemed that my emotional mind had reached some kind of limit, and it scared me more than anything has ever done.  This kind of fear is very hard for us to take.  We need to find a way to get through it, but it's tough.  I would drive far away from everyone and sob like my heart would break, or just scream in rage until there was no energy left.  I can't tell you how much that is not like me.  I'm such a quiet, shy type of person.  When it got to be more than I could stand I asked for help.  My doctor prescribed an antidepressant. I took it for about 10 months.  I also met with a breast cancer therapist who helped me learn ways to calm myself, but honestly I didn't think it helped then, it's helping more now. Walking helped a lot.  Staying busy doing anything, didn't matter what, helped.  I think time helps the most.  It seems that trying to work right now is too hard, can you get time off until your emotions can level off?  Can you find a way to avoid the wine?  It's a temporary relief, but ultimately makes you even more vulnerable to the emotions you are having.  The roller coaster ride is something we all have endured, and continue to endure to some extent, though the highs and lows become much less extreme.  Above all know that you are a good, normal person and you are in the middle of a very extreme situation. Nobody is all that brave, we are all scared.   Give yourself all the gentle understanding you can, don't judge your actions, thoughts, or emotions too harshly.  Let the whole thing roll over you, pick yourself up, and move on to the next day.  Come here and talk a lot.  Or don't.  There is no right way to do this.  Lots of love.  ",
      "MessageIndex": 35,
      "PostDate": "16/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/720390",
      "Title": "Nottingham grade: III of III - Mottingham score: 9 of 9 daisyhope Denise2730"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 30, 2008 11:49PM Gitane wrote:  Chemo was in the cards for me. I didn't have much nodal involvement, 1 mm micromet, but I had lots of tumor in my breast.  My oncologist said that ILC may not respond that well sometimes to chemo, but pleomorphic lobular cells are very much affected by it.  I am glad I got AC (4 infusions, 2 weeks apart) because I had better than 95% reduction in tumor by MRI.  Pathology showed some individual cells left, unfortunately, so I had 2 more AC infusions after surgery.  I have since found out my oncotype dx score was 23, I consider that high,  that my ER level was lower than shown previously by IHC, and that I was slightly in the PR+ range, but just barely.  I have read that tumors with low levels of ER and/or PR respond better to adriamycin.   I have read that the proliferation (mitotic) rate of the tumor being high can cause the Oncotype dx recurrence score to be high.  Also, Her2+ tumors sometimes get high RS scores. Anyway,  I agree that Adjuvant! adds information to the Oncotype DX score, and the oncologist's experience will undoubtedly count for a great deal in helping make the decision for or against chemo, and/or adriamycin.",
      "MessageIndex": 33,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724317",
      "Title": "AC&T vs T/C? EleanorJ Seabee"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 24, 2008 05:25AM Gitane wrote: Hi Mary,   You are strong, but remember not to try to be too strong.  Let yourself feel, cry, rant, and everything else in between.  Those feelings gotta go somewhere, so let them all out as often as you need to. My emotions were all over the place.  Above all, don't feel any guilt.  The people who love you want to help.  Helping may be just leaving you alone when you want that, too.  Tell people what you want and need when you know that, and when you don't tell them that, too. Cancer sucks!  You are not a problem, you are you!",
      "MessageIndex": 2,
      "PostDate": "24/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/720001",
      "Title": "You Gotta Laugh, the alternative sucks cuteminnieme69 StillKicking"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 25, 2012 10:35PM Gitane wrote: Just thought I'd throw this out, for what it's worth.  \"Barbe a Papa\" (sp?) in French is what they call cotton candy.  Maybe that's what they are referring to about the shape???... sort of fluffy and soft, indistinct borders or something???",
      "MessageIndex": 13,
      "PostDate": "25/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/797989",
      "Title": "Just Diagnosed- MerryChristmas (sarcastic) smethot Kimberly1965"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 15, 2011 03:37AM Gitane wrote: Sending love, Pee! ",
      "MessageIndex": 3,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763386",
      "Title": "Been given a reprive pee Lowrider54"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 21, 2011 01:30AM Gitane wrote: Thanks, NannaBaby.  His name is Smokey and he's my companion.  I rescued him while I was in treatment.  Good to hear you have the energy to get in shape.  Hugs!",
      "MessageIndex": 15,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763235",
      "Title": "Anyone do Neoadjuvant AND Adjuvant chemo? NannaBaby anna4969"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 3, 2012 07:04PM Gitane wrote:",
      "MessageIndex": 22,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782097",
      "Title": "02/03/2006...6 years later and I'm still here!!!! karen1956 Annie62"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 20, 2011 05:50PM Gitane wrote: Welcome, Carla,  When they take away our estrogen everything hurts anyway.  I know how it feels to worry about the aches and pains.  I had chemo before and after surgery like you did.  I'm an ILC girl, too.  I'm a lot older than you, though.  It's good that you have found us and I hope you will come back.  Hugs, G.",
      "MessageIndex": 1,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/769228",
      "Title": "Stage IIIA - One year & Half lolita85 lolita85"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Mar 23, 2010 10:42PM Gitane wrote: Sincerely hoping that this is not a recurrence.  Worry about how we are affecting our families is just part of the package I guess.  However, if it was your husband who was having to deal with this you would want to know and you'd want to help.  You will know what to do when/if you need to deal with this again.  Hugs.",
      "MessageIndex": 10,
      "PostDate": "23/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750059",
      "Title": "How do I tell my family again sdavis jc3win"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Oct 8, 2009 11:46PM Gitane wrote: A wonderful person who used to post here, Rovergirl, was accepted into a clinical trial using this drug in January '09.  She had just been diagnosed with a small lesion on her liver shortly after completing her adjuvant treatment. She was being treated in Washington state, in Seattle I think.  I don't know if adriamycin was part of the mix, and I don't know if the drug was helpful as she stopped posting.  I just thought I'd let you know that it is being researched in some types of metastatic breast cancer.",
      "MessageIndex": 9,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/741725",
      "Title": "Drugs to prevent spread of BC to organs lrsreyes lrsreyes"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 3, 2008 07:52PM Gitane wrote: To Kari's family and all who loved her, may you find the strength you need in your loving memories of her.  The sisters here have been changed by her presence in their lives; it's evident in all the beautiful posts.  Love to you all at this very sad time.",
      "MessageIndex": 50,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708474",
      "Title": "Kari is our latest Angel djd Rocktobermom"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 26, 2010 09:47PM Gitane wrote: Hello oaklandmama,    I was given scans like you are being given after my SNB and before my treatment decisions were made.  My oncologist and surgeon were being diligent and looking out for me.  Getting the scans does not mean they suspect anything necessarily, especially if you have no symptoms at all, which seems to be the case.  It is a baseline, as they said.  In my case they took out 9 nodes for testing.  I was given a baseline PET/CT, too.  Believe me, I was scared, too.  I still am, for that matter, it's just that the fear isn't in my head as often or as loud.  You are so young to have to go through this,  I wish this had not happened.  I will be thinking of you next Monday as you go through those scans and Tuesday as you get more information.  Please let me know if I can help.  Hugs! G.",
      "MessageIndex": 1,
      "PostDate": "26/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/761227",
      "Title": "waiting on snb results after bmx oaklandmama Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 17, 2010 04:41AM Gitane wrote: I happened to be reading your discussion and it reminded me of an article I read.  It is from the College of American Pathologists where they discuss the new guidelines labs will follow beginning 2011 to be sure the ER and PR measurements are accurate and standardized.  Very interesting discussions are within the article if you don't mind plowing through it.  The people here are the leaders in the field and it's interesting to read what they say.  I'll copy some of it here. On one point, everyone agrees: Current ER/PgR testing, regardless of how accurate it is, doesn’t tell the whole story. “For all practical purposes,” says Dr. Osborne, “having a correct positive ER or PgR result doesn’t guarantee that the hormonal therapy will work.” \"And, says University of Michigan oncologist Daniel Hayes, MD, another co-author of the guideline, the benefit seen from hormonal therapy seems to level off at about 30 percent to 50 percent positivity. “A patient is not more likely to benefit if her tumor has 100 percent positive cells versus 50 versus 30.” \" This is where you can read it.  Sorry I am unable to paste a link. http://www.cap.org/ Making ER/PgR practices toe the line Feature Story    ",
      "MessageIndex": 55,
      "PostDate": "17/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/759924",
      "Title": "Early stage BC and Zometa kathylev weety"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 2, 2011 08:39PM - edited Feb 2, 2011 08:42PM by Gitane Sharon, I've been thinking about you since I wrote earlier.  You know, I think we go through a kind of post-post-post treatment/surgery period where we slowly start feeling again.  By that I mean we let some of our numbness start melting away slowly. Early mornings are when I notice it most.  You are recovering from major surgery, some traumatic life events, you are at the end of a very long road, you are at a place where you hoped to be for so long.  I don't know.  It's kind of like the end of a trail and then you say, \"Now what?\"  Little by little we begin to cautiously come back to letting ourselves feel things.  Well, a long winded way to say I have experienced, and am still experiencing that.  Wish I could give you a big hug (or you could give me one).  G.",
      "MessageIndex": 6,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764302",
      "Title": "Tears and PTSD pupfoster1 nobleanna007"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 5, 2011 03:22PM Gitane wrote: ((((Sharon)))),  I dream like that, too.  It seems to be a time where I re-live stuff, although the context/people is sometimes a bit different than reality.  I seem to be working to solve problems, even problems that haven't happened yet.  Not that restful.  No wonder mornings are rough.  Hugs to you, G.",
      "MessageIndex": 14,
      "PostDate": "05/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764302",
      "Title": "Tears and PTSD pupfoster1 nobleanna007"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 12, 2008 05:17AM Gitane wrote: Janis, I am glad you posted. I have been thinking about you all day as I did this and that; somehow most things aren't as important as they used to be, cancer sure changes that big time. I don't know. Can we prepare for stage IV? I am doing it, too, sure that I'll be there and wishing there were a way to get ready for it, wishing there were a way to make it better for us somehow. Reading tonight about all of you feeling that way, too, makes me feel a bit less alone. I'm hoping that your treatments are going to work well and that we'll be helping each other for a very long time to come.",
      "MessageIndex": 17,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707172",
      "Title": "New Phase in the journey?? Fitztwins wallan"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 12, 2010 12:11AM Gitane wrote: When I listen to the presenters at the teleconference they seem to be saying that in postmenopausal women recurrence risk is lowered 29% with Zometa.  In premenopausal women over 40 who had their estrogen production shut down by Goserlin there was also a 30% recurrence risk reduction with Zometa.  In women younger than 40 it seems Goserlin does not lower their estrogen levels enough for Zometa to be effective on its own.  I understand them to say that their hypothesis is that estrogen deprivation kills some cells and that the effect of Zometa on the bone microenvironment may keep remaining cells from getting the growth factors they need to survive and spread.  It seems that women under 40 may need an ooph and/or some other mechanism beyond Goserlin to stop all estrogen production in their bodies in order to benefit from Zometa.  This is what I am understanding from what I have heard and read so far.",
      "MessageIndex": 25,
      "PostDate": "12/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761792",
      "Title": "Zometa - Latest News out of San Antonio Meeting voraciousreader Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 6, 2012 04:02PM Gitane wrote: What a nice house party you must have had for your birthday!  You look so beautiful in your picture.  I am so glad you are content and the birthday was so special.  Hugs and happy birthday,  G.",
      "MessageIndex": 16,
      "PostDate": "06/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/795888",
      "Title": "I turned 45 ! Karina kathleen1966"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 16, 2009 09:40PM Gitane wrote: Apple,  I'm so happy for you, you're through treatment and living life! Yes, hair, ain't it grand.  Knowing no more treatments, YES.  Femara can take the wind out of your sails (for me depression, aches, and fatigue, like we don't already have fatigue from treatment), so be ready for it.  It helps to be prepared, then you can say, \"Oh, it's just that stupid Femara, I'm O.K.\"  Get out there and live, live, live your beautiful life! ",
      "MessageIndex": 11,
      "PostDate": "16/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/737504",
      "Title": "still Stage III we think apple apple"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 10, 2011 04:03PM Gitane wrote: I'm not a newbie, but I like to read that you are doing well.  Congratulations,  G.",
      "MessageIndex": 6,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779319",
      "Title": "All clear mammo for me too. caaclark eine"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 28, 2008 09:41PM Gitane wrote: (((Hugs.)))) Gitane ",
      "MessageIndex": 16,
      "PostDate": "28/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720284",
      "Title": "Brain Scan Results: Not Good TripleNeg cneal318"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 8, 2008 04:44PM Gitane wrote: Hi Moody,  You can ask your doctor for a copy of your Oncotype DX test results if you want them.  They are yours, after all.  You can go to the Oncotype DX website to see a sample copy of a report to compare with the one you were shown.  The score was developed based on the recurrence statistics for different study populations.  The score is not the same as a percent of risk.  For example, a score of 25 may give you a 15% risk of recurrence in the first 10 years.  There is information on this that should have been given to you or mailed to you if you had this test done.  This information is also available on the Oncotype DX website. www.genomichealth.com/oncotype... ",
      "MessageIndex": 8,
      "PostDate": "08/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 26, 2010 12:33AM Gitane wrote: Hi Anna,  What a year this has been for you.  I'm so glad you are fine.  It seems an ultrasound is a very reasonable request under the circumstances.  Squishing that poor radiated boob is just too much.  I'll keep you in my thoughts and keep fingers crossed for you that all will be very, very normal.  Big HUGS! G.",
      "MessageIndex": 2,
      "PostDate": "26/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748955",
      "Title": "Mammo Tomorrow amlg1 Shanagirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 11, 2008 12:09AM Gitane wrote: Hello HopeforBest, You are not alone in your feelings of fear and confusion.  This is something we have all experienced.  Westie is right on in saying you should just take each day one at a time and try not to look ahead and overwhelm yourself.  Our brains are masters at making us worry.   Asking for anti-anxiety meds is also good advice.  If you read posts here you will see that many of us do this, it is not a sign of weakness.  Taking care of yourself like this, getting enough sleep, etc. will help you cope. It is not unusual for the diagnosis to change as the doctors gather more information with scans, biopsies, etc.   Time seems to drag when we are waiting for the information that comes with each diagnostic step, anticipating treatment ahead.  Come here to talk about your feelings and experiences.  It will help.  HUGS.  ",
      "MessageIndex": 2,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724226",
      "Title": "Bilat Mast, Chemo, Rad HopeForBest HopeForBest"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 19, 2011 02:43PM Gitane wrote: My oncologist explained that it was common for cells to develop resistance to chemo after treatment.  He also said my cells may have had de novo resistance and having had AC was not the issue.  Since I did not have sensitivity testing done before treatment I will never know the answer to this.  Why this resistance develops and why it develops to other chemos I don't know.  That would be a good question to ask someone who knows a lot more than I do.  If you get answers to this I'd appreciate it if you would share them with me. I have never met anyone else who used Rational Therapeutics, but I know that many, many people do.  To be honest, I am not active at all in the local breast cancer community, so would not be likely to know anyone personally.  My oncologist and my breast surgeon both use Rational Therapeutics regularly.  The gynecological oncologist I go to (for a simple hyst., no cancer there, thank goodness!) also uses his services.  RT is used by doctors and their family members especially.  Dr. Nagourney has a reputation as the doctors' oncologist.  His services are used a great deal here in southern California, perhaps because he is located here. I will keep you in my thoughts.  Hugs,  G. ",
      "MessageIndex": 10,
      "PostDate": "19/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770400",
      "Title": "Any survivors with experience with chemo cell-death assays? NKCell babs6287"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 11, 2011 11:27PM Gitane wrote: I had both neo and adj. at my oncologist's suggestion.  I know it is done, but it depends on the agents being used and the oncologist's assessment of the benefit/risk involved.  Chemo is carcinogenic in itself, so you have to use it judiciously.",
      "MessageIndex": 2,
      "PostDate": "11/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763235",
      "Title": "Anyone do Neoadjuvant AND Adjuvant chemo? NannaBaby anna4969"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 20, 2011 04:54AM Gitane wrote: NannaBaby,    I know it is hard to hear that you need more chemo.  I can remember being told that, too.  As crumby as it is to face more treatment, you know your doctors are doing everything they can to see that you are healthy.  You are right, we want to do it right the first time.",
      "MessageIndex": 13,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763235",
      "Title": "Anyone do Neoadjuvant AND Adjuvant chemo? NannaBaby anna4969"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 25, 2009 12:49AM Gitane wrote: You have asked the question we all have after treatment.  How can we catch this as early as possible, and will it make a difference.  The conventional wisdom is it will not matter.  If it caught early by scans or later by symptoms, it doesn't matter.  I don't believe this.   I think earlier may be better, especially if there is a treatment that may slow it down and relieve/prevent symptoms.  On the other hand, I don't know what all the tests and scans do to our bodies.  My oncologist does bloodwork every 6 months.  I have my Zometa infusions at that time.  I have had no scans.  I think I could get them if I asked, but I never have.",
      "MessageIndex": 1,
      "PostDate": "25/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745833",
      "Title": "Question re: scans after treatment ends.. Mom3 jpsgirl96"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 21, 2012 06:07PM Gitane wrote: All good stuff, Laurie.  3 years!!!  I'm happy for you.  Love your kittie, too.  G.",
      "MessageIndex": 18,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782968",
      "Title": "3 years, but who's counting... :p Laurie09 lexi4"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 28, 2011 11:36PM Gitane wrote: Hi Christy,   Do you remember back on July 2 I mentioned about reading an article that linked Tamoxifen and Lobular BC?  Well, here it is.   http://www.medicalnewstoday.com/releases/146945.php Small quotes from this article: \"The researchers are trying to understand why some women with estrogen receptor-positive (ER+) invasive lobular breast cancer do not benefit as much from hormonal therapy such as tamoxifen when compared to women with other forms of ER+ breast cancer. Each year in the U.S., approximately 127,000 women develop ER+ breast cancer, and an increasing percentage of these are specifically diagnosed with invasive lobular breast cancer. \" \"This study continues a string of discoveries the researchers have made regarding tamoxifen resistance. They had earlier found that invasive lobular breast cancer has many more so-called \"gamma\" estrogen-related receptors than the typical \"alpha\" estrogen receptors that tamoxifen was designed to inhibit. \" This is far from being in depth or long term research.  Just thought I'd share it with youl  Giant hugs,  G. ",
      "MessageIndex": 18,
      "PostDate": "28/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/770977",
      "Title": "AIs - am I going to have to go on disability? AnacortesGirl AnacortesGirl"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 11, 2008 11:22PM Gitane wrote: It must be so hard to put up with all this, Deb.  You have been through more than your share, that's for sure.  I hope you will be feisty as ever as soon as possible.  I am reading in your post that the doctors expect improvement, that's something to hang on to at least while you endure the frustration of not being able to do the things you want to do.  It must have taken a super human effort to type all that you did here.  I really appreciate that you did that. I feel very connected to you and think about you every day.  Please do whatever you can to keep the faith.  We will do what we can to stay connected, too.  Lots of hugs and love goin' your way.",
      "MessageIndex": 3,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721061",
      "Title": "Feel stuck in place....venting AlaskaDeb RIV54"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 13, 2008 01:16AM Gitane wrote: The reservoir is working, you can see (a little), a bit of energy is returning, sucky mornings.  Well 3 out of 4, that's a start.  I'm so happy you were able to go to Katie's swim meet.  Normal stuff feels good.  Thank you for coming here, we need you!",
      "MessageIndex": 54,
      "PostDate": "13/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721061",
      "Title": "Feel stuck in place....venting AlaskaDeb RIV54"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 12, 2008 11:12PM Gitane wrote: Perhaps it would be better to try to evaluate your chemo response based on pre/post MRIs.  Did they do an MRI after chemo?  Mammograms are not very reliable with ILC.  Some doctors don't do post treatment MRIs because they feel that the pathology after surgery will tell them everything they want to know and delaying surgery to try another treatment is just waiting too long.  Others feel that the MRI might help them decide to try a different chemo before surgery.  Was this talked about at tumor board or with you?",
      "MessageIndex": 1,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724322",
      "Title": "mammo looks the same post chemo JanDun1 JanDun1"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 17, 2011 02:48PM - edited Jun 17, 2011 02:49PM by Gitane I had the test done by Rational Therapeutics on my residual breast tumor cells after 4 rounds of AC.  By that time the tumor cells were resistant to everything they tested except AC.  It was still responding to that at an \"intermediate\" response level, so I had 2 more rounds of AC.  Had the testing not been done, the plan was for 12 weekly rounds of Taxol.  The testing showed the cells were resistant to Taxanes, so I'm pretty sure I was saved from a probably useless chemo and saved the Taxane SE's.  They test chemo combinations as well as individual chemos.   I think this is a very useful test.  There is a bad side to it, too, knowing that after 4 rounds of AC my tumor cells had developed resistance to almost everything available.  That's a bit hard to take.   G. ",
      "MessageIndex": 7,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770400",
      "Title": "Any survivors with experience with chemo cell-death assays? NKCell babs6287"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 21, 2009 02:25PM Gitane wrote: It had to be a shock to find out that he wasn't monitoring you the way you thought he was.  Whether you wanted to know the details of that monitoring or not is not the point.  It diminishes the trust we have for our doctor when the communication breaks down like that.  I think I would have done just what you did under the circumstances.  Hopefully, this incident will lead to getting the surveillance you want from now on.  Hugs.  G.",
      "MessageIndex": 2,
      "PostDate": "21/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/740715",
      "Title": "TM Test - not run everyminute apple"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 4, 2012 09:56PM Gitane wrote: (((Torridon))),   I don't know if this will help you, but I will share what I have learned.  Your body has been damaged and chemically altered by your treatments.  If you are on a hormonal, it is being continuously chemically altered by that.  It's a very big deal.  It has also been assaulted by your surgeries.  Don't underestimate the impact.  Under your thinking brain is an emotional layer that is, as you said, screaming.  It is looking for logical reasons why you are spinning out of control (past experiences/present and future losses, plain old survival instinct), but remember emotions aren't logical, they just are!  You need to heal, your body needs to recover from the assaults and adjust to the drugs you may be taking. You need to live in this void for a while so this can happen.  It helps to let the emotions come as they will.  They will come in waves, and pass. It's scary but letting them come and go helps them to slowly lessen in intensity. Your emotions are on overload.  You cannot think your way out of that! There are ways to look at your thinking, what your mind is doing, that help you observe this and be able to let it go. We do not have to let the \"helpless, hopeless\" messages we get inside become our reality.  Meditation, Yoga, guided imagery, body scans, relaxation techniques taught at the cancer centers are great.  You can learn these and they can help you the rest of your life.  There is nothing wrong with meds, too, to get you over the roughest patches.  Then there is the ever present fear and sadness.  Over time we are somewhat surprised to find that gradually, with no effort on our part, that starts to move over and allow something else.  However, it takes time.  That's also hard for us to allow.  At least it was for me.  I was so sad, so very sad.  I didn't know any way to handle it at the time and it took over my life.  I hit bottom about a year after I completed treatment.  It took me so long because I didn't know what to do and didn't ask for any help.  I've learned since that there are things I could have done, am doing now, that help me.  You are normal.  It's just so hard sometimes. Hugs,  G. ",
      "MessageIndex": 10,
      "PostDate": "04/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/790647",
      "Title": "I didn't ask for much in life.... Torridon Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Apr 27, 2009 07:35PM Gitane wrote: Stacey,  Does the medical system in the UK leave the decision making about your health in this instance in your hands or your doctor's and psychologist's?  That is, if you have taken their opinions into account and as a legal adult still want this surgery, will they perform it?  ",
      "MessageIndex": 12,
      "PostDate": "27/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/733179",
      "Title": "y do they think this is the wrong thing to do? staceyroberts2007 hrf"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 5, 2009 08:08PM Gitane wrote: Very, very good news, Bobbie.  Thank you for letting us share the happy occasion.  May each day continue to bring you love and happiness. G.",
      "MessageIndex": 8,
      "PostDate": "05/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/739970",
      "Title": "A New Day SpunkyGirl Diana63"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 15, 2009 02:00AM - edited Sep 15, 2009 02:01AM by Gitane You must be a very proud lady, a triathlon is not easy!  Congratulations!!!!!  Also, super, powerful. good wishes for a very uneventful oncologist visit.  I know how it feels.  I'm a \"head-in-the-sand person\", too, when it comes to tumor markers. Don't want to know. Had my 3rd Zometa infusion last month and all went well.  Hope yours is the same. G.",
      "MessageIndex": 8,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/740346",
      "Title": "I TRI-ed everyminute everyminute"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Apr 7, 2008 06:31PM Gitane wrote: My thoughts are with you. May it go quickly and may you get very good news.",
      "MessageIndex": 12,
      "PostDate": "07/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703555",
      "Title": "possible lung mets bcs75 Dukemom2"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 18, 2009 12:24AM Gitane wrote: katherineH,  This is a good place to come with your questions and to talk.  Others will be along here soon, too.  Just wanted to pop in and say, \"Hi!\".  I didn't know about this board when I was getting chemo back in the fall of 2005; I wish I did because I know it would have helped.  Sounds like you are getting good care and holding it together pretty well emotionally.  Once you know your chemo there will be ladies here to help you with questions about side effects, self-care, and resources. I know what you mean about getting it over with.  I said almost those exact words to my oncologist at our first meeting.  Hugs. G.",
      "MessageIndex": 1,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/734360",
      "Title": "Wating to start Chemo katherineH katherineH"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Mar 13, 2013 04:20PM Gitane wrote: Hi Barb,  Sorry I'm so late, but very happy to be able to say congratulations.  What great news. ",
      "MessageIndex": 21,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/801582",
      "Title": "4 YEARS ALREADY! Shanagirl lovujja"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 4, 2008 11:49PM - edited Sep 4, 2008 11:54PM by Gitane LisaF,  The questions you are asking are the same as mine.  I found this on the web. These are the presentations that were made at the Southwest Oncology Group Meeting this spring.  There is a slide that is part of the presentation made by Kathy Albain.  The title on the slide is \"Comparison of CAF-T to Tamoxifen Alone,  DFS adjusted for nodal Status\"  It shows SWOG 8814 patients DFS rates broken down by Oncotype DX RS and for \"First 5 Years\" and \"Greater than 5 Years\"  Looking at this slide it appears that Low RS patients treated with Chemo benefit from that chemo treatment in the \"Greater than 5 Years\" period just like the Intermediate and High RS groups.  If you get a chance to look at this, tell me what you think. https://swog.org/Visitors/Plenary0805.asp Group Meeting   The following presentations were given at the Plenary Session of the Spring 2008 Group Meeting in Atlanta, Georgia, \"Southwest Oncology Group Showcase 2008.\" They are in Windows Media Video format, and should automatically start in the default player for .wmv files on your computer when you click the icon at the right of the presentation title.  SWOG-8814: Prognostic and predictive value of the 21-gene recurrence score assay in postmenopausal, node-negative, ER-positive breast cancer (SWOG-8814, TBCI-0100)  Kathy S. Albain, M.D. Professor of Medicine, Hematology and Oncology, Loyola University, Maywood, Illinois ",
      "MessageIndex": 7,
      "PostDate": "04/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720617",
      "Title": "metastasis may occur sooner than previously thought gandl Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 5, 2010 11:20PM Gitane wrote: Mary,  Just found your post.  Good news.  Love it.",
      "MessageIndex": 30,
      "PostDate": "05/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746282",
      "Title": "its all about me everyminute KerryMac"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Aug 25, 2008 08:21PM Gitane wrote: Holding your sister and you both in my thoughts right now.  Warm hugs and love!",
      "MessageIndex": 11,
      "PostDate": "25/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720031",
      "Title": "My sister allmans LuAnnH"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jun 1, 2008 10:01PM - edited Jun 1, 2008 10:01PM by Gitane photogirl107, I'm not sure why you would need radiation if your doctors are telling you that the mastectomy gave you clear margins. Sometimes if the cancer has invaded skin, muscle, or lymph nodes, or if the tumor was large to begin with, radiation is given just to be on the safe side. Are any of these things true in your case?",
      "MessageIndex": 32,
      "PostDate": "01/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/702584",
      "Title": "What happens Next? angie27 hazelfox36"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 2, 2011 06:14PM Gitane wrote: I've had sneak attacks of tears, too.  As surprising as they are, it does feel better to get the emotions out.  When we share this, it helps, too.   You have been to a kind of war and back.  ((((Sharon))))",
      "MessageIndex": 5,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764302",
      "Title": "Tears and PTSD pupfoster1 nobleanna007"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 26, 2010 01:51AM Gitane wrote: Welcome, Sharon.  I hope you will come here often so we can get to know you.  This site has helped me so much.   I am an animal lover, too.  I was a dog person most of my life, but now it's cats.  I care for 12 of them.  It's my daughter's fault.  She does catch and release for feral cats, volunteers at the no-kill shelter, and brings us cats that need lots of TLC.  We're the softies in our neighborhood, too, so care for the ones no one else will.  They really are wonderful. We can't resist. The advice above is better than any I can give, so I'll just say, \"Hi\" for now.   Hope your treatments to come are easier on you.  We are here for you, any day you need us.",
      "MessageIndex": 18,
      "PostDate": "26/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747296",
      "Title": "Newbie Here pupfoster1 victoriasecret"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Sep 24, 2012 09:46PM Gitane wrote: So happy to see you are healthy and happy, Mary-Anne.  Thank you for sharing with all of us.  Hugs,  G.",
      "MessageIndex": 22,
      "PostDate": "24/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/793890",
      "Title": "Seven years and counting! maryannecb maryannecb"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 15, 2009 08:25PM Gitane wrote: Hi Karen,  I'm an ILC, not IDC, and nobody can really tell me if I'm Stage IIb or IIIa.  In the grand scheme of things it doesn't matter what number we get.  We are all in the cancer soup here and need each other.  I got chemo, surgery, chemo, too.  Starting on this road is very disorienting to us all.  We have lots of questions and our emotions are all over the place.  The women here know what it's like and can help so much.  Welcome, and come here whenever you like.  We are here for you.",
      "MessageIndex": 21,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/737408",
      "Title": "New Comer AsiaYM victoriasecret"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 1, 2010 04:33PM Gitane wrote: Like AnacortesGirl, I will work at keeping the faith, too.  It's so true, this experience really teaches us how life is to be lived now.  To all of you, happy new year.",
      "MessageIndex": 14,
      "PostDate": "01/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746105",
      "Title": "Happy New Year! DCMom NancyD"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "May 21, 2009 04:37PM - edited May 21, 2009 04:44PM by Gitane Tumor Markiers - in blood samples are using monoclonal antibodies to measure proteins (antigens) given off by the MUC1 gene. I think this gene is associated with immune response and the protein is found on/in many different types of breast cancer cells. In each individual it is different.  Tumor markers change over time, serial measurements; it's the percent of change in a given time that has to be interpreted by the oncologist.  Tumor markers are not reliable in 1/3 or more of us.  If they are going down or disease is stable that has to be good news. ",
      "MessageIndex": 8,
      "PostDate": "21/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734562",
      "Title": "1st Post Treatment Scan Results respin bmdaley"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 7, 2009 12:50AM Gitane wrote: Hi Annie,  So kind of you to take time to share this very happy moment with us.  It means so much to hear the good news!  May you continue to be healthy and have many more reasons to celebrate in the coming years. ",
      "MessageIndex": 15,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743390",
      "Title": "5 years out Annie62 Moissy"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 6, 2010 07:44PM Gitane wrote: I'm glad you shared your great hair day with us.  It brought back some good memories for me.  Your \"short\" hair must look great.  ",
      "MessageIndex": 4,
      "PostDate": "06/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747940",
      "Title": "Good hair day !!! victoriasecret victoriasecret"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Feb 17, 2011 09:48PM Gitane wrote: My situation is similar to yours, but I was postmenopausal at diagnosis.  My oncologist said I should have the Zometa.  I agree with him.",
      "MessageIndex": 63,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761792",
      "Title": "Zometa - Latest News out of San Antonio Meeting voraciousreader Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 10, 2010 11:03PM Gitane wrote: This link is to a teleconference held by the presenters of this data at the 2010 SABCS on December 9 (updated on December 10).  It has links to the slides they presented as well as an interview.  What I found most interesting was the overview of the difference between the study populations in the ABCSG trial and the AZURE trial.  The presenter slides from the Austrian group make a strong case for the efficacy of Z. acid in premenopausal patients being treated with endocrine therapy.  There is also a slide showing the different effect in the Austrian trial on women below 40 years of age and those above 40 years of age.  Finally, I noticed in one slide of the AZURE trial that Z acid lead to a reduction of 5% in bone mets in the overall population.  I don't know if this was only in postmenopausal women or not.  I couldn't tell. http://www.aacr.org/home/public--media/multimedia-/aacr-podcasts/ctrc-aacr-2010-sabcs-teleconferences-and-podcasts/results-of-the-azure-trial-teleconference.aspx I'm sorry I am unable to paste a link here,  my computer just won't do it. ",
      "MessageIndex": 11,
      "PostDate": "10/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761792",
      "Title": "Zometa - Latest News out of San Antonio Meeting voraciousreader Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jul 7, 2008 10:21PM Gitane wrote: Amazing a doctor can be so clueless, isn't it?",
      "MessageIndex": 24,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/704851",
      "Title": "Well here is a dump arse comment.. Fitztwins pdb"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Jan 9, 2010 12:37AM Gitane wrote: Together in love, and living each minute fully.  I will hold this inside and remember it.",
      "MessageIndex": 48,
      "PostDate": "09/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746352",
      "Title": "A message from River's husband Fitztwins lizws"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Oct 21, 2008 09:42PM Gitane wrote: waterlily,   Yes, I can understand how very much this means.  That's why I feel so good at learning of this good news. Thank you for sharing this. ",
      "MessageIndex": 22,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723132",
      "Title": "New grandbaby! waterlily Gitane"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Dec 29, 2010 12:39AM Gitane wrote: Congratulations on the clear nodes.  Hope other reports are good, too. G.",
      "MessageIndex": 6,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762609",
      "Title": "My Nodes Are Clear! mdg jan508"
    },
    {
      "AuthorID": "Gitane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63177/profile",
      "Content": "Nov 8, 2009 04:00PM - edited Nov 8, 2009 04:01PM by Gitane Since it's neoadjuvant, will they do an MRI at the end of the Taxol to see how it worked?  I don't know that it matters, but if seeing that it worked or not would influence your decision to take a break an MRI might help.",
      "MessageIndex": 8,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743484",
      "Title": "Thoughts on taking break between Taxol and AC AnacortesGirl LittleC"
    }
  ]
}