{
  "AuthorID": "gladylady",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108557/profile",
  "Posts": [
    {
      "AuthorID": "gladylady",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108557/profile",
      "Content": "Sep 4, 2010 09:38PM gladylady wrote: Dx'd recently and still can't believe it. I have been upset and may not have even gotten all of the dx info correct signing up tonight. I have survived a double fatality auto accident in 2001 and just don't feel i have the energy to get thru this. I think i need some help getting past the 'I don't want this, this is not happening to me' frame of mind. Basically, i need to get my act together so the cancer doesn't win. Thanks  to all for the good information on contacting resources, keeping records, separate billing. Lucky for me this is a holiday weekend and i have some time to get these things started. Would like some input on how to move forward, it's pretty uncomfortable being stuck where i am.",
      "MessageIndex": 3516,
      "PostDate": "04/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "gladylady",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108557/profile",
      "Content": "Sep 5, 2010 05:38PM gladylady wrote: seyla- thanks for the support. i have been able to focus my energy today on putting together all of my medical information, plans for attacking insurance problems that i know will come- i changed jobs and insurance.Actually feeling some what better just knowing there are so many women out there who have survived this experience. Saline or gel? any thoughts?",
      "MessageIndex": 3524,
      "PostDate": "05/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}