{
  "AuthorID": "Glenda58",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117806/profile",
  "Posts": [
    {
      "AuthorID": "Glenda58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117806/profile",
      "Content": "Jan 5, 2011 03:38PM Glenda58 wrote: Hi all and Happy New Year. I was diagnosed with IDC Stage 2 in November after an abnormal mamogram. I tested positive for the BRCA 2 gene, so I'm going with the bilateral mastectomy on January 7, just 3 more days. I'm not doing any reconstruction, although I can change my mind at a later date. Tomorrow I will have a preop EKG. Starting to feel very nervous about the surgery and taking care of the drains, but I know I will get through this. Chemo will follow about a month after surgery.  Cyber hugs to all",
      "MessageIndex": 108,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "Glenda58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117806/profile",
      "Content": "Jan 5, 2011 04:47PM - edited Jan 5, 2011 04:48PM by Glenda58 Thanks Candy for your response and I will be thinking of you as well. I had my EKG today and my heart is beating just fine, lol. My omo and sister will be coming to stay with me tomorrow to help and cook. My hubby can only take off Friday and will be home the weekend, but has to go back on Monday. I also have fibromyalgia and chronic fatigue so I'm expecting to be exhausted.Getting my last haircut tomorrow before it starts falling out from chemo next month. Need to clean now and get my suitcase packed for Friday. Good luck to all in this thread of January surgeries. I will be praying for all of you. God is good all the time. Glenda",
      "MessageIndex": 114,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "Glenda58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117806/profile",
      "Content": "Feb 9, 2011 10:11PM Glenda58 wrote: Hi all So glad to hear everyone is doing good.  I start my 1st chemo tx tomorrow, so a little nervous tonight. I probably won't be able to sleep much, but my mom and sis will be with me(she's  been through it before for ovarian ca) so I will have some good support with me.Plus I have to be strong, I can't have her showing me up, lol.  But I know the tx can't end unless they start, so chemo clinic here I come. I'm going to bed early tonight and hopefully get some reading done. Prayers for all but especially for anyone having any procedures tomorrow. Take care all.",
      "MessageIndex": 522,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "Glenda58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117806/profile",
      "Content": "Feb 14, 2011 10:37PM Glenda58 wrote: Hi all,  1st chemo went well Thursday. I've been feeling pretty good, had some friends over Sat night to watch the Bud shoot out Nascar race on our bigscreen. Long day yesterday, pot luck after church, then went to visit a friend having surgery today for colon cancer. I'm very tired today, but couldn't nap. Hopefully I can sleep tonight.I haven't had any problems with nausea, which I am so very thankful for, but my heartburn is getting worse as of yesterday, so I will call fam doc tomorrow. See onc on Thursday. Hope all is going well for rest of you. I pray for all of you everyday. Love to all  Glenda",
      "MessageIndex": 552,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "Glenda58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117806/profile",
      "Content": "Jan 7, 2011 12:35AM Glenda58 wrote: surgery in am, don't think I can sleep tonight, but I will lay down and read and hopefully doze off. Talk to you in a few days. Good luck with upcoming surgeries. I'm praying for all of you. Glenda",
      "MessageIndex": 131,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "Glenda58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117806/profile",
      "Content": "Jan 25, 2011 04:43PM Glenda58 wrote: Well, I'm back. I had my sx on January 7 and did really well. There are a few cancer cells in one of the lymph nodes they removed so I will have chemo starting Feb.10.Had an appointment with chemo nurse and it looks so cramped except for 3 semi-private rooms. Hopefully I can get in one of those most of the time. I'm getting a port and muga scan on Monday,but TOMORROW my drains are finally coming out (18 days now).YeeHa. I've been in kind of a depressed mode lately. I have lymphedema in both arms, but worse in left.That is so painful. I have chronic muscle pain everyday, but this nerve pain is totally different.That seems to be getting better with medication, so all is better today.Possibly wig and turban shopping tomorrow. Talk to you then.",
      "MessageIndex": 326,
      "PostDate": "25/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "Glenda58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117806/profile",
      "Content": "Feb 2, 2011 09:44PM Glenda58 wrote: Bo Binney, not yet, just got paper today and will make appt tomorrow for it. It's pretty close, about 7 miles is all.",
      "MessageIndex": 438,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "Glenda58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117806/profile",
      "Content": "Feb 3, 2011 11:28PM Glenda58 wrote: I went to chemo dr. today. Muga scan came out fine and port is healing well, although it is still very sore. So I guess I'm all set for chemo next Thursday. My hubby was going to go with me, he is now working 10 hr shifts and won't get home til 3:30 a.m., and my appt is at 9:00. So I called my mom and she will come up Wednesday (she lives 2 hrs away). She is 78 and in good health, I can't even imagine losing her. I hate to say it, but I'm glad the bc runs on my dad's side. But enough of that kind of talk. I hope anything that is going on tomorrow, surgeries or dr. or chemo appts all goes well and may God be with you on your journey. Buy for now.  Glenda",
      "MessageIndex": 447,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "Glenda58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117806/profile",
      "Content": "Feb 2, 2011 10:32PM Glenda58 wrote: Hezzy, try American Cancer Society. I got a very nice one for free through their patient resource center.I haven't been able to wear it yet, due to my port insertion on Monday, but I heard it's very comfy.",
      "MessageIndex": 439,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    }
  ]
}