{
  "AuthorID": "GLim",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254402/profile",
  "Posts": [
    {
      "AuthorID": "GLim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254402/profile",
      "Content": "GLim wrote: I'd like to start this post by apologizing. I'm a forum newbie. It's my first post and I'm asking for help. I have read the rules and Recently my 29 y.o. wife and mother of my two children was diagnosed with stage 2a breast cancer. The news came so quickly and it kept coming. The tumor is 3.4 cm. After doing a follow up chest X-ray, bone scan, and MRI, they found: a 3.4 cm dark spot on her liver strange looking spots in her lungs nothing special on her bones. The doctor phoned us after the test results telling us that the liver and lungs \"didn't look as if to be cancer.\" For the first time in a while we felt a sense of relief and happiness. This past weekend we smiled and laughed for the first time. Today we went to the doctor for our official results. He said he hadn't had a chance to check the PET scan before calling us and there was cause to be concerned. 3 of her ribs have an SUVmax of 1.4 (delayed max 1.7) Her lungs have an SUV max of 1.2 (delayed max 1.4) Her original breast cancer has an SUV max of 11.1 (delayed max 12.2) In terms of general health, she does not yet feel any discomfort, pain or otherwise. She just feels tired (understandable because we are new parents, and the current medicine she takes makes it hard to sleep). ======== If anyone has ANY answers, or just positive support, I'd really appreciate it. 1.) I have read 2.5 or more is typically concern for cancer, but I'm not sure if that's mets, or an initial cancer diagnosis. 2.) If it is mets, I know these values are \"low\" but that's it has spread everywhere, could this be terminal? How much time might we have? 3.) Why is there no SUV max for that giant liver thing? 4.) Other than cancer, what in her ribs or lungs might cause an increase in SUV? 5.) If her lymph nodes exhibit no evidence of cancer, does indicate it may not be mets? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/856236",
      "Title": "Can anyone please help with some PET scan SUV questions? GLim ElaineTherese"
    },
    {
      "AuthorID": "GLim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254402/profile",
      "Content": "Jun 20, 2017 02:38AM GLim wrote: Thank you so much for your posts. They are very helpful to me. Kicks, keep going and thanks for your inspiration. Elaine, I believe her HER2 is neutral (it is 2). I'm not sure what this means... \"Has her cancer been fed by hormones (ER+/PR+)? \" but she is taking tamoxifen, and I believe the breast cancer was caused because of hormone levels. They tell us lung and bone biopsies are a little difficult so in two days we'll do \"a stronger chest x-ray\" (sorry my doctor's English didn't really translate very well. We are trying to be positive, but the suspense really is stressful.",
      "MessageIndex": 3,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/856236",
      "Title": "Can anyone please help with some PET scan SUV questions? GLim ElaineTherese"
    },
    {
      "AuthorID": "GLim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254402/profile",
      "Content": "Jul 8, 2017 11:17PM - edited Jul 8, 2017 11:18PM by GLim Micmel, You wanted to hear about stories behind the person. I am married to my best friend, soulmate and super-mom. I'm a Canadian and she is from Taiwan, we met in Canada, then I moved to Taiwan to teach English. We started dating, fell in love, got married and had kids, though not necessarily in that particular order haha. After 4 years of marriage she still makes me laugh, we still hold hands and we recently had a second baby. We pretty much live in one bedroom and a living room but we were happy. My wife was recently diagnosed stage 4 cancer. (de novo, which means she had it before her check up)... Just came out of nowhere, no history, no symptoms, generally healthy, 29 years old. Her prognosis is luminal B cancer, a quite aggressive one. It sucks and we spent the first three weeks straight crying and desperately searching for spirituality, thinking about the worst case scenarios. It gets better though. After the emotions flood forth, it leaves you stronger than you were before. Excuse me if you've heard this before, but I think this anecdote is apt in this case. One day my daughter came to me telling me of how hard her school life was. She desperately wanted to give up, so I took 3 pots, filled them with water and put them on the stove. In one pot I put an egg. In another I put a potato and in the last, some coffee beans. When they had cooked, I took them out and asked her to look at each one. Some people are like the egg. They starts soft inside but when things get difficult, it becomes hard inside. Some people are like the potato. They start hard inside but after things get difficult they get soft and weak. The coffee beans however come out just the way they were put in, but they were able to change the situation around them. This is what we should strive to do. Soon, you'll accept what life has dealt you, as we did. It could take some time; there will be good days and bad days. But after a while, I really believe this experience can summon your inner fortitude to enjoy each day, never hold back, and make amazing new memories with your family. You'll cherish the small things even more and when you get enough good days, you'll realize how actually you were strong enough all along to fight that ****ing cancer. It creates a positive feedback loop because your mental health and positivity increase your ability to fight cancer, which creates better results which makes for more positivity. Just keep fighting abd don't stop until science has an ACTUAL cure, not just a treatment. Maybe even carve out some time to read the articles. These are not \"fake news\" These are taken from scientific journals which have been cited. Bear in mind that in none of these articles do they say they are \"close\" to finding a cure. However the words \"promising, ground-breaking, within reach\" are thrown around. *I'm apparently not allowed to link the articles, but you can just google them. -Salinomycin as a Drug for Targeting Human Cancer Stem Cells Promising results from preclinical trials in human xenograft mice and a few clinical pilote studies reveal that salinomycin is able to effectively eliminate CSCs and to induce partial clinical regression of heavily pretreated and therapy-resistant cancers. The ability of salinomycin to kill both CSCs and therapy-resistant cancer cells may define the compound as a novel and an effective anticancer drug. -Advances on immunotherapy in breast cancer .... Several large clinical trials have tested the use of various forms of immunotherapy in breast cancer such as checkpoint inhibitors, adoptive T cell therapy, vaccines and adjunctive immunotherapy, all of which have shown promising results. This review article highlights the advances of immunotherapy in breast cancer and discusses the future research needed to be conducted to unveil the full potential of these drugs. -New possible target for cancer treatment ....The scientists turned the gene switches off by removing this region from the mouse genome, and found that its loss has no effect on normal mouse development and growth. Although removing the gene switch region brought down the levels of the nearby cancer gene Myc, the mice remained normal and healthy. However, the mice were strongly resistant to the formation of breast tumours and tumours in the intestine. According to the scientists, these results show that normal cells can function and divide without the genetic elements that are needed for the growth of cancer cells. The study therefore highlights the possibility of developing highly specific cancer drugs. -Checkpoint Inhibitors in Breast Cancer: Hype or Promise? ....I think that checkpoint inhibitors are extremely promising in breast cancer. First, these agents have relatively few significant side effects compared with cytotoxic chemotherapy, which is important from a quality-of-life perspective. Second, for patients with breast cancer who do respond, the responses seem to be durable. This is completely unlike conventional chemotherapy, whereby drug resistance occurs in a relatively predictable way over time. To see durable responses in patients with chemotherapy-resistant triple-negative breast cancer, for example, is a tremendous innovation. Women with chemotherapy-refractory triple-negative breast cancer typically have a poor prognosis, and so the observation of responses in this setting that are durable—potentially beyond the 1-year mark—is remarkable. We are still learning how to apply and refine immunotherapy strategies for the treatment of breast cancer, and the successful identification of biomarkers of response is needed. However, the data reported to date are certainly encouraging. The possibility of durable, tumor-specific response—and thus, cure—now appears to be within reach. -Two years on for our pioneering TRACERx lung cancer study .....The second trial, DARWIN II, will offer people a range of drugs targeted to faults in other genes, such as BRAF or Her2, to see if they can help. And patients whose tumours don't carry any of these faults, will be offered treatment with one of a new class of immunotherapy drug called 'checkpoint inhibitors'. And it's this area – immunotherapy – that Swanton thinks holds immense promise. \"In the last couple of years, we've really seen how drugs that target the immune system can produce dramatic responses in some patients and they're becoming standard treatments in lung cancer. So the work we're doing with Sergio Quezada's lab at UCL is something I'm really excited about,\" says Swanton. \"If we can work out how to harness the knowledge we're generating in TRACERx to find immunotherapies that benefit more patients, then I think we're really going to be onto something big.\"",
      "MessageIndex": 29,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    }
  ]
}