{
  "AuthorID": "glowgene",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249034/profile",
  "Posts": [
    {
      "AuthorID": "glowgene",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249034/profile",
      "Content": "glowgene wrote: Hello there! I've seen a few others on the board who have had 3DCRT radiation therapy, but I couldn't find a recent thread discussing it specifically. I know the technology has come a long way in recent years. Here's a link giving an overview of the process: http://www.pamf.org/radonc/tech/3d.html Simply put, 3DCRT uses computational models to map the affected region, allowing physicians to deliver precision doses of radiation. I'm going to post my experiences with 3DCRT in a comment and I hope others will share their experiences as well or ask questions for everyone's knowledge and benefit :) Dx at 27. Just lucky I guess. Surgery 11/21/2016 Lumpectomy: Right Dx 12/5/2016, IDC: Mucinous, Right, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Surgery 12/20/2016 Lumpectomy: Right; Lymph node removal: Sentinel Hormonal Therapy 1/24/2017 Arimidex (anastrozole), Zoladex (goserelin) Radiation Therapy 2/24/2017 3DCRT: Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/853913",
      "Title": "3DCRT - partial breast, external beam radiation glowgene glowgene"
    },
    {
      "AuthorID": "glowgene",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249034/profile",
      "Content": "Apr 2, 2017 11:09AM - edited Apr 2, 2017 11:40AM by glowgene I know that there are multiple ways to map/deliver so I can only speak to my experiences. I'm lucky that I was diagnosed and treated at the Siteman Cancer Center in St. Louis, where they have some pretty amazing tech. The mapping in my case was done using a CT scan and an MRI. So, a week before treatment I did a \"dry run\" of images and a cast was made of my upper body to keep me in the same position during treatments. My RO used software to \"draw\" a 1cm margin around the surgical cavity from my lumpectomy so they could very specifically treat that area and leave the surrounding tissues unaffected. I was treated in an rather fancy MRI machine that can image and deliver radiation at the same time (www.viewray.com/product). I was treated twice a day for 5 days, each treatment taking ~ 30 minutes from start to finish. Most of those 30 minutes were adjusting my position and taking starting MRI-images to make sure I was all lined up, followed by 6 minutes of actual treatment. So, my list of pros and cons and why I chose 3DCRT as opposed to whole breast and/or mastectomy: I was diagnosed at 27 with (arguably) one of the least aggressive BCs with great indications all around (pure mucinous, node -, ER/PR+, HER2-, low oncotype Dx). I'm a grad student and my lab works closely with collaborators who study treatment-induced cancers, so I was nervous about creating a secondary tumor while trying to treat the first one. I wanted to minimize that chance as much as possible. My RO laid out my options (whole breast, mastectomy, 3DCRT, no rads) and suggested 3DCRT given my age, tumor type and concerns. 3DCRT treatment is based upon the idea that, when recurrences appear, they are most often adjacent to the site of the original tumor, so simply treating the area around the original tumor will catch most recurrences. 3DCRT isn't necessarily recommended for younger patients as we tend to develop distal disease more often than those who are older, which wouldn't be caught/treated by partial breast radiation, and it's not usually recommended for tumors >2cm (mine was 2.6cm). However, minimizing side-effects/secondary tumors was more important to me, and my RO agreed that 3DCRT was the best compromise, all things considered. Cons: I have a shoulder injury and boy...holding still for those 30 minutes was excruciating. I was lucky that my lab is in the building adjacent to the treatment center so I could keep working during treatment. Twice a day, 30min treatments would likely have meant a week out of work otherwise with travel and wait time. I was exhausted by the end of the week, but it's unlikely that the radiation itself was the cause. Much more likely that waking up early for my morning treatment and lack of sleep from injury pain was the culprit. I haven't had any side-effects of the radiation itself so far. I was told I would likely have redness near the incision site but it's been a month and I haven't noticed anything yet.",
      "MessageIndex": 1,
      "PostDate": "02/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/853913",
      "Title": "3DCRT - partial breast, external beam radiation glowgene glowgene"
    },
    {
      "AuthorID": "glowgene",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249034/profile",
      "Content": "May 10, 2017 11:29AM glowgene wrote: jsn1904: I found a lump; some crumbs fell on my shirt and I went to brush them off and went \"oh...that wasn't there before\". Several of my friends also found lumps and had biopsies. We're all biomedical grad students and, being aware of all the bad things that can happen, we tend to overreact to any changes in our bodies that we can't explain. Theirs all came back benign: either cysts or fibroadenomas. I'd also like to point out how incredibly treatable many breast cancers are. We have so many treatment options and there are a huge number of women who go through treatment and never have to deal with it again. I don't know if that helps, but it made me feel better while I was waiting for my pathology results.",
      "MessageIndex": 9,
      "PostDate": "10/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/855010",
      "Title": "Breast cancer at 25, no BC history in family? jsn1904 MTwoman"
    },
    {
      "AuthorID": "glowgene",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249034/profile",
      "Content": "May 10, 2017 11:13AM - edited May 10, 2017 11:26AM by glowgene Hey jsn1904, I feel I might be doing more harm than good by posting, but it really is /very/ unlikely that this is cancer. There are so many benign lumps and bumps in boobs at our age (and any age really). I just wanted to offer to be an ear (eye) if you need to talk (write). Hopefully the fear you're currently feeling will be the worst of this experience. Sending you long distance hugs!",
      "MessageIndex": 5,
      "PostDate": "10/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/855010",
      "Title": "Breast cancer at 25, no BC history in family? jsn1904 MTwoman"
    }
  ]
}