{
  "AuthorID": "glsgls",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194081/profile",
  "Posts": [
    {
      "AuthorID": "glsgls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194081/profile",
      "Content": "glsgls wrote: Hi --- I'm so glad I found this forum.  I've read several of your posts and I feel less alone......but still very scared. May 2013 I had my 1st \"routine\" mammogram & sonogram done.  It came back with benign findings but they wanted a follow-up mammogram in 6 months.  I asked my doctor and she said not to worry. 11/22/13 I had the follow-up mammogram & sonogram done.  Next, they want me to have a biopsy.  Doctor still says \"don't worry\". 12/23/13 I had a Stereotactic vacuum assisted breast biopsy of the left breast.  Due to the holidays and my doctor being on vacation, things have been chaotic.  I called my doctor's office to ask about the results.  I felt something was wrong when I the office girl said she would call me back.  I had a feeling......so, I wen to the place where I had my biopsy and picked up a copy.  I got the same feeling as when I was told my brother had died in a car accident ---- completely overwhelmed!  Anyways, I feel very lost.  My doctor is on vacation until Monday.  The girls at her office have started the paperwork to get approval for a breast surgeont and referred me to an oncologist.  I called the oncologiest to make an appointment but they could not until the pathology report is ready.  I think I've driven everyone crazy so I have an appointment scheduled for Tuesday morning (1/7). I'm very scared, worried and lost.  I'm also upset because I feel that the biopsy should have been done back in May after my 1st mammogram.  I feel like the cancer grew in those 6 months.  I just don't know.................... Here are my lab reports (not pathology report).  Please help me decipher them.  I want to ask the right questions on Tuesday and/or know how serious it is. Gross Description:  Multiple cores of soft than-yellow fibrofatty tissue measuring from 1.0 x 0.3 to 2.0 x 0.3 cm Material submitted:  Left Breast Diagnosis:  Left Breast - Invasive Ductal Carcinoma Size cannot be determined on core biopsies, but largest extent on a single core measures 0.9cm. Tumor is present in multiple tissue cores and occupies 60% of specimen volume. Histologic grade:  Tubule formation 2/3, nuclear grade 3/3, mitotic rate 2/3 = 7/9; overall grade II/III (moderately differentiated). Multifocal Cribriform Ductal Carcinoma in-stu, intermediate grade, component identified. No lymphovascular invasion identified. No necrosis or calcifications identified. P63 and CK5/6 stains show loss of myoepithelial layer in invasive component and retention in in-stu component. ER, PR, and HER2NEU will be performed and reported as an addendum. SORRY for the long post.  In addition to feeling scared/worried, I feel so dumb.  I don't understand all of this. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/816407",
      "Title": "IDC and I'm so lost glsgls Obxflygirl1"
    },
    {
      "AuthorID": "glsgls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194081/profile",
      "Content": "Jan 4, 2014 01:51PM glsgls wrote: Thank you ALL for your words of encouragement. I've been reading your posts but every time I tried to replied and started crying. Sorry :( Too many things happening fast & slow! I wish it was all over. I still don't know how spread it is or stage, etc. I feel like I'm the one pointing out results to the doctor's office. I called the lab directly to find out if my pathology report was completed with ER, PR and HER2 data. He said he could not tell me anything. After talking with him a little (he probably felt sorry for me), he said \"results are pending\" ......something about wanting them to be correct and not rushing them. I had by biopsy done 12/23. Is this odd? Why am I getting the reports in \"parts\" instead as a whole pathology report. Is this normal? To complicate and frustrate matters more, I called my doctor's office just to inquire if they had the pathology report. The conversation with the lab guy left me suspicious. The office girl said \"yes....had it for a few days\". I asked if I could get a copy. I went over to the doctor's office to get a copy. It's the same lab report I have that states more results will be reported as an addendum. Where is this addendum? Then, I noticed addendum letter from the Radiologist dated 12/23/13 which I had not seen before. This is what it says: Pathologic - Radiologic Correlation Pathology Diagnosis: Invasive ductal carcinoma (moderately differentiated); Multifocal DCIS (intermediate grade) Pre-Biopsy Assessment:BIRADS 4. Concordance of Pathology with Radiologic Images:Concordant. Recommendation: 1.  Advice MRI Breasts to more accurately assess extent of disease (unilateral vs bilateral, multifocal, multicentric, regional spread) PRIOR to definitive treatment. 2.  As indicated from MRI additional second-look US with potential biopsy site(s). This addendum does not have the ER, PR or HER2 data. Is this normal?  Why is the radiologist requesting more biopsies?  Do they suspect the cancer is more widespread than originally reported---which I have no idea what is \"originally reported\".   Has anyone had this before? Thank you for caring Gloria ps:  I finally told my boss and a couple of co-workers (only my sister knew prior).  They were shocked.  They don't want me to go to doctors here in town.  They suggested I tried to push for other facilities even though it will require some driving.  Apparently, the surgeon my doctor's office wants me to see is a general surgeon and my co-workers don't have any faith on the oncologist facility either.  These referals have been done by my doctor's staff since my doctor is on vacation---have not seen her yet.  Do you think I should push for a better facility?",
      "MessageIndex": 5,
      "PostDate": "04/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/816407",
      "Title": "IDC and I'm so lost glsgls Obxflygirl1"
    }
  ]
}