{
  "AuthorID": "Gnovian",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61884/profile",
  "Posts": [
    {
      "AuthorID": "Gnovian",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61884/profile",
      "Content": "Jan 17, 2008 08:07AM Gnovian wrote: Mom is still semi active she still cooks and cleans although not a lot she has had part of her colon removed about 20 yaers ago but up tiil now no signs of recurring cancer however she has had numerous pollops and pre cancerous tumors. I have an appointment with another doctor next week to explore alternatives and at least a second opinion.",
      "MessageIndex": 2,
      "PostDate": "17/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698682",
      "Title": "92 year old Gnovian AnnNYC"
    },
    {
      "AuthorID": "Gnovian",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61884/profile",
      "Content": "Feb 19, 2008 08:28AM Gnovian wrote: Mom successfully went thru surgery last Wednesday had her Right Breast removed. The doctor told us that she had to remove the breast & 2 nodes but she seams to be cancer free after that other than seeing the doctor a couple times a year she is finished. The drain she has is almost stopped. She gets that out on thursday I would like to thank everyone who has sent us your Emails and your Prayers.    Gnovian",
      "MessageIndex": 16,
      "PostDate": "19/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698682",
      "Title": "92 year old Gnovian AnnNYC"
    },
    {
      "AuthorID": "Gnovian",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61884/profile",
      "Content": "Feb 9, 2008 04:23PM - edited Feb 9, 2008 04:25PM by Gnovian After exaustive scans & tests mother has deceided to go ahead & have the surgery. All indications fromthe Pet/CT scan shows that the cancer has not spread beyond the breast. Contrary to what the first surgeon stated. so she is going to have the surgery this coming wednesday. We are saying our prayers. The doctor said that because she is a healthy 92 year old that there should be little complications. But you know that at any age there could be. They also said that because of her age Chemo would not be recommended it would weaken her to much.",
      "MessageIndex": 12,
      "PostDate": "09/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698682",
      "Title": "92 year old Gnovian AnnNYC"
    },
    {
      "AuthorID": "Gnovian",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61884/profile",
      "Content": "Gnovian wrote: My mother has been diagnosed with stage II cancer she has a 3 to 5 CM lump in her breast and has spread to the Lymph nodes the doctor wants to completly remove her right breast and nodes but of course she is scared. mainly because of her age. According to the doctor this is approx 4 months old now. We have been told that because of her age this could be more painful after the surgery than she could stand. Is there alternate solutions. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698682",
      "Title": "92 year old Gnovian AnnNYC"
    },
    {
      "AuthorID": "Gnovian",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61884/profile",
      "Content": "Jan 25, 2008 07:47AM Gnovian wrote: I would like to thank those who have responded to this. We went to another doctor yesterday & she is going for more tests. There is a possibility that it can be controlled my medications. But mother is so far Adament that she does not want surgery. They are going to check how far the cancer has spread and also what kind of cancer it is. Again thak you for all your email & support.",
      "MessageIndex": 10,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698682",
      "Title": "92 year old Gnovian AnnNYC"
    }
  ]
}