{
  "AuthorID": "goldengirl12",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101929/profile",
  "Posts": [
    {
      "AuthorID": "goldengirl12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101929/profile",
      "Content": "goldengirl12 wrote: I am looking for good results after Taxotere. My big sis is having a scan after 6 months on Taxotere. After 3 months the mets were still there but smaller. We need good news and she deserves good news. She is 17 months out from stage IV breast cancer diagnosis (from the bat) and has been on several different treatments. She has only had one scan of NED after her first 3 months on tamoxifen, right after initial diagnosis (17 months ago). Then spots started showing again. No drug has completely cleared them.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771154",
      "Title": "Stage IV, Taxotere, and Pet Scans Oh my!!! goldengirl12 ibcmets"
    },
    {
      "AuthorID": "goldengirl12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101929/profile",
      "Content": "goldengirl12 wrote: My sister has Stage IV Breast Cancer at 30, HER2/Positive. It feels like a huge hurricane swept over our lives in the middle of the night. Every time I go out I want to talk about the hurricane that happened. But it didn't happen to any one else. It didn't even happen to me. No one knows the pain I feel for my sister. No one knows the guilt I feel for being okay, and for her diagnoses. Some times it feels like every picture of the past, every conversation I have today and every thought i have of the future has \"maybe\" washed all over it. And then I think of what she is feeling. Gut wrenching pain washes over me and I want to make it all go away. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759697",
      "Title": "The worst part, is no one \"gets\" it... not even me. goldengirl12 mbk"
    },
    {
      "AuthorID": "goldengirl12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101929/profile",
      "Content": "goldengirl12 wrote: My sister is stage IV, mets to brain, lungs, bones. She has been on different chemos for 3 years. Has undergone WBRT 10 months ago, still 4 brain mets remain. Last October she was put on a new chemo for lung mets. Tykerb and Xeloda. They got the lung mets. She dropped 40 pounds while on the chemo. She is down to skin and bones. The doctor wants to keep her on the chemo because all hormone therapy treatments have stopped working. She continues to loose a 3-4 pounds every couple weeks. Here are my questions, what are the dangers of all this weight loss? How do we stop the weight loss? Could the weight loss be a sign the brain tumors are growing? She started with 16, now down to 4. MRI next month to see if there is any activity.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800157",
      "Title": "Chemo weight loss goldengirl12 K-Lo"
    },
    {
      "AuthorID": "goldengirl12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101929/profile",
      "Content": "goldengirl12 wrote: Posting for my sister. She is 34, Diagnosed three and half years ago with Stage IV, last year mets to Brain. She is 1.5 years out from WBRT. Her Brain mets are regowing and they are starting Stereotactic Radiation in a week. In the mean time, Pet-Scan showed 60% of liver full of cancer, and in bones. She was just approved to start Kadcyla Friday. Does anyone have experience? Success? Side Effect Info for her. Thank you!!!! She is going to fight till the end.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809369",
      "Title": "Kadcyla Experience Please goldengirl12 goldengirl12"
    }
  ]
}