{
  "AuthorID": "GolferGirly…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157330/profile",
  "Posts": [
    {
      "AuthorID": "GolferGirly…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157330/profile",
      "Content": "Jul 19, 2014 07:19PM GolferGirly wrote: I have LE in my left arm and I was warned by my breast surgeon that it could happen if my axillary lymph nodes were removed.  When it did happen several months after two surgeries later, my team of doctors were like, oh, interesting.  (I also had the webbing in my arm immediately after surgery that they dismissed as well).  My oncologist prescribed a physical therapist at the first onset (my utter panic) and I've been doing manual drainage and wearing a compression sleeve ever since (since Jan 2013).  I love the LymphDIVAs sleeves with their exotic patterns etc.  Anyway at my last (nipple)  reconstruction surgery in March 2014, the nurse mentioned they have a doctor on staff now that is doing LE surgery, it is experimental- some insurance companies may not pay for it.  To make a long story short I made a visit to this microsurgery doctor to see if I qualify for the surgery.   There are two types of surgeries and after the doctor measured my arm (my left upper arm is 1\" larger than my right, but my L forearm is normal size) and after a grueling 2 hour MRI, I qualify for either one.  I chose the Anastamotic reconstruction because it is less invasive and I feel I have a mild case of LE.  If the surgery doesn't work, I have the option of having the Lymph node transplant next.  My trepidation with the transplant is that it may cause LE in the transplanted area - not ideal.  However my LE doctor told me that they can transplant lymph nodes from the abdomen if I desire which will not be prone to LE like lymph nodes removed from other parts of your body. Not many doctors are doing this kind of surgery in fact I believe it wasn't an option 1-1/2 years ago.  It's so new - like I said \"experimental\" still.  If anyone wants to find out more please let me know.  Also the surgeries are still not a cure for LE, if successful they should reduce the swelling and limit the amount of time one has to wear a compression sleeve to hopefully only when one fly's or works out vigorously, etc.  My surgery is scheduled for September and I should see results after 3 months of surgery (if any) so I will definitely post back my experience. Definition of the two surgeries:",
      "MessageIndex": 21,
      "PostDate": "19/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/822493",
      "Title": "Have trouble getting your Doctors to understand your Lymphedema? Meggy glennie19"
    },
    {
      "AuthorID": "GolferGirly…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157330/profile",
      "Content": "Feb 24, 2013 06:32PM GolferGirly wrote: I was dx 7/11/12 and had mastectomy of left breast followed by additional lymphectomy 1 week later because 1 of 4 lymph nodes was positive (it was initially scored neg during surgery), finished chemo in Dec '12 and am currently going into 4th week of 6.5 wks of radiation. Also I started on arimitex a couple weeks ago-probably for the rest of my life. Initially doctors said no chemo for me and maybe radiation depending on which surgery I qualified for but because my tumor was > 7cm they have given me the full on treatment. I was in perfect health (hahaha) going into this so my physical side affects have been minimal. My biggest complaint has been the bad taste in my mouth through chemo. It's still slightly off. Oh and I have slight case of lymphedema so am wearing compression wrap daily. As for emotionally I have been in good spirits the whole way but occasionally I realize I am getting the full dose of treatment which is serious business and I wonder if the cancer will metastasize in the future? I don't dwell and the thought passes but I am not in denial either. I have several friends and acquaintanceswho are survivors or near the end or who have died. It's a crap shoot but I strongly believe a positive attitude helps me heal. I fight this all the while continuing to live my life as normal as is possible during this first year of treatment. I am amazed at the number of women who go through this--before I was \"one of them\" I didn't realize what a challenging journey this was. I have \"handled\" it well but that doesn't mean it's been easy. God bless to you all!",
      "MessageIndex": 54,
      "PostDate": "24/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/776821",
      "Title": "stage 3a breast cancer survivors mariar Icandoallthings"
    }
  ]
}