{
  "AuthorID": "GoodMommy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36290/profile",
  "Posts": [
    {
      "AuthorID": "GoodMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36290/profile",
      "Content": "GoodMommy wrote: I have been having PT for 3 weeks now.  The first time I went, my therapist took measurements of the good arm and the le arm.  The next 2 weeks, she only took a measurement of the le arm and compared it to her original measurement of the good arm.  Tonight, my son (who is a Pediatric Resident) posed a question.  He said that how can she tell whether or not the arm is improving if she doesn't measure both arms because the good arm would swell during hot weather as well. My question, what does your PT do? God bless, Chris Dx 3/2005, IDC, 1cm, Stage IIIA, Grade 3, 15/20 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/707383",
      "Title": "Measuring during PT GoodMommy RIV54"
    },
    {
      "AuthorID": "GoodMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36290/profile",
      "Content": "Jul 10, 2009 10:19AM GoodMommy wrote: Skyrat, thank you for your response.  What tests did your Onc order that determined that Aromasin wasn't working?  Also, I should know; but I don't.  What exactly is CMF?  I had 6 rounds of TAC and did well with that; but my friend couldn't tolerate Cytoxan and Adriamiacin or the last treatments with Taxotere.  I have read good things about Zometa and I pray that all goes well with your treatment.  Thank you for your response. God bless, Chris",
      "MessageIndex": 5,
      "PostDate": "10/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737183",
      "Title": "Please help my friend with bone mets GoodMommy GoodMommy"
    },
    {
      "AuthorID": "GoodMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36290/profile",
      "Content": "Jun 17, 2008 05:31AM GoodMommy wrote: Hi Rolinak, Thank you for responding.  I guess I was just curious.  My lymphedema is mild and it seems to be improving with the therapy.  I like my Physical Therapist, however, she is not certified (I don't know if that is bad or good).  She only works with LE though and also works for the hospital so I'm assuming that's okay.  I just want to make sure that everything is being done correctly. There have been a few things that I feel she should make the decision on and not ask me since I am not familiar with the proper treatment.  For example, at first she was not wrapping and said that I probably didn't need it because it was so mild.  After talking to a friend and coming on the Boards, I asked if we could wrap.  I have wrapped since Friday and it seems to have improved. The other thing was she wanted to know if I wanted the manual massage or the sequential pump.  I obviously want what will work best.  I decided that we should probably do the manual massage since that is what I need to learn.  We use the pump maybe once a week. Any advice that you can give me would really be appreciated. God bless, Chris",
      "MessageIndex": 5,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/707383",
      "Title": "Measuring during PT GoodMommy RIV54"
    },
    {
      "AuthorID": "GoodMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36290/profile",
      "Content": "GoodMommy wrote: I'm hoping that someone out there can help me.  I'm getting very discouraged.  Has anyone seen improvement with PT without being wrapped?  My PT doesn't think that the LE is bad enough to warrant wrapping; but will if I want it.  I go tomorrow and I would like to have some opinions prior to my appointment.  Thank you all for your help. God bless, Chris Dx 3/2005, IDC, 1cm, Stage IIIA, Grade 3, 15/20 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/707003",
      "Title": "PT without wrapping GoodMommy inspiewriter"
    },
    {
      "AuthorID": "GoodMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36290/profile",
      "Content": "Jun 9, 2008 04:20PM GoodMommy wrote: Binney, Thank you for sending me to the lymphnet site.  I will be having my PT order the supplies for wrapping.  I guess I'm being very careful to be sure that I'm getting the proper treatment since she is not certified.  She works for the hospital and only does LE. Another question, she uses a sequential pump while massaging the areas that the pump doesn't.  She will do the manual massage instead if I ask.  What is best?  From the position paper, it sounds as if I should be getting the manual massage. Neat, Thank you for bumping.  I do most those things that you suggest; but I do love salt and a daily glass of wine.  I guess I need to change that.  I don't know if I'm just more aware of my arm being swollen or if it is getting worse.  One thing for sure, there has not been significant change after 5 sessions and I'm doing the massage twice a day myself.  Maybe I'm aggravating it. Just call me frustrated. God bless, Chris",
      "MessageIndex": 5,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/707003",
      "Title": "PT without wrapping GoodMommy inspiewriter"
    },
    {
      "AuthorID": "GoodMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36290/profile",
      "Content": "GoodMommy wrote: My best friend who is a 5 year survivor was just told that she has bone mets.  She is not having any symptoms.  She went for her check-up and the onc. did a mammo. (she had a lumpectomy 5 years ago) and a chest x-ray.  The onc. noticed that she had broken a rib which was healing; but also noticed a shadow.  She was sent for a CT which showed some lesions to her liver and also a PET scan.  Today, she was told that the cancer has spread to her bones; she is not sure about the liver lesions.  She suggested Zometa and aromasin as her first line of treatment.  Any thoughts on this would be appreciated; not only for my friend but for me as well since I am a 4 year survivor and I too had a number of nodes involved.  God bless, Chris Dx 3/2005, IDC, 1cm, Stage IIIA, Grade 3, 15/20 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737183",
      "Title": "Please help my friend with bone mets GoodMommy GoodMommy"
    },
    {
      "AuthorID": "GoodMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36290/profile",
      "Content": "Jul 10, 2009 09:58AM GoodMommy wrote: Jan and Hollyann,  I just want to say thank you so much for your response.  My first concern is of course for my friend; but this is also a wake-up call for me.  I am so angry at this ugly monster right now I could scream.  My friend didn't tolerate her chemo regiment very well.  In fact, she was supposed to have 3 tx of cytoxin and adriamiacin; but only could tolerate 2.  Then the plan was to give her 10 tx of taxotere and she could only tolerate 9.  She has been on Femara; but I would think that it wasn't doing its job since the cancer returned and she was still taking it.  Arimidex (I take that) and Femara are basically the same, aren't they?  Why would Aromasin work?  Isn't it also an aromatase inhibitor?  We are both er/pr+ and we both had a number of positive nodes.  I really appreciate any knowledge or suggestions you can give. God bless, Chris",
      "MessageIndex": 3,
      "PostDate": "10/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737183",
      "Title": "Please help my friend with bone mets GoodMommy GoodMommy"
    },
    {
      "AuthorID": "GoodMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36290/profile",
      "Content": "GoodMommy wrote: Has anyones lymphedema therapists used a lymphedema pump on your arm?  Mine has shown me the self-massage and does massage in the areas that the pump doesn't cover while it is being used.  I feel that it is working; but I'm not sure insurance will cover one for my use at home.  I requested that every other time, she does the manual massage just in case.  I called my insurance co. and they said it would be covered 100% if I found a network provider.  I finally found one and now I need \"pre-determination\" and the medical supplier is working on that.  Does anyone else have one or have your therapist used one on you?  Any advice will be appreciated. God bless, Chris Dx 3/2005, IDC, 1cm, Stage IIIA, Grade 3, 15/20 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/706811",
      "Title": "Lymphedema Pump GoodMommy sccruiser"
    },
    {
      "AuthorID": "GoodMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36290/profile",
      "Content": "Jun 5, 2008 10:29PM GoodMommy wrote: Binney, Thank you for answering my post.  My therapist does advocate the pump; but she will do manual massage in lieu of the pump if I prefer.  The pump is a sequential pump and while she uses it, she is massaging the areas that the pump doesn't making sure that all the nodes are clear.  She has taught me to do the self-massage which I am doing every day including some exercises. Luckily, I have caught this early.  If you didn't know that I have LE, you probably wouldn't notice it.  I just want to nip it in the bud.  My therapist said that the pump is still kind of controversial among therapists but she gets good results from it.  She also feels that patients are more apt to keep up with the massage and therapy if they have the pump.  I guess if my insurance decides to cover it, I will get one because my arm feels much better when she uses it.  Also, I need your opinion.  Because my LE is not that bad, she is not wrapping it.  She feels it is not necessary; we will be ordering a compression sleeve however.  Does this sound right? Thank you again for your info.  I would like to hear from others out there and their opinion. God bless, Chris",
      "MessageIndex": 2,
      "PostDate": "05/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/706811",
      "Title": "Lymphedema Pump GoodMommy sccruiser"
    },
    {
      "AuthorID": "GoodMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36290/profile",
      "Content": "Jun 10, 2008 06:13PM GoodMommy wrote: Thank you all for your help.  This site has been a God-send.  I ordered the materials for wrapping today and should have them for my Friday appointment.  Today, she did manual massage instead of the pump as I had requested.  She also re-measured.  The numbers were down a little; but I think I will notice even more when we begin wrapping.  God bless you all for your help. Chris",
      "MessageIndex": 8,
      "PostDate": "10/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/707003",
      "Title": "PT without wrapping GoodMommy inspiewriter"
    },
    {
      "AuthorID": "GoodMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36290/profile",
      "Content": "Jun 9, 2008 02:58PM GoodMommy wrote: Amy, Thanks for your help.  So far, I feel as if my arm is getting worse not better.  I'm doing the self-massage and she for the most part is using a pump.  She will be measuring again tomorrow.  I think I'm just going to tell her that we need to wrap and to order the supplies. God bless, Chris",
      "MessageIndex": 2,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/707003",
      "Title": "PT without wrapping GoodMommy inspiewriter"
    },
    {
      "AuthorID": "GoodMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36290/profile",
      "Content": "Jun 15, 2008 01:27PM GoodMommy wrote: Dee, I'm from St. Charles, MO and just started wrapping.  Could you tell me where you got your sleeve? Chris",
      "MessageIndex": 3,
      "PostDate": "15/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/707343",
      "Title": "sleeve dilemma swmmom GoodMommy"
    },
    {
      "AuthorID": "GoodMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36290/profile",
      "Content": "Jun 15, 2008 08:35PM GoodMommy wrote: Dee, Thanks for the info.  I have United Health Care and Med. West is no longer one of their providers.  I have to go to Hangar in St. Peters.  Insurance seems to be a pain in the ***.  My last visit to my onc., they took the typical blood work and I got a letter from UHC stating that Quest Labs is no longer part of the network and I may be getting a bill.  UHC never sent me any notification that Quest wasn't a provider.  It seems now that you have to make sure that docs send lab work to a network provider.  I would have never thought to ask where my blood was being sent. Thanks again for the info.  I agree with Jinky, I would take the sleeve back. God bless, Chris",
      "MessageIndex": 6,
      "PostDate": "15/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/707343",
      "Title": "sleeve dilemma swmmom GoodMommy"
    }
  ]
}