{
  "AuthorID": "Goodie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138786/profile",
  "Posts": [
    {
      "AuthorID": "Goodie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138786/profile",
      "Content": "Feb 23, 2012 06:54AM Goodie wrote: I completely understand how you feel.  I really do dislike being bald.  It's is the worst side effect of this chemo for me.  I still get so nervous when I'm about to see someone I know who hasn't seen me with my wig.  (I had my head shaved in early Nov.)  I have the most amazing wig and many, many people don't even realize it isn't my hair. But, I know it's not my hair and I really don't like going out in public.  I take it off as soon as I can when I get home.  It's not me!   Our hair is so much of identity. That being said, someone told me that the wig is also for other people; it makes them more comfortable. People are amazed at how good I look and I know the wig actually makes them feel better.   Truly, I can see it on their faces that the don't see me as being sick or what they thought I would look like going through chemo and being bald. I think they would pity me if I wore my fleece hats and no makeup when they first saw me.  So, I don't go out of the house without my wig on and I run upstairs and put on my wig for any company that comes over for most people.  You will kind of get used to it.  I think the wig allows them not to think about how you look without it and about your bc.         I do feel so much better when I go out and do normal things and don't avoid situations.  Wearing the wig is a part of getting out but so is interacting with people.  Once you are around people they adjust to your new look pretty quickly and as others have posted most might notice at first but they go on and don't dwell on your hair.  First time seeing people are the hardest but I feel so much better once the encounter is over.   I have also found comfort in this post about how great Jenny looks after a year!  http://community.breastcancer.org/forum/67/topic/780790?page=5#idx_140 It really helps me when I get down about my lack of hair right now! ",
      "MessageIndex": 17,
      "PostDate": "23/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/782967",
      "Title": "Why am I so ashamed of my hair loss? JoanQuilts DivineMrsM"
    },
    {
      "AuthorID": "Goodie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138786/profile",
      "Content": "Aug 9, 2012 06:40AM Goodie wrote: Hey SB :)  - I haven't really gotten much support in that regard either from MO, RO or PS but one of my infusion nurses had breast cancer too and has kids the same ages as mine.  She was/is awesome support to me mentally.  I know I can go to her with questions.  I see my infusion nurses every time I get my port flushed.  I also have a friend who is 17 years out and she's been a huge support to me.  Actually I have a few friends/neighbors who had BC so I can go to them too and I have.  I think fellow BC patients are the best support as is evident with breastcancer.org. I was given a pamphlet about breast cancer survivorship to contact for a transition visit with a breast cancer sruvivorship expert.  I haven't made that appointment yet.  I think the RONP recommended to make it in September.  I have really found some peace in meditating.  I did a 21 day challenge recently (loved it) and I've also purchased some meditation cds from amazon.  I also go into every appointment with a smile on my face and have a positive attitude toward my treatment for the most part.  So, they don't probably see that I need any support or anything.  I said to myself it's going to be a tough year of treatment and it was/is and amazingly it's almost over.  I'm done active treatment and I will have my diep surgery in early 2013.  I've had minimal side effects too.  You are going through some rough things with your SEs and your sister.  I think you have to ask where to get help because the MO doesn't want to deal with that during an appointment.  Please ask your MO for a recommendation of someone to talk to about all of this.  I'm sure your breast center has a counselor for you to make an appointment. I walk most days with DH and my Reiley (dog) and I know you like to bike.  Keep it up.  I too think exercise is very important.  Getting out in the fresh air helps me so much.  I walked through all of my chemo (super slow some days!), surgery and radiation.  I think I only took a few days off from surgery but I was sleeping most of those days anyway.  LOL Some people like to keep a personal journal too.  It will let you release some of your feelings too.  I know you have a public blog and that is good too.   ",
      "MessageIndex": 9,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791685",
      "Title": "Disappointed with Care Team sbelizabeth sbelizabeth"
    },
    {
      "AuthorID": "Goodie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138786/profile",
      "Content": "Apr 30, 2012 06:14AM Goodie wrote: Same with me - AC is much harder on  your system.  But Taxol was emotionally harder on me because I had to go every Tuesday and it felt like I never got a break.  I'm so glad the chemo is over but I miss my chemo nurses.  They are awesome!  So, it was nice to see them weekly!  :)  I did get the discoloration on my nails (I didn't ice them) and a tiny bit of neuropathy.  The benedryl made me tired the first day and then the steroids made me wired the next day.  I guess when I got used to the schedule it was all over. LOL   Good luck!  It seems like it will never end but it will!  :)",
      "MessageIndex": 13,
      "PostDate": "30/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/786392",
      "Title": "Any words of wisdom for Taxol? lanagraves shlichte"
    },
    {
      "AuthorID": "Goodie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138786/profile",
      "Content": "Aug 9, 2012 08:26AM Goodie wrote: AEM -OMG my hair looks exactly like yours!  I just have a lot of grey in there too!  LOL ",
      "MessageIndex": 17046,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Goodie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138786/profile",
      "Content": "Aug 9, 2012 08:43AM Goodie wrote: AEM - funny but true the grey isn't bothering me yet.  I do like the easy maintenance of it; I just put some mousse in it and I'm done.  It's been very liberating for me since I went topless.  It's funny to see people's reactions to me now that I don't have my wig.  My wig was awesome but I'm so glad to not put it on now!!!!!!!  I'm hoping there won't be much grey though once this initial phase is through!   ",
      "MessageIndex": 17051,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Goodie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138786/profile",
      "Content": "Mar 1, 2012 10:11PM Goodie wrote: I think one of the best piece of advice I've gotten here is going to Landsend and getting some fleece hats from their sale section for hats.  I absolutley love their fleece hats.  The heavenly fleece ones are so soft!  I have several different colors and I wear them all the time at home.  They are perfect!  The therma check are nice and snug too.  As soon as I walk in the house, off comes the wig and on goes one of my comfy fleece hats!  Treat yourself!  I wear them to bed too!",
      "MessageIndex": 14276,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Goodie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138786/profile",
      "Content": "May 15, 2012 09:26AM Goodie wrote: ElleBee I am so sorry too.  These boards are very informative.  Do you have a support system?  I would bring someone to each appointment to take notes for you in a notebok and record it too if you can.  I went to a surgeon and then an oncologist locally and then I went to a bigger hospital for my second opinion.  The second opinion had \"doctor day\" and I saw the breast surgeon, oncologist and radiation oncologist on the same day.  I actually went with the second opinion even though they are a little bit farther away from me.  They both gave me almost the same treatment plan but I just got a better feeling with the second team overall and I am so blessed to be in their care.  I could take all my testing/results to both opinions.     Are you close to the Cleveland Clinic?  I would go there too for a second opinion if you aren't already going there.  You have to be comfortable with your doctors and nurses.  You will know the right place for you.  Also, get a big binder for all your paperwork.  I keep lab results, bills, insurance payments (compare with your bills!), clinical trial information (if offered), etc.  This is the hardest time for you.  Once you know your treatment plan you will feel more in control.    ",
      "MessageIndex": 21,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787094",
      "Title": "A lump, and other \"lady issues\" ElleBee ElleBee"
    },
    {
      "AuthorID": "Goodie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138786/profile",
      "Content": "Feb 22, 2013 12:06PM Goodie wrote: bump",
      "MessageIndex": 191,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780790",
      "Title": "What a difference a year makes jennyboog Yndorian"
    },
    {
      "AuthorID": "Goodie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138786/profile",
      "Content": "Feb 24, 2012 06:43AM Goodie wrote: Jenny, Thank you so much for starting this thread.  I come here daily to look at your pictures.  I even show my DH and say \"hopefully that's what I will look like in year!\"  It has been such an inspiration to me as I'm still bald and have two more Taxols to go.  I'm ready for the growth to begin!  :)  Thank you again! ",
      "MessageIndex": 148,
      "PostDate": "24/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780790",
      "Title": "What a difference a year makes jennyboog Yndorian"
    },
    {
      "AuthorID": "Goodie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138786/profile",
      "Content": "Apr 23, 2012 10:19AM Goodie wrote: bump",
      "MessageIndex": 163,
      "PostDate": "23/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780790",
      "Title": "What a difference a year makes jennyboog Yndorian"
    },
    {
      "AuthorID": "Goodie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138786/profile",
      "Content": "Mar 9, 2012 05:50PM Goodie wrote: Bump.  Jenny you are such an inspiration!  I am so looking forward to the growth to start!  :) ",
      "MessageIndex": 153,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780790",
      "Title": "What a difference a year makes jennyboog Yndorian"
    },
    {
      "AuthorID": "Goodie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138786/profile",
      "Content": "Jan 2, 2015 07:32AM Goodie wrote: bump",
      "MessageIndex": 213,
      "PostDate": "02/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780790",
      "Title": "What a difference a year makes jennyboog Yndorian"
    }
  ]
}