{
  "AuthorID": "Googler007",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252356/profile",
  "Posts": [
    {
      "AuthorID": "Googler007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252356/profile",
      "Content": "Googler007 wrote: So sorry if this is the wrong place to post. First time poster. Long story short is my mother, age 76, is facing a second breast cancer. First was DCIS stage 1 with mastectomy , no follow up treatment needed. 12 years later, in remaining breast ILC ( HER2+, ER- and weak PR+) was found. The tumor is over 5 cm, Grade 2, so we're praying it's Stage III. Getting PET/ MRI of breast, and of surrounding nodes and pelvis this week. It is also noteworthy that she has had unexplained mildly low red blood cell, white blood cell and platelet counts for over a year, but is otherwise in good health. My concern is that my mom is throwing up her hands and is willing to just submit to whatever the first consult says to do. This doc is being very very conservative. Just wants Taxol at very low dose one time per week for 12 weeks, then re-evaluate and hopefully do surgery. His reasoning is that he does not want her blood counts to go down as a result of chemo. I am a bit puzzled by that idea. Her counts are just a few points below normal, so nothing remotely critical at this point. Also , I am under the impression that there are drugs that can be given to prevent a drop in blood counts. Given the size of the tumor ( which is likely bigger than the ultrasound and mammogram estimated), wouldn't it make sense to hit hard out the gate and add in prevention meds, then ease off if the side effects are too bad and blood counts go down too far ?? I have not yet seen the complete pathology report, so I can't get into the nitty gritty just yet. But just in my limited perusal of options, there seems to be alot more that could be done that might make a big difference in shrinking the tumor as well as dealing with potential mets. I explained to my mom that wanting to start right away feels right for her at this time, but what about part way into chemo when there is no going back? I want her to move forward in an informed way where she understands and chooses a course of action based on her very much individual situation. I fear that this doc pitching a chemo course right off the bat before getting more scans is a bit cursory. And I also wonder if HMO protocols might be influencing his conservatism around chemo. His not even mentioning using meds to offset lowering blood counts seems ominous to me, especially since he is both a hematologist and an oncologist. At any rate, I have offered to pay for a Cleveland Clinic online second opinion consult as a way to get a different perspective. Has anyone experienced something similar? How many opinions are folks going to gather? I do not believe this doc specializes in breast cancer. Where she is going at the moment is a general blood disorder/cancer center , not a teaching hospital and not a research facility. Just a place in network across the street from her primary care doctor. (who allowed my mom to go without a mammogram for 4 years until she found the lump on her own!) I get the feeling this is not a good idea, but do not want to disempower my mother by undercutting a doctor she likes. Any advice, suggestions would be greatly appreciated! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/855210",
      "Title": "Mother just diagnosed. Searching for info and options for her Googler007 MTwoman"
    },
    {
      "AuthorID": "Googler007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252356/profile",
      "Content": "May 18, 2017 09:05AM Googler007 wrote: Thanks so much for the feedback! I decided to keep my mouth shut and watch how it unfolded, so I said nothing to her one way or the other. Then she called me and had retrieved everything in her file. After reading it over, she decided that she would get additional opinions, but not necessarily transfer her care. She's decided to get as much info as possible,seek a full explanation of every decision her doctor makes, present to him the other opinions and have him comment. If she feels he is weighing all options and taking an individualized approach to her treatment, she will stick with him. And she came to this conclusion on her own and has emailed her first set of questions to the doctor already. As for the blood disorder, no diagnosis was ever given, and no diagnostic testing was done to investigate it. She had one visit, was told they would do watchful waiting and had her come back in 6 months. Over those 6 months she went on a reasonable anti-inflammatory diet (Whole30), lost over 10 pounds and 'lo and behold, the numbers got much better. The doc dismissed her diet as helping her numbers. He speculated that she may have had a chronic infection that was not presenting symptomatically and the antibiotic she took for a dog bite over the intervening 6 months had cured the underlying infection. Now, a few months later, the improvement has held and the numbers have improved more to just slightly out of range. Evidently, there is nothing wrong enough to warrant more testing, so she has no diagnosis. I told my mom that whatever she chooses for herself I would wholeheartedly support. As long as she is making informed decisions and is at peace with her choices, I will keep my mouth shut and support her in whatever way she wishes. But I know my mother. She is incredibly smart and is able to do whatever she sets her mind to. Blindly capitulating to a course of action that is a matter of life or death is not in her nature. Whatever treatment may bring she is ready for the fight. I am hoping chronological age will NOT be the primary deciding factor in treatment because she is overall healthy, very active, resilient and almost scary intelligent both in terms of \"book smarts\" and judgment. Underestimating her could prove fatal. And I hope she remembers that. I told mom about this message board and she has signed up. (Hi Mom!) I will continue to lurk and may ask an occasional question. She will take the rest from here... Thank you!",
      "MessageIndex": 5,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/855210",
      "Title": "Mother just diagnosed. Searching for info and options for her Googler007 MTwoman"
    }
  ]
}