{
  "AuthorID": "gp193",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236235/profile",
  "Posts": [
    {
      "AuthorID": "gp193",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236235/profile",
      "Content": "Dec 13, 2016 07:44AM gp193 wrote: Do you know about proton therapy? It's a specialized type of radiation that allows the beams to be more focused so as to avoid other healthy tissues.",
      "MessageIndex": 2,
      "PostDate": "13/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851175",
      "Title": "Confused if I should do it Mamita49 Heidihill"
    },
    {
      "AuthorID": "gp193",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236235/profile",
      "Content": "Aug 3, 2016 12:24PM gp193 wrote: Hi - Posting for my wife Dx 7/30/15 Stage IIIc Dx 4/26/16 Stage IV, mets to liver",
      "MessageIndex": 150,
      "PostDate": "03/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "gp193",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236235/profile",
      "Content": "Oct 5, 2016 01:46PM gp193 wrote: Hi everyone, I want to thank you all for the helpful information and kind words of support! Pauline's side effects coincide with her starting on the new trial, so it's very hard to tell whether they are related to the drugs or to the cancer itself. For instance, nausea and pain where the bone mets are, as well as liver pain/discomfort and some distension of the stomach. I think it's harder than we realized to deal with the uncertainty of the trial since we don't know if she's getting a placebo. That, plus the way fulvestrant is affecting her mood. This is tough! Lisa, thank you for your pep talk. I know it's hard on us both but sometimes I wonder if it's harder emotionally on the spouse/caregiver since we know we have to carry on no matter what? We also have a 4-year-old daughter who is a wonderful distraction but who also compounds this tragedy for us. I have gotten great support through Cancer Care here in NYC and I will look into the Cancer Support Community as well. I have learned that speaking out and talking about my feelings is the only way through this experience. I hope you all know how much I admire your fortitude going through this crap journey. Gina",
      "MessageIndex": 3878,
      "PostDate": "05/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "gp193",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236235/profile",
      "Content": "Oct 17, 2016 10:33AM gp193 wrote: Hi everyone, My wife Pauline has metastatic breast cancer with mets on the liver, various lymph nodes and bones. The main concern right now is her liver, where the mets are growing rapidly. Her bloodwork last week showed very elevated liver enzymes, which could be due to the cancer or to the trial drug she was just pulled off of. The doctor thinks it's probably from the liver tumors. Her onc wants to start her on chemo this week to get the liver under control, and it is my understanding is that she is in a tricky spot because the chemo could stress her liver too. We are meeting the onc today to talk about options, but before then I'm trying to read up on the chemo options available to people in her situation. What chemo treatments can be used for a person who has a compromised liver? She has already had AC/T chemo when she was diagnosed at stage III last year, so I know the Adriamycin is off the table. I'm a bit nervous that she's be facing one of the tougher treatments, given the aggressive nature of her cancer. Thanks so much.",
      "MessageIndex": 3917,
      "PostDate": "17/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "gp193",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236235/profile",
      "Content": "Mar 23, 2017 12:36PM gp193 wrote: Pauline was given a choice of Halaven and Navelbine, and despite the hair loss she decided on the Halaven, which she started yesterday. The oncologist thought Halaven was a better choice. Despite the stress of progression, it's nice to know that the tumors are still smaller than they were last October when the s*it nearly hit the fan. There are some real perks to Halaven that we are focusing on - it's a push that only takes a few minutes, no premeds and beastly steroids, and MSK has recently changed their policy so that Pauline can receive her treatment at their NJ location (much closer to home, avoiding the stress of getting to Manhattan) on her non-clinic days. Fingers crossed this new treatment whacks down the liver mets. Thanks for checking in.",
      "MessageIndex": 4600,
      "PostDate": "23/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "gp193",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236235/profile",
      "Content": "Oct 4, 2016 10:48AM gp193 wrote: Hi everyone, I've been lurking for a while on behalf of my wife, Pauline, who has liver and bone mets. She just started in the SANDPIPER trial, which is for fulvestrant plus taselisib/placebo (targeted for PIK3CA mutation), but she is having a lot of liver/bone pain and other uncomfortable symptoms. We know that her cancer is very aggressive and has shown rapid growth, so she is considering going to chemo. I am interested to know about the trial MattieFang mentioned above - what is the trial drug and what's the trial called? Gina",
      "MessageIndex": 3868,
      "PostDate": "04/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "gp193",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236235/profile",
      "Content": "Oct 17, 2016 05:34PM - edited Oct 17, 2016 06:27PM by gp193 We just finished with the onc here at MSK. She was torn between gem/carbon and eribulin, but said she's seen more adverse reactions related to the liver on eribulin. So, Pauline will be starting the gem/carbo tomorrow on a 2-week on, 1-week off schedule. Let's cross our fingers that the liver mets listen up!! Kay, thank you fo your reply. I'm relieved to hear this treatment was effective for you in a similar situation. Gina",
      "MessageIndex": 3924,
      "PostDate": "17/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "gp193",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236235/profile",
      "Content": "Oct 18, 2016 10:11PM gp193 wrote: Thank you everyone for your kind wishes. The infusion went fine today, so now we will just keep our fingers crossed that the chemo does it's job. Kay, our chemo nurse diluted the gemcitabine to minimize the burning sensation, and it didn't both Pauline too much. She did say that Pauline has good veins now, but that if it gets harder to place a line in the future she'd suggest a port. I think that's probably a good plan if (and hopefully) long-term chemo is in the future.",
      "MessageIndex": 3931,
      "PostDate": "18/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "gp193",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236235/profile",
      "Content": "Jan 27, 2017 10:15AM gp193 wrote: letmywife, My wife has liver mets and was on Xeloda for several months before scans showed progression in the liver and new bone mets. At that point, her doc recommended her for the SOLAR-1 trial. Unfortunately she only lasted on the trial for 2 weeks because she had major liver dysfunction, either from the trial drug or the tumors (we don't quite know). She's now on gem/carbo which is shrinking the tumors. I bring up her experience because I don't think prior treatment for Xeloda will necessarily prevent your wife from getting into the trial. I hope that it works well for her if you do decide to take that option. Xeloda is also a very good treatment for many people. I think the route you take depends on the aggressiveness of the tumors. Best of luck in your decision.",
      "MessageIndex": 4266,
      "PostDate": "27/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "gp193",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236235/profile",
      "Content": "Jan 27, 2017 02:29PM gp193 wrote: My wife's doctor is at MSKCC, which is one of the sites for the Solar trial, so I'm guessing that the MO was able to get her into the trial despite the restriction on prior Xeloda treatment. At the time it seemed like the best option, but unfortunately it didn't work out for her. She has multiple and diffuse liver mets, though none were very symptomatic at the time she started the trial. Things went downhill quickly for her and luckily the gem/carbo has brought her back.",
      "MessageIndex": 4272,
      "PostDate": "27/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "gp193",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236235/profile",
      "Content": "Mar 23, 2017 02:50PM gp193 wrote: Shetland, I agree. After all that Pauline has been through, including Xeloda, this chemo sounds like the best so far apart from the hair loss. Many other side effects make a big difference re QOL, like constipation, mania/jitters from the steroids, and the timing/location of the treatment. I actually think Xeloda was the worst, even though the pills were easy, because of the hand/foot syndrome.",
      "MessageIndex": 4603,
      "PostDate": "23/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "gp193",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236235/profile",
      "Content": "Oct 17, 2016 01:07PM gp193 wrote: Thank you for the replies! The nurse mentioned Halaven as a possibility so I'm happy to hear that worked for you too.",
      "MessageIndex": 3921,
      "PostDate": "17/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "gp193",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236235/profile",
      "Content": "Mar 21, 2017 10:18PM gp193 wrote: Hi ladies, I haven't posted in a while but I'm back because Pauline has had progression in her liver after 4 months on gem/carbo. It's so frustrating because the other mets in the bone and nodes are looking better. These liver mets are some very stubborn beasts. Her onc is suggesting either vinorelbine or eribulin, with eribulin as her first choice. We are supposed to decide tomorrow, when Pauline will receive the new treatment. We understand that the main difference is hair loss, but what else is there to consider? For someone with widespread, aggressive disease in the liver, are there any other options? I feel like I want to trust her doctor (MSK), but I'm wondering if we should seek some other opinions elsewhere? It's just so much to keep up with her treatment schedule as is, plus taking care of our young daughter and full-time work. I appreciate any input you might have about this decision. Gina",
      "MessageIndex": 4577,
      "PostDate": "21/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    }
  ]
}