{
  "AuthorID": "gpawelski",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
  "Posts": [
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Jul 21, 2010 06:36PM gpawelski wrote: LinTol Functional profiling assays can include anti-vascular drugs, such as Avastin, Sutent, Nexavar, Tarceva, Iressa, Tykerb, both as single agents and in combination with each other and with traditional cytotoxic agents and hormonal therapies. It can simultaneously test for direct anti-tumor activity and for antivascular activity against the microvascular present within the three dimensional tumor cell clusters. Yes, a fresh \"live\" tumor specimen is needed to pre-test Avastin against a tumor.  There has been unique cell culture research with a new bio-marker assay for microvascular viability to identify potential responders to Avastin, Nexavar, Sutent, and other anti-angiogenic drugs by targeting not the cells themselves, but rather VEFG secreted by tumor cells. Prior to this development, it was thought that the lack of an intact tumor micro-vasculature would prevent in vitro drug studies in disaggregated tissues. However, it was discovered that endothelial cells are present in tumor microclusters and it appears that drug effect upon these cells can be assessed in this microvascular assay. It is the only assay which involves direct visualization of the cancer cells at endpoint, allowing for accurate assessment of drug activity, discriminating tumor from non-tumor cells, and providing a permanent archival record, which improves quality, serves as control, and assesses dose response in vitro. Photomicrographs in the assay can show that some clones of tumor cells don't accumulate the drug. These cells won't get killed by it. The assay measures the net effect of everything which goes on (Functional Tumor Cell Profiling). Are the cells ultimately killed, or aren't they? A microvascular viability assay for anti-angiogenesis-related drugs http://cancerfocus.org/forum/showthread.php?t=368 Tykerb enhances the antivascular activity of Avastin http://cancerfocus.org/forum/showthread.php?t=3152&highlight=Avastin+breast+cancer",
      "MessageIndex": 27,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755536",
      "Title": "FDA May Drop Avastin, Does Little To Help Breast Cancer Patients dhmeiser gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Jul 21, 2010 08:17AM gpawelski wrote: Actual results in patients count and theory doesn't matter as much as the evidence that it does what we want it to do. It would be more advantegeous to sort out what's the best profile in terms of which patients benefit from this drug. Some scientists are not sure whether Avastin or any other anti-angiogenic agents are working primarily by pruning new blood vessels, increasing the delivery of another anti-cancer therapy, or potentially another mechanism. Clinical oncologists involved with functional tumor cell profiling analysis, can actually examine this. They have a method for testing anti-angiogenic/anti-microvascular agents, such as Avastin and testing for synergy between different anti-microvascular agents on an individual patient, individual tumor basis. Avastin appears to better deliver the effects of other classes of drugs. Avastin facilitates vascular access of cytotoxics to tumors. It will take combination antivascular therapy to make a big difference, but this is definitely coming and it's the most promising thing on the near term therapeutic horizon. As for Avastin's side effects. Evidence in the Journal of Clinical Oncology shows that many of the highly expensive targeted drugs like Avastin may be just as effective and produce fewer side effects if taken over shorter periods and in lower doses. Avastin is one example. The dose being used is 15 milligrams per kilogram of body weight, despite research showing it may work with 3 milligrams per kilogram. Many doctors have been using Avastin \"off-label\" against a variety of cancer types. An estimated 60 percent of anti-cancer drugs are used off-label. It has been very routine and well-accepted practice to prescribe drugs in cancer types and disease stages outside of those in which the drugs originally received FDA approval. Generally, insurance companies have paid for drugs used outside of FDA-approved settings because the treating physician finds their use in those instances to be medically necessary. That's why I would personally want to have Avastin pre-tested against a tumor first to see if it was beneficial.",
      "MessageIndex": 25,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755536",
      "Title": "FDA May Drop Avastin, Does Little To Help Breast Cancer Patients dhmeiser gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Dec 15, 2007 11:28PM - edited Mar 29, 2008 08:55AM by gpawelski FDA Approves Cancer Drug Despite No Increase in Survival But is this drug worthy of approval? A review of the transcript of the FDA's own Oncologic Drugs Advisory Committee suggests a number of unsettling aspects, including: http://www.cancermonthly.com/iNP/view.asp?ID=209 Here is an example of a cancer trade group and its peer review venue. It is highlighted in a recent video by the Healthcare Channel, questioning a drug's use in breast cancer. http://blogs.wsj.com/health/2007/12/11/avastin-for-breast-cancer-the-pre-history/ The idea that approving drugs based on population studies has its limits. What may or may not work for the average population may not apply to the individual. Avastin killed more patients than the control arm. Avastin doesn't have to be used in every breast cancer patient. Taxol doesn't have to be used in every breast cancer patient (it seems like they do). The clinical trial was done using Avastin in combination with Taxol. Doctors are faced with a problem of whether to use Taxol and forgo Avastin, or to use some other conventional drug for initial therapy in order to use Avastin. Avastin is a \"large molecule\" monoclonal antibody. It can be tested with a EGFR biomarker assay because the \"target\" of Avastin is not the cells themselves, but rather a hormone (VEGF) secreted by the tumor cells. Avastin complexes with free VEGF and blocks its action. Having a good tumor-drug match not only would improve survival rates, it would be cost-effective, and the high cost of the newer cancer therapies reinforces the necessity of choosing the right therapy the first time around. The tumors of different patients have different responses to chemotherapy. It requires individualized treatment based on testing the individual properties of each patients' cancer.",
      "MessageIndex": 5,
      "PostDate": "15/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696834",
      "Title": "FDA DENIED AVASTIN FOR MESTASTIC BREAST CANCER! RoxanneNJ31 gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Feb 6, 2008 06:09PM gpawelski wrote:",
      "MessageIndex": 2,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694835",
      "Title": "Control Mechanism for Metastasis gpawelski gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "gpawelski wrote: A metastasis occurs when cancer cells dissociate from the original tumor and migrate via the blood stream to colonize distant organs. This is the main cause of cancer death. For a cell such as a cancer cell to migrate, it first must detach itself from neighboring cells and the intercellular material to which it is anchored. Before it can do this, it receives a signal from outside the cell. This signal takes the form of a substance called a growth factor, which, in addition to controlling movement, can activate a number of processes in the cell including division and differentiation. The growth factor attaches to a receptor on the cell wall, initiating a sequence of changes in the cellular structure. The cell's internal skeleton - an assembly of densely-packed protein fibers - comes apart and the protein fibers then form thin threads on the outside of the cell membrane that push the cell away from its neighbors. In addition, a number of protein levels change: some get produced in higher quantities and some in less. To understand which proteins are modulated by the growth factor and the nature of the genetic mechanisms involved in cancer cell migration, a map is needed all of the genetic changes that take place in the cell after the growth factor signal is received. One family of proteins stands out. Tensins are proteins that stabilize the cell structure. The amounts of one family member rise dramatically while, at the same time, the levels of another drop. Despite a familial similarity, there is a significant difference between them. The protein that drops off has two arms: One arm attaches to the protein fibers forming the skeleton, and the other anchors itself to the cell membrane. This action is what stabilizes the cell's structure. The protein that increases, on the other hand, is made up of one short arm that only attaches to the anchor point on the cell membrane. Rather than structural support, this protein acts as a kind of plug, blocking the anchor point, and allowing the skeletal protein fibers to unravel into the threads that push the cells apart. The cell is then free to move, and, if it's a cancer cell, to metastasize to a new site in the body. In experiments with genetically engineered cells, scientists have showed that the growth factor directly influences levels of both proteins, and that these, in turn, control the cells' ability to migrate. Blocking production of the short tensin protein kept cells in their place, while overproduction of this protein plug increased their migration. Scientists at The Weizmann Institute of Science, Rehovot, Israel, carried out tests on tumor samples taken from around 300 patients with inflammatory breast cancer, a rare but swift and deadly form of the disease, which is associated with elevated growth factor levels. The scientists found a strong correlation between high growth factor activity and levels of the 'plug' protein. High levels of this protein, in turn, were associated with cancer metastasis to the lymph nodes -- the first station of migrating cancer cells as they spread to other parts of the body. In another experiment, the scientists examined the effects of drugs that block the growth factor receptors on the cell walls. In patients who received these drugs, the harmful 'plug' proteins had disappeared from the cancer cells. The mechanism can predict the development of metastasis and possibly how the cancer will respond to treatment. This discovery may, in the future, aid in the development of drugs to prevent or reduce the production of the unwanted protein, and thus prevent metastasis in breast or other cancers. Source: Weizmann Institute of Science Gregory D. Pawelski Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694835",
      "Title": "Control Mechanism for Metastasis gpawelski gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Dec 2, 2007 08:27AM - edited Feb 6, 2008 06:08PM by gpawelski How Presentation of Recurrence Risk Influences Decision-Making Adjuvant Chemotherapy for Breast Cancer: How Presentation of Recurrence Risk Influences Decision-Making Celia Chao, Jamie L. Studts, Troy Abell, Terence Hadley, Lynne Roetzer, Sean Dineen, Doug Lorenz, Ahmed YoussefAgha, Kelly M. McMasters From the Division of Surgical Oncology and the Department of Medicine and Behavioral Oncology Program, James Graham Brown Cancer Center; the Departments of Psychological and Brain Sciences and the Biostatistics-Decision Science Program, University of Louisville; and the Division of Medical Oncology, Norton Healthcare, Louisville, KY; Abell Research Consulting, Ouray, CO. Address reprint requests to Celia Chao, MD, Department of Surgery, University of Texas Medical Branch, 301 University Blvd, Route 0527, Galveston, TX 77555-0527; e-mail: cechao@utmb.edu or Jamie L. Studts, PhD, James Graham Brown Cancer Center, 529 S Jackson St, Louisville, KY 40202; e-mail: jamie.studts@louisville.edu. Purpose: The purpose of this study was to examine the impact of four methods of communicating survival benefits on chemotherapy decisions. We hypothesized that the four methods of communicating mathematically equivalent risk information would lead to different chemotherapy decisions. Methods: Each participant received two hypothetical scenarios regarding their mother (a postmenopausal woman with an invasive, lymph node-negative, hormone receptor-positive breast cancer) and was asked to decide whether they would encourage their mother to take chemotherapy in addition to surgery and tamoxifen. In the part 1, participants received one of four methods of describing the chemotherapy survival benefit: (1) relative risk reduction, (2) absolute risk reduction, (3) absolute survival benefit, or (4) number needed to treat. In part 2, each participant received all four methods. Following each decision, participants were asked to rate their confidence and confusion regarding their decision. Results: Participants included 203 preclinical medical students. In part 1, participants who received relative risk reduction information were significantly more likely to endorse chemotherapy. In part 2, there were no treatment decision differences when participants received all four methods of communicating survival benefits of chemotherapy. However, receiving all four methods led to significantly higher ratings of confusion. In deciding on endorsing chemotherapy, participants understood the information best when presented with data in the absolute survival benefit format. Conclusion: These results support the hypothesis that the method used to present information about chemotherapy influences treatment decisions. Absolute survival benefit is the most easily understood method of conveying the information regarding benefit of treatment. Supported by the Center for Advanced Surgical Technologies (CAST) of Norton Hospital, Louisville, Kentucky and the Links for Life Foundation, Louisville, Kentucky. Journal of Clinical Oncology, Vol 21, Issue 23 (December), 2003: 4299-4305",
      "MessageIndex": 1,
      "PostDate": "02/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694835",
      "Title": "Control Mechanism for Metastasis gpawelski gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Dec 17, 2009 05:04PM gpawelski wrote: MJLToday It may be attributed to NCI's failure at assay-directed therapy. Good review papers exist on cell-based, cell-death assays and are increasingly appreciated, understood and applied by the private sector and European clinicans and scientists. The literature on these assays have not been understood by many NCI investigators and by NCI-funded university investigators, because their knowledge was almost always geared towards an assay technique (cell-growth) that hasnt' been used in private labs for over fifteen years now. NCI studies never determine if \"fresh\" tumor assays worked. All of the considerable literature which supports the use of these assays in patient management has been based on true \"fresh\" tumor (non-passaged) cell-based assays. Some years ago, NCI made an attempt to study assay-directed therapy of lung cancer. The study was a failure because it was done with established permanent cell lines (instead of fresh cells), which have been conclusively proven to have no predictive value at all with respect to the clinical activity spectrum. The result was a dismal 11% response. The NCI used \"cell lines\" because the major expertise of the investigators who carried out any study was in the creation of cancer \"cell lines\" and they wanted to see if they could perform assays on these \"cell lines\" to use in patient therapy. The results showed they were able to test successfully only 22% of specimens received, including only 7% of primary lesions. This contrasts with a 75% overall success rate reported by earlier investigators who used the same assay system in \"fresh\" tumor and a routinely obtained >95% success rate using improved (cell-death) methods available today. The NCI spent $15 million on a single-cell suspension \"fresh\" tumor assay with cell proliferation (cell-growth) rather than cell-death as an endpoint. When that didn't work, they folded their hand and specifically discouraged future applications of cell culture testing in their grant and contract guidelines, dating from the late 1980's. They never supported any drug development work based on primary cultures of three dimensional cell clusters with cell-death endpoints, which very nicely recapitulate known disease specific activity endpoints. Then later, there were sophisticated programs to discover gene expression microarrays which predict for responsiveness to drug therapy. The NCI had a huge lab working on microarrays to look for patterns of mRNA and protein expression which are supposed to be predictive of chemotherapy response. They spent 2 years trying to find patterns which correlated using the NCI's various established ovarian \"cell lines.\" They thought they had something, but when they started to apply them to \"fresh\" tumor specimens, none of the results in the \"cell lines\" was applicable to the \"fresh\" tumors. Everything they worked out in the \"cell lines\" was not worth anything and they had to start over from square one. However, the limitations and non-applicability of the NCI efforts, failed to realize that the way to identify informative gene expression patterns is to have a \"gold standard\" and the (cell-death) cell culture assays are by far the most powerful, efficient, useful \"gold standard\" to have, adding the potential value of the assays to individualize cancer therapy. It was routine for the NCI to append statements to grant and contract initiative announcements that applications relating to cell-based, cell-death assays were strongly discouraged. Dr. Dan Von Hoff (after his failed attempt at the old technology cell-proliferation assays) published a paper in 1990 in which he stated that clinical trials of cell culture assays would never be supported. And the cooperative groups have utterly refused to do the studies. Why should they? Five times as much work for much less (financial) reward. There was an enormous amount of published, peer-reviewed research documenting the \"accuracy\" of cell-based, cell-death assays. Scores of studies in thousands of patients. Based on both response and survival, but all of it excluded from the ASCO and insurance industry reviews. And it's the only evidence existing to validate any other medical test used as an aid in drug selection. Disallow the introduction of published, peer-reviewed evidence documenting accuracy. While allowing the introduction of hearsay, unstated, undocumented, undescribed, unpublished, unpeer-reviewed non-evidence. No one is seriously proposing that any of the molecular tests now available (Oncotype DX, EGFR amplification/mutation) should have to be proven \"efficacious\" as opposed to merely \"accurate\" before they are used in clinical decisions regarding treatment selection. Molecular assays have established absolutely no data relating to assay \"efficacy\" and with much less data relating to assay \"accuracy\" than exist to support the application of cell-based, cell-death assays. And yet, the validation standard that private insurance companies accept from molecular profiling tests is \"accuracy\" and not \"efficacy.\" The \"bar\" had been instantly lowered. No longer will it be essential to prove that the use of a diagnostic test improves clinical outcomes, all they have to do for these molecular profiling tests is prove that the test has a useful degree of \"accuracy.\" However, the validation standard ASCO wants for cell-based profiling tests is \"efficacy.\" There isn't one paper which, by itself, make the case for cell-based, cell-death assays. The data doesn't begin to constitute a series of prospective trials. I wouldn't accept a proposition that the whole thing depends on one study or even one review. You've got to consider the body of literature as a whole. The fact that none of this exists as one neat, convenient paper in the New England Journal of Medicine does not, in any way, negate the existence of this body of information. But, just because trials may have never been done, this should not be the reason for a medical oncologist to refuse to have the tests performed. Whatever clinical response that has resulted to the average number of patients in a radomized trial is no indication of what will happen to an individual at any particular time. They are trying to identify the \"best guess\" treatment for the \"average\" patient. There is no accuracy, nor any proof that what works for the \"average\" patient population will work for the \"individual.\"",
      "MessageIndex": 4,
      "PostDate": "17/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/744363",
      "Title": "chemo-sensitization Worried_Hubby gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Dec 7, 2009 06:26PM gpawelski wrote: There is nothing controversial about the testing. Medicare officially recognized these cancer chemosensitivity tests as a special test category in Federal Regulations (42 CFR 414.510(b)(3), 71 FR 69705, 12/01/2006). The are now known as Oncologic In Vitro Chemoresponse Assays. Until the controlled, randomized trialist approach has delivered curative results with a high success rate, the choice of physicians to integrate promising insights and methods like chemoresponse assays, remains an essential component of this kind of treatment technology. As with any other laboratory tests in cancer medicine, the determination of the efficacy of chemoresponse assays is based on clinical correlations (comparisions of laboratory results with patient response). The \"standard\" of retrospective correlations between treatment outcomes and laboratory results is sufficient in the case of ALL laboratory tests. It is what established FDA-approval for the test kit. What is the appropriate standard to judge medical tests? 1. Efficacy (use of tests improves clinical outcomes) 2. Accuracy (the test accurately measures what they are purported to measure) Laboratory tests are judged by accuracy and reproducibility and never by their effect upon treatment outcomes. For instance, most tests used today in oncology have comparable \"sensitivities\" and \"specificities.\" Pet Scans were not approved because they saved lives in a controlled clinical trial that compared the outcome of patients who received care with or without the benefit of a Pet Scan. They were approved because their performance characteristics (sensitivity/specificity) are reproducible, favorable and provide information to treating physicians. No test in oncology has ever been shown in prospective randomized clinical trials to improve patient outcomes. The existing standard has always been the \"accuracy\" of the test. This is true for every single test used in cancer medicine, from estrogen receptors to panels of immunohistochemical stains (IHC) to diagnosing and classifying tumor to Her2/neu and CA-125 to cell culture assays to MRI's, CT Scans, Pet Scans and so on. When you get to the new genetic/molecular tests, even the validation standard that private insurance companies is accepting is \"accuracy\" and not \"efficacy.\" The essential \"proof\" is that all they have to do for these tests is that the test has a useful degree of \"accuracy,\" not that the use of the diagnostic test improves clinical outcomes. However, the validation standard that ASCO wanted for cell-based profiling tests is \"efficacy.\" The cell-based profiling tests have the same entitlement to be judged by the same validation standard as genetic/molecular profiling and all other diagnostic tests. It must be noted that all types of diagnostic tests are just that, tests and not treatment. Because the number of available chemotherapeutic agents has increased enormously over the past few years, the emphasis on the rationale for these assays has never been stronger. As the number of possible treatment options supported by completed randomized trials increases, the scientific literature becomes increasingly vague for guiding physicians. Almost any combination therapy is acceptable in the treatment of cancer these days. Even NCI says so (their \"state of the art\" website). With the absence of effective laboratory tests to guide physicians, many patients do not even get a second chance at treatment when their disease progresses. Spending six to eight weeks to diagnose treatment failure often consumes a substantial portion of a patient's remaining survival, not to mention toxicities. In cases where there are several equivalent treatments available, patients can benefit from cell culture assay results as a supplement to other clinical data when deciding on a treatment option. http://www.rational-t.com/ http://weisenthalcancer.com/",
      "MessageIndex": 2,
      "PostDate": "07/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/744363",
      "Title": "chemo-sensitization Worried_Hubby gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Sep 25, 2012 07:04PM gpawelski wrote: Great technology, but information of extremely limited value. People will think because they are being completely genotyped, this will give all the answers needed. But it won't. Genotyping will only be of value for drugs for which a gene mutation is informative -- basically KRAS and EGFR mutations -- and we already have tests for those and they are of very limited value. Otherwise, it's a ton of information for which the drug selection value is pretty darn useless. What's more important than what genes are in the DNA is what genes are actively making RNA, which RNA is actively making protein, which protein is being turned off or turned on, and how all of the proteins in the cell are interacting with each other. The only way to get the latter information, which is ultimately what you want, is to treat the patient with phenotype analysis. In drug selection, phenotype analysis doesn't dismiss DNA testing, it uses all the information, measuring the interaction of the entire genome, to design the best treatment for each individual.",
      "MessageIndex": 13,
      "PostDate": "25/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793874",
      "Title": "MD Anderson's $3 Billion investment to research cancer 4myangels gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Oct 25, 2012 07:23AM gpawelski wrote: In an apparent effort to play King Solomon, the University of Texas System vice chancellor for health affairs has granted a limited waiver from the institution’s conflict-of-interest policy to the president of the University of Texas MD Anderson Cancer Center, The Houston Chronicle reports. And the move is prompting criticism because because the cancer center president Ronald DePinho will be allowed to maintain financial ties with his three drugmakers. His holdings in Aveo Pharmaceuticals, Karyopharm and Metamark Genetics will be placed in a blind trust as part of the waiver, the paper writes. This is clearly an interesting and unusual situation. The vice chancellor appears to be suggesting that real-world experience is useful to the school and apparently does not want to make a move that might prompte DePinho to exit. On the other hand, the critics make a point that a partial waiver suggests a slippery slope. Source: Pharmalot http://www.chron.com/news/houston-texas/houston/article/UT-System-lets-MD-Anderson-president-keep-3976008.php  ",
      "MessageIndex": 16,
      "PostDate": "25/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793874",
      "Title": "MD Anderson's $3 Billion investment to research cancer 4myangels gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Oct 22, 2012 10:13AM gpawelski wrote: Texas Turmoil: 'Vultures' In, Nobel Laureates Out http://www.medscape.com/viewarticle/772706",
      "MessageIndex": 14,
      "PostDate": "22/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793874",
      "Title": "MD Anderson's $3 Billion investment to research cancer 4myangels gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Sep 28, 2008 06:49AM - edited Oct 5, 2008 02:29PM by gpawelski http://community.breastcancer.org/forum/73/topic/721708",
      "MessageIndex": 8,
      "PostDate": "28/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721895",
      "Title": "whole brain radiation vhqh vhqh"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Jun 17, 2010 09:28PM gpawelski wrote:",
      "MessageIndex": 9,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707980",
      "Title": "Clinical Trials zilpah ElaineD"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Jun 17, 2010 09:29PM gpawelski wrote:",
      "MessageIndex": 10,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707980",
      "Title": "Clinical Trials zilpah ElaineD"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Mar 7, 2008 02:38PM gpawelski wrote:",
      "MessageIndex": 2,
      "PostDate": "07/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/700509",
      "Title": "Oncoplastic Surgery gpawelski Blinx"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "gpawelski wrote: By Helen Mabry, M.D., breast cancer surgeon and assistant director of the John Wayne Cancer Institute Breast Center at Saint John's Health Center.      Oncoplastic surgery is a relatively new practice of breast cancer surgery, combining oncology principles with plastic surgery techniques.  Based on the stage of their cancer, women with breast cancer usually must choose between a mastectomy (removal of the entire breast) and lumpectomy (removal of just the tumor from the breast). With mastectomy, a woman can have reconstructive breast surgery. With the breast conserving lumpectomy, a woman is often left with an unsightly scar and depressed breast cavity. Oncoplasty breast surgery involves completely removing the tumor but also gently reshaping the breast with the remaining tissue so that women have the best possible cosmetic outcome from their initial breast cancer surgery.           Although still a fairly rare specialty, there are more and more of us getting this specialized training. During my medical training, I was fascinated with plastic surgery, psychiatry and oncology, so this specialty suits me well.      Another new type of breast cancer surgery that I'm excited about is nipple-sparing mastectomy. We have a clinical study currently underway at the JWCI Breast Center. It is for women who have breast cancer that does not involve the nipple.  It can be done for a single or double mastectomy. It involves taking out the breast tissue - the dangerous part - but leaving behind the entire shell of skin, areola and nipple. Then we replace that breast tissue with tissue from another part of the body, such as the abdomen, or with an implant. This new surgery offers a beautiful result, retaining the central feature of a woman's breast. It's not as disfiguring or psychologically unpleasant as a conventional mastectomy. We're still monitoring the results for women who've had this new surgery, to see if and how many have a recurrence, but we are very optimistic about the long term outcomes.      No matter what type of surgery is indicated, the most important factor in successful treatment for breast cancer is early detection. The more advanced the cancer, the harder it is to treat effectively. Women over the age of 40 should have a mammogram annually in addition to a regular breast exam with their doctor. On average, mammography will detect about 80 to 90 percent of breast cancers in women who have no symptoms.       Helen Mabry, M.D., is a breast cancer surgeon and assistant director of the John Wayne Cancer Institute Breast Center at Saint John's Health Center. For more information about Dr. Mabry and other Saint John's services, please call (310) 829-8990 or visit the website at http://community.breastcancer.org/topic/91/conversation/. For a physician referral or a second opinion, please call 1-888-ASK-SJHC. Gregory D. Pawelski Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/700509",
      "Title": "Oncoplastic Surgery gpawelski Blinx"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Jan 4, 2011 09:49AM gpawelski wrote:",
      "MessageIndex": 1,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762859",
      "Title": "Blood test to spot cancer havehope gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Jan 19, 2011 03:57PM gpawelski wrote: It's not that unusual for healthy people to have an occasional cancer cell in their blood In an Opinion column on CNN, Dr. H. Gilbert Welch, M.P.H., a professor of medicine at the Dartmouth Institute of Health Policy & Clinical Practice and the author of Overdiagnosed: Making People Sick in the Pursuit of Health\" (Beacon Press 2011), raises questions about this simple new blood test that is able to detect minute quantities of cancer cells that might be circulating in your bloodstream. \"The conventional wisdom is people either have a disease or they do not. But, in fact, there are a lot of people somewhere in between. . . I don't know whether this test will help some patients. It might, but it will take years to figure that out... Ironically, what this test might actually teach us is that it's not that unusual for healthy people to have an occasional cancer cell in their blood.\" http://www.cnn.com/2011/OPINION/01/11/welch.overdiagnosed.cancer/index.html?npt=NP1 Dr. Elaine Schattner pointed out that Dr. Welch may have mised the point of this technology. It was developed primarily to help oncologists monitor tumors in patients who already are known to have disease. For example, doctors could check for new, resistance-conferring mutations in patients who are already on a cocktail of meds for lung cancer. The blood test could obiate the need for repeatedly doing CT scans and biopsies to measure disease, the extent of disease and new mutations in people undergoing cancer treatment. The June issue of Oncology News International (June 2010, V 19, No 6) quotes a Duke University study of the use of high-tech cancer imaging, with one representative finding being that the average Medicare lung cancer patient receives 11 radiographs, 6 CT scans, a PET scan, and MRI, two echocardiograms, and an ultrasound, all within two years of diagnosis. A study co-author (Dr. Kevan Schulman) asks: \"Are all these imaging studies essential? Are they all of value? Is the information really meaningful? What is changing as a result of all this imaging?\" So the investment by Johnson and Johnson, which was what the news was about, makes it more likely this will actually happen in non-research clinics. The technology has the potential to make cancer patients' lives easier and less costly and for doctors to stop giving them meds to which they've acquired resistance. http://www.scientificamerican.com/article.cfm?id=a-chip-against-cancer My comment is not really about early cancer diagnosis. It is about prognostication and drug selection with the CTC (circulating tumor cells) technique. The number of cells discovered in the CTC technique has turned out to be a good prognosticator of how well treatments are working. Monitoring CTCs could be utilized for confirmation after the patient is administered either empiric or assay-directed most beneficial therapeutic agents. But CTCs really aren't useful with respect to drug selection. The problem is with isolating (even by size) and analying single cancer cells. The supposition is that common cancers can be detected and cured through analysis at a genetic level of a small number of cells or even a single wayward cell. CTCs are free-floating cancer cells that can remain in isolation from a tumor for over twenty years. And what is the relationship of such long-lasting cells to the tumor cells that needed to be attacked through tested substances? And in regards to some molecular tests utilizing living cells, generally of individual cancer cells in suspension, sometimes derived from tumors and sometimes derived from CTCs, this was tried with the old human clonogenic assay, which had been discredited long ago. One testing approach to find CTCs actually can miscount non-tumor epithelial cells as tumor cells. And also highly invasive cells may not be detected if you are looking for epithelial antigens because the CTC also goes through a phase called \"epithelial to mesenchymal transition\", where you will miss locating that tumor cell if you are targeting the antigen. The key is to look for the tumor cell and not something else that \"hangs with the tumor cell.\"",
      "MessageIndex": 3,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762859",
      "Title": "Blood test to spot cancer havehope gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Jan 19, 2011 03:55PM gpawelski wrote:",
      "MessageIndex": 2,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762859",
      "Title": "Blood test to spot cancer havehope gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Oct 6, 2008 03:17PM gpawelski wrote: Sutent could be a miracle drug, for some. The short term future of cancer therapeutics is combinations of \"targeted\" drugs. Sutent is one of those targeted drugs. It is a \"multi-targeted kinase inhibitor.\" That means it inhibits several proteins involved in triggering replication in cancer cells. Sutent is an inhibitor of \"multiple\" protein kinases. Because these multiple proteins are involved in both \"tumor proliferation\" (growth) and \"angiogenesis\" (blood vessels feeding a tumor), Sutent has both \"anti-tumor\" as well as \"anti-angiogenic\" properties (not just one or the other). In addition, because Sutent inhibits \"multiple\" kinases, it possesses activity against \"multiple\" types of tumors. Sutent may directly bind to one of the proteins (VEGF) to directly inhibit angiogenesis (microvasculature regression). Within 24 hours of VEGF inhibition, endothelial cells have been shown to shrivel, retract, fragment and die by apoptosis (cell death). VEGF can cut off the supply of vessels that spring up to feed a tumor (angiogenesis). How many days will Sutent take to respond on the tumors? No one really knows without testing the tumor first, or doing \"trial-and-error\" treatment. Does the drug enter the cell? Once entered, does it immediately get metabolized of pumped out, or does it accumulate? If (through \"testing the tumor first\" or \"trial-and-error\" method) Sutent is \"synergistic\" (cooperative) to cancer cells, it could be a miracle drug. It will not cure, but it can prolong survival for some time (like the cronic disease diabetes). Functionally profiling tumor cells can measure the net effect of everything which goes on (the entire genome of a cancer cell). It can look at both the anti-tumor and anti-microvascular effects of cancer drugs. Are the cells ultimately killed, or aren't they?",
      "MessageIndex": 21,
      "PostDate": "06/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720783",
      "Title": "I can put you in remission! kateva17 gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Oct 9, 2008 04:42AM gpawelski wrote: According to this study, there is \"mixed\" results on whether Sutent works like Avastin, vice versa, or like Tykerb or Nexavar. Each \"individual\" is different with results, not \"population averages.\" It may, or may not. It would help to know before receiving potentially ineffective agents. Direct anti-tumor and anti-vascular effects were studied of Tykerb, Nexavar, Sutent and Avastin in fresh biopsy specimens of breast cancer and presented at the American Society of Clinical Oncology Breast Cancer Symposium on September 5, 2008. While the other clinically-available 'nib' drugs have been shown to have anti-vascular activity, anti-vascular activity of Tykerb has not been previously reported. Angiogenesis studies are limited by the clinical relevance of laboratory model systems. They don't do \"real world\" studies under \"real world\" conditions. Patient outcomes need to be reported in real-time, so patients and cancer physicians can learn immediately if and how patients are benefiting from new drug therapies. Cell culture detection of microvascular cell death in clinical specimens of human neoplasms and peripheral blood can identify the activity of both single drugs and combinations of drugs at the level of individual patients with individual cancers. It works by measuring drug effects (real-time) upon endothelial cells which make up blood vessels. Drugs like Avastin had striking anti-microvascular effects but minimal anti-tumor effects. Tarceva and Gleevec had mixed antitumor and anti-microvascular effects. Anti-microvascular effects of Tarceva and Iressa were equal to those of Sutent and Nexavar. Anti-microvascular additivity was observed between Avastin and other drugs on an individual basis. Conclusions of the study had shown that Tykerb has antivascular activity superior to that of Nexavar. Avastin + Tykerb may be the first clinically-exploitable antivascular drug combination. High dose, intermittent 'bolus' schedules of Tykerb to coincide with Avastin administration may be clinically advantageous, even in HER2-negative tumors. The system utilized for the study was a functional profiling assay, which may be used to individualize antivascular therapy. It can be adapted for simple, inexpensive and sensitive/specific detection of tissue and circulating microvascular cells in a variety of neoplastic and non-neoplastic conditions, for drug development, and individualized cancer treatment. The cell-based assay can accurately sort drugs into categories of above average probability of providing clinical benefit on one hand and below average probability of providing clinical benefit on the other hand, based both on tumor response and patient survival. http://www.weisenthal.org/Weisenthal_ASCO.pdf",
      "MessageIndex": 24,
      "PostDate": "09/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720783",
      "Title": "I can put you in remission! kateva17 gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "gpawelski wrote: Veridex, LLC announced that the technology used in the CellSearch® System to measure circulating tumor cells (CTCs) was ranked as the top medical innovation for 2009 by the Cleveland Clinic, a leading multispecialty academic medical center. The ranking is based on technologies likely to have a significant impact on health care next year. The prestigious annual recognition follows a rigorous selection process by a panel of Cleveland Clinic physicians. The list was announced today at the Cleveland Clinic's 2008 Innovation Summit. http://www.medicalnewstoday.com/articles/129501.php Gregory D. Pawelski Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725264",
      "Title": "Circulating Tumor Cell Technology As Top Medical Innovation gpawelski Judiiiii"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Dec 12, 2010 08:45AM gpawelski wrote:",
      "MessageIndex": 17,
      "PostDate": "12/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748823",
      "Title": "when a drug doesn't work we try to find another..philosophy vivo hope4us"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Dec 2, 2008 01:53AM gpawelski wrote: Even before the advent of the CellSearch technique, it had been observed in various cell-death biomarker assays that there was an increase in the number of metabolic activity of mitochondria of surviving cells from chemotherapy, even though in cases where the majority of cells were being killed. Therapy indeed may be giving clinical response (tumor shrinkage), however, these are mostly short-lived and relapses after a response are often dramatic. To evade chemotherapy, some cancer cells mimic stem cells. The tumor escapes from chemotherapy by induction of stem cell marker expression. The small number of cells that survive the treatment could then generate another tumor that metastasizes. The cancer stem cell markers are the same molecules that are found in embryonic stem cells. Dying cells could secrete a lot of factors that induce expression of stem cell markers. They are trying to survive and they use a mechanism from their experience of embryonic life. Understanding how to target these markers and these cells could prove useful in treating cancers. As for diagnostic tests, the FDA only looks to see whether or not the test works as described (accuracy), not whether it is effective in treating the disease (efficacy). They are judged by accuracy and reproducibility and never by their effect upon treatment outcomes. For instance, Pet Scans were not approved because they saved lives in a controlled clinical trial that compared the outcome of patients who received care with or without the benefit of a Pet Scan. They were approved because their performance characteristics (sensitivity/specificity) are reproducible, favorable and provide information to treating physicians. No test in oncology has ever been shown in prospective randomized clinical trials to improve patient outcomes. The existing standard has always been the \"accuracy\" of the test. This is true for every single test used in cancer medicine, from estrogen receptors to panels of immunohistochemical stains (IHC) to diagnosing and classifying tumor to Her2/neu and CA-125 to oncologic in vitro chemoresponse assays to MRI's, CT Scans, Pet Scans and so on.",
      "MessageIndex": 7,
      "PostDate": "02/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725264",
      "Title": "Circulating Tumor Cell Technology As Top Medical Innovation gpawelski Judiiiii"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Dec 2, 2008 08:15PM gpawelski wrote: I don't see where the CellSearch test might tell a patient that all treatments won't work. It is monitoring treatment just like CT, MRI or Pet imaging, but earlier. CellSearch allows oncologists to ascertain if a patient has circulating tumor cells (CTCs), that in many cases, is missed through traditional screenings or treatment follow-up. It can show the significance of CTCs at monthly intervals after initiation of therapy, including time points beyond baseline and first follow-up to the physician. It provides information after treatment to understand and decide when it is appropriate to modify treatment strategy. Seeing through the gray zone between an effective course of therapy from one that is futile. If there are no CTCs, it may mean that treatment is working and/or no further treatment is needed. If there are CTCs present, further treatment or change in treatment, would be indicated. Some treatments could be producing more cancer stem cells which are then capable of metastasizing. It was reported at the 27th Annual San Antonio Breast Cancer Symposium, using the CellSearch System, neoadjuvant chemotherapy with paclitaxel (taxol) causes a massive release of cells into the circulation, while at the same time reducing the size of the tumor. The tumor shrinks, but more cells are found in the circulation. This corresponds with a high pathologic complete response during paclitaxel (taxol) treatment, but in the end, this is not reflected in improved survival. The results indicate that monitoring of circulating tumor cells can contibute to understanding of tumor-blood interactions and may provide a valuable tool for therapy monitoring in solid tumors. (Oncol News Int'l, Vol 14, #5, May '05) Circulating tumor cell count provides a second measurement, complementary to imagining diagnostics, as Dr. Graham states, do fewer radiology imaging studies, which can reduce cost, lessen radiation exposure and save valuable time for the patient.",
      "MessageIndex": 12,
      "PostDate": "02/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725264",
      "Title": "Circulating Tumor Cell Technology As Top Medical Innovation gpawelski Judiiiii"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Dec 3, 2008 12:01AM gpawelski wrote: Boy! I sense paranoia. Somebody must be on a mission. http://www.breastcancer.org/about_us/supporters/corp_sponsors.jsp",
      "MessageIndex": 15,
      "PostDate": "03/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725264",
      "Title": "Circulating Tumor Cell Technology As Top Medical Innovation gpawelski Judiiiii"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Dec 1, 2008 02:43PM gpawelski wrote: Innovative Diagnostic Technology Results of using the CellSearch System indicate that monitoring of circulating tumor cells (CTC's) can contribute to the understanding of tumor-blood interactions and may provide a valuable tool for therapy monitoring in solid tumors like breast, colorectal or prostate cancer. With cells being alive in circulation, it may mean that a patient would need additional treatment. These ciculating tumor cells can detach from solid tumors and enter the blood stream, thus beginning the process of metastasis, the most life-threatening aspect of cancer. To metastasize, or spread cancer to other sites in the body, circulating tumor cells travel through the blood and can take root in another tissue or organ (like the lungs, bones, liver, adrenals and even the brain). Immunicon's founder/scientist (immunologist) Paul Liberti's Immunicon team developed all the technology to help researchers and oncologists monitor CTC's. Immunicon licensed their technology to Johnson & Johnson who formed a new unit called Veridex to market Immunicon's CellSearch technology. The technology gives the patient and oncology community a great method to monitor treatment. The CellSearch system can be very complimentary to an array of tools that oncologists should be using to counsel their patients. The technique can be done earlier than other currently approved diagnostic modalities like CT, MRI or PET imaging. CellSearch is basically what is going on with functional profiling, which shows what patients are benefiting from what drug agents \"before\" introducing them into the patient. Anti-cancer treatments often effectively shrink the size of tumors, but some might have an opposite effect, actually expanding the small population of cancer stem cells believed to drive the disease. Some treatments could be producing more cancer stem cells which are then capable of metastasizing, because these cells are trying to find a way to survive the therapy. The tumor escapes from chemotherapy by induction of stem cell marker expression. The small number of cells that survive the treatment could then generate another tumor that metastasizes. This may help explain why the expression of stem cell markers has been associated with resistance to chemotherapy and radiation treatments and poor outcome for patients with cancers including prostate, breast and lung cancers. That tells us that understanding how to target these markers and these cells could prove useful in treating these cancers. Analysis of stem cell expression before and after treatment reveals that even as some anti-cancer treatments shrank tumors, they increased expression of stem cell markers (of which contibute to stem cells' defining ability to renew themselves and differentiate into different cell types). Some treatments are not enough to completely inhibit tumor growth, and the cancer stem cell markers are still present. Even if one or more chemotherapy regimen is identified as being likely to work on a particular cancer, has the science advanced to tell us whether application of the chosen chemotherapy regimen will not cause other changes that also cause cancer to later return and perhaps be even harder to treat? Is it a case of chemotherapy being bad, in cases where it apparently works? Chemotherapy can be mutagenic (changes in form). It might kill off a whole lot of cancer, only to cause a mutation in the remaining cancer, such that the remaining cancer behaves in a more aggressive fashion. Much more work needs to be done, and oncologists need to adapt treatment to the patient. There are hundreds of chemotherapeutic agents, all of which have approximately the same probability of working. The tumors of different patients have different responses to chemotherapy. It requires individualized treatment based on testing individual properties of each patient's cancer. Sources: BMJ2007;334(suppl 1):s1(6January),doi:10.1136/bmj.39034.719942.94 The European Science Foundation Cell Function Analysis journal Molecular Biology of the Cell American Assoication for Cancer Research",
      "MessageIndex": 1,
      "PostDate": "01/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725264",
      "Title": "Circulating Tumor Cell Technology As Top Medical Innovation gpawelski Judiiiii"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Dec 2, 2008 12:34PM gpawelski wrote: With monitoring cells alive in circulation, it can help oncologists decide that a patient would need additional treatment or other agents of treatment, although \"after\" the drugs are already introduced to the patient. But that is what CT, MRI or PET imaging is already doing. CellSearch is complimentary to an array of tools that oncologists can use to counsel their patients. Preferably, I would like to know what agents are working (sensitive) \"before\" introducing them into the patient.",
      "MessageIndex": 9,
      "PostDate": "02/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725264",
      "Title": "Circulating Tumor Cell Technology As Top Medical Innovation gpawelski Judiiiii"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Dec 4, 2008 02:02AM gpawelski wrote:",
      "MessageIndex": 19,
      "PostDate": "04/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725264",
      "Title": "Circulating Tumor Cell Technology As Top Medical Innovation gpawelski Judiiiii"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Sep 30, 2012 12:06PM gpawelski wrote: Good thoughts Bestbird! The building blocks of human biology are carefully construed into the complexities that we recognize as human beings. However appealing genotyping analysis may appear to those engaged in this field, unfortunately, it will be years before these profiles can approximate the vagaries of human cancer. The endpoints (point of termination) of genotyping analysis are gene expression, examining a single process (pathway) within the cell or a relatively small number of processes (pathways) to test for \"theoretical\" candidates for targeted therapy. The endpoints of phenotyping analysis are expression of cell-death, both tumor cell-death and tumor associated endothelial (capillary) cell-death (tumor and vascular death), and examines not only for the presence of the molecular profile, but also for its functionality, the interaction with other genes, proteins and other processes occurring within the cell, and for its \"actual\" response to anti-cancer drugs (not theoretical susceptibility). Phenotyping analysis measures biological signals rather than DNA indicators, provides clinically validated information and plays an important role in \"cancer drug selection.\" The data that support phenotyping analysis is demonstrably greater and more compelling than any data currently generated from genotyping analysis. One such example. Phenotype analysis is more accurate than genotype analysis. http://cancerfocus.org/forum/showthread.php?t=3490 We don't know how to handle one gene, never mind 20,000 genes. To put this in context, two percent of the human genome that codes for known proteins (the part that everyone currently studies) represents only 1/20 of the whole story. It's not just PCR and the Microarrays, the whole concept of using molecular \"signatures\" of any kind to do anything beyond the most straightforward of cases (i.e. single gene mutations like BCR/ABL in CML leukemia) is so flawed that everyone should have seen the problems at the beginning. The reason why no one seemingly sees it now can be explained by the facts that the technology itself is so elegant and beautiful (or sexy to some). But a beautiful biological technology is no different than a beautiful computer technology - it's not worth much without some very good applications (\"apps\") and we will confront one targeted drug after another. A more highly productive direction would be to investigate the targeting agents in each individual patient's tissue culture, alone and in combination with other drugs, to guage the likelihood that the targeting will favorably influence each patient's outcome. The need for phenotyping analysis has never been greater. As systems biologists point out, complexity is the hallmark of biological existence. Any attempts to oversimplify phenomena that cannot be simplified, have lead us in the wrong direction. Greg",
      "MessageIndex": 9,
      "PostDate": "30/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793942",
      "Title": "BC Genetic Mapping Complete Bestbird gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Sep 25, 2012 10:07PM gpawelski wrote:   The \"Moon Shots Program\" will focus on genomics to understand the genetic and molecular basis of cancers and to identify patient-specific treatments by making genomics routine in cancer care. Tumor analysis coupled with clinical trial literature search to try and match therapies to patient-specific biomarker information to generate a treatment approach. The problem is that genomics cannot predict for disease or patient-specific drug effects (drug selection). No technology is more well suited to the investigation and simultaneous analysis of the relationships between patient-specific target molecules, cell functions and cell sub-populations than cytometry and Cytometric analysis of cell phenotype and function provides a very comprehensive overview of this ever-broadening field. It doesn't dismiss DNA testing, it uses all the information, measuring the interaction of the entire genome, to design the best treatment for each individual. Dr. Len Lichtenfeld of the American Cancer Society wrote: “It is important to recall that despite the fact this is incredibly sophisticated and difficult work, it is still reasonably early in our ability to perform the analyses, interpret the data, and determine the best way to apply it to the clinic. We still have a long way to go, and we must always remember that cancer has a way of being more complicated at every turn that we might otherwise anticipate as our research and our knowledge advances. But research such as this also puts more of the pieces of the puzzle of breast cancer together in a way that a solution to the dilemma of understanding breast cancer and how we can apply the best treatment does appear to be more readily at hand. What is the most important message from this research? Unfortunately, it is not going to change lives immediately. Your doctor isn’t going to give you a different treatment for your breast cancer today, tomorrow, or next week because of this research. There is no question that doctors involved in breast cancer treatment are going to take a very careful look at this research and determine the best way to apply this information to new approaches to breast cancer as quickly as they can, but that will still take time. To me, the most important message from this research is to confirm what many of us have been thinking for some time now: we are seeing the fruits of decades—yes, decades—of hard work in the laboratory taking us to a point we are going to have a significant impact on patient care and the outcomes of treatment for cancer. At the same time, the very support for that research is in jeopardy due to decreases in government funding, business investment, and private philanthropy.” http://acspressroom.wordpress.com/2012/09/24/naturebreastcancertypes2012/",
      "MessageIndex": 6,
      "PostDate": "25/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793942",
      "Title": "BC Genetic Mapping Complete Bestbird gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Sep 29, 2012 10:14PM gpawelski wrote: People will think because they are being completely genotyped, this will give all the answers needed. But it won't. Genotyping will only be of value for drugs for which a gene mutation is informative -- basically KRAS and EGFR mutations -- and we already have tests for those and they are of very limited value. Otherwise, it's a ton of information for which the drug selection value is pretty darn useless. What's more important than what genes are in the DNA is what genes are actively making RNA, which RNA is actively making protein, which protein is being turned off or turned on, and how all of the proteins in the cell are interacting with each other. The only way to get the latter information, which is ultimately what you want, is to treat the patient with phenotype analysis. In drug selection, phenotype analysis doesn't dismiss DNA testing, it uses all the information, measuring the interaction of the entire genome, to design the best treatment for each individual.",
      "MessageIndex": 7,
      "PostDate": "29/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793942",
      "Title": "BC Genetic Mapping Complete Bestbird gpawelski"
    },
    {
      "AuthorID": "gpawelski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22222/profile",
      "Content": "Aug 25, 2013 03:16PM gpawelski wrote: Chemosensitivity Tests (CSRA) World renowned Oncologists are challenging the cancer industry to recognize a Chemo-Screening test (CSRA) that takes the \"guesswork\" out of drug selection. One of the reasons medical oncologists don’t like in vitro chemosensitivity tests is that it may be in direct competition with the randomized controlled clinical trial paradigm. http://vimeo.com/72389724 Why Oncologists Don’t Like In Vitro Chemosensitivity Tests? http://cancerfocus.org/forum/showthread.php?t=4001",
      "MessageIndex": 9,
      "PostDate": "25/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799720",
      "Title": "CSRA's Experience LilSchatzie gpawelski"
    }
  ]
}