{
  "AuthorID": "GracePang",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
  "Posts": [
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Jul 20, 2010 07:28PM GracePang wrote: I have two sisters, one brother and have more than a dozen cousins. nobody in my extended family has cancer except me. In my case, I believe my initial cancer 6 years ago was caused or related to stress, and my mets found last year was again related to stress. I was kind of let my guard down and took to much that I can handle which caused a lot of stress. Now, I will do as much as I can to reduce stress.",
      "MessageIndex": 78,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755096",
      "Title": "Stress and Breast Cancer lukejessesmom texasrose361"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Jul 22, 2010 07:19AM GracePang wrote: Thank you, Robin, for starting this thread. There are so many wonderful ladies on this board offering their helps and love selflessly to others. You all are truly my inspirition and backup. Love to you all. Grace",
      "MessageIndex": 38,
      "PostDate": "22/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755013",
      "Title": "To the wonderful ladies on this board... RobinWendy vickib"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Jul 20, 2010 01:12PM GracePang wrote: Hi Robin, Just want to say that I am here with you. Prognosis is only a prognosis and not a reality. I strongly believe you will continuously do well and keep inspiring us as you did. Grace",
      "MessageIndex": 154,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755270",
      "Title": "The prognosis in not good RobinWendy BrokenHeart"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Jan 26, 2011 08:16PM GracePang wrote: Hi Candice, You are such a lovely daughter and Hope the whole brain radiation will work for your Mom (I am sure it will). I am in a very similar situation as your Mom. I had mutiple brain tumors found last May (more than a dozen and they didn't give me a count) and I also saw bursting lights. My oncologist gave me the exact same advice/suggestions as your Mom's doctor, which really upset me. He didn't want to switch my drugs (Taxotere+Herceptin) to Xeloda + Tykerb; referred me to a rad onc to take care of my brain and he kept watching for my other mets (liver & lungs). I had WBR last July and the MRI in Sept showed significant decrease of tumor sizes. By December, MRI shows all small tumors were gone, but 3 of them glowed up. I just had Gamma knife two weeks ago and my next MRI was booked to be in April; Hope the Gamma knife will zap them all. I pushed for Xeloda in November and got it along with Herceptin since then. I will see my onc this Friday and will push for Tykerb. Here, if he gives me Tykerb, he will drop Herceptin, which I don't agree, but I know that he would not give me Herceptin and Tykerb at the same time. At least, Tykerb will work on brain tumors, so I would be willing to try. There are many ladies on this board taking Tykerb and Herceptin with good results. If possible, you may want to push for that. You can do a search on this board about brain mets and can find alot of information. Grace ",
      "MessageIndex": 5,
      "PostDate": "26/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763995",
      "Title": "My mom's brain mets Cpratt2010 hezzy"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Nov 7, 2009 06:26PM GracePang wrote: Prayers and condolences to the family.",
      "MessageIndex": 30,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743454",
      "Title": "Luv2Travel is an Angel now LuAnnH BonnieVA"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Oct 29, 2009 05:00PM GracePang wrote: Dear All, Thank you for your advice. I spent my whole day at the hospital to talk to my onc and then wait for 6 hours in the ER to get blood thinner shot. Just got home a while ago. Still feel bad. I talked to my onc about all possible options, including using another vein, take herceptin without taxotere, keep the port while take blood thinner and get chemo next week, ect. He would not bend. He insist to deal with the clot first, which apprently was very small and radiologist would not even sure if it was a clot. My onc would not even give me a date for my next chemo, because he said it depends on the blood thinners work. The doctor at the ER contacted my surgeon and ask him if he would remove the port. The surgeon said no as long as my arm does not swallen. So, don't know what I shall do if my onc insist to remove the port. Removing the port will further delay my chemo and as Flash mentioned it could cause more clots. I somehow feel that onc reluctant to give me chemo. My chemo was already delayed because he suggested me to get the port. Now, he insisted on an ultrasound to find out the small clot, which will further delay my chemo. In Canada, we have to have family doctor to refer us to a second opinion, which may take a while. I know it won't matter if chemo was delayed for one or two weeks, but the thing is he would not even give me an approximate date for my next chemo. I feel so helpless. I was so upset with him and he said if I insist keeping the port, I should sign a paper saying that it was my decesion and he will not be responsible anymore. please tell me what I shall do....",
      "MessageIndex": 10,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742965",
      "Title": "Urgent: Advice Needed for Port clot and canceled chemo GracePang GracePang"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "GracePang wrote: I had Port installed last Friday and the nurse drew blood successfully this Tuesday. My onc ordered ultrasound and they now said they suspect there was a small clot near my port. My onc decided cancel my treatment scheduled for tomorrow, to remove the line and give me blood thinner. I am feeling perfectly fine now. Shalll I get a second opinion or shall I insist getting the chemo? The chemo is so important since he only give me 1 year to live with chemo and 6 mths without chemo. I am so upset with his decision. Is there way to get chemo from other vein without the port? Any advice would be appreciated.  ER-/PR-; Her2+++, Stage III breast cancer 5 years ago. Had AC+T and then 1 year of Herceptin. Mets on Liver and Lungs now. Innumerable nodules. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742965",
      "Title": "Urgent: Advice Needed for Port clot and canceled chemo GracePang GracePang"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Oct 29, 2009 08:18AM GracePang wrote: The ultrasound results saying there was something near the port that looks like a clot. They were not sure yet about the clot and decided to move the port. Thank you, for letting me know about the possibility to caus clotting by removing the port. I can't stop crying after hearing their decisions. I am now trapped with the Canadian system, since it will take along time to go and get a second opinion.",
      "MessageIndex": 2,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742965",
      "Title": "Urgent: Advice Needed for Port clot and canceled chemo GracePang GracePang"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Oct 29, 2009 05:05PM GracePang wrote: Another note: I found out today that I will on blood thinner pills for at least 6 months and maybe life time, because of the clot is very dangerous for lung. They also told m that blood thinner's risk is bleeding and if it happens in brain, it will be a stroke. If I knew ahead of time about these risks of a port, I would not take it. I feel doomed now to complicate the current desease. I would suggest ofther sisters considering a port to be careful. Don't know if you have got similar information about the clot thing.",
      "MessageIndex": 11,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742965",
      "Title": "Urgent: Advice Needed for Port clot and canceled chemo GracePang GracePang"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Oct 31, 2009 10:51AM GracePang wrote: Dear All, Thank you very much for your advice. They are very helpful. I felt so stuck, because of this complication. I worry about the further spreading of my cancer, which may be too late to treat later on. With some helps from friends last Friday, I should be able to get a seond opinion hopefully next week. I agree with you, Vilma and Elizabeth, that this might be the best thing to do right now, but my onc just could not talk to me this way. Technically, he is excellent; however, somehow, I don't feel seeing hopes from talking to him. Will see if I can transfer to another onc. By the way, the surgeon did my port diagree about removal of the port. My onc now decided to leave it there. I will however talk to another doctor about this. Love you all, Grace",
      "MessageIndex": 15,
      "PostDate": "31/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742965",
      "Title": "Urgent: Advice Needed for Port clot and canceled chemo GracePang GracePang"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Nov 2, 2009 12:01PM GracePang wrote: Bad news that my port keeps clotting on me despite the fact that I am on blood thinner now and my INR is 2.3 today. I got an ultrasound today and they found more clots even though I have no symptoms. Th port has to go and my chemo again is in uncertainty. No news yet from my onc in terms when to remove the port and further plan. Feel so bad. In addition, the news of losing three sisters on this board within three days wrecked my heart. Right now, just want to cry and feel hopeless.... ",
      "MessageIndex": 17,
      "PostDate": "02/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742965",
      "Title": "Urgent: Advice Needed for Port clot and canceled chemo GracePang GracePang"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Mar 9, 2011 07:38AM GracePang wrote: Hi Denis, So sorry to hear the news and and I am thinking of Lynn, you and your lovely daughter. Hope Lynn could stay in palliative care for a long time. Grace",
      "MessageIndex": 34,
      "PostDate": "09/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765945",
      "Title": "The verdict is in Bernicky lwd"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Feb 28, 2010 10:56AM GracePang wrote: Hi Elizabeth, Just stop by to see how you are doing. I am amazed by your cheering attitudes, which makes me feel better. Sending you hugs. Grace",
      "MessageIndex": 288,
      "PostDate": "28/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Feb 16, 2010 01:06PM GracePang wrote: Dear Elizabeth, You have alot of options to try and I am sure you will respond well to the drugs your doctor will put you on. I am here to support you and send you my thoughts and hugs. Grace",
      "MessageIndex": 143,
      "PostDate": "16/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Feb 1, 2010 07:08AM GracePang wrote: Fitz, My onc wrote \"incurable\" on my form and my insurance office (in Canada) seemed happy with this word. I don't know what to think myself. I hate the fact that in order to get benefits, our feelings need to be put on the line. hugs, Grace",
      "MessageIndex": 7,
      "PostDate": "01/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747631",
      "Title": "WTF accelerated benefits Fitztwins Shaysmom"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Jan 16, 2010 02:35PM GracePang wrote: Dear Elizabeth, I am sending you a lot of hugs and thoughts. I am sure you will do very well with the super Herceptin trial. I have read alot of good things about this trial on the board and I actually was thinking of joining it if we have it in Canada. I hope you can get on this trial sooner than you thought. Please keep us updated. Even though the mets came back, they sounded minor (suspicious) and they were caught early. Your new drug will kick all of them, including the old one. Love, Grace",
      "MessageIndex": 83,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746762",
      "Title": "Progression in liver and bones :-( konakat dreamwriter"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Nov 15, 2010 12:37PM GracePang wrote: Dear Darlene, Sorry to hear the difficulties you experienced, but glad with the TDM1 effectiveness. Sending you postive thoughts and energy and hope the brain edema turns out to be nothing. Grace",
      "MessageIndex": 28,
      "PostDate": "15/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760701",
      "Title": "BRAIN & ME OUT OF ICU DARLENEDENISE GracePang"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Dec 10, 2010 12:43PM GracePang wrote: Hi Marie, This is indeed scary and bad. I hope they will treat her brain tumors with radiosurgery. I don't think 2cm is too big for radiosurgery. I had WBR 3 months ago and it is scary to learn that WBR could have such side effects. Is your mom on chemo and what kinds of drug she has been taking? Just wonder how her brain tumors could grow within 2 months. Grace",
      "MessageIndex": 11,
      "PostDate": "10/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761788",
      "Title": "really bad news, marieibrahim Bernicky"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Dec 31, 2010 09:15PM GracePang wrote: Hi Darlene, Just come in to check how you are doing. Hope the TDM1 works wonders for you. Happy New Year! Grace ",
      "MessageIndex": 40,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760701",
      "Title": "BRAIN & ME OUT OF ICU DARLENEDENISE GracePang"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Nov 1, 2010 06:53PM GracePang wrote: Hi Jeanne, I am sending you love and positive thoughts; the brain MRI will be clear and you will be in the trial soon. Your onc team's ignorance was outrages; I understand how frustrated you must have felt. I experienced the same from time to time. Love, Grace",
      "MessageIndex": 43,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760040",
      "Title": "So Scared - No Place To Hide jeanne46 claygirl"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "GracePang wrote: I got a port installed 5 days ago (last Friday) and it was really painful for the first two days and I started coughing a bit. It got better starting the 3rd day, but still have sourness up to today. The nurse drew blood from it yesterday successfully and she said it worked well. However, when I saw my onc today, he suggested me to have X-ray and ultrasound of the area to make sure it works. I understand about the X-ray, because I picked up some coughs after the surgery. Do anyone know why ultrasound is needed after successful blood draw? The lady doing ultrsound on my today digged alot in the sour area and really hurted me. It took her a full hour to have the ultrasound done. Is this normal? I felt more pain after her pokes and now I have to put icepack on it and take some advil to reduce the pain. ER-/PR-; Her2+++, Stage III breast cancer 5 years ago. Had AC+T and then 1 year of Herceptin. Mets on Liver and Lungs now. Innumerable nodules. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742925",
      "Title": "Questions on Port Installation GracePang claygirl"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Oct 5, 2009 02:44PM GracePang wrote: Dear Lisa, Thank you for your knowledgable response. It really helps! Yes, I will talk to my onc this Wednesday about Herceptin. He will use it after he discusses it with me. I feel so tired and pains everywhere, including my chest. You response really made my day. Love, Grace",
      "MessageIndex": 2,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741494",
      "Title": "Reactions to 1st TC GracePang GracePang"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "GracePang wrote: I received TC (Taxotere and Cytoxan) on Oct. 1st smoothly, but volmitted after 6 hours. The nousea feeling lasted for 24 hours, companied by muscle pains and bone pains as expected as the side effects of Taxotere. Starting 2nd day of TC, I also started dry cough, which was not listed as any side effects of either drugs. Its the 4th day today, the dry cough becomes even more sever and feel very tired. Anybody has had such experience and can tell me where the dry cough comes from? My cancer mets to lung, liver and bone. Is it possible that the cancer still grow after TC, which got worse that caused coughing? My appointment with my onc is Wednesday and would appreciate some suggestions in terms of the causes of my dry cough.  ER-/PR-; Her2+++, Stage III breast cancer 5 years ago. Had AC+T and then 1 year of Herceptin. Mets on Liver and Lungs now. Innumerable nodules. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741494",
      "Title": "Reactions to 1st TC GracePang GracePang"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Aug 26, 2010 02:48AM GracePang wrote: I also finished 12 sessions of WBR not long ago (two weeks) and I know how it feels. I still feel tired from time to time now. My chemo treatments will resume tomorrow after a few weeks of break. Glad you finished yours and wish the best for the following treatment plan.",
      "MessageIndex": 18,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757014",
      "Title": "Did I mention I have Brain Mets? palaminoridesagain Lowrider54"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Dec 8, 2010 11:53AM GracePang wrote: Thank you, Elizabeth, for posting this. Does anyone know if it interact/interfere with chemo, such as Xeloda? ",
      "MessageIndex": 7,
      "PostDate": "08/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761624",
      "Title": "Update on low dose Aspirin konakat lorieg"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Oct 20, 2010 12:16PM GracePang wrote: I was disagnosed with numerous brain tumors in July 2010; had 12 sessions of WBR in July. Recent scan showed significant reduction of tumors in size and next scan was scheduled for mid December. I am taking Herceptin and Taxotere for treatments and my onc doesn't seem like changing my chemo regime because of brain mets. My CEA tumor marker goes up lately from 5.8 to 6.2, which really concerns me, since tumor markers have been pretty precise for me. Will have to wait for next round of scans in November and December ..... Thank you for starting this Thread, Joyce. It is very useful for us brain met patients to read others' stories. Grace",
      "MessageIndex": 18,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759204",
      "Title": "Brain Mets treatment Poll Joyce4123 marieibrahim"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Dec 8, 2010 05:42PM GracePang wrote: Thank you, Elizabeth, for the information. You are right and reminded me of reading the same thing on the Xeloda sheet. Xeloda has the tendency to lower plalet (spelling?) and taking Aspirin may be risky. Thank you so much!  Grace",
      "MessageIndex": 12,
      "PostDate": "08/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761624",
      "Title": "Update on low dose Aspirin konakat lorieg"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "GracePang wrote: I am 45 years old now. 5 yrs ago, was dignosed with Stage III breast cancer with ER- and Her2+++. Recently, CT scan showed \"innumerable pulmonary nodules throughout both lungs. There are two spiculated nodules in the right lower lobe. One measures 2.3cm, and is more anteriorly positioned abutting the inferio aspect of the oblique fissure and the other is medially positioned.....\". My Onchologist suggested using Cyclophosphamide+Taxotere+Herceptin. Would like to know how long I can live and are these drugs effective? ER-/PR-; Her2+++, Stage III breast cancer 5 years ago. Had AC+T and then 1 year of Herceptin. Mets on Liver and Lungs now. Innumerable nodules. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/740820",
      "Title": "I need help: Would TC +Herceptin drug work? GracePang GracePang"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "GracePang wrote: My cancer type is Her2+++/ER -. Recent CT scan showed mets on liver and lungs. innumarable nodules and one is 2.5cm in lung. Doctor will give me Taxotere + Cyclophosphamide + Herceptin, but can't start until a government committee approves it that may take one week or longer. I am so worried that the cancer grows fast and one week would be a too long wait. Any of you know wether this is a reasonable wait and do you have any experience like this? Thank you in advance for your thoughts. I am so anxious now and don't know what to do. ER-/PR-; Her2+++, Stage III breast cancer 5 years ago. Had AC+T and then 1 year of Herceptin. Mets on Liver and Lungs now. Innumerable nodules. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740947",
      "Title": "How fast cancer grows? Treatment delayed b/c approval need GracePang konakat"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Sep 25, 2009 02:35PM GracePang wrote: Thank you all for your words. Your informaton makes me feel much better. This is such a great site. I don't know how to handle all the stress without you. Love you all.",
      "MessageIndex": 4,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740947",
      "Title": "How fast cancer grows? Treatment delayed b/c approval need GracePang konakat"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Feb 27, 2010 03:25PM GracePang wrote: Hi Thank you for the warning. I actually have some conerns about my port. I don't have fever, but there is some redness along the line that runs over my lockbone. Since I am skinny, the line is visible under my skin and the redness is about 1 inch long. I don't have any other symptoms though: no fever, no ichiness. Does any one experience such thing? I asked my onc and he said we shall keep eyes on it,but no actions for now. Grace",
      "MessageIndex": 1,
      "PostDate": "27/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/749041",
      "Title": "Ports and Sepsis LadieKadie LadieKadie"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Oct 12, 2009 01:22AM GracePang wrote: Hi Nancy, I am on the same boat as you are. I was Stage 2b 5 years ago and recent CT scan (Sept 22) showed mets to my livers (messes), and both lungs (innumerous nodules; two are 2.5cm); and they didn't even bother to count. Bone scan showed one leision on my spine; ultrasound showed thickening liners in my uterous. They will do brain scan on my next Tuesday. Before finding all these, I was at my best health peak and felt so good without any symptoms. All blood work was normal. Let's encourage each other and beat the odds. I have confidence that I will survive this and be one of those sisters on this site who survived for 6 years and beyond. I got my first chemo (TC) last week; but my second chemo will be delayed for a week.Will post more later. Grace",
      "MessageIndex": 5,
      "PostDate": "12/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741777",
      "Title": "Made the mistake of reading results from PET/CT nancyh nancyh"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Jul 21, 2010 12:36PM GracePang wrote: Darlene, I am heartily happy for you and what a great news! I wish one day I will be able to post something like this and cheer others up. You have been inspiring me and make me seeing hope during this difficult journey, especially recently. Grace",
      "MessageIndex": 6,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755649",
      "Title": "Brain scan says.... DARLENEDENISE katie11"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Jul 11, 2011 11:32AM GracePang wrote: I feel so sad about this shocking news. Darlene has inspired me and her information has helped me alot to go through my own brain mets. Rest in peace, Sister. We love you.  ",
      "MessageIndex": 39,
      "PostDate": "11/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771392",
      "Title": "DARLENEDENISE MCTHO katie11"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Jul 23, 2010 09:30PM GracePang wrote: sent the card two days ago. Hope it finds Egal well.",
      "MessageIndex": 17,
      "PostDate": "23/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755589",
      "Title": "EGAL - More cards needed please!!! Traci-----TripNeg GracePang"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Nov 7, 2009 09:16PM GracePang wrote: I am having a flu right now and got it from my son. Just got home from er and asked them to do  test. Will get the results in a few days. I asked my nurse about the flu shot last week, but no answer. Right now, I am on Herceptin and waiting for the delayed chemo that may be given next week.",
      "MessageIndex": 61,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742599",
      "Title": "H1N1 Poll--ALL STAGES WELCOME! badboob67 wildgardener"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Jul 21, 2010 11:13AM GracePang wrote: Excellent news! congratulations!",
      "MessageIndex": 9,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755641",
      "Title": "I am finished with chemo! lorrhaw Irina"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "GracePang wrote: 45 years old now. I had breast cancer (right side) 5 years ago, ER-, Her2+. Did mastectomy, chemo, and radiation. Recently, CT scan showed that it metasized to liver and right lung. Would like to know if surgery still necessary? What chemo drugs other patients take in the similar case. Thank you in advance for your advice. ER-/PR-; Her2+++, Stage III breast cancer 5 years ago. Had AC+T and then 1 year of Herceptin. Mets on Liver and Lungs now. Innumerable nodules. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740804",
      "Title": "Is Surgery still necessary? GracePang konakat"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Aug 1, 2010 12:56PM GracePang wrote: Hi Joyce4123, I also have liver, lung and brain mets and is taking WBR now. While I am on WBR, my doctor stopped chemo (Taxotere),but keep my on Herceptin (I am Her2 positive as well). After I finish WBR next Friday, he will give me 2 weeks break before to start chemo. He suggests that I shall keep Herceptin and Taxotere for a while; but I am also debating now if I shall change another drug.I read on this board that WBR will weaken the BBB and be effective for brain met for a while. Others may know better about this and I would also like to hear from others about keeping Herceptin for brain met. Grace",
      "MessageIndex": 1,
      "PostDate": "01/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756137",
      "Title": "brain mets and herceptin Joyce4123 Lowrider54"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Sep 23, 2009 02:35PM GracePang wrote: Dear Elizabeth, Thank you for your information and encouragements. I just got back from seeing my Onchologist. They found innumerous pulmonary nodules in my lungs and liver. His plan is to use Taxotere+Cyclophosphamide+Herceptin. I know this is quite an agressive combination and wonder if it is necessar to add C in there. What is Gemzar? Is it a new drug? They didn't mention it to me. Grace",
      "MessageIndex": 2,
      "PostDate": "23/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740804",
      "Title": "Is Surgery still necessary? GracePang konakat"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "GracePang wrote: My port is placed on my left chest and the line goes into my neck over my collarbone. Along with the line, which is visible on my skinny chest, there is a red/itchy line (about 1 inch long) along the line over my collarbone. It turns redder recently and the nurse who drew blood from my port got alarmed and sent me to my onc right away this past Friday. My onc had a look and said we should keep eyes on it, but do nothing now. I have no fever and other symptoms of infection, but I am afraid that it might be too late if I develop such symptoms. Does anybody have had such experience and do you know if this is a port infection, or just skin irritation? I read some thread about port infection on this board and got very scared. Shall I ask my onc to remove the port? Any advice would be appreciated. ER-/PR-; Her2+++, Stage III breast cancer 5 years ago. Had AC+T and then 1 year of Herceptin. Mets on Liver and Lungs now. Innumerable nodules. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/749056",
      "Title": "Port Infection or not? GracePang LinTol"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Dec 5, 2009 07:59PM GracePang wrote: Hi Amy, lots of hugs, Grace",
      "MessageIndex": 3,
      "PostDate": "05/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/744971",
      "Title": "stage 4 peritineal metastisis help Amy1971 dreamwriter"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Oct 28, 2009 06:12PM GracePang wrote: I got a port installed 5 days ago (last Friday) and it was really painful for the first two days and I started coughing a bit. It got better starting the 3rd day, but still have sourness up to today. The nurse drew blood from it yesterday successfully and she said it worked well. However, when I saw my onc today, he suggested me to have X-ray and ultrasound of the area to make sure it works. I understand about the X-ray, because I picked up some coughs after the surgery. Do anyone know why ultrasound is needed after successful blood draw? The lady doing ultrsound on my today digged alot in the sour area and really hurted me. It took her a full hour to have the ultrasound done. Is this normal? I felt more pain after her pokes and now I have to put icepack on it and take some advil to reduce the pain.",
      "MessageIndex": 55,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/694114",
      "Title": "Port-a Cath pain? TinaLee Kicks"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Jan 16, 2011 05:50PM GracePang wrote: Hi Elizabeth, Sorry to hear about the brain doubts, but we know it can be dealed with successfully. I just had my Gamma Knife done last Thursday and it went smoothly. I have not checked in only a few days and here I read your thread with over 100 responses. See how hot you are-:). You will be fine and I know it, no matter what treatment your doctor will prescribe you. Enjoy your vacation and have fun! Grace",
      "MessageIndex": 116,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763333",
      "Title": "Just when I thought things were getting better... konakat Marple"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Feb 28, 2010 01:48PM GracePang wrote: Hi Jeanne and Nancy, Thank you both very much for sharing your experiences. It helps me a lot. It is good to know that you don't have to remove the port for this. It is interesting that they also told me that it is uncommon to get the red line, which worried me. I feel much better now. Grace",
      "MessageIndex": 3,
      "PostDate": "28/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/749056",
      "Title": "Port Infection or not? GracePang LinTol"
    },
    {
      "AuthorID": "GracePang",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89776/profile",
      "Content": "Mar 1, 2011 09:32AM GracePang wrote: Hi Elizabeth, Just stop by and say Hi. I am thinking of every time I come to this site, even though I have not stopped by all the time. Hugs to you. Grace",
      "MessageIndex": 646,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763333",
      "Title": "Just when I thought things were getting better... konakat Marple"
    }
  ]
}