{
  "AuthorID": "GraceyMae",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153047/profile",
  "Posts": [{
    "AuthorID": "GraceyMae",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153047/profile",
    "Content": "Jan 9, 2013 02:31PM GraceyMae wrote: There is always hope. At age 38, my sister was dx with stage iv breast cancer sept 2007 with Mets to bones (severe in lower hip and spine), liver, lungs. The only place it wasn't found was in the brain. She spent a month in the hospital receiving stabilizing treatment including rad to spine. In short, she was a mess. She came home and went through chemo. We were worried she wouldn't make it to the end of the year 2007 as she was desperately ill. Eventually, all cancer leisions disappeared and the bone in her hip and spine recovered. MY SISTER IS STLL ALIVE AND DOING WELL JAN 2013. Reading your mom's story reminds me of the hopelessness and fear I felt for my sister in the early years. Through my sisters journey I have learned you have to take one day at a time, enjoy the positive in each day and try not to dwell on \"what if\". Hard to do at times when there is a set back, but good results do happen, even when the situation looks hopeless. She has had set backs along the way -brain mets July 2009 tx rad and gamma knife, and brain mets again June 2012 with gamma knife again. Each time she has had a positive outcome with treatment. In 2009 I privately pressed her doctor to tell me how long my sister would survive. The doctor told me \"I don't expect her to be alive this time next year.\" Even when the experts lose hope, there is still hope. My sister is a fighter, she is a woman of strong faith. She asks for prayer with each set back and then presses on. Just remember, even \"bad\" cases can and do have positive outcomes.",
    "MessageIndex": 7,
    "PostDate": "09/01/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798593",
    "Title": "Mom stage IV, Gemzar didn't work, please give hope!! gapeach524 ibcmets"
  }]
}