{
  "AuthorID": "GraceB1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
  "Posts": [
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Apr 3, 2015 08:36AM GraceB1 wrote: This calculator was made in 1982 and does not take into effect any of the newer treatments. Please don't get upset by it.",
      "MessageIndex": 4,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/830120",
      "Title": "Nottingham Prognosis Index tangandchris Claire_in_Seattle"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Sep 5, 2013 08:54PM GraceB1 wrote: Thanks for posting Weesa. I'm in the middle of chemo, still looking for the light at the end of the tunnel. Nice to know that someone is there holding a lamp for me to see.",
      "MessageIndex": 66,
      "PostDate": "05/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/794824",
      "Title": "Postcard from the edge of ten years out.... weesa lifelover"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jun 28, 2015 07:58AM GraceB1 wrote: I have some fibrosis from rads and as I understand it this will make me more suspectable to infections in that lung the rest of my life. The lung doesn't expand as freely as the other one which means mucus can accumulate easier. Just something for me to be aware of.",
      "MessageIndex": 3,
      "PostDate": "28/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/832938",
      "Title": "Lung damage nearly 3 years after radiation finished? Lily55 Martini"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Feb 24, 2014 06:26PM GraceB1 wrote: Inflammatory BC doesn't have a tumor, it's just diffused over the whole breast. The skin is probably red because it is involved too. Good luck with the treatments. ",
      "MessageIndex": 307,
      "PostDate": "24/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Aug 9, 2014 06:51AM GraceB1 wrote: The one that always bites me in the a$$ is You're all done with treatment now - right? Nope. Herceptin till Feb and hormonal treatment probably until I die from something else. Not to mention PT for my shoulder and reconstruction surgery next spring. Grrrr. On a brighter note I had my first haircut yesterday since shaving it all off 13 months ago. Herceptin really slowed down my hair growth but now it's almost looking like I cut it this way on purpose. Hadn't realized how gray it had gotten as I always kept it colored.  One step closer to the new normal.",
      "MessageIndex": 494,
      "PostDate": "09/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Feb 25, 2014 06:31AM GraceB1 wrote: I started with chemo and then had a MX in Jan. Chemo reduced the tumor by a third but I had a slow growing type and they don't respond as well. I'll start rads as soon as the ROs office calls me back to set up the appointments. I had the initial meeting and the CT scan to set up the zap plan last week.  I hate waiting around for calls from a Drs office. Just want to get started so I can get finished. I started Herceptin 2 weeks ago and will do the AIs after rads are done. We're throwing everything we can at it. Hope your mom is handling it OK.",
      "MessageIndex": 318,
      "PostDate": "25/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 14, 2013 02:15PM GraceB1 wrote: I'm a stage IIIa who thought I was a IIb until I had a pet scan a week ago. Had my first chemo Friday and am surviving with some nausea, feeling tired and a little muddle headed. Ready for the fight of my life! Bring it on! Just leave the SE behind please.",
      "MessageIndex": 52,
      "PostDate": "14/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Feb 7, 2016 08:02AM GraceB1 wrote: Axrescue - you are reading posts from survivors having continuing problems because this is a safe place for them. The BC survivors (a whole lot of people) that aren't having continuing problems are too busy with their lives to post here or have moved on. Many women do have continuing problems but most of them are manageable and much better the alternative. The fear slowly lessens and the Drs visits finally space out more. I have permanent neuropathy but it hasn't stopped me from quilting, seeing two grandsons born and my youngest DD get married. Life is going on. Have courage, cry and fight as best you can.",
      "MessageIndex": 1110,
      "PostDate": "07/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Dec 27, 2014 07:55AM GraceB1 wrote: My IIIA BC was not considered early stage by my surgeon when I inquired about the shorter, heavier dose radiation treatments. She said that was only for early stage and to put it out of my head. I'm confused too. I only consider stage IV as late stage.",
      "MessageIndex": 7,
      "PostDate": "27/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/827192",
      "Title": "So wait....is stage 3 considered early or late stage cancer? tangandchris shelly56"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jun 28, 2015 08:22AM GraceB1 wrote: I pucked for hours after every surgery until this last one. They tried almost every thing on me, patches, meds etc. This last time they used emend during surgery and no nausea until I started taking pain pills. Got off them pretty rapidly. Maybe I should have asked for more emend.",
      "MessageIndex": 14,
      "PostDate": "28/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/832611",
      "Title": "Pain Meds make me vomit! What do I do? MizMimi JanS1234567890"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Feb 8, 2016 10:05AM GraceB1 wrote: They're advising radiation because of the positive lymph nodes. Are you HR2+ and hormone positive or negative? These can play a role on wether your get chemo or move straight to AIs or herceptin. You will need to have more discussions with your MO.",
      "MessageIndex": 1,
      "PostDate": "08/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/841126",
      "Title": "78 year old with right breast mastectomy 4 lymph nodes Optimistic1 GraceB1"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Feb 11, 2014 06:52AM GraceB1 wrote: I'm joining this group too. I have my initial meeting with the the RO on Thurs. I just found out today that I'm HER+ and will start Herceptin on Wed. My MO reran the testing with the breast tissue and the test results are different from the biopsy tissue. I really wish now that I hadn't had my port taken out when they did the MX. I have lousy veins and wonder if I can get the port put back in or if I just need to suck it up for the next year?",
      "MessageIndex": 938,
      "PostDate": "11/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Sep 12, 2016 08:17AM GraceB1 wrote: Strongly ER positive BC does NOT usually fully respond to chemo. Wish I'd been told that before surgery so I wasn't so surprised when I still had a lot of tumor left. My tumor flattened out but was still 5 cm wide. It did clear up some lymph nodes. That is why taking the hormones is so important if you can tolerate them.",
      "MessageIndex": 3,
      "PostDate": "12/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Sep 23, 2015 10:11PM GraceB1 wrote: I'm so glad to see this topic. I just got notified that I have ostepenia. I had a DEXA scan two weeks ago dispite my insurance refusing to pay for it because I had one last year for baseline. Last year it was borderline low. I made an appointment to talk this over with my MO. I'm already doing what I can to reduce bone loss but can't do much exercising until after my second hip replacement next month (arthritis). I'm glad to know about side effects and will take that into account when I schedule the infusion.",
      "MessageIndex": 14,
      "PostDate": "23/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/832154",
      "Title": "Bisphosphonates or not? NancyD TectonicShift"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Sep 30, 2014 12:12AM GraceB1 wrote: I got my pre-authorization letter in the mail today. Somehow that made it officially real and my stomach did a big, not so good, flip. One step and then another.",
      "MessageIndex": 4,
      "PostDate": "30/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824882",
      "Title": "Wow - I've lived long enough to need a hip replacement! sugarplum sugarplum"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Feb 19, 2014 02:40AM GraceB1 wrote: I had a umx with a TE. It looked like a form that everyone has to fill out and a graph to make showing weight loss or gain.  He asked about food aversions, smell aversions, nausea, diet and a bunch of stuff about how long have you been losing weight, are you happy with your weight and more. I just wasn't sure if there was a radiology reason for all the questions or just his interest. I lost 30 pounds and then gained 19 pounds in water weight and now now have lost that plus a little more. Really not sure how to fill out most of the form. I'm just getting my taste buds back but still have no appetite to speak of. I think my stomach has really shrunk and I don't want to gain back the weight I lost so I'm not forcing myself to eat more than 1400 calories a day.",
      "MessageIndex": 1068,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 28, 2014 03:44PM GraceB1 wrote: I had a primary neuro-endrocine breast cancer. Yes they are very rare (less than one tenth of 1% of breast cancers) and doctors don't know what the best way to treat is because there are too few diagnosed to do a case study with. They end up treating you like they would a regular breast cancer. The good news is that they are usually not very aggressive cancers and are slow to spread. Menopause the second time around is the pits. Good luck and let me know if you have any more questions I can help you with. ",
      "MessageIndex": 2,
      "PostDate": "28/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/823174",
      "Title": "Have Rare Cancer, need help zjrosenthal zjrosenthal"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Aug 19, 2018 08:52AM GraceB1 wrote: I was negative at biopsy and then borderline with the FISH. 6.0 is the cutoff and I was 6.1. After a discussion we went ahead with the herception. I had insurance and was in relatively good health. I also had a really rare type of cancer and wanted to throw everything at it as there are no standardized treatment protocols.",
      "MessageIndex": 8,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/866688",
      "Title": "HER2 test was Equivocal Sadlynew2018 GraceB1"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Sep 27, 2013 04:29PM GraceB1 wrote: They do the surgery even if you have no evidence of cancer after the chemo. They want to make sure that they have all the little cells of cancer that may be present, even those that don't show up on PET scans or MRIs or on a particular slide from the removed tissue. I asked my MO about this because I hoped to avoid surgery and he said that wasn't going to happen. A great response to the chemo is terrific, just what you want. Don't fret too much over staging. You should have had a preliminary stage before chemo started. Your stage has to change a bunch before the treatment changes.",
      "MessageIndex": 3,
      "PostDate": "27/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/811676",
      "Title": "Chemo Dilemma Charnyaramanh GraceB1"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 25, 2013 08:06AM GraceB1 wrote: Thenk you aaoaao! I have really poor viens for sticking and was afraid the port wouldn't work. I HATE when they stick me and then poke around for the vein they know they can see and then go through it. Then I get a new huge bruise and they have to start over somewhere else (an average of three times before sucess). My blood count was pretty low (.9 and abs .3)and I was told to either wear a mask or stay out of the public for a while and wash, wash, wash my hands. I live 3 1/2 hours away from the cancer center so I'm hoping to get tested again down here before I travel all that way only to find out that I'm still too low and need to postpone treatment.  I didn't think that I was losing much hair yet until I looked at the shower drain a saw a whole clump getting washed down. Sob, it just make so much more real. I did get out the other day with a girlfriend and bought a wig. We had a nice girls day out.  Still getting some nausea after I eat or drink but much better than before. Someone told me that after chemo with the red devil she couldn't even look at red tail lights without getting sick.  I know I'm never going to be able to drink cranberry juice again. :-(",
      "MessageIndex": 575,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 30, 2013 08:14AM GraceB1 wrote: RealityCheck- Your Onc can write a script for you for a cranial prosthesis (i.e. wig) and your insurance should cover it. I'm getting my second dose on Fri. - hoping my blood counts are high enough -  and have lost about half my hair. I have a wig ready but am not ready to start wearing it yet. I need to get some sleep caps as I find my head getting cold in the middle of the night.",
      "MessageIndex": 703,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 31, 2013 04:00PM GraceB1 wrote: Mellie289 -  I still have nausea 19 days out. Not looking forward to the 3 1/2 hour car ride up to chemo much less another infusion on Fri. I'm going to take zofran before I get in the car and another before I come home. And I'm going to take the meds regularily and work a lot harder at staying hydrated hoping that I'll feel better this next time. The only rash I got was from the tape around my port.  What supplements are you taking to prevent neuropathy? I had some after a back surgery and really don't want to do that again.",
      "MessageIndex": 745,
      "PostDate": "31/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Oct 23, 2013 07:50AM GraceB1 wrote: Can anyone tell me how long I need to wait after chemo to get my eyes rechecked? I'm really tired of this blurry vision but don't wan't to jump the gun either.",
      "MessageIndex": 1606,
      "PostDate": "23/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Dec 11, 2013 03:35PM GraceB1 wrote: Congrats Jerigrace on reaching the finish line! I just got done with the poison and still have to do the cut and burn. Yuck. OK, my husband was asking me last night how long it will take for my hair to start growing back in. I think he is as tired of the bald look as I am. Any idea or is it all very individual? That runny nose thing happens to me all the time. I have gone through many Kleenex boxes and don't leave home without some in my pocket. It's like the fountain got turned on.",
      "MessageIndex": 1809,
      "PostDate": "11/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 10, 2013 03:45PM GraceB1 wrote: My hairdresser was very helpfull today. The nearest wig shop is almost an hour away but she says they are good at fitting and then she can style it. And no Soriya123, I don't think you're being too picky. We just want what we want.  I spent a bunch at the grocery store today trying to stock up for the next week. Never bought so many health care items at one time before.  I woke up Tues morning with hives all over my body - too much stress I guess. I've never had them before. I was thinking that the antihistamines in Claritin might help calm them down as long as it's alright to take them right before chemo? Sounds like I can. I'm dreading Fri. but also wish it were here already. This waiting is for the birds.  Pulling up my big girl panties and getting ready to battle. Time to pack my bag of goodies to take with me.",
      "MessageIndex": 212,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 19, 2013 03:28PM GraceB1 wrote: I'm a week out from my port placement and first chemo. The port was sore for the first four days and then I realized it was the bandaging doing a lot of the pulling. I took them off and found out I had an allergic reaction to the tape and was breaking out in blisters. I put some cortisone cream on the patches and that helped immensely. I was pretty fatigued the first three days with a sore throat and chills one day but am getting around a lot better now. The nausea is still hanging in there. I was started on compazine and that just didn't cut it. When I switched to zofran it was a lot better but I still get nauseated after I eat or drink. It's getting better day by day.  I have a weak stomach in the best of times. I go Mon. for my first blood test. I just found out that I'm scheduled for a meeting with the PS after my next chemo. I haven't even decided whether I'm having a lumpectomy, mx or dmx. How did you decide what to do? My CS says its up to me. I thought I'd have more time and maybe this is just a meeting to lay out the options. Help!",
      "MessageIndex": 418,
      "PostDate": "19/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 31, 2013 11:01PM GraceB1 wrote: Mellie289 -  Dosetaxel is what I'll be switching to in Oct. I'm glad it's the lesser of the two evils.  Vilia - I started taking Prilosac for the indegestion and it's really helped. ",
      "MessageIndex": 750,
      "PostDate": "31/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Aug 12, 2013 06:40AM GraceB1 wrote: I'm day 10 after my second infusion and woke up very dizzzy. Almost fainted twice. Anybody else have this? I'm well hydrated but wondering if I'm anaemic.  I'm going to get my blood test done in a little bit and then call my onco. And no, I'm not driving today.",
      "MessageIndex": 976,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Aug 13, 2013 06:47AM GraceB1 wrote: I spent all day yesterday with a revolving room. Any time I moved the room spun all around me again. Ended up geting sick a couple of times. My blood pressure is OK but I am neutropenic again. The docs think that I cought a bug going around locally. Its a viral labyrinthitis, disrupts the working of the inner ear making me have vertigo. They say is lasts for about 4 - 5 days. I'm hoping between the anti-nausea drugs and anti-vert I'll be able to keep something down today. I don't want to have to get a IV. Off to see another Dr. now.",
      "MessageIndex": 993,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Aug 24, 2013 09:47PM GraceB1 wrote: Had my third treatment yesterday and can say this was the easiest so far. I finally got rid of the vertigo on Wed. by doing a simple exercise to move the bones in my inner ear back the the right position. My port still won't draw blood back so got stuck again but at least they got it on the first try this time. Ended up getting a port study done before they would administer the chemo and they said everything looks OK. They have no idea why it's not working right. Not nearly as much nausea this time but still have the fatigue and blurry eyes. The onc said my tumor has shrunk in half and he is very pleased. I asked him about having a double or single mx and said he thought a double was too agressive at this point. The PS I saw last month said he would put a tissue expander in at the time of surgery but wouldn't do the deip flap reconstruction for a year because I'm having rads. At that time he can fix the damage the rads have done while doing the recon. He will also do a lift on the other breast to make them symetrical. I was really hoping it would get done all at once but I understand his reasoning. Onward and upwards. One more a/c and then on to taxotere.",
      "MessageIndex": 1188,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Aug 27, 2013 02:56PM GraceB1 wrote: I forgot to ask my onc last week but I'm assuming no flu shot shot this year? Anybody know for sure?",
      "MessageIndex": 1232,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Sep 18, 2013 12:02PM GraceB1 wrote: I'm done with the A/C part of treatment now and can't wait for it all to be over. Starting Taxotere in two weeks and hoping for less SEs (or at least different ones). Has anybody had luck using the Brian Joseph's eyebrow and lash lotion? I used it faithfully to no avail. All I have left are a few upper eye lid lashes. I wonder if it's as individual as our reactions to the chemo.",
      "MessageIndex": 1417,
      "PostDate": "18/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 22, 2013 05:22PM GraceB1 wrote: I went to have a blood test done today and they couldn't use my port :-( While they could put saline in, they couldn't get any blood to come back to the syringe. Any idea if this will affect my next infusion? So I ended up getting stuck four times today which just sucks and getting bruises on two of them. It just seems like this can't be easy for me.",
      "MessageIndex": 510,
      "PostDate": "22/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 28, 2013 09:10AM GraceB1 wrote: I haven't seen it mentioned here lately but I chewed popsicles and ice chips all the way through the adriamycin push. I haven't had any mouth sores at all, just a sore throat for two days. I really thinked it helped a lot. I'm still fighting some nausea and heartburn but started on prilozac yesterday hoping that will help. I know I didn't drink enough the first week and am going to work harder on that the next time (Fri.) My hair is really starting to shed but I'm going to wait until I can't stand it anymore to get it shaved. I know I'm not going to look good bald. Might scare the dog.",
      "MessageIndex": 647,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Aug 1, 2013 04:37PM GraceB1 wrote: The day before I started chemo my youngest daughter had a kdiney stone, now passed. Today my son is having a kidney stone removed and I have chemo tomorrow. When it rains, it pours.  My other daughter is running scared.",
      "MessageIndex": 772,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Aug 14, 2013 02:17PM GraceB1 wrote: I'm feeling better today. The Antivert has made me very sleepy but that's OK. I still get vertigo when I lay down, get up or roll over but at least I can sit  and walk now. Hoping to get something accomplished before the next treatment in 8 days.  I can't imagnine working through all this - you ladies must be a lot stronger than I am.",
      "MessageIndex": 1022,
      "PostDate": "14/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Oct 12, 2013 07:37PM GraceB1 wrote: I haven't checked in for a while because I've been stuck in the hospital since Monday. My first taxotere hit me so hard. First it was nonstop diareaha and then the vomiting started. Everything is just going straight through me. The Dr. says my WBC is finally starting to edge up but I still may need a transfusion. I'm looking at another two days at least before they let me out. I'm also having bone pain and numbing in my fingers. I'm so discouraged. I don't know how I can handle another 3 treatments.",
      "MessageIndex": 1532,
      "PostDate": "12/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Oct 18, 2013 11:51AM GraceB1 wrote: No, I'm not diabetic but even ice cream doesn't taste good right now. I'm living on chicken soup and will never want to eat it again when this is over. I just want to get one rant off of my chest and then it'll be gone forever. I have bad veins. That's why I got a port. Unfortunately it doesn't work to draw blood from but takes the chemo and IVs with no problems thank goodness. After 8 days in the hospital (and pretty dehydrated) and twice a day blood draws the lab techs were fighting over who had to get me. I \"intimidated\" them. I told them they could try any where they wanted but the back of my hands because it hurts too much and the sticks never work anyway. It took an average of two sticks per success and half of them left a huge bruise. I never said a bad word to them. Half the time I was barely awake (5:45am). Maybe next time I'll show them how intimidating I really can be. Just do your job right. My mom was a med tech and I swear I can find a vein faster then these community college graduates who do it for a living. One wouldn't even stay in the room while the second one tried. Yeesh! OK - over and out.",
      "MessageIndex": 1585,
      "PostDate": "18/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Oct 17, 2013 02:43PM GraceB1 wrote: I ended up staying in the hospital 8 days. And then yesterday was a 7.5 hour round trip to see my MO. Loooong day. I was completely neutropenic. White count in the double digits. After days of IVs, neutrogen shots, zofran, phengren, anitbiotics and anything anyone could think of to get me to stop pooping or puking, I started feeling better when my white count starting getting better. My MO said we'll be more proactive before my next treatment and reduce the amount of taxotere by 20%. I'll be getting a neulasta shot the day after the treatment and take the zofram and imodium starting the day before. I really hope that helps or they'll have to put me in a straight jacket to get to take any more treatments. I've never been so sick in my life. I thought my taste buds were bad with the A/C but now they're totally gone. I wish I could find just one thing that tastes good to me. Any ideas?",
      "MessageIndex": 1575,
      "PostDate": "17/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Feb 23, 2018 08:36AM GraceB1 wrote: There are plenty of stage 3 survivors out there. I'm at 4 1/2 years and doing well. For me the first 6 months (chemo, surgery, radiation) were really tough and then life settled down again. Not ever back to the same as before but do-able. Chemo affects everyone differently. One doctor said it's on a bell curve. Hopefully you'll be on the low end of side effects. Just take it one day at a time.",
      "MessageIndex": 30,
      "PostDate": "23/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862350",
      "Title": "Despair and kids Magnolia-mom bluepearl"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 26, 2016 07:52AM GraceB1 wrote: I always recommend that you see a Medical Oncologist (MO) before you have surgery done. Get to know all your options. Surgeons almost always thinks surgery first but there might be better options for your mother. There aren't any cut and dried answers here and that was one of the hardest things for me to accept. Treatment is still very much an art and many choices are left up to the patient. Best wishes to you.",
      "MessageIndex": 1,
      "PostDate": "26/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/846329",
      "Title": "confused about diagnosis and next step markone msphil"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 9, 2013 11:40PM GraceB1 wrote: I'm a member of this group too. I found out on Monday that I will have chemo (AC/T) before surgery and then rads. I had a pet/cat scan today and it changed my diagnosis from IIb to IIIa. A little larger and 3 nodes that they weren't expecting. Fri July 12 I get my port in the morning (really small veins, it usually takes three or four tries to get a vein) and chemo starts at 2:00.  Need to figure the wig thing out soon. Don't think I want strangers staring at me at the grocery store. I have a hair apt. in the morning and will ask what options there are locally. I know I will get through this but still have crying episodes a couple of times a day - mostly feeling sorry for myself. I hate the thought of being unwell and unable to do what I want to do when I want to do it. I am a fighter and will come out the other side OK. Fighting cancer just wasn't on my bucket list and now it's my number one priority. Enough pity and on to the battle! I'm glad I found this group and a place to give and get support.",
      "MessageIndex": 196,
      "PostDate": "09/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Aug 27, 2013 02:19AM GraceB1 wrote: Cutiekool- chemo dries out your mouth, you can use biotine mouth rinse to get some relief. Grapes also seem to refresh my mouth.  I think a lot of us experience the heartburn. I'm taking prilosec daily and it has helped tremendously. Havn't had trouble with the feet yet but nausea is an ongoing problem. Zofran can really help but then I end up sleeping most of the day.  I can usually taper of off it by day 4 or 5. My second treatment was worse than the first but my third is easier than the other two. Who knows why but I'll take it and hope for the next round to be easier too. Everyone reacts differently. Just take care of yourself.",
      "MessageIndex": 1226,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Dec 5, 2013 01:57PM GraceB1 wrote: Warning - big rant. I'm facing my last taxotere infusion tomorrow and I cannot express how much I am dreading it. I've been hospitalized twice in the last 9 weeks. I've counted up over two dozen different side effects that I am suffering from including neuropathy, nausea, nail loss, skin pealing, fatigue, anemia, constipation/diareaha, blurry eyes, skin so dry it's cracking, and on and on. It's been three weeks since the last infusion and I can barely make it up the stairs at night to go to bed. How am I going to be in any shape for my mx on Jan 8th? My family is all excited about it being my last treatment but all I can do is cry. So tired of feeling sick. I know I have to finish but can't somebody just put me in a coma for 4 weeks and let it all be over? Just showing up tomorrow will be the hardest thing I've ever done. And then the afternoon is filled with pre-op appointments. Double whammy of dealing with bc. OK, rant over. Hopefully I can get through tomorrow without crying all over the place. Wish me luck.",
      "MessageIndex": 1783,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Dec 17, 2013 05:12PM GraceB1 wrote: My PS will be placing a TE during the SMX but will not do any other reconstruction until a year after rads are done. Filling the TE ends as soon as radiation starts (about a 3-4 week window). He says the radiated tissues keeps changing and while you can find PSs who will do it before then the results are better if you wait. Radiation really damages the skin and plays havoc with TEs.",
      "MessageIndex": 1836,
      "PostDate": "17/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jan 23, 2015 09:57AM GraceB1 wrote: It is a really hard decision. There are options out there for reconstruction with a lumpectomy like fat grafting. You need more information from your doctors about expected results. Sometimes it depends on the type of bc you have. Is the other breast perfectly healthy? Do you have dense breasts where it's hard to diagnose new lumps? How physically active are you? I wanted one arm that I could so my gardening without worrying about lymphedema. My MO said I was still more likely to have a recurrence in the bc breast than in the unaffected breast. If you mentally need matched breasts it's easier to get that with a double mx. I just wanted to look normal with clothes on. I have enough side effects from the mx (shoulder hurts every day even after physical therapy) that I wish I had done the lump but my tumor was bigger than anticipated so maybe I'm better off with the mx. I try not to obsess over it. It's done and I made my best choice with what I knew at the time. A lot of life is like that. I'm not sure I helped but but I did give you some things to think over.",
      "MessageIndex": 2,
      "PostDate": "23/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/827817",
      "Title": "So afraid of my choices... Stacee GraceB1"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Feb 19, 2014 12:31AM GraceB1 wrote: Is your RO concerned about your weight? The forms I got to fill out before my first visit tomorrow included two pages on my weight and diet. My MO isn't that concerned even though I've lost 40 pounds due to chemo. Still trying to lose another 10 pounds.",
      "MessageIndex": 1065,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jan 6, 2014 11:33AM GraceB1 wrote: I'm 4 weeks post chemo and wondering when I'll feel better myself. After suffering with blurry vision for months I was diagnosed with an eye infection. You can have more than one reason for symptoms. I also had vertigo that was cured by a maneuver that we all thought was caused by a virus. Now I'm concerned about the edema in my feet, legs and hands. I had a little during chemo but now it's painful to walk. Lasix is not helping at all. I guess I'll just have to wait it out but gaining 15 pounds in a week puts a hurt on the body. I just wish chemo SEs had an expiration date. I've lost half of my nails and the others will follow soon. Getting ready for my SMX on Wed. and wonder if I'm ready for it. We have a new massage therapist in town and hope to visit her soon. She's almost done with her training for lymphatic massage. Sounds good to me. My taste buds have started coming back but still no appetite. My husband thinks I'm anorexic. Just can't eat more than a little bit. ",
      "MessageIndex": 13,
      "PostDate": "06/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/816248",
      "Title": "5 weeks post chemo and still feeling bad Gubbyann GraceB1"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 8, 2016 08:48AM GraceB1 wrote: i was 100% ER+, 12% PR+, Now 2.5 years out and NED",
      "MessageIndex": 35,
      "PostDate": "08/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/834067",
      "Title": "What percentage ER+ and how many years NED? TectonicShift GraceB1"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Dec 9, 2018 08:47AM GraceB1 wrote: 99%ER+ 14% PR+ 5 years NED and taking Femara",
      "MessageIndex": 91,
      "PostDate": "09/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/834067",
      "Title": "What percentage ER+ and how many years NED? TectonicShift GraceB1"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jan 22, 2017 08:56AM GraceB1 wrote: Herceptin and perjeta are big guns. They are game changers. Why would you not do it unless you have heart problems? Almost all women have very manageable side effects. It looks like they didn't get all the tumor (see progesterone report). I can't speak to the grades.",
      "MessageIndex": 1,
      "PostDate": "22/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/852045",
      "Title": "Second time around! Help me with this path report please danix5 danix5"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jan 23, 2017 09:17AM GraceB1 wrote: It doesn't look like you're borderline with a 3+ score. The score goes from 0 to 3. I was negative on my first biopsy and only 1+ on the biopsy after the MX but I wanted to throw everything I could at it. I was also ER- on the first biopsy and 99% positive on the second. I don't think the first biopsy had good sample of the tumor. You could always ask for a FISH test to be done if you're unsure. On the FISH test 6 is the cut off for positive and negative scores. I was 6.2 and don't regret one minute of doing herceptin.",
      "MessageIndex": 8,
      "PostDate": "23/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/852045",
      "Title": "Second time around! Help me with this path report please danix5 danix5"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Nov 4, 2013 05:09PM GraceB1 wrote: I thought that I'd introduce myself. I found a 6x5cm in June. I'd been doing self exams but was looking for a small knot not a shallow thickening across a wide area. I knew when I found it that it was cancer even thought it took the doctors a month to catch up with me. They missed it with a needle biopsy and had to do surgery before we got proof. I could feel it growing by the day. Testing showed 3 nodes involved on pet scan but the all the other tests came back clear :-) I'm in the middle of neoadjuvant chemo right now. We wanted to kill any stray cancer cells right away and not wait until after surgery. Had a lot of nausea and fatigue with the A/C but the tumor started shrinking right away. By the end of the fourth treatment I could just feel a few crinkles left behind. Now I'm really struggling with the taxotere. Ended up in the hospital for 8 days with dehydration and neutropenic fever after the first dose. I also have hand and foot syndrome and my hands and feet were painful and then went numb. Now they're peeling. I'm 10 days out from the second (smaller) dose and managed to stay at home this time but I sure feel lousy. I've lost 25 pounds so far and feel so weak. I keep trying to tell myself just to put one foot in front of the other and get through this but I'm so tired of feeling bad and not being able to do much but take pills and sleep. Can you tell that I'm having a bad day? On the brighter side (?) we scheduled the smx and te for Jan. My wonderful BS said that sometimes the tumor collapses in a ball and sometimes it flattens out like a sheet of paper. She thinks that this is what mine did and even though it's so much smaller she'd be removing a lot of tissue to be sure of clean margins. Then it will be on to radiation but reconstruction will have to wait a year according the PS. Time to get off of here and over to the hospital to get my blood work checked. First time I'll be out of the house since the last treatment. Wish me luck because I'm a really bad stick.",
      "MessageIndex": 472,
      "PostDate": "04/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Sep 6, 2013 09:05AM GraceB1 wrote: I recommend see an oncologist right away. He is the one that is overseeing all my treatments. We decided to do chemo first (which the BS was fine with) and that gave me time to prepare for the surgery, mentally and physically. It also gives you time to think about reconstruction and and have the PS on board during the MX. Yes, you want to take action right away but get a second opinion so you don't end up second guessing yourself later.",
      "MessageIndex": 3,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/810506",
      "Title": "Big Decisions To Make taguekids6 taguekids6"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Apr 23, 2014 09:09PM GraceB1 wrote: I had neoadjuvant chemo and had the port taken out during the MX. Big mistake. The initial biopsy showed I was HER2-. The path report from the MX showed I was HER2+. I've got bad veins and my last herceptin treatment took 3 sticks for a blood draw and 4 more sticks 2 days later for the IV. Really wondering if I should get it put back in, I still have 14 treatments to go.",
      "MessageIndex": 19,
      "PostDate": "23/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819806",
      "Title": "When / or Did you have your Port Removed after Chemo? laurie2025 Spookiesmom"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Sep 27, 2014 04:38PM GraceB1 wrote: I already had an appointment with a surgeon for a left hip replacement when I discovered my breast cancer. My first thought was not that the cancer was going to kill me, but that I would have to wait another year for the surgery. The only way I made it through the winter and spring was lots of steroids from chemo and limited movement because I was feeling so bad.  It's been 16 months and my hip replacement is scheduled for Oct 20th. Can't wait!! It will be great to be able to walk 10 feet without pain. I'm having an anterior approach done which should shorten the recovery time. I'm doing the pre-op exercises everyday which are really flaring the pain up but necessary to do. I have a lot of pain in my back and down to my knee. At first they weren't sure which joint was the trouble maker but we got that sorted out.  The right hip isn't too far behind and will probably need replacement in a few years. I plan on sticking around long enough to get my money's worth out of the operations.  Good luck on your replacement and let us know how it goes.",
      "MessageIndex": 2,
      "PostDate": "27/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824882",
      "Title": "Wow - I've lived long enough to need a hip replacement! sugarplum sugarplum"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Oct 9, 2017 01:45PM GraceB1 wrote: My first hip replacement is about an 80%. I think it is the hip flexor. It hurts to lift the leg but little pain otherwise. The second one went much better. One week after surgery the first hip hurt more than the recent surgery.The pain now is from the knee cap I cracked in half a year ago Jan. It still doesn't like stairs or standing too long. I'll take two hip replacements over a broken knee cap any day. I'm about ready to see the orthopod to see if it's arthritis or something we can work on to strengthen the leg or relax the muscles. Best of luck with your surgery. I wish I'd had mine years earlier.",
      "MessageIndex": 8,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824882",
      "Title": "Wow - I've lived long enough to need a hip replacement! sugarplum sugarplum"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 13, 2013 10:05AM GraceB1 wrote: Hi Ladies, Had my port put in yesterday morning and while it was uncomfortable it really wasn't too bad. When I complained even being under twilight sedation they put me in I got more lidocaine. Sore afterwards though. Started chemo that afternoon. Sucked on popsicles while the red devil was injected (to keep down mouth sores). In my mind I've changed the name to red army ants - marching through the veins to kill cancer. 1/2 hour of saline then the cytoxin. I was sleepy yesterday and very emotional, probably due to a lack of food until 1pm. Today I'm feeling pretty good but a bit jittery from the steriods. The port is feeling much better today. So glad I didn't get nausiated as we have a 3 1/2 hour drive home.  I feeling much more optimistic this morning. :-)",
      "MessageIndex": 278,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Oct 5, 2013 08:29AM GraceB1 wrote: Had my first taxotere treatment yesterday and all went smoothly but when I woke up this morning my face was red like a big blush. Anyone know if this is from the steroids for the taxotere? So nice not to be nauseated with this treatment.",
      "MessageIndex": 1494,
      "PostDate": "05/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "May 6, 2014 09:00AM GraceB1 wrote: Sounds mostly normal to me but we're all different. The curved bar pain is commonly referred to here as the iron bra. It is caused by the placement of the TE under the peck muscle. I can't speak to the fill going into the armpit but someone else may have had that experience and join in this discussion. Constipation is very normal even with preventive measures while on perks, as are emotional swings even if you're not on drugs. Your body and mind have both been assaulted and it takes quite a while to get back on an even keel. Some women are treated for PTSD. Hang in there, it will get better. Talk to your BS or PS and ask for advise. ",
      "MessageIndex": 1,
      "PostDate": "06/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/820837",
      "Title": "Single mastectomy on April 16 Madish sarahjane7374"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Oct 30, 2014 03:03PM GraceB1 wrote: I'm doing well, thanks. Pretty nauseated for the first week but getting better and also anemic. They debated giving me a blood transfusion but decided against it.  It's was still too low to get my herceptin on Tues. so I'll be getting a procrit shot (if we can get approval from the ins. company) and then herceptin next week. I'm up and walking almost 2 miles a day. It's not pain free but it's already better than it was before surgery. Sleeping is still a problem - can't find a comfortable position between my TE and the hip. This is nothing new but I hope it gets better. My post-op recheck is tomorrow. He'll let me drive again after that but I'll still have restrictions for a couple of months on bending over and twisting. I'm going to have to figure out how to put my socks on by myself when my daughter leaves on Sat. And yes, I'm also impatient. I wanted everything healed in two days. Hope we're all healing more every day.",
      "MessageIndex": 6,
      "PostDate": "30/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824882",
      "Title": "Wow - I've lived long enough to need a hip replacement! sugarplum sugarplum"
    },
    {
      "AuthorID": "GraceB1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181539/profile",
      "Content": "Jul 24, 2016 08:07AM GraceB1 wrote: The drainage system stays in until the daily fluid output volume reaches a low enough level to suit your doctor. Usually this is about 20 to 30 milliliters a day from each drain. Your surgeon will be able to tell you what he/she is comfortable with. If it removed too soon seromas can develop One of mine came out in two weeks but the other stayed in for three. Sorry I can't help you with the diet.",
      "MessageIndex": 1,
      "PostDate": "24/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846265",
      "Title": "After Mastectomy AaronBronte ravzari"
    }
  ]
}