{
  "AuthorID": "grammaB",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
  "Posts": [
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Aug 5, 2013 02:49PM - edited Aug 5, 2013 02:50PM by grammaB Hi MAPBB, I'll send healing thoughts your way on the 16th.  By then I should be home and hopefully up and around.  I live alone (in MT) my kids are in CA.  My daughter leaves on the 15th sadly the day after I get home. My son can't get here until the 26th, but that is just in time to get me to some post op appointments.   I worry a bit about the time I am all on my own (well except for my cat).  That is why I have prepared meals in the freezer for breakfasts and dinner.  As a diabetic, I eat a low carb/high fat ketogenic diet and so can't just open a can or frozen meal.  All food is cooked fresh.  I reorganized the kitchen putting all the daily dishes on the lower shelves and will set out pots and pans on the counter that I use regularly.  Maybe a little OCD, but I feel better knowing everything is taken care of. Oddly the surgery doesn't worry me, the drains did until I read enough here on this site that they really are more a nuisance than anything else.  I am not doing any recon so will have no further surgeries to worry about.  So all in all, I am pretty good.....well except for the expected nervousness around any surgical proceedure. I have a Jacki that a very nice lady here mailed me for right after surgery, I just might even wear it to the hospital! It is so soft and cuddly.  I also picked up 2 Amoena camis with pockets for the drains.  That is about all I've done for clothing other than searching out a couple of pairs of satin pj bottoms to make sliding out of my recliner (new!) or bed easier.  I know we'll all do fine.  It is human nature to have some fears but those will pass.  I just keep focused on coming home from the hospital with it all behind me!! Hugs",
      "MessageIndex": 47,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Aug 20, 2013 02:35PM grammaB wrote: Day 7 post op. Just got BRACA 1 & 2 results in the mail. Negative for both!! Phew!!  :))  Can't figure out how to get it to show in signature though. I drove myself into town to the Post Office to get my mail today.  It is about a 14 mile round trip all in town.  It went OK, still a bit of a problem looking to the left, but all in all OK.  I may have to drive myself to BS on Thursday so wanted a short trip to try it out.  BS is a 60-65 mile round trip on the hiway most of the way. Hope I don't have to but may be. Opps visiting nurse is here, more later.",
      "MessageIndex": 125,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Aug 23, 2013 03:42PM - edited Aug 23, 2013 03:45PM by grammaB Day 10 post surgery for me.  Doing really well, more so than I dreamed to expect!  No pain, was off narcotic pills the evening of Day 4 post and no longer need even aleve.  BS removed all the drains (4) yesterday. Yippee!!!  (I had gone a couple of days with barely any out put. Less than 25 ml for all 4 combined.)  What a relief that was!!  I felt so much more human and even lighter, though they didn't weigh much physically, to speak of.  She says I am doing really well. Final report on the 2 nodes removed was negative. :)  No final path on the breasts yet as it has been sent to the Mayo Clinic for a second opinion.  Hopefully it will be back by next Tues.  BS did say no cancer in prophylactic breast (L) don't know if that went to Mayo also. I am still wrapped though and probably will be until next Tuesday which will be Day 14 post.  I see bs again then.  She says it controls the fluid, helps stop bruising and keeps chance of infection down.  I have no bruising on my chest to speak of and it all looks good there.  A little tender under the arms where that darn little roll of fat comes over the top of the binder.  I even have my tank on under the binder now so my skin feels better than with the ace bandage right on top of it.  I think I am going to burn that ace!!! Don't remember if I mentioned this my BRCA 1&2 came back negative, no sign of mutation, on Monday!! That made my day! I don't remember if I mentioned this already either, but I have even driven, I think it was Monday this week, Day 6 post.  It was a short 14 mile round trip to the PO, but it was OK.  Tired after of course, but no real damage that I could see. I plan to do no reconstruction at all.  I am totally comfortable with being a flat sister!! :))  I'm 64 and boobs just don't mean that much to me....sheesh they were hanging down anyway who needs that?? ;) To those of you that got news that was'nt what you hoped for, I'll keep you in my prayers that things work out the absolute best for you. To those of you with surgeries next week, try not to stress too much....yeah right!! Do things that make you happy and are calming to you.  If it means a Xanax or two, so be it, whatever gets you through the waiting peacefully.  It won't be long and you too will be on this side of things and working on healing and getting on with your life.",
      "MessageIndex": 168,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Jul 29, 2013 12:37PM - edited Jul 29, 2013 12:38PM by grammaB myers421, Amy, That is exactly the approach I am taking.  My cancer is very small and early with the tiniest bit of invasion I am told.  My mom passed from bc my dad prostate cancer. His parents of pancreatic and stomach cancer.  All related to the BRACA gene.  My BRACA test has been sent in, but waiting for ins approval which may not come because of my age, 64.  That said once I got my dx, in 3 days I went from lumpectomy to MX to BMX and never looked back.  Have already gotten approval from ins for the BMX. I plan no recon. I am at peace with my decision, but the waiting for surgery, Aug 13 is making me crazy!! I hate waiting!! I have everything prepared and even meals in the freezer.  Can't think of much else to keep myself busy.  Moving furniture around today making room for my new recliner.... that will lead to house cleaning in general I guess..... Barbara",
      "MessageIndex": 30,
      "PostDate": "29/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Aug 15, 2013 09:56AM - edited Aug 15, 2013 09:59AM by grammaB Well, here I am on the other side!! Phew!  So glad to have the surgery behind me!!  My SNB came back negative for the initial test, BS say they will do another and to call Friday for that report.  She seemed well pleased with it all.  Surgery was 4.5 hours long.  I didn't think it would be that long but since I was out, guess it doesn't matter.  Surgery was the 13th, came home the 14th, can't take bandages off until the 16th! I can't wait for that shower.  BS even wrote across the bandage \"Don't take off until 9/16. :)\".  I will have a visiting nurse starting on that day so she can hopefully help me with my  first shower. I feel great!! The only place that bothers me is the puff of skin/fat that is buldging over the top of the bandages at my underarms.  I keep ice on them the rest is wrapped so tight I can hardly take a full deep breath.  I've been taking percocet every 4-5 hours but today I think I will start to cut them in half and see how that works. I made the mistake of taking 2 at night in the hospital in hopes I could sleep through all the beeping of the machines.  IV in left arm just below elbow (the first one, lower got clogged), Oxygen monitor on right hand (that was the side w/SNB so no bp cuffs there) they had to unwrap a leg every time to take bp, oxygen in nose and each leg had a compression stocking plus this wrap that would gradually inflate and then deflate to keep the blood moving.  So every part of my body was tethered to some machine!!  About an hour after taking the two percocet, I started hallucinating that the IV machine was talking to me!  Freaky!  And I really couldn't move at all to look at it.  I thought I had buzzed a nurse and they said they would come but no one did.  All the machines sort of became threatening but that IV machine kept saying words, like \"edward o\" and something else I can't remember now.  So I buzzed the nurse again, and again no one came.  I was freaking to say the least. I'd doze off and wake up in this weird fog.  Finally around 3 the nurse came in for vitals and I told her. She said no one had buzzed them so that was part of the hallucination.  Finally ended up taking some Benadryl and got maybe 2-3 hours sleep in a row.  So now for sure I will only take one at a time!!   Boy was I glad to sleep in my own bed last night!! Not a back sleeper either, but I will figure out some way to deal for now. I have 4 drains and two are hardly getting anything in them at all, under 10 ml. One gets a lot last night about 60 and the 4th about half that.  I'm hoping that is a good sign & I can get them out when I see BS again on the 22nd.  My DD had to leave today so I am on my own until DS comes on the 26th. Well the cat will keep me company!!  :D  And I'llhave the nurse starting tomorrow. All in all I feel pretty good!  Tired but not too bad!",
      "MessageIndex": 97,
      "PostDate": "15/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Aug 16, 2013 03:15PM grammaB wrote: Had the first visit by the home health care nurse today.  After mounds of paper work, typical of any first visit. She watched me empty my drains, said I was doing it just right. Kinda hard to mess that up....short of making a mess which I did once due to a blood clot... Then she unwrapped the ace bandage and took off the gauze and I got the first look at my new self.  Pretty bruised, but not too bad.  I'll be OK with the small scars I'll end up having.  Not so sure about the Buddha belly though.  With no boobs the belly is all that is sticking out there.... better start practicing sucking it in!! The shower was heavenly!!  All the old \"hospital ick\" is gone and I feel human again!  The nurse wrapped me up again and it felt so good to be clean!!  There is no way I could have done the re-wrap on my own, so glad I pushed for hh care.  The nurse said it was good that I did too. This is day 3 post surgery.  I am exhausted from the shower, but feel even better today than yesterday.  I see BS on the 22nd, I hope then she will say no more ace bandage and that I can lose a couple of drains. Delirium, trees eh?  I don't feel so bad then.  At least I got to leave the creepy machines behind at the hospital! ;)",
      "MessageIndex": 102,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Aug 7, 2013 05:02PM grammaB wrote: Hope all goes well Rosamond and the nodes are clear. I'm having my SNB @ 8AM my BMX is scheduled for 10AM the same day (13th).  I'd hate to have to go twice to get it all done!",
      "MessageIndex": 55,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Aug 8, 2013 09:31PM grammaB wrote: Laura, glad to hear all went well and SNB was negative and that you are feeling so well already.  It gives me hope I will do the same on Tuesday.  Rest and relax and continue to heal!",
      "MessageIndex": 65,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Jul 22, 2013 05:27PM grammaB wrote: Hi Ladies,  I'm scheduled for BMX on August 13.  My mom died of breast cancer, my father of prostate cancer, his mom from pancreatic cancer and his dad from stomach cancer. When I got my dx on July 8, I thought about a lumpectomy for about 1 day.  I met with the BS a day later and was already on to MX.  The more reading I have done, and with my family history by the end of the first week, I was fine with BMX. I do not plan on doing any reconstruction.  My pre-op appointment is this coming Thursday, the 25th.   My BRACA results aren't back yet (not sure if ins is going to cover it), but my MO said with the types of cancer on my dad's side, the gene could be from him.  I'm 64, and have had the possibility of this dx hanging in the back of my mind ever since my mom's death in '88. My MO said because the cancer was tiny and early he didn't forsee any chemo for me.   One issue that could come up is I had a hysterectomy back in '95 and the surgeon left a portion of my left ovary, so no hormones.  But now, if I do have the BRACA gene my MO said they would have to go in and find it and remove it. :((  But I'll worry about that another day!",
      "MessageIndex": 19,
      "PostDate": "22/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Aug 6, 2013 07:33PM grammaB wrote: coffeelatte, we share the surgery day!  I decided almost immediately after I decided to have the BMX that I was not going to do any recon.  But I'm 64 so having recon is not all that important to me.  All I knew was I wanted this cancer out of my body, did not want to have to worry about it coming back on the other side, and I wanted the least amount of surgery possible. I know it is scary, I won't say I'm not scared about it, but I feel comfortable with my decision and I think this anxiety/nervousness is just a natural part of the process. I just want it behind me and to begin the healing process!",
      "MessageIndex": 50,
      "PostDate": "06/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Aug 9, 2013 05:18PM - edited Aug 9, 2013 05:18PM by grammaB Thanks MAPBB!  And DeliriumPie, you are so right! This weekend is going to be excruciating!  And I have Monday to get through too.  At least my DD is flying in Monday so that will be a good distraction.",
      "MessageIndex": 72,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Aug 17, 2013 07:53PM - edited Aug 17, 2013 07:54PM by grammaB jbdayton and honeybair, I'll be thinking of you on your surgery days.  honeybair, I know how stressful that last weekend is.  Absolutely take some Xanax to take the edge off.  I did and it does help. No shame it that.  Day 4 post surgery for me today.  I didn't sleep well last night so feeling extra tired today.  Hardly any output from my drains.  I'm hoping that means a couple of them will come out on the 22nd.  My friend, a nurse, is going to come over tomorrow and help me with another shower.  The weather is hot here and I am so uncomfortable in the ace bandage. Actually, what hurts the most is the puff of fat/skin that buldges out of the ace bandage under my arms. It is really bruised and tender.  There is just no way to get that under the ace. But overall, I am not as sore as I was yesterday and am beginning to gradually cut down on the percoset. Yay, Rosamund!  Doesn't if feel good to be clean again!! :))",
      "MessageIndex": 110,
      "PostDate": "17/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Jan 4, 2014 06:44PM grammaB wrote: I love it too!! My chest says I fought the Beast and I won!! I do notice when I don't stand up straight that my Buddha belly really sticks out.  When I stand up properly, it isn't as noticeable.",
      "MessageIndex": 522,
      "PostDate": "04/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/737036",
      "Title": "Wardrobe pics for boobless days mom2two ShadePink"
    },
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Dec 18, 2013 11:59PM grammaB wrote: I love the attitudes here!!  I am just a bit past 4 months out from BMX and have never gone out in public in my bras and protheses!!  I am totally comfortable with my flat chest! I actually would be more self conscious in the bras with foobs! And as time has passed, I noticed people really don't notice that I am flat. As was mentioned, there are a lot of women out there that are very flat naturally with boobs, so who is to know? I have 2 sets of foobs, silicon and contact ones.  I haven't tried the contact ones yet as I was told wait 6 months.  I hate the silicon ones!  So cumbersome and uncomfortable.  I just wear a cami and a shirt or sweater.  It is cold here now so often a vest will go over the sweater and a coat too! LOL!  In the very beginning, I always wore a scarf to cover the flat area, but by Fall I hardly even did that, though I have tons of scarves.  Winter here in MT everyone is wearing scarves so mine do get worn now and don't feel I stand out at all.   I found some great crew neck sleeveless t shirts from LLBean in the summer. I found one at a thrift shop and liked it so much I ordered 3 more new ones.  High neck and under arm, the perfect coverup.  I see myself out and about in them next summer all on their own.  They are also great to layer under some of my v neck sweaters and shirts.  ",
      "MessageIndex": 510,
      "PostDate": "18/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/737036",
      "Title": "Wardrobe pics for boobless days mom2two ShadePink"
    },
    {
      "AuthorID": "grammaB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184043/profile",
      "Content": "Aug 25, 2013 06:13PM grammaB wrote: This is day 12 post surgery for me and my bs has had me bound in an ace bandage and now a surgical binder every moment since surgery except for my shower time.  I had my 4 drains out at day 9 post, they had hardly produced anything for 2 days.  I woke this morning with some seepage from the incision scars, not sure whether I cinched my self too tight or too loose yesterday after shower.  Still a bit of fluid there it seems. I can't wait to be free of the binding, but if it is keeping me from these drainage issues, I guess I'll go with the flow till she says I can take it off for good!! ",
      "MessageIndex": 7,
      "PostDate": "25/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/807696",
      "Title": "Drainage/Seroma problems katiekabooom Solnitsa"
    }
  ]
}