{
  "AuthorID": "Gramof3",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
  "Posts": [
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Apr 12, 2009 05:04PM Gramof3 wrote: Alyad--I'm actually in the February Furies thread, but I see you're in Springfield and wanted to say, \"Hi.\"   My bonnet was itching one day after work and I took it off on my way home...drove bald down S. Campbell--no reactions.  Went into Dilllon's on Battlefield--no one flinched.  Then I decided to stop by Pizza Inn and when I went to pay my bill, someone had already taken care of it!  You are right, though, it's too cold right now.   Take care--Helen PS I love the cat pictures. ",
      "MessageIndex": 1148,
      "PostDate": "12/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "May 16, 2009 07:45AM Gramof3 wrote:",
      "MessageIndex": 2056,
      "PostDate": "16/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "May 16, 2009 03:55PM Gramof3 wrote:",
      "MessageIndex": 2063,
      "PostDate": "16/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Jun 30, 2009 06:03AM Gramof3 wrote:",
      "MessageIndex": 2591,
      "PostDate": "30/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Sep 9, 2009 08:46PM Gramof3 wrote: I'm a little slow about joining this thread--just finished 10/36 today.  Dr. says everything looks \"fine,\" however, it's not his breast that is being baked.  Just hope the rads are doing what they're supposed to do.  There's a good article in yesterday's Time Magazine about treating the immune system as a new approach to cancer treatment.  Talks about chemo, rads, and now vaccines.  Hope it proves to be effective. I loved going to the drum circle and meeting Alyad--I see they're starting one at my work place, too, so think I will check it out as well.  And, I've run into CCBaby twice now--once in the rest room and today in the dressing room!  I didn't know about the bell--was there one in the infusion center, too?    Take care Ladies.  Helen",
      "MessageIndex": 306,
      "PostDate": "09/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Oct 8, 2009 08:36PM Gramof3 wrote: Christy, I wish I had been there when you rang the bell!  Congratulations...now just heal! Lemonjello--I agree about rads being harder than chemo--sounds like we have several things in common!  Hope the scan is B9--we'll think positive. And happy birthday!  (Mine is Saturday--so we're both Libras and like that balance). ",
      "MessageIndex": 462,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Oct 6, 2009 12:55AM Gramof3 wrote: Kim, I'm so sorry that you are still waiting.  Don't hesitate to keep calling your clinic/dr. until you get an answer.  Sometimes they forget that THEY work for YOU--you are paying the bill.  Maybe you could get in touch with your gyn's nurse and explain what this is doing to your nerves. Sometimes it's easier to get in touchwith a nurse or nurse practitioner.  Do you have a primary care doc?  Maybe a call to him/her would open the door to get the MRI results.  I think it's true that the waiting is the hardest part...do you like to read?  work jigsaw puzzles?  anything that might help keep your mind occupied until you get some answers.  Once you get the results, you'll be in a better postion to make plans--either breath a sigh of relief and move on, or work with your doc to develop a battle plan--moving on may take a little longer. Take heart--there are so many of us out here that will give you love and support...if you end up making this journey, we'll be here to help you.  In the meantime, I'm praying that you get your results very soon and that it is good news.  Helen",
      "MessageIndex": 4,
      "PostDate": "06/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/741133",
      "Title": "Can I wait with you? momoftwo71 momoftwo71"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Oct 14, 2009 11:20PM Gramof3 wrote: I'm DONE with Rads!  Sore, burned, but done!!",
      "MessageIndex": 486,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Apr 5, 2009 09:42AM Gramof3 wrote: Expectmiracles--I've been worndering about \"bumps\" too!",
      "MessageIndex": 116,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/726163",
      "Title": "Embracing the Bald BooBee Meadow"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Apr 5, 2009 09:47AM Gramof3 wrote: Cheryl, BTW, your ER pic on the Feb. 09 thread is terrific!  Wish I could look like that in the midst of all this...I'm into another \"jelly bean\" head thanks to steroids--the swelling just keeps on coming....oh well.  Helen",
      "MessageIndex": 118,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/726163",
      "Title": "Embracing the Bald BooBee Meadow"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Jul 13, 2009 10:45PM - edited Jul 13, 2009 10:49PM by Gramof3 July Chemo Babes (soon to be known by new name!) Michelle (O2B)  Thank you so much for listing me as an honorary member--I truly am honored!  I love reading all of your posts and it is wonderful to see how you are supporting each other.  You have taken charge of your situations--shows how strong you are now; believe me, you will come out of this even stronger.  My onc told me that women who participate on sites like BCO, do some research, ask questions, and just generally are more \"involved\" in their care, have \"better outcomes.\"  I didn't really understand until a couple of weeks ago, I sat in the chair next to a woman who just kept repeating, \"My doctor said I'll get really sick and lose my hair\"  to anyone who would listen.  Geeze.  Yeah, we may get sick (but thank God for Emend and Aloxi) and we may lose our hair...but we're going to have great futures!  So, go for it.  Off soap box now (but slightly strung out from steroids today...sorry) will soon go wash some windows or something to work this off. Quarter405  I believe this is referred to as Chemo Farts!  I have a friend doing chemo for colon cancer and she gets it really bad sometimes.  It hit her in a meeting a while back, and when I realized why she was heading for the door, I tried to \"cover\" for her and distract the others until she could get away.  Problem was I started laughing so hard--guess what...yep. Jacee  Thanks for sharing the info on the node dissection and lymphedema.  I found some stuff on the lymphedema threads, but your info made it come together.  I didn't realize about the pad rather than a string, either. PauldingMom  Good points about Ports.  The stabilizing stuture on my first one broke, so the port flipped over...long story, but I ended up needing to have  it removed and a new one put in three weeks ago.  It's working fine, but if I had problems, I would definitely go for number 3.  A port helps you make the best of a bad situation.  PS73  I hear ya on the constipation.  My sister (no BC) has that problem naturally, so I asked her for advice.  She said she eats dried apricots every night.  I bought a 12 oz. box, sat at my desk and snacked on them all day--so healthy.  That night I had the most God-awful cramps and diah. I ever remember having.  Called sis; she asked how much I ate.  She ended up laughing at me so hard I hung up (well, I had to go to the bathroom anyway).  She told me later that she eats exactly 4--I have eaten 0 since. Too long post--apologies.  Off to find the Windex.  Take care. Helen (Gramof3) BUT WAIT...there's more.  Some time when you're a bit down, check out www.chemoangels.net.  It's a group of wonderful, dedicated women who support chemo patients by sending cards and small gifts. It's a free service, and I have been blessed by Angel Diane from PA and Angel Michelle from MD. It has been fun and uplifting, and I'm planning on becoming a Chemo Angel when I've finished my TX.  O.k. this is it.  hb        ",
      "MessageIndex": 277,
      "PostDate": "13/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Jul 15, 2009 06:08PM Gramof3 wrote: PRV, I just sent you a PM.",
      "MessageIndex": 326,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Aug 14, 2009 07:22PM - edited Aug 14, 2009 07:23PM by Gramof3 Hello Triple J's I think I'm still an \"honorary member\" of your thread and I want to tell you how proud I am of all you J's and the way you've come together to support your sisters who are traveling this road.  This is a terrible journey to make, but you are fortunate to have the support of such a wonderful group of women--no one understands better than someone who is/has gone through this. I do have one concern.  I post on the \"Older women with b.c\" thread, and I'd like to clear up a misunderstanding I read on a Triple J's post back on August 12.  Although we are \"older\" (we also call ourselves \"seasoned,\" \"mature,\" and \"Chooks\" at times), there is no age requirement--some are pre-menopausal, some are post-menopausal, some married, some single, some with grandchildren, some without, some working, some retired--we are simply breast cancer survivors supporting other survivors.  All are welcome to visit and post on the thread and I'd encourage you to do that (just please don't laugh when we complain about arthritis, or how forgetful we are, or how these $#@*%^ computers drive us nuts!).  I hope all of you Triple J's have a good weekend with minimul side effects--keep being there for each other!  Helen     ",
      "MessageIndex": 1018,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Sep 13, 2009 05:02PM Gramof3 wrote: Alyad, Did I PM you about the MSU drum circle?  Maybe I sent to FB?  I remember writing, but can't find it on \"My Home\" here...  Helen",
      "MessageIndex": 335,
      "PostDate": "13/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Oct 10, 2009 11:14PM Gramof3 wrote: Chris, Thanks for the info on the Vigilon squares...will check it out. ",
      "MessageIndex": 475,
      "PostDate": "10/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Jul 7, 2009 12:14AM - edited Jul 7, 2009 12:18AM by Gramof3 July Chemo Starters I'm actually a \"February Furie\" --halfway through my chemo, still have 6 weeks of radiation to start after chemo.  My heart goes out to each of you--I certainly understand the shock, fear, and questions that go with this journey.  I'd like to just pass on a few ideas and comments that may help--if they don't, just ignore them! First--come up with a name for your group.  I mentioned the Feb Furies; there are the March Princess Warriors, the May Marvels, (sorry, I don't remember the April name--I truly have chemo brain tonight).  You'll become the best support group ever and you'll have so much in common.  Some of you will stay in touch way beyond your chemo days and you will become good friends. A name just gives you some unity and pride as you work through this. You May Want to Back Off once in a while--you'll soon find that different ocologists have different opinions about treatments, nutrition, drugs, activities, etc.  It can all become overwhelming sometimes.  If that happens, take a break from the boards so you don't get information overload.  I'm a Triple Neg, so I've had to do that a couple of times just to \"adjust.\"  BTW, I'm getting the \"Classical Protocol\" for TN:  Adriamiacyn (x4), Taxol (weekly x12), followed by 6 weeks of rads. I've had minimal side effects (mostly fatigue). Talk to your onc or Nurse Practitioner--don't suffer in silence, whether during an infusion, during business hours, or after hours.  You are paying them to take care of you and BC treatments/drugs have changed. Many side effects can be managed.  Your onc/treatment center has \"after hour\" numbers, but we're reluctant to \"bother\" anyone.  I think White said a good doctor won't let you suffer--call him/her.  Some days you'll just feel like crap.  Goes with the territory.  Watch out for days 3-5 as that seems to hit many of us harder.  My onc says it's when the liver starts the \"second pass.\"  The liver is working overtime during that phase to filter out the toxins--more reason to drink at least 8 glasses of water a day, more if possible.  Decaffinated tea/drinks are fine; if you drink caffinated, then drink half again as much water (which I absolutely cannot do). When you don't feel so hot, this is the place to vent.  One good thing about a large group (I think there are over 70 Feb. Furies now)--someone is always \"UP\" when others of us are \"DOWN.\"  It's a give and take, so don't feel bad about letting it all hang out (well, that sure dates me)--we all need to sometimes.  Try to keep a positive attitude --(but tell you what, if one more person who has NEVER had cancer tells me that, there will be an ugly display).  However, there IS strength and reassurance from someone who has/is going through this.  That's all, Folks.  I don't mean to get in the way as you start this trip--just know that you CAN do this--no one asks to be here, but you've got friends who care and will listen and will help you get through this.  Good luck and Take Care.   (((( HUGS to all)))   Helen  ",
      "MessageIndex": 118,
      "PostDate": "07/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Jul 8, 2009 06:00PM Gramof3 wrote: Eph3_12 The Forum is Moving Beyond Cancer, thread is Let's Conduct our Own Study on How We All Got Breast Cancer.    Don't read it unless you are ready to have a belly laugh or two!",
      "MessageIndex": 152,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Oct 5, 2009 08:07PM Gramof3 wrote: Just home from #28 today.  The rad oncologist told me I have 7 boosts coming up.  So far, I haven't found anything that really helps the burn--Chris, do you know the brand name for the pads?  I've tried going braless, but have a complication--a yeast infection under my radiated breast--so when I do go without a bra, the infection flares up.  I've about decided that I'll just grin and bear it until the 13th. Congratulations to all who have finished!!",
      "MessageIndex": 444,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Jul 20, 2009 11:23PM Gramof3 wrote: Eliz and Twinmom--I'll be thinking about you tomorrow. (((hugs)))  You'll do fine--and wonder later why you were so concerned.  The nurses at my infusion center are great--I imagine yours will understand the anxiety and see that you are comfortable with the procedures.  Twinmom, Eliz, O2B, Sherrill,  You are spot on about involving your children (young and older) to the level of their understanding.  My sons are grown (38 and 35) and I involve them the least I can get away with.  It's not their level of understanding--they just drive me nuts when they go into overprotective mode.  However, I do involve my 2 granddaughters (8 and 5) and they handle it well!  Not that this is for everyone (and Grammies can get away with more silliness sometimes), but in facing the baldness part, I got Sharpie markers and let them decorate my bald head--as long as they stayed within the wig margins.  They had fun, got used to the baldness, AND the markers washed off in three days.  Triple Js    What a wonderful group...rock on.  Helen",
      "MessageIndex": 462,
      "PostDate": "20/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "Gramof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79878/profile",
      "Content": "Jul 7, 2009 11:10PM Gramof3 wrote: You women are positively awesome--off to a good start, ready for the challenges.  Keep it up! You go girls, you rock! Helen",
      "MessageIndex": 138,
      "PostDate": "07/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    }
  ]
}