{
  "AuthorID": "GrandHillMo…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
  "Posts": [
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jun 8, 2013 10:21AM GrandHillMom wrote: I also failed Tamoxifen but had regression then stability on Aromasin. I had carbo/taxol last summer for unrelated ovarian cancer, which also got me to NED for my metastatic BC. I have continued NED since last October on Aromasin.",
      "MessageIndex": 12,
      "PostDate": "08/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805749",
      "Title": "NED, ER+/HER2-? Are you out there? I want to know you! DancingVeggie Stormynyte"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jan 15, 2014 05:57PM GrandHillMom wrote: Zometa does cause stress fractures, which are known side effects.   I have had two in my foot.  I have gone from monthly to quarterly Zometa treatments and have not had another for over a year.  I have to be very careful not to twist the foot so cannot wear high heels or even Dansko clogs.  I agree that running may not be in the cards and you will need to find something with less impact.  Good luck.  ",
      "MessageIndex": 4,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816947",
      "Title": "How often should I take Zometa? Springlakegirl Springlakegirl"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Nov 28, 2011 11:46PM GrandHillMom wrote: I quit working, but am taking a lot of vacations!  If you enjoy work, I say go for it.  I did not really enjoy my work and it worked out financially to take disability and retirement income.  I am loving not having to work and being on LTD for the last 18 months.  By the way, I am another Penny.",
      "MessageIndex": 15,
      "PostDate": "28/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778669",
      "Title": "Working? Vacations? redwolf8812 GrandHillMom"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Dec 25, 2010 09:31AM GrandHillMom wrote: I was very sad and emotional yesterday morning (Christmas Eve day).  I am also now on LTD, but didn't seem to get enough things organized for Christmas.  I worked all day yesterday and am still baking,etc. for today's dinner with my husband's family.  I cried yesterday, something I don't do often, because I am scared about the future.  I have a 12 year old, a 21 year old and a 27 year old, and I just think the 12 year old is getting a bum deal (and so are the other two).  I also lost my Mom to the side effects of breast cancer treatment, but she was only Stage 1 and died from a pulmonary embolism from an Arenesp shot--really, really shitty unfair! But I also think lucky I am to have all three kids around this year, a great husband, a special puppy, many friends, and a very very white Christmas here in the North Star State.  Jennifer, I hope you have at least as many good days and bad ones, and lots and lots of time with your husband and your pups.  I think it is hard for anyone not in our shoes to understand what we are going through, so always feel free to say how you feel to us. ",
      "MessageIndex": 9,
      "PostDate": "25/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762424",
      "Title": "Feeling major depression setting in Honeybear Honeybear"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jan 14, 2012 02:54AM GrandHillMom wrote: My onc hates to tell all the bad news (or any bad news), so I insist on reading every test result myself.  I also got a second opinion that confirmed my treatment plan was appropriate.  ",
      "MessageIndex": 4,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780990",
      "Title": "My onc speaks in riddles! LouiseBogle pminxy"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jan 15, 2013 04:36PM GrandHillMom wrote: I am 54 year old \"retired\" attorney (took disability 2 1/2 years ago after mets dx).  I am now stay at home mom to busy 14 year old daughter.   I also have a 29 year old son and a 23 year old stepdaughter, both living out of state now.  My husband and I have had our ups and downs, but are currently hanging in there together.  I was dx'd with bilateral Stage IIIb and IIa IDC in 2006, had aggressive chemo, surgery and radiation, and then almost to the day four years later dx'd with widespread bone mets.  Also dx'd with clear cell ovarian cancer earlier this year.  After chemo for the  ovarian cancer, my mets were metabolically inactive (NED, in other words). I was stable prior to that.  I continue on Aromasin and Zometa, with another PET scheduled next month to see what the bone mets are up to.   I am not a frequent poster but read almost every post.  ",
      "MessageIndex": 34,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798841",
      "Title": "Roll Call 2013 LilSchatzie reader123"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "May 13, 2011 08:24AM GrandHillMom wrote: I'm on low dose Lasix because Aromasin made me swell up and my blood pressure went up.  It helps.  Banana bread definitely counts in my book!",
      "MessageIndex": 4,
      "PostDate": "13/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/768919",
      "Title": "Anyone have to take diuretic while on chemo? PJB PJB"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Feb 26, 2012 11:21AM GrandHillMom wrote: My breast center just started a mets support group. I was part of a focus group last year where it was discussed. I am going to try it for a while. I get so much info from this site and I hope to help support others.",
      "MessageIndex": 12,
      "PostDate": "26/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783238",
      "Title": "Discrimination?!? JillThut jan125"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jan 10, 2012 08:27AM GrandHillMom wrote: I also had repeated mammograms that did not show what turned out to be stage IIIb cancer, now metastatic. Only an MRI after I felt a huge lump outside my breasts found cancer in both breasts. There needs to be better tests or the use of MRIs for all with dense breasts. A diagnosis at any stage after \"clear\"mammograms is devastating.",
      "MessageIndex": 4,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780780",
      "Title": "Four Mammograms & US in 18 months and still a Stage IV diagnosis Anko66 chele"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Oct 24, 2012 11:12PM GrandHillMom wrote: Thanks! It is nice to have people who understand how great this is without them thinking I am \"cured\",",
      "MessageIndex": 13,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795415",
      "Title": "NED! GrandHillMom soleil505"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Dec 31, 2012 06:22PM GrandHillMom wrote: My routine PET scan found an ovarian mass last April. Turned out to be clear cell ovarian cancer, not a BC met. After surgery, I had chemo ( carboplatin and taxol), which has gotten me to NED for my bone mets. So not the worst thing that could have happened. Of course, your Mom could have a benign cyst. Either way, this may not be too serious in the scheme of things.",
      "MessageIndex": 1,
      "PostDate": "31/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798242",
      "Title": "mets to ovaries? luvmimom luvmimom"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Aug 13, 2013 06:26PM GrandHillMom wrote: My PET reports say: No evidence of metabolically active disease. My onc actually says remission.",
      "MessageIndex": 12,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/808987",
      "Title": "Bone mets...I don't get it. raro DivineMrsM"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Mar 8, 2011 06:32AM GrandHillMom wrote: I agree to call your onc and get the appropriate scans, even if you are between visits.  I was sure I had bone mets in my ribs for several months but my onc didn't want to believe me.  I was right.  It finally took a PET scan to convince the onc.  I am doing well a year later.  You can see from my signature that I was also a few years out from Stage III.  You want to just put it behind you, but you need to know what is really going on. ",
      "MessageIndex": 2,
      "PostDate": "08/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765899",
      "Title": "A bit concerned over excessive pain 3daywalker 3daywalker"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jul 8, 2013 03:56PM GrandHillMom wrote: I had a chest x-ray last week for possible pneumonia and it found a \"questionable pulmonary nodule\" in my upper left lung. I have never had a lung nodule before on frequent PET/CT s over the last 3 1/2 years. I am having a new PET/CT tomorrow a.m. to check this out. Reading your posts makes me wonder how conclusive that will be.",
      "MessageIndex": 3,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807416",
      "Title": "A question on lung nodules keepingon SyrMom"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Sep 28, 2013 03:33PM GrandHillMom wrote: I tried Cymbalta, Gabapentin (similar to Neurontin) and Lyrica. None of them helped with my arm pain and tingling, which I assumed was peripheral neuropathy. I had a full neurological work up and it turns out I have a vitamin B12 deficiency. This can cause serious neurological issues and is probably caused by an autoimmune disease called pernicious anemia. I just started B12 shots. My neurologist says it will probably take a few weeks to see improvement. A simple blood test showed the defiency. You need to fast before the test. Maybe you could ask for this blood test to rule out a B12 issue.",
      "MessageIndex": 2,
      "PostDate": "28/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811790",
      "Title": "Lyrica or Neurontin? raro justjudie"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Oct 11, 2010 03:48PM GrandHillMom wrote: I was on Tamoxifen for over three years post Stage IIIb cancer.  One of my oncs says that I was probably actually Stage IV but NED due to the Tamoxifen.  When numerous bone mets showed up, I switched to Aromasin and six months later have had excellent response--most mets are now resolved and the remaining smaller and less active.  So, I think switching does work. ",
      "MessageIndex": 3,
      "PostDate": "11/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759192",
      "Title": "Switching hormonals...does it ever really WORK? bopeep mohonda"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Apr 8, 2013 05:56AM GrandHillMom wrote: Eleven",
      "MessageIndex": 10,
      "PostDate": "08/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "May 30, 2011 07:51AM GrandHillMom wrote: I'm interested--I live in Saint Paul. ",
      "MessageIndex": 1,
      "PostDate": "30/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769636",
      "Title": "midwest / minnesota get together mbk mnmom3"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Aug 20, 2012 06:22PM GrandHillMom wrote: I have been going to the infusion room for years--stage 3b BC for ACT (no hair), stage iv MetastatIc BC for Zometa (hair) and now have added stage 1 clear cell ovarian cancer and carbo/taxol ( no hair again). I always think every one else looks sicker than me, hair or no hair. I like to go alone, and people who bring several friends or family members when there is really only room for one companion per patient really annoy me. The tvs have head sets, thanks goodness. I just take snack (odorless) and read a book or try to sleep. My current treatment takes at least five hours, which is a long day if you get next to the loud talkers, nosy people, or someone who brings or orders in smelly food!",
      "MessageIndex": 25,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792243",
      "Title": "Infusion Center Moments blainejennifer Fitztwins"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jun 17, 2012 11:48AM GrandHillMom wrote: Bump.  I am starting Carbo/Taxol this Tuesday (for clear cell ovarian cancer) and am hopeful it also helps my bc mets.  Anyone on this chemo?  What are side effects?",
      "MessageIndex": 1,
      "PostDate": "17/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789152",
      "Title": "Carbo/Taxol People: Question FiveAlive FiveAlive"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jan 6, 2013 04:45AM GrandHillMom wrote: Swelling could also indicate a small fracture.",
      "MessageIndex": 4,
      "PostDate": "06/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798391",
      "Title": "Do You Get Swelling from Your Bone Mets? GoldenGirls GoldenGirls"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jul 22, 2012 12:52PM GrandHillMom wrote: I have skull mets, but have never been more concerned about them than my other bone mets (spine, ribs, pelvis and femurs). They are bone mets, which are treatable for a long time, as you know. They are NOT brain mets. Please do not let them upset you. You should plan for the future, but I do not believe the skull mets have significantly changed that future. Stay strong.",
      "MessageIndex": 1,
      "PostDate": "22/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790939",
      "Title": "Skull mets clairejslm clairejslm"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Oct 3, 2012 06:31AM GrandHillMom wrote: I had cataract surgery on both eyes last year. I was on Aromasin and Zometa and did not have to do anything different with treatment. One of the reasons I had the surgery at that time was in case later I needed to change to different treatment that would inhibit healing. Eye doc and onc were ok with Aromadin and Zometa, but did not really discuss what kind of treatment would preclude cataract surgery.",
      "MessageIndex": 1,
      "PostDate": "03/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794340",
      "Title": "Have you had cataract surgery? hotandcold hotandcold"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "May 11, 2011 05:21AM GrandHillMom wrote: My onc recently mentioned that Aromasin was going to be available in generic, and other AI's soon,  and didn't seem at all concerned.   I did just get the generic version in my last mail order delivery.  I take generic of almost everything, prescription or OTC.  The only exception is when my doctors specifically tell me not to take generics.  For example, the generic Synthroid for thyroid deficiency is not considered to be as good. ",
      "MessageIndex": 1,
      "PostDate": "11/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/768777",
      "Title": "generic aromasin? H-LYNN Fitztwins"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jul 23, 2011 04:10AM GrandHillMom wrote: Cait, I just read your blog and will keep doing so!  I have thought about you alot from reading your postings here, and feel even closer to you since my 13 year old daughter is Mary Cait (with the proper mark over the a--I can't seem to do it here).  My husband and I honeymooned in Ireland and stayed in B and B's every night.  We especially liked one host, named Cait McDonogh, who lived near the village where some of my husband's Irish ancestors had lived in Connemara before immigating to Minnesota.  Her mother verfied the cottage they had lived in, and since it was vacant, we got to go inside where his great-great grandfather was born.  I insisted that Mary Cait's birth certificate have the marked a, and had to write it in ink on the typed copy before I signed it.   I am sending you good thoughts from Minnesota to Ireland. ",
      "MessageIndex": 16,
      "PostDate": "23/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771991",
      "Title": "I need advice. Non cancer related katie31 blondiex46"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jun 6, 2013 12:36AM GrandHillMom wrote: I think a SUV of 2.1 is pretty mild. I have had SUV's of over 10 that were cancer. Hope it is not a new met.",
      "MessageIndex": 2,
      "PostDate": "06/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805737",
      "Title": "PET results back, but still don't know if its good or bad news. brandall brandall"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jul 4, 2013 05:55PM GrandHillMom wrote: I started Cymbalta today to try to treat my neuropathy from taxol and carboplatin after waiting a couple weeks for insurance approval. Lynne248, keep us updated on the Lyrica. That would be my next stop if the Cymbalta does not work.",
      "MessageIndex": 16,
      "PostDate": "04/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806591",
      "Title": "Neuropathy. What new fresh hell is this? lynne248"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jun 19, 2011 04:13PM GrandHillMom wrote: My numbers lately are in the 10 to 12 range.  Highest ever was 49, a couple months after mets dx and change to Aromasin.  I am fairly stable, with some active bone mets. ",
      "MessageIndex": 1,
      "PostDate": "19/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770527",
      "Title": "Tumor Markers Lauriesh MJLToday"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Dec 16, 2011 04:46AM GrandHillMom wrote: First scans showed regression for me, since then mostly stable.  Good luck.",
      "MessageIndex": 5,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779579",
      "Title": "First scans diagnosis and treatment? Canchaser Canchaser"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Mar 1, 2012 01:53AM GrandHillMom wrote: A port is a great thing! I am on port no. 3. First one removed after initial a/c and taxol when I had breast reconstruction. When I was diagnosed stage iv four years later, I got a new one (power port now) on the same side but it didn't work super great. I only use for monthly blood draws and Zometa, so don't really have to have one. I decided to go for no. 3 anyway, even though some nurses and my breast surgeon tried to talk me out of it. Before my insertion surgery, it took two nurses and several pokes to get the IV in. I told them that is why I need one! The new one is on the other side and works perfectly. No pain or anxiety for blood draws and infusions. I have never even had the numbing cream some people use. I just wish the PET scan contrast could be infused through it. My hospital says the glucose in the contrast would clog up the port. Good luck!",
      "MessageIndex": 13,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783417",
      "Title": "Tell me to knock it off! Tiger_Blood exbrnxgrl"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Nov 12, 2012 05:26AM GrandHillMom wrote: My father had bone mets from prostate cancer. He had a hip replacement at age 65 or 66.",
      "MessageIndex": 6,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796188",
      "Title": "Too old for a hip replacement? Nataliya2003 monroy01"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Aug 21, 2012 11:24PM - edited Aug 22, 2012 12:27AM by GrandHillMom Those of you who acknowledged that being Stage iv \"from the get go\" might be better in some ways than presenting at a lower stage and having every harsh treatment before mets are found: Thank you! I often think I would have preferred to have been initially diagnosed at stage iv rather than stage IIIb, so I could have avoided at least some of the treatments and also the intervening worries (really, knowledge ) that It would metatasticize anyway. I have never wanted to say this to anyone initially diagnosed as stage iv, so I am grateful for your comments.",
      "MessageIndex": 46,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792240",
      "Title": "I thought this was supposed to be rare 4myangels carpe_diem"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jul 18, 2011 09:10AM GrandHillMom wrote: Returned last week from 16 days in Europe.  First to Paris with my husband and 13 year old daughter for 4 days, then met husband's entire family in Rome to attend my brother in law's wedding at the castle where Tom Cruise and Katie Holmes got married.  Unbelieveable!  Spent several days in Rome and a couple in Florence with my sister-in-law, two brothers-in-law and five nieces/nephews--that made 6 kids between 15 and 10 hanging out together.  Only problem was I developed a very sore foot about 5 days into the trip.  Had an x-ray in Rome which didn't show any fractures, so continued walking on it for 10 more days.  When I got home, went to my doctor who referred me to a podiatrist.  New x-rays showed stress fracture in right fifth metatarsal.  Now in a walking boot for several weeks.  My onc wonders how I got a stress fracture while taking Zometa, now wants a bone density test in case the Aromasin is seriously thinning my bones.  Back to reality, I guess.",
      "MessageIndex": 64,
      "PostDate": "18/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770923",
      "Title": "Anyone have a real or imaginary vacation planned in the future? cookie97 NewReality"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Nov 26, 2012 07:11PM GrandHillMom wrote: I had the test and counseling after being dx'd with ovarian cancer on top of my BC. Also, my mom had BC-and my dad died from metastatic prostate cancer. All these add up to a good probability for BRCA mutations. I mostly wanted to know for my kids, nieces and nephews. The medical reason given to insurance is that the results may affect treatment decisions now or in the future. Turns out I am not BRCA 1 or 2 positive, and knowing that has benefited me because it is good news for my kids and nieces and nephews.",
      "MessageIndex": 7,
      "PostDate": "26/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796865",
      "Title": "Is bc genetic testing really necessary? Kaelia Kaelia"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Sep 28, 2011 07:31AM GrandHillMom wrote: I have mostly blastic mets, which did not show up on a bone scan (some of you have the opposite result) or just looked like healed fractures.   I did not get a PET until my tumor markers went up, then the PET lit up like the proverbial Christmas tree.  Now I only get PET/CT's, no bone scans.  The PETs do show changes to the tumors better than bone scans, I believe. ",
      "MessageIndex": 24,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775555",
      "Title": "Pet scan vs. Bone scans???? tammie IllinoisNancy"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Oct 22, 2012 10:28PM GrandHillMom wrote: The spammer is Emmalee, not you Spamgiirl. I also reported Emmalee.",
      "MessageIndex": 6,
      "PostDate": "22/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795321",
      "Title": "Metastatic Breast cancer Azie Chickadee"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Mar 3, 2012 01:48AM GrandHillMom wrote: Weight Watcers online. My onc was so impressed that I had lost 16 lbs in 8 weeks since last appt. I am starting to get more exercise and the weight loss is continuing. I have been going to cardio and yoga classes for senior citizens even though I am 53. Seems to be the right intensity for my situation.",
      "MessageIndex": 7,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783517",
      "Title": "Weight Loss Ideas neogirl Cafelovr"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Aug 27, 2013 06:33PM GrandHillMom wrote: Wow. Beautiful.",
      "MessageIndex": 39,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809938",
      "Title": "New Video, Feedback Please... EnglishMajor AnacortesGirl"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Nov 18, 2011 11:21AM GrandHillMom wrote: Tamoxifen caused a very thick lining in my uterus (showed up on PET scan, even).  When I switched to Aromasin, it all came out like a very heavy period.  I had the biopsy, no problem.  Bleeding stopped in a few weeks and over a year later everything is fine.  ",
      "MessageIndex": 4,
      "PostDate": "18/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778243",
      "Title": "endometrial biopsy Canchaser GrandHillMom"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Nov 11, 2010 07:29PM GrandHillMom wrote: I was actually on Megace and Tamoxifen after Stage IIIb diagnosis, then developed my bone mets.   I am doing very well on Aromasin now--lots of regression. ",
      "MessageIndex": 3,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760629",
      "Title": "Thinking about what treatment is next Reneepals Lynn1"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Sep 6, 2011 05:06PM GrandHillMom wrote: I only look at the TM's if I can have the last three results.  The actual numbers are so variable by individual--I am usually about 12 and at 47 I had very active mets.  Some people are in the hundreds and are stable. ",
      "MessageIndex": 3,
      "PostDate": "06/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774297",
      "Title": "Guess I won't do THAT again!! Lynn1 china"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Oct 13, 2011 11:27AM GrandHillMom wrote: I'm bumping this because today is the day.  Thanks again, English Major.",
      "MessageIndex": 11,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775737",
      "Title": "MBC Awareness Day Tweets & FB Updates You Can Use EnglishMajor Marie50"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jul 27, 2011 08:42AM GrandHillMom wrote: I had cataracts in both eyes removed earlier this year.  I have better driving vision, but lost my ability to read without glasses, so am not entirely happy with outcome.  I have heard that chemo makes cataracts \"ripen\" faster, but I don't think they specifically cause them in the first place.  I had chemo in 2006 and I think the cataracts first showed up a year or two after that.  However, both my parents had cataracts, my mom in her 30's and my dad in his 60's, so I would have probably gotten them anyway. ",
      "MessageIndex": 1,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772196",
      "Title": "Chemo and Cataracts lukejessesmom Lena"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Sep 30, 2011 03:10PM GrandHillMom wrote: Thank you!  I have also been linking to \"Think Before You Pink.\"   I ask my friends and supporters to ask the critical questions about using breast cancer as a marketing tool, including where and how much (if any) of the money raised will go.  http://thinkbeforeyoupink.org/?page_id=13",
      "MessageIndex": 5,
      "PostDate": "30/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775737",
      "Title": "MBC Awareness Day Tweets & FB Updates You Can Use EnglishMajor Marie50"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jun 17, 2012 11:41AM GrandHillMom wrote: I have a 14 year old, who was 7 at first BC diagnosis and 11 at mets diagnosis.  I was just diagnosed with a rare, aggressive ovarian cancer on top of that.  If she asks me these type of questions, I truthfully say \"I hope so.\"",
      "MessageIndex": 1,
      "PostDate": "17/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789243",
      "Title": "what to say to a 10 year old Lauriesh Frapp"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Jul 12, 2011 10:23AM GrandHillMom wrote: My onc reassured me that skull mets (which I have also) aren't really different from other bone mets and certainly will not \"move into\" the brain.   The treatment for your ribs and spine mets should also treat the skull mets.  The good news is that to find the skull mets, you probably had a brain MRI, meaning no brain mets were found. ",
      "MessageIndex": 3,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771515",
      "Title": "Skull mets dunnmd thats-life-"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Dec 29, 2012 06:45AM GrandHillMom wrote: chemobeanies.org I bought several and got many compliments. They make a unique pre-tied scarf in many fabrics.",
      "MessageIndex": 2,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798103",
      "Title": "Websites for cute hats and scarves? Surly SpecialK"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Apr 26, 2012 11:06AM GrandHillMom wrote: Drink plenty of water before, during and after. I also make sure I get all the IV fluid, even though that takes a few more minutes after the Zometa is done.",
      "MessageIndex": 5,
      "PostDate": "26/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786485",
      "Title": "Starting Zometa soon CapeTownJanine Marj2007"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Sep 28, 2011 09:22AM GrandHillMom wrote: I had cataract surgery in both eyes this year (I'm 53).  I am not so happy with the outcome, because I lost my near vision without glasses, but I can see so much better to drive, especially at night. ",
      "MessageIndex": 6,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775609",
      "Title": "Cataracts Anne45 gramalola"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Mar 1, 2012 01:39PM GrandHillMom wrote: I have been on long term disability for 21 months. Having stage iv bc is at least a part time job, so it is hard to also have a full time job, especially if you have to do the job at specific times, like at a school. I do not sit home all day. I take writing classes, go to the gym to take \"silver sneakers\" fitness classes even though I am the youngest by 20 years, travel, see old coworkers, garden, read a lot of books, etc. Some days I hang out at home, but I find that if I put something on my calendar like a yoga class, I will go. You could volunteer at your school or another school. I have done some volunteering at my 13 year old's school. I hope your pet says there is no problem, but keep thinking about disability and how you can use your time and live with less stress. I am happy with my choice.",
      "MessageIndex": 70,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783375",
      "Title": "Scan Results Tomorrow CoolBreeze Brendatrue"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Mar 1, 2012 03:18PM - edited Mar 1, 2012 03:18PM by GrandHillMom",
      "MessageIndex": 72,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783375",
      "Title": "Scan Results Tomorrow CoolBreeze Brendatrue"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Mar 8, 2011 01:09AM - edited Mar 8, 2011 01:10AM by GrandHillMom I have a lot of respect for what Lance has gone through, and he is a great inspiration, but Stage IV testicular cancer is considered curable while Stage IV breast cancer is not.  Testicular cancer is actually one of the most curable cancers, and was the first one with a chemo cure after childhood leukemia.   This is discussed in the recent book, The Emperor of All Maladies, which I highly recommend for understanding how cancer works and how chemo works (to the best that anybody really knows)  We need more research into CURING metastatic breast cancer so breast cancer can actually be cured!",
      "MessageIndex": 2,
      "PostDate": "08/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765879",
      "Title": "Long Time Survivor of Stomach, Lung, & Brain Mets! MCTHO MCTHO"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Mar 10, 2014 08:34PM GrandHillMom wrote: Four years last week for me.  ",
      "MessageIndex": 16,
      "PostDate": "10/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818929",
      "Title": "2 Years and Counting kayrnic brandall"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Dec 5, 2012 06:49PM GrandHillMom wrote: My mammograms never showed my bilateral tumors, one of which was seven centimeters in size. Six weeks after my seventh clear mammogram, I felt an enlarged lymph node outside my breast and had an ultrasound and MRIs. I got a digital mammo the same day the MRI found my tumors, and nothing showed up. I never could feel the tumors even when I knew where they were. This is the problem with relying on mammograms for younger women with large, dense breasts. Imaging technology needs to be improved, to prevent both false negatives and false positives using affordable technology, since MRIs are seldom ordered for low or average risk women.",
      "MessageIndex": 5,
      "PostDate": "05/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797257",
      "Title": "Slate.com article about mammograms reader123 1Athena1"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Mar 17, 2011 03:26PM GrandHillMom wrote: I do not want to sound alarmist, but my dear Mom died from a pulmonary embolism following an Aranesp injection.  It is approved only for active chemotherapy, but her onc. gave it to her years later for anemia.  She was Stage 1, post lumpectomy, chemo and radiation (by a few years) so her only treatment at the time was tamoxifen. These drugs are beneficial for certain people at certain times, but can be very dangerous otherwise.  When I was on A/C chemo (before Mom died) I had one Aranesp injection for anemia, then the onc. decided to try extra iron supplements and that worked just as well. ",
      "MessageIndex": 1,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766317",
      "Title": "Aranesp, epogen, procrit china jeanne46"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Mar 13, 2013 01:39PM GrandHillMom wrote: Also, be careful about constipation, especially at beginning.  ",
      "MessageIndex": 4,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801736",
      "Title": "Carboplatin/Taxol side effects? 11tyBillion SAMayoFL"
    },
    {
      "AuthorID": "GrandHillMo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101624/profile",
      "Content": "Mar 13, 2013 08:56AM GrandHillMom wrote: I did carbo/taxol from June to October last year. The carbo is hard on blood counts, especially white counts. I think I only had bad nausea one out of the six rounds. Ativan usually helped me keep the nausea away. Quite a bit of fatigue. I had total hair loss but it is all growing back now. By the way, am now NED. Good luck.",
      "MessageIndex": 3,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801736",
      "Title": "Carboplatin/Taxol side effects? 11tyBillion SAMayoFL"
    }
  ]
}