{
  "AuthorID": "grandmatexa…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
  "Posts": [
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Sep 22, 2015 07:25PM grandmatexas wrote: If it is truly bothering you (physically and mentally) I see no reason not to get a second opinion. Nobody is perfect and doctors are not infallible.",
      "MessageIndex": 3,
      "PostDate": "22/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/835188",
      "Title": "SUGGESTIONS WELCOMED ....BREAST ISSUES samjul sarahr30"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Sep 19, 2015 01:37AM grandmatexas wrote: I've been bleeding from the right nipple since July 12th. I've had a diagnostic mammogram and ultrasound - they say some micro-calcs, which they tell me they probably wouldn't worry about if it weren't for the bleeding. I have very dense breast tissue, which only complicates everything. I was surprised when the tech told me the doctor wanted more pictures of the left breast. As it turned out, there was a 2 cm spot in the left breast and, after additional pictures, there is a 6 mm spot on the right. The radiologist decided a bilateral biopsy was needed, so I returned a couple days later. Because the blood vessels were so close to the microcalcs in the right breast, they could only biopsy the left. ADH was the diagnosis; precancer I'm told. Next step, MRI. In order to get that MRI, my doctor had to argue with my insurance company. That slowed the process down, but he was successful. I went for an MRI with contrast which showed three suspicious areas. One, upon further review, the radiologist decided was a healthy lymph node, but the other two needed to be biopsied. These were two spots that did not show in the mammogram or ultrasound. The MRI guided biopsy revealed ALH and an atypical papilloma. And they resulted in a large hematoma. I am now waiting to undergo excisional biopsies (I guess-I keep thinking of it as lumpectomies). I will have to have four localization wires placed (one in left and three in the right). The surgeon tells me he needs to remove tissue from the three already identified spots, as well as the micro-calcs that could not be biopsied during the first biopsy. He will also remove the bleeding duct from the right breast. I keep thinking that I don't really have a breast cancer diagnosis, but it feels like I do. The second radiologist informed me that, at the very least, I would need an MRI every year because the two diagnosis on the right did not show up on the mammogram. I'm ready for the double mastectomy just so I don't have to wonder all the time if it's going to be cancer. Not sure how this next surgery will turn out, but I'm anxious to get a definitive diagnosis. Thanks for listening. ",
      "MessageIndex": 431,
      "PostDate": "19/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Oct 15, 2015 06:25PM grandmatexas wrote: Thank you, Tinkerbell 4. Sometimes it just helps to have a place to say, \"This is how I feel.\" This is a place where everyone has some knowledge of what each of us is going through. Many times we don't need anyone to actually give us advice, but simply to listen. That is what makes this forum valuable. :-)",
      "MessageIndex": 535,
      "PostDate": "15/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Mar 1, 2016 01:17PM grandmatexas wrote: I did the double mastectomy in November and the reconstruction surgery was last Wednesday. Still recuperating. Not sorry about the route I chose, but I will be glad to get life on a little more even road. Good luck to all of you. Keep us posted on your diagnosis and decisions.",
      "MessageIndex": 617,
      "PostDate": "01/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Oct 12, 2015 07:06PM grandmatexas wrote: Thank you, Ddw79. I'm sorry the doctors didn't agree with you. You're so right about peace of mind.",
      "MessageIndex": 514,
      "PostDate": "12/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Oct 21, 2015 10:25PM grandmatexas wrote: Welcome, BoopsieRN. First, I'm sorry you're going through all of this. I think you're being very brave. I'm sure you're feeling many of the same things I am. The doctor told me the typical treatment for ALH or ADH is 5 years of anti-estrogen drugs and screenings every 6 months, with suspicious areas being biopsied. I understand where you're coming from and I am in complete agreement. I have several different spots (ADH, ALH, and atypical papilloma) across both breasts and I have chosen the same course you did. My husband and I discussed mastectomies at length and when we talked to the doctor about that option we were told that is what he would suggest if I were his wife. Our decision felt validated and every woman I have talked to has said they would do the same thing. I'm scheduled for November 10th and we see the plastic surgeon this Monday. I wish you peace and will be sending positive thoughts your way.",
      "MessageIndex": 553,
      "PostDate": "21/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Nov 20, 2015 02:07PM grandmatexas wrote: Thank you all for your positive words. I'm not sure about bravery, but my journey began with fear. I was afraid of cancer, preparing ourselves for the worst possible diagnosis. In my mind, by preparing ourselves for the worst, anything better than that diagnosis would be good. Once we had ALL of the diagnosis, I/we didn't feel like there was really any other option for us. We did our homework; we researched the diagnoses, the possible drugs that could be used, and the protocol for future screenings. I could not envision taking drugs to save the girls while possibly subjecting my body to the side effects (some of those possible side effects were worse - in my mind- than the alternative). I was told that screenings every six months would be necessary. That meant every six months going through the emotions I had been going through for the prior three months. I was afraid - afraid I would not be able to handle that emotionally. And then when he told me we would biopsy anything unusual. More biopsies? I don't think so. I'd already had EIGHT! As it turns out, since they did find a cancer (that was only found through mastectomy) trusting my gut was the right choice. Not so much brave, but what I consider self-preservation. So, not so sure I was being brave or being chicken. Going through the mastectomies basically meant the end of this nightmare. I know there is still a small chance, but by taking care of things now, we significantly reduce future risk. Brave? Chicken? Whatever it is, I feel better. I know there is a healing process ahead. I will say, at this point, I am not in much pain at all (nearly two weeks out). I have already had one drain removed and expect the other to come out Monday. I have fills and implants to look forward to, but we made the right decision for us. And if anyone needs recommendations for oncology or plastic surgeons in the Fort Worth area, I'll be happy to share. Mine are amazing!",
      "MessageIndex": 570,
      "PostDate": "20/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Feb 19, 2016 10:37PM grandmatexas wrote: I'm sorry you're going through all this. It is such a confusing journey to be on. I can only speak about my situation (which you've already read about), but what happened to me makes me wonder how many women are walking around with issues that aren't picked up by mammogram. I went to see my plastic surgeon last week (my reconstruction is scheduled for next week) and asked her if she had any idea what mammograms miss. She told me that 10-20% of cancers are MISSED by mammograms. I was really surprised that it was that high. That percentage is pretty scary to me. It seems unacceptable to tell women how important that yearly mammogram is when it actually misses that many cancers. My surgeon also told me that women with dense breast tissue are ENTITLED to request an ultrasound every other year and receive that screening. It isn't typically offered, but it can be requested. In addition, she said the 3-D mammogram was a bit more effective for dense tissue. I can't begin to give you advice, I just know that you need to do your research, think about your options, ask questions, and be your own advocate. Sometimes that means being a bit bossy, but it's your body and your life. You are the one who cares the most about it. I believe the double mastectomy was the smartest decision for me. I didn't want to keep going back for biopsies (I'd had more than enough) and I didn't want the worry (with the 8 precancers found through stereotactic needle biopsies, MRI guided biopsies, excisional biopsies) so I went aggressive. I'm not sorry, considering they did find DCIS in one place. That doesn't mean that is the direction you need to go, but I do think you need to get the facts and go with your gut. Let us know how things go for you. Good luck!",
      "MessageIndex": 608,
      "PostDate": "19/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Oct 13, 2015 06:20PM grandmatexas wrote: linpiz, I hope my post is not what scared you. I think (and I could be wrong) my case is a little different because I have so much going on. Honestly, if they had found one spot of ADH or ALH, I probably would not even considered BMX. Given the fact that the surgeon/radiologists found ADH in both breasts, along with two ALH and an atypical papilloma AND a duct that had been bleeding profusely for almost three months, we decided to be more aggressive. That was a personal decision, something we talked about at length. I hope everything goes well for you.",
      "MessageIndex": 523,
      "PostDate": "13/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Oct 14, 2015 10:43PM grandmatexas wrote: Barteeellis, I'm so sorry you're going through this again. Did they find this in the tissue they removed during your reconstruction? I believe it's important to become informed about everything happening. Atypical ductal hyperplasia (ADH) and atypical lobular hyperplasia (ALH), according to my surgeon, is considered precancer. I've done a lot of reading; it's the only way to know what is going on with my body. You need to arm yourself with information and questions; when you se your oncologist/surgeon you will be better able to weigh all the options they give you. As far as how to proceed, every person is different. Information is power. I can only be responsible for the decisions about my body. Those decisions might not be right for everyone. ",
      "MessageIndex": 528,
      "PostDate": "14/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Oct 7, 2015 05:29PM grandmatexas wrote: I had my excisional biopsies yesterday - three places on the right breast and one on the left. Two of the three on the right had already come back as atypical (atypical lobular hyperplasia and atypical papilloma). The third spot was calcification they were unable to biopsy when they did the stereotactic needle core biopsy. The spot on the left has already been diagnosed as atypical ductal hyperplasia. Yesterday was to get clear margins around the precancer spots (or to find cancer, if it was present). The surgeon also removed the bleeding duct (started bleeding July 12th and has never stopped). So the doctor's office just called. No cancer was found anywhere. The previously unbiopsied spot on the right came back as atypical as well. No cancer! A relief...but at the same time, it almost leave me more confused. This was not one spot on one breast. Four different spots across both breasts, plus a bleeding duct. The breast nurse navigator tells me I'm at a higher risk of breast cancer because of the precancerous cells. I keep thinking that I want to do the bilateral mastectomy to reduce the risk of future cancers. I received two letters today from the insurance company telling me they denied the MRI and the MRI guided biopsy. They told the doctor's office they were approved. I'm worried we may have to pay for those. And if they're fighting the MRIs, they will definitely fight the mastectomies, won't they? I was prepared for a cancer diagnosis. I don't know what to do with this diagnosis and we don't see the surgeon for our follow-up until Monday. I'm sore, I have four incisions in my breasts, and a diagnosis of atypical (ductal, lobular, and papilloma). I've been through three rounds of biopsies, three ultrasounds, several mammograms, MRIs, and numerous doctor appointments. And now, I feel like it's all been a mistake. How serious is the precancer diagnosis? Does anyone do mastectomies because of precancer diagnoses? I don't even know which end is up right now and I have to wait to talk to the surgeon on Monday. Thanks for listening.",
      "MessageIndex": 506,
      "PostDate": "07/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Oct 8, 2015 08:21PM grandmatexas wrote: Thank you, Ddw79 & awb, for your encouraging words. I did call the insurance today and was told whoever handled the claim didn't look closely enough. The MRIs were covered! Yeah. One less worry. I'm confused in the sense that ALH, ADH, and atypical papilloma are all considered precancer, yet they could require medication or other treatments. So, is this a BC diagnosis? Or is it not? I know any of these diagnosis means I have a higher risk of developing BC in the future, but does this risk go up with this many different things going on? Is there an increase in risk if there are issues on both breasts as opposed to one breast? I guess until I see the BS (oncologist) on Monday I won't know what my risk is or what road the oncologist will recommend. And I wonder if I will be satisfied with his suggestions? So much confusion. I'm glad to know there is no cancer, but I'll be happier when I don't feel like I'm in Limbo.",
      "MessageIndex": 509,
      "PostDate": "08/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Nov 18, 2015 11:29PM grandmatexas wrote: Thank you, Ddw. I am a week out from surgery and I actually feel pretty good. Taking very few meds...antibiotics because I still have a drain, half a gabopentin for some nerve pain, and a hydrocodone when I go to bed (some nights). I truly don't have much pain at all unless I'm doing my stretching exercises - that's a bit uncomfortable. I'm told the other drain will probably be removed next Monday. I'm expecting to get another fill in the expanders next Monday as well. Not sure what to expect with that procedure. No regrets. So glad I went with my gut and don't have to rely on the obvious problems of mammograms, MRIs, and ultrasounds, at least in my situation. Hope everyone else is doing well.",
      "MessageIndex": 566,
      "PostDate": "18/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Oct 8, 2015 10:33PM grandmatexas wrote: Thank you so much for all your support.",
      "MessageIndex": 511,
      "PostDate": "08/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Oct 12, 2015 04:18PM - edited Oct 12, 2015 05:48PM by grandmatexas It's me again. I had my follow-up with my breast oncology surgeon today. He explained that he did not find any CANCER, which is a good thing. However, he did not find the papilloma, which is the piece of this whole puzzle that has bothered him from the beginning. I had been bleeding since mid-July; he said the most common cause is a papilloma, followed by cancer. The MRI-guided biopsy found an atypical papilloma and placed a marker. When the doctor did the excisional biopsy, he removed the marker and the area around it, but he could not find the papilloma. He said the hematoma could have moved the papilloma, but it bothers him that he didn't find the source of the bleeding. He explained that with ADH and ALH, the suggested treatment is mammograms every 6 months and estrogen-blocking medication. I asked if the fact that I have both ADH and ALH, as well as an atypical papilloma, would increase my risk in an additive manner or if the risk increased exponentially. He told me that was a really good question. He told us he didn't know of any studies that looked at that. I told him we had lengthy discussions about bilateral mastectomies; seems like with everything going on in both my breasts, waiting for the six-month screenings will be like waiting for the other shoe to drop. I actually felt much better about our decision when he told us if I were his wife they would be having a serious discussion about mastectomies. He said he had never done this many biopsies on anyone and with the different results and the fact that he didn't find the papilloma, he was really concerned about the bleeding. He will be setting me up with a plastic surgeon and scheduling me for the mastectomy and reconstruction. If no cancer is found, there will be no need for any medication. I know it won't be a cake walk, but it has to be better than just waiting for what might show up with every next screening.",
      "MessageIndex": 512,
      "PostDate": "12/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Oct 15, 2015 09:00AM grandmatexas wrote: I think that's a good decision, just make sure you are armed with all the questions you think of while you are waiting to see the ONC. Let them give you the options and then ask about anything they didn't mention. My ONC was good about discussing any questions I had and listening to my concerns. In the end, we made a decision he didn't originally suggest. But he agrees with our decision and even said that would be what he would want his own wife to do. Always ask lots of questions. Good luck and keep us posted.",
      "MessageIndex": 531,
      "PostDate": "15/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Nov 18, 2015 04:41PM grandmatexas wrote: I'm going to repost what I wrote on another board. Some already know my initial journey; others do not. My BMX was done on November 10th and I will say we made the right decision. Thank goodness. My story has been a journey that began on July 12th. I began bleeding from my right nipple, however I had no clue where the blood was coming from. It was apparently light enough that it was dried on my nipple and watered down when I showered. Couldn't figure it out for a week (thankfully, since I was enjoying a vacation with my daughter-in-law in Mexico). When I returned home, I realized the source and the bleeding increased. I bled profusely (dripping on the floor) for three months. I went through a series of tests. I first visited my GYN, who sent me for a diagnostic mammogram. Two calcifications (which they would NOT have checked without the bleeding). Next was an ultrasound, which showed nothing. A stereotactic biopsy of the calcification on the left side (NOT the bleeding side) found an atypical ductal carcinoma (what my doctor called precancer). The calcifications on the right side (bleeding) were too close to blood vessels, therefore that radiologist chose not to needle biopsy. My oncologist decided to order an MRI of both breasts; the bleeding had him concerned and he wanted to investigate that before excisional biopsies. He had to fight the insurance company, but we succeeded. The MRI showed two more areas that needed tested on the right breast. An MRI guided biopsy found an atypical lobular hyperplasia (again precancer) and an atypical papilloma. We proceeded with the excisional biopsies (basically lumpectomies). The excisional biopsies confirmed the three already mentioned atypias along with an additional atypical lobular hyperplasia, and at the same time the surgeon removed the bledding duct (three months was a long time). Our next visit with our oncologist, he told us that usually when an atypia is found, the normal protocol is to take a drug for five years, have screenings every six months, and biopsy anything unusual. Having done an enormous amount of reading, we were aware that would be the initial suggestion. We had looked at the side effects of the possible drugs that would be used. My question to him was, \"If that is your suggestion when you find ONE atypia, what is the normal protocol when you find this many different things across both breasts?\" He clearly had no real answers. He told me that he had never done this many biopsies on one person at one time and found this many things. I informed him that we had been discussing bilateral mastectomies. His response...\"If you were my wife, we would definitely be having that discussion.\" That was enough for us. Move forward a few weeks. We met with our plastic surgeon, whom we loved. She thought we might be able to go straight to implants. She described a fairly new technology called a Spy Test. She used this test to determine the blood flow to the remaining breast tissue. One small section of my breast tissue \"failed\" so she placed tissue expanders. The good news was that by the time surgery was near the end, the blood flow was improving. One week later, double mastectomy was completed, tissue expanders were in place, and we met with the plastic surgeon. One drain was removed - YEAH! Then it was off to visit the oncologist. Everything is healing well, but he informed us that he was extremely pleased that we had chosen the mastectomy. Pathology did find a cancer. It was only .3 cm, contained in a duct (DCIS). Good news because I will not need chemo or radiation. However, we reflected on the fact that several mammograms, ultrasounds, MRIs, and numerous biopsies found NO CANCER. If I had decided to keep the breast, what might the outcome have been? I'm so thankful we chose mastectomy, in spite of the fact that there were a few who felt this was an extremely radical approach.",
      "MessageIndex": 564,
      "PostDate": "18/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "grandmatexa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221394/profile",
      "Content": "Feb 25, 2016 02:20AM grandmatexas wrote: ImnSeattle, I honestly don't think it's too early to wonder about anything going on with your body. I started doing research early (when I first started bleeding). When my doctor finished all my testing (I won't repeat all since you can look back at my posts) he informed me of all the different precancers he found. What he initially said was \"Typically with AN ADH or ALH you are prescribed one of the drugs and we monitor you every six months.\" I asked how my risk increased with the multiple finds on both breasts. He didn't have a definitive answer. When I told him we were discussing bilateral mastectomy, he said if I was his wife we would be having that discussion. I didn't feel like I would have any peace of mind going 6 months at a time worrying about what they might find the next time. I have not regretted my decision. They did find cancer (after many tests only found precancer). The real question is \"What can you live with?\" If you can put it out of your mind and go on about your day, you might opt for monitoring. If, like me, you would stress over it, you may want to choose a different solution. Whatever you decide , talk to your doctor, explain your thinking,and tell him what you want. I know people who were told by their doctor that they were being too aggressive. They persisted and the doctors agreed to do what the patient wanted. Do your research, know what you want and be insistent. Good luck. Grandmatexas",
      "MessageIndex": 613,
      "PostDate": "25/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    }
  ]
}