{
  "AuthorID": "gravity",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112324/profile",
  "Posts": [{
    "AuthorID": "gravity",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112324/profile",
    "Content": "gravity wrote: I'm 34 years and hadn't had a physical exam or clinical breast exam for over 2 years and have not been in the habit of doing self exams - mainly because I have large breasts that are lumpy and I really have never known what kind of lump to feel for. 2 weeks ago I went to a new gynecologist who did a breast exam. Before starting he brought out a silicone breast with simulated abnormal and cancerous lumps in it. He basically had me lay down and placed the silicone breast on top of mine and told me to memorize what those lumps felt like so I would know if I felt anything like that I needed to get into the doctor right away. Then he guided my hand for a self exam because his opinion is that I will know my breasts better than any doctor can so self exams are the best form of early detection. While doing the self exam I felt two areas that were similar to what I felt in the silicone breast. My doctor then felt those areas and was surprised that they did in fact feel similar - on the inside of my left breast there is quite a large section that feels like gravel basically, but none of those little lumps had pointy or sharp edges - more like a bunch of pebbles; and also on the under part of my left breast there is a really hard long lump (about 6cm X 2cm) - it feels like it has a square edge almost, there is no roundness to it anywhere, it's slightly tender (could be how hard it was being puched on though) and stays pretty well in one spot - it doesn't even slip under my fingers. He kept feeling back to the silicone breast and then to mine, then checked my right breast - he said he could feel a little of the same pebbled textured in my right breast so thought that likely it was just how my normal tissue felt. Since I have to be back there in a month for the results of some unrelated blood work, he said he'd check it again at that time. The more time that passes the more I wonder what it is and keep checking those spots for changes. What nags on my mind is that I also have 3 swollen nodes on the left side of my neck that have been there for at least 18 months, one has grown slowly over that time (but they are all relatively small), I also have two of about the same size behind my collarbone on the same side which have been there for the same length of time and a large one closer to the back of my neck  where my neck meets the trapezius muscle that a massage therapist pointed out about 4 months ago. Since poking around my breast more lately I have also come accross 3 little lumps on the outside edge of my left armpit - but they feel like they are almost strung together if that makes any sense. None of these lumps are at all tender. I haven't thought much of any of them because I have systemic lupus and swollen nodes are common with that. But now given the breast exam I'm wondering if they are somehow connected. My question is if, when I go back to the gynecologist in 27 days, if I should be asking for a mammogram rather than another clinical exam? Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "29/10/2010",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760031",
    "Title": "Should I Ask for a Mammogram? gravity CoolBreeze"
  }]
}