{
  "AuthorID": "graytp",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54070/profile",
  "Posts": [
    {
      "AuthorID": "graytp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54070/profile",
      "Content": "May 13, 2009 04:39PM graytp wrote: Good luck with your procedure...mine was at the bad end of the spectrum with 3 hours on the table and not enough lidocaine. Then they hit an artery.I am not trying to scare you but do take someone with you...I was not able to drive home or even cook dinner. I ended up having double mastectomy and the surgical procedure was easier than the mammotome biopsy. Some people have good experiences and some have bad experiences...just have someone to take you home in case things do not go as planned. Good Luck...this time tomorrow it will be over....I have my 2 year anniversary this Friday...time flies!!!!",
      "MessageIndex": 6,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733999",
      "Title": "Mammotome on Thursday mmb1 mmb1"
    },
    {
      "AuthorID": "graytp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54070/profile",
      "Content": "May 14, 2009 09:25AM graytp wrote: Good luck...on May 15, 2007, I had both breasts removed for DCIS in the R breast....they found it in the left breast after it was removed. I did not do any recon and I have been happy using my silicone breast forms that go in a bra. At every MD appointment I am asked if I want to do reconstruction. I was happy to have a 4 week recovery and to move on.  It might not be for everyone, but my breasts were small and without cleavage....they do not look different under clothes...and just this morning, a good friend bumped into me and commented on how real they felt. Sleeveles dresses can be a problem for the scars under my arms, but strapless dresses are often cut higher and look better. I hope that you have a quick and healthy recovery!!",
      "MessageIndex": 17,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732468",
      "Title": "waiting for surgery rebilla rebilla"
    }
  ]
}