{
  "AuthorID": "GreenEyedGi…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201866/profile",
  "Posts": [
    {
      "AuthorID": "GreenEyedGi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201866/profile",
      "Content": "Jun 22, 2014 04:38PM GreenEyedGirl1966 wrote: OMG...Another person who has experianced the \"sloshing\" sound.  Thank you for sharing your story & letting me know that I am not the only one.  I had two lumpectomies on 06/11 and first heard the \"sloshing\" sound on 06/19.   I was directed to the Urgent Care where they aspirated 240 cc (about a cup of fluid) and woke up the next day to the same sloshing sound.  Of course it is the weekend, and of course I can't reach my doctor, but I am finding comfort in knowing others have experianced this really unnerving sound.  I am going to follow up with the doc tomorrow, but it sounds like this maybe something I just have to deal with.",
      "MessageIndex": 4,
      "PostDate": "22/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/820325",
      "Title": "Had 2 lumpectomies - now hear sloshing? MakeLemonade Morwenna"
    },
    {
      "AuthorID": "Greeneyedgi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277368/profile",
      "Content": "Oct 11, 2018 08:58AM Greeneyedgirl72 wrote: My mother is newly diagnosed HR+/HER2-ILC colon(yes, really) METS and had enrolled in a trial for letrozole and verzenio + a study drug (its a PI3K for the lab-savvy among us) and I'd been following this thread hoping to find others on the letro/verzenio combo at some point. The research team says they're getting good results, which is great. Mom has had a terrible time with the Verzenio, though, which has been disheartening. She got upside down with the diarrhea (and nausea later) right away and never could get ahead of it with Immodium (we never figured out the right system/timing), so after 10 days on that med combo, she ended up in the hospital for nine days with kidney failure from severe dehydration. On the 4th day she was doing much better, was to be discharged the next day, but instead her BP bottomed out after a big BM and heart rate shot up to 190, followed by atrial fib that had to be corrected after four more days via cardioversion. Oh, and they found a big clot in her leg right before that procedure. Sooooooo.......now she's home and doing much better, but very concerned about treatment. She's been back on the letrozole for several days but after one day back on Verzenio at a reduced dose (50 down from 150) the diarrhea unnerved her (preserving her electrolyte level is high priority) so she is having second thoughts about continuing with the verzenio and the trial. She didnt take any Immodium with it at all, and I reminded her a lower dose could be more tolerable/manageable, but didnt mean the diarrhea would go away. The other complicating factor here is a small section of her colon that has narrowed d/t METS, so a bit of diarrhea is useful in her case. Sorry to be the first response to your drug combo shout-out and have a harrowing story to go with it! Maybe more will find us with the thread bumped and have insight for us both. Don't forget, the research doc told us they ARE seeing good results with letrozole and verzenio, and moreso with this 3rd drug they're studying.",
      "MessageIndex": 2,
      "PostDate": "11/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867646",
      "Title": "Verzenio vs Ibrance Whyus2018 pajim"
    },
    {
      "AuthorID": "Greeneyedgi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277368/profile",
      "Content": "Oct 11, 2018 09:04AM - edited Oct 11, 2018 09:04AM by Greeneyedgirl72",
      "MessageIndex": 3,
      "PostDate": "11/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867646",
      "Title": "Verzenio vs Ibrance Whyus2018 pajim"
    }
  ]
}