{
  "AuthorID": "greenpeace",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157118/profile",
  "Posts": [
    {
      "AuthorID": "greenpeace",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157118/profile",
      "Content": "Aug 4, 2014 04:29AM greenpeace wrote: hi I am writing because my doctor has suggested I get a hysterectomy. I opted last year summer to have the UAE due to large fibroids. It was partially successful but did not shrink them. I am 44 and apparently not going to have children. I go back to the radiologist next week and he probably won't say much. Apparently a myrmectomy is no longer option. I took the brac test and it was not conclusive.  So I am not sure if I should leave the ovaries if I have the surgery. My BC surgeon did not recommend I remove them. I can also also wait until menopause whenever that is for bleeding to lessen. Sigh. I really don't know what to so. The long.. Heavy cycles is nerving to say the least. I can't believe I am so hesitant after having all this other stuff happen.",
      "MessageIndex": 15,
      "PostDate": "04/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "greenpeace",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157118/profile",
      "Content": "Aug 7, 2014 04:46AM greenpeace wrote: glennie19 thanks. Yeah I have asked my Breast surgeon about recommendations for doctors. I have no idea what the average age of menopause my mother had a hx too. Anyway exhausting to think about surgery again. I don't know what my levels are really.  Sigh . Thanks ",
      "MessageIndex": 25,
      "PostDate": "07/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    }
  ]
}