{
  "AuthorID": "gretchvr",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111443/profile",
  "Posts": [
    {
      "AuthorID": "gretchvr",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111443/profile",
      "Content": "Oct 22, 2010 02:33PM gretchvr wrote: I found that taking glutamine powder (10-20 grams added to a smoothie or beverage) really helps for neuropathy.  I was on chemo for the past 9 months (Taxol, Avastin, Carboplatin, Adriamycin, Cytoxan) and never had any neuropathy problems.  The Keith Block book Life Over Cancer has a great section on chemo side effects and recommendations.  Its a great resource, has good sections on diet, lifestyle, treatments.  Gretch",
      "MessageIndex": 1,
      "PostDate": "22/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759727",
      "Title": "SE's - sharing what works for you PJB jleigh"
    },
    {
      "AuthorID": "gretchvr",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111443/profile",
      "Content": "Oct 20, 2010 02:04AM gretchvr wrote: I know how you feel, and the overwhelmingness of Stage IV at first!  My oncologist assured me that \"no one dies from bone mets\", and that helped me out, along with staying active, meditation, good diet, and lots of good friends and family support.  I had bone mets for 4 years (started out with 4 scattered  locations ), it was stabilized by hormonal treatment (Arimidex) and had a normal, active life.  Everything was wonderful! Now I long for those days, as it moved to my colon/liver/ abdomen last year, and things are a little more challenging.  Yes you can have it good for a long time, keep the faith- Gretchen ",
      "MessageIndex": 6,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759538",
      "Title": "Really need to hear optimistic stories Dorit dianemom2"
    },
    {
      "AuthorID": "gretchvr",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111443/profile",
      "Content": "Oct 19, 2010 04:44PM gretchvr wrote: Hang in there!  I am at 5 years with IV, original dx was 1998, recurrence in 2004, bone mets 2005. Have had ductal, lobular and inflammatory, tried them all! The homonals workied great (after ovary removal) for 4 years, mostly on Arimidex- great stuff!  It progressed last year to abdominal tissue, colon and liver, and I tried chemo for the past year, no fun!  After 8 months on chemo I am taking a break and living life to the fullest.  Plan to be around for awhile, you can do it!    Love the shirts, I think I need one of those- Gretch",
      "MessageIndex": 64,
      "PostDate": "19/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757548",
      "Title": "WANTED: STAGE IV FIVE YEAR SURVIVORS! MCTHO eag1954"
    },
    {
      "AuthorID": "gretchvr",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111443/profile",
      "Content": "Jan 13, 2011 06:06PM gretchvr wrote: Elizabeth, I love your sense of humor, keep it going, yes it can heal!! And so can sun and blue water and cabana boys.  Forget the friggin scans for awhile, and enjoy!! Hugs and love, Gretchen",
      "MessageIndex": 32,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763333",
      "Title": "Just when I thought things were getting better... konakat Marple"
    }
  ]
}