{
  "AuthorID": "Grits713",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191314/profile",
  "Posts": [{
    "AuthorID": "Grits713",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191314/profile",
    "Content": "Nov 5, 2013 12:01PM Grits713 wrote: I am new to this forum and to community forums in general. I am having surgery on December 3rd (I think - it's either then or Dec 10th.) 2013. I was diagnosed in June of this year. Stage 3B with skin and lymph nodes involved. Sentinel Node Biopsy did not work so the Doc took a lymph node when she went in to install my port for chemo. The lymph node she took had cancer in it. So now I have been through 5 chemo treatments and have the 6th and final tomorrow. The chemo at first appeared to be shrinking the tumor but now that we are approaching the end of the chemo - it did not shrink it much and the skin is very red again (it looked as if it had gone away from the skin at first). So the doc says that what she feared my cancer was at the beginning appears to be what it is - Inflammatory. I am HER2 neg and have not had any genetic testing as there is no family history of breast cancer. I had great-aunts - one on Dad's side and one on Mom's side who had ovarian cancer. Anyway - on to the surgery - The Doc says I have to have a mastectomy of my right breast but that it is not necessary to take the left breast. I am leaning towards having the left one removed also because I don't want to go through this ever again if I can help it. and because the skin is involved with the right one - there is no chance to save the skin so reconstruction will not happen until after radiation and healing (Doc says 6 - 12 months down the road). I am also afraid of something happening that would prevent me from having reconstruction on the right one and then I am left with one breast and wearing a prothesis just because if I don't it will show that I only have one. I just wanted to see what some of you all had been through and though you are not doctors I wondered what you all thought about taking both breasts instead of just one at this point. Thanks, Grits713",
    "MessageIndex": 86,
    "PostDate": "05/11/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
    "Title": "November 2013 surgeries mimi32 MCbeach"
  }]
}