{
  "AuthorID": "grover",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173606/profile",
  "Posts": [
    {
      "AuthorID": "grover",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173606/profile",
      "Content": "Apr 4, 2013 08:38AM grover wrote: Marymoir, I know you didn't share your story to alarm anyone, but that's MY nature...and I've learned from my experience w BC that thinking the worst is in my best interest in terms of getting things done! My shoulder on lymph node side hurts pretty bad & no rads yet. Have had PT 3 times, & she has slowed down bc of my pain after sessions. So my paranoid question: had you had a PET and/or CAT scan which finally showed the mets? Praying you're doing well with treatment and it all clears up:)",
      "MessageIndex": 8,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/802321",
      "Title": "Shoulder Blade Pain alilou7497 shodali"
    },
    {
      "AuthorID": "grover",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173606/profile",
      "Content": "Mar 24, 2013 05:39PM grover wrote: No lie, this is the scariest experience of my life and every once in a while I look at my situation & wonder when I'm gonna wake up from this! But it's not only true that what doesn't kill you makes you stronger, EVERY test, waiting period, new piece of info. ( and treatment, IF needed!) makes you stronger, too! But I agree: try to step back & wait...praying you get GOOD news, but no matter what the diagnosis or even if you just have to be checked more often, I'm sure you will be able to find support & encouragement somewhere on these discussion boards. This has been one of several silver linings I've found since being diagnosed:)",
      "MessageIndex": 3,
      "PostDate": "24/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/802240",
      "Title": "New and Nervous, trying not to freak out. HotPinkMess FilterLady"
    },
    {
      "AuthorID": "grover",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173606/profile",
      "Content": "Mar 27, 2013 09:40PM - edited Mar 27, 2013 09:41PM by grover I know it's a bit further, but I come all the way from the OC Maryland area to the University of Md Med Center ( UMMC) Greenbaum Cancer Center. My experience has only been with breast cancer, but I get the impression they All work the same way- together on your treatment plan, take as much time as you need with you, and are easy to get in touch with. I also feel like a university hospital is up on all new research. Johns Hopkins would be another, & I have heard great things about GBMC ( Greater Baltimore med. Center) and Mercy Hospital. In the recent national hospital ratings, Johns Hopkins ranked #3, UMMC #11. I think the next closest top 20 to us was NY. Something to think about if you'd have help with transportation. Everyone pretty much agrees that having drs. you feel confident & comfortable with is crucial, so I wish you the best in finding that for yourself.",
      "MessageIndex": 1,
      "PostDate": "27/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802385",
      "Title": "Washington DC area oncologist recommendations? VeganNicole Marl5900"
    },
    {
      "AuthorID": "grover",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173606/profile",
      "Content": "Apr 9, 2013 04:01AM grover wrote: Skigirl, you have a beautiful head! I loved sinead O'Connor, & wish i COULD rock the gi jane look! My hair is so thin I've always hated it, but the closer i get to losing it, the more I'm appreciating it! Hoping it grows back THICK. I have never heard of chemo class!?",
      "MessageIndex": 151,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "grover",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173606/profile",
      "Content": "Apr 17, 2013 11:00AM grover wrote: Up for third time tonight and can't get back to sleep, so of course I go to the place where everybody may not \"know your name\" but they certainly know what you're going through! I,too, have a difficult time keeping everyone straight, but feel bad not responding to at least some posts directly. I think we above everyone else u understand we do what we can, and sometimes there are people or posts that connect us and warrant response. So, I know I'm way behind, but prep for chemo has had me busy physically and drained mentally and emotionally... Heather- after my dx for rt. breast, my surgical onc. assured me that success & recurrence rates for my type were equal for mastectomy & lumpectomy w rads, so decision was mine. Knowing my worry level, I was leaning toward BMX, and several women I talked with confessed to wishing they'd had both so they'd 1) \"match\" better & 2) reduce testing & worry involved with remaining breast. Then, a small tumor was found in my left breast in an mri a couple weeks after I got rt.diagnosis. I think I was even pretending to myself that result of genetic test would decide me, but it wasn't long before I caught myself saying I would probably opt for BMX regardless. I didn't have either BRACA gene but prob. still some genetic link. My only regret related to BMX is this: I wish I was thin because then I would not be so disproportionate and would have considered no recon. I'm hating expanders & will have them almost a year. Sorry to ramble... Kobrien- I totally am feeling same about this s@;!. Case in point, I normally am not a \"cusser\" but finding myself having to bite my tongue around my kids! It's just seeming like TOO MUCH, NEVERENDING CRAP! I already have lymphedema starting, depite taking all the steps I could to prevent. Had it wrapped by PT ... NOT fun. Started chemo today. Three hours after scheduled, as if I needed more time to stress. Actual process wasn't bad w port. SEs starting already?? Can't sleep, DRY mouth, belching & trapped gas feeling, feel hot & cold at same time. Took Claritin to prevent possible pain from Neulasta tmrw. Need for allergies anyway, so no harm. Thanks to all for your honesty and being there. Hope we all find ways to make peace w our changing images, and keep SEs at minimum. I have moments of \"really? Are You sure?\" but truly believe God doesn't give us more than we can handle. Sooo.... we must be some of the strongest people on earth;)",
      "MessageIndex": 374,
      "PostDate": "17/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "grover",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173606/profile",
      "Content": "Apr 17, 2013 02:06PM grover wrote: Dede, just seeing your post clearly now. Some advice a friend a year ahead of us gave me- because the entire follicle comes out, she recommended not shaving to the skin, but leaving like an inch (I know, not the dream cut!) and letting that last bit come out on its own. Otherwise it can get very stubbly and sensitive, with bumps possibly. Whatever you do, best of luck! I got mine cut very short for first time in life Friday, and I've already gotten used to it. At least we should have some coverage back by winter cold! That's as positive as I can be right now, as ive never looked good in hats and i have a big \"banana head!\" I will just have to prove beauty comes from within. I guess that means i have to be positive?! :)",
      "MessageIndex": 376,
      "PostDate": "17/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "grover",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173606/profile",
      "Content": "Apr 9, 2013 02:47PM grover wrote: I got a lot if info from my MO, but no mention of a \"class.\" I did see a genetic counselor. And there's a local support group that provides just about everything else, so I think I'm in good hands. BeHereNow, Besides being SO true, your metaphor of the sea is so poetic! I'm an English teacher, and this would make a GREAT poem!",
      "MessageIndex": 160,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "grover",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173606/profile",
      "Content": "Apr 9, 2013 03:52AM grover wrote: BeHereNow, Thanks for starting this thread...I guess it's time I join, as I start chemo April 16. Port going in on 15th. I've been avoiding thinking about chemo other than my shopping list, and planning short hair cut day with 2 younger sisters. Reading about it makes me nauseous, but I'm more scared right now about port, since I don't feel like there's room above my stupid TEs, and I'd rather be under anesthesia totally for any procedure involving cutting my skin! Kobrien, coincidence- my name is Keri & I had bilateral mastectomy w expanders a day after your surgery.Sucks! So sorry for those of you fighting this a second time! Your stories, honestly, are scary, but your courage & advice are inspiring.",
      "MessageIndex": 150,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    }
  ]
}