{
  "AuthorID": "gshoemate",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
  "Posts": [
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Sep 25, 2007 01:04PM gshoemate wrote: Yes, it does suck but you will get through it.  I had 4 AC's and it was terrible.  Treatment on Monday, I would sleep from Tuesday after Naulasta until Thursday night sometimes Friday morning.  But the following week I would feel better.  I got tired easily but I was able to return to work.  I am now on taxol and it is much easier. Just listen to your body and rest when you need to.  It will get better in time. Ginger",
      "MessageIndex": 7,
      "PostDate": "25/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692588",
      "Title": "are there ANY good days? Methusala gshoemate"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Sep 17, 2007 04:37AM gshoemate wrote: Wow, have I been there and still have days when I don't handle it well and I am 4 months post-op.  My husband saw my scar before I did and he was nothing but supportive.  I still have days where I have a hard time looking in the mirror and I have one of those \"I want my old body back\" moments.  Thats when my husband calms me down and puts things back into perspective by telling me \"you don't want your old body back, it was sick and could of killed you\".  I think with time our minds will heal with our bodies.  I look in the mirror now and see one breast, one scar, my port sticking out and a bald head.  I just know a year from now I will see a differant person staring back and I will also have my life.  Best of luck and if you ever need to talk, feel free to PM me.  It helps to talk. Ginger",
      "MessageIndex": 11,
      "PostDate": "17/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/692116",
      "Title": "accepting body after surgery 3boys4me janniexy"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "gshoemate wrote: Just got a call at work today from my family physician's office. They got the results yesterday and want me to come see the doctor today to go over them. I'm a bit freaked out but I guess it has to be done. Now if I could just stop shaking I would be alright. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/589003",
      "Title": "Well, looks like onto the next step gshoemate cindiedee"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "gshoemate wrote: Boy, I didn't think chemo was going to interfere with my life this much. My son had to get his shots yesterday for school and it didn't even hit me until he got home that it could effect me. So I called the onco. office in a panic and they told me to call the pediatricians office and find out if any were live viruses. Well, one was...MMR. They told me there is a 7-14 day period where he can break out from the shot and I should call my onco. back to find out what to do. So I call them back and all they told me was to keep my distance, don't let him cough on me and don't use the same bathroom. So, does anyone else have any experience with this and suggestions on what I should do. I don't know if I should move out for the next 2 weeks or what, I just don't want to end up in the hospital with an infection of any kind but I also miss hugging and kissing my baby. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/658713",
      "Title": "5 year old just got immunizations...help gshoemate gshoemate"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Oct 2, 2007 05:58PM gshoemate wrote: Before this whole bc thing I had such a sweet tooth but since starting chemo, sweets taste weird and i'm all about the salty.  I had such a craving for a specific chip that my husband had to order them online because I couldn't find in Florida...what a sweet hubby. At this point, I would say eat what sounds good to you, it's better then not eating at all which is what I did on AC. Ginger",
      "MessageIndex": 4,
      "PostDate": "02/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/693110",
      "Title": "Craving crunchy salty chips after chemo trigeek kagaines"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Oct 13, 2007 07:01PM - edited Oct 13, 2007 07:04PM by gshoemate You have found a place with a bunch of loving sisters. I started my journey in April when the radiologoist doing the ultrasound basically told me I would be losing a breast to cancer.  I thought my world was going to end, but here I am 6 months later and I have come further then I ever thought I could.  I had my right breast removed, just finished chemo (and i'm as bald as a baby) and will start radiation in the next month or so.  Cry when you need to, it does not mean defeat, it means your human.  This is such a roller coaster of a ride, you will need to get those fears out.  When you have your path report and you know more details you will feel more in control, and believe me, control is a good thing.  My first thought was to hide my fear and tears from my husband and children, I would cry in private, but that wasn't good for any of us and my husband felt like I was pushing him away.  You can be tough when you need to be, but you also need help, support and to vent.  Come here often and ask any question that comes to mind, these ladies are amazing.  I would also suggest reading Crazy Sexy Cancer by Kris Carr, it is a very inpirational book and has helped me stay positive and focused.  It may also be helpful to ask your doc for xanax for the anxiety.  I would of been lost without my xanax. Best of luck to you...sending hugs your way. Ginger",
      "MessageIndex": 3,
      "PostDate": "13/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/693768",
      "Title": "Just Holding the Tears Back just4me Fireweed"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "gshoemate wrote: We go on our cruise on June 14th and then the next step in my journey will be June 18th. I'm assuming that on the first visit it's more of a consult, there not going to start chemo right away....or am I wrong? I feel down again. I was just getting to the point of accepting the fact that I have breast cancer and then I will forever be lopsided since my mastectomy (wish I would of gone for a bilateral) but now I'm feeling down about this next step. I'm trying to go into it with the \"I can live a normal life\" while on chemo but I have been reading way to much on here about how chemo affects people and it has me terrified all over again. I almost called into work this morning because I was having major anxiety issues, thank goodness for xanax. Thanks for letting me vent. Right now i'm going to focus on packing for my upcoming Disney cruise and just enjoying life until that next step happens. Thanks again. Ginger Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/620953",
      "Title": "Just made my first oncology appointment gshoemate ptesinge"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Sep 4, 2007 02:33PM gshoemate wrote:",
      "MessageIndex": 2,
      "PostDate": "04/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/690923",
      "Title": "Please....not again gshoemate HollyHopes"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Jun 19, 2007 08:01AM gshoemate wrote:",
      "MessageIndex": 8,
      "PostDate": "19/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/636105",
      "Title": "yup, it's cancer Methusala figsgirls"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Jun 20, 2007 04:54AM gshoemate wrote: GMG, whats procedures have you had done so far? They told you it was cancer but how did they determine it? Have you had a biopsy yet? I also you a PM yesterday.",
      "MessageIndex": 14,
      "PostDate": "20/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/636105",
      "Title": "yup, it's cancer Methusala figsgirls"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "gshoemate wrote: Went to the surgeon yesterday and he wants to do a ultrasound guided core biopsy and remove all 3 masses....no argument here, I just want those out. He tried to get me in soon but due to some issues at the hospital that he works with, he can't get me in until May 4 (but will call if there is a cancellation) I felt really comfortable with this surgeon and felt he was going at this aggressivly. Here's my problems....the gals at work today decided to have an intervention on me. They think the 10 days is to long to wait and I should be spending this time getting a second opionon. I honestly don't have the energy to find another surgeon, by time they get me in it will be close to the 4th anyways. I was feeling a bit postive yesterday but now i'm down in the dumps again. I was just happy to finally have a date on this but now I don't know what to do. Is 10 days to long to wait? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/593238",
      "Title": "Is 10 days to long? gshoemate Shirlann"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "gshoemate wrote: I've had 7 rads now and things seem to be going good.  About 2 days ago I woke up and it hurt to move my fingers.  It was almost like se that I had from taxol.  They were fine during the day when I was using them but when i'm not using them they get stiff.  Now on the side that I am getting rads my arm hurts from the elbow down to my fingertips.  Could this be a se from rads?  Thanks Ginger Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/695600",
      "Title": "Sore arms and fingers..SE from rads??? gshoemate Binney4"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Jun 21, 2007 08:44AM gshoemate wrote:",
      "MessageIndex": 22,
      "PostDate": "21/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/636105",
      "Title": "yup, it's cancer Methusala figsgirls"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Aug 23, 2007 04:42PM gshoemate wrote:",
      "MessageIndex": 12,
      "PostDate": "23/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "gshoemate wrote: O.K., I'm sitting here in a panic. May 4th I was diagnosed with IDC in the right breast. Had a rb mastectomy on May 9th, had PET and MRI in June and started chemo in July. I have 3 treatments left of Taxol then radiation. Here's my problem, I have pain in my left breast and I am so scared it is cancer. I can't feel any lump but my breasts are dense. The pain is very low, right where my bra comes across. At first I tried to tell myself that I was having some hormonal issues and breast tenderness because it started around the same time my period was supposed to start (but my period never came). The pain comes and goes, it's not consistant. Is it possible that I have a growth since my PET scan (which was clear except for some glowing nodes)in July? I know I have to mention it to my oncologist but I am terrified. I think I need a xanax!!!! Ginger Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/690923",
      "Title": "Please....not again gshoemate HollyHopes"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "May 21, 2007 09:33AM gshoemate wrote: I just had a RB mas. almost 2 weeks ago. At the time of surgery they did the SNB with dye and removed 3 nodes and all were positive. My surgeon decided that he was not going to go back in and remove the remaining nodes. Instead I will be having both chemo and radiation (before it was going to be just chemo). He has been a wonderful surgeon and I trust his decision. When I go to the oncologist I will also asks them their opionion on this.",
      "MessageIndex": 3,
      "PostDate": "21/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/614346",
      "Title": "Axillary node biopsy after bilat-mast & SNP? kath11 gshoemate"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "gshoemate wrote: My oncologist gave me a paper with information on how it helps with taxol but it doesn't say how many days prior I should start or how many days after to continue with it. Any suggestions? Thanks Ginger Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/681291",
      "Title": "When do I start the L-Glutimine? gshoemate dville"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "May 13, 2007 03:26PM gshoemate wrote:",
      "MessageIndex": 37,
      "PostDate": "13/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/602729",
      "Title": "Panny : are you out there? moogie Weimarmom"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Sep 25, 2007 02:22AM gshoemate wrote: Hi Mary Jo, I would describe my experience with Neulasta as he**.  My nurses told me it would feel like flu symtems but it is much worse.  I told my Oncologist's nurse today all the problems I was having and she said that I could skip the neulasta my last 2 treatments but my doc nixed that since the last person she told that to ended up with a high fever.....I was so bummed.  I have pain in my hips, arms and my underarm area where the nodes were taken out feels like I just got out of surgery.  I did hear a nurse tell a patient that was getting her first treatment that the neulasta shot will effect areas that you have had previous troubles with.  So if you have had issues with painful joints in the past...the neulata will effect that area.  Give it a few days and see if you feel better.  I'm sure it all has to do with the neulasta...it's evil I tell you...evil. Ginger",
      "MessageIndex": 1,
      "PostDate": "25/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692690",
      "Title": "is this Neulasta bone pain? bluewillow one_special_angel2006"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Oct 25, 2007 08:52AM - edited Oct 25, 2007 08:52AM by gshoemate Hi Barbara, just a quick message, i'm on my way out the door for my first visit with the radiologist to discuss my radiation route.  But I just wanted to tell you to not let cancer change who you are.  I had some friends that did not think I was taking it seriously because I was not curling up in a corner hiding from the world.  I was still doing my daily stuff and still laughing and joking, that is who I am and cancer will not change that.  There is a beautiful young girl that was dx with rare stage IV cancer and she is changing the way cancer is viewed, she even had a doc. on TLC called Crazy Sexy Cancer, she has a book and was on Oprah this week.  She is living life, not living cancer and that is what we all have to do. www.crazysexycancer.com Please let us know when you meet with your docs and find out more info. Ginger",
      "MessageIndex": 38,
      "PostDate": "25/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/694106",
      "Title": "Why am I not upset? Barbara1 Mary-Lou"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "May 4, 2007 03:09PM gshoemate wrote: Well, looks like I am off to the just diagnosed board. All 3 lumps were cancerous and I am now panicked and terrified. I go in Monday to discuss the next step which is removal of the breast. Looks like my journey is beginning.",
      "MessageIndex": 5,
      "PostDate": "04/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/602028",
      "Title": "Core biopsy went well, now more waiting gshoemate gshoemate"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Jun 30, 2007 08:33PM gshoemate wrote:",
      "MessageIndex": 2,
      "PostDate": "30/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/645022",
      "Title": "What do you do? chemo? masectomy? hunh? Methusala figsgirls"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "gshoemate wrote: The waiting is going to drive me nuts. The biopsy went well, he removed 2 lumps and then half of the 3rd lump. They said they couldn't remove all of it because it was to solid....so I am concerned about that. I did good until it was all over then I almost passed out. Gave them a bit of a scare, my blood pressure dropped to 80/40 so they kept me there and gave me fluids and crackers. In a bit of pain today but I am glad to have most of the lumps out. Will be calling the doctor this afternoon and hopefully it will be good news. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/602028",
      "Title": "Core biopsy went well, now more waiting gshoemate gshoemate"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "gshoemate wrote: Well that didn't go as well as I had hoped. They found 3 lumps and once is 3-4 inches (thats the one they are concerned about). And it looks like 2 lymph nodes. My doctor wants me to prepare for the worst meaning removal of my breast and chemo. He said he is very concerned. He said that I will be into a surgeon by next week and will be having a core biopsy....yeah needles (I had 2 children natural childbirth due to my fear of needles). So.....one day at a time right. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/589361",
      "Title": "Next step....surgeon gshoemate gshoemate"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "May 6, 2007 03:27PM gshoemate wrote: Thanks everyone. It has been the worst weekend ever. I have felt every emotion possible and am drained. I have avoided the outside world, the housework and the shopping. Spent way to much time sleeping but that is the only time the panic doesn't take me over. I need to learn take it day by day but it is easier said then done. Hopefully I will know more tomorrow when I meet with my surgeon. He's a very take control guy so I think this is all going to happen very fast. Good thing I cancelled 2 upcoming vacations. Thanks for all the kind words everyone, you have no idea how it helps. I know no one that has gone through this and even though my husband is 150% there for me, he can't understand some of the thoughts and concerns going through my head. I don't think I would stay sane without you guys.",
      "MessageIndex": 12,
      "PostDate": "06/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/602028",
      "Title": "Core biopsy went well, now more waiting gshoemate gshoemate"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Sep 5, 2007 07:33AM gshoemate wrote:",
      "MessageIndex": 1,
      "PostDate": "05/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/690382",
      "Title": "Expsure to Strep Infection: Danger? Indigoblue Indigoblue"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Jun 12, 2007 04:41AM gshoemate wrote: I don't have any signs of lymphodema but I do notice that I have elbow pain. It feels like I hit it on a hard surface and it just aches.",
      "MessageIndex": 1,
      "PostDate": "12/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/630462",
      "Title": "Aching elbow juliehere BMD"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "May 4, 2007 12:41PM gshoemate wrote: Thanks Marin, he said they should have them back this afternoon so I am leaving work early to go home and call. He said if they don't have them in today, he will find a way to get them to me this weekend. Yeah, it concerns me that they left half of the one in......it must not of looked good while removing the samples. Going to take some xanax now to get my nerves under control.",
      "MessageIndex": 2,
      "PostDate": "04/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/602028",
      "Title": "Core biopsy went well, now more waiting gshoemate gshoemate"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "gshoemate wrote: Well, tomorrow is my core biopsy and it has just hit me and I feel sick. I have been able to put it out of my mind the past week but with it happening tomorrow, I am now terrified. My Birad was a 5 for 2 lumps and the 95% scares the heck out of me. I should be glad that they are removing my lumps tomorrow and then I will know for sure but thats what scares me so. Sorry, it was either vent here or cry at work......thanks for listening. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/600179",
      "Title": "Core biopsy tomorrow and the panic is here. gshoemate awb"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Oct 21, 2007 05:28AM gshoemate wrote: Hi Barbara, I am sorry that you have had to join our group but you will find the greatest support here. When I went for my mammogram and my ultrasound the radiologist was very serious, told me after the ultrasound that if the surgeon said they could save my breast get a second opionon.  He was also oh so serious.  Come to find out, it wasn't his job to tell me anything.  Even though he was right and I did lose my breast, you don't know anything about the lump found until the biopsy is done, then you will know how to fight this.  Once I met with my surgeon he went with a core biopsy, found 3 lumps (but they were somehow all joined so they were really 1) so a mastectomy was the next step.  I have never been told my stage, my docs don't believe in it because there is no such thing as a percentage of survival when we are talking about 1 person, it's 100% or nothing.  But from all my results I would say I was a stage 3.  Wait until you get your results before thinking about the next step.  Just take it one step at a time. Ginger",
      "MessageIndex": 15,
      "PostDate": "21/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/694106",
      "Title": "Why am I not upset? Barbara1 Mary-Lou"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "May 5, 2007 03:22PM gshoemate wrote: Panny, I can honestly tell you that I know how scared you are. I got the news yesterday that I have breast cancer. I need to have one breast removed. I am scared, I am nervous but I feel better knowing for sure what is going on in my body and know that soon will have a game plan of how to fight this. You can't fight what you don't know. Once you get to the doctor, find out what your up against, it will be easier to handle. And having the attitude that your going to die is not good for you. You need to switch that around, and fight with everything you have. Who knows, you may have nothing to fight against. But you won't know until you take that first step.",
      "MessageIndex": 5,
      "PostDate": "05/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/602729",
      "Title": "Panny : are you out there? moogie Weimarmom"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Apr 20, 2007 10:25AM gshoemate wrote: Well I got a call first thing this morning from my doctor and they have me tentativly scheduled with the surgeon on Thursday but they may call sooner to have me come in. So I am trying to take it one day at a time but am concerned at how fast they are moving this along. My mind wonders and tells me that things look pretty bad if they are rushing this along so fast. I picked my films today and got to read my results and what concerns my doc the most is that the lump they are concerned about has linear-branching which I guess is a real bad thing. So I guess now I just sit and wait...which is the worst part. I think I'll take my kids to Disney World tomorrow and pretend to be a kid again and take my mind off it all:)",
      "MessageIndex": 5,
      "PostDate": "20/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/589361",
      "Title": "Next step....surgeon gshoemate gshoemate"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "May 7, 2007 10:22AM gshoemate wrote:",
      "MessageIndex": 18,
      "PostDate": "07/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/602729",
      "Title": "Panny : are you out there? moogie Weimarmom"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "gshoemate wrote: Is there a way for the onco. to know that chemo is doing what it's supposed to do? If you were in the middle of chemo and a new tumor started to grow.....would they know it by tests that they were performing during blood work? Any advice is greatly appreciated.....i'm in a panic that I am having issues in my other breast. Thanks Ginger Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/690934",
      "Title": "How do they know if chemo is doing it's job? gshoemate maxgirl"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Apr 30, 2007 07:43AM gshoemate wrote: I am so with you on the needles. I had both of my children natural childbirth because I would rather deal with the pain then have an epidural. I have to go this week for a core biopsy which I am not looking forward to. You may want to ask your doctor for valium or xanex to relax you before the procedure.",
      "MessageIndex": 2,
      "PostDate": "30/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/598273",
      "Title": "Flunked the ultrasound videochicke videochicke"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Oct 8, 2007 07:20PM - edited Oct 8, 2007 07:20PM by gshoemate Yes, what a great friend.  Let me share my experience.  I live in Florida and my family lives in Michigan.  However, when I was diagnosed, a time when family should come together, mine dropped off the planet.  So this board has not only been my support but my family as well. Keep in touch and let her know your there for here.  Don't let a week go by without getting in touch with her whether through email, phone call or mail.  The best thing for me was to sign up for a chemo angel..and I got 2.  They were my savor.  Every week I would hear from them through mail and they would send me little care packages.  The best one included a movie, popcorn holders, popcorn and candy for a family movie night, my kids loved it.  Just be there to listen to her fears and concerns and let her know how much you love here and are there for her.  And if you can find cheap airfare, a surprise visit would be just what the doctors ordered Ginger",
      "MessageIndex": 4,
      "PostDate": "08/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/693415",
      "Title": "my friend dmacw gshoemate"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Jul 31, 2007 01:44PM gshoemate wrote:",
      "MessageIndex": 5,
      "PostDate": "31/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/663745",
      "Title": "starting chemo soon... Harley44 Harley44"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Sep 22, 2007 08:44AM gshoemate wrote: My prayers are with you and Pixie.",
      "MessageIndex": 13,
      "PostDate": "22/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692481",
      "Title": "Pixie's Husband Here. I Need Your Prayers. PixieDust wackyjackie"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Apr 26, 2007 09:42AM gshoemate wrote:",
      "MessageIndex": 1,
      "PostDate": "26/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/594796",
      "Title": "stereotactic biopsy patti_momof5 leaf"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Jul 3, 2007 03:20PM gshoemate wrote:",
      "MessageIndex": 10,
      "PostDate": "03/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/646087",
      "Title": "Chemo Port - what to expect Footsox1 gshoemate"
    },
    {
      "AuthorID": "gshoemate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49566/profile",
      "Content": "Jul 2, 2007 07:44AM gshoemate wrote: Mine was put in at the time of my mastectomy. It is located right under my collar bone but some surgeons will put them in your arm. Everyone's experience will be differant. Mine sticks out alot but I am very thin and my surgeon says it really has no place to settle. It is very sensitive and I have had it since May 9th. I think most people don't experience to much trouble with it. But will have my first chemo today so I will know more about that aspect by the end of the day. I know some people have it put in a few days prior to chemo. I don't think 10 days is excessive at all, it will give it time to heal before your first chemo.",
      "MessageIndex": 1,
      "PostDate": "02/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/646087",
      "Title": "Chemo Port - what to expect Footsox1 gshoemate"
    }
  ]
}