{
  "AuthorID": "Gully",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177736/profile",
  "Posts": [
    {
      "AuthorID": "Gully",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177736/profile",
      "Content": "Aug 3, 2015 09:39AM Gully wrote: Hi Tiffany, I am so sorry you are here at such a young age! I was also diagnosed at what my doctors referred to as a \"young age\" 45. Long story I was diagnosed with Bilateral IDC both stage 1. I had two oncotypes done one for each side. Right came back a 5 no chemo but the left came back at 19. Tough decision. I chose to do the four rounds of TC. Reasoning, I am the type of person that would have worried about turning down a treatment that may help rid by body of this beast. If it comes back, I know I did all that I could. I agree with the above poster that it is quite disconcerting to base everything on one number, especially a number that is still being studied for the midrange group. My MO said before the oncotype my stats would have got me chemo no question, but it was my choice to go ahead or not. The TC did have some SE that were additive for me. Started with hair loss of course and a little fatigue. Round 2 a little more fatigue, Round 3 a tiny bit of neuropathy in my right foot, Round 4 more of the same. So it was doable for me. Within 6 months I was back to running and sporting a short hair cut. Today I feel pretty darn great. (fingers crossed that this continues for a very very long time lol) In a few days I will have completed two years of Tami with few issues (hotflashes). Good luck in your decision. Do what you feel with make you more comfortable in the future. Go with your gut and dont look back:) Gully",
      "MessageIndex": 10,
      "PostDate": "03/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "Gully",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177736/profile",
      "Content": "Feb 19, 2016 02:51PM Gully wrote: Rob, use this site under the tab for understanding your pathology report. Good info there. Hang in there!",
      "MessageIndex": 3,
      "PostDate": "19/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/841439",
      "Title": "Help understanding my wife's biopsy report robhsdca robhsdca"
    },
    {
      "AuthorID": "Gully",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177736/profile",
      "Content": "Feb 19, 2016 02:19PM Gully wrote: Hello Rob, First of all, just breath....Your wife's report looks alot like mine. It looks like a grade 2 IDC there will be more information to come from your doctor. Take a look at my stats, I had two of these one in each breast, and I am still here and healthy three years out. The beginning is the worst. You will feel better when you get to talk to your MO and get a plan. I had surgery, then they set out the tissue for Oncotype DX. It takes a couple of weeks but will help your doctor determine if Chemo is needed or not. If not, on to possibly rads, and then hormone therapy depending on the receptor stats , which they will also run on the tissue. I hope this helps a bit. Your are not alone and this site has a wealth of info. Best advice I can give is try and stay busy and dont Dr. Google. Much of that info is out of date. Good luck, and i will be thinking of you both. Hugs,,,,",
      "MessageIndex": 1,
      "PostDate": "19/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/841439",
      "Title": "Help understanding my wife's biopsy report robhsdca robhsdca"
    },
    {
      "AuthorID": "Gully",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177736/profile",
      "Content": "Jan 3, 2018 06:20PM Gully wrote: Cats, So sorry you find yourself here....as you can see by my stats I am also a SBBC patient! I think it happens more often that historical stats have recorded. As you can see I am almost five years out and doing well. You can do this...they will treat you based on the \"worst\" biology L or R. My treatment plan remained basically the same. Good luck to you..you are in the worst part now. After treatment decisions are made and you begin treatment you will feel less anxiety. Hugs.... Gully   ",
      "MessageIndex": 19,
      "PostDate": "03/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/861268",
      "Title": "MRI Results: Completely the Last Thing I Expected! ILikeCats ILikeCats"
    },
    {
      "AuthorID": "Gully",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177736/profile",
      "Content": "Jul 27, 2015 08:59PM Gully wrote: So sorry Ginger! I was DX with bilateral IDC. My docs told me to give them a year and they would give me my life back and they did! I am now 2 and a half and life is as normal as it gets after a BC dx. Its a long road, but the ladies and gents here are wonderful and they \"get\" all aspects of what you are going through, physically and emotionally. Hang in there and take one step at a time. If I were you I would definitely go on vacation next week! Gully",
      "MessageIndex": 3,
      "PostDate": "27/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/833727",
      "Title": "Received the phone call tonight... Gingersnappy CAMommy"
    },
    {
      "AuthorID": "Gully",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177736/profile",
      "Content": "Mar 17, 2015 11:58AM Gully wrote: Hello all, Interesting topic. I am a bilateral bc patient with LVI and negative nodes. Multiple opinions later, tumor boards at two hospitals, one Dana Farber, said no rads for me after BMX. Reasoning, if it does recur locally, we would like to have the option of RADS at that time. Hope this helps someone. Dont you love it when they say \"We can do this, it might help, but its up to you\"!",
      "MessageIndex": 21,
      "PostDate": "17/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/829551",
      "Title": "Radiation After Mastectomy AND LESS THAN 4 LYMPH NODES INVOLVED PerAngusta muska"
    },
    {
      "AuthorID": "Gully",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177736/profile",
      "Content": "Nov 4, 2013 04:13PM - edited Nov 4, 2013 04:14PM by Gully 45 two separate stage 1, (one spot in each breast)............Holding my breath!!!!",
      "MessageIndex": 974,
      "PostDate": "04/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Gully",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177736/profile",
      "Content": "May 7, 2013 05:22PM Gully wrote: Heather, I had BMX on March 6th, I had a nerve block similar to an epidural before surgery in addition to general anethesia. They did it because the brain still registers pain even under general and that the nerve block cuts that signal so your heart rate does not accelerate during surgery.  After I had very little pain for the first 2 days. I only stayed one night at the surgical center and the nurse kept reminding me to call her when I wanted to get up...well when you gotta go you dont want to wait..so I didnt.  I wont lie, the drains are a pain, they are awkward and get in the way even pinned up. My husband stayed with me the first week. It was hard sitting up by myself after the nerve block wore off and I could not reach anything above ear level. I also had TE's so I was not allowed to lift more than a pound. I could not open jars and doors etc....He even had to help me get dressed due to the fact I could not reach over my head. I strongly suggest getting some big open front comfortable shirts to wear. You will be able to empty your drains by yourself no problem.. just a bit gross! I kept mine pinned to the beautiful post mastectomy bra they send you home in. My drains both were out by 10 days post surgery. Its much more comfortable after they are removed. So yes, if it is possible it is helpful to have someone around to help with the drains, lifting, and reaching for a couple of weeks. My friends brought covered dishes for my family for the first two weeks because my DH cannot cook and I have two teenage boys at home still...  I don't mean to scare you....its not nearly as bad as child birth but you will be restricted in movement. Last bit of advice....take your pain meds and ducolax..trying to go without them was a mistake for me. I hope all goes well for you....You can do it!",
      "MessageIndex": 801,
      "PostDate": "07/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Gully",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177736/profile",
      "Content": "Nov 19, 2013 02:25AM Gully wrote: 45",
      "MessageIndex": 48,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Gully",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177736/profile",
      "Content": "Jan 6, 2014 07:45AM Gully wrote: Coral: interesting about your BS refusing to do the ALND. Mine did as well, I am actually glad to hear this from someone else. I had BMX and a \"surprise\" IDC in the prophylatic breast, so no SNB. My MO wanted me to go back to surgery for ALND and my BS said no she would not do it. I had a second opinion at Dana Farber, they said they wanted to put my case before their tumor board. Options on the table were ALND, and radiation to mastecomy site and axilla or just Tamoxifen. They decided on just Tamoxifen. I was happy with their decision, but am glad to hear someone has gotten the same advice of no ALND.",
      "MessageIndex": 4,
      "PostDate": "06/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/816528",
      "Title": "Axillary Lymph Node Dissection annabananas Batesburg"
    },
    {
      "AuthorID": "Gully",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177736/profile",
      "Content": "Jan 3, 2014 02:06PM Gully wrote: Hello Shellbell, I am soooo sorry you find yourself as a new member of our sisterhood!  You will hear this numerous times, but the diagnostic phase, is the worst. Once you get your team of doctors and you get a plan for treatment, I promise you will feel more in control. I got my news Jan 18th of last year! I was really glad to see the year end, but am proud of myself for getting through it. Today, I feel well and you will have a time when you too are on the other side. Let your friends and family help you and be kind to yourself. You did not do anything to make this happen and you do not deserve this, but it is what it is. Lean on the ladies here, they have all been where you are and are very knowledgeable. We get how scary this is for you, and are here 24/7. One piece of advice, DO NOT use Dr. Google....info is out of date.",
      "MessageIndex": 2,
      "PostDate": "03/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/816452",
      "Title": "Scared and Devastated shellbell1963 Dtowles"
    }
  ]
}