{
  "AuthorID": "gutsy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
  "Posts": [
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 31, 2010 01:03PM gutsy wrote: Is it at all possible to request a breast MRI for more clarification? MRI's usually provide much more detail and pick up things that are not seen on mammogram or ultrasound. Hopefully, it is nothing.",
      "MessageIndex": 5,
      "PostDate": "31/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/756042",
      "Title": "Positive Mammo but negative ultra sound? bestauntie bestauntie"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Sep 20, 2010 10:14PM gutsy wrote: I had a left breast lumpectomy with very close margins and will be going in for a unilateral mastectomy with reconstruction. No mention was made of a double mastectomy by any of my physicians responsible for my care. I would question the double mastectomy reasoning for sure. I will be doing immediate reconstruction and will go on tamoxifan after chemo etc.",
      "MessageIndex": 20,
      "PostDate": "20/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/758245",
      "Title": "When Margins Aren't Clear MSHH patoo"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Aug 7, 2010 08:55AM gutsy wrote: Must be good to be home. I had very similar surgery last week, went home right after. I felt a bit emotional after the surgery for two days, sore and bruising, but that went away relatively quickly. Hope you have some time off and some nice food made for you. Hugs to you",
      "MessageIndex": 1,
      "PostDate": "07/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/756427",
      "Title": "Home from Surgery LuvMyLab LuvMyLab"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Aug 10, 2010 05:57AM gutsy wrote: LindaLou thank you so much for sharing your 10 year anniversary. I am early in the process, and just beyond myself with fear. Every test, puts me in dooms day. I need to see stories like yours to keep the hope and believe.",
      "MessageIndex": 18,
      "PostDate": "10/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/755284",
      "Title": "10 Year Anniversary Today! LindaLou53 gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "May 11, 2011 04:03PM gutsy wrote: I did not have the Leukine injections but the Neulasta injections. I can tell you that the first time I received the injection I had excruciating pain in my jaw, ear, teeth. It made me so so sick. The second time around I had no bone pain whatsoever. I was anticipating the same pain.  You are halfway there, one step at a time. Take it very easy, take all the help people offer.",
      "MessageIndex": 4,
      "PostDate": "11/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/768757",
      "Title": "Overwhelmed jbear64 gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Oct 29, 2010 02:12PM gutsy wrote: I am so sorry to hear you are going through this. I think having an MRI is really good as it will give a clearer picture of what is going on. It certainly did for me.",
      "MessageIndex": 1,
      "PostDate": "29/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/760034",
      "Title": "Diagnosed 10/19/10 luvmykids143 meme31"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "gutsy wrote: Hello, I had a unilateral mastectomy with reconstruction on the 6th of January. I also had a breast reduction, lift on the other side. The reconstruction seems ok. The reduced site is hard as a rock and still very bruised. I actually thought they had put an implant in. Nurse wanted to drain it, but physician said it should go down on its own as it looks like swelling. Any ideas, it has been 4 weeks since surgery and I don't see it softening up at all. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764380",
      "Title": "Unilateral Mastectomy fine breast reduction problematic gutsy gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 12, 2010 12:53PM gutsy wrote: No experience, really wishing and praying for her that lesions are benign.",
      "MessageIndex": 1,
      "PostDate": "12/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755244",
      "Title": "mets to lungs??? berrygerry gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 1, 2010 03:18PM gutsy wrote: Envision Lots of us holding on to you during surgery,",
      "MessageIndex": 17,
      "PostDate": "01/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754765",
      "Title": "Surgery Tommorow : No family support Ondagrow Renrel"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 21, 2010 04:28PM gutsy wrote: Here is to B9's all the way. Try to relax tonight and have a good night sleep.",
      "MessageIndex": 3,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755657",
      "Title": "biopsy today, results tomorrow! texasrose361 Lisa1962"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Aug 13, 2010 11:32PM gutsy wrote: You are going to kick bc's ass in a major way. We are there with you. The new puppy Murray will keep you busy, he must be the cutest thing going. Keep us posted on what is going on for you. You will be getting your exercise with the two of them.",
      "MessageIndex": 4,
      "PostDate": "13/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/756692",
      "Title": "Got results LuvMyLab JannyM"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 12, 2010 12:50PM gutsy wrote: Mammo results when worrisome can be quick. I can only speak for myself, but when when there were no concerns with mammogram no discussion or anything happened during the mammogram. For my last mammogram when things did not appear so well, I had an ultrasound right after. Radiologist came in, etc. I knew before I left there that there were issues. However, eventhough the results were in the next day (I found that out later) physician's office did not call untill a week later. I was scared to call, thinking no news is good news. I am glad I did call and got the ball rolling.",
      "MessageIndex": 1,
      "PostDate": "12/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755248",
      "Title": "How long for mammo Results dillars dillars"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 12, 2010 04:31PM gutsy wrote: I had a diagnostic mammogram done after finding a lump, and yes the ultrasound right after eventhough it was scheduled for the next week. Yes, we can no longer assume that the imaging center and physian's office are as much on the ball about the results as you and I are. I have learned in a very short period of time to be pro-active about my own healthcare.",
      "MessageIndex": 4,
      "PostDate": "12/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755248",
      "Title": "How long for mammo Results dillars dillars"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 23, 2010 12:27PM gutsy wrote: Basia, know there is lots of support here every step of the way. I have 3 children and the last year I have been on autopilot taking care of everyone elses needs. I could not even make time to get my hair cut, let alone go for a mammogram with a 2 year old. We are going to move forward, and take care of ourselves and have others help in our care. Don't try to diagnose yourself, it will make you scared and overwhelmed. Take one day at a time, I am trying hard myself to do that, and know that there are many women here who will support you. I am amazed each time when I am feeling so overwhelmed that there are women here who will comfort me with their words in a very short period of time. They don't judge, they understand and they reach out. You are going to make it through, one step at a time. It sounds like you have lovely daughters and a supportive husband. Hugs for you  ",
      "MessageIndex": 4,
      "PostDate": "23/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755749",
      "Title": "Scared, don't know what to do Basia gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Aug 4, 2010 11:02AM gutsy wrote: Basia, it sounds much better than expected. B9 nodes are what we want to hear. You will have a plan of action soon, and on to being well.",
      "MessageIndex": 39,
      "PostDate": "04/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755749",
      "Title": "Scared, don't know what to do Basia gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Mar 26, 2011 09:14PM gutsy wrote: I used to think I wanted scans done. However, my oncologist does not do them unless there are symptoms. I also learned that 1 CT scan is the equivalent of 30 x-rays in terms of exposure to radiation. I would hate to get another cancer from being exposed to so much radiation",
      "MessageIndex": 10,
      "PostDate": "26/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/766632",
      "Title": "To scan or not to scan jdootoo gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 14, 2010 11:52PM gutsy wrote: Odinsmum: I have surgery on the same day as you, not quite like having the same birthday, lots of good wishes and prayers out your way.",
      "MessageIndex": 19,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754889",
      "Title": "Just diagnosed and waiting is awful odinsmom dap1961"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Nov 19, 2010 01:54PM gutsy wrote: Good for you Molly to seek out some help. It sounds like you did not have a lot of support while you were going through all your treatment. you may feel hurt at that. You also deserved to be treated with care, support and respect and lots of love. You handled it all as a true warrior woman, but at a high cost to yourself. The sad reality is that there are no rewards or badges of honour for those of us who still try to do everything ourselves despite our difficult cancer journey. People may actually feel relieved when they see people like you handling it all, and think it can't be so bad. I can understand some of your frustration, but it hurts you. Yep, how the media views it can often be misleading. It is better to turn the page than read stuff like that. It would piss me off too.",
      "MessageIndex": 59,
      "PostDate": "19/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/758051",
      "Title": "Taboo subject mollynminnie mom3band1g"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "gutsy wrote: I know that I have a IDC lump under 1 cm (hope that is correct), I was also told by my surgeon that there are some calcifications in the same breast. She wants to know what they are prior to lumpectomy and scheduled an MRI. I am in Canada, and getting an MRI is really difficult. I had the MRI on Friday. Howver, I have been scheduled for surgery next Friday. Will they be able to tell if they are pre-cancerous or cancer by the MRI? Would they need to do a biopsy before Friday. Is there such a thing as having a lumpectomy at the same time in two places, one for the lump and one to remove the calcifications. I am looking at at MRI images of breast calcifications on the internet and trying to diagnose myself and figure out if I will have a lumpectomy or mastectomy. After I completed the MRI I saw one picture which showed the lump and calcifications in my left breast. So I am kind of going crazy right now. Oh, I am sorry that I am so all over the place. I saw the surgeon 3 weeks ago, and as far as I know will not see her untill surgery day. I am kind of in a vacuum. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755821",
      "Title": "IDC and microcalcifications in same breast gutsy Beesie"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Aug 2, 2010 10:06AM gutsy wrote: I can't seem to find any additional information about this vaccine and the physician who is working on it.",
      "MessageIndex": 1,
      "PostDate": "02/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/756172",
      "Title": "PLEASE READ THIS! HappyTrisha BaseballFan"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Mar 12, 2011 09:31PM gutsy wrote: Sounds to me he just does not know how to act right now. He is probably decent enough but socially akward. What the heck, it is not a popularity or name dropping contest. Was he trying to impress the oncology nurse? You are so right, it is not about him it is about you. Hey, I would challenge him on his promises that he made in the doctor's office. I think you will figure it out, you sound like a strong level headed person.",
      "MessageIndex": 13,
      "PostDate": "12/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/766119",
      "Title": "relationship will not survive timerdog alamik"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Aug 2, 2010 10:07AM gutsy wrote: I can't seem to find any additional information about this vaccine and the physician who is working on it.",
      "MessageIndex": 2,
      "PostDate": "02/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/756172",
      "Title": "PLEASE READ THIS! HappyTrisha BaseballFan"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Oct 8, 2010 07:40AM gutsy wrote: I think that the MRI will give your surgeon and you more clarity about the amount of DCIS and were it is located. If it is multi-focal (in many different areas) is very difficult to do a lumpectomy with good cosmetic results. Not having the time or patience to go through extended radiation may be a valid reason for you to chose a mastectomy. Than ofcourse there is the whole question of reconstruction or not which are also major issues. Unfortunately, no matte what route you chose it is going to be challenging and will interfere with life.",
      "MessageIndex": 1,
      "PostDate": "08/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/759079",
      "Title": "Mastectomy versus Lumpectomy and Radiation Ruthlo JanetinVirginia"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 13, 2012 08:46PM gutsy wrote: Barb, I would find it helpful if people spoke from their own experiences and would be upfront about their own diagnosis. I see you respond to many threats, and I wonder where you are coming from. Is it your own lived experiences. I think it is human nature to be somewhat ticked off when people at a much lower stage pipe in on the experiences of those at a higher stage. I find it really hard when stage 0 dcis people feel that their experience is similar to those of us with higher grade IDC. I still remember the physician saying to me, \"you don't have the good kind\"  So, I want to be respectfull of those with a more advanced stage than mine.",
      "MessageIndex": 42,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780849",
      "Title": "Why am I only ok talking to stage III ladies?feeling like a jerk Josiekat lkc"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 14, 2010 11:43PM gutsy wrote: I had a diagnostic mammogram and the radiologist did not come into the room. However, the tech person checked with the radiologist before I was allowed to get dressed again. I had an ultrasound the same day, and the radiologist did come in and guided the technician for a little while, telling her were to put the wand. Than he left. If there possible areas of concern, I believe the radiologist comes in to check etc. Does not mean that something is abnormal. They want to check more closely.",
      "MessageIndex": 2,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/755359",
      "Title": "Radiologist ???? OkieDoe gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jun 5, 2011 01:03PM gutsy wrote: Every 5 yrs seems absolutely ridiculous. It certainly does not seem best practice for women who have a history of breast cancer.  I do think that the amount of scanning that goes on is also very dependent on the country's health system. I have noticed on the boards that US resident with insurance get a heck of a lot more scans than those of us in Canada. My oncologist will only do scans if there are symptoms that warrant it. I also understand that CT scans, Bone Scans etc give out a ton of radiation, so it is also about weighing the risks and the benefits.",
      "MessageIndex": 6,
      "PostDate": "05/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/769904",
      "Title": "UK Mammograms every 5 yrs - Unbelievable gillovski hymil"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Sep 26, 2010 08:57PM - edited Sep 26, 2010 09:01PM by gutsy Allright for the clear petscan Paxton. Jill and Renee praying for you to have a clear pet scan. I can only imagine how hard the wait is. All the other women who just posted about their waits on scans, let them all be clear. You have gone through enough, you need NED and a feeling of calm. Hugs and prayers",
      "MessageIndex": 20,
      "PostDate": "26/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/757352",
      "Title": "waiting for PET scan results paxton gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 14, 2012 05:36PM - edited Jan 14, 2012 05:55PM by gutsy It is totally fine to go on different threads,. I know I am a total dummy for having made a typing error.  Yes I go on threads that apply to me, I may go on one a bit outside of my diagnosis when it is to support someone. I hope I do that in a respectfull manner. I also speak up when I see something that just feels so wrong. Just the way you responded to me and others is so agressive, harsh and misplaced. I feel like you took it up a notch with me. Now, I know where you are coming from. It is not that I need to know every little detail, but it certainly helps me put things into perspective. I am baffled also being in Canada that you would not have been referred to an oncologist.",
      "MessageIndex": 50,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780849",
      "Title": "Why am I only ok talking to stage III ladies?feeling like a jerk Josiekat lkc"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "May 11, 2011 07:26PM gutsy wrote: Thanks for all the tips ladies. No peroxide, semi-permanent yes,. Yes, I think I do have to find another hairdresser. The one I went to was good, but there were language barriers. Not a problem when all you want is the same colour as last time and a trim.",
      "MessageIndex": 9225,
      "PostDate": "11/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 16, 2011 12:14AM gutsy wrote: After my discharge I had no wine for at least 5 months. I could not, as I thought I was feeding the cancer. I have had a couple of glasses of wine over the holidays and without too much guilt. I think I will have it once in a while when going out for dinner or something like that. When you have your glass of wine enjoy and relax.",
      "MessageIndex": 20,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763389",
      "Title": "I will have a Glass of Red Wine please!! faithfulheart faithfulheart"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Dec 25, 2010 11:33PM gutsy wrote: Katiaw, yes I was crying a lot during the time I had chemo. I just finished 10 days ago. I felt so sick for at least 5 days after the infusion. I also found that I had a hard time staying hopefull and somewhat positive. I cried so much. I would go for walks and just cry and cry. It is getting better now. I don't feel like crying over everything anymore and I am actually starting to enjoy things again. I think part of the reason was that my sleep was so poor. I would wake up every hour on the hour.",
      "MessageIndex": 10,
      "PostDate": "25/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762437",
      "Title": "How do you turn bad days around? Arayasunshine69 faithfulheart"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "May 10, 2011 12:56AM gutsy wrote: My hair is growing in and is a full head now, but short and greyish. I am wearing my wig in public. I am about 5 months post chemo. I would like to have it coloured, but not sure where to start. Would most hairdressers know how to colour chemo hair, or is it too early to get it coloured. I am thinking of a light brown with blond highlights, or am I setting myself up for an outcome of green hair with yellow highlights",
      "MessageIndex": 9190,
      "PostDate": "10/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Sep 7, 2010 07:02AM gutsy wrote: Allright for the clear petscan. Renee wishing you clear petscan. Hugs",
      "MessageIndex": 11,
      "PostDate": "07/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/757352",
      "Title": "waiting for PET scan results paxton gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "gutsy wrote: Biopsy tomorrow, which I suppose is good. I had an ok day today, but I am just crying now and feeling so alone. I have never felt like this in my life. I usually keep it together pretty good, too good as a matter of fact. Now I feel I am in another world. I feel like all the losses I have ever had are coming out now. It does not help that I am working today in the complaints department at the hospital, and some psychopath on the phone who would not stop complaining. I wanted to yell at him, but I put him on hold. Thanks for listening Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754502",
      "Title": "so scared and surreal right now gutsy gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jun 24, 2010 09:25AM gutsy wrote: Thank you for your kind words and hoping for the very best. B9 by god's grace . Tsunami also thinking of you.",
      "MessageIndex": 7,
      "PostDate": "24/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754502",
      "Title": "so scared and surreal right now gutsy gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jun 25, 2010 10:03AM gutsy wrote: Thank you so much Been There Guy for your inspiring words, what a lovely and supportive husband you are.  Tsunami right that makes sense than with all the drugs. Bless you for always popping up with support.",
      "MessageIndex": 15,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754502",
      "Title": "so scared and surreal right now gutsy gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jun 24, 2010 02:31PM gutsy wrote: Thank you, finished the biopsy. It was quick. \\It was done at the hospital where I used to work, they were all kind. That helped so much. A calmness came over me which surprised me, I hope He was there with me. 4-5 days waiting for results. Today I am going to try not to worry too much. ",
      "MessageIndex": 9,
      "PostDate": "24/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754502",
      "Title": "so scared and surreal right now gutsy gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 14, 2010 10:37AM gutsy wrote: Thank you both, The movies sound like a great idea. Rollercoaster, my kids would love me for it.",
      "MessageIndex": 3,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/755320",
      "Title": "Waiting for treatment, feel like I am waiting for the ax to fall gutsy AmyIsStrong"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 7, 2010 02:13PM gutsy wrote: Wishing B9 B9 and more B9. Any procedure let them know how scared you are of pain and needles and they can take extra care. Thinking of you today",
      "MessageIndex": 1,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755031",
      "Title": "Possible IBC Mammo and ultrasound today... KimberlyRae KimberlyRae"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 19, 2010 12:39AM gutsy wrote: Sohardbnme, Oh, I hear you. I am so scared also. We are going to get through this, we will all support each other. You can scream, vent, be angry and we will totally understand and encourage you to let it out. We are going to kick bc butt out into space, and grow old gracefully and with heaps of fun. We are going to be well again. Hold on to the amazing and very common stories that women do well with agressive cancers. A friend of a friend, very aggresive cancer at age 30 something, doing well , 16 years later going strong. This is a great place to share your emotions and be heard.",
      "MessageIndex": 70,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/754638",
      "Title": "just found out i have IDC ! so scared ! jlynnbain1031 dmorgan2"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jun 24, 2010 08:57PM gutsy wrote: That is so good to hear that the doc told your hubby that everything looks benign. What procedure did you have done that you had to go in the OR? Mine was a core biopsy,guided by ultrasound. Sounds like you got some good drugs for the pain.",
      "MessageIndex": 11,
      "PostDate": "24/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754502",
      "Title": "so scared and surreal right now gutsy gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 21, 2010 10:25AM gutsy wrote: If you are period is coming soon, you may want to watch it and see if there are any changes after your period ends. If not see your doctor. I don't know what age you are, but in certain decades our breasts are very busy (as my surgeon stated).",
      "MessageIndex": 1,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/755638",
      "Title": "A new lump? dannabenne artsci1"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 19, 2010 01:40AM gutsy wrote: Thank you Barbara, it is so great to have people like you respond who are ahead of us and can show us that we can do it one foot at a time. I am sometimes miles ahead of myself. I also find that I am at a place now that I need more alone time. Yesterday I had a small outburst, Told my husband I need a break. We have three children, and emotionally I can't do all the care anymore. I need alone time to process what I am going through. The moments of peace I have are when I exercise and can share on this board with others.",
      "MessageIndex": 73,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/754638",
      "Title": "just found out i have IDC ! so scared ! jlynnbain1031 dmorgan2"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Aug 14, 2010 12:24AM gutsy wrote: Jody, it sounds like you are well informed, in good spirits and ready for this tough journey one step at a time. Love the red hair, have fun with it. I just coloured my hair too, my sister did it for me. I will be starting my treatments in a couple of weeks, you inspire me.",
      "MessageIndex": 94,
      "PostDate": "14/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/754638",
      "Title": "just found out i have IDC ! so scared ! jlynnbain1031 dmorgan2"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Dec 15, 2010 12:38PM gutsy wrote: I understand you are feeling scared. You have gone through it before, and to go through it again feels kind of scary. You get all ready for the surgery and overcome your  fears and than to find out it happening again is hard. It is ok to feel it and to express it. Perhaps a good cry would help you feel better about it. Let out the fear and the worries, someone can comfort you. It is ok to talk to your family about it, they are normal emotions. I have to have surgery again, and I am also scared. You can do this,  and maybe try to visualize yourself doing well through surgery.",
      "MessageIndex": 27,
      "PostDate": "15/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/760885",
      "Title": "I have a possible diagnose dmho marie5890"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 4, 2010 01:09PM gutsy wrote: Yippie, I am so happy for you catwood. That is so good.",
      "MessageIndex": 5,
      "PostDate": "04/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/754733",
      "Title": "BONE BIOPSY TODAY catwood gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 7, 2010 04:29PM gutsy wrote: Wishing you all good thing, feel the presence of god watching over you and all of us thinking of you and holding your hand. You are going to do great.",
      "MessageIndex": 3,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/755011",
      "Title": "Lumpectomy today lisasinglem lisasinglem"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "gutsy wrote: I was diagnosed 2 weeks ago, and waiting for surgery in a couple of weeks. No medical appointments last week or this week. I am feeling like I am living in a nowhere's land. I have breast cancer and was having a great time this weekend watching the World Cup on a patio with another 200 immigrants from Holland. I even made it on TV. I know by reading other people's posts that the road ahead is going to be really tough. I am scared that feeling relatively good now, is a total illusion. Anyone else identify with these feelings. I feel like I am waiting to go down in a deep valley, but right now in lala land. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/755320",
      "Title": "Waiting for treatment, feel like I am waiting for the ax to fall gutsy AmyIsStrong"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Sep 26, 2010 12:56AM gutsy wrote: I would think that a phone call telling you to come in is more worrisome than a letter. I was called and told to call back as soon as possible. I knew right there and than.",
      "MessageIndex": 16,
      "PostDate": "26/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/758509",
      "Title": "hello babysister66 babysister66"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 16, 2011 11:33PM gutsy wrote: I am so sorry to hear you have been recently diagnosed. I am going to say being diagnosed with breast cancer is a journey with unpredictable roads. My advice would be to take it one step at a time and listen to your body. I can totally understand you wanting to get this show on the road and be back to normal as soon as possible. There is going to be a new normal, and there is grieving involved. Some people do really well after the surgery and are up and doing things after a week, others take longer. Two weeks, four weeks, six weeks off work it does not really make a difference in the big picture. For many of us, surgery is the first step, and based on the pathology report other treatments may come into play. I had a unilateral with immediate reconstruction about a week ago. I am amazed at how much I can do again, the energy I have, etc. A lot easier than I thought. Plastic surgeon is addement that I take at least 4 weeks off. It is ofcourse for my physical healing, but don't forget your emotional healing. Don't rush back to work. It is better to be good and ready than to go back too soon.",
      "MessageIndex": 6,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/763441",
      "Title": "Questions about Mastectomy irish22 LG300"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "May 28, 2011 04:55AM gutsy wrote: I totally understand. I have also been having these pains in my lower back and in my lower right abdomen. I had pain last year in my abdomen and it went away. It feels like it is back. I feel worried again and my mind is going where I get so scared. I am also on Tamoxifen and have started the stairmaster in the gym. I never seem to have a time of calm, something will feel weird and I feel panicky. I was supposed to go away with two of my kids for the long weekend, but I got too panicky before leaving. The thought of being out in the woods with nothing much to do besides relaxing scared me. At least at home, I can put my mind on the many loads of laundry and everything else that needs to be done. I do feel sometimes like sitting in the middle of the floor and just crying because I am often so afraid. I have to go for an ultrasound next week because of this bumpy area besides my alloderm implant.",
      "MessageIndex": 12,
      "PostDate": "28/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/769453",
      "Title": "Back Pain/Worry Again pupfoster1 AnacortesGirl"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 1, 2012 04:50PM - edited Jan 1, 2012 04:52PM by gutsy I supposedly started out with a 8mm tumour, little bump on the road I was told, lumpectomy and radiation. The pathology report after lumpectomy, showed a much larger tumour and a few of them. The surgeon read out the whole report to me, page after page. I think I shut down after page 2. All I remembered was that I needed a mastectomy and chemo. I did the chemo before the mastectomy. There was no evidence of invasive cancer after the chemo.  I still can't read the report.",
      "MessageIndex": 27,
      "PostDate": "01/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 31, 2010 09:59PM gutsy wrote: Good for you to get a second opinion to put your mind at ease. I do believe that radiologist can not say with certainty what something is. They can rate it interms of how suspicious it is. A biopsy is the only way to tell for sure if something is benign or malignant. My experience with a diagnostic clinic was also a back and forward discussion between ultrasound technician and radiologist of what they could see or could not see. I can tell you that they totally forgot that I was there, me the patient. I would rather have them err on the side of caution than to take things to litely and say come back in 6 months. Wishing you b9 results. You need to be your own best advocate, so it is good that you will be seeing a breast surgeon/specialist",
      "MessageIndex": 1,
      "PostDate": "31/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/756111",
      "Title": "Baseline Mamo - Now Worried Angel3621 Angel3621"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 7, 2010 10:27AM gutsy wrote: I can relate to the thoughts and feelings. I am very recently diagnosed, and today I just want to have my mind stop and go back in time. You have come so far, and will continue to do well. You are a warrior woman, a beautiful strong and real person. Venting is good, we will listen and know where you are coming from. Cry if you can and let those tears roll and relieve that tension. We are all here to support each other.",
      "MessageIndex": 3,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755018",
      "Title": "A venting session...the 18 wheeler. cs34 Kate33"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 13, 2011 01:20AM gutsy wrote: Stage 1-2, ER+ PR+ HER- no lymphnode involvement. Oncotype score of 20. Yes to chemo.  Wanted to throw everything at this beast. Chemo was hard but doable.",
      "MessageIndex": 79,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762764",
      "Title": "If you were stage I, did you get chemo??? mdg SusansGarden"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 11, 2011 01:35AM gutsy wrote: Nana, I am so sorry to hear. I remember you stating that he was so sorry and he was just so afraid of losing you. Well, he sounds like he has lost his marbles. Can you get some counselling for yourself? This is beyond cruel on his part. I would kick his sorry ass out of the door. Think about all the good people in your life, your amazing children etc. I am sure he loves you in his own bizarre way, but he has turned a crazy corner as far as I can tell, and it is absolutely no reflection of you. Nothing to do with you. Hugs and well wishes",
      "MessageIndex": 64,
      "PostDate": "11/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769466",
      "Title": "Cheating Husband teamnana car2tenn"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 11, 2011 06:45PM gutsy wrote: Oh dear, he is putting the blame on the other woman. Yep, she is a piece of work for sure for doing what she is doing. However, he needs to be the responsible man and take blame for his actions. It takes two to have an affair. 37 yrs is a very long time, and I totally get it. Whatever happens you need to be able to express your hurt and anger. Surround yourself with loving and helpful people. I know it is easy for me to say that you should kick his ass to the curb, but it is not this simple when you have been with someone for 37 yrs.",
      "MessageIndex": 70,
      "PostDate": "11/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769466",
      "Title": "Cheating Husband teamnana car2tenn"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jun 30, 2010 08:00PM gutsy wrote: Thank you all for your support, I am going to need people like you to keep me from going in the dark places. The bedside manners I have encountered so far have been almost like a comedy of errors. Physician (at clinic, I had never met before) rolled over his chair and said not good news, and shuffed a piece of paper under me. I had all my questions, but he said you are steps ahead of yourself. It can only go up from here, The surgeon I am meeting with has a very good reputation and has written a book \"The intelligent Patient Guide to Breast Cancer\".  I guess they don't have a breast cancer book for dummies. I promise one day soon I will return the support and care I feel here, right now I am not able to do much more than eat broccoli and carrots.",
      "MessageIndex": 6,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754793",
      "Title": "Just Diagnosed and starting to get blurry and imobelized gutsy Kodapants"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jun 20, 2010 11:15AM gutsy wrote: Thank you for your kind words. I am feeling quite alone and scared right now. Biopsy in 3 days, starting to think things feel more lumpy than before. Haviing a hard time",
      "MessageIndex": 4,
      "PostDate": "20/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754288",
      "Title": "Help suspcious mammogram and ultrasound for cancer gutsy flopsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Nov 21, 2010 10:43PM gutsy wrote: I am wondering if you also had an ultrasound, the mammogram and ultrasound together give a clearer picture. Yes, it is the biopsy that determines whether or not it is malignant. In my view, if it looks suspicious it should be checked out further. Given your strong family history I think you would want to have it checked out. In my personal opinion, the statements \"you are too young for BC and/or 80% are benign give women a false sense of security.  Likely it is benign, but you want to be sure of it so that you can have peace of mind.",
      "MessageIndex": 1,
      "PostDate": "21/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761045",
      "Title": "I know the stats but still worried..... rn4babies rn4babies"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "gutsy wrote: I spoke to my oncologist about having MRIs in the future for screening of my other breast which is currently cancer free (hopefully will stay that way). I did have a MRI after being diagnosed with breast CA, which actually showed more ca than initially thought. He stated that the jury is still out whether or not this would be more beneficial than a diagnostic mammogram for detecting cancer.  Furthermore, he stated it is not funded. You can do it if you want, but I would not necesarily recommend it. Not the answer I wanted to hear. I would love to hear your opinions and experiences. I live in Canada and it would probably cost me $2000 to have it done each year. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/761049",
      "Title": "MRI for follow-up in the future gutsy vinicaka"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Sep 25, 2010 06:09AM gutsy wrote: Diane that is so great. I so know the feeling of not wanting to tell people every new development. It is almost like you have those frequent flyer points and you don't want to use them up in the same time period.",
      "MessageIndex": 6,
      "PostDate": "25/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/758401",
      "Title": "Wondering if The Beast is back DianeGR DianeGR"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "gutsy wrote: I was just diagnosed with Invasive Carsinoma, that is all I know. I was a trooper at the physician's office, now I am just terrified. I can't handle reading about the specifics right now. I feel so lost, and can't handle hearing any more bad news. I know positive attitude is so important, but I am just not there right now. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754793",
      "Title": "Just Diagnosed and starting to get blurry and imobelized gutsy Kodapants"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Sep 25, 2010 04:05PM gutsy wrote: I would think there are student counselling services at the college you are going? Did you tap into that? They may be able to help you access different services, medical, psychological and some financial. It seems reasonable to take a semester out of school while you are dealing with all of this. I don't think they would kick you out, they may defer you once you give them a letter from your physician. If you have pneumonia it makes sense that they don't want you around patients. You need to take care of yourself right now. Hope that the results will provide you with some calmness in the storm you are going through.",
      "MessageIndex": 13,
      "PostDate": "25/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/758509",
      "Title": "hello babysister66 babysister66"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Sep 29, 2010 01:08AM gutsy wrote: I am confused, you had a mammogram and ultrasound and now you are diagnosed with lupus, but need to see an oncologist?",
      "MessageIndex": 22,
      "PostDate": "29/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/758509",
      "Title": "hello babysister66 babysister66"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Nov 22, 2010 07:43PM gutsy wrote: Thank you for the information. I don't have a radiologist yet, but that is a good idea to speak to a radiologist and see what they say.",
      "MessageIndex": 2,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/761049",
      "Title": "MRI for follow-up in the future gutsy vinicaka"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Nov 24, 2010 02:43PM gutsy wrote: Thanks Kosha. Yes, I know the oncologist will not push for it, but I may see if the breast surgeon will assist in this matter. I would like some piece of mind.",
      "MessageIndex": 4,
      "PostDate": "24/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/761049",
      "Title": "MRI for follow-up in the future gutsy vinicaka"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "gutsy wrote: Mammogram showed mass and so did ultrasound suspicious for cancer. My gp did not even the discuss the possibility of not cancer. I am so worried. So what is with the 80% biopsies benign, is that the women that have pretty good us and mammograms and they send them in for biopsy just to be extra sure. I don't know how to think anymore. I am in my 40's, fibroudenamas seem more common for young women Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754288",
      "Title": "Help suspcious mammogram and ultrasound for cancer gutsy flopsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jun 20, 2010 07:18PM gutsy wrote: Thank you for all the wise words, support and prayers, it really really helps me. I am trying to breath and relax somewhat, not my strongest point.",
      "MessageIndex": 9,
      "PostDate": "20/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754288",
      "Title": "Help suspcious mammogram and ultrasound for cancer gutsy flopsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Mar 17, 2011 12:59AM gutsy wrote: I had 4 rounds of chemo and than a unilateral mastectomy, reduction on the other side and reconstruction. I thought the surgery was much easier on me. The chemo affected me physically and emotionally. I felt so, so sick for 5 days after the infusion. I also felt so down. I could cry about nothing. Well, I had lots of things to cry about.  The surgery was fine. Initially a lot of pain, but on day two I was feeling pretty ok. Yes, the drains were a nusuance etc, I remember being so scared of the surgery, but it was so much easier on me than I had expected.  Congratulations on finishing your chemo. Yes, take it one step at a time. Next is surgery focus on that, and after that you can think about the radiation.",
      "MessageIndex": 2,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/766281",
      "Title": "Which is harder...chemo or bilateral mastectomy? 1awesomemom BMac"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 30, 2010 08:44AM gutsy wrote: Thank you so much, it is very comforting to know I have support",
      "MessageIndex": 7,
      "PostDate": "30/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/756031",
      "Title": "surgery tomorrow, please hold me in your thoughts and prayers gutsy Gabrielledr"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 19, 2010 12:27AM gutsy wrote: JuliaBelle I was scheduled for a mammogram, and 1 week later for the ultrasound. I went for the mammogram and ended up having the ultrasound right away. I have BC. Actually the Ultrasound Technician informed me that she had another person in another room. They squeezed me in because they found something. It is good to have the ultrasound, because ultrasounds sheds more light on what the mass could be and depending on that they may or may not schedule a biopsy. Remember 80 % of biopsies are benign. Good that you have a mammogram every year, you are doing all the right things. Take a deep breath, and another one and take care of yourself.",
      "MessageIndex": 1,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/755518",
      "Title": "How long did you wait for an ultrasound? JuliaBelle JuliaBelle"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 19, 2010 11:14PM gutsy wrote: Juliabelle, the ultrasound will give a good indication whether the lump is filled with fluid or whether it is more solid. Based on the ultrasound and mammogram results they would give the lump a birad score. If they feel a biopsy is needed an appointment would be set. Could be set in the next couple of days. The biopsy would be done by radiologist or surgeon depending on the kind of biopsy it is and the availability of appointments. Core needle biopsy is a very simple technique which is really quite quick and from my experience not painful or scary. Receiving the results can vary from a couple of days to a week. Again it really depends on the clinic and how they operate. Wishing you B9 results and a sense of calmness during the next couple of days. The anxiety is crazy making. I am having an MRI done on Thursday and I am starting to get tunnel vision and stomach problems. Hugs Gutsy",
      "MessageIndex": 5,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/755518",
      "Title": "How long did you wait for an ultrasound? JuliaBelle JuliaBelle"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Dec 9, 2010 12:21PM gutsy wrote: I am so sorry you are going through all this at such a young age. As if it is not hard enough to move across the ocean and start a new life. I can't help you with your first question, I am not from the area. Interms of work, I would not say too much yet. You don't know what your diagnosis is and the treatment path. We all hope it is a crazy mastisis or some cyst. I can tell you from my experience that treatment did not start the next day. I have worked in between treatments and kept things running at work as much as I could. Employers don't want a lot of hassle, so I would not give them anything that could make them turn around and let you go. You sound like a caring person, wanting to be fair etc, but the important thing is to look after yourself and do what is good for you. First you need to know what your diagnosis is and possible treatment plan, than you can give further information to your employer. I am trying to schedule my second surgery around the only person,who has done my job before, holidays. So there will be the least interruption to the program and the team. I think the surgeon's office thinks I am nuts and I should focus on my care. So, I am not one to speak.  ",
      "MessageIndex": 26,
      "PostDate": "09/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761410",
      "Title": "Can a cancerous tumor grow quickly within a week? Ling29 Ling29"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 19, 2010 01:10AM gutsy wrote: You are better safe than sorry. I have never had or heard about that kind of itching during a pregnancy. It sounds like a good idea to see a dermatologist, or a specialist.",
      "MessageIndex": 15,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/755234",
      "Title": "too young??? chelsey_2009 CheriD"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 8, 2010 10:29PM gutsy wrote: I also would do anything to make sure the remaining cancer cells are zapped and gone.",
      "MessageIndex": 7,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/755007",
      "Title": "Did anyone choose not to have surgery and radiation? iacai gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 1, 2010 11:49AM gutsy wrote: Tori girl, I am holding on to you. We are so close in the time of our diagnosis and we are going to make it through this, we are going to beat this and come out on the other end strong and beautiful. All your sisters here will give you strength and send love your way. I totally understand about the closet, I also want to go somewhere safe and be held. You are strong no matter what.  Lots of hugs",
      "MessageIndex": 4,
      "PostDate": "01/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754821",
      "Title": "Afraid for the phone to ring...and I'm ready to lose it... ToriGirl CoolBreeze"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jun 21, 2011 07:05PM - edited Jun 21, 2011 07:06PM by gutsy Vivie I am sorry to hear that there is so much confusion you are experiencing. Don't get ahead of yourself. My recommendation is to write down all the questions you have and pose them to your medical team members. They are the experts and should be able to guide you. You need to know from them exactly what type of breast cancer you have and what are the options for treatment. Your surgeon and/or oncologist should go over the pathology report with you and explain what the terms mean. I am assuming you are referring to the biopsy pathology report. After surgery you get another pathology report that will really direct your treatment. Ofcourse they need to take your implant into consideration as much as possible.  I started out with a lumpectomy, but it was discovered that the calcifications that were picked up by the mammogram were dcis, and I ended up with a mastectomy. I am glad I did have the mastectomy. I did not need radiation.",
      "MessageIndex": 20,
      "PostDate": "21/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770423",
      "Title": "Just dx'd Vivie Vivie"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "gutsy wrote: Surgery tomorrow first thing in the morning, starting to feel anxious. Hoping an praying for it to go well and will think of women here to be there in spirit Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/756031",
      "Title": "surgery tomorrow, please hold me in your thoughts and prayers gutsy Gabrielledr"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 31, 2010 01:02PM gutsy wrote: Thank you all for your support and comfort, I certainly felt your presence. It was a long day. Had the radio-active dye put in at one hospital, off to the other hospital for putting in the fine wires. Short talk with the surgeon who stated that the additional calcifications were still a mystery, but would be removed. I had asked for conscious sedation, but she stated that to avoid complications given the length of the surgery it was not advised. Ok, it was general anestetic. Prior to the surgery I got all these coughing fits, so I was given ventalin. I felt like a real patient yesterday. I actually worked at that hospital in the past for 5 yrs, so saying hi to past-coworkers in a surgical gown was not what I had planned on. I was one of 5 ladies being operated on for breast ca by my surgeon that morning. I am in some pain, but nothing a bit of tylenol can't cope with. I am still planning to take a few days of work. This was one step in the journey and many more to come. It was not pleasant, but very doable. I had this lovely technician who assisted the radiologist with the wire. She really was like an angel in disguise. It really helps to have caring, compassionate caregivers along this path. And caring ladies like yourself who understand, are real and available at the click of the keyboard.",
      "MessageIndex": 19,
      "PostDate": "31/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/756031",
      "Title": "surgery tomorrow, please hold me in your thoughts and prayers gutsy Gabrielledr"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 13, 2010 04:21AM gutsy wrote: That is good news, so glad to hear you margins and nodes were clear.",
      "MessageIndex": 14,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/755011",
      "Title": "Lumpectomy today lisasinglem lisasinglem"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "May 27, 2011 12:21AM gutsy wrote: I am sorry you have to go through this. I hope for your sake, he does not have a history of cheating, but just got caught this time. It is your life and you should do what is best for you. The last thing you need is more sorrow. Focus on your health and put yourself first.",
      "MessageIndex": 39,
      "PostDate": "27/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769466",
      "Title": "Cheating Husband teamnana car2tenn"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Aug 22, 2010 12:32PM gutsy wrote: Have an ultrasound done on your breast, see a breast specialist, or a dermatologist at the very least NOW. Don't wait untill after your child is born. Very likely not anything serious, however, if it is something serious such as cancer, waiting for such a long time could be life threatening. Young women do get cancer, often they get misdiagnosed by their gp's, by the time someone takes them serious, it is not a pretty picture.",
      "MessageIndex": 21,
      "PostDate": "22/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/755234",
      "Title": "too young??? chelsey_2009 CheriD"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jun 20, 2010 12:56PM gutsy wrote: I believe I am having an excisional BX. I have been crying in the last 20 minutes, have been reading so much on the internet, and I am getting more and more terrified. I am a medical social worker, I don't have any skills left. I love the teaching of your 7 year old to sew part. I am so glad that there such kind people on this board.",
      "MessageIndex": 6,
      "PostDate": "20/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754288",
      "Title": "Help suspcious mammogram and ultrasound for cancer gutsy flopsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 4, 2010 04:27PM gutsy wrote: Oh, I am with you. I feel every twitch in my body. When I first found the lump, I was touching it all the time and self-diagnosing. Yes, it is round, maybe oval. Feeling under my armpit, wanting to feel under other people's armpits (lol) to see what was normal. I don't touch anything anymore because it gets me completely spun out. I have backpain from a previous car accident, now I am scared it is not from the accident. First time in my life I have high blood pressure, I have always had low. So, yes stress is doing a number on me. At the same time, when I am not stressed, I think I am in denial and that is even more dangerous. What a rollercoaster ride, will I ever feel somewhat normal again. Or is it fear from now on.",
      "MessageIndex": 9,
      "PostDate": "04/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754875",
      "Title": "\"stress\" symptoms--anyone else? calamtykel shells43"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 13, 2010 03:25PM gutsy wrote: It is good that you are having a mammo and US  done. Hoping for B9 results. I can imagine you are feeling so unsure and confused with everything that is going on in your family. Prayers and wellness for your sister also. It does make sense about the fatty tissue given that you have lost a significant amount of weight. But I know , you want to be sure",
      "MessageIndex": 2,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/755276",
      "Title": "swollen under arm HeatherHowie HeatherHowie"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Dec 20, 2010 03:21PM gutsy wrote: Wishing you health and peace of mind. You don't need to be upbeat, it is all bittersweet. I don't know what using the time wisely means. There is no recipe, no super woman ingredients. I bet you there are lots of family and friends who are thrilled that you are here. You don't need to climb the tallest mountain or save those living in poverty. You contribute just the way you are.",
      "MessageIndex": 1,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762302",
      "Title": "It's finally here - my 5 yr Cancerversary dreamwriter twoshoes"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Sep 18, 2010 10:14PM gutsy wrote: I am so sorry to hear what is going on for you. It is not uncommon to have a clear mammogram and than a few months later find a lump. Frightening for sure. When speaking to my integrative health doc who is a MD, he informed me that it is not uncommon for hormonal cancers to pop up quickly. It does not mean that they are Her2+. In his experience, he has seen a lot of women who were diagnosed with breast cancer after having a number of significant stressors in their live, big live events. Increase of inflamation in the body, immune system down etc. That is one very symplistic view. I totally understand how it is easy to get ahead of yourself and start diagnosing yourself. If you can try to just take one day at a time and don't get ahead of yourself. I was feeling my lump all the time, and underneath my armpits. I was certain that my nodes were significantly swollen. When the breast surgeon checked them out, she stated that they felt normal.  Is your gp referring you to a breast surgeon? In my view it should be quite soon, it does not mean you have surgery right away, but at least the ball starts rolling.",
      "MessageIndex": 5,
      "PostDate": "18/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/758203",
      "Title": "Unfortunately New Suze35 lago"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Nov 21, 2010 07:57PM gutsy wrote: Oh, continue with the improvement. What an amazing woman she is. Bless her, make her well again.",
      "MessageIndex": 5,
      "PostDate": "21/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761042",
      "Title": "Update on my sister Joannan Lowrider54"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 13, 2010 03:24PM gutsy wrote: It is good that you are having a mammo and US  done. Hoping for B9 results. I can imagine you are feeling so unsure and confused with everything that is going on in your family. Prayers and wellness for your sister also. It does make sense about the fatty tissue given that you have lost a significant amount of weight. But I know , you want to be sure",
      "MessageIndex": 1,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/755276",
      "Title": "swollen under arm HeatherHowie HeatherHowie"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Dec 27, 2010 01:16AM - edited Dec 27, 2010 01:18AM by gutsy I am not really sure what to expect. I had my pre-op and was given lots of little pamphlets which I left somewhere. I really do have chemo brain. I know I am stressed about the surgery. I have been shopping a lot and eating a lot. Tomorrow is Monday, a good day to get it together. I am working a couple of days this week, but I took the day before surgery off.   Not that I am so attached to my breasts, but the thought to lose the one, kind of makes me sad. Even though I shouted before, take them all off, whatever it takes.",
      "MessageIndex": 47,
      "PostDate": "27/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Dec 31, 2010 06:27PM gutsy wrote: Thank you and happy New Year Everyone. I guess our month is here. Surgery for me is on the 6th, I believe there are a couple of women who have surgery on the 5th.",
      "MessageIndex": 65,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 3, 2011 03:53PM - edited Jan 3, 2011 04:05PM by gutsy Thank you Kate for your info on how things are going after your mastectomy. Good luck and best wishes to the other ladies, Laurie, Mejoy, Jackie and Elizabeth who are one or two days before me. I am scheduled for Thursday. Best wishes to you Alice we are both on the same day. Just cleaning the house now and having my kids help me. They are doing a good job, probably not their favourite activity one day before school starting.  Thank you for the well wishes.",
      "MessageIndex": 83,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 5, 2011 01:23AM gutsy wrote: Good wishes MeJoy, Jackie and Elizabeth. Have a restful sleep and a smooth day tomorrow. Thinking of you all, sending you strength and all good things.",
      "MessageIndex": 98,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 5, 2011 12:17PM gutsy wrote: Well, at least I found a pair of sun slippers to wear in the hospital. My husband knows I need a bunch of pillows. For the rest, I will play it by ear. Food is organized, house is relatively  clean. I am anxious and I am tempted to shop online to calm my nerves.",
      "MessageIndex": 102,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 5, 2011 06:53PM gutsy wrote: rackie, take good care of yourself and so you are healthy and ready for next week. I can imagine it was hard nevertheless to get yourself all prepared and no go.",
      "MessageIndex": 120,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 9, 2011 02:47PM gutsy wrote: I am having some troubles with my drain. It is not draining anymore, but liquid and blood is all over my bandage at that site. Called the surgeon who is on call, she said not to worry. Ok, hard to know what is normal and what is not. I seem to have always been in the abnormal, strange, mystery catergory since this cancer journey started.",
      "MessageIndex": 162,
      "PostDate": "09/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 25, 2011 03:36PM gutsy wrote: Supersally, some of us are list people and some of us are not. If you are a natural list person, go for it. I had a left mastectomy, the right boob is mine and improved. Having gone through the surgery and looking at the results. I would not hesitate to take the other off if there were even the slightest signs of trouble. So, yes I think your decision is a good one. More peace of mind, better cosmetic results.",
      "MessageIndex": 323,
      "PostDate": "25/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 29, 2011 04:33PM gutsy wrote: Good to hear you are doing ok MDG and are home. Sounds like you are in good hands with your friend coming to help you. Exercising? I walk a ton, I hope that counts. Take one day at a time or one step at a time whatever works better for you. You are one step further in your recovery and healing",
      "MessageIndex": 366,
      "PostDate": "29/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Nov 14, 2010 01:58AM gutsy wrote: I am so sorry to hear about your mom. Gosh, I would talk with her and her doctor and see if the cruise is a possibility. There is always medical personnel on board, a physician and nurse in the event of her feeling poorly. You could get a wheelchair if she is worried about walking and breaking her leg. Again, it really depends on how your mom is feeling. What a lousy situation to be in. Having cared for your grandfather all this time, and finally some time for herself and now this. As women we often put ourselves last to care for others.",
      "MessageIndex": 11,
      "PostDate": "14/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/760655",
      "Title": "just found out rockyg sunshine922"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Aug 24, 2010 02:05PM gutsy wrote: I had a SNB and took one week off work. Technically, I could have gone back to work earlier, but ended up with a major cold. I made sure that I started exercises for my arm one day after surgery and it was feeling ok. First 2 days I took some tylenol 3, but after that I was ok. I think it is just nice to have some time off after surgery as the whole ca experience is emotionally tasking.",
      "MessageIndex": 7,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/756963",
      "Title": "Sentinal Node Biopy Questions PinkSurvivor TifJ"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Dec 30, 2010 03:00PM gutsy wrote: Yes, I am also finding myself irritable about the upcoming surgery. DH does not seem to get any of it and lounges around while I try to get the house in order. I am thinking of staying with my mom after surgery, so I don't have to be responsible for household and three kids.",
      "MessageIndex": 61,
      "PostDate": "30/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 10, 2011 12:13AM - edited Jan 10, 2011 12:15AM by gutsy Cindy, Christina, Mamaoftwo and Jackie Thinking of you this week and my best wishes  So far it has been better than I had expected. I had unilateral with reconstruction and lift on the other side. BMX is more tasking I do want to acknowledge that. Energy level is good, not too too sore. Able to go for walks. Not a clue what it looks like under all the bandages, but time will tell. You all will will do well as you are strong women, and remember lots of us are thinking of you and are with you in spirit",
      "MessageIndex": 165,
      "PostDate": "10/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 12, 2011 07:08PM - edited Jan 12, 2011 07:18PM by gutsy I had surgery on the 6th and got my drain out on the 11. All the bandages came off except for the terra strips. I have to wear a sports bra now 24 hours a day. My real breast is bigger than the new one, the surgeon told me that it will go down in size on its own in the next couple of weeks. I hope so.  I should explain that I had a reduction and lift on that side. I hate to be the lob-sided woman after all this.  I am doing good overall, I have gone for 45 minute walks, do some laundry, dishes, etc. No heavy lifting. Friends and family are surprised to see me up and about.  My mother-in-law is coming tomorrow from Toronto to help. I think I have to be like the wolf from red riding hood. Before she comes, Put on some flannel pajamas, a little hat and pull the covers high up. I can't be out there going to a restaurant for lunch and checking out the January sales, that is what I did today",
      "MessageIndex": 196,
      "PostDate": "12/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 25, 2011 03:41PM - edited Jan 25, 2011 03:43PM by gutsy cmblastic  I am pleased to hear you are doing the happy dance. I also had neo-adjuvant  chemo and my path report showed no invasive cancer left and wide clear margins. I assume the chemo did something. Have a good restfull sleep today. It is nice to get the drains out. Mine kept falling.  kwhitmo Good luck tomorrow, take some deep breaths, you will be fine. Treat yourself today and take it easy.",
      "MessageIndex": 324,
      "PostDate": "25/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 27, 2011 11:18AM gutsy wrote: Yes, you hit it right on the nail, rebirth, to start over and feel whole again. I sort of have this image of myself in a white flowing dress on a beach running into the ocean. I don't have the flowing hair anymore.",
      "MessageIndex": 339,
      "PostDate": "27/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Feb 2, 2011 06:43PM gutsy wrote: Alice, I am really sorry to hear that the alloderm implant has given you so much trouble. It is good to hear that you are at peace with your decision to have it removed. I totally hear you, survival and recovery is number 1. In time you can look at your options and go from there.  I also had a the alloderm done, it appears ok. It is my other side which was a reduction only that is problematic. It is as hard as a rock and terribly swollen, but they don't think they can drain it. It is small potatoes compared to what you are going through. Hope the radiation goes smoothly and some of the stress is gone.",
      "MessageIndex": 436,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 5, 2011 07:09PM gutsy wrote: I wish I could post a picture of my sun slippers. They are really platform slippers, really disco like ( I don't have proper slippers) I am a long way from the ground, so I won't be picking anything up with my feet in the hospital. I work in the hospital so, the girls have given me some hospital gowns to wear at home. I am bringing my toothbrush and toothpaste and a book (as if). This is really not the list to follow. I am sure someone has come up with an extensive list, but I won't look at it because it will just make me anxious.",
      "MessageIndex": 122,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 13, 2011 01:23PM gutsy wrote: That is so so good Alice. What great results. Oh, I can only imagine how relieved you are. Spoil yourself today. cmblastic, so hard to have a co-worker go through the same who has been such a great support. I don't know why so many of us get breast cancer. I don't think it is just bad luck. I honestly think the world we live in has a lot to do with it.",
      "MessageIndex": 204,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 14, 2011 08:44PM gutsy wrote: Good to hear from you Rackie. Yes, the sleeping on the back is something to get used to. I am still not used to it, but rolling over even slightly is impossible. I hope your drains will come out in the next week. I had one, but it was always falling (did not stay clipped on) or got in the way. After two days, I had very little liquid draining out.  Take good care of yourself",
      "MessageIndex": 218,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Feb 12, 2011 12:17AM gutsy wrote: Jackie ofcourse you are emotional. Finished surgery and than had to go in for another snb and are now awaiting the results. It is like being in crisis mode for an extended period of time. Never ending road of tests, waiting, treatment, etc. It is so exhausting mentally and than to find out that there is more active treatment. We are here to support you and to share. Taking some ativan once in a while is a good thing, give the old brain a rest. It may help to do some relaxation listening to beautiful music while lying down, and let those tears flow. Hugs to you",
      "MessageIndex": 543,
      "PostDate": "12/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jul 13, 2010 02:17PM gutsy wrote: Awsome, just awesome. So good to hear.",
      "MessageIndex": 13,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/755070",
      "Title": "Scheduled for Surgery in the Morning Paola Paola"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 12, 2012 08:13AM gutsy wrote: It is good that you called in. Would the results not normally also go to your family physician. I would call them.  ",
      "MessageIndex": 2,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780902",
      "Title": "Is no news good news? wrsmith2x TifJ"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Dec 23, 2010 02:24PM - edited Dec 23, 2010 02:33PM by gutsy Hello, I am having a left side mastectomy and alloderm and implant on January 6. I will also have a reduction on the other side. I think they are going to make me a B or C. Apparently I am a D now, but have always worn a C something bra. I had lumpectomy and SNB in the summer July 31, no clear margins found DCIS, had 4 rounds of TC recently finished. I had  my pre-op consultation today. A bit nervous about it, but glad to see there is this support thread.",
      "MessageIndex": 34,
      "PostDate": "23/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 7, 2011 02:51PM - edited Jan 7, 2011 02:53PM by gutsy Hello All, Update I am home  I had my unilateral mastectomy and alloderm reconstruction yesterday morning at 7:30 am. Lift on the other side to be exact. It went fairly smooth. It took about 2.5 hours. I apparently woke up ready to jump of the bed, but otherwise felt fine after the anestetic. No nausea, just slightly drowsy. Still wearing my own underwear (had forgotten to take it off before going into the OR) Received some fentanol for pain and from there on Tylenol 3. The area feels tight, but not too sore. It is important to stay on top of the pain, what I learned is that when you have a lot of pain your body can't heal and your muscles cramp up. I have one drain that looks like a plastic pancake which is clipped to my shirt. I have to drain it every 12 hours. Apparently my surgeon will take it out upcoming Tuesday. What really helped me stay focussed and calm was the kind nurses I came across. I had been worried about being under for that lenghth of time, but took 4 deep breaths from the oxygen and next thing I knew was that I was awakened from a slumbering very short dream. Never got to wear my sun slippers, the hospital supplied me with some anti-slip socks.  One of the things worth mentioning is that if you are taking a lot of vitamins and supplements, it is important to stop some of these about 7 days before surgery. For example, I had to stop  - Garlic pills - Tumeric pills - Omega 3 fish oil pills - Green tea extract pills - offcourse aspirin. all of these apparently could cause bleeding  I am feeling ok, thinking of going for a walk, but at the same know that I have to take it easy.",
      "MessageIndex": 145,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 22, 2011 01:47PM gutsy wrote: Good to hear everyone who had surgery is doing ok. Ok is good under our circumstances. Is anyone else experiencing severe itching? I am told to wear a sports bra day and night, I am not sure if that is causing it? I am also taped up. My surgeon does not want patients to use cream, potions or lotions on their breast to prevent scarring and uses paper tape instead. The itching gets worse as the day progresses. In the scheme of things not the biggest deal in the world, but just wondering if it is just me?",
      "MessageIndex": 280,
      "PostDate": "22/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 23, 2011 08:14PM - edited Jan 23, 2011 08:14PM by gutsy Good luck to all of you who have surgery this week. I can say with certainty that it was less scary and easier than I thought. Take it easy afterwards and let others spoil you. Be a woman of leisure for at least the first two weeks after.  I did not make a special list of things to bring to the hospital. I did not bring much of anything and did not really have to. I put a housecoat, a book and some slippers in a bag which my husband brought afterwards. In my opinion you just have to show up and let the medical staff take care of you and guide you.",
      "MessageIndex": 298,
      "PostDate": "23/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Aug 4, 2010 11:58AM gutsy wrote: That is so great Ann, it is so good to hear good news",
      "MessageIndex": 6,
      "PostDate": "04/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/756043",
      "Title": "Waiting is so agonizing dietcoke gutsy"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Aug 31, 2010 12:05AM gutsy wrote: Thank you so much for your support and wise words. LBMX it will be. It is just such a rollercoaster ride.",
      "MessageIndex": 5,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757199",
      "Title": "Lumpectomy now need mastectomy, need your support gutsy oaklandish1"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 13, 2011 04:00PM gutsy wrote: This is such a nice group of people here. Just a few more tidbits.  I am able to sleep in a normal bed but with 3 or so pillows propped up. I am a side sleeper, but that is absolutely a no go. I feel the most stiff and experience some pain when I wake up. It is a good time to do some gentle neck and arm exercises. I also find that when I overdue it by not napping or resting during the day, the pain increases. So it is important to rest even when you feel guite energetic. I walk everyday for a good 45 minutes and can do light housekeeping tasks. My plastic surgeon wants me to be off work for at least 4 weeks, eventhough I am feeling pretty good. She told me, this is not the time to shorten yourself.",
      "MessageIndex": 209,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 19, 2011 04:23PM gutsy wrote: Cindy, I am sorry to hear about the positive nodes. I can understand that you are scared. Things will be much more workable once you meet with your oncologist. Our minds go to dark places, but the oncologists have so much experience and knowledge and will help select the best treatment for you. Chemo is doable, not fun, but you will make it through ok. Keep us posted, we are all here for each other.",
      "MessageIndex": 263,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 20, 2011 08:50PM - edited Jan 20, 2011 08:51PM by gutsy cms77  I also have significant bruising on my right side, the side which was reduced and lifted. It is going down to my navel. It does not bother me however. It is the side where I had the mastectomy and reconstruction where I feel lots of pulling, numbness and discomfort. It is so hard to know what is normal and what is not to be expected. I had a lumpectomy, snb and chemotherapy before the mastectomy. Something must have worked there was no invasive cancer left in the breast, just insitu, and wide clear margins. It is hard to know if it was the chemo that worked, but overall happy to know that I don't need radiation. On to the hormone therapy. Wishing all good wishes to those waiting to have their surgery. I had wanted to say something earlier, but I was pretty much paralized in fear waiting for my pathology report. Something I need to work on I know.",
      "MessageIndex": 272,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "Jan 26, 2011 11:32PM - edited Jan 26, 2011 11:39PM by gutsy Yes, I had surgery just about 3 weeks ago and I feel really tired after lunch. I am trying not to nap because my sleep is so poor at night. The expectation that I am back at work on the 8th full days. Somehow I want to stay in my own little world and not go back to business as usual. Does that make sense to anybody? The last 6 months since my diagnosis I have been in survival mode, surgery, chemotherapy, surgery again. I was functioning in high alert while waiting for and going through treatment and working at my job. So yes I am tired physically, but especially emotionally tired. I don't think people around me understand that.  Migallen and Mdg good luck tomorrow. All you have to do is show up, get changed and wear what you wore when you were born. I could not even manage to do that, I forgot to take my underwear of. Thank god it was a good pair.",
      "MessageIndex": 337,
      "PostDate": "26/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "gutsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103800/profile",
      "Content": "gutsy wrote: Hello, Just came back from meeting the surgeon to discuss pathology report. UH. Two spots which were removed were invasive 1.5 cm each, there also appears to be a larger area of ductal insitu which has close margins. No lymph node involvement. She is recommending mastectomy with reconstruction, perhaps chemo first while waiting. I was blown over, as the nurse kept saying good news, good news. You probably only need radiation. I am feeling kind of numb again. Heck would love to hear your experiences. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757199",
      "Title": "Lumpectomy now need mastectomy, need your support gutsy oaklandish1"
    }
  ]
}