{
  "AuthorID": "GwendolynPierce",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273689/profile",
  "Posts": [{
    "AuthorID": "GwendolynPierce",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273689/profile",
    "Content": "GwendolynPierce wrote: Today I had MRI and mammo that were regularly scheduled as part of a high risk screening program. About two weeks ago I noticed a dimple or indentation when I raise my arm. It's pretty pronounce and about the size of a nickel. Nothing like it on the other side or anywhere else. It's very far back at the very edge of the breast below the armpit (not even sure if it's breast tissue back there or fat, and not sure if they can get that spot on the mammo). I didn't bother calling for an appointment because I knew I had the imaging already scheduled for today. However, they just did the scheduled MRI and mammo, not an ultrasound of the area. For that I have to wait to see if the radiologist calls me back based on the MRI or mammo, or I need to see the doctor and have her set up an ultrasound. I know i should probably not get ahead of myself and see what the two test results show before moving ahead, but i did go to the doctor's office on the way out to schedule an appointment just in case (eg if the other two tests show nothing, i still want the dented area looked at). I was able to book for about two weeks from today though they said if it is urgent I can get squeezed in earlier. I was hoping they'd be the judge of the urgency but I guess not. So my question is, if the two test results don't show anything and the radiologist doesn't call me back in, is it ok to wait the two weeks nor should I push it as urgent? Other symptoms: general dull aching on side of breast, sore and full feeling armpit, some itching that seems to be coming from deep inside. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "27/05/2019",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871760",
    "Title": "How worrisome is breast indentation/dimple? GwendolynPierce GwendolynPierce"
  }]
}