{
  "AuthorID": "gwerfil",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82224/profile",
  "Posts": [
    {
      "AuthorID": "gwerfil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82224/profile",
      "Content": "Oct 16, 2010 12:26PM - edited Aug 20, 2013 02:57AM by gwerfil workmother, Sigh. I know what you mean. I think the upset is anxiety and unfortunately, most of us experience it, so YES, it is totally normal. You have just very recently been through a helluva thing. During and after my radiation last year, I was having vivid, bad dreams and waking up in the middle of the night like a supercharged zombie, going to the computer and terrorizing myself by googling everything I could on breast cancer, statistics, radiation, and the treatments that I might be receiving. It is important to be informed about radiation, because last week I needed a complete set of dental x-rays and I didn't find out about thyroid guards (apparently Dr. Oz was talking about them recently) until after I had the x-rays. I found out about about them here, on this wonderful resource. The female periodontist knew my situation and yet a thyroid guard was not offered. I was diagnosed when I went for a complete executive health check up at the Mayo Clinic. FIRST they took a chest x-ray, even though I had no complaints. Then I was scheduled for my mammogram. I was so freaked out that I had had that chest x-ray when I found out about the mammo results! I ended up having my surgery at Mayo and they were great, but that chest x-ray still haunts me. I did not have chemo, though one oncologist wanted to sign me up for a trial she was participating in, two others said that the risks outweighed the benefits for me. But the diagnostic procedures, (needles in my nipple, SAY WHAT?) surgery and radiation (the humiiiation of my boob dangling and being zapped by a male technician? I wondered why, on my last day of treatment when I was lying there with both breasts exposed and pointing up to the ceiling, he took a photograph from several feet away. Is that usual, anyone? Anyway, my shock, fear, and yes, embarrassment of it all made me a nervous wreck. I felt as though I had failed my family and myself by getting this disease. I was prescribed Clonazepam, which I guess is pretty strong stuff, but it eliminated my anxiety which was making me obsess and which was disturbing my sleep. I was not depressed, I was fearful. I was even ashamed, which was ridiculous. Clonazepam helped me with all of that. I had no noticeable side-effects or any hangovers from it. I felt much more \"normal\" and balanced and able to cope. I'm a year and a half out and taking Arimidex, and I'm having some new side effects--mouth sores--nothing too troubling, but it seems like there are always questions for the doctor or the Great Google in the Sky. I, too have been worried about possible radiation to my HEART, since heart disease runs in my family--at least in the men. I have my appointment with my wonderful female radiation oncologist at Sloan Kettering in NJ on Wednesday. I intend to ask her about that specifically. I'm so sorry you are crying and upset. Perhaps it is like post traumatic stress. Just keep in mind that you are reacting as any woman would. Ask your doctor about anti-anxiety meds and don't worry, you won't have to take them forever. There is no need to suffer from anxiety right now. And you can feel good again after breast cancer. You will occasionally have some moments of anxiety surfacing, but they becoma less and less frequent. Actually, life held some nice surprises in store for me, opportunities I might not have jumped on had I not had breast cancer. My motto is either learn something new, or do something different. It helps boost your confidence and connects you to new people or creative experiences and your brain likes that.  Hugs and all the best to you. Penny (or Gwerfil, which is Welsh)",
      "MessageIndex": 233,
      "PostDate": "16/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "gwerfil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82224/profile",
      "Content": "Oct 12, 2010 09:49PM gwerfil wrote: I am troubled that Recovery Cream contains methylparabens and propylparabens. I would not use it. I try to avoid anything containing parabens as they are known endocrine disruptors and some studies have linked them to breast cancer. Parabens are absorbed through the skin. Why risk it? thegreenbeautyguide.com/?p=264 bcaction.org/index.php?page=pa... www.health-report.co.uk/parabe...",
      "MessageIndex": 173,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "gwerfil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82224/profile",
      "Content": "Nov 9, 2009 08:18PM gwerfil wrote: Watson, you rant all you want here and wherever else you want and good for you for demanding from your doctor adequate medication for your pain and anxiety. Everyone is different, but Clonazepam and Lunesta get me through the night. Some docs don't prescribe Lunesta because it's much more expensive than other sleeping pills, but you have good insurance. Ambien doesn't keep me asleep for more than three or four hours and I am on the small side. I'm a redhead and it's a fact that anesthesiologists say we are harder to knock out. If I took a Benadryl I'd be awake all night Flamenco dancing under the covers--it makes me hyper. I have no hangover with Lunesta, either. My wonderful, compassionate and respectable doctor thinks Clonazepam is PERFECT for anxiety. Xanax didn't do it for me and Ativan makes me jumpy. Clonazepam doesn't render you witless or unable to function, if anything, it frees you to just BE.  And I found  it does not interfere with driving ability, but I'd get used to it first before you try. Putz to your heart's content and don't forget the Dulcolax if you are taking Vicodin or you will be dealing with the added insult of hemorrhoids which feel like the worst toothache that you can imagine where the sun don't shine. But possibly you already know that. One of these days there will be medical marijuana in all fifty states. That day is probably a long way off, but I don't see why a plant that is NATIVE to our country should not be available for cancer patients, no matter where they live. Research shows it helps. I am not a druggie, though my post here probably makes me sound like one.  I LIKE YOU, WATSON. TAKE CARE.  ",
      "MessageIndex": 41,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743559",
      "Title": "Waah! I had a meltdown. I don't care who posts! Watson konakat"
    },
    {
      "AuthorID": "gwerfil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82224/profile",
      "Content": "Nov 19, 2014 08:56PM - edited Nov 19, 2014 09:00PM by gwerfil Hi Lucy, I am five and a half years out and today my oncologist told me I can quit tamoxifen. Statistically beyond this point it offers only 1% of benefit to me that is not worth the aches and pains and fatigue. I started out on Arimidex, toughed it out for two years, then grew tired of what for me seemed like unbearable stiffness and pain and by significant bone loss after my first bone scan at the time of diagnosis to my second one two years later. Tamoxifen was easier on me, I felt better, my bones grew stronger, but I guess it's time to stop. Like you, in the beginning, I worried too much, slept poorly, and became obsessed with searching these discussion boards for any encouraging piece of information, or horror stories about treatment, or validation of my own experiences, or just to read some comforting words. The obsession with BC and the associated relentless reading of BC stories and statistics will eventually ease. I think I was obsessed for about a year or more and then I let it go and started to open myself up to new experiences. You are lucky to have grandchildren. I look forward to grandchildren some day. Enjoy yours and try not to worry so much. All my worrying did not help me or give me any advantages in this path we're on. Pay attention to your body, but not every new pain is something to be concerned about. Pay attention to being alive and enjoying your grandchildren! You can't snap your fingers and make your fears vanish, but you are stronger than your fears and eventually they will lose their power over you. Don't give them power. I found that writing down my dreams helped me to sort out my fears and move away from them. There is great support available to you on this site. Best wishes to you.",
      "MessageIndex": 15271,
      "PostDate": "19/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "gwerfil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82224/profile",
      "Content": "Oct 12, 2010 09:53PM gwerfil wrote: Nineteen months from diagnosis, which was Friday the thirteenth. Surgery took place six days later. So far, so good.",
      "MessageIndex": 77,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758694",
      "Title": "How many years have you been a Survivor? IllinoisNancy Lou789"
    },
    {
      "AuthorID": "gwerfil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82224/profile",
      "Content": "Dec 7, 2009 08:33PM gwerfil wrote: Thank you, Sheila. I did have a lumpectomy. I just felt so pathetic sprawled on the sidewalk in London with my arm and my breast hurting like the \"dickens,\" pardon the pun. My arm swelled a bit, so naturally I worry about lymphedema from the trauma. Also, the Arimidex has me concerned about bone loss. I never broke anything besides a toe before. I take lots of calcium and Vit D3. I'll see what the doctor says when I get home. Maybe I need a bone scan. Anyway, thanks for your good wishes. Gwerfil",
      "MessageIndex": 812,
      "PostDate": "07/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "gwerfil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82224/profile",
      "Content": "Dec 8, 2009 09:08AM gwerfil wrote: Thanks, Valjean. I'm so glad your friend is doing better. What a terrible experience for her! I feel sorry for her and as a horse lover, I feel sad for the horse, too. I witnessed a similar accident in PA and the woman on the passenger side was injured, but conscious, and the young horse was killed. I think he had gotten loose from a handler and he took off right down the drive from the barn and into the road. The car was totaled. Thank goodness your friend will be okay. I'm hanging in here in a comfortable spot. Even though I'm anxious to get home and start in on Christmas, I'm not looking forward to the long plane trip back to the US this weekend. I will be very sore and my poor husband will have to carry everything. He has been a good sport through it all (it's his vacation, too!) and I can always count on him to make me laugh--like when he will be carrying my purse through the airport! Meece--love your magnificent tree!  I have an artificial one too, because my daughter has asthma. I load it up with so many decorations and lights that it's impossible to tell it's not real. Looks like you take a similar approach. Deborye--that gorgeous shot of the blazing fire in the stone hearth would make a great screensaver this time of year! Nicole--lugging a toddler around is backbreaking, especially the lifting part. The good part is that it is so delicious to hold them close enough to smooch them. I hope you will feel better and get the treatment and reassurance you need. Wishing you the best. Chin up! gcarter--wishing you the best, two!",
      "MessageIndex": 848,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "gwerfil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82224/profile",
      "Content": "Dec 7, 2009 07:45PM gwerfil wrote: Hi everyone, I'm new to this thread and I'm so glad to find a place for Stage I Sisters. I need some sisterly advice. I just tripped and fell hard on my left side a week ago. I broke my left arm and smashed my left boob on cobblestones. The left side is my \"bad\" side. I did this in London and saw a doctor, they took x-rays and he confirmed my arm had a hairlne fracture running about two inches down the radial bone from my elbow. There was some accumulation of blood inside my arm around the elbow. My chest hurts on that side and I had difficulty getting deep breaths for several days, possibly just due to a bruised rib, but maybe from some reaction from the radiation which I finished in June? I'll be home in the US in a week and will see my doctor, but I'm worried that this injury could contribute to lymphedema, which so far has not been an issue. And I certainly don't want more x-rays. The emergency care I received, pain meds and my follow-up appointment with the orthopedic specialist in Britain was paid for by the NHS. Everyone treated me so promptly and so well. The nurses said things like, \"There now, sweetie,\" which I found very comforting. The overall body aches are bad, but then I'm on Arimidex and often feel achey and it's been raining and damp every day since I've been in the UK. Has anyone ever injured themselves on their arm or ribs on the same side as their surgery? Is six months on Arimidex enough to cause bone loss in someone in their fifties? Are breaks common this soon into treatment with aromatase inhibitors? Also, does anyone feel a little clumsy on Arimidex--especially if you're fatigued? I did really legitimately trip on uneven pavement and fall rather spectacularly, but I don't know what to think. Is this the new me? I'm going to have to get more serious about working out or doing yoga regularly instead of occasionally. IT'S ALWAYS SOMETHING!",
      "MessageIndex": 807,
      "PostDate": "07/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "gwerfil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82224/profile",
      "Content": "Dec 7, 2009 08:02PM - edited Dec 7, 2009 08:03PM by gwerfil",
      "MessageIndex": 809,
      "PostDate": "07/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "gwerfil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82224/profile",
      "Content": "Dec 8, 2009 09:10AM gwerfil wrote: Thanks, Carolinachick!",
      "MessageIndex": 850,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "gwerfil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82224/profile",
      "Content": "Nov 10, 2009 09:41PM gwerfil wrote: I am familiar with the Onion and am intellectually up to the challenge of occasionally finding it humorous, but jeez, Ann, for someone who revels in such lightness of being (nothing wrong with that), aren't you being a little hard on Dr. Jennings? Is he your dentist or something?  I feel compassion for him. He and his wife had to cope with her breast cancer diagnosis. He did not find the piece amusing. That doesn't make him intellectually thick. He wanted to exercise his own freedom of speech by airing his thoughts here and by writing to the editors at The Onion.  He's not trying to pass any legislation against humor. There are no politics involved. I find it commendable that he cared enough about others' feelings to post at all. The Onion employs a lot of women. Statistically some of them may find the piece funny, but statistically one in seven to eight of them will get breast cancer. I guess this piece passed the sniff test with the female editors (let's hope there are some), but did I chuckle or feel better after reading it? No. I suppose if I worked at it, the image of canaries (in the coal mines) between breasts might be vaguely amusing, but first thing, I wouldn't want the canaries to get suffocated in my cleavage and secondly, after my SNB, I felt like someone had been doing some mining under my armpit and still do in damp weather. Now CANCER VIXEN, the brilliant comic by Marisa Acocella Marchetto about her own experiences with breast cancer was hilarious. It was honest, the illustrations were ridculously well-done and most importantly, at least to me, it was written and illustrated by someone who had been there, and not, as in the case of The Onion, written by sophomoric, horny, callow youths who have yet to look their own mortality in the eye.  I have been hungry for wry or humorous books by women who have been there. There are not enough of those books. I read Lopsided--very wry. I read the wonderful Five Lessons I Didn't Learn from Breast Cancer (And One Big One I Did.) I read Cancer Made Me a Shallower Person: A Memoir in Comics by Miriam Engelberg. I voraciously read Cancer Vixen in the days following my surgery and it had me laughing so hard my stitches hurt! The Onion just made me feel--not good about having breast cancer. Call me sensitive.",
      "MessageIndex": 37,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/743602",
      "Title": "Upsetting satire on 'The Onion' about breast cancer kevinjennings Pat634"
    }
  ]
}