{
  "AuthorID": "Hadiya",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
  "Posts": [
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Feb 18, 2018 03:23PM Hadiya wrote: I'm so happy to have found this post since I'm preparing for some procedures. I have a question though... I normally wear a 34DD or DDD and... my boobs hang straight to the floor. I tried one front zip bra and could have been on world's funniest videos if anyone had video taped me. There was no way I could place my boob and zip at the same time. What do you think? Would this work for me? I'll have to order on Amazon - I live in the mountains and am too far from Target or Walmart to try one on. Thanks for your help!",
      "MessageIndex": 5,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829203",
      "Title": "Great Bra for after biopsy! Wrinklequeen momto3sons"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Feb 18, 2018 04:55PM Hadiya wrote: Thanks so much Silbar! This is very helpful! I feel much better. Two questions - you said you have a 38DD in this bra but I see it does come in a 34DD so I'm wondering if you can help me decide what size I might order? Did you try the 34DD or 36DD? Also, the area on my breast is about high noon - 2o'clock - or maybe say 10 - 2. Do you think this bra would be comfortable for that area? Thanks again for your help!",
      "MessageIndex": 7,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829203",
      "Title": "Great Bra for after biopsy! Wrinklequeen momto3sons"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Feb 18, 2018 05:55PM Hadiya wrote: Thanks again Silbar! I agree, it's too bad there's not more uniformity of sizing - in clothes too! So grateful for your help!",
      "MessageIndex": 9,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829203",
      "Title": "Great Bra for after biopsy! Wrinklequeen momto3sons"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Feb 23, 2018 08:06AM Hadiya wrote: I'm so sorry Carolyn! How are you feeling now? Sending love and hoping you are feeling better by now!! ",
      "MessageIndex": 11,
      "PostDate": "23/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862719",
      "Title": "Heading to my excisional biopsy momto3sons beach2beach"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Hadiya wrote: Hi, I have an 3.6 cm architectural distortion on tomo and had an MRI yesterday. I meet with my doctor tomorrow to go over the results and am making a list of questions. Any suggestions of things I should ask and clarify? Thanks for your help ~ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862661",
      "Title": "Meeting with doc for MRI results - questions I should ask? Hadiya momto3sons"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Feb 20, 2018 04:24PM Hadiya wrote: Yes, with contrast. They said it's either a complex sclerosing lesion or cancer and will need a biopsy - MRI guided but I needed the MRI first for data. I was surprised she wanted to meet me with to go over results so I'm trying to prepare. How did it go with you? You have your biopsy in a few days. I hope it goes well Momto3sons! I'm thinking of you and praying for you!",
      "MessageIndex": 2,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862661",
      "Title": "Meeting with doc for MRI results - questions I should ask? Hadiya momto3sons"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Hadiya wrote: Hi ~ I have an architectural distortion that grew from 1 cm to 3.6 cm from November to December. I'm waiting to go for an MRI. Over the weekend, I started having a very strong burning sensation in my breast and I found a small lump on my rib cage - right above the architectural distortion. Should I be concerned about the burning? OR the lump? Is this normal? Thanks in advance! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862036",
      "Title": "New symptoms over the weekend ~ Hadiya claireinaz"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Jan 29, 2018 08:43AM Hadiya wrote: Two USs. Both were clear. Architectural distortion was found by Tomo.",
      "MessageIndex": 2,
      "PostDate": "29/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862036",
      "Title": "New symptoms over the weekend ~ Hadiya claireinaz"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Feb 20, 2018 07:10PM Hadiya wrote: I've had 9 surgeries and have learned to ask not to have general anesthesia. They can do so much now... kind of a twilight 'out of it' state where you don't know/feel anything at all going on but you aren't under a general. (I had nausea with the general - and then constipation and bloating later and it took a lot out of me). Every time I ask not to have general, the anesthesiologist has complied and it's been a complete breeze. One time I had hired someone to take care of the house and children but I felt almost perfectly normal within 24 hours instead of 4 days. All of my surgeries have been gyn/uterine or breast biopsies or C-sections. My gyn has a book about foods/supplements etc. to take before surgery and I follow her recommendations. It's called \"The Rapid Recovery Handbook - Your Complete Guide to Faster Healing After Surgery\" by Elizabeth Motyka ~ in case you are interested. Ideally you follow through with things for a week to 10-days before surgery but I'm sure even a day or two is helpful. If I need a lumpectomy, I'll be following her instructions as long as possible. Thanks again for your help, Carolyn!",
      "MessageIndex": 6,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862661",
      "Title": "Meeting with doc for MRI results - questions I should ask? Hadiya momto3sons"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Feb 22, 2018 10:26AM Hadiya wrote: Thinking of you and sending love! Let us know how it went and the results when you get them! Praying for good news!",
      "MessageIndex": 1,
      "PostDate": "22/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862719",
      "Title": "Heading to my excisional biopsy momto3sons beach2beach"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Feb 22, 2018 05:49PM Hadiya wrote: Thinking of you!! And sending love and healing prayers! Sleep well!! I'm glad it's over and you have this behind you!",
      "MessageIndex": 6,
      "PostDate": "22/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862719",
      "Title": "Heading to my excisional biopsy momto3sons beach2beach"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Feb 24, 2018 04:57PM Hadiya wrote: Big big hugs Carolyn! It's good you could verbalize your feelings to your husband... it's so hard to lose a part of our physical body. My heart goes out to you! Much love ~ XO",
      "MessageIndex": 14,
      "PostDate": "24/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862719",
      "Title": "Heading to my excisional biopsy momto3sons beach2beach"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Feb 25, 2018 12:14PM Hadiya wrote: Oh, dear, I keep missing your messages. I'm so used to the fb model, I haven't quite adjusted here. In any case, so glad you are feeling better after time with your husband and seeing your favorite team win Carolyn!! XOXO ",
      "MessageIndex": 19,
      "PostDate": "25/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862719",
      "Title": "Heading to my excisional biopsy momto3sons beach2beach"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Feb 20, 2018 04:54PM Hadiya wrote: I've had 2 ultrasounds and they were inconclusive. I'm glad to hear the MRI biopsy was easier than the MRI. I hope it's the same for me. My arms really hurt from being up high so I was worried about being in that position longer - plus the actual biopsy so you've relieved some fear. Thanks ~ How was your recovery from the biopsy? I've had 2 excisional biopsies - years and years ago - and they were a breeze. I hope yours goes well and that you feel good about your next steps. Again, thanks.",
      "MessageIndex": 4,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862661",
      "Title": "Meeting with doc for MRI results - questions I should ask? Hadiya momto3sons"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Feb 9, 2018 10:47AM Hadiya wrote: Dear Magnolia Mom, I homeschooled my children, who are now all grown now and am going through the process of diagnosis. I often think of what it would have been like to go through this when they were little. My heart goes out to you and your children. I'm an herbalist and wonder if some herbs or flower essences may help you through the weekend? Flower essences may help your children too. Bach Flower Remedy is for stress and shock and ashwagandha is a wonderful herb for stress and sadness. It's wonderful in warm milk/almond milk and helps with sleep. My mother just died and these herbs helped during hospice and especially in the last week of her life. And, please don't worry about your children seeing you break down and cry... it's a beautiful teacher for being present during the worst of times and it will help your children to know it's okay to cry whenever they are sad or in shock. You are being real - and that's what homeschooling is all about. Of course you are going to be crying and afraid right now, of course. Hug them... and your pets... and let them all love on you. Again, my love to you - and feel free to send me a private message if you'd like other suggestions for other herbs to try if that resonates at all.",
      "MessageIndex": 7,
      "PostDate": "09/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862350",
      "Title": "Despair and kids Magnolia-mom bluepearl"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Mar 19, 2018 05:59PM Hadiya wrote: I had a large architectural distortion on mammogram ~ they said it was either cancerous or a complex sclerosing lesion (large radial scar). They wanted to do a biopsy but I opted for checking it by MRI first. The MRI showed that my breast was completely clear. They couldn't see the 3.8 cm distortion at all. I'm completely out of the BC system now. So... I hope this brings you a bit of hope! Believe in miracles! All best to you! ",
      "MessageIndex": 6,
      "PostDate": "19/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/863001",
      "Title": "Diagnosed with Radial scar, i.e. CSL. Now what? Cheyenne01 Mechq"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Feb 9, 2018 08:48PM Hadiya wrote: Magnolia Mom, yes, Whole Foods will have them. If not, let me know and I'll send them to you. :) I'm glad your husband is there with you. It sounds like you two know just what to do. We live beside a wonderful homeschooling family... wish you were here too because we'd scoop you all up and help out with anything you needed. I hope and pray the love troops are arriving soon. Angels aboard! Arms around you ~ again, let me know if I can help. XO",
      "MessageIndex": 12,
      "PostDate": "09/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862350",
      "Title": "Despair and kids Magnolia-mom bluepearl"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Jan 29, 2018 08:42AM Hadiya wrote: Thanks. I've had 2 USs and both were clear. Tomo was birads 4 as I said - with architectural distortion growing from 1 cm to 3.6 cm in 4 weeks. I was told that the MRI contrast contained both iodine and gadolinium but they would do the 100% gadolinium because of my allergy. Perhaps I misunderstood? Thanks for your help. I'm concerned that the gadolinium will be very hard on my body due to Lyme. I can post both my US and Tomo reports if that would be helpful.",
      "MessageIndex": 6,
      "PostDate": "29/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862024",
      "Title": "Architectural distortion - MRI with manganese needed Hadiya Hadiya"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Hadiya wrote: I was diagnosed with an architectural distortion late last fall. Four weeks later, it had grown from 1 cm to 3.6 cm. Stereotactic biopsy was recommended but I can not do it due to PTSD so an MRI was suggested. Then, my Mom died so I'm only now getting back to my own health issues. I am allergic to iodine so they will need to use gadolinium ~ I have Lyme disease and the heavy metal will be difficult for me. Do any of you know any hospitals which are using manganese contrast agents? My hospital does not. Also, I just started having severe burning in my breast this weekend. Is this normal with an architectural distortion if it is a complex sclerosing lesion or would that point to cancer? My BIRADS was 4 and my mother and both grandmothers had breast cancer but not until they were elderly. I am considering not moving forward with the MRI and monitoring by tomo instead because I'm pretty overwhelmed right now although the burning is worrisome. Thoughts on any or all three of these issues? And love to all of you as we walk this path together... Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862024",
      "Title": "Architectural distortion - MRI with manganese needed Hadiya Hadiya"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Jan 28, 2018 07:57PM Hadiya wrote: Thanks so much. If you feel like sharing, can you tell me about your diagnosis please? And thanks for your suggestion about calling hospital. All best to you Veeder!",
      "MessageIndex": 4,
      "PostDate": "28/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862024",
      "Title": "Architectural distortion - MRI with manganese needed Hadiya Hadiya"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Jan 28, 2018 06:57PM Hadiya wrote: Thanks. I'm not worried about PTSD with the MRI - it's the heavy metal contrast agent that would be very difficult for my blood stream because of the Lyme Disease. (Well, in my opinion, it's not great for any of us really but with those of us with kidney involvement, it can be very bad.) Thank you for writing and giving me your thoughts! Do you know anything about the burning sensation in my breast?",
      "MessageIndex": 2,
      "PostDate": "28/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862024",
      "Title": "Architectural distortion - MRI with manganese needed Hadiya Hadiya"
    },
    {
      "AuthorID": "Hadiya",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267746/profile",
      "Content": "Jan 30, 2018 01:16PM Hadiya wrote: Thanks djmammo. I appreciate your help! All best to you...",
      "MessageIndex": 8,
      "PostDate": "30/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862024",
      "Title": "Architectural distortion - MRI with manganese needed Hadiya Hadiya"
    }
  ]
}