{
  "AuthorID": "halfvass",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62907/profile",
  "Posts": [
    {
      "AuthorID": "halfvass",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62907/profile",
      "Content": "halfvass wrote: I've had 5 infusions of Taxol and Herceptin (following dose-dense AC) and I am really starting to get some neuropathy in my fingers.  They don't hurt.  They are just numb and it is getting difficult to do some tasks with them. I'm wondering if others are going through this and if they are finding anything that helps.  I took glutamine for the first couple of infusions and the numbness went away after 3 days.  But both my oncologists said to stop it because it can make tumors grow.  I do take B12 and a B Complex.  Are there other things that your docs recommend?  I really want to complete the course of Taxol and Herceptin but I also don't want permanent neuropathy. Thanks in advance for all of your input. Hugs, Deb Dx 12/1/2007, IDC, 5cm, Stage IIIA, Grade 2, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704789",
      "Title": "Taxol neuropathy-advice? halfvass chumfry"
    },
    {
      "AuthorID": "halfvass",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62907/profile",
      "Content": "Apr 30, 2008 12:42AM halfvass wrote: Yes, you can get wigs free from the American Cancer Society.  I got two.  It is a good idea to go before you lose your hair if you want to stay with a similar style and color.  Also, you will have more energy then.  Take someone with you and make it a fun outing.  My sister went with me. We had lots of fun & ended up with 2 nice wigs.  I then had the wigs trimmed and shaped by my hairdresser.  I did that at the same time I had my head shaved.  I waited until it started coming out in clumps, getting everywhere, and then had it shaved.  I took a friend with me to that, took pictures, and got the whole salon involved.  I didn't find it very traumatic.  That said, I have fairly short hair and, at times in the past have had really short hair, so I'm sure that makes a difference.  But I look forward to seeing how it comes back--the color, texture, etc.  It should be one of the more pleasant adventures on this long journey!  I also find that I don't wear the wigs very much.  They are quite warm here in South Florida and I often go \"au naturale\" or plop a hat on my head--another reason to get a free one first and see how you feel about it. Deb",
      "MessageIndex": 8,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704750",
      "Title": "kemo carlaba rogam"
    }
  ]
}