{
  "AuthorID": "Hannahbears…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
  "Posts": [
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jun 16, 2010 02:07AM Hannahbearsmom wrote: Hi Judy, So sorry that you and your daughter are going through this. My situation was a little different because I had bilateral mastectomies with TE placement but I think that a lot of what I experienced will apply. I was hospitalized for 1 night and was discharged around midday. My daughter was 9 at the time of my surgery. My daughter did come to see me in the hospital. I had thought that it would ease her mind to see that I was ok but I think it actually kind of scared her to see me that way. My husband and I made sure she had lots of activities with friends not at our house so she didn't have to see my so weak and uncomfortable. I didn't have any trouble getting around in our 2 story house. The most difficult thing for me early on was getting up out of bed or out of the chair. I did use a recliner and highly recommend it. Your daughter may have a bit easier of a time since she will have the use of her other arm. My Plastic Surgeon restricted my arm movement--no lifting/pulling/pushing/or stretching. No shower until drains removed(6 days for me). I had to take sponge baths and my husband washed my hair for me. I was on pain pills for about a week and did doze a fair amount. I wasn't supposed to lift anything so things had to be placed low and I only picked up light things, keeping my arms in close to my side and just bending at the elbow. Hope this wasn't too long--I'm sure other people will chime in with their experiences. Good luck and feel free to PM me if you have other questions. ",
      "MessageIndex": 2,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754142",
      "Title": "Need immediate post-surgery info for helper JudyM Hannahbearsmom"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Feb 17, 2010 01:22PM Hannahbearsmom wrote: I'm glad that you are well again and that you will be able to have your surgery as planned. I hope that  you have a smooth surgery and a painfree recovery. TCK",
      "MessageIndex": 10,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748295",
      "Title": "Should I Postpone? Julia257 Julia257"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Feb 13, 2010 08:05AM Hannahbearsmom wrote: I would recommend going to your regular medical doctor and seeing if what you have could be treated by antibiotics. I know how you feel because I got a terrible sinus infection the week of my bilateral mastectomy with tissue expander placement. My family doctor put me on antibiotics and although I was not completely well, I was doing better by the day of surgery--still felt crappy. I still had a cough and drainage. My breast surgeon and plastic surgeon said as long as there was no fever, they would proceed. My anesthesiologist was also aware--they are the ones dealing with your airway/breathing. I did NOT want to postpone my surgery--I had already had to wait longer that I wanted and I was ready to get it over with. My plastic surgeon just kept me on the same antibiotic after surgery until I had completed the correct number of doses. I did ok but I would make sure that you take your pain pills because the increased coughing after the surgery would have been extremely painful without the meds. Good luck and I hope you feel better soon. TCK",
      "MessageIndex": 3,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748295",
      "Title": "Should I Postpone? Julia257 Julia257"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Feb 13, 2010 10:51AM Hannahbearsmom wrote: If you can't get in with your PCP, you could even consider going to one of those \"doc in a box\" clinics. The only problem with that is your insurance might not cover it. Just another suggestion--depends on how bad you feel and how bad you want to proceed this week. Keep us posted. TCK ",
      "MessageIndex": 5,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748295",
      "Title": "Should I Postpone? Julia257 Julia257"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Feb 18, 2010 03:50PM Hannahbearsmom wrote:",
      "MessageIndex": 13,
      "PostDate": "18/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748295",
      "Title": "Should I Postpone? Julia257 Julia257"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jan 8, 2010 01:14PM Hannahbearsmom wrote:",
      "MessageIndex": 1587,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jan 21, 2010 04:35PM Hannahbearsmom wrote: Erika:  I have been on tamoxifen since October and have really not had any side effects to speak of. I may wake up a time or 2 during the night feeling hot but it goes away quickly and I fall back to sleep without any trouble. With an ER+ bc it's pretty standard to get tamoxifen if you are premenopausal. I decided that I would take it, hopefully not have problems with it, and if I did have trouble then I would deal with it then. There is a great thread called \"Bottle of tamoxifen\" with lots of info and support. Good luck! TCK  ",
      "MessageIndex": 1781,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jan 14, 2010 08:40AM Hannahbearsmom wrote: reeltchr: Sorry you are having to join us but glad to have you here. I live near Durham. I am a little farther along in the process since my BLM with TE surgery was in Sept. I should be having my exchange surgery in March. My PS likes to wait 3 months after the last fill. Feel free to PM me if you have any questions. Good luck and glad things are going well so far. Grace:  I will be praying for you for a good response to the chemo. We are hear to listen so don't hesitate to tell us about your feelings/fears/frustrations. Sending ((hugs)). TCK",
      "MessageIndex": 1702,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Dec 10, 2009 06:19PM Hannahbearsmom wrote: Hello. I have been reading the boards since October but just recently started posting. I am 46 years old and was diagnosed with stage 1 bc in August. Had bilateral mastectomies with tissue expanders in Sept and am happy to report that I am done with my fills. My exchange surgery will be in March. This week I had ooph/hysterectomy because my tumor was 90% er+ and I have a strong family history of premenopausal bc. I am currently taking tamoxifen also. Didn't have to do chemo or radiation. Just wanted to say hello and introduce myself.",
      "MessageIndex": 924,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Dec 13, 2009 06:45PM Hannahbearsmom wrote:",
      "MessageIndex": 1022,
      "PostDate": "13/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Dec 16, 2009 06:43PM Hannahbearsmom wrote: KAC:Hi. I noticed that we were diagnosed the same day. I'm glad that your exchange went well and the pain is not too bad. My exchange won't be until March and I am already ready! Take it easy. Susu: Hope that your day has continued to improve and that your feeling better.  Ronna: I didn't mean to scare you about the PT, it was one of the best things I did for myself after my BLM. I didn't have to do rads or chemo so I can only imagine what that is like. I just try to remind myself that people are trying to say positive things to support me and they don't always know what to say. Everyone have a peaceful restful evening.",
      "MessageIndex": 1157,
      "PostDate": "16/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Dec 22, 2009 11:30PM Hannahbearsmom wrote: Sunnyfornow: Congrats! No more rads! Ronqt1: I am so happy to hear that your TE discomfort has improved. If you need the meds, keep taking them. It's hard enough to deal with what we are going through without having to endure pain. I think it is good that your PS decided to wait for your fill. I have read that many people lengthen the time between fills due to pain. I know that we want to get through the process ASAP but we have to be able to get through the day to day without being miserable--glad you found out what works for you. Harley44: Welcome. I don't know about the AI's. I'll be interested in what you find out because I am on tamoxifen but since I just had out ovaries/tubes asnd hysterectomy 2 weeks ago, I don't know when they will switch me to an AI. VegasDiva: I hope someone on here can help you with your question about chemo. I know it is frustrating enough without having to worry about work issues. Good luck. Elimar: Cute reindeerHow'd the rum cake turn out? I did some baking yesterday and today too. I went by work to drop off some goodies this afternoon. I have been off work since my surgery 2 weeks ago. I'm feeling pretty good so it was nice to see my coworkersfor a little visit. The three good things about having my surgery this month were 1-helping to prevent recurrence, 2-no more periods, and 3-I get to have this week and next week off while my daughter is out of school for the holidays. I hope everyone else is having a good week. Christmas is almost here! TCK",
      "MessageIndex": 1304,
      "PostDate": "22/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Dec 23, 2009 12:33PM Hannahbearsmom wrote: katgirl: My understanding is that insurance companies are obligated to pay for surgery to provide symmetry. In my case, the insurance company paid for my bilateral mastectomy and recon(I'm still in the recon phase). I only had cancer in my left breast but they paid for the right one also. Although your situation is different than mine, I know that people on these boards have had the other breast augmented or lifted to provide symmetry. I'm so sorry that your Christmas 6 years ago was so rough. Congrats on your 6 year cancerversary tomorrow! Maybe this year Santa can bring you breast reconstruction!! Have a great holiday! TCK",
      "MessageIndex": 1312,
      "PostDate": "23/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jan 7, 2010 09:19PM Hannahbearsmom wrote: Cake: I'm very sorry to hear about your friend's friend--I'll be praying for her and her family. My family and I went to Disney in June a few years ago and it rained a few times. They sell ponchos there so everyone there (and it was crowded) just got a poncho and continued on. It really didn't cause a problem. It was even more humid after the rain though. I'm sure you will have great fun!!  TCK",
      "MessageIndex": 1568,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jan 8, 2010 09:25AM Hannahbearsmom wrote:  Valjean and carolinachick: Happy to hear your good results . I'm definitely ready for some sunny WARM weather too--the beach sounds wonderful!! TCK",
      "MessageIndex": 1579,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jan 11, 2010 08:18PM Hannahbearsmom wrote: My oncotype score was 16. I did not do chemo. I was told that without chemo my recurrence rate is 10% and with chemo it would drop to 7-8%. I decided that was not enough of a change to go through chemo. I do sometimes think about it but I do feel that it was the right decision for me.  TCK",
      "MessageIndex": 1637,
      "PostDate": "11/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Feb 6, 2010 09:21PM Hannahbearsmom wrote: Erika09:  I started on tamoxifen back in Oct. I had my followup appt with my med onc in Jan and she did order a liver panel--results were normal. I'll have to do a bit more investigation about this and see what she says about it next time I see her. TCK",
      "MessageIndex": 1941,
      "PostDate": "06/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Feb 24, 2010 07:19AM Hannahbearsmom wrote: Nicole:  I usually just lurk on this thread and I can't remember if you ever post on the \"Exchange City\" thread. I'm am sure that there are women who can offer their experiences about recon after infections. That thread really has a great group of ladies and very knowledgable too!! Many of them have been through chemo and rads so they can give you that side of things as well. Good luck in your decision. TCK",
      "MessageIndex": 2035,
      "PostDate": "24/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Dec 18, 2009 12:37AM Hannahbearsmom wrote: Deborye:I LOVE that picture!! Meg:Sorry you had to join us on this BC journey but you have found a very caring and supportive group here. Welcome.I too think that your positive outlook will be a plus for you. Take care. TCK ",
      "MessageIndex": 1183,
      "PostDate": "18/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Dec 25, 2009 05:54PM Hannahbearsmom wrote: Merry Christmas to all!! Love, TCK",
      "MessageIndex": 1346,
      "PostDate": "25/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jan 10, 2010 11:12PM Hannahbearsmom wrote:",
      "MessageIndex": 5,
      "PostDate": "10/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746517",
      "Title": "Bleeding after Ovary Removal - need advice? encoremom encoremom"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jan 11, 2010 08:21PM Hannahbearsmom wrote: I also was premenopausal. I did not have ovarian suppression. It was recommended to me to have my ovaries out. I opted to have robot assisted laparoscopic BSO and hysterectomy. I am on tamoxifen. So far ,so good. TCK",
      "MessageIndex": 1638,
      "PostDate": "11/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jan 14, 2010 12:39PM Hannahbearsmom wrote: labarbera:  So sorry to hear your results. Sending a prayer out for you and your family. ((Hugs)) to you. TCK",
      "MessageIndex": 1713,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jan 15, 2010 11:45PM Hannahbearsmom wrote: reeltchr:  Congrats on your last fill! I do live in the triangle area. I'm being treated at UNC. How bout you? TCK",
      "MessageIndex": 1737,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Dec 14, 2009 10:53AM Hannahbearsmom wrote: Good morning everyone! I take the milk chocolate Viactiv too. I get it at Walmart but it is sold at places like Target and drug stores also.The package says it has D3 but I don't really see an exact amount- it says 125% daily value of Vitamin D. On the side it says vitamin D 500IU per chew. The recommended dose is \"one chew up to 2 times daily, with meals for optimal absorption.\" Hope this helps. TCK",
      "MessageIndex": 1089,
      "PostDate": "14/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Dec 15, 2009 12:34PM Hannahbearsmom wrote: It 's really nice to hear about how supportive your children have been throughout. My daughter just turned 10. Up until recently, I thought that she was doing very well. My husband and I have really tried to keep the lines of communication open with her(on her level). After my BLM in Sept she seemed fine but since my ooph/hyster last week, she has been much more tearful and says she is afraid to hug me or that she might hurt me. She is also dealing with my husband having to leave next month for several months of training for Air Force Reserves. I guess her world is being turned upside down(mine too). I know that we will get through all this and be closer and stronger but sometimes it is hard to focus on the end result.  Susu1976: I'm sorry you are having a down day today. I'll be thinking about you. Take it easy and do something special for yourself. Thanks for listening everyone.  TCK",
      "MessageIndex": 1113,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Dec 15, 2009 07:05PM Hannahbearsmom wrote: Thanks to everyone for your kind words. Ronna: My PS was more than happy to order a physical therapy consult for me after my BLM with TE placement. It was extremely helpful to me. My PS did not want any range of motion exercises done until drains were out(1 week for me). By that time I could tell how far I had to go to get back to my baseline and I was worried. It was very painful doing the exercises--especially on my BC side. I even remember crying while I was doing them--but I made myself do them and it did get easier. And my PT was terrific and got me right on track. She was a 10 year BC survivor too. I would suggest asking for a referral if you think you need it. TCK",
      "MessageIndex": 1125,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Dec 21, 2009 02:56PM Hannahbearsmom wrote:",
      "MessageIndex": 1258,
      "PostDate": "21/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Dec 31, 2009 12:37PM Hannahbearsmom wrote: Gcarter: Loved the poem! I feel very fortunate to have found this site and the wonderful, understanding,supportive women here. May 2010 bring us all health and happiness!! TCK",
      "MessageIndex": 1439,
      "PostDate": "31/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jan 3, 2010 01:01AM Hannahbearsmom wrote:",
      "MessageIndex": 1477,
      "PostDate": "03/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jan 16, 2010 10:34PM Hannahbearsmom wrote: reeltchr: The Exchange city thread is excellent. Don't let it overwhelm you. The ladies there are always open to questions about the exchange process. They are a wealth of information. I just lurked there for a while beore I ever chimed in. They love newbies too. Feel free to PM me if you have specific questions and I will do my best to answer. Whippetmom on that thread can help alot with determining what size implant to have put in. You can also go to the Implant 101 thread to read more about that. Of course the women on this thread are very supportive as well.There are such varied experiences that someone can always offer advice on just about anything. I am going to PM you. Have a good night! TCK  ",
      "MessageIndex": 1744,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jan 14, 2010 11:55AM Hannahbearsmom wrote: zoegr:   Hope you have speedy, painfree recovery! TCK",
      "MessageIndex": 15,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746402",
      "Title": "How long did you wait for a surgery after you have found a lump? zoegr Raili"
    },
    {
      "AuthorID": "Hannahbears…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93988/profile",
      "Content": "Jan 7, 2010 09:52AM Hannahbearsmom wrote: Hi zoegr, I found my lump in June 2009. I went to my OB-GYN after about 2 weeks of self monitoring to see if it was going to go away. My Ob-GYN couldn't palpate it the first visit so she had me return about 5 days later for recheck--she felt it without any problem that time. She referred me to a general surgeon for followup the next week. The general surgeon felt it also. I had had a mammogram a couple of months earlier so she just went ahead that first day and did a fine needle aspiration. The results came back noncancerous about a week later but I had a very strong family history so the surgeon recommended an excisional biopsy of the lump. I had that on July 29. The lump turned out to be cancer after all. My general surgeon did not get clear margins and said I needed a mastectomy because my breasts were small and the amount of tissue needing to be removed to insure clear margins was too much. At that point I decided to go to a breast cancer specialist. I ended up have bilateral mastectomies on Sept 24. My BS did do a sentinel lymph node biopsy  Sept 4 to check that out since I was not going to have the mastectomies until the end of the month. Part of the timing was related to coordinating the BS and plastic surgeons schedules to do the reconstruction at the same time. My cancer breast actually did not have any more cancer in it after all when after pathology results came back from the mastectomy. I totally understand your anxiety related to waiting. Have you got you surgery scheduled yet? Sometimes other treatment is required first. Has your surgeon explained what is planned for you? Good luck and hang in there. We are here for you.  TCK ",
      "MessageIndex": 2,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746402",
      "Title": "How long did you wait for a surgery after you have found a lump? zoegr Raili"
    }
  ]
}