{
  "AuthorID": "happytobealive",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83834/profile",
  "Posts": [
    {
      "AuthorID": "happytobealive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83834/profile",
      "Content": "happytobealive wrote: For anyone wanting to find out about any drugs that they're taking and the side effects from actual women and men taking them look up www.askapatient.com You'll be amazed! Happy to be ALIVE! \"from the inside out\" Dx 5/10/2009, IDC, 1cm, Stage I, Grade 2, 0/2 nodes, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/740184",
      "Title": "Awesome website A MUST READ! happytobealive happytobealive"
    },
    {
      "AuthorID": "happytobealive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83834/profile",
      "Content": "happytobealive wrote: Hello everyone. Quick question if you have a minute. I have a very low grade cancer. Stage1 I had a surgical biopsy which proved to be cancerous. The doctor removed the tumor and a small margin but now that they actually know that I have cancer they have to go back in a get more margin. She also has to test my lymph nodes at that time.   My doctor wants me to have an MRI, PetScan and a Genetic test done. If I'm at Stage 1 are all these test normal to have done at this time? Is she keeping something from me that I dont know?  I hope someone has time and an answer. I'm not freaking out so to speak I just would like to know what you guys think. Thanks a bunch. Hope everyone is keeping a smile on their faces. I am.  Angela Happy to be ALIVE! \"from the inside out\" Dx 5/10/2009, IDC, 1cm, Stage I, Grade 2, 0/2 nodes, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/735108",
      "Title": "Is my doctor keeping something from me I should know? happytobealive happytobealive"
    }
  ]
}