{
  "AuthorID": "HappyAnyway",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288021/profile",
  "Posts": [
    {
      "AuthorID": "HappyAnyway",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288021/profile",
      "Content": "HappyAnyway wrote: Hello. My name is Michele. I'm 44 years old. I have been married for 21 years and am a proud stay at home mom of three beautiful girls. I found a suspicious, hard lump around the 10th of February. I waited until after my period to see if it would get smaller. It didn't. It gradually began itching, burning and stinging with an occasional sharp pain. Now the itching and pain are nearly constant. I saw my PCP on March 27 for my well visit. She promptly ordered a diagnostic mammogram and ultrasound, which I had on April 4th. I knew that she was concerned, as my yearly mammogram and ultrasound were due on May 4th. She did not want me to wait. The radiologist spoke to me after my tests and said that I should have a core needle biopsy. (I have a birads score of 4.) I had that performed at the comprehensive breast center this morning. My experience with the biopsy was a breeze. I'm sore now, but not too bad. I should have the results tomorrow or Thursday. The radiologist that performed the biopsy said that it looks malignant. She also said that she has been wrong before. She believes the mass to be bilobular and approximately 4cm. My lymph nodes look good. They are trying to get me scheduled with an oncologist for Thursday. He should order an MRI and discuss a treatment plan. I'm feeling surprisingly optimistic, whatever my pathology results are! I am not active on social media and am generally a private person. I have been reading this site for a couple of weeks now and really like the support and information it provides. I want my journey documented to hopefully help others. Blessings to all! Dx 4/10/2019, IDC, Right, 3cm, Stage IIB, Grade 3, ER-/PR-, HER2- (IHC) Chemotherapy AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870912",
      "Title": "I'd like to introduce myself. HappyAnyway HappyAnyway"
    },
    {
      "AuthorID": "HappyAnyway…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288021/profile",
      "Content": "Apr 10, 2019 11:00AM HappyAnyway wrote: I'm part of the group! Literally just got off of the phone with my radiologist, who is awesome and I told her so! All that I know so far is that I have infiltrating ductal carcinoma, grade 3. I see the surgeon tomorrow at 11:00. I have a MRI Monday at 2:15. I was informed that this should respond great with chemo and surgery and is not a death sentence. You all are the first to know. I'm about to call my husband, then my sister. I am strong and feeling strangely euphoric. Thank you all! Moving to the diagnosed board. God bless!",
      "MessageIndex": 13,
      "PostDate": "10/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870912",
      "Title": "I'd like to introduce myself. HappyAnyway HappyAnyway"
    },
    {
      "AuthorID": "HappyAnyway…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288021/profile",
      "Content": "Apr 9, 2019 05:58PM HappyAnyway wrote: Yes, so far I have received excellent care. I believe that I will be in good hands. Thank you for taking interest in me. I really appreciate it. I'm used to being the caregiver for my family. Sometimes it's nice to be taken care of. Of course, this is not the attention that I prefer to have, but I am grateful to have found a compassionate group of people to share with.",
      "MessageIndex": 7,
      "PostDate": "09/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870912",
      "Title": "I'd like to introduce myself. HappyAnyway HappyAnyway"
    },
    {
      "AuthorID": "HappyAnyway…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288021/profile",
      "Content": "Apr 9, 2019 11:00PM HappyAnyway wrote: Thank you everyone! Just one step closer to getting this annoying, itchy thing resolved! I want it gone. ",
      "MessageIndex": 12,
      "PostDate": "09/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870912",
      "Title": "I'd like to introduce myself. HappyAnyway HappyAnyway"
    },
    {
      "AuthorID": "HappyAnyway…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288021/profile",
      "Content": "Apr 9, 2019 04:00PM HappyAnyway wrote: Thanks to all of you for your kind words! I'm ready to get this show on the road. I will certainly check in with my results. Michele",
      "MessageIndex": 4,
      "PostDate": "09/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870912",
      "Title": "I'd like to introduce myself. HappyAnyway HappyAnyway"
    },
    {
      "AuthorID": "HappyAnyway…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288021/profile",
      "Content": "Apr 10, 2019 07:27PM HappyAnyway wrote: Thank you, Cowgirl13. I hope the surgeon will have the rest of the pathology results before my appointment tomorrow. The likelihood of chemo is a bit distressing, but I will persevere. If I begin to lose my hair, I will shave it off and rock some serious eyeliner and a punk look! May as well have fun with it! Hope my head is pretty and nicely shaped. We'll see...",
      "MessageIndex": 15,
      "PostDate": "10/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870912",
      "Title": "I'd like to introduce myself. HappyAnyway HappyAnyway"
    }
  ]
}