{
  "AuthorID": "HappyCamper…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199056/profile",
  "Posts": [{
    "AuthorID": "HappyCamper…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199056/profile",
    "Content": "Apr 12, 2014 08:11AM HappyCamper123 wrote: To all sweeties reading these posts.  Some of you had a very difficult experience, some not so much. My sympathies to everyone who found the procedure agonizing and terrifying.  Here's how mine went, which is not to say it is the same as anyone else's experience has been or will be.  After reading these posts I was horrified and sickened.  I talked to my surgeon about it, and asked him to tell me what he planned to do for the pain.  He said the pain level has to do with how the injections are done.  If they are slow, it hurts less.  He said I could ask him to stop for a moment if need be.  The combination of trust in this wonderful man and the little bit of control offered calmed me down.  The nuc med guy who handled preparation of the substance and hypodermic thingie (tiny tiny short needle) was very sweet and said my Dr was the gentlest of all of them and tried to alleviate my concerns without making light of them.  A nurse was there to hold my hand, which turned out not to be necessary but she was nice to talk to and said she hoped that \"when her turn came\" my doctor would be around to do it.  So, it seems that choosing a surgeon who \"gets it\" and cares (let's face it - one who gives a darn) and has experience and patience and good tecnique makes all the difference in the world.  Speak up.  Demand good care.  Good care includes pain minimization.  Any doctor who dismisses your concerns should be forced to listen and do the right thing.  It is no joke.  I was ready to simply bolt after reading the posts here.  The people treating patients as if they are just meatloaf or hysterical time-wasters need a head's up.",
    "MessageIndex": 17,
    "PostDate": "12/04/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746169",
    "Title": "Nuclear Injection pre-surgery pagowens Accepted2018"
  }]
}