{
  "AuthorID": "HappyMamaof2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203998/profile",
  "Posts": [{
    "AuthorID": "HappyMamaof2",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203998/profile",
    "Content": "HappyMamaof2 wrote: Hi there,  this is my first post and my story goes something like this: Back in May I felt a swollen, sore lymph node between my breast and underarm.  That prompted me to scour my breast and I alarmingly found a lump behind my nipple.  It has grown with time - maybe 1/3 to 1/2.  Not painful at all to touch and very firm but not rock hard according to the surgeon - slightly moveable.  I'm 35 and went to see my OBGYN and she easily felt it and sent orders for an ultrasound and mammogram.  Ultrasound and mammogram didn't pick up anything.  Tech easily felt the lump (size of a gummy bear) as well.  Whomever reviews it said \"I'm certain it's nothing.  Must be going through hormonal changes, maybe menopause.\" Um, I'm only 35 and no signs of menopause.  I'm not sold on I can feel it but can't see it, therefor it's okay.  I called my OBGYN and told her I want further testing and she agreed.  I was referred to a surgeon with a breast specialty designation.  He easily felt it as well.  Says it was probably nothing but was concerned that it should have shown up - malignant or benign.  I'm not a prime candidate for cancer as I'm relatively young, fit, no family history, use little caffeine, I don't smoke and rarely drink.  He offered me a MRI or biopsy.  I went with a biopsy because it is a guaranteed test. A week later I'm going in for a surgical biopsy under general anesthesia. When I come to, all discharge paperwork and online summary of my visit to the hospital is marked lumpectomy.  Lumpectomy?  I know what it is but I was just supposed to have a biopsy.  My incision is an inch long across the very top of my areola.  Should I be worried that a lumpectomy was performed as opposed to the initially proposed biopsy???? I have 4 days until my follow up but I'm not the most patient person.  I'm glad the mass is out but I know lumpectomy means surrounding tissue was removed as well - does this mean what my surgeon saw warranted a further investigation?  Anybody else go through this and your outcome?  Many thanks and I wish you all the best xxxx Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "16/08/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823724",
    "Title": "I had a lumpectomy not biopsy for lump. Should I be worried? HappyMamaof2 HappyMamaof2"
  }]
}