{
  "AuthorID": "happymom828…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
  "Posts": [
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Sep 21, 2010 11:58AM happymom8285 wrote: I can't say for sure.  I just know mine have been very dense for 30 years.  Had my first biopsy 30 years ago.  Have been proactive with mammos and at times ultrasound.  When my mother was dx in '94, I saw my BS every 6 months for a couple years.  I've had multiple biopsies and small lumpectomies, all benign.  My sister was dx in '98.  Back to the BS every 6 months.  I'd find a lump, it'd be taken care of.  I seriously considered, a prophylactic mast. but didn't go through with it.  Now, the proverbial other shoe has dropped and I was dx with DCIS with micro-invasion.  I did have the BMX.  I'm glad I did, because DCIS was found in the \"good boob\", too, just very small.  No telling how long that would take to have manifested itself.  I'm happy with my decision.  But, like flash says, you can't get every scrap of breast tissue. I went through early menopause (age 40).  Now 57.  I was not surprised when I got BC.  I knew it would be just a matter of time. What I couldn't figure out, with all my precautions, I was the one who discovered the lump.  So where was it last year on my mammo?  My DCIS was all over the upper quadrant of my boob!  They say by the time cancer is detected it's already been there for 8-10 years!  Go figure.  I certainly don't understand it! How attached are you to your boobs?  That's the big question.  I had to think:  they're attached to me, I'm not attached to them. As far as the estrogen being concentrated in denser boobs, I've not heard that.  I had a hysterectomy in 2000 and part of my BC was still estrogen positive.  Our bodies always produce some estrogen even after menopause or a hysterectomy. Just part of being female! So much depends on your family history, too.  Have you discussed this with your dr?  It is a hard decision, with no guarentees.",
      "MessageIndex": 2,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/757657",
      "Title": "dense breast tissue christine1111111 lago"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Oct 2, 2010 10:39AM happymom8285 wrote: Been reading all the updates. Just want to add how much this disease sucks!  And hate that some of you are having such a tough time.  It does get better!!  Just had my exchange a week ago.  My TE's were hard as rocks and I did have terrible spasms my last fill up to 475cc's.  They took my breath away.  Dr prescribed some valium.  ahhhhh.  But after 3 or 4 days I was ok.  Now I have 500cc squishee silicone implants.  Every day I get stronger.  You all will too! joystars so excited about your news! stlcardsfan--hang in there!  When I was facing my bmx, I kept telling myself, \"they're attached to me, I'm not attached to them.\"  Seemed to help. And after telling my family, I let everyone of my friends know on facebook.  A burden shared is a lot easier to bear.  My quirky sense of humor has kept me going as well.  At first I had this overwhelming compulsion to blurt out to everyone I met that I was just diagnosed with bc. We did go on vacay after my dx and got to know another couple while there.  But I never shared the news with them.  Figured we'd probably never see each other. ",
      "MessageIndex": 1146,
      "PostDate": "02/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Sep 15, 2010 11:11AM happymom8285 wrote: Hi sistas, Been off this site for awhile.  I've missed it.  But when I'm on, I do nothing else!  And when I've been off for awhile, it takes forever to catch up!  haha o2bhealthy--I went to that website.  Are all those tats he does 3D?  They were fantastic! He really should teach other tat artists his talent and knowledge.  I'm sure it would be put to good use.  So sorry you're having such a hard time. :( I've been reading here about a lot of depression and uncertainty even after a few years of good results.  I think what my onc told me has changed my perception.  He said that more and more doctors are looking at BC as a chronic disease that needs to be managed just like diabetes.  There's not a \"cure\" per se, but just like with diabetes, you learn to live with it and take advantage of the breakthru's in medicine to help it be managed.  We all know that diabetes is a killer, just like BC.  But with diet, exercise, meds and being proactive in our health will go a long way to longevity.  Our drs. are supposed to be working for US.  We're paying them boat loads of money (or at least ins., is, but I've got ridiculous premiums!) to make sure we stay on top of things.  And if we feel that we need a scan after several years of non-recurrence, then we should get it.  After all, doesn't it take BC years to form before it's even detected?  After several years, I think a scan is warranted. I really pray for you sisters in the doldrums!  This is such a great place to vent and get support. I hope I haven't ranted too much! ;)  {{{{{{{HUGS}}}}}}} to all. ",
      "MessageIndex": 3632,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Oct 9, 2010 05:24PM happymom8285 wrote: Barbara---SO HAPPY for you!!  HOOOOOORAAAAAAAY.  (I still drink!) Sheila--been very slow for me, too!  Takes forever to go from one topic to another or even to the next page. *sigh* Fighter--How great is our God indeed!  Sorry you've had to join us, but we're all here in the fight!  So glad for the Great Physician!  YOU GO, GIRL. (I grew up in Rockville!) Renee--congrats on getting the chemo behind you, what a relief!",
      "MessageIndex": 3888,
      "PostDate": "09/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 12, 2010 09:20AM happymom8285 wrote: Seems like I can't have a life outside of BCO.  I'm gone for a few days and have a terrible time trying to catch up! For those having questions or trying on bras check out the board on here.  Bras 101.  You can probably find it.  I don't know how to cut and paste on this thing.  Some great websites that carry larger sizes are www.barenecessities.com and www.herroom.com  I've bought several bras from barenecessities.  Very nice.  PS are all over the map when it comes to wearing bras after surgery.  Read the article and the posts from Bras 101.  You'll be greatly helped. Whippetmom is the bomb when it comes to knowing about our breasts.  They call her the \"breast whisperer\".  She's really great and has helped me tremendously! I know we get tired of yet another surgery!  But, we shouldn't \"settle\", either.  If you're content with your body, then so be it.  If there's a way to make it better, then we should go for it.  And drs. who tell their patients, we shouldn't expect much because, after all, we've had BC, are full of bologna.  That's not an excuse to give up and we should just be grateful for what we have.  How cruel and insensitive.  Ok!  Getting off my soap box now.  :) I do have good news!!  Had a colonoscopy Wednesday (colon cancer in the fam as well as the BC!) and it was clear!!  Clean as a whistle.  LOL.  I had one 5 years ago.  Will have another in 5 years.  I hate the prep stuff!  YUCK!  I've been told the protocol for that test has changed.  Used to be every 10 years.  Has anyone else heard it's changed to more often? Those having tests coming up, mellysu, I know, and anyone else:  Try not to borrow trouble from something that hasn't happened yet.  One day at a time.  Praying everything goes well!!",
      "MessageIndex": 4439,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 12, 2010 09:22AM happymom8285 wrote: I forgot!  Nordstroms will file your insurance for you if it's covered.  Maybe other stores will, too. I know some plans in CIGNA cover bras.  You have to check with your ins.",
      "MessageIndex": 4440,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 12, 2010 12:43PM happymom8285 wrote: Sherry, I'm glad things went well!  And no matter what kind of cancer it is, it needs to be taken VERY seriously!  Don't know about that \"adenomy\" thing either.(?)",
      "MessageIndex": 4444,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 12, 2010 01:09PM happymom8285 wrote: oakley--thinking of you, too.  hope everything comes out all right!",
      "MessageIndex": 4447,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 12, 2010 01:26PM happymom8285 wrote: raincitygirl--really?  I know my MIL can't have a colonoscopy because of a bunch of abdominal scar tissue.  She has to have a certain kind of scan, but she said it's not as reliable.  Is this what you're talking about? And Sheila, I like it too!!",
      "MessageIndex": 4449,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 17, 2010 11:04AM happymom8285 wrote: Those of you going through chemo.  My DH just sent me a link for free housecleaning for 4 months for women going through chemo. www.cleaningforareason.org  check it out and pass it along to other ladies going through chemo.  Sorry Canadian sisters, I think it's only for US residents.",
      "MessageIndex": 4566,
      "PostDate": "17/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Sep 15, 2010 11:58AM happymom8285 wrote: good news Charmaine.  thinking and praying for you granny! seyla, one day at a time.  that's all we really can do, right?  drive myself crazy thinking about the future.  one foot in front of the other.....",
      "MessageIndex": 3635,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Oct 18, 2010 11:06AM happymom8285 wrote: Good morning! If I can weigh in on the treatment stuff.  No chemo, no rad (BMX) and no Tamoxifen.  I will however, see the onc every 6 months for awhile until I feel comfortable.  He did tell me \"signs\" to look for in recurrence:  A cough that lasts more than a couple weeks, bone aches that last more than a week and I must do a SE of all around my armpits/lymphs for lumps.  Any of the above and he said to see him immediately.  So, it's nice to know what I should be looking for.  Complete hysterectomy so nothing there to be checked out. :) Val--welcome home.  Glad you had such a great time with the grandbabies.  Ahhh.  I love my grandbabies.  The best!!!  But, they do tucker me out!  haha",
      "MessageIndex": 3990,
      "PostDate": "18/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 12, 2010 01:55PM happymom8285 wrote: Thanks raincitygirl. Sheila, I've had 3 bone density tests over the years.  I do have osteopenia.  But it hasn't gotten any worse, or any better.  Been on Boniva now for several years.  Plus, now I'm being serious about calcium and vit.D supplement.",
      "MessageIndex": 4452,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Dec 22, 2010 11:26AM happymom8285 wrote: To all those struggling with loss, SE's, the blues, medical decisions....May God give you peace!  Healing!  Joy!  Comfort!  My prayers are for all of you. Welcome, Newbies!  Altho, the circumstances suck, you are welcome here to vent, get support, become knowledgable and no judgments! I've posted new pics of my 2 weeks post nip recon.  No more Nip Hat!!  Hallelujah! :) I won't be back on until after Christmas.  Let me just let you all know----- May you all have a Wonderful, Happy, Peaceful Christmas and Holiday.  Much love and thanks! Dee",
      "MessageIndex": 5454,
      "PostDate": "22/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 29, 2010 09:35AM happymom8285 wrote: Good morning all!  Happy Cyber Monday.  I will be doing Christmas shopping online, today, in my jamies!!  haha Oakley--so sorry you're feeling down.  Hope you never get too tired/sad to come here.  We're here for you! Michelle!!!  Oh yippee!  I trust you're recovering well at home.  Glad you were \"sprung\" in time for Thanksgiving!  VERY HAPPY the news is good!!! 3jays, sending my condolences, too! :( jp3--Welcome!  You're in the right place.  These ladies on here are awesome!  I was DX'd this past summer, too. BMX, TE's, exchange.  It's a roller coaster. I was DX'd years ago with osteopenia.  I was on fosamax for a couple years, but have been on Boniva now for 2-3 years.  I also take calcium and vit. D.  Have had 3 bone density tests and it's not getting worse.  I know there's controversy about fosamax (haven't heard it about boniva), so it's between a rock and a hard place.  But when you think, that even a sneeze could cause a breakage, I decided to go with the prescription.  Meece--so happy for you.  Joining your happy dance.  Congrats! Welcome to all you other newbies.  Sad for you, but happy you've found us! Had a wonderful Thanksgiving with a bunch of my family.  Couldn't post much, as my sister's computer died while visiting!!  You ladies, were in my giving thanks prayer, for such support, encouragement, and strength.  THANK YOU!",
      "MessageIndex": 4860,
      "PostDate": "29/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 30, 2010 02:05PM happymom8285 wrote: Unfortunately, there's nothing to be done with the little black floaters!  Too dangerous to try to get inside your eyeball.  Do more harm than good!  I wish they could be gotten rid of, very annoying!! They're caused as we get older (hrumph!) as our vitreous gel becomes more fluidy.  Dang, if it's not cancer, than it's old age!  lol Sheila, you need to get it checked out and make sure your retina is ok.  Don't put it off.  So sorry about all the aches and pains.  We've become conditioned to have the first thought in our minds of the big C. rainnez, hoping your daughter is ok.  Was she due for her period?  Sometimes a bruised boob is alot more tender. ",
      "MessageIndex": 4877,
      "PostDate": "30/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Dec 3, 2010 02:25PM happymom8285 wrote: jp--  so sorry to hear about your margins still not being clean.  My breasts were very small.  Lumpectomy was not in the cards.  But I had already decided to do a BMX.  In hind sight I'm glad I did.  My DCIS was all through my breast at 10cm!!!  Huge!  They had no idea it was that large.  They also found it in my \"good\" boob!  Very minute.  But it was there. Such a tough decision and a very personal one.  I'll be praying for wisdom and peace for you as you decide what to do.  It's not easy.  But I don't regret my choice.  Plus, I'm very happy with my new foobs! onestep-- hope your day was good and a success.  Hang in there.  Praying. boatergrl-- hang in there.  It seems the protocol for young BC victims is to throw everything at it. Praying for wisdom for you, too. Sending {{{{{{{{{HUGS}}}}}}}}}} to all you wonderful, fighting ladies! ",
      "MessageIndex": 4949,
      "PostDate": "03/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Dec 13, 2010 08:00PM happymom8285 wrote: still have several pages to read, just such a busy time! nanadee--i was the same way.  very diligent.  aunt died of bc, mom dx in '94. sister dx in 98.  lots of fibroadenomas over the years, biopsies.  finally turned into bc. bmx this past july.  one side was able to save my nipple.  cancer side, no.  exchange for new foobs in sept. just had my nipple recon this past monday.  so far so good. the mastectomy decision was a no brainer for me, too. onestep!  how are you feeling???  one down....... val--am praying for your daughter.  most of my adult life has been dealing with papilomas, fibroadenomas, cysts you name it!  don't blame yourself!!  not your fault. glad your tests came back great.  congrats to you, outsidethebox!!  yay for the end of chemo!! had my nipple recon this past monday.  posted pics on the pic forum.  was awake the whole time.  interesting procedure.  am feeling good!! just have to wear this silly plastic cap to protect it for 2 weeks.  i look like 1/2 Madonna!  haha",
      "MessageIndex": 5246,
      "PostDate": "13/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Dec 14, 2010 04:24PM happymom8285 wrote: jo1955-- I went through premature ovarian failure at age 40.  I was on the prempro for many years then had a total hysterectomy in 2000 and was switched to just premarin.  In my opinion, I don't think the estrogen had anything to do with my bc.  I took estrogen of some kind for 17 years.  Much more than the average taker.  I've had breast issues for over 30.  I know it's certainly personal, but I really don't think taking the pills had anything to do with my bc.  However, now that I know my BC is estrogen fed, I quit.  According to the info I got when first dx, by the time we feel a lump the cancer has already been there for at least 8 years!  So it seems to me, if we are already predisposed, it's gonna happen!  :-)  The \"good\" far outweighed the \"bad\" in my case.  Choices, choices, choices!  What is one to do?  :-) 3jaysmom---my, my, my!!  love it!  I wonder if I decorated my DH..........twinkle, twinkle.  And those on Femara, Tamo, or Arimidex, if it's not working for you, try something different.  They all have different SE's that don't affect everyone the same way.",
      "MessageIndex": 5290,
      "PostDate": "14/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Dec 18, 2010 07:33PM happymom8285 wrote: I just can't keep up!  RENEE!!!!  Praise God for answered prayer.  Doing the happy dance! MEECE-- so sorry about your SIL.  Keeping your family in my prayers.  May the God of all comfort be with you!",
      "MessageIndex": 5398,
      "PostDate": "18/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Aug 18, 2010 03:11PM happymom8285 wrote: Hi all---what are 3D tatts?  Can anyone explain? And I think \"try-ons\" is a really good idea, Michelle!  They have them for little kids. :)  I know I'll need one for my right side.  I also know the lady my PS uses.  She's very good.  Of course, it costs extra and not covered by ins. ??? (another subject! lol)  inthepink--will be thinking of you tomorrow. Ask as detailed questions as you can. Maybe take your path report with you and have him spell out exactly what you're seeing.  I'm doing that with onc #2.  I didn't with #1. Keep us posted!",
      "MessageIndex": 3338,
      "PostDate": "18/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Sep 22, 2010 12:14PM happymom8285 wrote: Hope you're feeling better, granny.  Glad to hear things went well.  Take care of yourself. o2bhealthy--have you gotten your results yet?  thermal, huh?  hope it turns out good for you, too!",
      "MessageIndex": 3694,
      "PostDate": "22/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Oct 18, 2010 11:07AM happymom8285 wrote: o2bhealthy, hope your visit went well!  How did it go?",
      "MessageIndex": 3991,
      "PostDate": "18/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 2, 2010 01:08PM happymom8285 wrote: I have GOT to get on here more often!!  It's taken forever to read all the updates.  :) Michelle, so sorry to hear of your dx.  But, it's probably the most treatable and least aggressive (as someone has already said) cancer you can get.  Makes sense of the weight gain! I can't remember all the good news and the bad that's going on, but I'm glad for the updates.  Those who are in good shape with biops and tests, so happy, happy, happy!  Rejoicing with you. Those who are facing bad news, uncertainty, am praying for you all.  Welcome, newbies.  We're glad you've found us.  There are totally awesome ladies on here that have been through hell and back.  We love offering, prayer, support and encouragement to you!  No question is too dumb.  More than likely, someone has already been through it. Hopefully, I can get more specific, when I'm not so behind on my reading. :(",
      "MessageIndex": 4182,
      "PostDate": "02/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 7, 2010 12:01PM happymom8285 wrote: Deb--so happy for your MRI results!!  Happy Dance! Mellysu--2 years.  That's something to celebrate! lexy--BMX in July.  Left side was prophylactic with NS.  But not the right side.  Cancer was too close.  My BS likes to save the nips if he can.  He said studies have shown that having your nipple spared hasn't changed statistically whether it's there or not for recurrance.  So, I have one with and one without.  I will be having my new \"fipple\" surgery in Dec.  Then a tat.  If I had no nips, I would def. consider 3D tats.  No surgery.  They look awesome and real, yet won't show through clothing.  rae--thanks for explaining the HER thing.  I know I'm positive, but not the numbers.  And my onc said no herceptin, even though it's considered normal treatment.  So maybe my numbers were low enough.  He just thinks my recurrance rate is so low, it wouldn't do any good or change anything.  I'm glad I had the recon.  I love my new foobs.  But to look \"even\", I need my other nip.  haha.",
      "MessageIndex": 4315,
      "PostDate": "07/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 7, 2010 04:36PM happymom8285 wrote: Char--hoping your tests come out just fine.  There's always that thought in the back of your mind, what if?  One day at a time! Happy Anniversary.....I think.   But you know what I mean.",
      "MessageIndex": 4325,
      "PostDate": "07/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Aug 17, 2010 03:38PM happymom8285 wrote: Newbie here!  Stage 1 BMX 6 weeks ago.  So glad to be here, sorta. ;)  I know we'd all rather be somewhere else.  But I know God has good plans for me.  So, I'm just starting my journey and already have been greatly encouraged by you. Vickie--hard to play the waiting game, isn't it?  Did all this come out of the blue for you?  Do you have your initial path report?  If so, then so will your onc.  He/She will know or evaluate your best treatment.  After my initial talk with my onc, his reccommendation was just tamoxifen for me.  I've resisted.  But started it yesterday.  At least, once you leave the office and get your Onco tests back, you might be better able to ask some more detailed questions.  I'm getting a 2nd opinion.  Still not sure I need Tam.  But I have even more questions now that I'll ask onc #2, then I did with the first one.  And, you can always get a 2nd opinion.  I guess going back for a mastectomy is not an option?",
      "MessageIndex": 3328,
      "PostDate": "17/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Sep 17, 2010 03:07PM - edited Sep 17, 2010 03:10PM by happymom8285 Val--my onc said the same thing to me a few weeks ago, that drs. are looking at BC as a chronic disease just like diabetes.  I had never thought of it that way.  And now you say you've heard somebody else say the same thing.  Must be something to it. o2bhealthy--I really hope you're able to get some relief and answers!  Praying.",
      "MessageIndex": 3660,
      "PostDate": "17/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Sep 27, 2010 09:32AM happymom8285 wrote: Pepperidge Farm Milano Double Chocolate..guilty pleasure.  Weird, since my bmx, I can't get enough chocolate. Thanks for the well wishes, everyone.  Feeling stronger every day!  See my PS tomorrow morning!  Bandages off.  More pics coming. Hope eveyone has a great Monday. Renee, don't feel badly about not being able to stay up.  Your body needs all the rest it can get to build you back up again.  Listen to it.  I used to be a night owl, too.",
      "MessageIndex": 3777,
      "PostDate": "27/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Oct 6, 2010 12:46PM happymom8285 wrote: Hi all, catching up. BarbaraA--hope things go well for you tomorrow. Granny--so GLAD you're doing well! Sheila--love the balloons and nips!!  Also that moon pic was awesome! stormsmith--welcome!!  you've come to the right place.  When I had my initial path report from my biopsy, it was DCIS stage 0.  Then when it all came in they found microinvasion, so I was bumped up to stage 1.  I hope all your report is in!  And, yes, if it's just DCIS, it's stage 0.  I ended up going with a BMX.  But, family history played a huge role in my decision.  For years, I've had very dense, fibrocystic boobs.  Lot's of biopsies.  So when I got my dx, it was a no brainer for me.  So happy I went with my decision, turns out the non-cancer boob had a 4mm DCIS, too!  No telling when that would have manifested itself.  IMHO, I think it's just a matter of time before it comes back, whether in the other breast or the same one.  I have a friend who is really young.  Her BC is back for the 3rd time!!  She's already been on tamoxifen for years.  I think it's time for a BMX.  But she's going to have to decide that for herself, just like you.  Read up.  Do your research.  Find out family history.  It all comes into play to help you make an informed decision for YOU!  Whatever you decide, we're here for you! Val--have a great time with the grands!  What a blessing they are! As usual, girls, so good to read all the updates.  Those losing their hair....may you all find a wonderful hair fairy to help you... *sigh*",
      "MessageIndex": 3860,
      "PostDate": "06/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 17, 2010 08:18AM happymom8285 wrote: Welcome, Newbies, you're in the right place. Praying for all the tests being done this week and those waiting for results! boatergirl--from what you've posted as your DX, hoping the onc appt goes well.  We have very similar DX. o2bhealthy--so glad you won't have to face more treatment.  Compared to what you've already been through the thyroid is almost a no-brainer! Hi onestep!!! I love how you all can post the nicest pics!",
      "MessageIndex": 4555,
      "PostDate": "17/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 17, 2010 08:24AM happymom8285 wrote: Praying for you, MIchelle!!!",
      "MessageIndex": 4559,
      "PostDate": "17/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 17, 2010 10:58AM happymom8285 wrote: Hang in there Penny!  Praying for a good turnout!",
      "MessageIndex": 4565,
      "PostDate": "17/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Dec 31, 2010 01:32PM happymom8285 wrote: Hi all!! Just popping in to wish all my friends on here a BLESSED, HEALTHY, HAPPY NEW YEAR!  No pics from me!  haha All newbies, WELCOME!  Sorry you have to be here like the rest of us! :( Debbie (?) I think...can't remember, about having a BMX.  I did.  No regrets.  Why would your docs think it wouldn't help you to have a BMX? We had a WHITE CHRISTMAS here.  First one in over 20 years.  Beautiful.  Been cold.  Finally warming up. Going on a sleep over tonight with our 7 yr. old grandson at the TN Aquarium.  First time.  I don't think I'll get much sleep on a hard floor!  haha You're the BEST ladies!  Here's to GOOD news in 2011.  See you next year!",
      "MessageIndex": 5761,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Sep 26, 2010 12:36PM happymom8285 wrote: Val--just read your horrible story about your DD and grandkids.  So glad they are safe.  You said now they need a new vehicle.  What did insurance say?  The neighbor was a fault.  I hope they get a BIG settlement and they can buy the \"new\" used car.  To you others, just starting this journey, or first time posters, you're in the right place.  We're here for you.",
      "MessageIndex": 3757,
      "PostDate": "26/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Sep 26, 2010 12:36PM happymom8285 wrote: Oh and I forgot....GREAT news, granny!  Really glad! btw--had my exchange surgery Friday and I'm doing fabulous!",
      "MessageIndex": 3758,
      "PostDate": "26/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 2, 2010 01:34PM happymom8285 wrote: Yeah, don, me too!  I love my new foobs!",
      "MessageIndex": 4184,
      "PostDate": "02/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 5, 2010 07:27PM happymom8285 wrote: Hi all-- Granny, just catching up and was horrified to read about your GS.  But, I'm glad the drs have patched him back together.  I'm sure he'll have a long road ahead of him.  Will be praying God heals him.  One day at a time. {{{{{{{{{{{{{{{HUGS}}}}}}}}}}}}}} Newbies, sorry for your recent DX's.  This is a hateful disease, but you've come to the right place. VAL--GOOD NEWS!! Have a great night.  Date night with DH!",
      "MessageIndex": 4252,
      "PostDate": "05/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 7, 2010 04:32PM happymom8285 wrote: Sheila--DCIS is usually Stage 0, but I had microinvasion, 3 multifoci.  So was upgraded to Stage 1.  There's just no way for me to put the microinvasion status, or at least I don't know how.",
      "MessageIndex": 4324,
      "PostDate": "07/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 12, 2010 10:02AM - edited Aug 20, 2013 06:10AM by happymom8285 Thanks Sherry!  That's good to know.  How's your husband?",
      "MessageIndex": 4442,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 17, 2010 08:23AM happymom8285 wrote: Those still concerned about bras:  check out the other thread on here Bras 101: The Great Post-Exchange Debate. I was told by my PS to wear an underwire.  The biggest thing about bras after recon is to make sure they are encapsulated and not able to migrate anywhere until the implant has settled into the pocket.  It can take months to do this.",
      "MessageIndex": 4558,
      "PostDate": "17/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Nov 20, 2010 03:45PM happymom8285 wrote: So glad for all the good results!!!!  Thank you God.  The memory issues are affecting me, too.  But, it's also a result of menopause, too!!  We're stuck!  Ever since I had to stop taking estrogen..... ",
      "MessageIndex": 4645,
      "PostDate": "20/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Dec 13, 2010 08:35PM happymom8285 wrote: Barbara-- CALL in the AM.  Better to be safe than sorry.  Nobody knows what you're going through better than you! Renee, will be praying for you, too.  I live in Chattanooga and we had quite a bit of snow, too.  It's so cold here now.  Supposed to be getting down in single digits tonight!!  DH didn't have school today and a 2 hour delay tomorrow! As far as saying you have/had bc, my onc from Johns Hopkins says more and more drs are looking at treating bc as an ongoing disease, just like diabetes.  Not really cured, but having to be managed.  Weird, huh?  I usually say I was dx with bc in June and have been a 6 month survivor!  Val--when my sister was dx with cancer, my mom felt terrible, and then when another daughter was dx (me!)  she did go through a time of guilt and what the heck did she pass on to us.  We told her we certainly didn't blame her.  And I'd much rather have lived and been dx with bc, than not to have lived at all!  Medicene has come such a long way.  And yet, I was BRCA negative and so is my mom!  There is something genetic, I know.  Just hasn't been discovered yet!",
      "MessageIndex": 5252,
      "PostDate": "13/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Dec 14, 2010 12:29AM happymom8285 wrote: Sheila, I see the tree and Merry Christmas on the top and bottom (that was there earlier).  Love it. grannydukes--so sorry your back is hurting!  ugh. keep the faith, sista! jo1955--are you still on the prempro?  I was just on premarin until my dx.  Of course, the hot flashes were terrible.  When I saw my onc., I had circled having them when I filled out my med info.  He said were they giving me trouble and I said, yes they were.  He asked if I wanted something for them.  NOT estrogen.  Wow!  I didn't know there was something I could take for hot flashes.  It's Effexor.  A very mild anti-depressent.  I take one time release capsule before bed and my hot flashes have nearly gone!  So nice.  Ask your dr if you're a candidate. onestep--glad you're tolerating the chemo so far.  I do hope you've just caught a cold and you start feeling better soon.  :-)",
      "MessageIndex": 5265,
      "PostDate": "14/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Dec 18, 2010 07:39PM - edited Aug 20, 2013 06:26AM by happymom8285 Val--Thank the Lord for more answered prayer.  You can finally let that breath out you've been holding for the last several days.  Ahhhh.  Just GREAT news!! Also, have a safe and wonderful Christmas with your family! Those starting rads, hang in there.  HUGS to you all!",
      "MessageIndex": 5399,
      "PostDate": "18/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "happymom828…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107135/profile",
      "Content": "Sep 2, 2010 01:33PM happymom8285 wrote: How terrifying.  So glad her BP is down. Praying for God's comfort and wisdom for all of you!",
      "MessageIndex": 79,
      "PostDate": "02/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757424",
      "Title": "Today was frightening day Kimberly is in ICU dhmeiser RobinWendy"
    }
  ]
}