{
  "AuthorID": "harvey",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
  "Posts": [
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Oct 28, 2012 11:27AM harvey wrote: Its just below freezing and we are expecting snow soon. Have had to put more heating on - I  dont now how I'll pay for it but thats for another day. Winter has came to Scotland a wee tad early. Harvey",
      "MessageIndex": 5,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795561",
      "Title": "OT...Can you say freezing! LuAnnH"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Mar 17, 2013 06:56AM harvey wrote: I like to think that I'm not a gloomy person and am trying to have thebest quality of live I can, regardel of the cancer. My oncologest and physio are big time into happy chappy makes you healthy. Both are pleased that I have control of my bladder back and can mobilise with one stick. I'm sick of them telling me - that I have done this with my cheerful determanation.  I get really angry with friends who send me cancer cures. eg eat  a ton of lemons, or if you had never eat/ drunk mild produce you would not have cancer. That was from a friend who had the all clear from skin cancer? I save my real rage for the friend who told mre that God sent me cancer because he loved me so. Well I can do with out that kind of love. I'm beging to really think that if i kill one of my well meaning , stupid well meaning friends - it would be just aviable homocide. Bad things happen and I'm trying to do the best I can - and enjoy what I can. Cheerful chappy or Smilly Annie I dont nead to be. Good days i'm really happy - bad days/ dark days well I'm allowed to be sad. I have a sh**ty disease running up and down my bones. It causes pain, stops me dancing or running - why should I have to smile all the time.",
      "MessageIndex": 76,
      "PostDate": "17/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800634",
      "Title": "Just think positive... BouncingBetties PinkShirtNow"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Aug 22, 2012 08:23PM harvey wrote: Just an update - the pain and sickness over the weekend was not due to the MRI- cause unknown. I got a suprise telephone call from the unc - there has been some movement at T2 - surgens dont want to operate as they think its not in my best interests. But could I be at the  Edinburgh Western hospital in  1and a halve hours. We got there with time to spare. Now I never knew I had a tomour  at T2 thought it was at T4. T4 -T7 have aready been sapped, Now 2-3 will get the works . aked about surgery - my tomours are at the front of the spine - so surgens would have to go in through my breast bone - its not possible to remove all the cancer andi it's porrible I would be quite badly disabled. So have agreed to go with the plan. Thanks for your support ladys ",
      "MessageIndex": 13,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792055",
      "Title": "worried - but am I just being paranoid harvey harvey"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "harvey wrote: Things are starting to look up, I can mobilise a bit using a walking frame or crurches. The tight band around my chest has easied and I have pain from the mets back. Pain is being controlled by morpine - but the  fact its back means the spinal compression has eased. I had a meeting with my uncologist, braggedthat I was getting better and the meds seemed to be working. MMmm says her- in the light of that we had better get an MRI as soon as possilbe. Dont worry its only routine. Next day I get a telephone call from rad technition, they can fit me in Friday morning. Great - I'm so glad you could fit me in so soon.  We wish it could be sooner comed back the reply we aim for under 48hours in these circumstances . Does this sound like a routine appointment - am I just paranoid. Gloria  If the glass is only half full - get a smaller glass. Now your glass is full again. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792055",
      "Title": "worried - but am I just being paranoid harvey harvey"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Aug 21, 2012 11:22AM harvey wrote:  Ladies Thanks for your good wishes . I tried to telephone the unc - yesterday but she was having a day off. However the nurse will phone me back later today and give me any results. I've not to worry as no news is good news. Mm I hope so -but it could be no news- because the doc was on days off. Gloria ",
      "MessageIndex": 12,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792055",
      "Title": "worried - but am I just being paranoid harvey harvey"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Nov 2, 2012 09:26AM harvey wrote: Trevor, I'm so sorry for your loss. May God hold you all in the palm of his hand and help you through this sad time.",
      "MessageIndex": 40,
      "PostDate": "02/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795781",
      "Title": "I've lost my maria Trevor Heidihill"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Sep 29, 2012 12:26PM harvey wrote: Hope you all have a wonderfull timeto night. May you get as many years are you need and enjoy every moment of them. regards Harvey ",
      "MessageIndex": 2,
      "PostDate": "29/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794197",
      "Title": "Blessed lukejessesmom LuAnnH"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Aug 13, 2008 07:27PM harvey wrote: I was dx stage 3 grade 3 in Feb 2006 had surgery chem rads and then onto Adrimetex. I stoped the Adrimetex as the side affects were so bad thee was no way I could go back to work. My onc tells me he considrs me cancer free and I shouldnt worry - what will be , will be. In late 2007 I had a scare , sore head and lose of sight in right eye, not cancer a small clot got stuck in the optic nerve. Then early this year I found a lump in the other breast - big scare. It turns out to be a fatty thing caused by surgery. My onc says see I told you there is no need to worry - I see him once a year and his is trying to make me accept a mamogram every 2- 1/2 years. No way - no how. I worry - I would worry if I was stage one. To many woman have died after being told they wil be ok. Harvey",
      "MessageIndex": 3,
      "PostDate": "13/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/719462",
      "Title": "onc says my stage III no big deal scorpio QueenSansaStark"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Feb 6, 2013 02:31PM harvey wrote: I've had a great laugh - were I understood what was what. So gumboots - are they wellington boots ( wellies where I live) Subs - bread rolls? Ok I'm in Fife - Scotland and we say dag for dog, fell hairy is frightning , while gaeing doon the road fur the tea - is going to the shops to buy food for the days evening meal. Mind  tea can be a fish sooper, or a pe,( pie) or puddin sooper. It just means with chips- french fries  not crisps. or just a cup of tea. We buy bread by the half loave - though there is a crust at both ends, eat spaggety bog in stead of mince and tatties. I carry a handbag with my purse inside it. Pants are what I wear under my trousers or jeans. Have problems cooking using cups as a measure - much prefer ounces or even grams. i have several cups - all different sizes. or it could be my bra size. Glo",
      "MessageIndex": 75,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799912",
      "Title": "OT - Regional Ways of Speaking redwolf8812 HLB"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Oct 11, 2012 02:44PM harvey wrote: congratulations , Hope you had a lovely day.",
      "MessageIndex": 43,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794782",
      "Title": "I made it to the big 50!!!! LuAnnH Annie62"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Aug 28, 2012 08:04AM harvey wrote: Sending good vibes and load of hugs. I hope the meds kick in soon and the sun shines for you. I'm really gald we dont have basesments in Scotland - your really brave - what about the spiders. Remember the unknown is harder to deal with.  xx ",
      "MessageIndex": 7,
      "PostDate": "28/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792654",
      "Title": "Rainy Days and Mondays.... RobinNY LuvRVing"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Jun 30, 2012 01:35PM harvey wrote:  I wore jogging bottoms - an Ahh bra and a T - Shirt , no metal any where and never had to change into a hospital gown.",
      "MessageIndex": 14,
      "PostDate": "30/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789878",
      "Title": "Scan time and yoga pants myangels nancyh"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Feb 11, 2013 08:39AM harvey wrote: Original diagnosis 2006, Surgery - 1/3 of left breat removed, chemo the rads. Declaired cured by both surgeon and oncologest. 2012 May lost feeling to bottom of feet and legs just doing their own thing. Just like when your legs jump when your on the edge of sleep. End of May in hospital waiting for tests when I became paralysed from the breasts down. June 2012 diagnosed with stage iv cancer with spinal compression. had steriods and pallitive rades to two area of my spine - third area is more stable. Now have feeling in feet and legs - I can mobilise though its a lurch more than a walk and am able to manage my bladder and bowells.  Resent bone and internal scan show no spread and no change to spinal mets. My GP is suprised that I have no spread to internal organs. Mostly I keep quite well, apart from pain and fatigue i keep quite well - the ladies who have lived with this illness for umpteen years give me hope that I will die at 80+from old age. Gloria",
      "MessageIndex": 84,
      "PostDate": "11/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774391",
      "Title": "How long since your stage 4 diagnosis? Iwillwinthisbattle harvey"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Nov 9, 2012 06:21PM harvey wrote: Nice toiletries for the older ladies, A gift token to a beauty parlor for the  young woman and a book or book token for her 10 year old daughter. My grand daughters would love a book token or a manicure. Hope this helps, I'm sure others wil be along soon to give you more ideas",
      "MessageIndex": 2,
      "PostDate": "09/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796126",
      "Title": "OT- Holiday Gifts neogirl soleil505"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "May 12, 2013 06:39PM harvey wrote: I was  told how lucky I was to get disability living allowance and no longer having to work. I loved working -plus I get in a month wat I earned in a week. yes the benifits help pay my bills - but no money left over for holidays or just buying treats. I really can't understand, if getting benifits because I am ill with stage 4 cancer, is so great - why no one wants to swap- not even the idiot who seemed to thin I was on a good thing.",
      "MessageIndex": 718,
      "PostDate": "12/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Feb 16, 2008 09:16PM harvey wrote: I had my surgery 14/02/06. I already knew I had cancer just not how bad it was. Still after chemo and rads - I'm doing well, just getting old.:) harvey",
      "MessageIndex": 4,
      "PostDate": "16/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/700382",
      "Title": "valentine'd day means bc to me jerseymaria yellowfarmhouse"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Feb 10, 2013 05:33PM harvey wrote: I'v gave this a lot of thought and must admit I think that assisted suicide is a good tool if that what you want. I'm in the UK were we have  care pathway to make death easy for the person, the family and the care staff. I find it really frightning. Once a doctor has decided your in the last days or hours of live , all treatment is stopped. This can also mean fluids and nurition are not given. Large doses of pain meds are given as are drugs to stop the production of excess saliva and and twitching. The over production of saliva makes for noisy breathing, while the uncontrolled twitching can destress the family. The care plan is to give the patient a pain free, dignified death. Some people have lingered for days and die from dehydration. So I have my end help stored near my bed - when the time comes I hope to be able to use it - I would much prefere to look death in the eye and spit one last time in his face. ",
      "MessageIndex": 16,
      "PostDate": "10/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800184",
      "Title": "Sensitive question... Renae64 MartyMart"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Jun 22, 2012 04:17PM harvey wrote: Thanks for the good wishes. I've had the treatment plan. Meds to keep the bones strong and hormone tablet to take care of the eostergen my body makes. Because the cancer at T4 is inside the bone - I'm not suitable for surgery. If- when he other spots cause problems or to much pain - I may get a blast of rads.",
      "MessageIndex": 8,
      "PostDate": "22/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789404",
      "Title": "After 5 year NED - I'm back harvey BouncingBetties"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Nov 7, 2012 04:49PM harvey wrote:  Sorry to hear your going through this - hope you feel better soon. Hugs and best wishes",
      "MessageIndex": 11,
      "PostDate": "07/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796018",
      "Title": "Keep rollin with the punches texasrose361 texasrose361"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Feb 6, 2013 05:04PM harvey wrote: Evans, i am so very sorry to hear you had bad news with your scan. I will add you to my prayers and ask God to hold you in the palm of his hand. Sorry that you couson has lost has lost her battle - this is a cruel disease. However that dos not mean your about to loose yous.  There are treatments being added all the time. Plan your sons birthday party - then enjoy it. Of course you will mourn the death of your couson - but take what joy you can from each and every day - you deserve the smiles, kisses  and hugs your son gives you. Hugs are food for the soul and feel good too. Gloria",
      "MessageIndex": 6,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800064",
      "Title": "Bad scan. Need prayers Evans1128 Cafelovr"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "harvey wrote: Hi, After 5 years NED I'm back. I have 3 tumours in my spine. The one at T4 is causing spinal compression. I can pull myself along a short distance using a walkinf frame. I able to manage my body habits - just. If any one else has spinal compresion- I could  really do with some advice on how to live with this. At the moment I have carers coming into get me out of bed -and my hubby does all the cooking cleaning as well as helping me move about. Uncoligest says I'm in no danger of dying soon, I'm not sure thats good news, its a lot to getmy head round. Harvey  If the glass is only half full - get a smaller glass. Now your glass is full again. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789404",
      "Title": "After 5 year NED - I'm back harvey BouncingBetties"
    },
    {
      "AuthorID": "harvey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/37407/profile",
      "Content": "Nov 13, 2012 05:08PM harvey wrote: I had the red devil as part of my chemo, 6 doses, over 6 years ago. At first I found weeing red really funny - not for long though. Got home from the first cycle and found I could no longer drink coffee. I had the shakes and my head was pounding, drank energu drinks for the next 4 month or so. Worse side affect - the constapation , some nights I walked the floor, in to much pain to sleep. I soon leart to drink enough water to float my teath. My digestive system has never recovered and being on morphine just makes things worse. I lost the feeling in my toes and fingers, I never got the feeling back in the tips of my fingers. I did get a good side affect - i had became alergice t omyself. My skin blistered and fell of , my joint were swollen and the skin in my face, knees and hands wouls split and bleed. I was a mess - selotaping toes nails down and taking steroids by the hand ful. Since I had chemo there has been no sign o this. Doctor thinks the chemo killed of the  anti bodies causing theproblem. Has any one else had an unexpected good side affect from thier chemo.",
      "MessageIndex": 16,
      "PostDate": "13/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796231",
      "Title": "On to the red devil.... frankandfernsmom susan3"
    }
  ]
}