{
  "AuthorID": "Hats2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/271879/profile",
  "Posts": [
    {
      "AuthorID": "Hats2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/271879/profile",
      "Content": "Jun 3, 2018 01:15PM Hats2 wrote: Congrats! to all who have finished and hang on for the April crew who have a few to go. I finished boosts on the 31st and already the rashes in the lymph treatment areas (finished 2 weeks earlier) are subsiding. Now the red areas are turning tan color. Continuing the green tea, calendula and A&D ointment to hurry the healing.  I had right side treatment and my right ear canal is plugged. I asked the RO at my last visit and he dismissed it as no way any scatter reached that area. Has anyone else had an inner ear disturbed by their treatment?   Just curious. Completely manageable, but I don't like the 'dismissed' attitude.",
      "MessageIndex": 316,
      "PostDate": "03/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/863514",
      "Title": "April 2018- Starting Radiation LiMa66 PrincessButtercup"
    },
    {
      "AuthorID": "Hats2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/271879/profile",
      "Content": "Apr 21, 2018 07:58PM Hats2 wrote: Hello ladies I'm joining you for the radiation roller coaster. You are providing lots of encouragement. I had 3/30 yesterday after what seemed like lots of delays and missteps. I'm lucky in that I'm comfortable with my arms over my head and head turned for the treatment. It seems like it takes a long time for the techs to get me into position but then treatments are pretty quick - 5 minutes. I've tried to count the timing of the exposures (does anyone else do that?) and each exposure is slightly different but also different from day to day. It's on my list of questions for my RO. I feel so bad for those of you who have had to wait in waiting rooms, reschedule and then are dealing with variable schedules. I'm lucky to have landed an 8 a.m. spot so the techs and I start our days together every day for the next 6 weeks. Enjoy your weekend!",
      "MessageIndex": 169,
      "PostDate": "21/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/863514",
      "Title": "April 2018- Starting Radiation LiMa66 PrincessButtercup"
    }
  ]
}