{
  "AuthorID": "Hcruz13",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263351/profile",
  "Posts": [
    {
      "AuthorID": "Hcruz13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263351/profile",
      "Content": "Hcruz13 wrote: I am very concerned. About a month ago I was picking at a scab on my left nipple from a cat scratch when I noticed a clear fluid come from one duct. I thought that was weird, and asked my husband had noticed anything and he said one time in May it happened, but I had just taken a shower and chalked it up to water. I waited a month to see if it cleared up and everyday it still comes out. I have a history of hormone issues and was given a pill to start my my period at 16. My breast still looks fine and I didn't feel any lumps. I scheduled a breast exam at Planned Parenthood next Tuesday. I have no insurance. One of my great aunt had breast cancer and she also had cervix cancer. My grandmother is being treated for cervical cancer. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860206",
      "Title": "Clear discharge from one duct Hcruz13 Hcruz13"
    },
    {
      "AuthorID": "Hcruz13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263351/profile",
      "Content": "Hcruz13 wrote: I went to planned parenthood as I have one breast duct on my left duct getting a clear, sticky fluid out of it when the breast squeezed around the nipple on and off the past 6 months. They found no lumps or other abnormalities during the breast exam and assured me that it as highly unlikely a cancer issue and pulled blood for Prolactin and Thyroid. It turns out my thyroid levels are not normal and my prolactin was slightly elevated and I have irregular periods (twice a month at times). They referred me to a breast specialist and to see a doctor for the Thyroid issue. I have know for a fact both of these issues can be associated with a nipple discharge. I am considering consulting a regular doctor first before I go see what they think first, as I have no insurance and will need to find clinic with a sliding scale or financial assistant available in NH. I am not overly worried as not family history of breast cancer except for one great aunt who had it in her 50's. However, I am still a bit concerned until I can get further testing done. Any advice? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860506",
      "Title": "Clear Nipple Discharge (ine duct) and raised Prolactin level Hcruz13 MTwoman"
    }
  ]
}