{
  "AuthorID": "HealingDrea…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
  "Posts": [
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "May 29, 2012 10:54AM - edited May 29, 2012 11:02AM by HealingDreams Mary, you might want to look at a couple of the other threads regarding the OncotypeDX score on the Stage l and ll forum. Look especially for otter's contributions. Also read the OncotypeDX pages on this site for more information. The OncotypeDX is a 21 gene test, which explains, at least to me, a non-scientist, why there seems to be no relationship between ER, PR, and HER2/neu status, . I'm also waiting for the results of the test, due back June 7 to 11, I judge, because of the holiday.",
      "MessageIndex": 89,
      "PostDate": "29/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jun 4, 2012 06:46PM - edited Jun 4, 2012 06:47PM by HealingDreams Sarah, I don't know if all hospitals provide a breast binder. I do know that all surgeons do not. I suspect that people who suffer from hematomas following surgery have not been educated about and are not using compression devices. I am not sure about that, though. My surgical sites are well healed and I am already using Vitamin E oil on them, massaging toward the armpit to help with lymph flow. No bruise (hematoma) and no lump. I have worn my breast binder day and night as advised. I take off to shower and sometimes when I am not moving and just sitting and reading, just for a little relief from it! Your surgery sounds like a lumpectomy. Did the surgeon describe how he or she will cut your breast? A trasverse incision leaves a divot or dimple in the breast. A radial incision, like the arm of a clock, does not.  ",
      "MessageIndex": 3,
      "PostDate": "04/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788525",
      "Title": "Post Surgical Bra Suggestions? lanalang lanalang"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jun 4, 2012 12:55AM - edited Jun 4, 2012 01:00AM by HealingDreams I am assuming a \"duct excision\" means a lumpectomy, and yes, a compression bra is what you need. Actually, these are helpful for biopsies, too. Here is my surgeon's silly ditty: \"Tissues at rest heal best. The key is to compress the breast.\" I actually woke up from surgery in a breast binder nearly three weeks ago and am still wearing it--through Wednesday! Three weeks! That's what he recommended. It fits all the way around the ribs and breasts, is about 12\" wide, and has a long velcro closure. Provided by the hospital. Although the tissues may be healed, I still have numbness and soreness and want to be sure the breasts are well supported and even compressed. I just found two bras at my local Foundation Ship. One is a Bestform and the other, Anita Care. I would recommend not using department stores, such as Macy's, or big box stores, such as Walmart. I made mistakes at both places, and although Macy's does offer individual help, they do not have the selection that a foundation store will have. Good luck with your surgery!",
      "MessageIndex": 1,
      "PostDate": "04/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788525",
      "Title": "Post Surgical Bra Suggestions? lanalang lanalang"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "May 25, 2012 09:25PM - edited May 25, 2012 09:26PM by HealingDreams Glad you're home and just waiting for comfort food now, Shayne. Glad it went well. Take your time getting back to your regular routine. You don't need to hurry it.",
      "MessageIndex": 82,
      "PostDate": "25/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786356",
      "Title": "Lumpectomy - what can i expect? Shayne Angelaw69"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "May 24, 2012 04:02PM - edited May 24, 2012 04:02PM by HealingDreams Hi, Shayne. I was diagnosed 4/23 and had surgery last week, 5/16. I wanted to wait for surgery in order to attend a week long retreat. Fear is so normal...so much a part of my experience, even now that I have all of the information that they can give me at this point...  I guess the key is that at the moment you are anticipating the worst, imagining \"catastrophe.\" It is hard to turn the mind to observe the fear rather than being caught in it. It is also hard to turn the mind to a space of \"That feels real, but it is not true. I simply don't know.\"  In this vein what can you do or say to yourself when fears of catastrophe arise? What do you want to say to yourself when fears arise? Also, from a realistic point of view, your cancer is very small 12 mm, if your report above is accurate. How aggressive is it, how quickly is it dividing, based on your biopsy report? That is the grade, also the Ki-67 number. This information, in addition to a calming \"mantra\" that you choose might also be helpful.",
      "MessageIndex": 74,
      "PostDate": "24/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786356",
      "Title": "Lumpectomy - what can i expect? Shayne Angelaw69"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jul 7, 2012 06:03AM - edited Jul 7, 2012 06:03AM by HealingDreams Thanks, graced, for that lovely affirmation. I have been so scared of the side effects, it hadn't occured to me to be grateful for radiation. And, it is, of course, a blessing. Thank you. This was just the shift I needed to make. babette54, I have just finished my second week, 10 sessions in all. I am having twinges of pain under my arm and tenderness in my breast. I noted that the skin of the nipple felt irritated at my last visit with the RO and got permission to use Aquaphor on it.That seems to have helped.",
      "MessageIndex": 82,
      "PostDate": "07/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jul 25, 2012 12:43AM - edited Jul 25, 2012 12:44AM by HealingDreams Thanks for the link, Babette, about the systemic effects of radiation therapy. Grace, I, too, had doubts about my treatment part way through. What I needed to understand in order to continue was how radiation actually worked. I asked my RO and she gave me a simple lesson in radiation cell biology. It's formulating the right question that is the tough part. I have just 3 sessions to go. Done on Friday, July 27! Can't wait. I thought it might be easier after I was half-way, but probably because I have been counting every treatment, the downhill slope has been no faster than the uphill one. It is going to be great to be released! I got some interesting information from my RO today. After treatment ends, SEs continue for 3 to 10 days. Next I needed to understand why this is the case. Below is the best I can explain it. At the time of radiation the xrays break the DNA in both the healthy and the cancer cells. The healthy cells, of course, can repair themselves while the cancer cells cannot. The reason that SEs continue is that all of the cells with damaged DNA have not yet divided. They will divide over the course of the next 3 to 10 days and will cause side effects only when they divide.",
      "MessageIndex": 224,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jul 2, 2012 11:55PM - edited Jul 2, 2012 11:56PM by HealingDreams Love your photo, Sissydi. Hi, Jenn. As I mentioned on the July thread, we started radiation about the same time. My side effects are pinkishness, tenderness, and possibly fatigue after 7 sessions. More info in the other thread. It is amazing, encouraging really, to hear about the exercise you all are doing. I miss my daily swim, but the pool here is closed for repairs and I haven't figured out a good alternative. Also, I'm unsure about getting into a pool with already sore skin. I am walking almost daily for an hour and will definitely keep that up, given your experience, Hiker61.Thanks for the motivation! It helps a lot!",
      "MessageIndex": 112,
      "PostDate": "02/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jun 26, 2012 01:48AM - edited Jun 26, 2012 01:53AM by HealingDreams I had my CT scan and simulation last week and started rads today. But, it will last all of July, so I think I'm posting in the right thread. My rad onc recommended Vitamin E cream and aloe vera gel. She also recommended a specific brand, but that brand includes parabans and propylene glycol. Parabans is one of the chemicals implicated in breast cancer. A good friend and survivor recommended Jason's Vitamin E cream--none of those nasty additives--and the aloe vera plant itself. I watched a youtube video about the plant, how to care for it, how to cut it. I am still learning, but cut my first \"leaf\" today to take with me to my session. It's recommended to use the Vitamin E cream and the aloe vera twice a day. I plan once after treatment in the dressing room and once at bedtime. My friend said that her radiologist had never seen skin do so well! I am fair with little sun exposure, especially on those parts, so I doubt my skin will be quite so cooperative, but I'll let you know. Belinda--we were diagnosed on the same day. We seem to be on track with each other.",
      "MessageIndex": 9,
      "PostDate": "26/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jun 28, 2012 07:09PM - edited Jun 28, 2012 07:10PM by HealingDreams My tumor was also in my left breast, babette54, and I also have concerns about my heart. The lung will be touched no matter what. They can't avoid it. But they are trying to avoid the heart. I asked to see the plan for radiation, and the RO showed me pictures this week of how the radiation works in my case. The pcitures are from the CT scan and show exactly where my organs are and how the radiation should travel in my body. She pointed out a spot where radiation comes close to the heart. No one needs heart damage from this treatment, but I didn't see any good alternative in my case. This is the standard of care for a lumpectomy with a tumor like mine. My surgeon, who was wonderful in all ways, said, \"You'd really be doing yourself a disservice if you don't do radiation.\" His pointed advice was helpful. But the bottom line for me just comes down to trust. I have to trust that everyone did the math correctly, that they understand the physics of radiation, that the techs lined me up right and are using the tattoos, not a freckle to line up my body, that the machine itself is regularly checked for accuracy and so on. Not a thing I can do about any of this, so what can I do but choose trust? Please understand that this is just an explanation of my process and may not be right for anyone else.",
      "MessageIndex": 26,
      "PostDate": "28/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jul 18, 2012 12:01AM - edited Jul 18, 2012 12:05AM by HealingDreams graced, I asked my RO as well today about the odor. She also said that she has heard others describe it as an ozone like smell. babette54, I love how you're keeping track with percentages. I have done that, too. It's much easier with only 25 sessions... mini5, you'll be done a few days before I am. How shall we celebrate?",
      "MessageIndex": 156,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jul 26, 2012 10:27PM - edited Jul 26, 2012 10:28PM by HealingDreams About SE for Grace: I've had some pain since the beginning, but it's intermittent and usually doesn't last long. Skin color changes started early, too, but real pinkness and more pain came only in about the fourth week. Pinkness has continued to increase, covers more area, and is a deeper shade. Pain is more frequent, but still not bad. I have no itching or peeling, yet. I have my last treatment tomorrow. Hooray! I know SE will increase for the next week or so, but after that everything heals. I'm off to make brownies for my RO, the nurses, the doximitrists, the physicists, and the receptionists in celebration! Think I'll need to make more than one batch?",
      "MessageIndex": 239,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jul 31, 2012 02:28PM - edited Jul 31, 2012 02:29PM by HealingDreams The good news is that the techs and my RO loved the brownies! The bad news is I have the flu now!!! My guess is that because rads suppresses the immune system, I picked up something no one else in my family has. I am soon going to lie down for another nap... mini, I loved the idea of an ace bandage as a bra for kjiberty. So clever! I wanted to recommend a Bestform sports bra. They're soft and comfotable, not at all like a standard sports bra, more like a shaped ace bandage!But I doubt you'd be able to take off your jacket, kjiberty, if it's hot! I agree with minimacsmom, too. The size of the band is key. When you go up a size in the band, you go down a size in the cup. For years I wore a 34C in most bras. Since a meditation retreat a few years ago, I have not been able to tolerate so much pressure around my ribcage. Now I wear a 36B or a 38A. I'd love to try a 40AA, but I haven't found any yet. I am a few days post-radiation and the itching has started. I've started applying the 1% hydrocortisone cream before my Jason's Vitamin E cream and aloe gel directly from the leaf of the plant. The 1% cream seems to help. My BS wants to see me 6 months post surgery, ie. in November. As far as I know that's not after my 6 month mammogram which won't be until January. My RO wants to see me 6 months post rad and after the mammogram. My MO saw me when I entered the cancer center, one month after starting anastrozole (I started as soon as I knew I would not be prescribed chemo and before rads), and three months after that, ie in October. Now for my nap!",
      "MessageIndex": 278,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "May 24, 2012 08:41PM - edited May 24, 2012 08:41PM by HealingDreams I thought I had a burn mark, circular, on the breast no one touched, perhaps someone dropped a chemical on me? But, in fact, the surgeon explained this week in my return visit to him, that it was caused by removing the bandaid that had covered the biopsy site on that breast. I put the bandaid on while standing up. Lying down changes the shape of the breast. When it was removed sometime after anaesthesia but before recovery (i.e. I didn't know it happened), removing the tape caused a tear in the skin. The docs call it a \"tape blister.\" The surgeon added that he puts on the dressings himself because he understands the physics of this response of the skin. My left side had none of these marks.",
      "MessageIndex": 6,
      "PostDate": "24/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/787758",
      "Title": "Burn Mark after surgery? starz175 HealingDreams"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jul 16, 2012 09:27PM - edited Jul 16, 2012 09:28PM by HealingDreams 16 done and 9 to go! The first treatment is definitely the hardest. The first few until it becomes routine, I would say. I thought it would be easier after the half way mark (12-13), the downhill slope, so to speak,  but all of last week felt like it dragged. Now that I can count down in the single digits I think it will go much faster! I also plan a celebration--brownies for the techs and the RO! I don't think my center celebrates at all. I had a dream that gave me useful imagery for the twinges of pain or general sense of being inflamed. In my dream I returned to help a man who was caring for lobsters (yes, lobsters!). He taught me to put herbs under their shells and to use ice near their shoulders to calm them. So that's what I imagine doing for myself, putting herbs under my \"shell\" and using ice or cool water or cool wind to calm the inflamed cells. I also imagine doing it for all of you and all patients undergoing radiation or with inflammation elsewhere in their bodies. My RO had told me that nausea was a possibility in my case. Part of the stomach is in the radiation field. She also said that it is likely to happen right away. I didn't have any until last Thursday. And, I agree, julz24, it is truly the pits. I was quite sick through Saturday. My problem was that I had also taken a new medication that my rheumatologist prescribed, got new lenses for my glasses, and couldn't tell whether the glasses, radiation, or the meds were causing the nausea. So far I know that it's not the glasses. I'm waiting to see if I have a reaction to radiation today.  ",
      "MessageIndex": 147,
      "PostDate": "16/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jul 18, 2012 11:52PM - edited Jul 18, 2012 11:53PM by HealingDreams",
      "MessageIndex": 158,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "May 27, 2012 06:20PM - edited May 27, 2012 06:23PM by HealingDreams Hi, Pam, I am glad you made it over the hurdle of asking your friend for help. Let me describe a good method that we've used in our community that might be useful for you, too. This method may be similar to the web site that NWArtlady recommended but doesn't use that site.",
      "MessageIndex": 15,
      "PostDate": "27/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788135",
      "Title": "I am finding it hard to ask for help pamelahope NWArtLady"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jul 3, 2012 05:33AM - edited Jul 3, 2012 05:34AM by HealingDreams Hi, Jenn, I started my radiation just before you did, June 22. I'll continue through July 27. I've had 7 treatments already. 28% done. The smile and the sunglasses on this icon both seemed appropriate for the situation! My team of three techs, two men and one woman, are both professional and kind. It doesn't feel so foreign to slip my left arm out of the gown and to uncover the left breast, or have it uncovered, for treatment. It's almost, but not quite, routine now. I think tomorrow it will probably feel routine.  My side effects have been a feeling like I've had too much sun, and some pinkness of the skin, spreading across the center line. At first, the pinkness disappeared in a few hours. Now I have a little tenderness after treatment as well as pinkness. I've also started to experience some fatigue but I don't really know if that is related to the radiation or not. I see my RO tomorrow. I plan to talk with her about the pinkness crossing the center line, something I don't understand. I will also talk with her about the product that she recommended for skin care that contains parabens. Parabens are implicated in breast cancer. I found a web site, www.breastcancerfund.org, that focuses on the chemicals in our environment that contribute to breast cancer. If you click on the Clear Science link and the Chemicals Glossary, you can read about the science related to parabens as well as other chemicals, such as HRT, implicated in breast cancer. I am hoping that the information about parabens will be enough to sway not just my RO but to change the policy of the cancer institute where I receive treatment. I'll let you know.",
      "MessageIndex": 41,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jul 17, 2012 06:04AM - edited Jul 17, 2012 06:04AM by HealingDreams Fatigue hit me hard today. But a long nap was a great help. I've also noticed a smell after radiation, kind of like the smell of ironing. Has anyone else noticed that?",
      "MessageIndex": 150,
      "PostDate": "17/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "May 30, 2012 07:51PM - edited May 30, 2012 07:57PM by HealingDreams Wow, Kate. I certainly understand your frustration. Hope it helped to rant a bit. I was finally diagnosed correctly with the auto-immune disorder, Psoriatic Arthrits, the same month as my breast cancer diagnosis. The cancer occurred on a routine yearly mammogram, but I had been going to PCPs for about 40 years with pain that they could not diagnose. The problem was that the auto-immune disorder I have is in the family of diseases, headed by ankylosing spondylitis, that tests negative on the arthritis panels. It was an alert PCP who asked exactly where my low back pain was (the sacroiliac joint) and tested me for the gene. Fortunately, I tested positive and about two years later finally got the right diagnosis--from my second rheumatologist. I was diagnosed with fibromyalgia in the 1980s, but many people do not see fibro as an auto-immune disorder. I also had a great PCP who said, \"All of my fibro patients have sleep apnea. Inability to get restful, deep sleep creates the same symtoms as fibro.\"  After a referral for a sleep study, I also had a sleep apnea diagnosis. Of course, I still met the criteria for a fibro diagnosis and so still had that, too. Unfortunately, the rheumatologist who diagnosed me can't treat me but, she said, chemo will be stronger than what I could give you. Still waiting for my oncotype results and hoping they'll be definitive, not in the grey area.",
      "MessageIndex": 548,
      "PostDate": "30/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754362",
      "Title": "anyone out there with auto-immune/chronic pain issues before dx? jessamine SuzyBlue"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "May 24, 2012 04:29PM - edited May 24, 2012 04:29PM by HealingDreams I have the same question about the OncotypeDX score. What i understand from what I have read is that all that the test does is tell you the probability of a recurrence. It cannot tell you if you will have a recurrence or not. So for example, if your risk is low, say 12%, it cannot tell you if you will be among the 88% who do not have a recurrence or among the 12% who do. It is really just a tool to help you decide if classic chemotherapy, rather than hormonal chemotherapy, is right for you. Can you live with the percentage of risk of recurrence, given the side effects of chemotherapy? There is another good thread on this board that explains a lot. I will look for it for you and post again.",
      "MessageIndex": 2,
      "PostDate": "24/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/788007",
      "Title": "Oncotype test Northern100 HealingDreams"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "Jun 7, 2012 01:13PM - edited Jun 7, 2012 01:14PM by HealingDreams My RO also is planning no boosts. I cannot remember why but will ask at the next opportunity.",
      "MessageIndex": 9,
      "PostDate": "07/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/788659",
      "Title": "no boosts mckenna Mopsy"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "May 25, 2012 12:28AM - edited May 25, 2012 12:31AM by HealingDreams Thank you for this further clarification of the Onco test, Nancy HB. I didn't know that it only measures the likely risk of a distant recurrence, i.e. metastasis. Thanks also to voraciousreader for suggesting Stage 1, Grade 1 premenopausal thread for more information. I also found about four good threads on the onco test on the \"IDC Invasive Ductal Carcinoma\" forum. Hope this helps you, Northern100. Understanding what the test measures and doesn't measure will help you decide how to use the information you get. What country are you from?",
      "MessageIndex": 5,
      "PostDate": "25/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/788007",
      "Title": "Oncotype test Northern100 HealingDreams"
    },
    {
      "AuthorID": "HealingDrea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150344/profile",
      "Content": "May 28, 2012 08:13PM - edited May 28, 2012 08:13PM by HealingDreams Have you found the IDC forum, JustBeatIt? First, choose All Topics at the top left of this page. Then scroll down the page, you will find it.",
      "MessageIndex": 7,
      "PostDate": "28/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/788007",
      "Title": "Oncotype test Northern100 HealingDreams"
    }
  ]
}