{
  "AuthorID": "HealthNut15",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225531/profile",
  "Posts": [{
    "AuthorID": "HealthNut15",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225531/profile",
    "Content": "HealthNut15 wrote: Hi, I am new to these boards and this is my first post. I just went through a scare that turned out fine but wanted to share it because there aren't enough of these kind of stories. I know because I did a Google search obsessively for days and only found a handful. Why would this be? Because more of the \"bad news\" go on the site instead of the good news. When I was searching, I would say it felt like 50/50 but in actuality, should be more like 80/20, favoring good. Most people who get their good news don't sign up on a site like this to talk about it. That's exactly why I am. I am at higher risk for BC. My mom died from it in her 50's and so did her first cousin. I have extremely dense fibrocystic breasts. I started getting yearly mammograms age 40, and just had my third. Had Indeterminent microcalcifications and stereotactic core biopsy which I was a nervous wreck for and practically passed out from fear after reading some of the horror stories about it. Results were supposed to come in Wednesday. I didn't hear anything until Friday and I was such a wreck until I got my benign results. All I had was some support around me and Google. I didn't want to burden my support system too much but Google can be very dangerous. Although this community seems to be very supportive, I wanted to hear more stories from people whose results turned out well because that was the support I needed at the time. That's what I am doing now. If there are others in my shoes, I would advise the following: Keep things in perspective, trust your doctors more than the Internet. Everyone is different and just because one person's biopsy hurt like hell, doesn't mean yours will. My doctor promised me it would pinch a little, similar to a Novocain shot at the dentist and she was right! Trust your doctors and hold on to the positive. My told me, low risk of being malignant, I needed to hold on to that hope, not Google and diagnosis myself with the worst possible scenario. Easier said than done, I know, but the more you hear these types of stories, perhaps it will help. My doctor also said most of these turn out benign. That's true!! We are using more mammograms finding more things early but that also means we are finding more things that need to be tested. That's only natural. Use any support you can and that you need. I reached out to my therapist when I hadn't seen her in a while. Night time while waiting for results were best because I knew the phone wouldn't be ringing and I could I watch TV in bed with my hubby and I was \"safe\" Last, when it's all over and it will be, take care of yourself, your body. Eat well, meditate, exercise. Do everything you can to lower your risk and be healthy. That's what I do, because at the end of the day, I can look at myself and know I'm treating my body well and doing everything I can do to be around for a very long time. I look forw to being a part of this community and lending support when I can and receiving it when I need. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "11/12/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/838354",
    "Title": "For those nervous waiting for test results HealthNut15 Moderators"
  }]
}