{
  "AuthorID": "heather37",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
  "Posts": [
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "heather37 wrote: HI All I had a core needle biopsy done yesterday. I am 37 years old, have 3 kids. No BC in my family. Went in for my 1st mammogram ever and got called back cause they saw something. Had repeat mamo and u/s done on left side. They saw a 1cm mass - the BS and radiologist (this radiologist is awesome, he is director of mammography for the hospital i go to) said that most likely it is benign, but since they dont know what it is, the wanted to do the biopsy. I had a BIRADS 4A. 90% benign. Now both these docs are amazing...prob top in their fields. So i should trust them right? What worries me is the auxillary lymph node they saw (and biopsied as well). They also said looked benign, but biopsied it since i was already having a biopsy done and they said might as well biopsy everything so they know exactly what they are dealing with. On my ultrasound and mammogram report, they said it didn't look suspicious. But i am terrified... reading stuff on this board and on the internet makes it sound like i have cancer and it spread to the lymph nodes. Please help! Has anyone had this and turned out okay??? I called the BS right now - they dont have my results...said earlies i would have them is tomororw or more than likely Monday. Im going crazy over here. Please help! Heather Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826752",
      "Title": "i have enlarged lymph node as well as mass help heather37 heather37"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 5, 2014 10:29AM heather37 wrote: Thanks CUGymGirl for your reply. I really am driving myself crazy. I cannot eat or sleep. I swear i have lost 6 lbs in the past week. I am googling everything. this is horrible for my health. Deep down inside, i did think i had benign results - until they did the biopsy and saw possibly 2 enlarged lymph nodes. Trying to stay calm... Thanks",
      "MessageIndex": 5,
      "PostDate": "05/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826752",
      "Title": "i have enlarged lymph node as well as mass help heather37 heather37"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 5, 2014 09:41AM heather37 wrote: Thanks Ladies I am still waiting for my results.. Hopefully i should have them by 4pm today - if not today, then they said Monday for sure. I guess Pathology doesn't work on weekends.",
      "MessageIndex": 3,
      "PostDate": "05/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826752",
      "Title": "i have enlarged lymph node as well as mass help heather37 heather37"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Nov 13, 2016 07:22PM heather37 wrote: is it like a dent? If so, I have that and it Was benigh",
      "MessageIndex": 2,
      "PostDate": "13/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/850018",
      "Title": "Strange crease in breast Pumpkinpie2015 heather37"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Nov 30, 2014 08:36PM heather37 wrote: Thanks Wondermommy and Chin on your posts. Good Luck to you Wondermommy, and same to you Chin with your upcoming Chemo. My mother in law had IDC and did surgery and then chemo/radiation as well. She has been in remission for almost 13 years. Good luck to you and i will keep you in my prayers as well. Heather",
      "MessageIndex": 3,
      "PostDate": "30/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826647",
      "Title": "Biopsy on Wednesday - please keep me in your prayers heather37 Nancy2581"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 8, 2014 05:13PM heather37 wrote: Thanks so much Wondermommy!! I am definately celebrating!",
      "MessageIndex": 7,
      "PostDate": "08/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826647",
      "Title": "Biopsy on Wednesday - please keep me in your prayers heather37 Nancy2581"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 8, 2014 05:08PM heather37 wrote: Hi Everyone just wanted to give you all an update! Got my b9 results!! yay!!! Not sure what it even was... i had a 1cm mass by chest wall that i was told was def not a lymph node nor a cyst. I also had 2 enlarged axillary lymph nodes on same side. Thank God i got benign! Thanks to everyone for their prayers Heather",
      "MessageIndex": 5,
      "PostDate": "08/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826647",
      "Title": "Biopsy on Wednesday - please keep me in your prayers heather37 Nancy2581"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "heather37 wrote: HI Ladies I posted my story last week - (37 years old and terrified) - basically quick version: had breast pain in Right side - went for very first mammogram, got called back following day for something that was spotted on other breast - repeat mammogram and ultrasound done. the Tech couldn't find it on the ultrasound, radiologist tried and couldn't find anything else as well. Their dx was a swollen lymph node and to come back in 6 months. My friend is an OB, told me to see a Breast specialist - i went and she told me to re-do ultrasound at a different facility. They said the side that had the pain, there is nothing wrong. The other side - they did see the \"mass\" on the ultrasound and said it doesn't look like a swollen lymph node (did not have characteristics like kidney bean shaped and no blood flow) that would make it look like a lymph node. Radiologist said it didn't look suspicious (i guess because of the characteristics), but then she gave me 90% benign and wanted to do a biopsy. So here i am, my biopsy in 3 days. I am trying to stay hopeful and positive. The breast specialist and radiologist i saw is supposed to be the best in my state (according to my friend that is an OB). He said that particular radiologist did their residency at Johns Hopkins. So he said that if this dr said it was 90% benign, then most likely it is benign. It still freaks me out. I have 3 kids, work full time, pretty much the breadwinner, and was supposed to start my masters in January. What my OB friend says is that most Breast specialists know before the biopsy if it is cancer. He said usually - like over 95% of the time he said. Has that been your experience? Breast cancer does not run in my family. I know 2 close people that have had breast cancer - my mother in law and a family friend (that was diagnosed at 36 Years old with no family history). I spoke to both, and both said that their dr said it was very suspicious before they had the biopsy done. Oh when i spoke to the radiologist after she came in to tell me i needed a biopsy, i said \"if it is cancer, is it an early stage?\" she started laughing and said \"you dont have cancer\" and i said \"if i dont have cancer, why am i doing the biopsy?\" she just said \"well could be cancer, we dont know what it is, but very unlikely that's what it is.\" The tech pulled me aside and told me not to be scared, these dr's are always aggressive and airing on the side of caution. Thoughts?? Heather Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826647",
      "Title": "Biopsy on Wednesday - please keep me in your prayers heather37 Nancy2581"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 3, 2014 02:41PM heather37 wrote: Kris I am so sorry for the news. I pray that you find comfort and that they caught this early. Prayers to you. Heather",
      "MessageIndex": 2,
      "PostDate": "03/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826726",
      "Title": "Biopsy results have come back. kris1114 kris1114"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 8, 2014 11:07PM heather37 wrote: Hi Everyone just wanted to give you all an update! Got my b9 results!! yay!!! Not sure what it even was... i had a 1cm mass by chest wall that i was told was def not a lymph node nor a cyst. I also had 2 enlarged axillary lymph nodes on same side. Thank God i got benign! Thanks to everyone for their prayers Heather",
      "MessageIndex": 9,
      "PostDate": "08/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826750",
      "Title": "enlarged lymph node as well as a \"mass\" - help! heather37 Moderators"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 2, 2014 01:39PM heather37 wrote: How are you today Wondermommy???",
      "MessageIndex": 6,
      "PostDate": "02/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826673",
      "Title": "At home resting after surgery Wondermommy3 heather37"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 2, 2014 08:28PM heather37 wrote: Thanks so much Wondermommy and praying for you to get your b9 results!!! Get some rest :)",
      "MessageIndex": 8,
      "PostDate": "02/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826673",
      "Title": "At home resting after surgery Wondermommy3 heather37"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 8, 2014 10:26PM heather37 wrote: Sassy Yes, it was over pretty quick. They did the biopsy in 2 different locations - the bigger of the 2 enlarged lymph nodes, and also biopsied the 1cm solid mass. Total time was about an hour. But the first 20 min was finding them on u/s, then color coding them in (so they know where the needle should go), then they mark your breast for the location, and then they put the numbing shot and then they take about 5 samples for each mass. I do not tolerate pain well, and i really didn't think it was bad at all. The biopsy for the lymph node hurt the most (the radiologist did warm me that it would hurt). the other biopsy on the mass didn't hurt at all. i had minor pain after the procedure. took tylenol for that. I took tylenol every 4-6 hours for one day. I just laid around, watched movies, and since i am a tummy sleeper, i couldn't get any sleep that night. The next day, i had no pain. I went to church, went shopping and although it was mild pain here and there, i was fine enough to go on with my normal activities. i do have to say today is day 5 and i still cannot sleep on my stomach becuase when i lay on my breast, it is sore. But i cannot feel the soreness by sitting or standing. Again, good luck.",
      "MessageIndex": 14,
      "PostDate": "08/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826742",
      "Title": "TRYING to be positive BIRADS 5 sassyon3rd sassyon3rd"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Nov 3, 2016 02:20AM heather37 wrote: Hi Pancake Welcome to these message boards. Panda is 100% right - do not google and most people with benign conditions don't stick around. I need to hurry this post up because i need to study for my midterm tmrw, but thought i would post when i saw this. I am 39, 3 kids - and 2 years ago, was in a similar situation as you. I had the worst pain in my breast (the right one only) and after examining, i saw a dent. my dent is only when my arms are down to the side and it is VERY viseable. In some spots, it is a deep indent. Mine actually looks IDENTICAL to the woman who's post went viral on facebook for having an indent and it was breast cancer. I was confident i had breast cancer. Turns out, after having a mammo, ultrasound, seeing breast specialist (the best in Michigan i am told), it turned out to be nothing. THey did find a \"mass\" on the other breast but thank God that biopsy is negative. So i am back on this sight becuase my dent got bigger - but then again, i gained weight and my boobs went from small B to big D cup. So i think it is from that. My OB (i went for my physical 2 weeks ago) did NOT think i need to do another mammo/u/s for another year or so. She said sometimes a dent is just a dent. I remember my breast specialist didn't even seemed concerned. She said if it were worrisome - it would be a dent no matter how you stand or sit or move your arms up and down. When i raise my arms, you cant really see it. so i guess i just wanted to let you know - don't be freaked out by a dent...i know it is easier said that done.  i will post more after i study :)",
      "MessageIndex": 4,
      "PostDate": "03/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849553",
      "Title": "Exhausted by worry Pancake heather37"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 1, 2014 10:08PM heather37 wrote: Wondermommy! glad to hear everything went well. I am really praying for your b9 results!!! I am in the same boat as you, i think our stories are similar. My biopsy is scheduled for Wednesday, although i am doing an ultrasound guided core needle biopsy. Prayers to you.  Heather",
      "MessageIndex": 4,
      "PostDate": "01/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826673",
      "Title": "At home resting after surgery Wondermommy3 heather37"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 8, 2014 09:28PM heather37 wrote: Sassyon3rd Good luck with your biopsy tomorrow. I had mine last wednesday and i was extremely extremely nervous. I was googling my diagnoses from the u/s and mammo - i had a 1cm solid mass and 2 enlarged axillary lymph nodes on the same side. During the biopsy, the radiologist (who is Director of Mammography for the hospital i went to) asked me if i was in a traumatic accident or had any type of trauma to the breast. I was EXTREMELY nervous when he said that. He was looking at the ultrasound and doing the biopsy at the time he said that. I told him i have never had any trauma to the area. I lost alot of sleep just rethinking of those words - i thought, wow, he must've seen something unusual to think i had trauma to my breast. I got my b9 results this morning. So obviously, this \"trauma\" was normal for me. I will say a prayer for you tonight and hoping you get b9 results. Heather",
      "MessageIndex": 12,
      "PostDate": "08/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826742",
      "Title": "TRYING to be positive BIRADS 5 sassyon3rd sassyon3rd"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 1, 2014 01:02PM heather37 wrote: Good luck wondermommy I will say a prayer for you at 10:30 and hoping you get benign results. I saw your post to me just now - we are both in the same boat. Both with 3 kids, but you are several years younger than I am (I am 37). Hoping for both of us to get B9 results. Are you doing an ultrasound guided biopsy? not sure of all the technical names for the different types of biopsies but they told me they will be using an ultrasound to do my biopsy. Prayers and positive thoughts are sent your way. Oh and about your question, i actually have been a nervous wreck all week. But just like other posters have been saying, this is all out of our control. Good luck again and be sure to post soon after. Heather",
      "MessageIndex": 2,
      "PostDate": "01/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826649",
      "Title": "Biopsy day tomorrow Wondermommy3 Lynette73"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "May 24, 2015 06:09PM heather37 wrote: BTW, i should let you all know that i do have fibrocystic breasts.....",
      "MessageIndex": 1,
      "PostDate": "24/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/831926",
      "Title": "biopsy clear several months ago...but worried heather37 dolfin"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "heather37 wrote: HI All I had a core needle biopsy done yesterday. I am 37 years old, have 3 kids. No BC in my family. Went in for my 1st mammogram ever and got called back cause they saw something. Had repeat mamo and u/s done on left side. They saw a 1cm mass - the BS and radiologist (this radiologist is awesome, he is director of mammography for the hospital i go to) said that most likely it is benign, but since they dont know what it is, the wanted to do the biopsy. I had a BIRADS 4A. 90% benign. Now both these docs are amazing...prob top in their fields. So i should trust them right? What worries me is the auxillary lymph node they saw (and biopsied as well). They also said looked benign, but biopsied it since i was already having a biopsy done and they said might as well biopsy everything so they know exactly what they are dealing with. On my ultrasound and mammogram report, they said it didn't look suspicious. But i am terrified... reading stuff on this board and on the internet makes it sound like i have cancer and it spread to the lymph nodes. Please help! Has anyone had this and turned out okay??? I called the BS right now - they dont have my results...said earlies i would have them is tomororw or more than likely Monday. Im going crazy over here. Please help! Heather Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826750",
      "Title": "enlarged lymph node as well as a \"mass\" - help! heather37 Moderators"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 5, 2014 05:38PM heather37 wrote: Hi ExpatriateG, did you get your results back?? Im still waiting to hear about mine",
      "MessageIndex": 4,
      "PostDate": "05/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826750",
      "Title": "enlarged lymph node as well as a \"mass\" - help! heather37 Moderators"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 5, 2014 06:53PM heather37 wrote: Ugh that is the worst ExpatriateG, thanks, i have my fingers crossed for you too! Hoping we both get b9 results!! I am calling my dr's office in 30 min to see if they got my results in.",
      "MessageIndex": 7,
      "PostDate": "05/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826750",
      "Title": "enlarged lymph node as well as a \"mass\" - help! heather37 Moderators"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "heather37 wrote: HI Ladies not sure if you all remember me - but i posted here back in Nov/Dec. I had bad pain in my right breast and noticed a minor dent on the very bottom of my breast. It may have been the normal shape of my breast but i am not sure. I will be honest, i never do breast checks and never really paid any attention. Long story short, i went and did a my first mammogram (I am 37 with 3 kids) and they noticed something on my LEFT breast. I re-did mammo and then did ultrasound and said it was prob cyst (on my left breast) and to come back in 6 months. Well i was not happy with waiting, so i went and saw the \"best Breast specialist here in MI. She told me to redo the ultrasound (on both breasts) - she said she did not think it was a cyst (like i was told). i also showed her the dent in the RIGHT breast and she said she didn't see it. She said usually dents are still there when you raise your arms (in my case, i didn't see anything abnormal when i raised my arm) - is this true? anyway, i re-did the mammo and she wanted me to then do a biopsy on the left breast becuase she said it was def not a cyst and not a lymph node. I had 2 spots biopsied on the breast and thank God it was benign. When i asked about the pain and the dent on my right breast, she dismissed it and said it was nothing. She even told me that the right breast wasn't as dense and the left one...so the left one was harder to read. Long story short, i am still paranoid about the right breast. I occasionaly have pain and i still see this \"dent\". am i driving myself crazy? I asked if i can do another mammo and they said i really shouldn't. I went to the breast specialist last week and she said she couldn't feel any lumps and that i should just do my mammogram in a year from the last one, which would be Nov. I asked her about the dent and she dismissed it again. Said they had the top radiologist look at my mammo and ultrasound results and they were never concerned wiht that breast since they didn't see anything. But i get worried when i read stuff when people say they had BC and it was missed. Can they be missing something? i still occasionally get pain in the breast that has the dent. Please help! What should i do???? I do have to mention that i am a worry wart (sp?) i normally drive myself crazy with anxiety and thinking something is majorly wrong with me (health-wise). Do i dismiss it to that? or do i find a dr that will take me seriously. The thing is, i have been told by so many friends that are dr's that this dr that i see is the top breast specialist in the area. That what she says is \"bible\" Any advise?? Heather Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/831926",
      "Title": "biopsy clear several months ago...but worried heather37 dolfin"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "heather37 wrote: Hi Ladies hoping someone can help me out. I am a 37 year old mom to 3 kids (ages 12, 9, and 5). I have been very healthy and last month I had pain in my right breast for about a month. I have had pain in my breasts in the past, and was diagnosed with fibrocystic breasts years ago. This pain lasted much longer (like i said, i had it for a month) then previous times. I went to see my OB, who is director of OB at my local hospital in Michigan. He did an exam, then said he couldn't feel anything, but since my breasts are very fibrous, he said its hard to tell. He said since i have never had a mammogram done, to go get a baseline done. He wasn't concerned with the pain. I had my very first mammogram done on my 37th birthday on Nov 4th. Nov 5, i get a call-back saying they saw something and wanted me to come back for a re-peat mammogram and an ultrasound. The wierd thing, is that it was on the opposite side (the left side) - not the side that was hurting. I go back on Nov 6th, and did the repeat mammogram and ultrasound. Radiologist comes in the room and says that what they saw on the mammogram, they could not see on the ultrasound. He said most likely becuase it was so deep, near the chest wall. He said it looked like a swollen lymph node and it was benign and wanted me to come back in 6 months for repeat mammogram and ultrasound on that side only. I was happy with the results, and went on with my day. Now my right side still hurts. So i called my OB and said i know i should be okay with the results, but that i really felt like i needed an ultrasound done on the side that is hurting. He referred me to a breast specialist, top one at my local hospital too - my friend is an OB and he told me she is awesome. So i see her last Thursday. Told her the right side still hurts. She does an exam, says she doesn't feel anything concerning, but she wants me to go back and re-do the ultrasound, now on both sides. SHe said she knew the radiologist that read my inital report, and she didn't think he was a great radiologist. Her words were \"in every profession, you have your A students, your B students and your C students. She said he was a C student. She said she wanted to send me to her A+ radiologist. So i went back yesterday and re-did the ultrasound. The tech leaves the room and brings the radiologist (never good news). The radiologist says that the right side is fine - this is the side that hurts. She said, sometimes breast hurts. Probably hormonal. She said she was concerned with the left side. She said the other radiologist said he thought it was a lymph node but that was because they never saw it on ultrasound. She said they dont think it is a lymph node. I asked why, and she said it didn't look bean shaped nor did it have blood flowing thru. She said could be a fibroadenoma, but wasn't entirely sure. she said she was 90% sure it was benign, but she said she has no idea what it is without biopsy. I asked how big it was and she said about 1 cm. She also said she saw a swollen lymph node near my armpit area but she said it was slighly swollen and not really concerned, could be from shaving. she said when they do the biopsy, if the radiologist doing the biopsy thinks he should biopsy that area, he will. but until then, they are just biopsying the one area. I am terrified. I am 37 years old, 3 kids and about to start my masters degree in January. I am terrified. I have no breast cancer in my family. I am loosing sleep over this. Please help! Oh she did say that the \"mass\" is round, doesn't exhibit any charachteristcs of cancer\"...but they cant say for certain. Please help! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826547",
      "Title": "37y/o biopsy next week - Terrified and please help! heather37 proudtospin"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Nov 25, 2014 09:49PM heather37 wrote: Thanks so much ladies for your words of encouragement. I am trying to stay positive. It is nice to have a friend that is an OB! I just spoke to him and he pulled up my latest ultrasound from yesterday. He said it is not suspicious but agrees to have it biopsied. I didn't want to keep asking him questions because i don't want to \"bug\" him. My question is, if it doesn't look suspicious, then why do they want it biopsied? Is it because now i am working with a breast specialist so are they more aggressive??  I actually made the Christmas cookies yesterday lol - but it still didn't help me take my mind off of it. tomorrow i am going shopping with my Mom while the kids are in school...maybe some retail therapy will help! lol!",
      "MessageIndex": 6,
      "PostDate": "25/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826547",
      "Title": "37y/o biopsy next week - Terrified and please help! heather37 proudtospin"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "heather37 wrote: HI All I had a core needle biopsy done yesterday. I am 37 years old, have 3 kids. No BC in my family. Went in for my 1st mammogram ever and got called back cause they saw something. Had repeat mamo and u/s done on left side. They saw a 1cm mass - the BS and radiologist (this radiologist is awesome, he is director of mammography for the hospital i go to) said that most likely it is benign, but since they dont know what it is, the wanted to do the biopsy. I had a BIRADS 4A. 90% benign. Now both these docs are amazing...prob top in their fields. So i should trust them right? What worries me is the auxillary lymph node they saw (and biopsied as well). They also said looked benign, but biopsied it since i was already having a biopsy done and they said might as well biopsy everything so they know exactly what they are dealing with. On my ultrasound and mammogram report, they said it didn't look suspicious. But i am terrified... reading stuff on this board and on the internet makes it sound like i have cancer and it spread to the lymph nodes. Please help! Has anyone had this and turned out okay??? I called the BS right now - they dont have my results...said earlies i would have them is tomororw or more than likely Monday. Im going crazy over here. Please help! Heather Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/826751",
      "Title": "enlarged lymph node as well as mass help heather37 heather37"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 5, 2014 11:43AM heather37 wrote: Thanks Ladies I am still waiting for my results.. Hopefully i should have them by 4pm today - if not today, then they said Monday for sure. I guess Pathology doesn't work on weekends.  And yes, this was my very first mammogram as well as ultrasound of the breasts. Hopefully, everything they saw was normal for me.",
      "MessageIndex": 3,
      "PostDate": "05/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/826751",
      "Title": "enlarged lymph node as well as mass help heather37 heather37"
    },
    {
      "AuthorID": "heather37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208296/profile",
      "Content": "Dec 8, 2014 05:08PM heather37 wrote: Hi Everyone just wanted to give you all an update! Got my b9 results!! yay!!! Not sure what it even was... i had a 1cm mass by chest wall that i was told was def not a lymph node nor a cyst. I also had 2 enlarged axillary lymph nodes on same side. Thank God i got benign! Thanks to everyone for their prayers Heather",
      "MessageIndex": 4,
      "PostDate": "08/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/826751",
      "Title": "enlarged lymph node as well as mass help heather37 heather37"
    }
  ]
}