{
  "AuthorID": "Heatti",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230668/profile",
  "Posts": [
    {
      "AuthorID": "Heatti",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230668/profile",
      "Content": "Heatti wrote: Hi - I am sure that this may have already been posted but I am not getting a concrete answer from Pfizer, our Oncologist, or the Radiation Oncologist. My mother is on Ibrance (this will be month 5) and she had a rod inserted into her femur 5 weeks ago. The oncologist has set her up for Radiation treatments on her leg and sacrum where she has a large lesion. What no one can say is whether to continue taking Ibrance while doing the radiation treatments. She has 16 of these scheduled. Does anyone have any experience with this? Your advice would be greatly appreciated. Hugs and Thanks, Heather Dx 3/22/2016, Right, Stage IV, metastasized to bone, ER+/PR+, HER2- Hormonal Therapy 4/1/2016 Femara (letrozole) Targeted Therapy 4/1/2016 Ibrance (palbociclib) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846961",
      "Title": "Ibrance and Radiation Therapy Heatti pajim"
    },
    {
      "AuthorID": "Heatti",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230668/profile",
      "Content": "Heatti wrote: Hi - My mom is not feeling like eating - we want to keep her energy up - suggestions please for what I can provide for food/drink for her? She is lactose intolerant. She has yet to start chemo so we are fearful she will even have more of an issue during this time. She said she will eat it if it is placed in front of her but she doesn't feel like getting up and doing anything to make a meal. Many Thanks to you all! Much love and respect - Heather Dx 3/22/2016, Right, Stage IV, metastasized to bone, ER+/PR+, HER2- Hormonal Therapy 4/1/2016 Femara (letrozole) Targeted Therapy 4/1/2016 Ibrance (palbociclib) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/842684",
      "Title": "Question Please - Food/Drink Suggestions Heatti ibcmets"
    }
  ]
}