{
  "AuthorID": "Heather-",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214616/profile",
  "Posts": [
    {
      "AuthorID": "Heather-",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214616/profile",
      "Content": "Apr 27, 2015 10:17AM Heather- wrote: Scared and confused are normal for Stage IV Breast CA. But that doesn't mean you should accept these symptoms anymore than you should be expected to accept the pain associated with this disease. These feelings are best mitigated by a having a good support system, seeing physicians you trust, obtaining knowledge from reputable sources and managing your physical and emotional symptoms. Due to its deleterious effects on mood and function, pain management should be a priority for you and your MO. Although there is no magic bullet, NSAIDs (naproxen like products) tend to be very effective for bone pain with narcotic agents added on for breakthrough pain. Keep in mind that managing pain is most effective with additive modalities. Non-pharmacologic hints: avoid/limit activities which aggravate your pain, consider positions of rest which lessen pressure to painful areas, consider local heat therapy (sort of like a low dose radiation you can do at home or on the go now with heat therapy patches). I hope this was helpful. Wishing you and your family the best. <3",
      "MessageIndex": 49,
      "PostDate": "27/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830431",
      "Title": "SO VERY SCARED, DEPRESSED and CONFUSEEd bethen bethen"
    },
    {
      "AuthorID": "Heather-",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214616/profile",
      "Content": "Feb 3, 2017 04:24AM - edited Feb 3, 2017 04:24AM by Heather- Each progression is a painful set back, but do not admit defeat. Yourfeelings are normal but please know there are many meds on the market that may still be tried. If not his one, perhaps the next one. With the start of each new drug, let there be new hope that it will push the cancer back a little bit. Good luck and keep fighting",
      "MessageIndex": 118,
      "PostDate": "03/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    }
  ]
}