{
  "AuthorID": "HeatherLL",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89709/profile",
  "Posts": [{
    "AuthorID": "HeatherLL",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89709/profile",
    "Content": "Sep 22, 2009 05:10PM HeatherLL wrote: ADOPT ADOPT ADOPT ADOPT ADOPT ADOPT  Hi, I'm so sorry for the horrible news.  I found out about being BRCA+ at a very early age.  I had my ovaries removed when I was 19 yrs old!  I'm now 34 & I just had my bilateral mastectomy with reconstruction one month ago.   I knew at a very early age that I'd never have biological children.  I actually met my husband to be one week before I found out about ALL of this horrible news.  He went to my appt's with me and afterwards just turned to me an said, \"We were just meant to adopt.\"  These words changed me forever!  So from the age of 19, I knew that we would create our family through the adoption process.  We adopted our son in 2002 and our daughter in 2005.  Both of our children are from S. Korea.  Alex is 7 now and Collette is 4 yrs old.  I can tell you that creating a family through adoption has been NOTHING but a blessing!  Not having biological children can be as gut-wrenching as you make it or it can be what it was for me:  a blessing in disguise!  My children are beautiful, amazing, adorable & precious gifts.   Have you considered adoption?  If you ever have any questions please feel free to contact me.  I'd love to chat with you.  I've gone through it all, believe me! Just yesterday I got the entire $40,000 + bill for my bilateral mastectomy and our insurance only covers less than half of the cost!  We are in the process of adopting our third baby from S. Korea right now . . ..  but even that's been put on hold, for who know how long.  It's heart-breaking.  All the money we had saved for our baby now has to go towards our new medical debt.   Cancer has destroyed a lot of my security in life to say the least. It has affected every aspect of my life since High School.  But, I'm alive.  And there have been all of these little blessings in my life BECAUSE of the cancer, or in direct result of it.  I would never have my Alex & my Collette in my life if it weren't for being BRCA1 positive!  It's all in how you chose to look at life. I know what you are going through, I pray for peace of mind and for wisdom in making these difficult decisions that lay ahead of you.   Heather in OR ",
    "MessageIndex": 16,
    "PostDate": "22/09/2009",
    "ThreadURL": "https://community.breastcancer.org/forum/47/topics/730717",
    "Title": "BRCA 2+..still want to have children.. what can I do? MKMS22"
  }]
}