{
  "AuthorID": "heidigoingc…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174703/profile",
  "Posts": [{
    "AuthorID": "heidigoingc…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174703/profile",
    "Content": "Mar 26, 2013 07:58AM heidigoingcrazy wrote: I have never done this before. I dont know what to do or think I had a mammogram on thur called me back fri am that i needed to go back for images all i remember her saying is i knew the pic would be the same. She really smushed them and she said and that didnt hurt. Then I had us and all that i asked was is it a cyst and she said no it is not a cyst and you need a biopsy. You dont see the radioligist the tech shows him the pic and tells you if it needs further tests. And then she said someone will call you monday. well i am out of my mind. So at 7 am i went to the image center they called my dr he did a referal and she felt bad for me and looked at my test results. my briad was 4 ,dense tissue, and calcification and that they had grown quite a bit since my last mammogram 2 years ago and family history was what did she say his reason for recommending the biopsy. I have no family and a boyfriend that works long hours. I am simply going nuts with this worry oh i did get a appointment with the surgeon on this thursday for consult. But thats means i still have to do biopsy and wait for that result. Im sorry I hardly text. Should I be wor ried has anyone had this why do my breasts not hurt and I feel no pain during mammogram. also my briad score was a 2 last time that was all i knew to ask. I found that out from reading online . And to top it off my wii broke last night soo i have no netflix no tv to watch. I have been up for for 27 hours and i cant move off the couch. I have ptsd and this has brought back alot of symptoms of just staring at the ceiling, and then racing thoughts. I do have a psycoligist. I cant spell or think.  It took me 4 years to leave my house and know i feel this worry is setting me back to square one. I have appointment with her today. I hope this gives me some reilief.  MOSTLY ITS NOT HAVING ANYONE THAT IS HERE TO COMFORT ME . My boyfriend comes home from work eats and says oh im going to bed. Not like him . He is usally very supportive . Thanks for my long babble.",
    "MessageIndex": 9,
    "PostDate": "26/03/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/802143",
    "Title": "Freaking out a little bit.. belha Skagitphoenix"
  }]
}