{
  "AuthorID": "HelenWNZ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
  "Posts": [
    {
      "AuthorID": "HelenWNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
      "Content": "Oct 1, 2016 04:32PM HelenWNZ wrote: This will be my first pink October and I am definitely not feeling the love. My workplace gets all hyped up with lovely pink morning teas and dress ups. Last year I was with them this year laid up on the couch with two rounds of chemo lined up for this month the same joy is not there. Funny that. I appreciate the awareness it brings, the fund raising and it's good intentions but.......nah not this year.  ",
      "MessageIndex": 18,
      "PostDate": "01/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/848416",
      "Title": "October's coming...what language can you tolerate? sbelizabeth MmeJ"
    },
    {
      "AuthorID": "HelenWNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
      "Content": "Jun 20, 2016 09:59AM HelenWNZ wrote: I got my pathology results back today and am now am freaked out more. 35mm grade 2 IDC with prominent micropapillary component present. Extensive Peritumoral lymphovascular invasion seen admixed intermediate grade DCIS present ER8 PR6 HER2+ Resection margins 6mm from inferior >10mm all other margins Extensive axillary disease present 18/22 nodes with extensive extra nodal spread evident. All gross macroscopic disease was excised from axils at the of surgery. Now on to chemo, herceptin plus radiotherapy and hormonal therapy. Doesn't look good for this 52 year old body who had a clear mammography 21 August last year. Anyone have any words of wisdom.  Thanks ",
      "MessageIndex": 25,
      "PostDate": "20/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/842495",
      "Title": "\"Lymphovascular invasion is not identified\" Hester32 HelenWNZ"
    },
    {
      "AuthorID": "HelenWNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
      "Content": "Jun 21, 2016 11:06AM HelenWNZ wrote: Thank you BarredOwl I google too much which makes things even bleaker. The report I got wasn't great To look at in black and white. I guess this is where we put our trust in the professionals and try not to get too phased out. Another online friend has told me that this is a marathon and we are in in for the long haul. Take care",
      "MessageIndex": 27,
      "PostDate": "21/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/842495",
      "Title": "\"Lymphovascular invasion is not identified\" Hester32 HelenWNZ"
    },
    {
      "AuthorID": "HelenWNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
      "Content": "Oct 18, 2016 03:59PM HelenWNZ wrote: Hi everyone Thought I recognised you scared67 I feel the same way - so many bad things in my diagnosis how can it be possible. My surgeon says we are going for a cure. My oncologist is trying for the 80% chance of making it past. 5 years if I follow the treatment plan. So why does my silly brain keep focussing on the 20% that won't. I'm 52 and still a wee way off from retirement. It's good too see that the possibilities are there. I have a 97 year old grandmother still living in her own home. Wanted it to be me.......",
      "MessageIndex": 33,
      "PostDate": "18/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/836950",
      "Title": "Stage III Cancer Survivors...15+ years and out weesa lexi4"
    },
    {
      "AuthorID": "HelenWNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
      "Content": "Aug 31, 2018 08:19PM HelenWNZ wrote: Hello - just popping in with a wee question.  Am I keeping my head in the sand by not contacting my specialist just because I feel dreadful.  I have no persistant pains - things that just come and go as you would expect given the nature of the beast. I am on Letrozole and Blood pressure meds both of which when I look up their side effects - I pretty much have them covered. Or have I just hit a road block after 2 and a half years of fighting and am a bit weary.",
      "MessageIndex": 4629,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "HelenWNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
      "Content": "Sep 27, 2016 02:13PM HelenWNZ wrote: Thanks for the advice. Because this pesky pain was there before chemo it's a big worry for me. I too had a very heavy node issue and have lymphedema issues as well. I am seeing my doctor on Thursday with my \"list",
      "MessageIndex": 3736,
      "PostDate": "27/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "HelenWNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
      "Content": "Sep 27, 2016 05:20AM HelenWNZ wrote: hi everyone, I have a wee question. I was diagnosed in May this year. I had a CT scan on 17 May followed by a mastectomy on 31 May . Prior to my scan my mind went mad and everything on me hurt and I convinced myself that the cancer had spread. The relief when I was told it had not spread made all but one of my pains disappear. I started chemo in early July and now after 4 rounds I still have the pain in the small of my back. It's not worse but it's a niggling aching pain. Worse as the day goes. How fast can bone mets spread? There was a gap of 8 weeks between scan and chemo",
      "MessageIndex": 3732,
      "PostDate": "27/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "HelenWNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
      "Content": "Jul 27, 2016 11:28PM HelenWNZ wrote: Here in New Zealand I am currently on D for 3 rounds and FEC then for 3 rounds. I found my first round of D very hard and ended up in hospital for 5 nights as all my levels plummeted. Round 2 is tomorrow and the dosages have been lowered by 10% and I'm to have an injection 24 hours later so here's hoping. ",
      "MessageIndex": 11,
      "PostDate": "27/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846232",
      "Title": "Anybody have been on or is currently on FEC+D chemo? Scarysadday QuinnCat"
    },
    {
      "AuthorID": "HelenWNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
      "Content": "Jun 26, 2016 09:17PM HelenWNZ wrote: 52",
      "MessageIndex": 631,
      "PostDate": "26/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "HelenWNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
      "Content": "Aug 29, 2016 12:56AM HelenWNZ wrote: hi olive4 I am doing fec d. Have done 3 rounds of the d and am due my first fec infusion on 9th Sept. I found the d side of things pretty hard so am really hoping things are a bit easier. Not much help I am afraid. Hope all goes well with you. Helen ",
      "MessageIndex": 1,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/847476",
      "Title": "FEC chemotherapy, anyone had this for treatment? Olive4 stephincanada"
    },
    {
      "AuthorID": "HelenWNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
      "Content": "Aug 16, 2017 04:30AM HelenWNZ wrote: I had a mammography in August 2015. Got recalled and had an ultrasound to be told I had cysts and cysts were our friends. In February 2016 I am a the GP with an inverted nipple. By the time I had surgery my lump was 3.5 cm and I'm triple positive with 18 affected lymph nodes. I have asked was this missed and have been told no my tumour was aggressive. But I cannot get the nagging doubt out of my head.....",
      "MessageIndex": 48,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/634136",
      "Title": "Cancer missed by mammogram? joanne_elizabeth HoneyBeaw"
    },
    {
      "AuthorID": "HelenWNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
      "Content": "Jul 29, 2016 12:38AM HelenWNZ wrote: Thanks Ladies Round 2 for me today. Was very apprehensive about the whole thing didn't sleep much last night even though I took a sleeping tablet. So far all good. Last time the truck hit on about day 4 so until then life as per normal. Kind regards Helen",
      "MessageIndex": 14,
      "PostDate": "29/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846232",
      "Title": "Anybody have been on or is currently on FEC+D chemo? Scarysadday QuinnCat"
    },
    {
      "AuthorID": "HelenWNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
      "Content": "Aug 29, 2016 03:18AM HelenWNZ wrote: The port sounds worse than it is but having been hospitalised and with lousy veins it has been a god send for blood tests and Iv fluids etc. While on fec I will be taken off herceptin due to the double heart risk. Also yes the only guaranteed side effect is the hair loss. I shaved in preparation of the thinning I was experiencing when I started and now await the loss of everything. In nz I don't believe we cold cap either",
      "MessageIndex": 4,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/847476",
      "Title": "FEC chemotherapy, anyone had this for treatment? Olive4 stephincanada"
    },
    {
      "AuthorID": "HelenWNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234402/profile",
      "Content": "Aug 18, 2016 03:22AM HelenWNZ wrote: Wishing you all the very best in your treatment. What a wonderful gesture from your guardian angel. Take care",
      "MessageIndex": 21,
      "PostDate": "18/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/846532",
      "Title": "Her2 Positive - life without chemo Anush dragonsnake"
    }
  ]
}