{
  "AuthorID": "Helen1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
  "Posts": [
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Aug 23, 2007 09:50AM Helen1 wrote: I just finished the first full cycle of the redeced xeloda from 3000 mg. to 2500 mg. I have had and occasional upset stomach, but less diarrhea. The h/f foot caused only minimal tenderness, no redness and I can drive bare handed still. The fatigue factor is still about the same, but we have had super hot days w/ heat index being 105 plus and orange to red ozone alerts, which are always difficult for me even without the xeloda. ONce the weather cools off it should be better. Take care all.",
      "MessageIndex": 21,
      "PostDate": "23/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/663491",
      "Title": "Xeloda is still working Helen1 Helen1"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Helen1 wrote: Hi everyone Wanted to take a minute and let you know that I am still around. I am still doing the xeloda 2500 mg now 2 weeks on and 1 week off. Still dealing w/ the nasty side effects like making the palms of your hands and the soles of your feet feel like you have a steam burn on them, but with various forms of goo ( as in bag balm or udder cream) it is doable. About the 10th day of each cycle my hands swell and get red and painful, so I don't voluntary type much on the computer. Still get pretty tired a lot, but considering this time last year, my drs weren't taking any bets that I would even make it thru the summer-- fooled them I guess. The xeloda was the 7th chemo that I have been on in the past 2.5 years and the first to show any response. The blood test Ca 27-29 in January of this year mine was 734. Last week it measured 91 !! In theory 38 or below is normal, but as usual there is a catch to that- Having a 'normal' value does not mean No Evidence of Disease. It would need to be backed up by normal bone scans and other fun tests. Still, I am asking Santa for a diagnosis of NED for Christmas. My hair is now long enough to touch my shoulders and I can pull it up in a clip now when I am at work. Turning into a regualr hippie I am. Things that make you go HMMMMMMMMMM? my oncologist decreased the dosage by 1 chemo tab daily from 3000mg to 2500 mg. As I was taking 3 of them morning and evening this presented a slight problems as the dose needs to be evenly divided, and as I already had a shipment of the 500mg tabs coming-he agreeed that I could cut one of them in half. However.......I am to use gloves when I do this and do not under any circumstances touch the cut pill with my bare hands, but it's safe to eat? A few weeks ago I became ill from a combination of antibiotics and the xeloda. When I washed the towel I used to clean things up with- it was left w/ white splotches as if I had wiped up straight bleach. No wonder I wish I has a different tummy most of the time. Anyway, I am still working, and haven't wrecked a car in over 3 months- so things are looking pretty good for a change. When I used to go to Al-a-non, one of the people there said ' a mouse eats an elephant a bite at a time'. These past couple of years have by no means been the only elephant in my life, nor has it been the biggest, but I can say without a doubt, it is one of the toughest I have ever had to deal with. But,it's a whole lot smaller than it used to be though. A mouse eats an elephant a bite at a time (I think I may need a bigger mouse) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/663491",
      "Title": "Xeloda is still working Helen1 Helen1"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Aug 27, 2007 12:53AM Helen1 wrote: I find that if I take the probiotics on a regular basis, I don't get the diarrhea until the last couple of days of the cycle. It also keeps the stomach burning down to a bearable level. The side effects on the lower dose were a lot easier to tolerate this time around. One would think, mrsjck that if xeloda is the drug of choice for colon cancer, that after all this time it would be afraid to raise it's ugly head. Most onc's seem to schedule a colonoscopy some time during bc tmt as most of the chemos affect the digestive system one way or another.",
      "MessageIndex": 28,
      "PostDate": "27/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/663491",
      "Title": "Xeloda is still working Helen1 Helen1"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Aug 13, 2007 04:56AM Helen1 wrote: I hope it works for you as well as it did for me. We are not allowed to have latex gloves on premesis ( company policy) The cheapest I have found the gloves is online at Walgreens.com They are $40/bx of 24 pair. Have found the single pairs for $3.50 to $4.50. they are washable and can be reused. Good luck",
      "MessageIndex": 17,
      "PostDate": "13/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/663491",
      "Title": "Xeloda is still working Helen1 Helen1"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jul 28, 2007 11:48AM Helen1 wrote:",
      "MessageIndex": 9,
      "PostDate": "28/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/663491",
      "Title": "Xeloda is still working Helen1 Helen1"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Nov 4, 2007 05:42PM Helen1 wrote: I went to from dx to mast in less than a week. Felt like my world spun out of control.  Still feels like that occasionally.  My favorit site for drug info and particularly chemo drugs is  MayoClinic.com It lists effects, and side effects in language that is easily understood. Helen",
      "MessageIndex": 8,
      "PostDate": "04/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693782",
      "Title": "I would like to see here on the boards... Ter Helen1"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Sep 3, 2007 12:37AM Helen1 wrote: I have been a diabetic for a number of years. I have found that when I really jones for sugar it is usually a B vitamin deficiency. I take a balanced b-100 vitamin morning and evening. Seems to keep it under control for me. There are occasions when I would kill for sugar though and in my saner moments instead of eating sugar I will take and extra b vitamin. Seems to make it go away.",
      "MessageIndex": 10,
      "PostDate": "03/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/686387",
      "Title": "Sugar Cravings LuAnnH RobinWendy"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Sep 4, 2007 01:05AM Helen1 wrote: B-100 is a b complex that has 100 mg. of each of the vitamin B's. My preferred brand is Twin Lab. It has less fillers etc.",
      "MessageIndex": 13,
      "PostDate": "04/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/686387",
      "Title": "Sugar Cravings LuAnnH RobinWendy"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Sep 8, 2007 10:46PM - edited Sep 8, 2007 10:47PM by Helen1 Hang in there Wendy. It will get better. You are in my thoughts.",
      "MessageIndex": 13,
      "PostDate": "08/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/691869",
      "Title": "What a horrible week WendyV LuAnnH"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Mar 23, 2008 09:57AM Helen1 wrote: Since May 2005,  I have taken taxol/carboplatin every 3 weeks for 6 months then aredia for a year, then after the taxol went to taxotere for every 3 wees for 6 more months, then tamoxifen, arimidex, femara.  January 2007  I did 3000 mg. xeloda for 2 weeks  off 1 until January 2000.  Last Friday 3/21- I had my third monthly injection of fasoldex.  There are still others in the pipeline, if the faslodex doesn't respond as hoped for.  My onc's thought is that as long as I am willing, so is he.  My QOL is still decent and I am able to work full time, so we cont. to carry on. Ultimately you have to do what is best for you. Helen",
      "MessageIndex": 5,
      "PostDate": "23/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702185",
      "Title": "Anyone do chemo 4x in 4.5 years? mason204 Helen1"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "May 7, 2008 11:07PM Helen1 wrote: Thanks for the kind words and support.  Laying flat on the table is super painful.  Had the mapping yesterday and the first tmt today. I have extensive mets in the top two inches including hte head of the femur.  Thats the area that is being radiated.  I have mets all across the pelvis, sacrum and L5 and t-3-6.  plus various other small non painful spots.  Rads really helped the throacic spine pain and I figure they will do similar on the hip. I saw my med onc today.  It's official, the faslodex (#8) did not work.  He asked me today if I wanted to quit.  My son was with me in the room, I had to say carry on.  He's sending me for a repeat MUGA on Friday.  3 years ago it was 45.  If there is any improvement he may consider adriamycin. But I had the feeling that, he didn't think that was a great possibility.  There are 2 or 3 chemos that he hasn't used, but the likely hood of those working are slim.  To night I am feeling a bit sorry for myself, but it is the middle of the night and its always darker then.  So tomorrow, I put my gameface back on, pull up my big girl panties and carry on. Helen",
      "MessageIndex": 5,
      "PostDate": "07/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705163",
      "Title": "rads to the hip Helen1 badboob67"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Helen1 wrote: I am starting radiation to the left hip area today.  The alternative was a total hip replacement, and as I am not good surgical risk, rads seemed to be the way to go.   I had rads to the upper thoracic spine 3 years ago and managed to get thru that w/ out too much of a problem.  Mild skin burn and some radiation esophagitis. I was wondering if anybody has had rads to the hip area and what kind of side effects did you have.  I figure I can expect a mild burn in the creas of my leg.  I am concerned re: the intestinal  or bladder \"distress\" ( onc s word- not mine).  Well at least I have about 3 weeks vacation. Helen A mouse eats an elephant a bite at a time (I think I may need a bigger mouse) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705163",
      "Title": "rads to the hip Helen1 badboob67"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Sep 30, 2007 04:54AM - edited Sep 30, 2007 04:54AM by Helen1 I was dx March 05 w/ extensive bone mets to the mid thoracic spine. Over the next 2 years I took taxol & carboplatin, then taxotere, aredia (stopped due to ONJ) arimidex, femara, and tamoxifen, with no results. In January I started on xeloda.  Tumor markers went from 734 to 91 as of last August.  Other than side effects of the xeloda, and fatigue, I have very little pain, work full time as I have since May 05, and I do pretty much what I want to most of the time Helen",
      "MessageIndex": 37,
      "PostDate": "30/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/691993",
      "Title": "bone mets survivors riverinerabbit mom2acat"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jan 25, 2008 06:03AM Helen1 wrote: BIG hugs Brenda.   You will start to feel normal again eventually.  I felt the same way at first.  (3 years ago)  Make your plans. If you have to change them so be it.  Do not deny yourself the pleasure of the future.  Without hope we have nothing.  As for your hair- It will grow back.  Mine would start to come back. My onc would change the chemo and it would fall back out. This happened 4 different times.  My hair now reaches my shoulders.  Hang in there.  You will get thru this.  There are a lot of ladies here that will help you. Helen",
      "MessageIndex": 1,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699153",
      "Title": "No more long term plans Analemma SunshineSmiles"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Apr 19, 2008 05:15PM Helen1 wrote: Deb You did definitely not overreacat.  You handled it a lot better than I    probably would have.  6 months apart, I was in the ER and with the luck of the draw got the same RN.  Her first comment was  I remember you.  And I replied, I remember you too. ANd you need to find another nurse to take your place.  She got very huffy and said there wasn't anyone, I told her I would wait for shift change.  They called a nurse down from one of the floors. Stick to your guns Deb.  As Ron White (commedian) said it so well \"You cant fix stupid\" and I see no reason to tolerate even the smallest amount from the medical profession. Helen ",
      "MessageIndex": 32,
      "PostDate": "19/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704206",
      "Title": "Did I over react? FIred a nurse yesterday.... AlaskaDeb snowyday"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Aug 30, 2008 11:30AM Helen1 wrote: I take 20 mg oxycodone every 12 hrs and 5 mg oxycodone for breakthru pain.  I recently started taking a muscle relaxor as I was getting spasms inbetween my ribs.  I found that,  I take a lot less plain oxycodone and have alot less breakthru pain.  However the muscle relxors do make me horribly sleepy. Helen",
      "MessageIndex": 8,
      "PostDate": "30/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720125",
      "Title": "What drug for pain??? cindyleigh Helen1"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Oct 21, 2006 04:52AM Helen1 wrote:",
      "MessageIndex": 5,
      "PostDate": "21/10/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/444623",
      "Title": "sore (tendon) in arm? lymphedema? Help! milklet Helen1"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Sep 14, 2007 12:02AM Helen1 wrote: Shepgirl  Scope has a lot of alcohol and it may burn.  I can't even drink a carbonated soda during the xeloda cycle, because of the burning.  I usually use biotene mouthwash- got it originally for mouth sores from IV chemo.   My ex is an alcoholic and his drs also told him to use the biotene.  Can be purchased over the counter almost any where. My onc also had me use a solution of 1/2 tsp each baking soda and salt during that time as well.  My dentist gives me a non alcoholic peridex mouthwash because I also have ONJ syndrom.   Be careful with the scope.  Hope the lower dose works for you Helen",
      "MessageIndex": 4,
      "PostDate": "14/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692168",
      "Title": "Started Xeloda Again! Shepgirl Shepgirl"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "May 7, 2008 03:25AM Helen1 wrote:  Both my onc and pcp told me the same thing at the beginning of treatment. Bone mets are rarely fatal, but they can make you hurt. They didn't lie.  I was dx stage 4 3/2005 w/ mets to the thoracic spine (3-6) and a compression fracture at t5. I have been on 8 different chemos/hormonals w/ rads to the thoracic spine and am looking at rads to the hip.  The alternative was a hip replacement.  The mets have spread to every where but lower arms and legs, but they are very small and not to painful most of the time. It is hard not to get discouraged and feel like why am I b othering with all this.  Whats the point.  The point is you have family who loves you.  Another spring is here the flowering shrubs and trees are in bloom.  Look around,  the world is beautiful right now.  Each day well lived makes tomorrow a vision of hope.  As long as we have hope, we can do anything. Helen",
      "MessageIndex": 10,
      "PostDate": "07/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705092",
      "Title": "I'm tired charenm MariaC"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jan 28, 2008 08:04AM Helen1 wrote: Triple neg Your comment should be engraved in stone. GIVE YOURSELF PERMISSION TO BE OPTIMISTIC!! To often we have a tendency to look at the dark side.  I try to remain positive most of the time, But that line is going up on my bulletin board. Thanks Helen",
      "MessageIndex": 30,
      "PostDate": "28/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699181",
      "Title": "Help! Looking for someone who has been through the same thing! lburchfi lburchfi"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Sep 14, 2006 01:39AM Helen1 wrote:",
      "MessageIndex": 5,
      "PostDate": "14/09/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/420982",
      "Title": "Just had surgery..Tamoxifen?? cnoel bob56"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jun 17, 2008 08:32AM Helen1 wrote: ringworm is a type of fungus.  To treat a fungus w/ an antibiotic will often be like throwing gasoline on a fire.  I would try some pure aloe vera as well as an antifungal cream and possibly a new dr. Helen",
      "MessageIndex": 10,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707349",
      "Title": "xeloda and chills ozzie2 jerseymaria"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jun 17, 2008 08:32AM - edited Jun 17, 2008 08:32AM by Helen1",
      "MessageIndex": 11,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707349",
      "Title": "xeloda and chills ozzie2 jerseymaria"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jul 1, 2008 11:48AM Helen1 wrote: Great news ozzie.  Xeloda was one of the first drugs that I had any positive response to. I started out at 734 w/ tumor markers in January and by July they were down to 96.  Made the hand foot syndrome tolerable.  (And you keep your hair too).  Hope xeloda continues to work well for you. Helen",
      "MessageIndex": 19,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708302",
      "Title": "xeloda kicks butt.. ozzie2 Adnerb"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Oct 24, 2008 12:36PM - edited Oct 24, 2008 12:42PM by Helen1 Thanks everyone for your prayers and thoughts. Must be working, as I am able to get to the bedside commode and a few steps w/ walker. Its getting easier to get into the car but still can't do it by myself.  Met w/ my boss yesterday to get short term disability (75% salary) startedn for 13 days then 50% for 13 days then the long term disability kicks in. My boss and client have agreed to pay me 2 weeks vacation until the disblity kicks in.  This is a big major relief.  Finally got most of the things moved (Grant & my sister moved while I was in the hosp but i found em anyway :)  Was the house I found about 12 miles east of where we were w/ no steps.  It was boiling down to no steps or skilled nursing facility until my arm healed and w/ a met fracture who knows how long that is going to be.  Talked to my reg dr ( not on staff at same hosp as onc) Told me to stop all the crap they put me on and go back to reg regime.  I am feeling better in that direction as well and getting stronger each day. Still get extremely tired and horribly bored, guess I'll have more time to spend on the computer , but it will give me a reason to get out of bed each day.  As soon as everything gets back to semi normal I have to have my port replaced.  A nurse that had no idea what she was doing tried to inject some D 5W with out opening the port so it blew out.  Dr Talley wants to do it immediately and start back on the chemo. I just cant yet.  Chemo puts (doxil) me on my butt for a week when I don't have any other issues. one step forward and 7 steps backward.  If taking a chemo break for a few weeks is going to cause that much loss, don't think its working that well yet. We are getting some response on the lung mets, but not any on the bone mets yet.  It just seems to go on and on w/no relief in sight.  Don't know what I would do if it weren't for you ladies. A BIG IOS FOR THE ENTIRE MONTH OF OCTOBER W/ A COUPLE OF DAYS IN SEPTEMBER JUST FOR THE FUN OF IT!! Helen",
      "MessageIndex": 15,
      "PostDate": "24/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723137",
      "Title": "HELEN.. ozzie2 lizws"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Mar 8, 2008 07:51AM Helen1 wrote: Celia I had no idea you were having such problems.  Know that you are in my thoughts. Big Hugs Helen",
      "MessageIndex": 10,
      "PostDate": "08/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701646",
      "Title": "Im frightened. Ter Traci-----TripNeg"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Helen1 wrote: This Post was deleted by Helen1. A mouse eats an elephant a bite at a time (I think I may need a bigger mouse) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/705162",
      "Title": "radiation to the hip area Helen1 Helen1"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Mar 8, 2008 08:34AM Helen1 wrote: The storm may never pass, so I either have to stay inside or dance in the rain. Hezzy that sums it up so well.  Never heard it quite described that way, but that is my basic philosophy.  I was dx w/ bone mets at the beginning 3/2005.   I have an occasional bad day, particularly, when getting news of increasing mets or that they have gone to my lungs.  That was just as devastating as the original dx.  I spent nearly a week or more of just generally feeling sorry for myself and thinking that never in my life did i imagine that the end of my life would be like this.  Then I guess you could say that I decided to dance in the rain again.  It's been 2 months now since the most recent dx.  I don't know if the most recent tmt will work or not, but if it doesnt,  there will be others, and I will keep on keepin on. Helen ",
      "MessageIndex": 33,
      "PostDate": "08/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701460",
      "Title": "How do I cope with mets...anyone want to teach the 101 class?? AlaskaDeb slonedeb"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Aug 30, 2008 02:13PM Helen1 wrote: Traci I had horrible heartburn on taxol/taxotere.  My onc gave me nexium (advertised as the little purple pill)  It has been the only thing that has worked for me on any of the chemo induced GERD Helen",
      "MessageIndex": 11,
      "PostDate": "30/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720356",
      "Title": "taxol is horrid Tracy1964 AusAla"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Sep 12, 2008 10:06AM Helen1 wrote: Same thing happened to me when I did carboplatin, Taxol and aredia.  My hair started thinning.  I figured it was going to fall out so I shaved my head.  Of course it didn't.  After that, my hair 'thinned' a couple more times but I just let it go and didn't shave it.  Now I am on doxil and my hair was supposed to fall out.  After 4 treatments, it's only thinned and you really can't tell that unless you feel it. If it gets patchy I may shave it, but right now, its going as is Helen",
      "MessageIndex": 2,
      "PostDate": "12/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721031",
      "Title": "Hair loss, carboplatin taxotere zometa denise1962 ElaineD"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Helen1 wrote: This Post was deleted by Helen1. A mouse eats an elephant a bite at a time (I think I may need a bigger mouse) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698215",
      "Title": "xeloda has stopped working Helen1 celia088"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jan 9, 2008 06:36PM Helen1 wrote: First the good news-- I get to quit taking the oral chemo that has been frying out my hands and feet for the past year. I may not have to worry about my silver roots showing thru my brown hair for a while. No w the not so good news. The tumor marker was 888 a huge increase from the last one 2 months ago. I have had a small lump tht was near the mastectomy scar, that is no longer small and colorless- grew and turned an icky purple past 2 months. The tumor markers are now higher than they were last Januayr when I started the xeloda. The back pain has increased somewhate as well as the left upper arm. It's a fairly good bet that if there arent any new areas of metastisis, there are some increases in the current sites. So its off to get new liver, lung and bone scans on Friday and see Dr. Talley again on Tues to decide what to do based on the results. It looks probable that I will be back on IV chemo again for awhile. I have several xeloda, both 150 mg. and 500 mg. PM me if you are interested",
      "MessageIndex": 1,
      "PostDate": "09/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698215",
      "Title": "xeloda has stopped working Helen1 celia088"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jan 21, 2008 09:07AM Helen1 wrote: joanne- How long did it take before the xeloda symptoms stopped after you stopped taking it.  I took 3 days worth then stopped.  Last Saturday would have been the last day of the 2 weeks cycle.  My hands weren't as red and hot as they normally were.  I still had nausea, vomiting, diarrhea, swollen and painful hands and feet.  I actually felt like I had taken the whole cycle of xeloda.  And I still fill somewhat nauseous today.  Definitely not fair :) Helen",
      "MessageIndex": 6,
      "PostDate": "21/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698215",
      "Title": "xeloda has stopped working Helen1 celia088"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jan 22, 2008 08:01AM Helen1 wrote: Thanks everyone for your thoughts and encouragement.  Getting this new diagnoses in some ways has been just as devasting as the original one.  I was sure nothing could hit me that hard ever again.   In the middle of the night when you cant sleep your thoughts get kinda gnarly.  Its nice to know you have friends you can count on to get you through it.  Helen",
      "MessageIndex": 12,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698215",
      "Title": "xeloda has stopped working Helen1 celia088"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Aug 12, 2007 07:03AM Helen1 wrote:",
      "MessageIndex": 6,
      "PostDate": "12/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/674441",
      "Title": "xeloda linda8oh linda8oh"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jul 14, 2008 01:52AM Helen1 wrote: Stephanie I have been a diabetic II  since 1993.  I have been on some kind of chemo since 5/18/05  I went on lantus insulin  6 months before bc dx in 3/2005.  Lantus is a longacting overnight  Normally I take 25 units, but when I do chemo w/ steroids, my b. sugar would go up to 600 + the first  day.  I would increase the insulin up to 50 units,  for every 100 points the bs droped I would decrease the insulin by 5 units.   In the summer of 05,   my pcp added humalogue  before meals.  This is also given on a sliding scale based on your blood sugar level.   I manage to keep it under controlby adjustingthe insulin as well as taking metformin 1000 mg am and pm; glucatrol  20mg  am   and 10 mg  inthe evening  and prandin 3 mg. before each meal  The levelof the oral meds was determined before breast cancer.  Be  very careful if you take zometa or aredia.  My ONJ dentists said diabetics seem to get the osteo necrosis  of the jaw easier than a non diabetic.  And of course dont eat white food-   flour,sugar, bread, pasta any thing fried,  or if you do- within limits. Its a pain,  but its doable.  God doesn't give us more than we are able to bear Helen",
      "MessageIndex": 9,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708927",
      "Title": "Type 2 Diabeties and Steriods TripleNeg GEECH"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jan 21, 2008 09:11AM Helen1 wrote: The scans showed increase mets and many new spots,  ileac crests, jaw, ribs upper arm, neck and skull along with the thoracic spine, lumbar spine and sacrum and both hips. There are also 3 metstatic areas in the right lower lung.  I will start on Faslodex monthly injections this Friday.  My onc seems to think that after nearly 3 years on some kind of chemo,  I need a break. He doesn't feel that the new mets are super agressive, as they are all very small and not painful, so he wants to do the faslodex for 6 months Helen",
      "MessageIndex": 7,
      "PostDate": "21/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698215",
      "Title": "xeloda has stopped working Helen1 celia088"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Sep 11, 2008 05:24PM Helen1 wrote: glad your tm's have dropped ozzie.when I was on xeloda mine went from 734 to 96 in 7 months.  Made the side effects bearable Take care Helen",
      "MessageIndex": 10,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720930",
      "Title": "new to this/ high tumor markers nolagirl LuAnnH"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Aug 30, 2008 02:11PM Helen1 wrote: My thoughts and prayers are with you. Helen",
      "MessageIndex": 52,
      "PostDate": "30/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720346",
      "Title": "Dear Lord, I just scheduled brain surgery AlaskaDeb heymoose"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jan 31, 2008 08:27AM Helen1 wrote: I was dx'd w/ thoracic spine mets technically before the official dx of breast cancer.  That was 3 years ago.  I had rads to the thoracic spine, and a mastectomy.  I have been on some form of chemo since then. But, I still work full time and have a decent quality of life.  Both my onc and primary care dr. told me that you don't usually die from bone mets, but that you will hurt.  They didn't lie about the pain part.  On the days that it gets too painful= I move slower and make take an extra pain pill or too,  but mostly it doesn't stop me from doing whatever I want to. Helen",
      "MessageIndex": 15,
      "PostDate": "31/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699367",
      "Title": "1st dx includes metastasis girliebiker LilWarrior"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "May 31, 2007 09:42AM Helen1 wrote:",
      "MessageIndex": 5,
      "PostDate": "31/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/621982",
      "Title": "Xeloda, more questions Kasey Kasey"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jun 18, 2007 05:03PM Helen1 wrote: DMSO is a vetinary medicine. It will cause anything you mix it with to be absorbed through the skin. It can be dangerous if misused. It is primarily used as a catalyst for horse linament.",
      "MessageIndex": 15,
      "PostDate": "18/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/621982",
      "Title": "Xeloda, more questions Kasey Kasey"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Nov 10, 2007 03:10PM Helen1 wrote: My onc doesn't look so much at the actual numbers but more so the progression of the ups and downs.  When I started on xeloda they were at 734 and dropped steadily over the n ext several months to 91.  The two yrs previously-- the very first one was 456 before any chemo. Over the next 6 months they dropped slightly and when they started going back up, he scanned and switched ttreatments.  This was the patteren that he followed until xeloda. THen the only changes have been to adjust the dose according to the side effects.  My last scans were in Dec 06.  He figures if the tm's are going down everything is working as it should.  There have been ppl in here that have had very low tm and very active mets and high tm's w/ not so severe mets.  I think this is why some oncs don't like to use them.  Mine does, and I feel secure in his decisions- and that I feel is the key.  Do you trust your onc?    I was dx w/ bone mets to the thoracic spine before the bc was found.  The bone mets there were radiated, but over the course of nearly three years they have spread to the lumbar spine, sacrum and hips as well. PS  I love xeloda  even w/ its crappy side effects!  I had been on 6 other drugs previously before xeloda. Helen",
      "MessageIndex": 3,
      "PostDate": "10/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695230",
      "Title": "CA 27-29 numbers Bonnielv Helen1"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Oct 7, 2007 05:53AM - edited Oct 7, 2007 05:53AM by Helen1 I was dx w/ bone mets from the beginning in March 05, in the mid thoracic spine.  I have also shrunk nearly 2 inches in height.  After nearly 19 months on 6 different drugs that didn't have too much effectm the mets spread to the lower spine, sacrum, hips and pelvis.  On January this year, I started xeloda.  The mets have shrunk, pain is considerably less.  I have worked full time since recovering from surgery in March 05.  I do move a little slower and some days are just best left unmentioned, but I do pretty much what I want to do.  Getting a treatment plan started, and there are many to choose from, will make a great difference. Your positive attitude will return, and you will have days that you wont even think about bc.  Hang in there and never give up hope. Helen1",
      "MessageIndex": 10,
      "PostDate": "07/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693344",
      "Title": "scan results..numb beyond belief mjcs7 KariLynn"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Apr 24, 2008 11:10AM Helen1 wrote: I used ms contin (morphine) at the beginning 3 years ago.  after rads to the spine, I switched to vicodin for about 3 years. In January of this year I had to move up to percoset (oxycodone).  Currently looking at hip replacement and lessening of the pain, and will probably drop back to vicodin after recovering from the surgery Helen",
      "MessageIndex": 10,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704410",
      "Title": "what type of pain mets are used for bone mets? prayer mason204"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "May 16, 2008 04:55PM Helen1 wrote: I started at 4000 mg. daily, after 2 cycles, decreased to 3000 due to s/e and stayed at that level for the next 8 months decreased to 2500 last October 07 and stopped all together in Jan 08.  However, the first 8 months my tumor markers went from 734 to 96.  I had a fairly decent year and an iv chemo break.  Currently I am back to square one doing rads on hip (second area) and looking at adriamycin,  bye bye hair again #4.  Hope the xeloda works for you.  If the side effects get to gnarly, your onc will most likely reduce the dosage with no  ill effects of the treatment. Helen",
      "MessageIndex": 9,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705623",
      "Title": "XELODIANS, what is your dose? badboob67 Bronx81"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "May 16, 2008 06:20PM Helen1 wrote: Ozzie I hope the xeloda keeps working for you.  I had taxol and carboplatin for 6 months 3 years ago.  Then taxotere for another 6 months both of these were IV.  I spend the next  8 months on arimidex, tamox, femara.  I lost my hair 3 times during this time period. The last was due to adrenal exhaustion.  I took a 4 month chemo break and started on xeloda in Jan 07  until Jan 08.  My hair is now just past my shoulders and with the help of the hair color fairy a lovely brown.  It also seem to have come back in thicker and softer (a better diet might have helped there)  I then had 4 treatments of faslodex which had very little response  TMS went from 888 to 3411 in 4 months. I am having rads again to the hip this time and since the muga scan went from 45 in 05 and is now 56 when the rads are over he wants to try adriamycin this time as we couldn't use it the first time. And it will be bye bye hair etc again.  Feel like I am back to square one, only more resigned than scared this time.  I went commando all the times I was bald or wore a scarf when it was cold or i was outside in the sun, and will do the same this time.  I have worked full time thru all this and plan to keep on.  What I am basically saying is that, my hair or boob or lack of it is not who I am.   The first day I go back to work after I lose my hair, I am going to run a breakfast special Anyone who has less hair than Me, gets a free breakfast.  ( I run an employee cafeteria) We will have some laughs and most will forget that I am bald.  Thefirst time I dyed it after it came back in- it was 2 weeks before anyone commented on it a work.  Thats when I invented the hair color fairy brought by the easter bunny instead of easter eggs. Oz- we can get thru all of this  we are SURVIVORS of one of the most debilitating disease there is. whether or not we have hair ceases to be important when living and living well is the objective. I do hope the xeloda works for you.  It was one of the easier treatments I have been on. Helen",
      "MessageIndex": 33,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705323",
      "Title": "HAIR LOSS ozzie2 maggie1984"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "May 7, 2008 06:58AM Helen1 wrote:  I was on xeloda for a year.  I was able to find udder cream and bag balm (which is thicker) at a Tractor Supply Store.  You might try looking on line as well.  I used the bag balm at night w/ socks and cotton gloves (online at Walgreens.com) and applied the udder cream several times during the day. Helen",
      "MessageIndex": 6,
      "PostDate": "07/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704740",
      "Title": "Xeloda & Oh My RED HOT Feet DeirdreJeanne Toonies"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jun 8, 2008 01:59PM Helen1 wrote: I manage the bone pain w/ vicodin or oxocodone- depending on the severity.  I was dx in 3/2005 w/ stage 4 and mets to the thoracic spine w/ a compressed fracture at t5.  I received radiation to that area then.  I also just finished a session of rads to the left hip.  Both times by the 8th or 9th tmt I was getting major pain relief.  By the time I received the 14th tmt (both times) I was practically pain free in those areas. Rads to the bone mets are not like breast rads. There are only about 14 treatments and don't usually last longer than a few minutes.  Takes longer to get set up on the table than it does to get the rads.  LilacLady if you are having severe  bone pain rads will definitely help you.  The most s/e I ever had was some mild pinking of the skin and of course toward the end some fatigue.  Good luck with whatever you decide Helen",
      "MessageIndex": 5,
      "PostDate": "08/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706954",
      "Title": "Pain with bone mets maury LuAnnH"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Mar 8, 2008 04:41PM Helen1 wrote: I did xeloda by  itsself for nearly a year.  I had great response to it until about December 07, and I started getting toxic from it.  Began to have liver and kidney side effects.  It seem to be having so much fun aggravating my stomach, liver and kidneys that it forgot it was supposed to be killing cancer cells in the bones.  I did get a very good year out of it.  I stopped taking it on Jan 2 of this year.  Much to my aggravation I had a hand/foot flare 4 days ago that lasted about 3 days.  It wasn't as bad as when I was taking the actual xeloda, but I can tell you it was just as if not more aggravating.  However, my stomach is starting to return to normal, and one of these days, I am going to get brave enough to hit my favorited BBQ places again. Do you  have any idea how hard it is to live in the BBQ capital of the midwest, and not be able to eat BBQ?",
      "MessageIndex": 25,
      "PostDate": "08/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701475",
      "Title": "Anyone else do Xeloda by itself? Watson luckywife"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Sep 20, 2007 08:40PM Helen1 wrote: My tm's didn't go up, but they dropped very slowly at first.  Then due to a food poisoning problem along w/ the xeloda, I had to stop for a month and then the tm's crept back up by about 50.  That was last February.  Since then I have been on a steady diet of xeloda.  In January, the tm's started at 734.  Last July they had dropped to 91. I think that it takes a few cycles for the tm's to drop significantly.  My major drop came in April and has been decreasing steadily since.  Hang in there. Helen",
      "MessageIndex": 5,
      "PostDate": "20/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692463",
      "Title": "Tumor Markers Up :-( BrandisMom Fllorik"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Mar 23, 2008 03:04PM Helen1 wrote: Just curious mom-- Have you tried nexium for your acid reflux or did I miss in your posts.  I had mine flare when I was on xeloda, and it seemed to help more than some of the others.  Hope you are finally feeling better. Helen",
      "MessageIndex": 13,
      "PostDate": "23/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701095",
      "Title": "Having digestive problems now mom2acat mom2acat"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Apr 10, 2008 04:30PM - edited Apr 10, 2008 04:31PM by Helen1 When I was taking, taxol, carboplatin, and aredia w/ the steroids and benadryl and the anti nauseant every 3 weeks the cost for the infusion was billed at $10,000 ($45 copay for office visit) of which my HMO paid around $3500.  The oral xeloda for  84 xeloda 500mg was $1900 every 3 weeks w/ a $40 prescription drug copay.  Now I do faslodex injections for $2000 every 4 weeks w/ a $45 copay for the office visit.  The insurance co pays $1300 for it. The first year of treament/surgery/radiation the total amount billed to my insurance was over $640,000. The insurance co paid about $200,000 and my out of pocket was $1170.  Don't know what I would do if I didn't have the insurance.",
      "MessageIndex": 12,
      "PostDate": "10/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703407",
      "Title": "Using prescription insurance for chemo AlaskaDeb gsg"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Sep 26, 2007 11:11PM - edited Sep 26, 2007 11:12PM by Helen1 Nearly 3 years ago I went to the hospital w/ what I thought was an acute muscle spasm from an old auto injury.  The er dr asked me if I had any xrays on file.  I did, exactly a year previous from a newer auto accident.  These were negative at that time.  She brought the xrays in the room and showed me where nearly a third of the 2nd thru 6th thoracic vertabra each were gone.  I think you have cancer was what she said to me. It was confirmed by mammos, mri etc 2 days later.  I was on iv chemo for over a year (3 different ones) and then the antihormonals for another 7 or so months (3 of them also) Neither of these drugs caused any reduction in the bone mets, the actually spread to my hips, lumbar spine and sacrum.  I had rads to the thoracic spine which took care of most of that problem at the time.  Last January I started on xeloda, the tumor markers have dropped significantly, the bone pain is less, I have more energy, and after losing my hair 4 times it is now long enough that I have to pull it up into a clip at work.   At no time did my oncologist, or pcp indicate to me that they did not expect me to survive. They consider mets a chronic disease and both said they expect me to be around for another 20 years or so.  As I also have diabetes, and am a heart patient, I am not the easiest medically to treat, and there have been some dicey times.  But, I am still here, and I work full time at a job I like.  I may not make it the full twenty, but neither my son, or medical team will allow me to give up.  As long as you are above room temperature and still breathing-- there is always hope- and if not a cure at least NED. Helen",
      "MessageIndex": 19,
      "PostDate": "26/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692741",
      "Title": "Metastatic at presentation Kelolo Annie4"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "May 30, 2008 09:48AM Helen1 wrote: The word is osteonecrosis of the jaw.  I have it bilaterally. I was on aredia for just over a year. It is similar to zometa.  They have determined that if you are a diabetic you have a higher tendancy to  develope ONJ. The bios put the calcium back in the bones. They didn't mention any thing regarding the teeth surface.  I notice my hair and fingernails seem to grow faster during aredia.  My nails were brittle and broke easily though. The jaw bones receive more wear and tear due to the grinding (chewing) and tend to grow faster than the regular bones.  I first notice several loose teeth on the bottom and then a bony protrusion grew out and along the inner gum line.  It fell off by itself. I can feel 2 distortions on both sides of my jaw bone, and they are also visible on xray. It may also lite up a bone scan as well.  Make sure you see a dentist who is aware of the possiblity of ONJ.  The bios stay in the bones for 10 years.  I use a prescription flouride and sensitive teeth toothpaste and Pyridex rinse also prescription.  It has kept the ONJ bearble.  But invasive dental procedures can have difficulty with healing.  Good dental hygiene is a must. Helen",
      "MessageIndex": 8,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706393",
      "Title": "bisphosphonates ozzie2 Kasey"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "May 21, 2008 06:26PM Helen1 wrote: I have not heard of zometa doing this to the rib or anyother bones. It and aredia can cause ONJ (osteonecrosis of the jaw).  The dentist told me that it settled in the jaw as it grew faster than the other bones because of the grinding pressure from the teeth.  I have to see the peridontist next week and will ask her if she has heard of it happening to any other bone sites. Helen",
      "MessageIndex": 3,
      "PostDate": "21/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705774",
      "Title": "zometa side effect, hypopospatasia lifeisbe TenderIsOurMight"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Dec 3, 2007 11:19AM Helen1 wrote: I use bag balm at night when the dryness and peeling are at their worst.  I use udder cream several times during the day.  You can also buy the white cotton gloves online at Walgreens.com I beleive that they are called cosmetic gloves  You get 24 pair in a box for about $48 (includes shipping)  They are washable and re-usable, but being 100% cotton they will shrink on you.  I always order the next larger size Helen",
      "MessageIndex": 10,
      "PostDate": "03/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696054",
      "Title": "sore hands and feet Tracy1964 Helen1"
    },
    {
      "AuthorID": "Helen1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9670/profile",
      "Content": "Jan 25, 2008 09:24AM Helen1 wrote: I went to ER w/ acute back pain.  The bone mets and a compression fracture were extensive enough that the ER dr told me she thought I had cancer. (Lovely way to find out, I might add- considering she grudingly did and xray after I insisted she do one)  Had a bone scan, & MRI-  Mastectomy 8 days later  (3/2005)  Have been on some form of chemo for the last 3 years.  Xeloda stopped working so I will get first shot of faslodex today.  Latest scans showed lesions consisetent w/ metastic lung disease and more extensive bone mets.  Onc sees no need for the stress of a biopsy for either mets.  Btween the PET scans and lung, liver and bone scans- he's pretty certain that it is mets Helen",
      "MessageIndex": 16,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699088",
      "Title": "How was your bone mets diagnosed Danie awjkej"
    }
  ]
}