{
  "AuthorID": "hellome",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
  "Posts": [
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "Jun 15, 2010 06:04AM - edited Jun 15, 2010 06:06AM by hellome I received a post op bra when I had my mx in April with the little removable pouches, zip front, hook back, and so on. The size they got me was too small and frankly it was tortuous (I didn't realize so much of my pain was coming from my bra lol.)  But regardless, I did notice it was made in the USA. Things that are made here and sold here are going to be more expensive than the cheap imports we are accustomed to, because in this country the workers are paid a wage consistent with our own cost of living, not that of another country where wages paid can be much much less. In fact, manufacturers continue to find the countries with the lowest standards of living to manufacture their goods so that we can continue to enjoy our cheap products.  Here workers need to get at least our minimum wage, plus some kind of workman's comp coverage, plus the employer has to contribute to FICA etc. If the item you are talking about was made in the USA, consider the man (or woman) hours it may have taken to manufacture it, and that might help give you a better idea of what a fair price would be. I sew, so I know how long it would take to make a bra, not even counting the design and development costs, material costs, overhead costs, distribution and vendor costs etc. So probably what it cost was fair. What isn't fair is that most of us can't earn enough anymore to buy our own domestically made products. But that's another topic entirely. ;)",
      "MessageIndex": 3,
      "PostDate": "15/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753780",
      "Title": "Why Are Post Surgery Products So Expensive? wifemomx2 wifemomx2"
    },
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "Apr 6, 2010 02:06PM hellome wrote: Thanks Paxton! I guess the nerves are it. I did see my family doctor today for the preop and he confirmed what the other doctors said. He's been with me on this since the last time and basically said that we tried the conservative approach, watched and waited with our fingers crossed, and it's just time now to take the next step.  Also he said the follow up would be ridiculous, MRI's every 3 months and probably biopsies yearly with my personal history, family history, etc. Also I have the grade 3, which I didn't realize. So he said in my case it is probably not even so much a matter of if it happens (i.e. becomes invasive) but when. If it hasn't already, since they wanted to biopsy me almost a year ago with this and I've been putting it off.  And given that I've already lost a third of the breast through the last surgery, and they expect to find a fair amount of affected tissue when they operate, I probably wouldn't be left with much anyway.  So he tried to play it up like I was having a little makeover lol, since I'll at least have a little symmetry for the first time in many years. And I have to admit, that will be a nice change. I also told him about all the brave women here on this forum who are going through it and have gone through it and so much more. So I'm figuring if so many of you can handle it, then maybe I can too. :) ",
      "MessageIndex": 89,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "Apr 7, 2010 05:17AM hellome wrote:",
      "MessageIndex": 98,
      "PostDate": "07/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "Apr 6, 2010 03:45AM hellome wrote: PS - As of now I'm just scheduled for a single w immediate implant reconstruction and reduction on the unaffected side.  I know it sounds crazy, but I really wish I could see one of those reconstructed nipples up close lol. I would love to have a nipple sparing as well as skin sparing procedure, but where I've had radiation I don't think they think it's doable.",
      "MessageIndex": 86,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "Apr 7, 2010 05:06AM hellome wrote: Oh wow, you really are lucky (relatively speaking lol) to be having the nipple sparing procedure. I really wanted to try to push harder on it. But quite honestly, I've had discomfort there since my first surgery almost 10 years ago. So I try to think of it as that maybe, between that and the tissue that is also often a source of pain and discomfort, maybe I will actually have less pain after having them removed. At least that is my hope and the BS said it is possible.  And I guess I am lucky in that I'll at least be able to do the skin sparing. It was kind of iffy due to having had radiation. The skin looks really good but there has been some shrinkage etc. so at first they weren't sure I could do it. I decided to go with the same size it is now and have the other reduced, rather than try to use expanders. So it will be weird being like a B cup for the first time probably since high school lol. But like you they have told me I won't have to wear a bra (also doing the alloderm shelf with implant) so that will again be a first since high school lol. I will be thrilled to even be able to wear a bra with no underwire, or maybe one of those camisoles with the built in shelf thingy. But sadly I'm on the east coast so will probably going in before you. So hopefully you will keep my back, and then by the time I am out you should be going in and I will take yours. And yes, lots of anti anxiety medications are being utilized here too. Still having trouble sleeping but I guess that's to be expected. So much to do and get organized in the meantime.  ",
      "MessageIndex": 97,
      "PostDate": "07/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "Apr 9, 2010 07:53AM hellome wrote: If you are that concerned I would definitely call just to check in. Or maybe try your surgeons office and see what they think. I'm sure this happens a lot and they will know best what to tell you to do.",
      "MessageIndex": 115,
      "PostDate": "09/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "May 24, 2010 03:50PM hellome wrote: @NeoDonna, my surgery was quite different from yours - immediate implant (which I hate btw lol) and a reduction to the other breast to try to get some kind of symmetry. My incisions feel fine, it is the tissue that is bothering me and I think even the skin itself - very tender to the touch and as you say feels like a really bad sunburn that nothing but nothing seemed to ease. It was getting to the point where I was in tears by the end of the day and really beginning to worry I would become addicted to the pain medication. MY PS told me to try vitamine B6. I read up on it and added B12 and vitamin A. It seemed to help a little. Then I added inositol. That seemed to help a little more. Then the PS mentioned St Johns Wort and I figured I would try that also. Again, some relief but nothing major. I was beginning to think I would need to start taking something neuortonin (sp?) which is some kind of nerve blocker (PS told me this was nerve pain.) So I was reading about it and realized that it was an anti seizure medication also. And I rememebered that klonopin, a drug I normally take for anxiety was also an anti seizure drug. So I googled klonopin and pain and found some literature supporting taking klonopin in certain doses to alleviate chronic pain. And what I realized is that while I was taking the pain meds, I was afraid to take the klonopin also. Then when I was trying to stop taking the pain meds and just take ibuprofen or whatever, I forgot to re add the klonopin lol. Anyway, I am taking a much higher dose than I was before because anxiety is a problem that I have. But apparently the same thing that can cause random anxiety (i.e. not situational) is the same thing that can cause a lower pain threshold. One of the things that helps with this is something called GABA, and I guess things like klonopin and neurotonin help support GABA and raise the pain threshold. At least that is my layman's interpretation of it. The good news is that the article also said similar effect can be gained by Kava Kava and Valerian - both natural supplements. Kava Kava for day and Valerian at night to help you sleep. I'm not sure how your doc feels about natural remedies but I know all my docs love them. I have taken Kava Kava in lieu of klonopin in the past and while not as strong, it defitinitely does work as a calming agent. I have also used Valerian and it will definitely put you to sleep lol without feeling groggy in the morning.  I think there are also some other foods and things that support/enhance GABA besides these that perhaps you could research. You can also take GABA directly but there appears to be some controversy about whether it actually works or not.  In any case I wish you luck because the pain you are talking about is not fun and I'm glad to be feeling at least somewhat normal in that regard, able to actually do things again, etc. So I hope this helps.  ",
      "MessageIndex": 413,
      "PostDate": "24/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "Apr 8, 2010 04:42AM hellome wrote: Yes, yes, and yes! I had a partial mastectomy back in 2001, and for me, there was a lot of pain. I remember someone telling me that some people experience pain more strongly than others, and I guess I am just one of those people. Anyway, I think part of it is that I thought I was going in for a simple lumpectomy and would leave with a small incision and maybe a band aid or something lol. Not the case at all. So I think having to face the thought of surgery at all has me weak in the knees. As I am out trying to get things I need to get for recovery, or as I am putting away dishes on the top shelf at home, I am thinking about how long it will take for me to be able to do this pain free again. I don't like that I will be limited in any way, dependent on others, dealing with pumps, drains, bandages,  any of that. But I had a visit with my family doctor the other day to do the pre op appointment, and after spending some time with him, I know this is something I need to do.  So maybe talking with one of your care providers whom you really trust will cast some light into that darkness?  And you will hopefully either confirm within your self that your choice was the right one for you at this point in time, or that maybe it is something you might wamt to think more about.  I guess in the end it isn't something that should be entered into lightly, or walked away from lightly either.   Hang in there!",
      "MessageIndex": 107,
      "PostDate": "08/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "May 10, 2010 07:31AM - edited May 10, 2010 07:56AM by hellome I've been having a problem with the burning pain also, on both sides even though the surgeries were different on each i.e. mx with implant on one and reduction on the other. My plastic surgeon said it sounded like nerve pain and told me to try vitamin B. This came through my oncologist so I didn't get exact dosages or anything. And I couldn't remember if they said B6 or B12. So I Googled it and there is quite a lot of info on both B6 and B12 for nerve pain. I decided to try them both. I've been taking 50-100 mg of B6 and B12 up to 5000 mcg's and it seems to be helping. I read in a couple of articles that it could take awhile but for me it seemed almost immediate.  Granted I'm not pain free, but I've been able to take a lot less of the pain medication and can make it longer with just ibuprofen and tylenol as it was more the burning that was unbearable. For anyone who might be interested in reading, here is one of the better articles about it that I bookmarked.  www.psychologytoday.com/blog/c...  The article seemed (to me) to imply that this would help with healing the nerves so that maybe this wouldn't be a permanent situation i.e. taking the vitamins, but I could have misread that. Anyway I'm hopeful that it will keep improving, if not I'll probably be looking for some kind of nerve blocker or anti depressant or something. Because immobility isn't an option forever lol, and neither are the pain pills, so....  Oh, and I continue to use Arnica gel, also recommended by my plastic surgeon. It also seems to help with the burning feeling somewhat and other irritated areas. ",
      "MessageIndex": 363,
      "PostDate": "10/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "May 2, 2010 08:58AM hellome wrote: I'm having horrible itchy, burning, stinging type feeling on the outside portion of each breast. I stopped taking the nerve block medication since I wasn't having any pain. DH gave me a Benedryl thinking that might stop the itching, burning feeling. It didn't and I started taking the nerve block again last night. Now I'm worried if this is going to be a long term issue. Anyone else have this type of pain? --------- I initially had some intense itching along the incision lines, but that has mostly gone away - I imagine that was from the stitches, healing process, etc. The burning feeling, however, continues. I find that it eases when there is no pressure on the breast tissue.  If you are wearing some kind of compression bra (like a sports bra) or band, try loosening it while you are lying down - it might help. My day right now is a process of tightening and loosening the bra/compression lol. I decided it felt great without any bra at all and didn't wear one to bed one night. But on the opposite side of the mastectomy (reconstruction w/implant) I had a reduction from like a DD to a small C. They do what is I think called a nipple graft and the nipple got chafed from the cami fabric - two days later and I'm still in pain from that lol. So now I'm caught between needing some compression on the nipple to keep it from being chafed and needing to take some of the compression off the tissue on both breasts to ease the burning pain.   So you might try that at first i.e. just removing or loosening the bra or whatever you might be wearing and just giving the tissues there a chance to rest loosely to see what happens?   I'll keep my fingers crossed for you. :)",
      "MessageIndex": 315,
      "PostDate": "02/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "May 2, 2010 09:02AM hellome wrote: Oh, and I've found the Arnica gel seems to help temporarily with the burning sensation too. I only wish it lasted longer than it does. But when it is unbearable it seems to help ease it somewhat. Also some cool packs might help as well. My burning is more ont he tops of my breasts, and my cold water bottle is sometimes my best friend lol.",
      "MessageIndex": 316,
      "PostDate": "02/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "May 4, 2010 08:23AM hellome wrote: hellome- can you tape some gauze over the nipple maybe? Sounds like you need a pastie! ----------- Ha ha, you are so right!  So I've been using the gauze, but I think I'm going to pick up some of those  pads you use when you are nursing. They are just the right shape and I think may even have a little adhesive on them. I also added a little bit of A & D ointment before putting on the gauze, which seems to help. Careful to avoid the incision line because I'm sure my PS would pitch a fit lol.  It seems to help and while it does seem like it's coming along, I'm supposed to see the oncologist tomorrow, so I may see if I can pop in for them to look at it (both have offices in the hospital.)   I'm relieved, I guess, to hear about the puffiness under the arm/shoulder blade area. I have the same thing and thought maybe it was fluid build up. I got my drains out only a week or so post op, and that one was still draining pretty well. Maybe just at 30cc per day, maybe a touch above. But I only lost a few of my lymph nodes so... Anyway, thanks! :) ",
      "MessageIndex": 327,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "Apr 6, 2010 03:40AM hellome wrote: It looks like we are scheduled for the same day, dustymom. If I have the nerve to go through with it, that is. This is my second time around, original surgery and radiation was 2001. It was multi focal so  it was considered more of a partial mastectomy than a lumpectomy. I can't have radiation again, and it may be that what I have is resistant to it anyway since it is at the surgery site. So I know this is the most practical thing to do. Still I can't seem to make myself accept the fact that it is real and (if I do nothing) will actually happen. I still feel like there should be other equally beneficial options and am wondering if I should reschedule. But then I feel like it is probably just the fear talking and I should just go ahead and get it over with. Anyway, my daughter was about the same age as yours my first time, so you will definitely have your work cut out for you. I'm having my pre surgery appt this morning, though at least I've signed all of my consents ahead of time. Oh, they will be so mad if I reschedule now lol.  ",
      "MessageIndex": 85,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "Apr 9, 2010 04:02AM hellome wrote: Lorieg, thank you for the update and the encouraging words. I keep telling myself, if you all can do it, then so can I!  Fingers crossed on the path report. :)",
      "MessageIndex": 112,
      "PostDate": "09/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "hellome",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98889/profile",
      "Content": "Apr 9, 2010 04:23AM hellome wrote: Oh, and again @mantra, it's so funny but after reading and responding to your post I was thinking to myself actually how funny it is to me that I am not having a mastectomy to my unaffected breast, but I am having a reduction surgery lol.  I mean in a way wouldn't it make more sense to just have them both removed and reconstructed, since I'm having surgery on both anyway, and then they will still match - probably even better - and I wouldn't have to worry about anything forming in the other.  I think though for me, I spent so much time worrying after my initial diagnosis that I got almost desensitized to the worry. Like the most recent biopsy I had, it was something they found almost a year ago and I wouldn't let them do a surgical biopsy because they weren't sure if it was benign or not. It was only until they asked if they could just take a small sample with the stereotactic needle that I agreed.  Of course now I'm regretting that I didn't let them do it sooner, hoping that there is nothing invasive hiding in there.  But what can you do? I don't think any of us have a crystal ball, and you can only make the decision that feels right for you at the time. Like maybe if back ten years ago I had had a mastectomy, I wouldn't be here dealing with this right now, and anything else that might (but hopefully won't) be involved. So in this respect I have to say that I have a lot of respect for those that are brave enough to undergo the more prophalactic procedures. It really seems like a smart decision for a lot of people. My mother was telling me that a friend of hers had it done some 20 years ago, and she has never regretted it. And it's funny because my mother and their other friends never knew.  But according to my mom they all did notice her especially perky breasts, as compared to the rest of them lol. So there you go. Not a doctors advice in any way, but ...  :) ",
      "MessageIndex": 113,
      "PostDate": "09/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    }
  ]
}