{
  "AuthorID": "helplesslyhoping",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214192/profile",
  "Posts": [
    {
      "AuthorID": "helplesslyhoping",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214192/profile",
      "Content": "helplesslyhoping wrote: Finally heard after waiting since Wednesday. My biopsies indicated invasive ductal carcinoma, ++- I am just happy to have results. I meet with the surgeon this week. Lots of thoughts percolating through my head, but I feel good about the journey ahead! Dx 4/20/2015, IDC, Left, 6cm+, Stage IIB, Grade 2, 0/2 nodes, ER+/PR+, HER2- (IHC) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/830600",
      "Title": "Diagnosed today, 4/20, IDC helplesslyhoping mdg"
    },
    {
      "AuthorID": "helplesslyhoping",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214192/profile",
      "Content": "helplesslyhoping wrote: Hello, everyone: I was diagnosed with IDC on 4/20. I had felt a palpable tumor only a few days before that had literally appeared overnight. I have an appointment with a highly recommended surgeon (by three different people, including my obgyn) on Monday. Because my tumor already seems to be bigger than it was even a week ago, I am so nervous that I will be waiting for an extended period of time to have my lumpectomy and nodes checked (assuming that's the course of action). Also, I am only 38, no family history of cancer and my obgyn is concerned with the seemingly aggressive nature of this tumor. How long have you waited between surgical consult and actual surgery? Am I overreacting for feeling like I need to get this surgery asap? Dx 4/20/2015, IDC, Left, 6cm+, Stage IIB, Grade 2, 0/2 nodes, ER+/PR+, HER2- (IHC) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830701",
      "Title": "How soon after DX for surgery? helplesslyhoping tjh"
    }
  ]
}