{
  "AuthorID": "Hhbelle",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173591/profile",
  "Posts": [
    {
      "AuthorID": "Hhbelle",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173591/profile",
      "Content": "Mar 13, 2013 12:46PM Hhbelle wrote: Hi everyone.  I am new to the site and have been reading all your posts.  I wish I had found this site earlier. You are all such strong, brave women.   I had my double mastectomy 10/2012 with tissue expanders, no lymph nodes removed. I'm due to get my expanders exchanges with implants in the next 6 weeks. I finished my last treatment of A/taxotere 4 rounds (one every three weeks) on 1/31/2012, no radiation needed. I will be starting Tamoxifen in about 2 months.  The whole process has been hard to get through but I can't believe it's almost done. At the time it felt like forever. I definitely have had and still have \"weak moments\". The doctor put me on Xanax and this has def helped with the mood swings from the chemo. I'm still having hot flases 6 weeks later. UGH  I too had a hard time with picking out and wearing my wig. I found a great site called Girl on the go.  It was founded by a BC survivor, and the wigs are great. Nobody can tell it's not my real hair. I too check my head everyday in the sunlight to look for new growth. I lost my hair 16 days into treatment just like my MO said. Although I still had spikes here and there. I couldn't bring myself to shave these few. LOL. I've been told the hair really starts to come in full 6 weeks after treatment ends.  We will see!!",
      "MessageIndex": 1947,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "Hhbelle",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173591/profile",
      "Content": "Mar 14, 2013 04:04PM Hhbelle wrote: Hi Elena, I'm not sure but I think once your bloodwork levels are ok, it shouldn't be a problem to get a pedicure. You should pamper yourself, I say get a manicure too!!  You've been through alot. we all deserve pampering. ",
      "MessageIndex": 1949,
      "PostDate": "14/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    }
  ]
}