{
  "AuthorID": "Hiker61",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
  "Posts": [
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Aug 5, 2012 08:11AM Hiker61 wrote: Karen, I'm cheating on the antiperspirant as well. I read an article that came out a couple of years ago showing that antiperspirant with aluminum in it didn't cause any SEs. The RO gave me a special deoderant to use, but it's NOT cutting it (it's been 100+ degrees here!) I took my regular antiperspirant to work and put it on after rads. The article is mentioned on this website--search \"antiperspirant\" and you'll find it. ",
      "MessageIndex": 387,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Aug 17, 2012 10:54AM Hiker61 wrote: Fourteenth rad today. It is SO not a big deal so far. I'm fair-skinned, but I barely have pinkness and no skin pain whatsoever. I've been pretty religious about applying Miaderm...maybe that is paying off. No fatigue--I feel great! Melrose--good to see you and hope that you're feeling good after your last chemo! ",
      "MessageIndex": 493,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jul 2, 2012 03:49PM Hiker61 wrote: BLinthedesert I'm just coming over from T/C treatment thread. Great to see that you have kept up such a remarkable running schedule! I kept up my 7-8 mile runs throughout chemo and never missed boot camp. The MO said that was the reason I had a fairly easy time of chemo. I did NOT want to end chemo feeling out of shape. My RO also said that running should help minimize fatigue, so plan to keep it up throughout rads as well. I am running slower than before, but trying to keep up the mileage. I love catching a breeze on my bald head! Glad to hear you are doing it without problems! And JP--start slow, but I'm a big believer how well keeping up my running did for me through chemo. Go girls!  Glad to see some T/C pals here too.... ",
      "MessageIndex": 101,
      "PostDate": "02/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Aug 8, 2012 11:50AM Hiker61 wrote:",
      "MessageIndex": 422,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jul 11, 2012 01:01PM Hiker61 wrote:",
      "MessageIndex": 147,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Aug 4, 2012 11:57AM Hiker61 wrote:",
      "MessageIndex": 381,
      "PostDate": "04/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Sep 14, 2012 12:25PM Hiker61 wrote: Finished rads today--it's been a walk in the park...redness and some itching, but that's all. No fatigue at all, which is good because i'm headed to Tanzania for work next week! I started anastrazole (Arimidex) 1.5 weeks ago...feel no SEs at all. The only thing I'm struggling with is insomnia from Effexor, but MO said to stick with it for 6 weeks (!) It DOES really help the flashing. The being done thing hasn't sunk in yet, but I do have the Champagne on ice already for later!",
      "MessageIndex": 734,
      "PostDate": "14/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Sep 15, 2012 11:22AM Hiker61 wrote: @Melrose--I quit head coverings 2 weeks ago. My hair has come in pretty quickly and is about 3/4 of an inch. It's still a little short to look like a \"statement\" haircut, but getting there! A LOT of silver...wrestling with the coloring question! Lost half my lashes and brows in the last 6 weeks and am just NOW starting to lose fingernails--wacky timing! I'm glad you are recovering well and not having SEs from tamox.  @Stacie--Good that you aren't having SEs from Femara--I hope I follow the same path with Arimidex--so far, so good. ",
      "MessageIndex": 745,
      "PostDate": "15/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Sep 16, 2012 09:39AM Hiker61 wrote: @Stacie--I said something to the rad techs about Annie Lennox in reference to my own hair, and of course, they had no idea who I was talking about (because they are all 20-somethings)! I'd love to think I look like Annie too! @Diane--I got tons of positive feedback when I went to the office au naturel (2 weeks ago now). Now, I totally forget about my head in public! ",
      "MessageIndex": 748,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jul 3, 2012 10:22AM Hiker61 wrote: Tough boot camp this morning because it was almost 80 at 6 am! It felt good to sweat out some more of last week's chemo though! ",
      "MessageIndex": 115,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jul 11, 2012 11:22AM Hiker61 wrote: Got mapped today and my tats--ready to start on July 30, IF I am completely over my hives by then. Had a hellacious reaction to my last chemo that left me covered in hives from knee to head. The itching is finally better (although there were a few days when I was thinking hospitalized sedation sounded great), but I still look a fright. I guess they don't want to do any more skin assault until I'm completely clear. I hope I can start because I'm ready to get it over with!",
      "MessageIndex": 145,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Apr 30, 2012 10:08AM Hiker61 wrote: Hi all, my first post. I had T/C #1 on Thursday and have been doing well. I haven't had any nausea and have not had to take any meds for nausea, but I've had a churning stomach and rounds of pain/cramping. I've been on Miralax to get things moving, but I'm wondering if there's anything to help the churns/cramps--anything OTC that might help that won't constipate? Otherwise, I ran 8 miles this morning! Gold star for me! My stomach doesn't hurt when I run!",
      "MessageIndex": 166,
      "PostDate": "30/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 16, 2012 04:51PM Hiker61 wrote: Janie, I have IBS, so have dealt with mostly C for decades. I've always controlled it with a low-fat, high fiber diet, so I normally eat a ton of fiber. I started Miralax 1/day two days after chemo and it helped, although I also added in a senna tab for a few days when I needed extra help. I know what you mean about the cramping--I had some wicked bouts that were unrelated to D--had me curled up into a ball. I tried everything OTC, but nothing helped. The MO is trying me on Rx Nexium to see if that helps. Be careful with the fiber, though...I had a huge green salad for dinner a few days after chemo (a frequent dinner for me) and I thought I would die--I felt like I was having a heart attack! Lesson learned: raw veggies with garbanzos was too much for my stomach at that point!  I think this must be the most common challenge for everyone...figuring out that delicate digestive balance. And yes--grateful that we can talk poop here! My husband and I foster orphaned kittens, and we judge so much about their health based on their poop...poop is good = life is good! I hope everyone is in that GI good place soon if not now! Melrose--hope you kept that recliner warm for me... ",
      "MessageIndex": 373,
      "PostDate": "16/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 23, 2012 01:01PM - edited May 23, 2012 01:01PM by Hiker61 Ok, I'll throw out a query to my hair buddies, Melrose and Dianne...do you still have your eyebrows? I DO! This cheers me to no end! As of today, I have almost zero hair on my head, but somehow, my brows and lashes are hanging on for dear life! I'm actually relieved to lose the rest of my head hair, which itched with the wig. Hot here this weekend too...I plan to put the wig away for three days off from work. I'm getting closer to coming to work without hair, but I'm afraid it will make people feel uncomfortable. I go to my boot camp class without a lid and I love the breeze on my head!",
      "MessageIndex": 439,
      "PostDate": "23/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 25, 2012 01:45PM Hiker61 wrote: lsharvey--shave it off! I was much more bothered by the mess and stress of having it all fall out. I felt really relieved when they shaved it! I finally have no stubble now and am smooth and shiny. Rachel--ow! Hope that's your worst SE! Great weekend all! Feel good! ",
      "MessageIndex": 474,
      "PostDate": "25/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 1, 2012 09:49AM - edited May 1, 2012 09:50AM by Hiker61 @Slak--thanks for the tip on the Prilosec. I guess I think of that only for heartburn, but worth a try just to see if it helps. To Husker and Rachel just starting--the most annoying thing I'm finding (I'm day 6 of my first T/C) is just not knowing what is next. My tongue started feeling weird...well...what's that about? Going to get worse? Stay the same? Is that a hint of nausea or did I just eat too fast? Whew, ok, I suddenly feel drunk--is that going to last? Ha! I'm anxious just to get through the first couple of weeks so I have a better idea what to expect. I assume the experiences of round #1 give you an idea of what to expect down the line? Is that how others have experienced it?  For me, the actual treatment was a nonevent. There was a man sitting next to me who was having his 27th treatment. That put things into perspective for me!",
      "MessageIndex": 172,
      "PostDate": "01/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 4, 2012 09:51AM - edited May 4, 2012 09:51AM by Hiker61 Dianne and Melrose, I'm on the same schedule as you two, I think...Day 9 of treatment 1. My head started itching yesterday, too, and I thought it's probably too soon for it to fall out, but I guess something is going on with my scalp! I'm ready just to get it over with and not keep wondering when! Although I sure would love to keep my eyebrows. Here's a good SE...I woke up with swollen lips! Women pay a lot of money for this! My husband laughed his head off!",
      "MessageIndex": 210,
      "PostDate": "04/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 4, 2012 04:29PM Hiker61 wrote: I'm with you on the hair track, although I think you two gals might be a couple of days ahead of me. My head is still itchy though! And though I said Eucerin (and it is made by Eucerin), I think the name of the ointment I mean is Aquaphor--our pharmacy chain also puts their own brand on a similar product that is cheaper. It really helps though! ",
      "MessageIndex": 218,
      "PostDate": "04/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 6, 2012 10:35AM Hiker61 wrote: StayShiny--I was picking through the shelf with half-price hair products at the store, and my husband said, why are you looking at that stuff? Oh yeah! I don't need any hair products for awhile! Plus, my hair is supper frizzy in the summer humidity...no worries about taming it this summer!",
      "MessageIndex": 240,
      "PostDate": "06/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 8, 2012 03:16PM Hiker61 wrote:",
      "MessageIndex": 265,
      "PostDate": "08/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 12, 2012 06:49PM Hiker61 wrote: Melrose--you were the last holdout in the hair club--congrats for that! I totally agree that having the huge handfuls fall out was distressing, while the buzzing was liberating! I already have big bald patches (looking kind of moth-eaten, actually), so I hope to be \"smooth\" soon. Since Tuesday, I've felt completely normal. I'm LOVING this period and looking forward to riding it until next Thursday for round #2. Now, off to open some vino. Cheers, gals!",
      "MessageIndex": 304,
      "PostDate": "12/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 14, 2012 09:40AM Hiker61 wrote: StayShiny and Summer--All my docs, including surgeon, MO, and RO, thought the Ki67 was significant. I am in public health, so I did a lot of research into Ki67 literature, and it didn't take long for me to feel that chemo was the very best decision for me given a 34% score. It's a small price to pay to make sure any of those little fast-dividing dudes that may be floating out there are snuffed out! Wearing my \"party\" wig today for the first time (a very different color from my natural hair!) Getting the compliments at work from those who don't have a clue that it's a wig! I'm loving this week of feeling fantastic!  Summer--have a great and relaxing vacation!  ",
      "MessageIndex": 328,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 17, 2012 03:56PM Hiker61 wrote: Melrose, it was all warm for me when I got there. Thanks! It took 5 tries and 2 nurses to finally get a vein. We were all almost in tears at the end of the 40 minutes it took. Then it throbbed for the 2 hours because the site was near a bone in my wrist. Ok--that's my little rant for the day!  We are driving 4 hours tomorrow to attend a memorial service for my father-in-law...I hope I can do that without quick bathroom access. Feeling a little nervous about it! StayShiny--try putting an adhesive pad made for blisters over your spot on your heel. They have gel padding and will really protect that area better than a band-aid!  Hope everyone is taming their SEs today--such a beautiful day here today.",
      "MessageIndex": 378,
      "PostDate": "17/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 22, 2012 03:01PM Hiker61 wrote: Mary, if it itches and is so widespread, it doesn't sound like acne to me. But if the benadryl and hydrocortisone aren't helping, maybe your MO needs to see it. Sounds awful--I'm sorry!  Jenny--welcome. I think many here would agree that the anticipation for the first treatment was worse than reality--especially the actual treatment day itself--which for many (including me) was anti-climactic.",
      "MessageIndex": 429,
      "PostDate": "22/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jun 9, 2012 03:23PM Hiker61 wrote: Re: hair growth. My niece is a hair salon sales rep for Proctor & Gamble and they just bought out the company, Nioxin, which makes products to stimulate hair growth. She  gave me the shampoo/conditioner and lotion. I won't use it until I'm done and my hair starts coming in. I'm sure it's not as good as Rogaine, but it's not a prescription, so worth a try.  I'm very curious to see how my hair grows back. I said to DH, maybe it will come back less frizzy. He replied, maybe it will come back more frizzy. Hey, I'm looking for the bright side here!",
      "MessageIndex": 641,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jun 25, 2012 02:57PM Hiker61 wrote: Hi all--Melrose and DianneNC are a couple of days ahead of me, but I have 4th and final on Thursday. After my allergic reaction after 3, I've had a super easy time of it. They plan to pump me full of steroids and Benadryl to try and avoid another reaction, so fingers crossed. If #4 goes as easily as 3 and 2, I will be able to say that it wasn't bad. All same for me on the hair front--still have full brows and lashes! Got some white fuzz on my head, but I've been shaving it off because it itches the wig. DianneNC--you look beautiful in your wig. I've gotten to the point where I take mine off at work in the afternoon and just let it all hang out--and I certainly don't \"do\" wig on the weekends! I've gone to restaurants bald and no one even pays any attention. I'm curious to see when I'll start seeing some real growth post #4. Lezza13, I had a lumpectomy, so I'm off to rads, not exchange! Good luck to those in the chair this week and minimal SEs gals! ",
      "MessageIndex": 714,
      "PostDate": "25/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jun 27, 2012 03:13PM Hiker61 wrote:",
      "MessageIndex": 718,
      "PostDate": "27/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jul 2, 2012 11:27AM Hiker61 wrote: Coming up for air after #4 on Thursday. Had the same allergic reaction as last time, but knew what to expect and beat it down with prednisone in about 36 hours. Riding the D train today, which is unusual for me, but it's not terrible. Lost power on Friday night and had a VERY hot triple-digit day here Saturday. Power out only 24 hours for us--many others not so lucky! Back at work today and rockin' the entirely bald look--no hats, scarves, or wigs! I think others are jealous given the weather here!  Melrose, I'll check out the post-chemo and rads threads. I'm thinking of you with a couple of more to go. Hope you are having minimal SEs for round 4--I'm woozier than usual, but expect to be tip-top soon. ",
      "MessageIndex": 734,
      "PostDate": "02/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jul 3, 2012 10:27AM Hiker61 wrote: It's a great feeling to know that every day is one day closer to normal--I hope everyone is having minimal SEs and staying cool (since it seems like the entire country is roasting right now!) Another bald day for me at work--I've never had anyone bat an eyelash at work or in a public place over my bald head. Interesting!",
      "MessageIndex": 739,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Aug 7, 2012 11:40AM Hiker61 wrote:",
      "MessageIndex": 785,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 9, 2012 11:13AM Hiker61 wrote: Slak, hope you are feeling well today and that the balm helps. I've heard good things about that stuff. I haven't had any dry skin at all, but I'm still getting over my steroidal acne. It'll be just about cleared up when I have to start the 'roids again! My trashcan was full of hair this morning (if I'd cut my hair, I wouldn't have such a mess)! I had to quit brushing it because I just thought it would all come out (and I have a ton of hair)! I'm thinking I'll just go ahead and go to the barber tonight so I don't have to deal with the mounds. My husband promised to come and hold my hand!  I hope everyone is feeling good today. ",
      "MessageIndex": 277,
      "PostDate": "09/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 24, 2012 02:15PM Hiker61 wrote: Mary, I hope the new meds help your skin. At least you know not to keep using corticosteroids, which just made it worse. Maybe you can ask your MO to let you back off the steroids next time for some relief? I cut back on a couple of steroid pills (don't tell my MO!) this time, and I haven't had acne this round (nor did it affect how I felt overall). That's crazy that the doc didn't want to give you anything for it. Way to press for action. Rachel and Husker--I'm a week past #2 and I'm not sure what I did to deserve it, but I'm having a great round with few SEs. So, if you think #2 will be worse, I certainly haven't found that to be the case so far! Hoping the same for you! I hope everybody has fun stuff lined up for the long weekend. Hugs to everyone! ",
      "MessageIndex": 463,
      "PostDate": "24/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jun 1, 2012 01:11PM Hiker61 wrote: Here's my two cents on drinks--I've been using a lot of Mio, which is a no-cal \"liquid water enhancer.\" I keep one at work and one at home and just put a squirt into my big-girl cup. It helps me drink a lot more than plain water and doesn't add to my waistline. I don't do much carbonated any more, so this is perfect for me. I have found that my very favorite beverage, red wine, does not taste good. Wah! Please cancer gods, let that taste come back eventually! Janie--wow--big celebration for you. Whoopie! Dogs: We lost our remaining dog three weeks ago (her companion died last October). She had a good long life, but it's the first time we've never had a dog in the house, so it's been a sad adjustment. We do have cats, and we also foster kittens for a rescue group, so we have an abundance of feline companionship (11 right now!!!). We'll probably not make any decisions on dogs until I'm finished with all this. Miss that smile and wagging tail at the door!  Hair pals Melrose and DianneNC--zero hair on my head, but brows and lashes hangin' in! Yay! Have a feel-good weekend everyone! ",
      "MessageIndex": 537,
      "PostDate": "01/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jun 20, 2012 09:44AM Hiker61 wrote: Melrose--the whole hair experiment is kind of fascinating! I got a little white fuzz on my head (I shaved it off). I have zero in my pits (ok!), some hangers-on on my legs and down south, and my brows/lashes look the same for now. I would really be so happy if I kept my brows, but I hear they can be the last to go. I'm with you on my hopes for next week's #4. After my allergic reaction with #3, I've felt great! Hoping to hear today that my liver enzymes are down so I can have a beer at the baseball game I'm attending tonight! Feel well this week everyone! ",
      "MessageIndex": 693,
      "PostDate": "20/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 2, 2012 10:11AM Hiker61 wrote: Husker and Rachel, I felt exactly like you did last week...ok...here comes my last normal day. I also expected to be buzzed by the steroids on Wednesday, but I was fine and slept great. On Thursday after treatment I was up half the night because they give you a big ol' steroid dose in the IV. Next time, I'll take something to sleep. When I went back to low dose the next day, I was fine again. What I did get is my face all broken out with acne! OMG, really?! I guess that's the steroids too, so should go away, but I was kind of bummed! I never got super productive like I hoped  I went to boot camp class this morning--tho huffing and puffing a little more than usual!  Lezza, my stomach finally started feeling better yesterday, Day 6. I'm doing different OTCs and food things just to see what works. The nurse said just try stuff and then I'll know next time what helps most. The pharmacist actually suggested alka-seltzer for stomach cramps and that seemed to help me, but I've started Prilosec too. I also realized that a huge salad with garbanzo beans was a little too much for my stomach to take! But yeah, talk to the nurse and ask them for ideas. Onvacation...you are half-way to vacation! Yay! ",
      "MessageIndex": 180,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 4, 2012 12:14PM Hiker61 wrote:",
      "MessageIndex": 212,
      "PostDate": "04/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 4, 2012 08:22PM Hiker61 wrote: Melrose, I'm doing 4 rounds. If my Oncogene score had been higher, I would have had a longer regimen that added adriamycin, so grateful for that it's only T/C x 4.",
      "MessageIndex": 220,
      "PostDate": "04/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 8, 2012 12:18PM Hiker61 wrote: Melrose, I wondered what was up with your hair! Dianne, did you buzz over the weekend as planned? All mine are hanging in there and my head even quit itching! I thought I might have finally gotten my digestive system under control, but had a bad day yesterday. Unlike everyone else, I'm doubling up on the Miralax...I would welcome a little diarrhea (uh oh, better beware what you wish for!) Also battled two days of low-grade fever, but that seems to be over. And my Angelina Jolie lips are gone. Darn! That's the one SE I was kind of enjoying!",
      "MessageIndex": 258,
      "PostDate": "08/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 15, 2012 06:08PM Hiker61 wrote: Janie, did you try Immodium or was it beyond that? My MO told me to keep Immodium on hand in case, but I haven't needed it. We also got a list of food to eat to help the D. Just having your sleep disturbed so many times probably makes you feel as bad as anything. I sure hope you feel better soon. Yikes.",
      "MessageIndex": 360,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 22, 2012 12:22PM Hiker61 wrote: Wow, sorry to those with such skin problems. That's especially tough when the weather gets hot. A little note of caution is that I got steroid-induced acne after Tx #1 on my forehead, chin, and chest. That would be something that you would not want to treat with more topical steroids--would just make it worse! So, even if you haven't had acne since you were a teen, it can happen, and you can use OTC acne meds to help dry it up. I dialed back on the steroids after this Tx, and so far, it seems like acne may be passing me by this time!",
      "MessageIndex": 424,
      "PostDate": "22/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 22, 2012 01:38PM Hiker61 wrote: I had experienced steroidal acne years ago by taking a topical Rx for a rash (!), so I knew it might be an SE for me. Also, it was location (typical for acne), lack of itching or other redness or swelling that might look more like a rash, and my skin seemed quite oily. I didn't have it evaluated, but it just said \"acne\" and not \"rash\" to me. Also, if you've never had a problem with acne, then it's less likely to crop up now. It started a couple of days after I took my last steroids and lasted about 7-10 days.",
      "MessageIndex": 426,
      "PostDate": "22/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 28, 2012 06:13PM Hiker61 wrote: Melrose--I'm glad you're better. I spiked fevers, too, but got them under control with ibuprofen. Janie--Norovirus, too? Big UGH! Mary--wondering about your rash...any better? Jenny,  I haven't missed a day of work, but I don't work with the public. Drink a lot of water, and keep hand sanitizer close by and use it often. Eating small meals often is something that helps a lot of people if your stomach is unsettled. That wasn't something that I needed to do, but I think many do. For those who are looking at their last treatment--a big Yahoo to you!",
      "MessageIndex": 493,
      "PostDate": "28/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jun 6, 2012 03:27PM Hiker61 wrote: Yay to everyone who is finished and to everyone who sat in the big-girl chair this week. I go tomorrow for #3 and if it's as easy as #2 has been (and the nurse said no reason to think it should be) then I will feel like I hit the jackpot. Other than some wooziness and breathlessness in days 2-4, I've felt almost normal (except for the weird mouth stuff and dry eyes and wine tasting yucky and other SEs that I just can't even complain about). With help from Miralax and senna, no C or D train and no stomach cramping which was my nemesis after #1. I'm still doing 7-8 mile runs (slower than usual, but this is my normal distance) and I haven't missed my boot camp class. I just decided that I was going to keep my same exercise regimen if I possibly could. Some days I was huffing and puffing and had to drag myself to do it, but I think any activity is going to help, even if it's a walk around the block. I talked my MO out of Neulasta and my WBC count has been consistently above normal! Wacky! A little anemic, but not bad. Melrose, I hope you don't experience any SEs from the Neulasta and you may not. Also, the nurse said I might not lose my brows/lashes, but she also said they grow differently from hair, so it might just be later. Enjoying every day with them! Maybe you'll keep what head hair you have forever, Melrose! I go to outdoor bootcamp bald and I love the feel of the breeze on my scalp I'm moving on to rads at the beginning of August, so I'll look forward to hearing from others who are paving the way. I feel like all I can do is focus on what's next on the calendar...which is tomorrow's #3. Best wishes to all for minimal SEs and celebration for those finished. ",
      "MessageIndex": 600,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jun 6, 2012 06:01PM Hiker61 wrote:",
      "MessageIndex": 606,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jun 9, 2012 08:12AM Hiker61 wrote: Hi all, thanks for the support. Thanks to the high-dose steroid pack, I'm feeling much better today. Fever gone--swelling and redness much better. I'm leaning toward GeorgiaMom's regime, which is to go ahead and try #4 under close observation and with the prednisone in hand. I just don't want to think about adding another med to the regime at this point...can't imagine they'd make me do more than one more dose, but we didn't get into details. I think I'd rather have two days of misery again than long-term cardiotoxicity. We'll see what the MO says.  To all you other hot flashers out there--I have a beautiful fan that my friend in Madrid sent--LIFE SAVER! I can't go on tamoxifen, which is why I have to have my ovaries removed first. Aromatase inhibitors are only effective in the postmenopausal (which I wasn't before chemo). I think tamoxifen and AIs both cause hot flashes, so I guess, welcome to our new hot lives! Summer51--I had swollen ankles and feet and it's an SE from the taxotere. The nurse said if it didn't go away after elevation or overnight to call and they can give you a diuretic. Mine resolved after I put my feet up. Hope everyone has an SE-light weekend--I'm flying high on prednisone! ",
      "MessageIndex": 632,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jun 9, 2012 09:57AM Hiker61 wrote: Melrose, I seem to be holding steady on the hair front. Zero on my head, zero under my arms, but still have lashes/brows! Shaved my legs for the first time in a month, just so I didn't forget how...ha! My super shiny bright red bald head was quite the sight the last couple of days! Now, it's just pink. Summer51--yes, I have 33 rounds of rads, coming up around the beginning of August. That seems far away on the calendar at this point. Good day, all! ",
      "MessageIndex": 635,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jun 13, 2012 05:13PM Hiker61 wrote: Onvacation, I just read your burping story and laughed out loud! Glad you and your boss have a sense of humor, and in the burping vs rash debate, I think I'll take burping...ha! After my allergic reaction last week after #3, I've been doing great with minimal SEs. I can see the finish line from here on June 28...I'm expecting rads to be a piece of cake.  StayShiny, I haven't had any tumor marker tests, but my Vit D was low too, and they just had me increase the amount of over the counter D. I did get a call saying my liver enzymes were high, so no alcohol this week. Kind of puts a damper on the happy hour I'm attending tonight! Mmmm...root beer! They'll recheck it on Friday. Feel well, everyone! ",
      "MessageIndex": 659,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jul 6, 2012 04:27PM Hiker61 wrote: Just got back from IV steroids and Benadryl for the insane case of hives I developed yesterday! This is part of my allergic reaction even though I had chemo last week! I didn't think I'd have to see the inside of that chemo center again... The hives go from the top of my head to my knees. I look like something out of a dermatology journal. Unfortunately, none of the IV meds have helped. I've read about people with uncontrollable itching who lose their minds and commit suicide. I can understand this! Think I will go try some cold compresses, although if a bag eachof steroids and antihistamine hasn't helped, not sure why I think cold compresses will. Ha!  Congrats to Rachel, Onvacation, and Husker for graduating. It's a grand feeling of accomplishment, isn't it? ",
      "MessageIndex": 748,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jul 6, 2012 06:34PM Hiker61 wrote:",
      "MessageIndex": 751,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Aug 1, 2012 04:40PM Hiker61 wrote:",
      "MessageIndex": 768,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Aug 8, 2012 11:46AM Hiker61 wrote:",
      "MessageIndex": 793,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jul 31, 2012 02:34PM Hiker61 wrote:",
      "MessageIndex": 763,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 5, 2012 04:07PM Hiker61 wrote:",
      "MessageIndex": 237,
      "PostDate": "05/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 8, 2012 05:01PM Hiker61 wrote: Thanks for the buzzing tips, gals! I was worried about razor burn, but also wondered if \"stubble\" would be itchy. Guess I'll find out soon because I just pulled out several handsful... Good luck tomorrow StayShiny... ",
      "MessageIndex": 269,
      "PostDate": "08/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 13, 2012 09:53AM Hiker61 wrote: Interesting to me about the choice between T/C x4 and x6. I am also grade 3 with a Ki67 of 34%, but I'm ER/PR+ , HER2-, and stage 1, which is why I think I got off with x4. The MO said if I'd had a high Oncogene score (I was 22), she would have added adriamycin to the mix, but never any discussion of T/C x6.",
      "MessageIndex": 316,
      "PostDate": "13/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "May 15, 2012 09:44AM Hiker61 wrote: StayShiny, I started spiking fevers around Days #10-12, but got them under control with ibuprofen. Only once did it take a couple of hours for the ibuprofen to kick in. I opted out of Neulasta, so that was the price I paid, I guess, although it wasn't bad compared to the bone pain I've heard about from others. I think the difference between Prilosec and Pepsid is that Prilosec is long-lasting, but takes awhile to work. You need to take it regularly. Pepcid is more for immediate relief, I believe.  Great to hear from GAMom about how well #4 is going. That IS hopeful news! ",
      "MessageIndex": 353,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jun 8, 2012 06:54PM Hiker61 wrote: I had #3 yesterday without problem, but woke up looking like I'd been boiled in oil--eyes swollen shut and red skin. Also a fever and flu-like symptoms and incredible stomach pain. It appears I've had an allergic reaction to the taxotere, so I've started on high-dose steroids (different from the dexamathasone). I only saw the doc briefly, but we have to rethink next steps. She said she may stop me after round #3 or switch me to an adriamycin regimen. I'm not sure what to think about it all...what's the marginal cost of skipping #4? Adriamycin has cardiotoxicity as a side effect, which doesn't sound good. Is it worth the risk? Things to think about in the coming days while I try to keep from looking like a lobster! Anyone heard of this where you have a reaction this late in the regimen? That's what I get for breezing through #2!",
      "MessageIndex": 625,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jul 29, 2012 01:18PM Hiker61 wrote:",
      "MessageIndex": 757,
      "PostDate": "29/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Hiker61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149859/profile",
      "Content": "Jul 29, 2012 02:55PM Hiker61 wrote:",
      "MessageIndex": 760,
      "PostDate": "29/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    }
  ]
}