{
  "AuthorID": "hipjo76",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96648/profile",
  "Posts": [
    {
      "AuthorID": "hipjo76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96648/profile",
      "Content": "hipjo76 wrote: Well my story.  I am 33, no children, early menses and a 2nd year nursing student.  My maternal grandmother had breast cancer with a mastectomy when I was VERY young.  My mom died in a car accient when I was 16 so she's not here in person but spirit.  On December 22, 2009, my dog laid on my chest and it hurt.  So started feeling around and found a lump.  Cried a river as soon as I felt it.  Called my doctor the next day requesting a mammogram.  Got a call later saying I needed to be seen but my doctor (wasn't seeing anyone else) didn't have an opening until the next day Christmas Eve.  So I took it.  Get to the doctor's office and she asked why I was there, apparently the receptionist read the note wrong and I was to have the mammogram and then follow up.  No problem, I'm there so she does an exam.  She feels the lump and she definitely wants a mammogram.  Schedule a mammogram as soon as I can get in December 30th.  They do an exam, feel lump do US see nothing then do mammogram still nothing.  Radiologist comes out to speak to me and does an exam, he feels lump.  Tells me it's probably a pseudolump.  I'm not happy with that.  I want a definitive dx not a guess.  So a week later, during which I find out my maternal aunt has breast cancer, my doctor's office calls to refer me to a breast surgeon.  I'm happy with that, I want to know what is in there and have what shouldn't be there removed.   Go to the appointment with the BS on January 22 and take my sister with me, as I need that second set of ears along.  She feels the lump but doesn't feel that a needle biopsy will give her good results and she would like to take it out.  She could have done it then I would have been fine with it.  Unfortunately I had a cold so I have to wait to have my lump removed until February.  So I'm 3 days away from having my lump removed on Monday, Feb 1.  Today I'm nervous because I got the call from the hopsital telling me when to arrive Monday.  I have to say the wait is horrible.  Had to ground myself from searching the web.  Today I didn't listen and found this site.  Searched aorund and had a few questions answered and feel better.  Just want to thank everyone who posted.    Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/747556",
      "Title": "hate the wait hipjo76 mollymo25"
    },
    {
      "AuthorID": "hipjo76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96648/profile",
      "Content": "Feb 2, 2010 01:15AM hipjo76 wrote: Had lump excision today.  I'm a sore but not nervous just glad to be rid of it.  Incision is only about 1 - 1 1/2 inches long.  Been using ice and pain meds for the discomfort.  True test will be tonight and tomorrow...it always hurts worse the next day.  Thanks for the responses and I'll will keep you in my prayers for B9 results as well.  On a positive note my family and I want to do the Komen 3 day walk.  I would like to support others going through this and my family wants to be right there with me.  That means a lot to me.  ",
      "MessageIndex": 7,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/747556",
      "Title": "hate the wait hipjo76 mollymo25"
    },
    {
      "AuthorID": "hipjo76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96648/profile",
      "Content": "Feb 11, 2010 02:18AM hipjo76 wrote: I got my results.  They are benign (B9).  It was a lipoma.  Thanks to everyone for the well wishes.  My \"boob\" is healing nicely and much less sore.  Good luck to everyone.  This experience has encouraged me to do more than I am.  I am looking at my life to see what changes I can make and how I can help.  I know I am lucky and not everyone gets the news I do.   Jo",
      "MessageIndex": 11,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/747556",
      "Title": "hate the wait hipjo76 mollymo25"
    }
  ]
}