{
  "AuthorID": "hiyase269",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266846/profile",
  "Posts": [
    {
      "AuthorID": "hiyase269",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266846/profile",
      "Content": "Jan 17, 2018 06:26PM hiyase269 wrote: Thank you all for your replies and support. It seems a lot of things are happening all at once now, sternum pain when moving in certain positions and even lower pelvic pain and frequent urination (of course now I'm searching about ovarian cancer and cysts), all within a few days. I just get this feeling deep down that not only do I have breast cancer, but it has metastasized. I would have had the lymph nodes checked a long time ago if it weren't for the fact I was used to getting swollen lymph nodes all my life, off and on. I'm supposed to take a solo trip to Japan in 4 days, don't know how I'm going to mentally cope and try to enjoy myself, it will be difficult. @Michelle_in_cornland I'll probably just wait until I go back to the states (in early March) to see a psychologists. It will be next to impossible here without traveling for 2 hours (public transportation) and finding an office or clinic with English speaking psychologists (by the way they charge more just because they speak English).",
      "MessageIndex": 4,
      "PostDate": "17/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861630",
      "Title": "In a foreign country, breast and underarm lumps and scared hiyase269 MTwoman"
    },
    {
      "AuthorID": "hiyase269",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266846/profile",
      "Content": "Jan 21, 2018 02:38AM hiyase269 wrote: @KBeee Thank you for your feedback. Yup, definitely researched about cardiac issues, but it wasn't a radiating pain, they were seperate and I didn't have any chest issues, only problems with my sternum, like I pulled a muscle. I'm a HIGH anxiety individual, I even have anxiety attacks on Sunday nights (you know, Monday). The pain in my sternum has subsided significantly and the pain in my arm is gone. I also do keep a journal, recently, since going to the doctor. Two days ago, a tiny swollen lymph node popped up in my right arm, it hasn't increased in size and it's not painful until you press on it, having a little issue with my breathing now (have Asthma and allergies) but it comes and goes. So of course I think I not only do I have breast cancer, but lung cancer now. The worst part is, I'm supposed to go to Japan tomorrow for a week! Been planning this for months! By the way, you are a strong woman to have been through so much, I hope I have this kind of courage and determination when the time comes. @Mandyhiero Yup, researched about that as well. It seems every symptom for a half a dozen illnesses is hitting me all at once in a matter of days. Thought I had ovarian cancer because of (what may be IC) some bladder issues, thought I had bone cancer, now thinking lung cancer (none of this as primary but secondary if I have breast cancer, see, I already diagnosed myself...lol). Thank you for the prayers, much appreciated. @Axolotl actually have national health insurance here in Korea problem is, I will go back to the states in March where I have no insurance, so if I'm diagnosed here I wouldn't be able to start treatment here. Unfortunately. I live in a rural area of Korea and it is difficult to go to a large facility with English speaking doctors (like in Seoul), traveling would take at least 2 hours and I would have to miss work, going to work is the main contract basis for me to stay in Korea, if I miss too many days because of appointments and treatments and such I will probably have to go home, also if diagnosed and have to start chemo I wouldn't be able to work anyway (I'm a teacher). @ Rachel888 Thank you for the advice. That's true, I'm constantly CONSTANTLY searching, feeling, thinking, prodding, poking and obsessing. I looked in the mirror and I saw 2 more gray hairs in the front that I'm sure weren't there a week ago...lol. I have high anxiety anyway, so this is like being in a perpetual state of fight or flight response...lol. I'm probably having inflammation everywhere with all the cortisol being pumped out (sleep? what's that?). I will go home in March, I hope I don't go home with a dx cause I won't have any insurance and I don't want to be a burden on my family (mother and grandmother). I will try and look into some online psychologists. ",
      "MessageIndex": 10,
      "PostDate": "21/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861630",
      "Title": "In a foreign country, breast and underarm lumps and scared hiyase269 MTwoman"
    },
    {
      "AuthorID": "hiyase269",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266846/profile",
      "Content": "Feb 1, 2018 12:14AM hiyase269 wrote: @shellsatthebeach I plan on getting everything checked out at my appointment in a week, a bladder infection I can deal with, ovarian cancer...hmmm....not so much.",
      "MessageIndex": 17,
      "PostDate": "01/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861630",
      "Title": "In a foreign country, breast and underarm lumps and scared hiyase269 MTwoman"
    },
    {
      "AuthorID": "hiyase269",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266846/profile",
      "Content": "Jan 18, 2018 05:38AM hiyase269 wrote: Hi again ladies, sorry to post another comment of concern, things are happening quickly while I wait for this appointment. Has anyone experienced mild sternum pain and slight shoulder aches, frequent urination (every hour and a half) and lower pelvic pressure and it NOT be related to breast cancer or breast cancer mets? Wanting to know because I'm experiencing these symptoms while waiting on my appointment. Everything I read online points to breast cancer mets to bone with ovarian cancer. Can it happen that quickly? Like in a day? This is really an emotional roller coaster ride.",
      "MessageIndex": 5,
      "PostDate": "18/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861630",
      "Title": "In a foreign country, breast and underarm lumps and scared hiyase269 MTwoman"
    },
    {
      "AuthorID": "hiyase269",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266846/profile",
      "Content": "Jan 31, 2018 08:26PM hiyase269 wrote: Gotback from ky Japan trip Sunday night, I could barely enjoy myself, for when I was alone I only constantly checked myself in the mirror or thought about cancer and couldn't sleep. Of course now that I'm back in Korea things haven't changed, like going back to work as it keeps me having to do something but still have hard time focusing on my classes. My appointment isn' t for another week but im just tempted to go to the GP down the street (that I've seen before for asthma related issues) just to have him look under my arm or feel my pelvic area for anything unusual. @Snickersmom The expat clinics are quite far from here, all are in Seoul, I live about an hour and 45 to 2 hours away, going by public trans. It would be difficult to go on the weekday because i would have to take off work, also i only have a month left to be in Korea, I still have to prepare to leave, getmy flight and finalize any situations I have here in Korea. That's pretty cool you lived in Seoul 45 years ago, boy, the stories you can tell. I first came to Korea in 2008 and there have been a lot of changes since then. @Axolotl If I'm dx with cancer, then I will stay home permenantly because my current contractrequires that I'm able to come to work in order to have the position in the first place. It would be nice to have the same options as Koreans when it came to medical leave and whatnot because Korea has excelllent national healthcare, unfortunately, expats in my position don't have that luxury, we are enrolled in the insurance program but we get 11 days sick leave, much more than that and you could end up being let go.  I have 2 close friends who constantly keep telling me to stop worrying and that I don't have cancer, like it's all in my head, then they continue talk about their boyfriend problems and whatnot, like giving me the brush off. I'm having lower pelvic pressure especially when lying down, some constipation, though I still have bowel movements everyday . I can tell its not related to a UTI, my urination isn't affected at all and there is no burning or pain while urinating, just increased pressure like there is something swollen in the area of the bladder and uterus. Still have sternum discomfort on and off, no breast or unerarm pain but I do have a line on the outside of my breastwhere it is the most roundedwhen flexing my left arm, it looks like a vein pulling, some days it's more pronounced than others. Not really sure about that as well seeing as how im obese with heavy breasts with lines on the side, showing the ligaments have given up a long time a go (since I was a teenager) and some cellulite. Thats another thing about going to the doctors in Korea, as soon as I walk in the door they already judge me based on my weight and figure I'm just having problems with my weight, which is not the case.Tired of being alone here, tired of being alone in general.",
      "MessageIndex": 14,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861630",
      "Title": "In a foreign country, breast and underarm lumps and scared hiyase269 MTwoman"
    },
    {
      "AuthorID": "hiyase269",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266846/profile",
      "Content": "Jan 31, 2018 08:28PM hiyase269 wrote: Sorry about the typos, I was lying in bed and trying to type on my tablet, hope you guys can understand my mistakes.",
      "MessageIndex": 15,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861630",
      "Title": "In a foreign country, breast and underarm lumps and scared hiyase269 MTwoman"
    },
    {
      "AuthorID": "hiyase269",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266846/profile",
      "Content": "Feb 12, 2018 03:45PM hiyase269 wrote: @Trvler Thank you. You're right, I should stay of Dr. Google, however, I've come to rely on it yet again. I don't feel right about the results being \"clear\" and there's nothing but \"fat\" (not sure if that was sarcasm being thrown in or not). My ultrasound images look strange so I decided to research images online and compare and what I came across was \"architectural distortion\" which is exactly what it looks like on 2 of the four images of my ultrasound. Upon further research (yeah, ol' Doc G. again) I come to find out that architectural distortion is a very common find that points to early breast cancer, especially when diagnosing IDC and there is no mass. There are also 2 B9 conditions that could cause arch. dist. but read these conditions were quite rare. Also read that radiologists will make a report stating that it is an arch. dist. and maybe a biopsy is needed. In my case, the doctor and the radiologists (who speaks no English whatsoever) were a 100% positive that everything was normal, even I don't have fibrocystic breasts!The ultrasound equipment they have at the facility is top-notch (the best I've ever seen when comparing pics online), so there is no way they could have missed such an abnormality. So I have palpable masses and arch. dist. but everything is absolutely normal even there is no condition that could mask cancerous results such as fibrocystic breasts?! Hmm, I'm definitely going to get a second opinion when I go back to the states in 3 weeks, even without insurance I should at least be able to get someone to look at my ultrasound images and explain what each structure means, for me, at the local clinic, hopefully. I want to go back and talk to the doctor and have her at least explain the basics of why I don't need further screening or testing, but because of the language barrier (her English is pretty good, but not great and my Korean is horrible) she might just brush me off and insist everything is okay. Sometimes I wish I was born a guy...lol.",
      "MessageIndex": 24,
      "PostDate": "12/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861630",
      "Title": "In a foreign country, breast and underarm lumps and scared hiyase269 MTwoman"
    },
    {
      "AuthorID": "hiyase269",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266846/profile",
      "Content": "Jan 21, 2018 02:42AM hiyase269 wrote: To any one that knows. If I have fibrocystic breasts, is it normal for one breast to be more cystic than the other (as well as having other benign conditions, fibroadenomas and such)? I've searched and searched online but have not come across any definite answers.",
      "MessageIndex": 11,
      "PostDate": "21/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861630",
      "Title": "In a foreign country, breast and underarm lumps and scared hiyase269 MTwoman"
    },
    {
      "AuthorID": "hiyase269",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266846/profile",
      "Content": "Feb 8, 2018 08:54PM hiyase269 wrote: I just want to let you guys know that everything is fine. I had a mammogram and an ultrasound and even there weren't any lumps that needed investigation. I listed my symptoms above and in the original post, so people can see that they too have hope that everything can be okay even if you have a myriad of relatable symptoms. To those brave, strong, and fearless women who are battling this disease, just want to let you know that as long as you're still breathing there's hope and there's a purpose for your life maybe even moreso than people who don't have cancer. Stay strong everyone and God bless.",
      "MessageIndex": 19,
      "PostDate": "08/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861630",
      "Title": "In a foreign country, breast and underarm lumps and scared hiyase269 MTwoman"
    },
    {
      "AuthorID": "hiyase269",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266846/profile",
      "Content": "Feb 6, 2018 04:45PM hiyase269 wrote: Two days to go before my appointment. No changes except the issue with my pelvic area suddenly disappeared except for a bit of swelling in that area and lower back pain (of course I will ask about a pelvic exam as well), no pain or pressure when urinating, no strange urine odor or color and period came and left like clockwork (funny, the whole issue with my pelvic area subsided when the onset of my period). However, I'm almost certainty convinced I have at least breast cancer. I've even started researching about financial assistance for when I return home. I've stopped talking about the issue with my best friend, because she just brushes me off like I have some unfounded worries \"oh you don't have cancer, anyway, my boyfriend...\". Which is strange because her mom actually had breast cancer 10 years ago, but, thank God she got treatment and has been disease free for years now. So I would think my friend would be more understanding (but she is in the states and I'm Korea). One last squeeze for opinions before D-day. 1. tissue growth underarm, at least 2 years, no change (left) 2. fibrocystic breast, with the left one having the most lumps and a slightly sore area 3. slight shoulder discomfort and arm slightly larger than the other (still, all left side) 4. 2 inch indentation when flexing muscle on the outside of the left breast (also have other lines that indicate stretch marks, cellulite and sagging, but this one a little more pronounced) So looking at my symptoms, have you heard of cases of having these symptoms or a mixture of (not just one) and it NOT be cancer? I realize that all the praying, worrying, wondering, stressing and crying don't mean anything if you're just meant to get it. Thank you for your support.",
      "MessageIndex": 18,
      "PostDate": "06/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861630",
      "Title": "In a foreign country, breast and underarm lumps and scared hiyase269 MTwoman"
    },
    {
      "AuthorID": "hiyase269",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266846/profile",
      "Content": "Feb 9, 2018 06:50AM hiyase269 wrote: @Rachel888 Thank you for reaching out at that time. Take care! @kellyoc519 Thank you so much, stay strong and I'm sure things will work out, hey, they probably already have! I will frequent this board on and off from now on, I may need it one day and I would like to stay informed as well. God bless.",
      "MessageIndex": 22,
      "PostDate": "09/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861630",
      "Title": "In a foreign country, breast and underarm lumps and scared hiyase269 MTwoman"
    },
    {
      "AuthorID": "hiyase269",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266846/profile",
      "Content": "hiyase269 wrote: I'm a 38, single overweight female with no children living in South Korea. About 2 years ago I noticed a lumpy thickening in my left armpit as well as a large grainy lump on my neck on the right side. I was actually more afraid about the lump on my neck than with my armpit, mainly because I've suffered from swollen lymph nodes on and off my whole life (asthma as well as allergies) so I figured my armpit was more or less related to that. So I went to a doctor that could speak some English and he did an ultrasound and a biopsy, the report came back a week later and everything was clear (he said something along the lines of it just being some benign tissue around a slightly large lymph node). I was so happy about the news that I didn't ask him about my lymph node area under my left armpit, I just figured it was the same situation. Fast forward 2 years later, the thickening of my armpit hasn't changed much and occasionally goes down a little or returns to the previous size, but no enlargement. One day in October however, not sure what triggered it, but I started getting a pain in that left shoulder, not severe, but it hurt if I lift my arm a little too high. So I started researching and researching, I came across symptoms of breast cancer (lump in armpit, painful joint if it has spread...etc. ). I started getting health anxiety, checking my breast all the time and lo and behold my breast are lumpy, the left one seemed a little bit lumpier than the right, however, most lumps were still bilateral. My mind raced, lumps in the breast, thickened armpit, shoulder soreness...yup, I bet I have cancer. Over a course of a month, the shoulder pain subsided and besides the lumpy armpit and breasts, I didn't have any other breast cancer symptoms. Finally, went to a women's clinic in my area and talked to a doctor that could speak some English, she just set me up an appointment for an ultrasound and a mammogram in a MONTH. She didn't say much else. I hope I don't have cancer and that it's just one of the benign tissue growths I've read about because I don't have ANY support here (no husband, no boyfriend, no family or friends here) and if I go back home to the states I won't have any insurance as well and still minimal emotional support (only my grandmother and aging mother). I'm pretty much alone and I have to take sleeping pills at night just to sleep so I can go to work in the morning. So any advice or thoughts while I sit and swim in my anxiety while waiting for my appointment would be greatly appreciated. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861630",
      "Title": "In a foreign country, breast and underarm lumps and scared hiyase269 MTwoman"
    }
  ]
}