{
  "AuthorID": "HKgirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199612/profile",
  "Posts": [
    {
      "AuthorID": "HKgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199612/profile",
      "Content": "HKgirl wrote: Hello, I am 38 and my general practitioner found a lump in my left breast 3 years ago. I had an mammogram then an u/s. The lump was an lymph node. I've had annual mammograms since then. My last mammogram was in November of 2013 and all was well. The lymph node hasn't changed and there was nothing new to report. It's now mid April of 2014, and I find a \"lump\" in my left breast. This is on the opposite side of the lymph node. I went to my GYN the day I discovered the \"lump\". She felt it as well. She ordered and u/s, an aspiration and/or biopsy. A week later, I had an u/s and the radiologist came back behind the tech and took a second set of u/s pictures. A 4cm cyst with fluid and some suspicious solid \"specks\" in and around it were found. In addition to that, the lymph node has doubled in size since November of 2013. Next week I have an appointment for an aspiration of the cyst and then a biopsy on the solid \"specks\" . Then a second biopsy on the lymph node. I'm very nervous about the needles, and the possible pain afterwards. That's 3 different procedures on one breast! I've tried to google information on an aspiration and a biopsy on the same \"lump\" and can't find anything. This is making me even more nervous! Am I overreacting ? Is this common?  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820534",
      "Title": "Overreacting? Scared! HKgirl HKgirl"
    },
    {
      "AuthorID": "HKgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199612/profile",
      "Content": "Apr 26, 2014 05:10AM HKgirl wrote: Thank you both. I already asked if  my mom or husband could come into the room with me. The answer was no. 😞 One of the two will accompany me to the appointment. I was told that I will be at the hospital for 4-5 hours. That seems so long. Wednesday can not come soon enough! I was told that  I could have the results in about 72 hours. I guess that means the following Monday.",
      "MessageIndex": 5,
      "PostDate": "26/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820534",
      "Title": "Overreacting? Scared! HKgirl HKgirl"
    },
    {
      "AuthorID": "HKgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199612/profile",
      "Content": "Apr 25, 2014 07:23PM HKgirl wrote: Thank you very much  Wrenn!",
      "MessageIndex": 2,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820534",
      "Title": "Overreacting? Scared! HKgirl HKgirl"
    },
    {
      "AuthorID": "HKgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199612/profile",
      "Content": "HKgirl wrote: This Post was deleted by HKgirl. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820532",
      "Title": "Multiple Issues in one (•) HKgirl HKgirl"
    }
  ]
}