{
  "AuthorID": "hobokenmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131284/profile",
  "Posts": [
    {
      "AuthorID": "hobokenmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131284/profile",
      "Content": "Jun 27, 2011 07:50PM hobokenmom wrote: Barb58:  Thank you for your prayers.  I think your prayers helped.  I got my first treatment four hrs. ago and it was a breeze.  The mold didn't feel nearly as bad as it did on Friday and it was a lot quicker.  Maybe five minutes that I had to hold my arm up in the mold.   So it was much better than how I felt on Friday.  Thank you all for your support and suggestions.  I'm glad that I went ahead with the treatment.  One down and 34 to go (I think).  I really need to ask a lot more questions to my RO.  When I had my first consultation with my RO I was so glad to move ahead with my treatment after agonizing on what the best treatment is for me.  Chemo or no chemo, that once I made my decision of not doing chemo and going with Zoladex, Tamoxifen, and radiation that when I met with my RO I didn't ask many questions and he didn't tell me much either now that I'm thinking more clearly about this.  So I'll ask much more on my next visit with RO.   Did all your ROs tell you not to put on lotion, deodorant, no shaving?  Also, about what kind of creams and lotions to put on after treatment?  My RO didn't tell me any of this yet and I would think that he should've told me this before I my first treatment. Barb58:  it looks like we have similar diagnosis.  What kind of treatment are you having? If you don't mind me asking.  I was wondering if you're doing Zoladex as well.",
      "MessageIndex": 280,
      "PostDate": "27/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "hobokenmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131284/profile",
      "Content": "Jun 25, 2011 09:34AM hobokenmom wrote: Thank you ladies for your encouraging words.  I guess I'll try it and see how it goes.  It sounds like I can request a new mold at a later time if I really can't stand it.",
      "MessageIndex": 241,
      "PostDate": "25/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "hobokenmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131284/profile",
      "Content": "Jun 24, 2011 09:57PM hobokenmom wrote: Hello everyone,  I'm new to post.  Just got my mold and tatto done on Tuesday and went in today for trial run.  As soon as I got in my mold I was so uncomfortable and my arms started going numb pretty quickly in that position. Something about that position that my arm is in that I think the circulation is not good and puts my arm to sleep.  I feel it's too uncomfortable to bear for 15min for 35 treatments.  When I told the technitians this, they told me that I would have to get a new mold made and possibly whole new set of tatoos done and it would delay my treatment further.  They kept telling me that it was going to be ok but I just feel like it's not ok and want to find a more comfortable position.  Am I over-reacting or should I ask to make a new mold?  I'm just afraid that staying in the uncomfortable position will end up causing some kind of injury later.  Also, add to the feeling of not wanting to go in for treatment since it will feel like torture staying in a position when I feel so uncomfortable.  What do you ladies think about this?  Need some help!!!    I suppose to start my first radiation treatment on Monday.  Should I call cancel and request for a new mold to be made?",
      "MessageIndex": 235,
      "PostDate": "24/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    }
  ]
}