{
  "AuthorID": "hollynp",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49747/profile",
  "Posts": [
    {
      "AuthorID": "hollynp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49747/profile",
      "Content": "Apr 22, 2007 03:08PM hollynp wrote: It feels kinda hard and was a little sore. Feels maybe the size of a marble. Its in the same place where the ultrasound saw two tiny masses 5 months ago but they could not tell if they were tumors or cysts, they just wanted to watch them for any changes. So yeah I am a little worried about it and my gf is here for me no matter so that is comforting. I am also glad you ladies are here too.",
      "MessageIndex": 2,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/591703",
      "Title": "A Little Worried... hollynp hollynp"
    },
    {
      "AuthorID": "hollynp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49747/profile",
      "Content": "Apr 22, 2007 03:27PM hollynp wrote: I am calling first thing tomarrow morning to schedule my ultrasound. If they can't tell what they are then I will aks for a biopsy which I know they will suggest. The staff there is very good about getting the proper tests done. More than likely I will have to have them removed which sucks because I dont want to go through that again but my gf will be here with me so that is a comfort.",
      "MessageIndex": 4,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/591703",
      "Title": "A Little Worried... hollynp hollynp"
    },
    {
      "AuthorID": "hollynp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49747/profile",
      "Content": "hollynp wrote: Hey ladies I did a breast exam in the shower last night and felt a hard small lump or something under my armpit. My last ultrasound was 5 months ago and showed two small masses in that same area but I was unable to feel them. I am going to make an appt to see my doc tomarrow and hopfully get an ultrasound soon. He wanted me in for one around June but its a little sore, hard and not very moveable...so I am a little concerned. Anyone else having anything like that? My gf is being very supportive but she is worried bc I am so worried about it. I also thought that I felt something in my breast that I had a large fiberadenoma removed from 5 months ago...so that kinda freaked me out too. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/591703",
      "Title": "A Little Worried... hollynp hollynp"
    },
    {
      "AuthorID": "hollynp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49747/profile",
      "Content": "Apr 22, 2007 04:35PM hollynp wrote:",
      "MessageIndex": 6,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/591703",
      "Title": "A Little Worried... hollynp hollynp"
    },
    {
      "AuthorID": "hollynp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49747/profile",
      "Content": "Apr 23, 2007 03:46AM hollynp wrote: omg you have got to be joking! Please cant the moderator get this guy out of here? He is full of BS and I am tired of seeing him post these stupid things in the forum!",
      "MessageIndex": 5,
      "PostDate": "23/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/591259",
      "Title": "Why were Nuns Prone to Breast Cancer? *DELETED* author stacey2930"
    },
    {
      "AuthorID": "hollynp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49747/profile",
      "Content": "Apr 21, 2007 07:46PM hollynp wrote: Hey I had my first mammo about 5 months ago. Had to return the following week for an ultrasound. One large mass in my left breast showed up on mammo. On the ultra two smaller masses showed up in the right breast. I was scheduled for surgery the following week to remove the large mass and biopsy it. Thankfully it was a benign fiberadenoma. Needless to say I was worried sick and the surgery was on my dang 29th bday! My first surgery for anything. Now Ihave to have an ultrasound done on the right breast to see what the smaller masses are. I will make appt Monday and update everyone. Keep your chin up things will prolly turn out just fine.",
      "MessageIndex": 20,
      "PostDate": "21/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/586928",
      "Title": "Just biopsied....freaking out missz hollynp"
    },
    {
      "AuthorID": "hollynp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49747/profile",
      "Content": "Apr 29, 2007 05:25PM hollynp wrote: I was really scared before I had my surgery because the reports from the u/s and mammo said that my mass 5cm and they are usually b9 but when one reachs that size that its more than likely malignant, so needless to say I was freaking out bc i was so worried...thankfully it was b9 even though it grew to like 10cm. I actually never really noticed my lump before and neither had my gf so I dunno how long it was there or if it just blew up over night. hopfully i wont have anymore.",
      "MessageIndex": 7,
      "PostDate": "29/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/512905",
      "Title": "info about a fibroadenoma chanshan hollynp"
    },
    {
      "AuthorID": "hollynp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49747/profile",
      "Content": "Apr 22, 2007 03:24PM hollynp wrote: Well it was my first surgery ever so I was pretty scared. They had me hooked up to a lot of different IVs in prep for surgery. The staff was very nice to me and explained what was going on. They wheeled me into the operating room and gave me some meds to relax me. The anthesialogist told me that he was about to administer the meds to knock me out and said it would feel a little cold...and told me to count to 10...I got to 9 and was out cold. Everything went very well and before I knew it, they were waking me up and asking hwo I was feeling and bc it was also my birthday the nurses had gotten me a piece of pie from the cafeteria with a candle on it and all the staff sang happy birhday to me...I thought that was really nice. I think the surgery only lasted an hour. I was able to go home the same day. My breasts were wrapped with an ace banage that I had to wear for 2 days. I had a sterile dressing on my incision. I was able to wear sports bras which was recommended bc my breast did not move a lot in the sports bra. I just took it easy for about a week then returned to work. I had moderate pain but they gave me meds for it. My scar is visible which sucks and I can tell where they took out healthy tissue to get all of the tumor but it had to be done. But it was not a horriable experience like I thought it would be...just a little scary. I have two more in the other breast that might have to be removed but at least I know what to excpet so its not so bad. But once you get in there for the surgery and the nurses are talking to you...you get more relaxed and less scared. So keep your chin up..everything will be okay.",
      "MessageIndex": 23,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/586928",
      "Title": "Just biopsied....freaking out missz hollynp"
    },
    {
      "AuthorID": "hollynp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49747/profile",
      "Content": "Apr 22, 2007 12:56PM hollynp wrote: I am 29 and 5 months ago had surgery to remove a 10cm tumor from my left breast. In a week it grew from 5cm to 10cm and the doc said it was the size of a baseball. After it was biopsied it was determined to be a very large Fiberadenoma. I also have two smaller masses of unknown orgin in my right breast so I am a little worried. I am going to schedule an ultrasound on monday bc my dr wanted to have them ultrasounded again within 6 months. The smaller ones did not show up on the mammo but they did on the ultrasound. You are in my prayers that is for sure. Keep your chin up and talk to God..He listens.",
      "MessageIndex": 4,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/543420",
      "Title": "29 and SCARED What does 5 yr survival rate mean? genavive clubmember5"
    },
    {
      "AuthorID": "hollynp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49747/profile",
      "Content": "Apr 22, 2007 06:15PM hollynp wrote: Stop pushing your book in here! You need to find another place to push your book. These women in here have no interests in reading so please leave the forum. If wearing a bra was a major risk then it would be discussed with women when they have the check up and things of that nature so please leave us women alone. My doc discussed ALL the risk factors with me about BC and guess what...not one mention of a bra!! So please...leave this forum.",
      "MessageIndex": 8,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/591258",
      "Title": "Wearing of a Bra is a major Risk for Breast Cancer *DELETED* author stacey2930"
    },
    {
      "AuthorID": "hollynp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49747/profile",
      "Content": "Apr 22, 2007 05:55PM hollynp wrote: Ok that sounds dumb. Wearing a bra does not increase the risk for breast cancer, that is just plain silly and I am very offended! That is like saying that men who wear sports cups are at high risk for prostrate cancer! LOL I dont care how much research you did plain and simple..YOUR NOT A DOCTOR and have no right to say that bras are a major risk factor for breast cancer. No amount of research qualifies you to make that conclusion unless your a medical doc or something. Anyone else agree with me?",
      "MessageIndex": 6,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/591258",
      "Title": "Wearing of a Bra is a major Risk for Breast Cancer *DELETED* author stacey2930"
    }
  ]
}