{
  "AuthorID": "HolliColora…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102903/profile",
  "Posts": [
    {
      "AuthorID": "HolliColora…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102903/profile",
      "Content": "Jun 1, 2010 01:36PM HolliColorado wrote: Thanks, everyone, for the well wishes!  I'm sitting in the infusion lounge right now with my feet up in the recliner.  The first drip of the Taxotere just came down. I'm very happy right now to have the port.  It's slick.  They gave me a numbing cream to put on it an hour before coming in, so I didn't feel a thing.  They used it for drawing blood, so I'll only have one needle stick for the entire day.  Once the needle is into the port, they just screw a line into the coupler.  I may need to learn to carry my purse on the other arm when I'm out and about to keep the irritation of the port site to a minimum. @DesignerMom:  I was trying out wigs and decided I liked the crazy ones the best.  I call this one my Raggedy Ann. ",
      "MessageIndex": 50,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "HolliColora…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102903/profile",
      "Content": "Jun 26, 2010 10:14AM HolliColorado wrote: I had my second round of TC on 6/22 and all I have to say is, I love Emend.  No vomiting this time!  I've felt so good that I've been fairly social, going to baseball games and friends' parties.  I'm feeling a little fatigued now, but that may be more attributable to going out and dealing with the 90+ degree heat here. Four more rounds to go. ",
      "MessageIndex": 657,
      "PostDate": "26/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "HolliColora…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102903/profile",
      "Content": "Jun 8, 2010 07:21AM HolliColorado wrote: @ chob:  I learned from my onco nurses that you shouldn't hesitate to ask for IV fluids whenever you think you need them.  It's easy for them to do. And BTW, everyone, make your onco nurses your best friends for the next few months.  Although I bounced back from the vomiting, diarrhea, body and bone aches, fever and fatigue over the first four days after my first treatment on June 1, a whole new set of side effects is taking over.  I can't sleep more than 3-4 hours at a time, even with Ativan.  I've lost my appetite (which I don't necessarily consider a bad side effect).  I didn't poop for almost three days, and now my stools are rock hard and there's blood in them.  It's 5 a.m.  I've been up since 3:30, and I'm just waiting for the Rocky Mountain Cancer Center's nurse triage line to open in about three hours so I can talk to my new BFFs and figure out what to do about the blood in the stool situation. Despite all this, I'm maintaining my sunny disposition and am channeling the energies I do have into whipping my house and gardens into shape.  I've taken time off from being a litigation attorney, but I can't seem to shake the \"I need to be doing something productive every waking minute\" mindset.  You should see how organized my closets are!  After seven years, I can finally see the surface of my home-office desk because I actually filed and shredded things and got ride of the stacks.  My rose bushes are rewarding my attention to them with a starburst of color. There's always a silver lining.  ",
      "MessageIndex": 191,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "HolliColora…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102903/profile",
      "Content": "Jun 17, 2010 01:04AM HolliColorado wrote: Hi Ladies, Re: breakouts.  I, too, had some issues with this.  A good friend sent me a sample pack of Lindi Skin products, which were developed by dermatologists and oncologists specifically for people going through chemo.  I really like them.  You can order them at www.lindiskin.com.  I particularly like the lavender face serum. My onc also told me that my skin will be extra sensitive to sun and to wear a minimum SPF 30 everyday.   My hair began falling out yesterday and is shedding at a faster rate today.  My scalp is a little tingly and tender.  I expect my new cute short haircut will be gone by Friday. Already dreading the next treatment on Tuesday. Holli ",
      "MessageIndex": 401,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "HolliColora…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102903/profile",
      "Content": "Jun 1, 2010 03:06AM - edited Jun 1, 2010 03:07AM by HolliColorado I start chemo today (I'm having a bit of a sleepless night).  I see that the subject of ports, clinical trials, chemo orientation and other things have come up.  I can comment on these topics but have more questions, too. I will be doing six rounds of Taxotere and Cytoxin (TC) as part of an Avastin clinical study by U.S. Oncology and Genentech comparing the use of Avastin with TC with patients who receive just TC or undergo TAC (Taxotere-Adriamycin-Cytoxin).  Qualifying participants are early stage \"triple negatives\" (ER-/PR-/HER2-) with high grade tumors who cannot benefit from Tamoxifen or Herceptin.  I was randomized into the TC group.  I don't mind being the lab rat because I still get the standard chemo treatment I would have received but for entering the study.  But if it turns out Avastin ends up being super effective in preventing recurrence and its because I ended up getting a recurrence because I didn't randomize into the Avastin group, I'll be bummed.  But maybe the Avastin will be available not only for myself in the future if my cancer comes back but for the next generation of BC survivors.  It's in Stage III trial testing.  All in all, I feel like I'm doing some good for the world. My oncologist recommended the port, and I had it put into my right arm, opposite of the affected breast.  It bruised up some the few days after it was inserted, but it went away in about a week.  All I have left is some discoloration over the port entry.  I can't tell if the spot is actually the titanium color of it showing through my skin or an ongoing bruise from it knocking against my purse.  I find its presence annoying, but my doc and other survivors say I'll be happy in the long run that I had it put in.  My oncologist is associated with a large cancer center in Denver, and they offered a \"chemo teach\" session at which a nurse spent a couple hours with me explaining the different drugs that could be used for chemo (including the nasty Adriamycin, which patients apparently call the \"Red Devil\" -- glad I didn't get randomized into the TAC group!), their side affects and how to minimize them with other prescription drugs, diet and exercise.  She even explained the effects of marijuana, which is available by prescription in Colorado. According to the nurse, it's quite effective at reducing nausea, anxiety and loss of appetite.  I also got a tour of the infusion lounge, which helped me visualize what the experience actually looks like and calm a few fears about it. I still have plenty of questions, which I hope will be answered in a few hours.  I'm curious if there are any other triple negatives in this forum.  If so, what kind of chemo are you getting?  What seems to be the standard? Good luck to all of you!  I just discovered this website and find it comforting to know that others are feeling some of the same things I'm feeling.  I also have started a blog about my experiences thus far:  web.me.com/hollihartman/Hollis...   ",
      "MessageIndex": 41,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "HolliColora…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102903/profile",
      "Content": "Jun 6, 2010 10:17AM HolliColorado wrote: It's now five days after my first chemo cocktail party, and I'm finally feeling back to normal.  After I got over the vomiting and diarrhea, the Neulasta shot left my bones and body wrecked.  I slept most of Thursday and Friday morning.  I went back in for a couple bags of fluids to warn off dehydration, and they plan to adjust my anti-nausea meds for the next time.  The onco nurses couldn't believe that I was hammered with pretty much all the side effects.  \"It's always the young ones, it seems, who have the harshest side effects,\" they said.  I just turned 40 in December, but I tell ya ... I'm aging fast.  Keep your chins up, everyone.  It's a beautiful, though hot, day in Colorado and I'm going to take my dog for a hike. ",
      "MessageIndex": 145,
      "PostDate": "06/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "HolliColora…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102903/profile",
      "Content": "Aug 12, 2010 08:50PM HolliColorado wrote: Hi again!  I haven't posted in a while because I've been busy on the triple negatives' discussion board.  I have completed four of six rounds of Taxotere and Cytoxin as part of a clinical study.  I so can't wait for it to be over!  I think my treatment is different from most of the others on this thread.  No Adriamyican or Taxol for me.  No Tamoxifen or Herceptin since I'm a triple neg. Other than a bad first round, I haven't had too many horrible side effects.  I've been on Emend since the second round, and I'm calling that my wonder drug.  No nausea or vomiting anymore.  I haven't had any changes in my nails.  No mouth sores.  The fatigue has been minor and fleeting (though I seem to be feeling it more often the deeper I get into treatment.  The Claritin and ibuprofen seem to help with the Neulasta bone and muscle aches. I have experienced insomnia, which my onco thinks may be related to the steroids.  Same with the puffiness.  I've not gained much weight, but I've also not lost any even though I've been trying.  And I think I'm entering chemopause because I break into sweats every so often, even in an air-conditioned room.  It's been six weeks since the start of my last period.  I'm sort of hoping it doesn't come back! Speaking of, have any of you considered or done a hysterectomy including ovaries as a preventative measure?  I'm wondering if I could get that done and have the docs throw in a tummy tuck at the same time.   ",
      "MessageIndex": 1688,
      "PostDate": "12/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "HolliColora…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102903/profile",
      "Content": "Aug 13, 2010 10:24PM HolliColorado wrote:",
      "MessageIndex": 1714,
      "PostDate": "13/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "HolliColora…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102903/profile",
      "Content": "Jun 13, 2010 09:51AM - edited Jun 13, 2010 09:57AM by HolliColorado",
      "MessageIndex": 287,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "HolliColora…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102903/profile",
      "Content": "Jun 2, 2010 07:21PM HolliColorado wrote: Yesterday's infusion was easy peasy lemon squeasy.  Was done after about four hours and home for the afternoon.  I felt fine, ate a diet recommended by my onco and even went to the gym for a mild half-hour walk on the treadmill.  Took an Ativan before going to bed to help ward off nausea and slept like a rock. Until about 4:30 a.m.  I woke up with a rumbling in my stomach.  I didn't feel like throwing up exactly, but thought I'd take a half Ativan to try to keep it at bay.  By 7:30ish, I was power puking.  This continued until past 9 a.m. when I went in to the Cancer Center for my follow-up Neulasta shot.  By then, I also was experiencing diarrhea.  The infusion nurse hooked me up with a bag of saline with some more anti-nausea meds thrown in.  I went home and slept like the dead thanks to the anti-nausea meds.   My nausea is now controlled, but my temp has spiked about 100.5, which is the trigger temp for starting a powerful anti-biotic called Levaquin.  I called my onco and he told me to go ahead and take it, in the event I have an infection, and to come in tomorrow for more IV hydration. It's been a pretty shitty day overall.  I really was trying to stay positive and was hoping to avoid harsh SEs.  I've followed all instructions to prepare for chemo strictly.  Today is the first day I felt like a cancer victim.  I know survival is worth it, but ... the cure seems worse right now. Because everyone reacts differently to chemo, do not let my experience frighten you.  Stay positive.  I'm already on the upswing and am hoping the worst is past me. Holli ",
      "MessageIndex": 82,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    }
  ]
}