{
  "AuthorID": "holly123",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63083/profile",
  "Posts": [
    {
      "AuthorID": "holly123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63083/profile",
      "Content": "Aug 14, 2009 02:09PM - edited Aug 14, 2009 02:14PM by holly123 Hey I'm in your same boat.  January 08 last year found out I had LCIS and ADH.  Then in June of 08 had my right ovary out due to a large complex cyst.  This year I have another large complex cyst on my left ovary now and will be having a complete hysterectomy in Sept.  I am only 42 as well.  I have been taking tamoxifen for over 18 months now.  My onc will stop my tamoxifen and put me on something else after my surgery, not sure what though. Holly",
      "MessageIndex": 2,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/738787",
      "Title": "Wondering about any connection ADH/Fibroids/Ovarian Cyst mmowl holly123"
    },
    {
      "AuthorID": "holly123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63083/profile",
      "Content": "holly123 wrote: I am waiting to get my results from a MRI & mamo I had last Friday.  I was diagnosed in Jan. of 07 for LCIS/ADH found on a ex-biopsy.  In the mean time, I had blood drawn in Dec. and it showed elevated ALP at 158.  Had ultrasound of liver, etc. which came back normal.  Repeated blood work last Friday as well and now up 11 more points to 169 in one month.  Now my internal doctor is turning my results over to my BS to handle now.  Should I have any concern for this new problem.  Any body else with this problem?  I also had complete hysterectomy with complete ooph too. Thank you, Holly Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764305",
      "Title": "ELEVATED ALP LEVELS holly123 Susie123"
    },
    {
      "AuthorID": "holly123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63083/profile",
      "Content": "holly123 wrote: I had dx of LCIS 5 years ago, clear mamo's except for this past Monday where it showed a large lymph node along side a calcification that I have never had before.  I don't see my BS till Tuesday and the wait is driving me crazy.  The only thing the tech said was they would probably see me in 6 months for a repeat mamo to see if the area had changed.  Any thoughts? Thanks Peggy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/800114",
      "Title": "Lymph node seen on mammogram holly123 Zeeba"
    }
  ]
}