{
  "AuthorID": "honeybunny9…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
  "Posts": [
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 4, 2013 12:14AM honeybunny96 wrote: port placement July 9.. ACK! Chemo starts July 12.. can I run away now? just a little emotional at the moment. ",
      "MessageIndex": 73,
      "PostDate": "04/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 10, 2013 12:15AM honeybunny96 wrote: my port was placed today and I must say.. OUCH! I guess I have a low pain tollerance.  The pulling, the tugging.. the needles.. the stitches.  It was just too much for me. It turned into an emotional day.  Thank goodness for the wonderful nurses to help me get through the procedure.  I'm glad I got it.. don't get me wrong.  I just HATE needles.  *sigh* just one more hurdle to cross on the road to kicking butt! ",
      "MessageIndex": 197,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 10, 2013 02:16PM honeybunny96 wrote: Wyllikers..thanks for the pep talk.. just what I needed today as it's a really down day.  *sigh* 2 more days until chemo starts.  Can I run and hide now?",
      "MessageIndex": 211,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 13, 2013 10:09AM honeybunny96 wrote: Grace that sounds good.  I am so bruised and yellow now where I got my port.  I wish I did not forget my ativan at home that's for sure.  I swear they did not give me enough sedation as I really didn't have that great of experience.  Had my first chemo yesterday too.  Today I am just groggy and tired.  I'm a thinking nap time. love n lights (hugs)",
      "MessageIndex": 280,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 18, 2013 06:40PM honeybunny96 wrote: Jnprsn, I'm on the same cycle as you. I had my first last Friday, July 12. I think I'm an odd one with how I'm feeling. I am extremely exhausted, brain fog and feel just ughh. I think I just have to get outside more into the fresh air. I actually felt drunk on Tuesday. Ughhh. I hope your reaction is better. Good luck to everyone starting their treatments, or having the next one. I'm hoping for a really nice slow weekend, so I can have a fantastic week next week. I'm still working, and love, just not liking the low energy. Love n light to all today.",
      "MessageIndex": 397,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Aug 11, 2013 01:37PM honeybunny96 wrote: I tell you I love my scarfs! I don't think I'm going to get that wig after all.  It just doesn't suite my personality.  LOL The scarfs are colorful and color brings happiness into me! I get my nails done once a month and I can't stand to have plain borning ones. LOL This time, I have color changing nails. If its hot, they go pink, if its cold, they go purple! BEST NAILS EVER!!!  I'm having such a rough time this go around. I had my 3rd AC on Friday, yay for 1 more red devil treatment.  But WOW I think it's kicked me on my butt. I have done nothing but cry today.. I had to ship the boys out of the house to go have some fun.  I really should be sleeping right now.  But I think the morning steroids are keeping me awake!! DANG IT!! I WANT SOME SLEEP!  Eating and drinking this round has been hard for me too.  I just don't want to.  But I know i have to, to get rid of those toxins flowing through my body!  *sigh* How is everyone else doing today?  Love to all! ",
      "MessageIndex": 966,
      "PostDate": "11/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Aug 16, 2013 07:19AM honeybunny96 wrote: sweetheart.. I agree with sue (nocompromise) about the radiation.  I personally wouldn't hesitate if I didn't have clear margins and it was attached the stuff ect.  (((hugs))) and good luck on your decision. Soriya.. I use a body scrub to wash my head.  I usually have dandruff, but with using that, I have a nice clean head.. although not bald yet.. but with the hair folicles still collecting things and stuff, this scrubs the stuff out.  And gives you a nice scalp massage too!  Its funny.. now that I am almost bald.. I still walk around with a towel on my head after a shower.  Yeah, like there's water to soak up there.. NOT LOL Decided to cut my hours down at work.  Going to be a huge pay cut.. but we gotta do, what we gotta do right.  I need to get healthy so that I can get back to work full time after all this mess is over.  I just love my job too much! I tell you it's hard to let go when you have been doing so much all your life.   Going for a MLD massage tomorow and so can't wait! Oh to help with the swelling in my pec muscle are and mx sides.  I'm gonna enjoy! night all! ((hugs)) to all and good luck with those infusions",
      "MessageIndex": 1047,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Aug 21, 2013 12:25AM honeybunny96 wrote: i must say since I lost my hair, I seem to have less smell.  But I use either secret or lady speed stick.   THANK YOU ALL for the birthday wishes. It was a good day! T-minus 3 days until the last AC and RED DEVIL treatment! I'm with hannarighs! DEVIL BE GONE!! Then it's only 12 Taxol left! Yup, counting down.   Chemo farts.. that makes me laugh everytime I read it.  I think DH and I could have a competition some days.... with me winning! LOL your not alone! dang toxins!  funny at work today... near the end of the day I was calling myself '10 second tom'  OY If anyone has seen 50 first dates.. you know what I mean! LOL It was really good for a laugh. Wishing everyone a wonderful Humpday Wednesday tomorrow and good luck with anyone who has infusions (hannarigs) tomorrow.  Luv and hugs to you all!",
      "MessageIndex": 1119,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Sep 6, 2013 01:16AM honeybunny96 wrote: checking in and sending love n hugs to all of you! I too finished my DD AC and now i get to start my 12 weekly Taxol tomorrow.  Scared, nervous.. you name it.  Made sure to get my Ativan all filled up.   Tis late and I can't think.  Very big day for me it was.  I'm, in limbo for rads so I don't know if I have to do them or not. So.. well.. because I can't think and just had an attack cat try to catch a moth in my bedroom, I think I am finally settled down that I can sleep at least for 6 hours.  Bring on the Taxol!! ",
      "MessageIndex": 1318,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 2, 2013 10:46AM honeybunny96 wrote: scribb.. I love the support of your family.  Don't kids know they are invisible eyes... drawing them on will make them more prominent so they will behave better ;)   Have an awsome day ladies! ((hugs)) to all",
      "MessageIndex": 39,
      "PostDate": "02/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 2, 2013 11:59PM honeybunny96 wrote: Tmr.. good luck tomorrow ((hugs)) Hanna.. how was port placement? I think I go for mine next week July 9.  scared to pieces.  I hate needles.. but I hate being poked even more than needed, hence the port.   Time's getting closer to start date... not sure what to think at this point.  ",
      "MessageIndex": 49,
      "PostDate": "02/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 6, 2013 01:40AM honeybunny96 wrote: I know that I will be working as I can.  I don't have any $$ coming in if I don't, and with dh not always working full days.. with 3 kids, we need all the $ we can.  My work is fantastic though.  So if I need a break around the first day or so after chemo.. I just have to communicate with them.  That's the key.. and they gave me the 3rd degree that if I don't communicate to them.. they will hurt me (lovingly of course) LOL I love them so much!  ACK.. only a few more days until port placement.. and T-minus 1 week for chemo start.  ",
      "MessageIndex": 106,
      "PostDate": "06/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 13, 2013 10:01AM honeybunny96 wrote: NC, glad the sennacol kicked in.. nothing worse than... well ok there is.. but glad that's working (hugs) Sori, thank you (hugs) Peace.. this is a great site to browse to get the real information.  try to stay away from google in a time like this.  You will find way more bad than good.. and good is what you need (heck we all need).  If there is anything we can help, please ask. No question is a dumb one.  We have all been there, done that.  Ok well. I only just had 1 tx so for of chemo..so I have no clue other than I am tired right now.  Will be a nap time as soon as I can pull away from the computer. How is everyone this rainy (here it is), morning?  love n light to each of you.",
      "MessageIndex": 277,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 28, 2013 11:23PM honeybunny96 wrote: I was semi awake for the port and I hated it.  They said I had to be and could not be completely under just because of complications and they needed me to respond to some commands.  Now that it's been 2 weeks I can do almost everything I want. Its not healed completely yet, but when its done. I am allowed to do what ever I want. :) I hope that helps.  Good luck with it.  It's the best decision I have ever made with regards to this cancer dealings.  ",
      "MessageIndex": 672,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Aug 20, 2013 12:47AM honeybunny96 wrote: Good luck for everyone who is having an infusion this week. I know I too have my last red devil this Friday. Really hoping for either the same or less SE. I'm tired of being tired. On another note... I need a helmet when playing with my kitten Storm. He loves his new feather toy and after work I was laying on the couch and decided to play with him. Well oopsy if he didn't decide to go use my practically bald head as a bouncy board instead of going around. 3 beautiful long streaks on my head. Can you say... Ouch!!! Dh cleaned me up and put some ointment on so I should be fine. T-minus 15 minutes till I can say happy 38th Birthday to me!!! Just thought to share... Brag... What ever ya wanna call it ;) Gnight everyone.. here's for sweet dreams for all.",
      "MessageIndex": 1095,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Sep 8, 2013 01:37AM honeybunny96 wrote: I hear ya there hannarigs... wish it wasn't so soon! I liked having that week in between.  But I also like having an easier dose than 4 HUGE taxol treatments.   Nocompromise... sorry, I haven't been around much.  That last dose of AC took me out and threw me for a loop then I was out of town for a few days.  All caught up now.. I think.  Even though my brain reads things, sometimes I have a hard time keeping everyone seperate.   Had my first dose of Taxol on Friday.  I must say, that I slept through it.  If I had any allergic reaction to the drug I have no idea.  The benedryl threw me out cold.  I came home and slept the day away.  WOW! Today I was able to go out, and got some pretty toes painted along with a nice pedicure.   I sure enjoyed that.  Then I took a walk in walmart to get some groceries.  Too wet today to do anything else.  Now I'm up late because I forgot to take my bed time meds on time! OY  I must say, I like this round of chemo with the little meds that I have to take.  I'm only taking meds 1 hour before chemo to help with any allergic reaction.  And nothing after.  Whoo hooo!! Less drugs I have to take the better.  11 more to go!  Everyone is in my thought's and prayers and hope you all have an easy and restful weekend.  Take it easy and rest, I know that's what I'm doing tomorrow.... except we start our bowling league up again.  I'm excited for that, yet nervous.  Not many know what I have been going through.  ",
      "MessageIndex": 1332,
      "PostDate": "08/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 6, 2013 02:34PM honeybunny96 wrote: hi Sue.. my Vit D is extremely low.. like yours.  My doc told me to take 5000IU/day.  being me.. i forget to take them. it is extremely important to take them.  It is a HUGE cancer fighting benefit.  ",
      "MessageIndex": 116,
      "PostDate": "06/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 8, 2013 03:27AM honeybunny96 wrote: I have the BRCA1 gene mutation.. have known for a few years",
      "MessageIndex": 146,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 14, 2013 06:00PM honeybunny96 wrote: Hello fellow warriors. Day 2 post chemo and still have a headache. And extremely tired. I hope that tomorrow is better. I do need to get up and out, but I just have no energy. I will attempt to hit work tomorrow (work is my happy place and a way to forget about cancer and where I can be me). Tea, depends on what your pathology report came back as? Do you know? I know when I had my DMX they said they got it all, will have to talk to the oncology but may or may not need chemo. He leaned towards no chemo. Then the pathology report came back. I don't want to scare you, but just be prepared. I am having chemo because it started to go into the node. And I want to fight. I want no regrets to this. So fight I will, even if it means having chemo. Hang in there. We will be here for you. Love n light to all.",
      "MessageIndex": 300,
      "PostDate": "14/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 17, 2013 06:22AM honeybunny96 wrote: Good evening firecrackers. I just caught up on posts. It seems everyone is doing well. I have heartburn meds to take which will, and have helped. Today was a less foggy day, but wow I was exhausted after work. I came home and crashed on the couch. I told my hubby I felt drunk. I'm really hoping to keep having better days... Until next AC treatment. Love n light all.",
      "MessageIndex": 350,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 21, 2013 07:38PM honeybunny96 wrote: ((hugs)) mom.. vent, cry, scream, get angry. especially here.  no judgement what so ever.  We all have those days.. and many more to come.  Are you able to talk to your kids about your feelings so that you don't feel so bad about whats going on.. with both of you?  I know thats what my kids wanted.  I also have someone for them to talk to. Ang... its ok to get angry..but have you thought about depression?  Sometimes the stress that comes with the cancer and everything that goes with it, is just too much.  Its such a different life that we have to lead right now.. and we don't know who or what we need to do or be.  So we try to be strong. It's ok to say I need help... which I think you are doing.  Do you have a counsellor to talk to? Your doctor? I know I  asked to be put on some antidepressants just after my surgery when I found out I was going to have chemo.  It doesn't have to be forever, I just know my signs and decided before things got too out of hand to ask.  ((((hugs)))) girl.  We are here anytime for you.   Love n Light to all tonight <3",
      "MessageIndex": 489,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 22, 2013 01:10PM honeybunny96 wrote: option.. thanks I see one on August 2.  That's when my schedule would allow me to get in.  *sigh* I am almost busier with all the cancer crap than regular stuff.  ((HUGE HUGS)) to all today.  It's been a rough start to the week for me with an over the house Thunderstorm waking us up at 3/330 am.  I hate thunder.. I admit it.. I'm a chicken! So I got me and 2 kids wrapped in bed with me shaking under the blankets.. with dear ole DH.. watching the storm from the windows.  Yeah.. thanks for the support luv!  OY LOL Have a great week everyone!",
      "MessageIndex": 504,
      "PostDate": "22/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 28, 2013 11:21AM honeybunny96 wrote: Good day chemo warriors.  It's been a few days since I have been able to get on.  With working and appointments and treatments this week, it's been busy.  Today I ended up brushing my hair and now I have very little hair left on my head. It's day 16 for me.  I was told by day 17 it would be gone.  Well the doc was right.  The rest is being shaved later today.  I just put a scarf on to cover it up. I don't want to scare the kids yet as I had a good cry on Dh's shoulders.  I love my man.  It just makes it more real when you lose your hair.  It's tough. But well.. I will be going out today with the scarf and put my big girl panties on and go live my life.. because I AM HERE TO LIVE IT! Cancer won't beat the shit out of me!  Anyway.. with the Neulasta shot.  Has anyone's doctor put them  on Naproxen?  I know I took that the first shot and I felt NO PAIN what so ever.  So I started to take it again this shot.  I took the shot yesterday and I have no pain yet.   Will take it the rest of the week to be sure.   This second chemo went better than the first.  Not feeling as tired, and I of course don't have the migraine that I had during the first dose which is helping me cope.   Gotta run.. I am wishing everyone a happy sunday! <3",
      "MessageIndex": 648,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Aug 12, 2013 11:49PM honeybunny96 wrote: Good evening ladies. Feeling a little better today, but still can't sleep! I hope I can tonight.  I know that I did get dizzy spells when I moved too fast.  I agree it's just the toxins in our bodies doing the nasty and causing all those SE's.  I don't always get them.. just sometimes.  The doc's haven't mentioned anything about  low counts or anything.   Hand in there everyone! Love n Hugs to you all! ",
      "MessageIndex": 989,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Aug 16, 2013 09:38AM honeybunny96 wrote: MLD massage is manual lymph drainage. It helps when those have lymphedema or swelling in my case but not lymphedema. It also helps with the lymphatic system to help flush and rid your body of toxins. I would not rush out to get MLD massage but talk to your doc about it if it's something for you. They are staying away from when left side where I had the nodes removed and basically channeling the excess fluid to the groin area, where I have lymph nodes that 'work'. You can google for more information, but I would start at the lymphedema society website first for more up to date information.",
      "MessageIndex": 1058,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Sep 8, 2013 10:13AM honeybunny96 wrote: Lynn, my infusion ran about an hour and 15 I believe. I was so out of it, that I didn't care. LOL Oh Hanna, I hope you feel better soon. I was told to take an Advil if can as its more for joint pain and body aches. Take your temp first to make sure no fever. Gonna try to take a walk today at the zoo with the kids. I hope everyone has a good Sunday.",
      "MessageIndex": 1337,
      "PostDate": "08/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 1, 2013 07:34PM honeybunny96 wrote: annie, I hope you find out what's up soon.  Nothing is more frustrating (((hugs))) I go for my echo on July 3 to make sure I'm all good.   scribb.. how long was your AC treatment? I forgot to ask how long I would be hooked up and sitting there. I'm not a sit still kind of person. ((hugs))",
      "MessageIndex": 35,
      "PostDate": "01/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 1, 2013 11:22PM honeybunny96 wrote: well.. cut the hair so it was short (not buzz short, just short).. getting ready for chemo sux!",
      "MessageIndex": 37,
      "PostDate": "01/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 13, 2013 01:29AM honeybunny96 wrote: good evening ladies.  so sorry for not being active the past couple days.  those two pre checo days' have been really busy and I just  am so exhausted.  Tonight even more so. I have done chemo #1.  I have a carinbride page that I update if anyone wants to follow :) www.caringbridge.org/visit/mda... you just have to sign up with an email/password so we know your valid ;)  As of now.. I'm just gonna copy and paste what I wrote: So yesterday afternoon we finish with my oncology appt around noon, and go to my friendly neighborhood Safeway as that's where I fill all my prescriptions. I walk in with about 3 pages, or what it feels like is a zillion drugs to open my own pharmacy. I ask her that I need to know what the drugs are going to cost. She looks at the sheets and starts to panic. She only has about 15 minutes to order the drugs for todays dispensing. And yes. I need them tomorrow. So off she went with her speedy fingers put to work. Yay she's Awesome. She gets the orders in and I find out that Ryan's benefits are wickedly fantastic. Let's just say I got 1175 airmiles on those alone. Hmm honey, where we going after all this is done??  Fast forward to 8 pm when picking up the arsenal of drugs. Go home, make myself a spreadsheet to tell me what time, drug and when. Fast forward to 730 this morning. We drop off Alicia at her friend Maxine, thanks guys. Then go to TBCC or Tom Baker Cancer Center. Ended up arriving half hour early. We decided that some food was in order, and with eggs Benny on the menu.. mmmm. So we checked in about 850 am. Didn't get called in until after 945. Here is where that deep down braveness had to surface, as well as my meditation skills and, of course my hubby Ryan. I think the worst was what not to expect. The chemo nurses were wonderful. They explained every step of the way. I think the worst was getting the bandages off the port, as it was still tender.  So now it's time for the \"Red Devil\" How can something that needs to have the nurse cover up, double glove up and wear glasses be good for me?? Oh wait.. it is isn't good for me.. but GREAT and kills the CANCER! So.. that went in well. No issues. Flush next, then the next part of my treatment. This one was an hour long. Good think I had some wonderful friends who were able to talk to me while I was in treatment. I was by a lovely window over looking the valley. (pictures to follow) So all went well (except for that migraine). I have wonderful friends and family taking care of me. THANK YOU SO MUCH. I did sleep most of the day and will just take it one day at a time and one foot in front of the other, to take up one morning to be FREE! I WILL BEAT CANCER!  I am sorry i am unable to respond to each of you seperately.  Just know that YOU ARE ALL in my daily thoughts and prayers!   love n light 'gnight!",
      "MessageIndex": 271,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 13, 2013 10:40PM honeybunny96 wrote: day 1 post 1st chemo treatment and extremely tired.  I also had severe migraine going into my treatment which didnt' help my mood.  So after we did chemo, went shopping for a few supplies that I needed post chemo came home and crashed.  I have been up for a few hours, so that's good.  But it's like bed time again.  My figure is... This will all be good, I will feel good, I will feel good, I will feel good... then I will feel good.  I just keep saying that to myself and with the positive thoughts flowing through my body, I want to believe it.  Will see after treatment 2, in 2 weeks.   Love n light to all.  G'night",
      "MessageIndex": 287,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 21, 2013 01:51PM honeybunny96 wrote: Hi Firecrackers... sorry I have been sparce.. reading everything and praying and thinking of you all, but I'm sorry, some days' I just don't have the energy to be on my computer.   I do have my 2nd on Friday July 26.  So far I have been feeling body fatigue.  My body just doesn't want to do what I want it to do.  My brain is clear... as long as I get sleep.  It's amazing what sleep will do for a person.  My first weekend after chemo was awful, for me.  I slept the whole weekend.  I was just knocked out.  By Monday I was doing ok.  By Wednesday I started to develope no sleep as I was unconfortable and swelling a lot around my MX and down my body.  and when I saw the doc on Thursday, she said it was the beginning of lymphedema.  I was doing to much.  This devasatated me as I am an on the go person with 3 kids (1 of them special needs).  I also want to/need to work ($$ reasons) as with a family of 5... and no disability insurance.  It's tough to support.  So all weekend I have taken to my bed.  I have my computer and tv and bed LOL 3 necessities when I'm feeling like this.  I hope with a good night sleep  tonight, I will have a better week next week.   It will all be OK everyone. I know we feel at our lowest when we don't sleep, can't eat, can't poop, too much poop, constant nausea, hair loss, fatigue, tiredness, hungry all the time... you name it.  WE CAN DO IT!  I know some days it doesn't feel like it.. but WE CAN!  Love n Light to all! <3",
      "MessageIndex": 480,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 21, 2013 03:47PM honeybunny96 wrote: hanna.. I too am doing the same protocol.  As I too wanted.. no regrets and it's what the onco recomended to Kick cancer where it hurts and kill this MOFO. AC 2 coming up this friday! I love your saying! ",
      "MessageIndex": 484,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 22, 2013 01:39AM honeybunny96 wrote: I started a caringbrige site to keep everyone informed.  That's one option, easy to set up and blog like :)",
      "MessageIndex": 495,
      "PostDate": "22/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 24, 2013 11:35PM honeybunny96 wrote: Rambo.. sorry for your bad day (((hugs))) I know it doesn't make it any easier being BRCA+  Hannarigs.. YAY for the second treatment. I go for mine Friday.   On another note.. Ughhh.. HAIR LOSS...  I found out today that my pubic hair was starting to come out.  so I reached up and kind of brushed my hair and I got a bit.. not just one or two but a lot.. ACK! Its Day 12.. I wasn't expecting this until at least day 17.  I'm just gonna go to the corner and cry.  Knowing doesn't make it any easier.  ",
      "MessageIndex": 570,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Aug 6, 2013 11:00PM honeybunny96 wrote: Guess I should check in with you all and apologize for not mentioning everyone, but ((((hugs)))) to everyone. It's such a challenge to be positive when your feeling down in the dumps with chemo. What round is everyone on? I get so lost trying to keep up. I know I go for round 3 Friday, and hannarigs is tomorrow for round 3 too. I have been doing well on my second week as I am dose dense and go every 2 week's. I always dread the next round. My hair started to fall out on day 12 and day 16 it was just whisps. So we shaved it. I still haven't got that solar panel look yet. Just almost white hair fuzz which my youngest loves to rub. Here is wishing a uneventful next round for all.",
      "MessageIndex": 886,
      "PostDate": "06/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Aug 10, 2013 12:23PM honeybunny96 wrote: I looked at wigs, but haven't bought any yet. I am having too much fun with all my scarfs.  I even bought a new purple on yesterday.  It's my favorite color.  I also am playing with dangly earings too.  In all the madness around I thought I'd have some fun.. I call it pirate dressing up! LOL  So far I have had nothing but compliments on them all.  I picked mine up cheap at the dollar store or second hand store.  Best places to go. I also had a friend make me one out of a tshirt (purple of course) Perfect for when I need to wear those under my scarfs for the cold/rainy days that we seem to have so much here!  Round 3 AC yesterday.  was good most of the day, then later in evening hit and WHAM! HUGE migraine hit with the upset tummy part.  Tried to ice my neck but that did no good.  So I just took 2 gravol and went to bed.  I feel not too bad today, but am tired.  I think it's getting on nap time for me.  So far so good.  Crossing fingers it says this way.   Nocompromise.. I love love love those buffs.  Have fun wearing them!! And I love the new motto to go with them!  Villia... I had severe ache from my first chemo too. I used L'Oreal Paris go360 clean Deep facial cleanser and it came with a little rubby face scrubby.  I was clear in 2 days!! I am one not to use creams on acne if possible because I am a believer that creams on our ouchies sometimes drive them deeper and tend not to heal.  Now my face is clear and looking good.  For my head I used a product from passion parties.  I LOVE it and the scent.  Its one I can handle.  Its call salt glow body scrub. I use it all over to get rid of excess dead skin and when I used it on my head it was like a head massage.  Oh it felt soo nice!!   Another one I use is from the Body shop. It's called Cranerry joy body polish, with real cranberry extract.  It's got seeds and stuff in it as a gritt, that ohhh I love the feel of it.  And again, it gets rid of dead skin too with a special scalp massage.   Hope everyone has a good weekend and SE... semi SE free weekend! I think it's nap time now.  ",
      "MessageIndex": 947,
      "PostDate": "10/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Sep 6, 2013 04:50PM honeybunny96 wrote: so far the Taxol went good. no reactions during and nothing other than being dopy for the day, so I slept.  I actually slept 90% of the infusion, which wasn't long enough in my book.  LOL Anyway. after I got home, I just went to bed.  I'm up because I want to be able to sleep tonight.  Will see what the week brings.  If I'm feeling better, then I'll be one happy camper!! ",
      "MessageIndex": 1326,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Sep 13, 2013 12:19AM honeybunny96 wrote: Cherri, I was told today to have a bath and add vinegar to it and soak. This will help with the ph to help that yeast infection. It can't hurt. Maybe google it to see how much to add to a tub? Hannarigs, so glad you sound do good. You were in my thoughts as Taxol 2 went down the drain. My first dose wasn't too bad, except I was out cold that first day. Wow. Chemo at 9 am and I slept till 5 pm and even went to bed that night. I'm hoping I'm a little more coherent tomorrow. I guess I'm good to go, as I never got a call to say I had to wait a week. Never thought to be excited about this! Another one bites the dust.... Tomorrow thay is. So I better get sleep. It's an early appointment tomorrow. Ughhhh. LOL but say it with me now.... Another one bites the dust. That's right.. I know your all singing with me. ;). Sleep well warriors!!! And keep kicking butt.",
      "MessageIndex": 1370,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 1, 2013 04:08PM honeybunny96 wrote: Hello everyone.  My name is Melissa and it looks like I get to join the chemo in July club  July 12 is my start date.  We will be placing a port soon. I have a severe fear of needles and told the onco, that if he wanted me drugged up on Ativan for the next 20 weeks.. please do the port.  He agreed with me.  I will be about 6 weeks since my surgery.  I am so scared to do this, but I want to kick cancer's butt and not have anything left.  The only reason I am now doing the chemo is because it snuck into the nodes.  Otherwise, it would have been just surgery.  I will be doing 4 bi-weekly treatments of AC then 12 weekly of T.  I look forward to the wonderful support of you all, as well as being able to be of some support.  If anyone wants to catch me on facebook, I look forward to meeting you there as well.  just PM me and I will send you my fb link.  love n hugs to everyone. ",
      "MessageIndex": 27,
      "PostDate": "01/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 3, 2013 01:57AM honeybunny96 wrote: ((hugs)) soriya, I'm starting July 12.. I'm scared to.. but to try to be positive.. we are kicking Cancer in the Butt! and that enough should give us courage.. as well as the wonderful support around here.  Just know that we are here together on a journey that we wariorrs will WIN!  With the help of each of us together we will over come and prevail! Vent any time, just know .. we are here for you.. and each other! (((hugs))) ",
      "MessageIndex": 52,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 16, 2013 12:47AM honeybunny96 wrote: good evening warriors.. today was a good day. I'm so glad.  But I was in a fog most of the day OY.  First chemo was on Friday and i hate the way my body feels right now.  It's like I have no control over anything.  My jitters were like wacked out.. I slept a lot, was just plain exhausted.  Today was a bit better and I am glad I got out.  But oy the heartburn started.. yuck.. I feel so bloated.. yuck.  *sigh* sorry to be such a downer but oh.. from going from no drugs to being toxic.. is reall wreaking havoc on my system.  I hope everyone has a great night/day! <3",
      "MessageIndex": 328,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 17, 2013 03:34PM honeybunny96 wrote: My thoughts are with you who start chemo today. Last night, was a bad night. My MX around my arms hurts like heck and I feel so swollen, I couldn't get comfy and everytime I moved and oh so hurt. Just a bad night overall. Love n light to all firecrackers today.",
      "MessageIndex": 361,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Jul 24, 2013 05:29AM honeybunny96 wrote: Rambo.. sorry to hear about that.  I have my appt on Aug 2, so we will see what happens then.   I go for my second AC round on Friday.  I really hope that I do much better this time.  First time I had a super duper migraine which made the first day crap no matter what.  I feel so much better this second week.  My brain fog has lifted but my fatigue is still here. And hungry.. I'm hungry at night all the time! WOW!  I just have to get better hydrated during the day.    Good luck with everyone who's having infusions this week.   Love n Light to all.. g'night",
      "MessageIndex": 535,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Aug 7, 2013 11:37PM honeybunny96 wrote: geesh.. I have to scrub my not so bald head with my passion party body scrub because it looks like I have a zillion little black heads. Did anyone else find this?? I also found that my hair/head was hurting today and yesterday too. Is more coming out? Either give me hair.. or make me a solar panel. I mean don't get me wrong.. I love dressing up in my scarfs.  It's fun and I have people complimenting me on how great I look.  I even had to go buy earings to jazz me up to make me feel better too.  I haven't worn earings since highschool, but I must admit... I look good.. hence I feel good! I should start taking more pics when I fell great!  *sigh* Doc appt tomorrow, round 3 AC Friday.. YAY over half way done the \"devil\"   hannarigs.. that's so funny about puppy.  I'm sure my one cat looked at me and ran the first time she saw me.  I had to go sooth her and assure her it was me! LOL Now she comes around all the time.   ~~healing vibes~~ to all going through their next treatment this week.  ",
      "MessageIndex": 908,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Aug 15, 2013 04:37AM honeybunny96 wrote: no bacon?? That won't go out of my life! LOL I cook my bacon until really crunchy.  This way all the fat is basically cooked out.  Yummmmy bacon.. heck no that won't go! LOL  neither will sasages.  I will eat what I can eat because some day's, it's all that will get into me.  As each chemo infusion passes, it just gets harder and harder.   I am still working, but I am making the decision (with the help of a wise friend) to cut my hours back to half.  It's gonna be hard, because I'm so always on the go and never sit still.  But I do need to rest.. as you all should.  Rest, rest, rest... even if its not sleep, but resting.  I have a nice new jelly top on my mattress to make it like new and I oh so love it.  It might make it easier on me ;)  LOL   As for hair.. once mine started to fall out, I only shaved it to a #3.  It's been falling out a little here and there with each session.  I am glad I didn't shave it down bald, as I have heard that you can get some ingrown hairs that way.  I have a hard enough time when I know my hair is still faling out.  But I use a body scrub on my head.  Not only does it feel nice and cleans the pores, it gives it a nice scalp massage too.   Now off to ice my MX/swelling sites.  OY I hate day's 4-6 after chemo.  And off to get some more sleep.  Keep on winning firecrackers!! As a wise friend said to me.. this is only temporary.. IF you don't slow down now.  Because if you don't slow down now.. you may never regain your strength back again.  ((hugs)) all",
      "MessageIndex": 1027,
      "PostDate": "15/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "honeybunny9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182027/profile",
      "Content": "Sep 6, 2013 08:05AM honeybunny96 wrote: I take gabapentin at night for the pain I have in my chest area.  It really does work to nerve block and help the pain.  without it, I wouldn't be sleeping when my swellin/pain gets so bad.  I don't take it during the day as it can make you sleepy.",
      "MessageIndex": 1323,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    }
  ]
}