{
  "AuthorID": "Honeypotpie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143678/profile",
  "Posts": [
    {
      "AuthorID": "Honeypotpie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143678/profile",
      "Content": "Jul 28, 2012 05:23PM Honeypotpie wrote:",
      "MessageIndex": 2,
      "PostDate": "28/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/790410",
      "Title": "A Favor to ask of everyone with Facebook Honeypotpie chrissyb"
    },
    {
      "AuthorID": "Honeypotpie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143678/profile",
      "Content": "Honeypotpie wrote: I know TOTALLY off the subject but there is local photographer here in Clarksville, TN who is giving away a free glamour shoot to the lady who has the most likes on her comment. I posted a comment last night but she changed the rules this morning so I had to repost and I'm asking everyone with book if you wouldn't mind going to her page and liking my comment. Apparently I can't post the link :(   Her Business is Sweet and Sassy Photography - By Crystal Belbin I'm \"D. Nicole Horn\" my comment says \"Okay let's try this again lol. I would LOVE to win this photo shoot. This would be a great confidence booster after a double mastectomy :) Please consider this to be my entry.\" If you have the time to vote I would really appreciate it. If not that's okay! THANKS LADIES!!!! In love with life Dx 12/26/2011, Stage 0, Grade 1, 0/0 nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/790410",
      "Title": "A Favor to ask of everyone with Facebook Honeypotpie chrissyb"
    },
    {
      "AuthorID": "Honeypotpie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143678/profile",
      "Content": "Honeypotpie wrote: On June 11th I had my double mastectomy (nipple and skin sparing). I had to go back in the end of June to be reopened on my left side, to remove a 150cc + seroma and blood clot. Healing went well there after. A few days ago I noticed what appeared to be a large stretch mark where the nipple connects (northside). I rubbed my hand on it about an hour ago and it started bleeding under the skin. I went and grabbed my medical bag punctured it with a 25g syringe. Blood, clear fluid and yellow pus came out. I believe it is another seroma. It had no odor and there was no pain, redness (other than previously noted), or heat. I made sure I milked it until it was blood only coming out. I now have tenderness in the area. I cleaned it and applied antibacterial ointment. I have placed 2 calls into my PS office already with no call back yet.  Has anyone else experienced this??? Can anyone provide some reassurance? I'm scared out of my mind!!! In love with life Dx 12/26/2011, Stage 0, Grade 1, 0/0 nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793181",
      "Title": "Scared and Need advice! Possible Nipple Seroma Honeypotpie Honeypotpie"
    },
    {
      "AuthorID": "Honeypotpie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143678/profile",
      "Content": "Dec 20, 2012 02:30AM Honeypotpie wrote: FarmerLucy- I did indeed see him. It was a seroma. I drained it at home and had no further issues. I hope you are doing well and that your circulation issues are improving!",
      "MessageIndex": 2,
      "PostDate": "20/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793181",
      "Title": "Scared and Need advice! Possible Nipple Seroma Honeypotpie Honeypotpie"
    },
    {
      "AuthorID": "Honeypotpie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143678/profile",
      "Content": "Mar 25, 2012 10:59PM Honeypotpie wrote: Thank you so much and God Bless you!",
      "MessageIndex": 11,
      "PostDate": "25/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781465",
      "Title": "Double Mastectomy, will I get 38D's back? Honeypotpie vicky3blum"
    },
    {
      "AuthorID": "Honeypotpie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143678/profile",
      "Content": "Honeypotpie wrote: I'm 32 years old and a mom of 4 young sons. I found the lumps (in both breasts) on Christmas Day after a run. I was at the doctors the very next day and having a double mammogram and ult. that Thursday. The results were not good :( needless to say that's why I'm here. I met with my surgeon last Friday and I've been scared our of my mind, tense and depressed ever since. I have to have a double mastectomy. I know right now that I was reconstruction. At this point my lymph nodes are going to be staying and they might be able to save my nipples. I am at the point where I have somewhat accepted they will no longer be my boobs. I can deal with not having nipples but I have had a large chest my whole life, the thought of having nothing scares the hell out of me. I decided I want reconstruction right away. My surgeon said we will discuss details at my Feb 10th appt. I'm looking for answers now. I would rather have my life then my chest and I don't want to come across shallow, I am just trying to get answers to each issues as the panic sets in. With reconstruction did you get your same size chest back? Are you forced to have a smaller size by insurance or physical limitations? I want to save as much skin as possible will that be a factor? Please tell me your experience. I'm so scared. I can barely eat, sleep or function. In love with life Dx 12/26/2011, Stage 0, Grade 1, 0/0 nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781465",
      "Title": "Double Mastectomy, will I get 38D's back? Honeypotpie vicky3blum"
    },
    {
      "AuthorID": "Honeypotpie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143678/profile",
      "Content": "Jan 25, 2012 11:44AM - edited Jan 25, 2012 11:45AM by Honeypotpie Thank you ladies SO VERY MUCH!!! This has been so hard and you are all are so strong! I have never been this scared in my whole life. I feel like I can't acquire enough knowledge about what is happening to me but it's causing me so much stress I'm developing tension migraines with fainting episodes because I have my shoulder hunched up so tight all the time. I definitely want to be the same size I am now. I've breast fed 4 babies so they're nothing pretty or special but they're mine. I want to be able to look in the mirror and accept myself. My chest is the only thing I ever liked about myself. I have some belly fat I could easily part with so that option may be fesible. Thank you ladies for all the really good advice. I go to my first support meeting tonight and I will continue to post on here too! God Bless",
      "MessageIndex": 8,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781465",
      "Title": "Double Mastectomy, will I get 38D's back? Honeypotpie vicky3blum"
    }
  ]
}