{
  "AuthorID": "hopebringsc…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258663/profile",
  "Posts": [
    {
      "AuthorID": "hopebringsc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258663/profile",
      "Content": "Sep 4, 2017 12:46PM hopebringscourage wrote: Hi Beach-I too have the same tightness in my left armpit where I had the SNB. It feels numb/to me looks swollen-my drain was removed Thursday and I am almost 2 weeks post surgery. I also think I have not been resting enough and maybe using it more than I should. I can raise it all the way straight up-it's all just very odd feeling and I try not to worry. I have been doing a few exercise. Just decided today that I am going to stay in bed ALL day. So here I am. Good luck to all of you!!",
      "MessageIndex": 5,
      "PostDate": "04/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/858151",
      "Title": "Pain more in one arm/armpit after mastectomy with SNB? beach2beach beach2beach"
    },
    {
      "AuthorID": "hopebringsc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258663/profile",
      "Content": "Nov 1, 2017 05:21AM hopebringscourage wrote: I started in September and am happy to support you all in any way possible:) I just finished round 3 of 6 last week- trust me the way you feel is normal. If you have questions fire away!😁 Having a positive outlook goes a long way and making sure you get good solid sleep at night is, so important for healing and overall health!",
      "MessageIndex": 3,
      "PostDate": "01/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "hopebringsc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258663/profile",
      "Content": "Nov 1, 2017 09:47PM - edited Nov 1, 2017 09:49PM by hopebringscourage Tips: Things you should have handy post chemo. Tums, Pepto, Imodium (take 2 Imodium with first loose stool. Don't wait to see if you have it again - you likely will😁 Tylenol/Ibuorofen (for bone pain caused by the Neulesta) this to me felt like flu aches ×50. Getting up and moving actually helps with this and fatigue - try to walk trust me I know it's difficult. Super hydrating lotion for face and body-I was using my night moisturizer during the AM too! Biotene mouthwash and toothpaste Salt/ baking soda rinse (for mouth sores) use severel tines each day. Ginger beer or ginger root work well for nausea. I ended up using Ativan/Compazine combo x3 days every 6 hours after treatment. Buy hat's or scarves before you loose your hair its much more enjoyable. My friends had a party for me everyone brought one as a gift. Headcovers.com is an awesome site. Rest.. rest.. rest!! And learn to say no. It wil catch up to you if you don't and you will become so fatigued. After your 1st treatment some of the anxiety disappeared its the unknown that was scary for me. Push as much water before and after chemo we need to stay hydrated and it also helps with the nausea. No matter how sick I felt for some reason could always drink water! jello and popscicles count too! Well that was a bunch of informatiom! YOU GOT THIS!!! There is a rainbow waiting for all of us💖🌈 I forgot I have been icing my hands and feet along with chewing ice during Taxotere to help prevent neuropathy. So far no signs or symptoms! ",
      "MessageIndex": 8,
      "PostDate": "01/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "hopebringsc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258663/profile",
      "Content": "Nov 2, 2017 09:20PM - edited Nov 2, 2017 09:21PM by hopebringscourage YES YES!! I forgot about Claritin. I took this the day before chemo and for the next 5 days. Everyone has different SE but I will share my experience. Within 27 hours of my first treatment I was SICK-nausea, stomach pain, bone aches beyond anything EVER. I lost 9 pounds in 11 days and didn't know how I would survive another round. BUT then slowly I felt better and had about 5 good days before round 2. So gping y into round 2 I was MYSELF. I had switched my eating to mostly clean (I was eating anything that would only last less than 14 days in my kitchen) I started this just prior to round 1. Round 2 was polar opposite- the only thing different I did was take compazine and ativan together every 6 hours for 72 hours. The nausea was my worst SE from round 1 and they use Ativan for nausea. I only had 2 days that round my tummy felt squirerly- but SO tolerable. Really no bone pain and I took Claritin the same as round 1. I just completed round 3 a week ago did most everything the same nausea was tolerable for 7 days soI far (feels liike tolerable morning sickness) more bone pain than round 2 BUT I wasn't faithful with the Claritin but round 1 was the worst. Also feeling a bit more fatigued but this is draining. All and all it could have been much worse. I'm so thankful every time was not like round 1😁 My treatments are every 3 weeks for 6 rounds Truthfully I only used the the salt swish 1st round and switched to Biotene with the nausea swishing that mixture all day wanted to make me vomit. I have had more trouble with tastes and my tongue feels like a half healed \"burned tongue\" everything I eat tastes so spicy even the most bland salad.  TMI??? LOL LOL🤣",
      "MessageIndex": 13,
      "PostDate": "02/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    }
  ]
}