{
  "AuthorID": "Hope419",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241842/profile",
  "Posts": [
    {
      "AuthorID": "Hope419",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241842/profile",
      "Content": "Nov 2, 2016 01:09PM Hope419 wrote: @seq24 - thanks for the welcome! Okay, so I wouldn't say it started growing in over the course of the 12 weeks, maybe a little fuzz? But it did start to grow quickly in the month & a half break I had for lumpectomy. Now losing it again, but not all yet. I'd say, keep expectations low about hair growth during Taxol, and then if it does, yay! My first 2 AC's were bad. I think I was carrying an infection that lingered, and really busted out after dose 2, landing me in the hospital, neuropenic. I'm hoping my 4th isn't my worst because that would be REALLY bad. Taxol, for me, was just a slew of annoyances. While with AC I feel like crap overall, Taxol was more like, Oh, constant dry bloody nose, annoying! Oh, I can't buckle my seatbelt because I have nail pain, annoying! Mouth sores, nail discoloration, etc. That kind of thing. I didn't have fatigue until the end. I worked out through week 10. Neuropathy is just luck of the draw, I think, take B complex and report anything right away. Perks of taxol: no Neulasta/bone pain, nausea isn't nearly as bad. One thing that kept scaring me, but that my onc told me was normal with these taxanes, was sensitivity to light, especially when driving, or coming into a bright room. I was paranoid and thought I had something wrong with my brain. But the taxanes cause this sensitivity to your nerves, etc. So it's normal. Good luck, and let me just say I wish I had my chemos in your order, AC first, then Taxol! @lmencken: thanks for your kind words, sending positive vibes your way! ",
      "MessageIndex": 1154,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Hope419",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241842/profile",
      "Content": "Nov 1, 2016 02:56PM Hope419 wrote: Hello, I am a newbie (but a lurker) for many months. I waited want to thank everyone for their candor on here. I've found a lot helpful. I started AC on September 30. Question: I have 1 treatment of AC left. I seem to have an atypical regimen - I did neoadjuvent 12 weeklyTaxol (May - August), then lumpectomy, and now adjuvent DD AC. Has anyone else done it in that order? Wondering when, after the last chemo, I will start to feel somewhat normal. AC has been a hard road so far (bone pain, got an infection and landed in hospital), but dose 3 so far has been the \"best.\" To offer my own 2 cents: for people having Taxol AFTER AC - there is light! It's so much more mild. At least it was for me. Some neuropathy towards end, but it has largely gone away. Took B12 complex which helped. PS: tell your docs straightaway if you feel numbness in your face! They got very scared for me and delayed my last dose. But good news, it went away:) More background: I'm 31 and my mother also currentlysuffers from BC, Stage IV (for 5 years, recurrence). It's been hard \"relating\" to her, as awful as that sounds. I much prefer these boards.",
      "MessageIndex": 1148,
      "PostDate": "01/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    }
  ]
}