{
  "AuthorID": "hope_faith_…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72777/profile",
  "Posts": [
    {
      "AuthorID": "hope_faith_…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72777/profile",
      "Content": "Feb 20, 2009 08:18PM hope_faith_love_2008 wrote: 27, a day before valentines day, 2/13/2008, no mammo ever, found a lump, it was benign, they found cancer while looking at the lump.",
      "MessageIndex": 116,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "hope_faith_…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72777/profile",
      "Content": "Feb 21, 2009 12:06PM hope_faith_love_2008 wrote: She is lucky to have such a supportive sister! Be there for her, like shockedat39 says, be supportive when shes feeling good, commiserate when she's down! The worst is when people don't say anything because they don't know what to say. If she doesn't feel like talking about it, know that she probably still just wants to talk and chat about anything other than everything she is going through. My mom would just know when I didn't feel like talking about \"it\" and we would chat for an hour about the Grand Canyon or puppies or whatever. It felt good to have someone act like all was \"normal\" even though we knew it wasn't.  My best friends came by and took me out to lunch when I was feeling really bad after surgery. They had me put on sweats and a flannel shirt and off to Steak 'N Shake we went! They made me feel like I was pretty and looked great (even though I knew I didn't) and just treated me like nothing was up and took me out into the sunshine for an hour or so. It makes all the difference! If you are able, make some dinners to put in the fridge and do laundry now and then if she'll let you. Its the little things we just can't get done when we are at our worst; and I didn't want to ask for help. To just have someone do it for me, no asking, no thanks requested, meant so much.",
      "MessageIndex": 5,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729335",
      "Title": "How do I help my sister??? wanting_to_help wanting_to_help"
    }
  ]
}