{
  "AuthorID": "HopeForBest",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
  "Posts": [
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Nov 30, 2008 05:29AM HopeForBest wrote: Dear All, It is amazing how this BC brings us together. It is a tough situation for all of us and hope GOD will give us patience and resistance against all these chemos and the power to defeat this disease. I had my BLT Mast on 17 Nov. My surgeon said I  had Grade 3 Cancer bigger than 5 cm. He believes I should get chemo and rad. I have an appointment with my Oncologist on 6 Dec. I do not know anything about my HER2, Oncotype test etc. I believe my Oncologist is gone tell me. I am worried about everything. Especially not knowing what is gone happen. I wanted to put Port already. How long the surgery for port take. I believe it is easier to have it. Anyway, so many things to worry. All the best to ALL and will check on you. Hope",
      "MessageIndex": 83,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Nov 27, 2008 04:34PM HopeForBest wrote: Thanks Queen for your response. We know that we need to be patient but it is hard when it comes to treatment which can save your life. When are you starting chemo? I also had Grade 3 and feel that my oncologist would say I should get one too. Are you having radiation too? My surgeon said he thinks that I should get both. Anyway, I will know exactly on Dec. 6. Happy Thanksgiving to you too.",
      "MessageIndex": 87,
      "PostDate": "27/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/723462",
      "Title": "Surgery's over, Now what? Firni lktracey"
    },
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Nov 28, 2008 02:27AM HopeForBest wrote: Dear Carie, Thanks again for the explaniation. I think we have a similar case. I believe, my oncologist has  requested the test. He is quite respected person with excellent reputation in his field. For now, I just have to wait counting the days. I wish you also best of luck on the treatment and the reconstruction. I would love to hear from you more on both and would be happy to communicate privately. All the best, Hope",
      "MessageIndex": 90,
      "PostDate": "28/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/723462",
      "Title": "Surgery's over, Now what? Firni lktracey"
    },
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Nov 23, 2008 06:04PM HopeForBest wrote: Hello Sisters, Am back from the scary surgery yesterday. I had BLT on 17 November.  I am doing OK. Now, waiting for the next steps. My Surgeon said we have to wait for the pthelogy report to send me to the encologist. I feel, I just want to start the next treatment immidiately. I don't want to give any time to this devil. Especially now after loosing my two... I wish to know how long it took you to drive. I need to drive to see the Physical Therapist and hestitating to start drivivng this week???  Thanks and regards,  Hope",
      "MessageIndex": 74,
      "PostDate": "23/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/723462",
      "Title": "Surgery's over, Now what? Firni lktracey"
    },
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Nov 27, 2008 04:13PM HopeForBest wrote: Hello Ladies, I want to share with my friendsabout my day. Am 10 days post BLT Mast and started to drive around. It is amazing how fast we can adapt with things we thought impossible. I am getting used to myself with out breasts. I still have mild pain. The skin they left on both sides is bothering too. I have appointment with my Onc on 6 December. The path report i received from my surgeon says it is OK. Sentinels both sides are negatif, margins clear. But the cancer they removed is quite big. Am not sure about HER2. I will know more from my oncologist. But I wish I could know whether chemo is in for me or not. Is it the HER2 which identifies about this. Am not sure whome to ask before my appointment on 6 Dec. With best wishes to All. Hope to hear from you. Hope",
      "MessageIndex": 85,
      "PostDate": "27/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/723462",
      "Title": "Surgery's over, Now what? Firni lktracey"
    },
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Nov 27, 2008 04:36PM HopeForBest wrote: Oh, I left this out. What is oncotype test? Who does it? How long will it take? Best regards. Hope ",
      "MessageIndex": 88,
      "PostDate": "27/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/723462",
      "Title": "Surgery's over, Now what? Firni lktracey"
    },
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Nov 16, 2008 11:41AM HopeForBest wrote: Thanks Betty, I am crying a lot. When anyone asks how am doing, I cry . when I read your post, I cry. I thought am storong and prepared. But now when the time approches am freaking out... Hope",
      "MessageIndex": 12,
      "PostDate": "16/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724226",
      "Title": "Bilat Mast, Chemo, Rad HopeForBest HopeForBest"
    },
    {
      "AuthorID": "HopeForBest",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "HopeForBest wrote: Hello everyone, It is so calming to read your posts here. I am a candidate for bilateral mastescomy for next Monday, 17 November. I just had biopsy of both breasts. Initially, I was told LICS on the riht and on the left was some lump non cancerous. After the biopsy am told now both breasts have cancer invasive, group 3 and I have to do biletral. My surgeon said I will need also chemo and rad too. I feel so terriable. I can not imagine how I should go through this. Am scared...Appreciate any advice, feedback etc. PS: Am single mom of two young children . Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724226",
      "Title": "Bilat Mast, Chemo, Rad HopeForBest HopeForBest"
    },
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Nov 24, 2008 02:26AM HopeForBest wrote: Hello Ladies, Thanks for your feedback. For sure, this whole BC teaches you patience and more patience and optimisim. I hope everybody here is recovering well. Let's keep on doing the best we can for us. Regards, Hope",
      "MessageIndex": 78,
      "PostDate": "24/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/723462",
      "Title": "Surgery's over, Now what? Firni lktracey"
    },
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Nov 12, 2008 04:54PM HopeForBest wrote: Dear Friends, Thanks for your encouragement. I am trying to play storng. Then start crying loud, specially after sending my kids to school. It is realy tough to prepare oneself. I also read a lot about chemo, and found out about port. My doctor has not mentioned. I am thinking to ask him to do the port at the time of BALM. I then get confussed. When is it decded whether to have port or not ? Thanks for any feedback.",
      "MessageIndex": 4,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724226",
      "Title": "Bilat Mast, Chemo, Rad HopeForBest HopeForBest"
    },
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Nov 14, 2008 01:37PM HopeForBest wrote: Thanks a lot Pam. It realy helps to hear from sisters in the same shoes. Did you have already mast. When was it? How did you cope at the beginnin? It is really the hardest situation to be in. With help of GOD we shall All servive! HUGS, Hope",
      "MessageIndex": 8,
      "PostDate": "14/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724226",
      "Title": "Bilat Mast, Chemo, Rad HopeForBest HopeForBest"
    },
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Nov 29, 2008 04:53PM HopeForBest wrote: Hello WNYnurse, Thanks for your message. In the meantime, I got the path report. My surgeon said All is OK now. He made an appointment with oncologist for me for next week. The oncologist is the one then who will decide what next.. Am just hopping for the Best. BEST WISHES, HUGS and LOVE to All here.",
      "MessageIndex": 15,
      "PostDate": "29/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724226",
      "Title": "Bilat Mast, Chemo, Rad HopeForBest HopeForBest"
    },
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Jun 16, 2009 02:39AM HopeForBest wrote: Hello Sisters, Hope All is well with you. It has been long time since I came to this link, now reading your messages reminded me how grateful I am of your support. Thanks again. It has been over six months since my bilateral mast. I was given only Tamoxifin. GOD is Great! I seem to be OK and am thinking of reconstruction in NOLA. That is my situation. Hope to hear rom you. With best regards, Hope ",
      "MessageIndex": 16,
      "PostDate": "16/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724226",
      "Title": "Bilat Mast, Chemo, Rad HopeForBest HopeForBest"
    },
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Nov 23, 2008 05:20PM HopeForBest wrote: Hello Sisters, Am back from the scary surgery. I had BLT on 17 November. Am back home yesterday. I am doing OK. Now, waiting for the next steps. My Surgeon said we have to wait for the pthelogy report to send me to the encologist. I feel, I just want to start the next treatment immidiately. I don't want to give any time to this devil. Especially now after loosing my two...  Thanks for your prayers and encouragement.  Hope",
      "MessageIndex": 13,
      "PostDate": "23/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724226",
      "Title": "Bilat Mast, Chemo, Rad HopeForBest HopeForBest"
    },
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Nov 13, 2008 04:31PM HopeForBest wrote: Hello Emily, I asked my surgeon/gynachologist today abot the port. He said they are not sure what type of chemo I would be administered until after the pathelogy result. So he is not placing the port now. I am getting a bit unpatient to have the surgery done. What is the difference between the Grades and Stages? I was told I have Grade 3 cancer.",
      "MessageIndex": 6,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724226",
      "Title": "Bilat Mast, Chemo, Rad HopeForBest HopeForBest"
    },
    {
      "AuthorID": "HopeForBest…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74772/profile",
      "Content": "Nov 16, 2008 09:53AM HopeForBest wrote: Dear Pam and other sisters, I am going to have my bilat in less than 24 hours. As time approches my emotions are so terrible. I have been crying for hours closing my doors. now, am preparing to drop the kids at my friends house. I think, if it was not for my kids I would not go through this. It is like going voulentarily to slice yourself. I wish to see what would happen if I do not go through this. How long one could live with it? I know I have to go but I am finding it very very diffcult. HUGS, Hope",
      "MessageIndex": 10,
      "PostDate": "16/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724226",
      "Title": "Bilat Mast, Chemo, Rad HopeForBest HopeForBest"
    }
  ]
}