{
  "AuthorID": "hopeful1025",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
  "Posts": [
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 22, 2017 06:55AM hopeful1025 wrote: You will be in my prayers!",
      "MessageIndex": 16,
      "PostDate": "22/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852760",
      "Title": "Lump 3yrs,dimpling,2clear mamo 2clear us Csly Csly"
    },
    {
      "AuthorID": "hopeful1025",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "hopeful1025 wrote: Hello all, I know there are probably tons of post that might read similar to mine, but here goes... I am 35 years old and I have never had any issues with lumps in my breasts before. Last week, I noticed a small red bump on the under right side of my right breast. Like a crazy woman, I dismissed it as a bug bite and continued to get dressed. Crazy, I know... Last night, I was taking off my clothes and felt the bump again. This time it caught my attention. It feels like it has gotten bigger and has a bruised look to it. Well, you all already know what I did next... Yep! I went on Google and scared myself out of an entire night's sleep and into the urgent care first thing this morning for fear of having IBC. I saw a NP who quickly looked at it and said, \"oh, that is just a skin abscess.\" Huh?! I told her that I was concerned about the potential of BC; IBC, in particular and that I have a history of cancer in my family (my mother passed from colon cancer when I was 15). She slowed down and explained to me that she thought it was an abscess/boil or a minor skin infection because of its appearance and because it was not attached to the breast tissue. It is located on the surface of the breast. She also said that she felt it was an abscess because of the perfectly round shape. However, there is no pain and I never remember feeling pain. I thought boils/abscess' are supposed to be painful...? I read that BC can also appear on the surface of the breast and does not also present itself attached to the breast tissue. She offered to see if she could drain any fluid from the \"abscess\" but said she might not be able to, as it is not that large and has not come to a head. I asked her to try anyway. She was unable to drain any puss from the lump. Only a little blood came out. She prescribed me 10 days of antibiotics and told me to use a warm compress over the next 10 days. She also suggested that I follow up with my GP tomorrow to schedule an appointment to make sure that it is healing as it should, which of course, I will. I am petrified that this lady was rushing and has no idea what she was talking about, as she did not perform an ultrasound - only a breast exam. So, I am wondering if anyone else has had a similar experience? I am literally on pins and needles!! I CANNOT wait to make my appointment tomorrow!!! Thoughts? Suggestions?? Thank you in advance! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 19, 2017 11:47PM hopeful1025 wrote: Hi Hopeful! Thanks for your suggestion. I am definitely going to ask for a mammogram referral. In fact, since I have a PPO, I was thinking about scheduling an appointment with a specialist tomorrow instead. That way I can go straight to the cancer center. At the very least, they could do an ultrasound this week and perhaps schedule the mammogram for next week, if they are busy. I suppose I will just have to wait and see what they say. But yea... I was contemplating going straight to the horses mouth (so to speak). I am BEYOND anxious!",
      "MessageIndex": 4,
      "PostDate": "19/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 20, 2017 08:58AM - edited Feb 20, 2017 09:00AM by hopeful1025 Antibiotics for abscess: Day 2 Whelp. I made my appointment with my GP. The earliest I can get in is March 2. The nurse said that is probably best because it will allow the antibiotics (10 day) prescription to work, if this is in fact an abscess. BUT there is a healthcare facility that I have gone to a few times on the campus where I teach, and they provide quality services. I might make a tiny little appointment in the meantime as a second opinion to this abscess diagnosis because I know they will be able to get me in over the next few days. They are closed today for President's Day, but I might call tomorrow morning and see what they have available in the coming days. ....and so the waiting game officially begins. I keep looking at my breast. I am not sure why... Even if it is an abscess, (fingers crossed and prayers up!) I don't think there would be a noticeable difference by now. UGH!",
      "MessageIndex": 7,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 20, 2017 04:03PM hopeful1025 wrote: Sjacobs146, yes it's not progressing that quickly by any means. It pretty much looks the same today as it did Saturday night. The only reason IBC came to mind is because of the bruised/reddish appearance of the lump... If it an abscess or fat necrosis, it makes sense to have the discoloration (I think...).  ",
      "MessageIndex": 12,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 20, 2017 07:40PM hopeful1025 wrote: Luckynumber47, thanks! Yes... As you know, it's all very scary.",
      "MessageIndex": 14,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 21, 2017 04:25PM hopeful1025 wrote: Here I go thinking again.... :-/ But it seems like many of the women who have found benign tumors in their breast, at some point, end up getting diagnosed with bc. Maybe not in the same breast... It could be the opposite breast. But it feels like many end up with the diagnosis, even if it's 10 years down the road. What are your thoughts? I realize I could be rushing to judgement and overly dramatic right now.",
      "MessageIndex": 19,
      "PostDate": "21/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 22, 2017 05:31PM hopeful1025 wrote: Thank you, MTwoman!!",
      "MessageIndex": 28,
      "PostDate": "22/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 22, 2017 10:44PM hopeful1025 wrote: My mother has been the only person with a colon cancer diagnosis and no breast cancer on either side of my family surprisingly. Well one cousin by marriage was diagnosed with bc about 15 years ago, but again that is through marriage. But maybe I should look further into genetic testing",
      "MessageIndex": 30,
      "PostDate": "22/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Mar 2, 2017 12:27PM hopeful1025 wrote: Thank you, ladies! Yes, I suppose I'm getting ahead of myself. I appreciate my physician's thouroughness and caution. I just hate this! But I know I'm preaching to the choir. We all know how miserable this is. I was able to schedule an appointment for a mammogram on Wednesday (3/8) morning. What were your experiences in terms the wait game for mammogram results?",
      "MessageIndex": 41,
      "PostDate": "02/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Mar 2, 2017 01:51PM hopeful1025 wrote: Thanks ChiSandy, that's good news! At least I'll have an idea of what's going on by Wednesday.",
      "MessageIndex": 43,
      "PostDate": "02/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 20, 2017 08:15PM hopeful1025 wrote: Awww, MinusTwo. I just read your response and it made me smile. Thank you. Thank you so much!",
      "MessageIndex": 17,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 22, 2017 03:07PM hopeful1025 wrote: MTwoman - That makes sense. Although I do feel better, I suppose at the end of the day, I want to be sure. So much can go wrong when only the naked eye is being used. You are right. I am going to discuss with my GP about my options on how I can go about confirming what exactly this is more definitively.",
      "MessageIndex": 26,
      "PostDate": "22/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 23, 2017 04:43PM hopeful1025 wrote: Thanks ChiSandy! MTwoman, based on the info you provided, I would not be eligible for testing to be covered, as my mother had colon cancer. But I am going to look into what my insurance covers, if anything at all. I am also going to discuss further with my GP.",
      "MessageIndex": 35,
      "PostDate": "23/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Mar 2, 2017 10:43AM hopeful1025 wrote: I saw my GP today. Hmmm... After the exam, he recommended a diagnostic mammogram be done, which I was going to request anyway. But I am a little scared. He knew that I have been told previously that the the lump is a skin lesion twice. He did not say \"oh yea, it looks like a skin lesion but let's get a diagnostic mamm to be on the safe side.\" Nor did he say, \"hmmm.... no I don't think that's what it is, so I am recommending a mamm\" It was not until after I started asking him questions about his opinion on the whole skin lesion theory, that he said it is a possibility. He said that it is on the skin's surface, so it could be a skin lesion but it could also be intraductal papiloma, which he said also presents with slight bruising and can appear either on the skin's surface or attached to the breast tissue. I understand that the only way to know FOR SURE is to get a mamm, which is why I was going to request one in spite of the OB NP being so confident that it is skin lesion/abscess. I don't know... Maybe, it's because he suggested it before I could, is concerning. I know that he wants to be sure and that he more than likely would not want to be overly confident in proclaiming any informal diagnosis one way or the other at this point. But... I don't know... I guess it just boils down - to it's still unknown and it's still scary. I am waiting for a call from the breast center to schedule my mamm. But I might call them toward the end of the day to expedite the process. So, that's my story for today. That's all I got.",
      "MessageIndex": 38,
      "PostDate": "02/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 20, 2017 12:04AM hopeful1025 wrote: MinusTwo, you're right. I suppose I Just hate to think about possibly wasting time... But seeing my GP is not a waste of time. I guess I need to calm down a bit... ",
      "MessageIndex": 6,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 21, 2017 04:52PM hopeful1025 wrote: MTwoman, that makes perfect sense! Gosh, I truly admire all of you who are kicking cancer's ass!! This is awful, but the strength I've observed on the forum, make it look like a cake walk, which I know is FAR from the truth. Which is a further testament to you all's strength. And yes, I'm very happy I will be able to see the OB tomorrow. Although I know that will not be the end of my waiting, I will hopefully get a little more clarity.",
      "MessageIndex": 22,
      "PostDate": "21/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 22, 2017 12:01PM hopeful1025 wrote: Had my appointment this morning. I met with the OB NP and she was certain that this is a skin abscess. She kept repeating that this is a skin issue that happens to be on the breast. She explained that it is on the actual skin and not in the breast. She gave me a breast exam and said she did not feel anything. She said that she does not feel I should get a mammogram but strongly advised that I schedule a colonoscopy within the next 3 months because of my family history with colon cancer. My mother passed from colon cancer when she was 47. Anywho, she basically said the same thing that the NP at urgent care said; however, I do feel more confident with her assessment, as I know and trust her. That said, I still have my appointment with my GP for next Thursday and I will request a mammogram even if he does not think it is necessary. Just to be on the safe side. I am feeling a little more at ease, but without a mammogram it's hard to take a complete sigh of relief. ",
      "MessageIndex": 24,
      "PostDate": "22/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "hopeful1025 wrote: Hello all, I know there are probably tons of post that might read similar to mine, but here goes... I am 35 years old and I have never had any issues with lumps in my breasts before. Last week, I noticed a small red bump on the under right side of my right breast. Like a crazy woman, I dismissed it as a bug bite and continued to get dressed. Crazy, I know... Last night, I was taking off my clothes and felt the bump again. This time it caught my attention. It feels like it has gotten bigger and has a bruised look to it. Well, you all already know what I did next... Yep! I went on Google and scared myself out of an entire night's sleep and into the urgent care first thing this morning for fear of having IBC. I saw a NP who quickly looked at it and said, \"oh, that is just a skin abscess.\" Huh?! I told her that I was concerned about the potential of BC; IBC, in particular and that I have a history of cancer in my family (my mother passed from colon cancer when I was 15). She slowed down and explained to me that she thought it was an abscess/boil or a minor skin infection because of its appearance and because it was not attached to the breast tissue. It is located on the surface of the breast. She also said that she felt it was an abscess because of the perfectly round shape. However, there is no pain and I never remember feeling pain. I thought boils/abscess' are supposed to be painful...? I read that BC can also appear on the surface of the breast and does not also present itself attached to the breast tissue. She offered to see if she could drain any fluid from the \"abscess\" but said she might not be able to, as it is not that large and has not come to a head. I asked her to try anyway. She was unable to drain any puss from the lump. Only a little blood came out. She prescribed me 10 days of antibiotics and told me to use a warm compress over the next 10 days. She also suggested that I follow up with my GP tomorrow to schedule an appointment to make sure that it is healing as it should, which of course, I will. I am petrified that this lady was rushing and has no idea what she was talking about, as she did not perform an ultrasound - only a breast exam. So, I am wondering if anyone else has had a similar experience? I am literally on pins and needles!! I CANNOT wait to make my appointment tomorrow!!! Thoughts? Suggestions?? Thank you in advance! Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "19/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Mar 4, 2017 09:02AM hopeful1025 wrote: Thank you, Lotusconnie! After reading your response I decided to look at exactly how far the lump is from my nipple. I had not really been monitoring it recently because I have been trying to distract myself. I noticed two things. It's about 2.5-3 inches from my nipple on the under side of my breast. It is located almost right between my nipple and the very bottom on my breast where the underwire in my bra would hit. Also, the lump itself is smaller. I remember when I first discovered it 2 weeks ago, I was able somewhat feel it in between my fingers. I could almost pinch it. But now it is much flatter and I can no longer pinch it. It does; however, still have what looks like a bruised appearance. But now that I am looking at it, I think it's turning more into skin discoloration now and not necessarily a bruise. I am black with somewhat fair complexion and it's looks like it is becoming discolored similar to how an awful facial blemish or pimple might discolor my skin after it has been picked at and it has healed. I'm not sure if these are good or bad signs. Ha! Either way, I am hanging in there and thankful that my GP was on board to order the mamm. Especially, a diagnostic mamm so I can get the results immediately (he mentioned that during my appointment also). Thank you again for your support!",
      "MessageIndex": 45,
      "PostDate": "04/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 19, 2017 11:26PM hopeful1025 wrote: MinusTwo, thank you for your response! Yes, I will stay off of Google and try to keep myself busy. The NP did give some good advice. I just hate that that she was so rushed at the start. It causes me to doubt some of what she has said in terms of it appearing as an abscess, etc. But only time and a visit to my GP will tell I suppose. UGH! This is incredibly terrifying. ",
      "MessageIndex": 2,
      "PostDate": "19/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 21, 2017 05:00PM hopeful1025 wrote: MinusTwo, yes.... lol!! I'm getting ahead of myself. I need to slooooooow all the way down. So many good points. Thank you for helping to put things into perspective.",
      "MessageIndex": 23,
      "PostDate": "21/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Mar 8, 2017 10:00PM hopeful1025 wrote: Thank you MinusTwo and Lotusconnie. I just wanted to give an update. I had my diagnostic mammogram and an ultrasound today. The radiologist said that I am in the clear and what I have appears to be in fact be an abscess. They did find an area (at the 10 o'clock position of my breast) but that turned out to be excess breast tissue. They told me that I should get a follow-up mamm once I turn 40. Whew! Now, onto schedule my colonoscopy.  ",
      "MessageIndex": 48,
      "PostDate": "08/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 20, 2017 09:30AM hopeful1025 wrote: Does anyone know anything about fat necrosis? I have been searching the site to refrain from visiting our best friend Dr. Google (lol), but can't find any info. I just had a light bulb moment. About two weeks ago, my significant other and I were playing around and he kinda pinched me on my right breast. **Sorry, I know this might be TMI** I remember it stinging and saying to him, \"that hurt!\" and I hit his arm. It stung a little but the sensation went away after a few minutes and I did not think about it again... Shortly after that incident is when I discovered the initial red bump in the mirror that is now bruised. Hmmm... I could be over thinking this. I know that fat necrosis is caused by damage to fatty tissue, but I am not sure how strong the impact has to be. A firm pinch that stung a few minutes might not qualify....",
      "MessageIndex": 8,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 20, 2017 03:20PM hopeful1025 wrote: Thanks for your response Luckynumber47! By any chance, do you remember what hers looked like?",
      "MessageIndex": 10,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 20, 2017 07:56PM hopeful1025 wrote: Just getting back from dinner with a group of co-workers; one of which was diagnosed with stage 3 bc in 2009. I spoke with her about my situation. She was very reassuring but also encouraged me to (if possible) not wait until my GP is available on March 2 and try to get in to see a OBGYN at the wellness center on our campus. She highly recommended him and said that I should not wait, if I can help it. Tomorrow I literally have a packed day at another another school from 8:30-3:40, but I will do what I have to do to schedule an appointment to see the OB tomorrow or Wednesday. Preferably tomorrow... This is such a powerless feeling...",
      "MessageIndex": 15,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 21, 2017 12:52PM hopeful1025 wrote: Update: I was able to make an appointment with the OB for tomorrow at 8:45am! I can't wait!! I'm on pins and needles. Today is my third day talking antibiotics as prescribed and the lump still has the same bruised appearance... So, we shall see.",
      "MessageIndex": 18,
      "PostDate": "21/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 23, 2017 01:12PM hopeful1025 wrote: Hmmm.... If genetic counseling/testing is not covered by insurance, it looks like it can be pretty costly. LORD! I am not sure of my mother's predisposition to colon cancer or if he had anything genetic that could be passed down. She passed when I was 15, so I have no idea. Hmmm....",
      "MessageIndex": 32,
      "PostDate": "23/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "hopeful1025…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247362/profile",
      "Content": "Feb 28, 2017 07:38PM hopeful1025 wrote: M1958, thank you! My appointment with my GP is on Thursday. I plan to get one last opinion and hopefully a US for the lump AND ask him to order a colonoscopy ASAP. I am not at all taking for granted anything at this point! I have, however, noticed a slight change in the lump. Almost as though it is healing. So, perhaps it is some sort of skin abscess. Either way, I'll be seeing my GP on Thursday and hopefully I will receive final peace of mind about the lump and start the process of scheduling my colonoscopy. Thank you again for sharing your story!",
      "MessageIndex": 37,
      "PostDate": "28/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    }
  ]
}