{
  "AuthorID": "hopejess",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103689/profile",
  "Posts": [
    {
      "AuthorID": "hopejess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103689/profile",
      "Content": "hopejess wrote: This Post was deleted by hopejess. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754168",
      "Title": "mri for lump...scared pls read hopejess hopejess"
    },
    {
      "AuthorID": "hopejess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103689/profile",
      "Content": "hopejess wrote: I am new here. I found a lump around jan of this year. Didnt think too much about it. I am 31. (never been pregnant) A friend of a friend who is a dr touched it almost a month ago (after I asked him too) and said I should be concerned because it may be cancer. I asked him why and he said location, very hard and attatched to my chest wall. I kinda freeked. My mom was diagnosed at 46 stage 3, her mother had it in both breasts(my gma) and my gma sister as well as her daughter (my moms cousin) both died of it in their 40s and 50s. (hope that made since). I had my first mammo and ultrasound May 27. Birad 0- very dense breast and I have implants. They could not detect the lump. I was then sent to a breast surgeon who did not feel it was suspisious and thought it was scar tissue due to my breast implants. I asked him if he thought it was attatched to my chest wall and he said yes. He suggested due to my family history if i was concerned either excisional biopsy where he told me my implant may rupture and he didnt think it was necisary or mri.  I chose mri. Dont know if Im making the right decision. Just curious if anyone has any comments suggestions or advice because I am still very concerned but do to not want to stress out my loved ones anymore. Help...pls:) I realy dont know how you woman do this. This month has been hell. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754172",
      "Title": "mri or excisional biopsy hopejess hopejess"
    },
    {
      "AuthorID": "hopejess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103689/profile",
      "Content": "Jul 5, 2010 06:21PM hopejess wrote: I am good! I got a Birad 2. The lump didnt show up but it said \"there are prominent vessels in the right axillary region. Benign apppearing lymph node with fatty hilium is also noted. The left axilla is unremarkable.\" I guess this is all good news. I just wish it could have given me a more definite answer of what the lump is. It still concerns me that the 'prominent vessels\" are on the side where the lump is. My surgeon said hes pretty sure its scar tissue and to come back in a year. Any thoghts? Thanks for asking:)",
      "MessageIndex": 5,
      "PostDate": "05/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754172",
      "Title": "mri or excisional biopsy hopejess hopejess"
    },
    {
      "AuthorID": "hopejess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103689/profile",
      "Content": "Jun 24, 2010 05:28PM hopejess wrote: Thanks for your replies. I decided on the MRI and had it done yesterday. I get the results on tuesday(29th). Very stressed right now but hoping for the best. This will be a long weekend.",
      "MessageIndex": 3,
      "PostDate": "24/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754172",
      "Title": "mri or excisional biopsy hopejess hopejess"
    },
    {
      "AuthorID": "hopejess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103689/profile",
      "Content": "hopejess wrote: I have had a lump in my right breast since around January. 3 doctors have confirmed it physically but it hasn't shown up on any tests. I got a birad 0 on my mammo and ultrasound due to dense brests as well as implants. I got my mri results back on tues. Birad 2. The lump didnt show up but it said \"there are prominent vessels in the right axillary region. Benign apppearing lymph node with fatty hilium is also noted. The left axilla is unremarkable.\" My breast surgeon thinks its scar tissue from breast implants (dec 08) and said to come back in a year. Does anyone know what these things mean and if should still be concerned? I feel a lot better but I am still confused as to why. if it is scar tissue, it doesnt show up as that. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754841",
      "Title": "lump that doesnt show up on tests hopejess hopejess"
    },
    {
      "AuthorID": "hopejess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103689/profile",
      "Content": "Jul 2, 2010 07:52PM hopejess wrote: Thanks for your responses ladies! I do feel better after the results for the mri, I just wish they could have located it and said it was definitely scar tissue. Oh well, I will request another mri when i go back in a year. Thanks again:)",
      "MessageIndex": 4,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754841",
      "Title": "lump that doesnt show up on tests hopejess hopejess"
    }
  ]
}