{
  "AuthorID": "HopefulYogi…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
  "Posts": [
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Sep 19, 2016 01:35PM HopefulYogi wrote: thanks for the welcome and your input!❤️ Getting a lil anxiety reading about not only the chemo SE but also the compazine, steroid and neulasta SE! (I'm supposed to be getting the patch) Sam- your wife looks awesome- very natural! 💁🏻 Michelle- thank you! I have a family wedding to go to on my day 15. Really hoping my hair hangs in there til then! Haven't seen many of these people in years and most peopl still don't know my situation yet as its only 3wks since DX. Good luck to you on #2. Sharon- so sorry you had to miss your race.😟 Wondering myself how many of the things I am already committed to this fall that I will actually be able to go thru with. Just hate all the unknowns! Seq24- so sorry you are having such a hard time with depression and the anxiety of the hair loss. Scares me too, but I've had to kind of set my mind in that place that it is coming out sometime soon, no matter when- and there is absolutely nothing I can do about it. It is what it is no matter how much I hate the thought of it. So best to just get myself prepared and attempt to prepare my close friends and loved ones around for what to expect. Let them know how much it bothers you so hopefully they will be super supportive and sensitive to your feelings. ❤️ Ware- what a lucky girl! So sweet of your man! Leydi- I'm planning on getting a wig for sure, but definitely want to get some hats/scarves to wear also when not at work. I also hate the ears in/ears out thing. Looks weird either way on me- plus I have glasses that need to go behind my ears! Let us know if you find any good options. I'm still searching! Good luck to everyone receiving their treatment today and peace to those dealing with SEs. ~❤️",
      "MessageIndex": 599,
      "PostDate": "19/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Oct 4, 2016 02:09AM HopefulYogi wrote: chemo #1 day 4 hit me like a ton of bricks about 2pm at work. Neck and shoulders started aching, lost my voice, felt like I was out of my body/head, legs got weak and just wanted to flop on my bed. Which is exactly what I did at 4pm when I got home! Took a 90 min nap. I realize one thing is I definitely did not hydrate enough today. Is that why I Lost my voice tho? Does that happen to others? I definitely would describe it as chemo flu tho. Chills and all before I fell asleep. Feeling so bummed because the first few days went rather well. Hoping it's just one day and done of that! Stomach felt \"tender\" all day but none of those SE's today thankfully! But after reading what some of the other things you gals are going thru, I consider myself to be doing ok in the scheme of things. Hang in there!!",
      "MessageIndex": 858,
      "PostDate": "04/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Jan 28, 2017 01:49AM HopefulYogi wrote: seq24. Great news ! Congrats! Smilethrupain - I think your hair is looking great! I'm looking like a chia pet. Thin fine soft hair just sticking straight up and out ! Just finished up my 6th & final TCHP so hoping I won't be losing any more. My eyebrows and lashes thinned a bit but no too bad so far, thank goodness. The wigis going to stay for a while, the world is not yet ready for this head!",
      "MessageIndex": 1566,
      "PostDate": "28/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Oct 2, 2016 03:22AM - edited Oct 2, 2016 04:06AM by HopefulYogi Well, yesterday was my first chemo day. 7 hours & 9 bags of poison! Drank lots of water the day before,chemo day and today. Hoping that will help with SE.'s. Also drinking ginger/green tea with lemon to keep tummy calm. And started the tongue scraping, mouth rinsing routine. Salt & bk soda , switching up with a Mellaluca alcholfree mouth rinse for the minty freshness! ;) Was very tired after yesterday but still haven't gotten a good nights sleep in days. My Neulasta patch went off at 7 pm tonight with out a hitch or a leak! Was so worried I was gonna bang that sucker off on a doorway or something. I'm clumsy like that. Phew! Btw, my chemo nurse recommended Aleeve for Bone pain. Anyone have good response with that? (I'm already doing Clairitin Still feeling ok tonight(day2). Hope to get a better nights sleep, but had to take the last of the steroids today, so who knows! Been so stressed about the days ahead and what SE's are going to get me. Really don't want to miss work , but I realize I probably will at some point. :( Thanks to everyone sharing thier brave hair photos! You all look strong & beautiful! Nottheboss -- I say the same thing about the moustache & chin hairs! Lol Nayda-- I read that tea tree oil mixed with some coconut oil is used for that nail SE. Please check dilution rate and how often though. Angelaks--- how scary ! It was my first chemo today and they gave me benedryl, 2 nausea bags , Pepcid, and steroid before the Perjeta and HTC. Now I'm not sure if I will always get all that or just first time. Hmmmm Have a great rest of your weekend everyone! I think we may see the sun here in Jersey. Yay!~☀️",
      "MessageIndex": 817,
      "PostDate": "02/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Oct 2, 2016 02:49PM HopefulYogi wrote: beebs2704--- so sorry you have to deal with shingles along with everything else. The vaccine should hopefully help not let it get too severe. Definitely get on meds for it right away. When my mom got them, first time at age 79, they got on it quick and it never got as bad as I've seen in others. Good luck! I used Accupuncture in past years for back,hip,foot pain and had good relief. I was also considering it for any side effects if needed. I would love to hear if you or any one else on here has had good SE relief from Accupuncture. If nothing else , it a nice peaceful relaxing time out for yourself. I loved going before! LisbethS-- thanks! And I never heard about hand,foot,mouth as a chemo side effect before! So weird because my daughter is student teaching in middle school and said one of the students in the school had it. We thought that was odd , I thought that was something onlyyoung,young children got. Learn something new everyday, thanks. No ☀️,",
      "MessageIndex": 821,
      "PostDate": "02/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Oct 7, 2016 01:24AM HopefulYogi wrote: chemo#1 day 7.... Stayed home from work yesterday and today. Lost my voice at the end of day 4- completely. Some mild D that Imodium controlled on day 5. But yesterday the D and the V hit at the same exact time! 3 times that night! Broke out in a full body sweat. Couldn't t manage to eat or drink much after that. Burning taste in my mouth & throat after vomiting. Exhausted, weak & miserable! So this morning I called in to the dr ( no work again) and she had me come in to get fluids, zofran,Pepcid, and do bloodwork. Blood work was great, and I felt better after fluids. Also discovered that I have thrush...so now I am on diflucan pills. I have to go back tomorrow for hydration to make sure I get built up for the weekend. She mentioned maybe an appt with ENT if this voice doesn't come back soon. I don't really want to go looking for any more problems! To those in or near the path of this storm--stay safe, your're in my thoughts! ",
      "MessageIndex": 904,
      "PostDate": "07/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Oct 13, 2016 12:36AM HopefulYogi wrote: so hard to keep up with everyone one here!! Those of you that are starting your second treatment already --- did you have an almost normal last week before treatment started again?? I'm on day 13 (of 21) of 1st treatment and other than getting tired easily and the remnants of this voice/allergy issue, I don't really have any chemo SE's left to complain of right now. Have a big wedding coming up this weekend and some other fun plans , so I'm really hoping to coast thru this last week!!What'd ya think??? Best of luck to those in treatment this week and may your SE's be gentle❤️",
      "MessageIndex": 983,
      "PostDate": "13/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Oct 22, 2016 04:34AM HopefulYogi wrote: congrats to all of you finishing up AC this week!!!! Good luck with the taxol and rads!",
      "MessageIndex": 1074,
      "PostDate": "22/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Nov 2, 2016 03:28AM HopefulYogi wrote: Sam & Emily : granddaughters! Sounds like the best medicine there is! Enjoy every moment with them! I received a wonderful surprise gift from Amazon over the weekend. My wonderful friend purchased a Breville fountain juicer for me to start on a new adventure of juicing health. Yay! And Whoa! Lots to learn and lots of work ahead it seems. If any one is a juicer I'd love to share tips, respcipes, results. Anyone know if there is already and active board on this website for juicing ? I didn't find one. I've been trying to move to a more organic , less gmo lifestyle In attempt to get thru all this as healthy as possible and hopefully reduce chance of reoccurrence, My friend also sent me a copy of every one of Kris Carrs books \"Crazy Sexy...Cancer.\" Diet, cancer survivor tips, juices, etc.. This author is new to me as well , but so far very interesting reading. I'm on day 12 of 2nd TCHP chemo treatment . Fatigue has hit me harder this time but the stomach issues have been a little easier this time around. Lost my voice with both treatments, have an appt to see ENT next week. Hope to get some answers and a solution. Neuopathy in fingertips starting too. Have been taking my B vitas and trying to get LGutamin in me. But may need to work on getting more of that down. --in my new juices! Lo  Have a good week everyone. Stay strong! 💗  ",
      "MessageIndex": 1150,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Oct 8, 2016 08:13AM HopefulYogi wrote: I ended up with thrush on day5 of 1st chemo. Lost my voice completely for 5 days now. They gave me diflucan pills for 7 days.My chemo nurse said NOT to use salt in my mouthe rinse. Just use warm water and baking soda. Said salt it too drying with thrush. They recommend Biotene also. Something else I'm doing (on my own/not told by dr) is oil pulling. You can google if unfamiliar. Swish/pull coconut oil through your teeth for about 15 mins then spit out and rinse with warm water. Supposed to pull out toxins, bacteria while also moisturizing. I figure this can't hurt! They also said to buy some cheap soft toothbrushes and replace your tooth brush every day so you don't keep reinfecting yourself. My chemo nurse said that they tend to see that the people that get thrush, likely get it every time they have treatment. 😩 Also for neuropathy ( haven't had this yet) , my dr recommended 10gr of Glutemine powder 3 x day for 4 days after treatment. Add the power to cold things like drinks, pudding or smoothies, never to hot food or drink. I also take a super B complex vitamin. I would also love some hydrating ideas. I ended up going in for IV fluids 2 days this week. Nothing tastes good with this thrush. I did try some all natural fruit Popsicle's--they were great. I tried adding fruit to my water, every tea I usually like tastes like BLEH right now. And coffee gives me more diarrheal. I really miss my coffee!! I did a blend of lime seltzer water mixed with coconut water yesterday . That was ok for something different. Beebs-- thanks for the Accupuncture update. I'm thinking about giving that a go again too. Glad to hear the shingles are clearing up! Have a pleasant, restful weekend everyone",
      "MessageIndex": 936,
      "PostDate": "08/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Sep 28, 2016 04:15AM HopefulYogi wrote: I am getting so much knowledge, comfort and support by reading what everyone is sharing on these boards! But I have to say that I find it very hard to respond specifically to the original poster of a comment when I am catching up on so many posts at one time. Is it me? Am I not using this site correctly or am I just so used to Facebook where we comment directly under each post? I forget who said what about what by the time I get thru reading them all. Not to mention, I keep hitting a button at the bottom of this screen on my iPad and changing everything into Spanish! Lol My anxiety is through the roof as my first treatment day is nearing ( Friday)! Headache all day, haven't slept well in many nights even with Ambien! I think I'm o.d.ing on Internet. Reading about BC and side effects, online window shopping for wigs & head coverings. Literally driving myself over the edge of sanity! I SHOULD be prepping meals ahead and doing some hardcore cleaning Oceansky---Regarding glutamine powder... My dr suggested it for neuropathy , interesting to hear it may also help with pain. Kdtheatre-- wow! So glad you are on the other side of that now! How scary- good thing your friend got you to the ER. Hoping your future treatments are much easier in you. Your daughter did a great job with your hair. Beebs - asking for and accepting help is another thing that I'm going to have learn how to do. I am a stubborn Taurus. Beachbaby - dr told me to take multivitamin w/iron, vitamin D, B6 & B12. Good luck to everyone starting treatment this week - seemed like a lot were. Stay positive and strong! ~❤️  ",
      "MessageIndex": 742,
      "PostDate": "28/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Oct 13, 2016 06:30AM - edited Oct 13, 2016 01:31PM by HopefulYogi Thankyou Sam! Glad Emily is doing well right! Enjoy every moment! She's lucky to have you by her side.👫 Thanks hahlyn. Sorry you only had 5 days of magic moments. I'm hoping you have many more the next round! 💗 I'm being proactive and made an appt for Saturday to get buzzed and cut/styled in my new wig! 😳 I haven't really lost much hair yet, but Saturday will be day 16 and my daughter will be home from school, so it just seemed like a good idea. My hair is naturally thin & fine so I'm sure it won't take long once it starts going anyway. I'll get to start the new week on Monday with my new ( but hopefully not TOO different) look 💁🏻. Yes, I'm still trying to convince myself I'm ok with this idea!We'll see if I can be as brave as the others and share a photo of this experience.",
      "MessageIndex": 986,
      "PostDate": "13/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Oct 19, 2016 04:10AM - edited Oct 19, 2016 04:21AM by HopefulYogi Hi everyone. Sorry to hear about the port problems , scheduling problems, cdiff issues, vision complications , 3 periods (!) and all these other thing that you guys should NOT have to be dealing with right now. So frustrating - like the cancer is not enough? Sending hugs to all. ❤️ I took the plunge on Saturday ( my day 15) and had my hair buzzed (#5). I was scared to do it, but more scared to watch it come out slowly (or not fast enough) over the next week. Some one at my center recommended a fabulous salon and stylist that takes care of women and children with cancer - completely for free! I had a consult 2 weeks ago with Marino Cartier ( you may have seen him on HSN). My daughter went with me and we talked with him about the color and style I would want. He said it would be in in 3-4 days and I could schedule the buzz and wig styling at my convenience. He did recommend doing it sooner rather than wait til it starts looking and feeling bad. So on Friday night , I went to a big family wedding in my still intact very own hair, so I looked like myself and felt comfortable and had a great time. The next morning , my daughter was home from college , so she and my mom went with me to the appt. wasn't sure what to expect, tears emotion , regret???? Actually I felt very empowered , like I was taking control of something for a change in this shitty cancer deal. So since my daughter has a dry , but funny sense of humor (she's 22) we actually ended up smiling and laughing and having a very positive experience instead of a traumatic one. Even my 82 yr old mom who is usually a bunch of nerves and emotions... Was smiling and laughing along with us. Not trying to insinuate in any way that this ordeal is easy, simple , minor or nothing to stress about because it is! I just wanted shareeexperience for those that are dreading this phase, that there are many ways to do it. Martino Cartier has two salons in Jersey http://martinocartier.com/about.html If you know anyone in the Jersey areA - I would highly recommend him. He made us feel very special. He gave his time,products, special hairbrush for the wig, revitalash and his skills for free. I of course gave to the charity \"Friends are by your side\" that helps women and children with wigs for cancer. Felt truly blessed with that experience❣http://friendsarebyyourside.com Martino recommended gently washing with gentle shampoo and massaging the scalp when it's sore, because that means the hair is trying to push out. Also what I have been doing is massaging my scalp with either avocado oil or jojoba oil for dryness at bedtime, Here's a couple of pics of the big buzz... My daughter requested the Mohawk look for fun...he obliged ! Having a really good week ! That will end Friday with chemo# 2. WIsh I could be more certain what to expect! So I know if which days I will need to take off ahead . Oh BTW, I am scheduled to do the LookGood Feel Good seminar on Nov 16, the closest one available. I'll be needing ALL tips and tricks. Hoping I even still have lashes and brows by then! I'm Wearing the wig to work with the kiddies, but ready to yank it off when I get home . I wear classes and it gets tight around my ears. Trying out a few bandannas, hats and scrves too. Gonna mix it up. I scared the day lights outta myself when I used the bathroom in the middle of that first night!😬😳 Good luck to every one dealing with treatment, decisions , s/e's and everything else, stay strong!!!!!!!",
      "MessageIndex": 1033,
      "PostDate": "19/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Oct 20, 2016 03:52AM HopefulYogi wrote: smilethrupain , seq24, beachbabyk, nottheboss : Thankyou! ❤️ I've had great reaction and support from my coworkers at school and all my kindergarteners have said they like my hair! I would have sworn at least one kid would have blurted out \" why are you wearing that wig??\" Lol. I did get some sideways glances from some of the older kids in the school, though. Seq24 , the guy I got my wig from trimmed it up a little for me - bangs and around the face. He said I could use a curling iron or a straight iron (up to 335 degrees, I think) if I want to. He said a blow dryer will give it a lil more uuumph if it needs it. He told me to call or come back if I need anything. He gave me a certain brush with it ( Wet Brush Original Detangler) And said the most important care tip is to brush it at least 6 times a day! He said he would be able to take one quick look at me an be able to tell if I've been brushing it enough or not. ?? We'll see! My regular stylist also told me she would help me out with styling if I need it. Maybe your regular stylist could help you out. Good luck! It's very similar to my normal way of wearing it but just a little longer and a lot fuller. My normal hair is real thin and fine. It's also more the original color of my hair. It's been going gray for years and I color it, but since I'm so gray it always fades out much lighter. I love this color \"sable bronze\". It's a Raquel Welch wig. How sexy, huh? ( for those of you old enough to know who she is! Lol) I've got to call ACS again, I called once and spoke to someone, and they were supposed to have some one locally call me back about a wig but never did. Good to have another option. My friend is coming in from out of town tmrw night to go to Chemo round 2 on Friday with me. I tried to prepare her for just how LONG of a day it is there, but she's coming anyway,lol - and I'm glad 💗 Smilethrupain : your son , 💗 How sweet! Stay strong & fight on! 💪🏻",
      "MessageIndex": 1044,
      "PostDate": "20/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Oct 26, 2016 08:15PM HopefulYogi wrote: acs74 - I was also told the L glutamine powder would help with neuopathy. I was told 10 grams , 3 x day for the first 4 days after treatment. It can be added into food or drinks ( cold/cool only NOT hot items). I haven't really had any neuropathy problems yet , but I do try to add the powder to my smoothies/juices when I can. I have the metal mouth issue too. I have some all natural hydration packs to add to water to help me and I can do good on the day before and day of treatment, but after that it's so hard to drink! Everything tastes like sh#t. I, fortunately, have a lot of friends and family that have been making and sending me lots of soups! It tastes the best for lunch & dinner and I'm getting my liquids in with the meal! I also rely on fruits and all natural Popsicle's, especially the first week.  My first round of chemo, I lost my voice. I thought it was a coincidence with allergy since I'm prone to laryngitis in allergy season. I also had thrush with first chemo. Finally got my voice back after 2 weeks. Had second treatment on Friday and by Monday My voice was gone again. No thrush or mouth sores. Went in for hydration today. Been rinsing mouth / gargling with warm water & bk soda along with Biotene. Try to drink tea with honey & lemon as much as I can. Normally love that, but chemo makes me hate it now. My chemo pre meds are Emend, Aloxi , benedryl, Pepcid. Anyone have any thoughts on the chemo laryngitis? It's definitely better than the other SE's that could be dogging me right now, but it does make life difficult when you work in a classroom of 20 kindergarteners with out a voice! Thanks.",
      "MessageIndex": 1102,
      "PostDate": "26/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Sep 18, 2016 03:03PM HopefulYogi wrote: hi everyone 🙂 Fairly new here. I am scheduled to start chemo on 9/30. Taxotere,carboplatin,Herceptin,Perjeta. Once every 3 wks - 6 doses total. I scheduled it on a Friday thinking I'd have the weekend to recover, but from what I've read on here, sounds like I may be feeling it even worse on Monday & Tuesday! Reading the side effects on here and how quickly they come on and how severe is really freaking me out! Getting my port put in on 9/22. Probably getting my hair cut shorter that night too. Freaking out about the hair loss too😧. I've always hated myself in any kind of a hat/scarf. I work with 5 year olds so I'm thinking I should definitely be proactive about the wig and be ready. Don't want to scare the youngins. I'm actually going to an appt out of town tomorrow that happens to have a wig shop nearby, so I plan to do some try-ons. A lil hesitant to buy one online. I've been learning about and experimenting with essential oils this past year. If anyone has tried any oil concoctions for your side effects, I would love to hear about it. I will share any of mine as I go along as well. Just read about the tea tree oil for nails . Do you Start that at same time as chemo or only if you notice changes in your nails?? Thanks Also curious if anyone goes to treatment alone - drives themselves?? I have been turning everyone down that has offered to go with me because I didn't want anyone to have to take off work and sit there with me for 5 hours. One friend would absolutely NOT listen to me and has already put in for the day off.( feeling loved 😊). But just wondering if it is realistic to drive myself??? Thanks for reading. Big love to all of you that are currently suffering from these dreadful side effects. May you soon start feeling some relief. ~❤️",
      "MessageIndex": 585,
      "PostDate": "18/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Sep 24, 2016 03:20AM HopefulYogi wrote: Just got my port in yesterday. Very sore neck all night and most of today. Ibuprofen seemed to help more than the percosets they gave me. Got mine on the left side chest , right in the line of the car seat belt😖 Lynn--good luck with your first treatment. My first will be the 30th. They are saying over 5 hours the first time. Getting anxious to just get it done, but scared too! I really need to be able to work during this, and that really worries me. Nottheboss- -very interesting about those tattoo eyebrows. Never even thought about dealing with that! 😦 Nayda- sorry to hear about your port problem. You have so much to deal with everything else going on- so not fair to have something like that go wrong.😟 I've always been a healthy person, until now, and never had to deal with Drs much. I am amazed at how much direct phone contact I have with my Drs. They call me personally in the evenings to give me test results and such. Is this how it is for everyone? My husband had esophageal cancer 15 years ago and I handled all the \"business\" end of things : call Drs , making appts. I don't remember ever speaking on the phone to any of them personally. And everything seemed to take so long...to get appts, test results. I'm just amazed at how swiftly and efficiently everything is happening for me and how in touch the Drs have been. Thankful for th little things, among the big scary things. Bet wishes to everyone having treatment and fight s/e's. Stay strong! ~❤️  ",
      "MessageIndex": 698,
      "PostDate": "24/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Jan 9, 2017 05:01PM HopefulYogi wrote: hahlyn, I also have lost about 25 lbs( that needed to go anyway). 10 days since TCHP #5... Worst side effects so far, especially the diarrhea! Sorry TMi . And the fatigue! Making me nervous for #6, but so anxious to just get it over with! Another bad side effect is my toungue . It's like pop rocks when food touches it. I may be exaggerating a little , but it's the best description I can come up with. I haven't really heard or read any one else describing it that way. It's more than just a bad metallic taste, it's almost like certain flavors, esp salt just kind of \"pings\" off my tongue. Weird. It lasts anywhere from 4-10days. I can't wait to enjoy eating food again! I really love food! Lol Anticipating surgery the beginning of March , lymph node dissection (occult primary), then radiation and continuing with Herceptin.",
      "MessageIndex": 1499,
      "PostDate": "09/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Mar 7, 2017 09:15PM HopefulYogi wrote: Love the hair pics, gals! Looking real good. Still waiting for mine to do something. Fine and patchy right now. Was hoping to be able to get outta the wig before summer. I'm on Herceptin only infusions now, hopefully that doesn't interfere with hair growth! I had lymph node dissection surgery last week. Just got the call that all 18 nodes removed were NEGATIVE! So relieved! Can't wait to get this agrivating drain out, but feeling even better about dealing with that after hearing that news! I have my follow up appt with the surgeon next week. I started taking Femara about a month ago. Already feeling some pain in my knee when going up steps, but is not constant. I got heavily into yoga a couple of years ago and it really helped with arthritic and degenerative pain In my knee , hip and lower back. Not looking forward to having all that come back again! Hopefully, yoga will continue to help against the Femara. Have had some anxiety and insomnia issues also since I started taking it. But I was also dealing with nerves from the surgery I had ahead of me, so not sure how much was caused by that or the Femara, or some of both. I am sleeping a little bit better since surgery. I have radiation ahead of me for 6 wks after I am healed from surgery. One day at a time... sending healing thoughts to all!",
      "MessageIndex": 1671,
      "PostDate": "07/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Sep 21, 2016 04:59AM HopefulYogi wrote: this is what I am planning to use when my chemo starts next week. Saving a trip to the Drs , NOTtaking more time off to go back sounds exactly like what I need. Sounds good to me. Thanks for sharing your experiences😊",
      "MessageIndex": 5,
      "PostDate": "21/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/844407",
      "Title": "\"On Body\" Injector of Neulasta elise24601 deevee903"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Mar 10, 2017 05:14PM HopefulYogi wrote: I'm 7 weeks PFC. my hair before BC was thin, fine and straight. I also was going going gray and had been coloring it for about 10 yrs . Feeling hopeful after reading some of this thread that it might actually come in differently. So far itsbaby fine gray hairs and not filled in everywhere yet. The top front and parts of the side are particularly sparse. I'm getting Herceptin every 3 weeks still until Sept, does anyone know if this will work against my hair growth?? Glad to find this thread to find out how everyone else is doing in the hair dept and what tips I can learn! Thanks😀",
      "MessageIndex": 24964,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Mar 14, 2017 07:48PM HopefulYogi wrote: seq24 - we're in the same boat. I'm also about 7 wks PFC. I shaved my head in Oct after my second TCHP, so Mine is not as long as yours in the back& sides. But the top especially, is the same. Same color too. I haven't gotten the courage up to take a photo of myself yet. Very brave of you to share with us. Made me feel more like I'm at normal pace. Thanks to all who have shared pics! Gives us all hope",
      "MessageIndex": 25004,
      "PostDate": "14/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Aug 3, 2017 12:43PM HopefulYogi wrote: Hi! I've posted before but not for a while. I try to keep up reading the posts as my hair is very important to me, as it is for all of us to help us feel \"normal\" again and not look like a cancer patient anymore! I follow seq24 closely because we are the same time frame. Looking great, seq24! I love seeing everyone's waves and curls! I'm 6mo PFC but still have about 3 more Herceptin infusions and I am taking Aromisin, which are probably slowing my growth. I'm posting some pics because 1. I'm fristrated with how much scalp is still showing thru . 2. How straight and baby fine it is 3. I don't know what do do with it so I wear a hat all the time in public. Gave up the wig when school got out in June. Too hot and humid in NJ summers for a wig! I am using Jamaican black castor oil w/peppermint massaged in my scalp over night and take biotin and numerous other vitamins. Does anyone have a good hair styling product to suggest for trying to do something with this awkward hairdo? Gel, mousse? Brands? How-tos? I'd like to be able to go out at night and NOT wear a ball cap!! Thanks. Embarrassed to share these but so grateful to all of you that have shared photos and given me hope this past year! 💗",
      "MessageIndex": 25584,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Aug 4, 2017 02:52PM HopefulYogi wrote: thanks everyone for the encouragement! Half of me says \"here it is , this is what I got- deal with it\" and the other half of me is embarrassed and wants to hide! I've tried using some gel that's supposed to add volume, but I end up either greasy looking or with really stiff hard hair. Hoping to get some product suggestions to help me out of this ChiPet phase! 😏 Have a great weekend everyone!! ☮️",
      "MessageIndex": 25589,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Mar 17, 2017 03:42PM HopefulYogi wrote: is anyone else having this problem? My hair is starting to grow in (8wks PFC) but I still plan to wear my wig for a while because it's got a long way to go. My natural hair line is lower than the wig. So particularly on the sides of my face I can already see the silver glittering out from the brunette wig. And also next to my ears. I assume I will also have this problem at the top of my forehead when that starts filling in. I guess I could try a different wig but I'm not really feeling like going out and buying a new wig now that I'm hopefully growing my own hair back. It's not really long enough yet to color I don't think. Any ideas? Thanks",
      "MessageIndex": 25019,
      "PostDate": "17/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Aug 14, 2017 04:03PM HopefulYogi wrote: seq, docmama,& serenity you hair looks amazing! Thinking of trying the viviscal or Toppik that was recommended here. Anybody have first hand experiences with these? The Toppik brand seems to have better reviews on Amazon. So, I've been going to yoga classes BARE headed! No more bandanas. That's a very safe environment for me- mostly women and they know what I've been going thru and have been very supportive and encouraging. Also went to dinner last week with a friend to a place that was too nice to wear a casual cap, so I BARE headed that too! I felt the looks, felt like I look like a cancer patient, but thankfully I didn't see anyone I know there so that made it a little more bearable.(pun intended) Slowly making the transition, but hoping maybe one of those products could help fill in the bare scalp areas to make me feel less self conscious . Trying to stay patient!!",
      "MessageIndex": 25607,
      "PostDate": "14/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "HopefulYogi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239335/profile",
      "Content": "Aug 27, 2017 04:23PM HopefulYogi wrote: VLH- I'm dealing with the same shiny scalp issue that needs some filling in. I spoke with the girl that works at my local Sally Beauty supply store last week. I was asking about products like Toppick and Viviscal. She said they also make their own brand of that type of product. She said when I was ready to try that type of thing out- I could purchase a variety of them, try them all at homeand return any that I didn't like. I was getting ready to leave on a beach vacation where I'd be wearing a hat all week so I told her I'd be back to take her up on that offer at the end of the month. Just wanted to share that in case anyone wanted to check with their local shop and see if they could get them to offer that. I'll let you know how I make out and which one I like best. ",
      "MessageIndex": 25645,
      "PostDate": "27/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    }
  ]
}