{
  "AuthorID": "Hope50",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
  "Posts": [
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Hope50 wrote: I just received my oncotype dx score and it is 19. Had 1.8 cm tumor. Had lumpectomy. ER and PR positive, grade 3.  Being in the intermediate risk I have to decide on chemo or not.  I'm scared of making wrong decision.  Will for sure have radiation and then pill. What have others done? Dx 6/18/2014, IDC, 1cm, Stage I, Grade 3, 0/3 nodes, ER+/PR+, HER2- Surgery 7/17/2014 Lumpectomy: Right Chemotherapy 8/14/2014 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 11/5/2014 Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/823389",
      "Title": "Chemo or no chemo Hope50 Hope50"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Nov 24, 2014 06:18PM Hope50 wrote: good evening friends, I had no. 14 today. They gave me some cream for the itching. Said it is common. Saw my RO. I lost 6lbs in a week and they wasn't real happy about that. I can stand to lose weight but they said right now is not the time to do it. I'm not trying to I just have NO appetite at all. I didn't sleep good last night. Does anyone else hurt on the side they are getting rads when you lay down? ",
      "MessageIndex": 191,
      "PostDate": "24/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Dec 25, 2014 04:29AM Hope50 wrote: I am DONE!! Finished my rads!! Cried all the way through the last one. Can't believe this part of the journey is finally done. The techs gave me flowers after I finished. Such wonderful caring people I had. Part of me is still burning, part is peeling, I'm really really tired. Here's to a new beginning!! You all just getting started, you can do it. We are here to support you. To those that finished, congratulations!!! Merry Christmas to everyone. Hope you all have a wonderful holiday! Very grateful to each and everyone of you!",
      "MessageIndex": 532,
      "PostDate": "25/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Aug 5, 2014 07:42PM Hope50 wrote: thank you.  This is so hard. I know I'm not alone.",
      "MessageIndex": 3,
      "PostDate": "05/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/823389",
      "Title": "Chemo or no chemo Hope50 Hope50"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Nov 12, 2014 03:57PM Hope50 wrote: Beachbaby I have a spot on my lungs also they are wAtching. It hasn't changed at all. They don't believe it's anything. Yes it's scary when you've been dealing with cancer.",
      "MessageIndex": 61,
      "PostDate": "12/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Nov 13, 2014 11:46PM Hope50 wrote: Hello yikes, I got the same prescription and my insurance didn't cover it. I went ahead and got one tube of it and I think it was around $32. I have just had 7 rads so far. It is not as greasy as some of the others. It should last me a bit. Thought I would use that more during the day and the aquaphor at night. I wish you well as you start. So far for me I'm tired but some of that is still recovering from chemo. I have noticed the last 2 days the side they are doing is getting a little tender. Not bad though.",
      "MessageIndex": 78,
      "PostDate": "13/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Nov 14, 2014 09:05PM Hope50 wrote: I have completed 8 rads. Got X-rays this week after 5th rad to make sure all Is lined up. So far what I've noticed most is my nipple pretty sensitive and at night it hurts to lay on that side. That area is tender. A little pink but not much. I'm really really struggling with sleeping. Had a great talk with oncologist this week. She says to rest and give myself a break. Only out of chemo barely a month and in the beginnings of radiation. She said many people can get very depressed during this time because the are done with chemo and they want to feel better and they don't. Many people around us think as we complete a treatment then all is well and back to normal. My MO said we can face side effects etc from all this stuff up to a year or so. She said your not gonna feel 100% right away when your body has been through so much. It was a great appointment with her. Everything I'm feeling and how I described it, she assured me it was normal and also that it will get better, just gonna take some time. I am supposed to start Arimidex in 3 weeks. Anyone else gonna have to go that route? Who is ahead of me? Can't remember. How you doing any SE's? ",
      "MessageIndex": 83,
      "PostDate": "14/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Nov 23, 2014 03:04PM Hope50 wrote: I've had 13 rads now. Glad to have a break this weekend. Chest began itching yesterday and have several bumps going on. A little red but not bad. The area is kinda tender today. We will see what this week holds. They cover me with what looks like a pillow case. They fold up the sides to get me all lined up and then put them down when the radiation begins. They also do X-rats each week, I was concerned about feeling exposed also at first. The techs are very good and have made it easier. Going everyday is a reminder of what we are fighting. We have to keep fighting and do our best to keep our spirits up. That at times can be challenging. Hope everyone had a good weekend.",
      "MessageIndex": 174,
      "PostDate": "23/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Nov 25, 2014 11:11PM Hope50 wrote: Has anyone had any back pain on the side of their rads?",
      "MessageIndex": 205,
      "PostDate": "25/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Dec 5, 2014 03:13PM Hope50 wrote: Happy Friday!! 22 rads done. Pretty red now, glad it's the weekend and I get a break. I'm calling it no bra December! One more week to go then 8 Boosts! Some days more tired than other days. It's very managable. But I will sure be glad when this is over. Today I began taking anastrozole. Thinking positive on no SE's. Hope everyone has a great weekend.",
      "MessageIndex": 270,
      "PostDate": "05/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Dec 15, 2014 08:33PM Hope50 wrote: I'm down to just 6 boost to go and then Merry Christmas and Happy Birthday to me!! My underarm is so red and my nipple is so sensitive. At times it about has me in tears and I'm not a whimp usually. I got some new cream today that they said would help numb it but it hurts to even put it on. Not wearing a bra the rest of 2015!! Last night it hurt when I pulled my sheets and blanket up on me. Hurts for anything to touch it. Done 2 of 8 boosts and started itching again. The end is insight. Still adjusting to Arimidex. These days it's so hard to tell what is causing what symptom. I just want to feel good, really good. I know that will come in time. I had to have a colonoscopy couple weeks ago because something showed up on CT scan prior to chemo. Well they removed a polyp that was the cancer causing kind and a few other issues. It really did a number on me. I'm just mentally and physically worn out and reality hit again and I hate cancer!! Some days are just easier than others. Sorry to seem like a downer and complainer. That's not typical me. Just hard when no one around understands what we are truly going through. I'm so glad I have you guys to help me through. Keep a going ladies. You all are very radiant!!",
      "MessageIndex": 412,
      "PostDate": "15/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Jan 13, 2015 04:34PM Hope50 wrote: Hello fellow warriors, Dacre I and many others on here would like to be in that meeting.  What a witch!!  I will be thinking about you. I finished my rads on December 23.  I am very happy about that.  I was put on Anastrozole (sp) the first of December.  I have had very severe back pain.   I called my oncologist and she has taken me off it for a couple weeks to see if the back issues was from rads or from the meds or what.  My skin is looking better.  I hate having the scar in the middle of my chest but grateful to have what I do have.  I have been feeling very, very down lately and I can't seem to knock it very well.  I was so excited to have chemo done, rads done and now just waiting for follow up appointments and tests.  I think the emotional part has just now caught up with me.  Anyone else experience this?   Going through everything was so focused on all the appointments, labs, SE's, etc. that pushed all mental/emotional stuff down.  Well now that all that is over, it has resurfaced with an ugly force.  It's been gloomy outside and that doesn't help.  I still get tired but not as bad as it had been.  I do not have much of an appetite at all and that has been going on for several weeks.  At least things don't taste like cardboard and metal anymore. Just wondering if anyone else has been hit hard by the \"blues\" following all this? No one else seems to understand things like the people on here.  Everyone seems to think once your treatment is over, you are 100%.  Well for me at least that has not been the case.  Thank you all for going through this journey with me.",
      "MessageIndex": 926,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Nov 2, 2014 05:05AM Hope50 wrote: Hello fellow warriors, I begin my 7 weeks of rads this Tuesday.  I'm still very tired from last chemo 2 weeks ago.  Hope you all that still have another round or so to go will have as easy a time as possible with minimal SE. Have a great Sunday.",
      "MessageIndex": 8,
      "PostDate": "02/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Dec 9, 2014 09:17PM Hope50 wrote: today was rough. So very red and burned. Had to take bra off at work, kept putting gel on. Under ny arm painful. My back hurts bad. Boob is very very red. Chest itching and rashy. Looks a mess and not a hot mess!! I left work early in tears because it all hurt so bad. I'm tired slow. I've done 23, got 11 more to go. You think the burning will continue to get worse? Doesn't the boosts burn worse? Jean, glad you stood your ground and bring heard now and action taken.",
      "MessageIndex": 343,
      "PostDate": "09/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Dec 11, 2014 05:44PM Hope50 wrote: congrats on those finishing up!! I start 8 boosts next Monday and then I'm done!! The fatigue has set in big time along with everything else. I've had really bad back pain on my radiation side. At least there is a light at the end of the tunnel. One week on anastrozole and so far so good with that. How is everyone's hair coming along for those who had chemo? Did the boosts burn worse?",
      "MessageIndex": 375,
      "PostDate": "11/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Jan 13, 2015 04:35PM Hope50 wrote: Does anyone have any good suggestions on some books to read?  I have real trouble sleeping many nights and am looking for some ideas and thought I would ask you guys.",
      "MessageIndex": 927,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Nov 6, 2014 08:36PM Hope50 wrote: hello fellow warriors, I finished chemo 3 weeks ago and started rads on Wednesday.  2 down 32 to go!  I still feel tired from chemo.  Good news is good beginning to taste better.   Was a little anxious about the rads.  Just brought me to reality again that I had cancer.  Will tackle this part of the journey head on with the support of all the wonderful people here.  I kniw I'm not alone. Keep sharing your journey, it helps.",
      "MessageIndex": 29,
      "PostDate": "06/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Nov 15, 2014 06:45PM Hope50 wrote: Beachlady, the rads go pretty quick. Hopefully you will have some great techs that will help make it as comfortable for you as possible. I have 4 tattoos. I've had 8 rads so far. I lay there and hold on to these bars behind my head. It takes longer to get undressed and dressed again than the actual rad it seems. I'm tender on my right side and a little pink but not to bad so far. I cut up with my techs and that helps distract me. I see the RO each week and will have X-rays weekly to make sure everything is lined up fine still. I put on cream 3 times a day. I went and got me some cami's to wear if I start getting burned. Beachlady how are you doing on the new drug? I start same thing in 3 weeks. I'm very anxious about it. Katie I agree more like a bee sting.",
      "MessageIndex": 90,
      "PostDate": "15/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Nov 20, 2014 06:15PM Hope50 wrote: I've completed #12 today. I will get my last Rad on on Christmas Eve!! I'm getting a little pink. And it hurts to lay on they side. My legs wipe me out. So weird feeling. It's my thighs mostly. In the afternoon they just feel so odd and heavy. It hasn't been to bad though. I have 4 tattoos also. Very tiny. Welcome to everyone. We will make it. We are strong warriors!! May you all feel radiant!!",
      "MessageIndex": 146,
      "PostDate": "20/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Dec 21, 2014 08:30PM Hope50 wrote: Congratulations Coyote! You have been an inspiration! I have 2 more boosts to go. Tuesday is my last one! Happy birthday and Merry Christmas to me!! I got really sick on Friday and almost missed my rads. They sent me back to the chemo room for IV meds and fluids. They sure try hard to make you feel better. I'm very grateful for the treatment I've received and very grateful for this part of the journey to be about over. I'm pretty red and under my arm hurts, heck the whole area is pretty sore but I'm making it!! Good luck to those starting out!",
      "MessageIndex": 491,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Dec 26, 2014 06:18AM Hope50 wrote: For those that had chemo and have finished rads or near finished, how is your hair doing? Coming back in yet?",
      "MessageIndex": 550,
      "PostDate": "26/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Jan 15, 2015 06:21PM Hope50 wrote: Thank you everyone for your encouragement. I'm so glad I have a place to come to and be heard and understood. You all are so wonderful and so supportive of one another. I'm gonna check out some of those books. We have a warmer weekend ahead, gonna get outside and enjoy and do lots of walking. Hope everyone has sweet dreams!",
      "MessageIndex": 971,
      "PostDate": "15/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Nov 11, 2014 05:29PM Hope50 wrote: Today was number 5 for me. I'm really really tired today. Isn't that too soon from the rads to be tired? Maybe it's still from chemo recovery. Nothing else noticeable at this point. Takes longer to get there than the actual radiation. Hope everyone is doing well.",
      "MessageIndex": 49,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Hope50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203547/profile",
      "Content": "Nov 26, 2014 02:18AM Hope50 wrote: Has anyone's back hurt on the side they are getting rads? Strongenough, my chest looks like yours. Blownaway, congrats on completing this tomorrow!",
      "MessageIndex": 1034,
      "PostDate": "26/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    }
  ]
}