{
  "AuthorID": "Hopfull",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274078/profile",
  "Posts": [{
    "AuthorID": "Hopfull",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274078/profile",
    "Content": "May 16, 2018 05:50PM Hopfull wrote: May 16, 2018. I feel all types of emotions right now, but feel like I should be stronger at my age emotionally, however we've been hit with a lot this year all within a few weeks. I'm 71 and received my diagnosis today ILC. It's very small and I'll know more once I speak with the surgeon tomorrow. Everything is happening very fast, which I'm assuming is a good thing, but a bit overwhelming. My biggest concern is telling my youngest daughter who is 47 and under chemotherapy for breast cancer now; she's on her 4th session out of 5. Afterwards (4 wks) she has to go through radiation. She had a double-mastectomy 2 years ago and now the cancer is back. She & her husband wanted to fight the cancer 100% holistically. No one knows if this is why it came back, but it did. Every minute of everyday, I pray and think of her. She would not accept my not telling her. I live in PA with a great husband and she lives in Colorado, 3 beautiful children and a husband (not much support from him). She's a real fighter and I've been amazed at her strength. I hate not being with her, but I also had surgery 3 weeks ago for a pacemaker. Just like most of you young, courageous ladies, I did not expect this for myself, let alone my daughter. I was under the myth that breast cancer only hits those that have had Mothers who had BC and if you're older, you don't need to be concerned. On my Dad's side, I had 2 aunts die from BC, but not my Mom who is 98 and always in very good health including now. I've been healthy and active up until two years ago and I don't look sick. However, the bottom line is that I'm scared for so many reasons. I don't know this Dr, but her reviews are good. I'm afraid of going in for surgery again, I'm afraid of the cancer coming back or being somewhere else. I can't think straight and I keep crying. I came upon this site and felt it might help.",
    "MessageIndex": 395,
    "PostDate": "16/05/2018",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
    "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
  }]
}