{
  "AuthorID": "Hoping4thebest32",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229368/profile",
  "Posts": [{
    "AuthorID": "Hoping4thebest32",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229368/profile",
    "Content": "Hoping4thebest32 wrote: Without thinking much of it, I noticed that I was having a frequent occurence of breast pain- mainly in my left breast. I attributed it to monthly changes since it was almost always a few days before or after my period started. However, the past two months the pain has been non-stop. I also noticed that my breasts have stretch marks or appear to have wrinkly/ribbony lines- not quite the peau d'orange look but enough to make me afraid. Are stretch marks on breasts normal? I have not had children yet nor ever been pregnant and I know this affects my hormone levels even more. I can't recall gaining or losing any weight and I'm 32 so I'm concerned about this. While exploring the area of pain, I realized that my left breast was slightly larger than the right and I felt tiny lumps on my breast-almost under my arm pit. No change in temperature but the pain is evident if I touch that area. Pain is worse when I'm at work due to stress levels. My mom was diagnosed with breast cancer in 2011 and hers began in the left breast and so now I'm feeling especially scared. I just discovered that I have three fibroids on my ovaries and have surgery scheduled but now I'm more concerned about getting tested for bc. I'm frustrated because the last time I called to have a mammogram based on my concerns in April, the breast clinic refused to acknowledge my doctor's referral because they said \"he didn't list pain on the referral so you have to go back and get another order\". Now I'm mad that I didn't speak up sooner. I'm also having a difficult time getting my insurance to cover a portion of the costs because I'm 32 and this isn't considered a routine. I am scared and angry at the same time. How long does it take to get results from a mammogram? Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "25/02/2016",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841670",
    "Title": "I feel lost Hoping4thebest32 amhess"
  }]
}