{
  "AuthorID": "hoppypoprocks",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275660/profile",
  "Posts": [{
    "AuthorID": "hoppypoprocks",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275660/profile",
    "Content": "hoppypoprocks wrote: Hi, everyone! I'm 36. A few weeks ago I found a lump on my left breast. My GP diagnosed mastitis (even though my daughter is 8) and sent me home with antibiotics. My pain and swelling got worse every day even with antibiotics, so last Thursday I had a mammogram and ultrasound appointment. They did a 3D mammo on both breasts and had me wait while they showed the radiologist the results. The nurse came out and said that they'd found something concerning on the right breast and needed to call the doctor to get orders to u/s that side, too. They did both sides and the u/s tech said she would go talk to rad and would be right back to talk to me. After a few minutes of waiting, the radiologist walked in with the u/s tech and said, \"The left side is skin changes. Follow up with your GP or a dermatologist. Can I take a look at the right side on the ultrasound?\" I of course let her. She looked for a few minutes and said, \"There is something concerning on your right mammogram. I'm going to schedule you immediately for a biopsy.\" They had a nurse come get me and she took me into her office and scheduled me for a stereotatic biopsy on Friday. I was completely in shock. I had gone in for the other breast! I went in for the biopsy on Friday (what a crazy experience!) and I get my results Wednesday. I didn't even think to ask any questions either day, which I could smack myself for now. I did see the mammo on the board at the biopsy, though, and saw what looked like a mass with calcifications on one side. How did you make it through the wait without just panicking? I slept most of the weekend so that wasn't too bad but now I'm at work and it is apparently not enough of a distraction. Thank you!!! Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "18/06/2018",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/865288",
    "Title": "Ways to pass the time waiting? hoppypoprocks hoppypoprocks"
  }]
}