{
  "AuthorID": "hostanut",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63420/profile",
  "Posts": [
    {
      "AuthorID": "hostanut",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63420/profile",
      "Content": "Oct 2, 2008 07:37PM hostanut wrote: Brenny,        I am one who had a lumpectomy 2+ years ago, followed by rads.  My mass was first thought to be 1.1 cm, then 1.8 cm. and finally when all was said and done, 2.5 cm.  Going into surgery I said I'd like if they got in there and felt a mast. was more appropriate, that they'd do it.  I was told I'd signed for a lumpectomy, and should I decide on a mast., that would be a separate surgery.  I guess what no one really talks about is how much of a scar and how much of the breast can be removed with just a lumpectomy.  I happened to have a smaller breast to begin with, and the scar I was left with I could stick my fingertip into.  It took me over a yr. to try implants, which I did but the rads on the affected side caused the breast to contract.  I finally, 3 wks. ago, had a mast. completion with DIEP flap recon.  My ps had to be more aggressive than he thought in removing the irradiated tissue, as he said when he cut into it, it barely bled.  It's so difficult to make that initial decision.  I thought I knew exactly what I wanted.......lumpectomy + rads, when I made the choice 2 yrs. ago.  Things changed, and my choices changed along with them.  Knowing what I do now, I wonder why I didn't have a mast. right off the bat, but you know, sometimes it's just too overwhelming to make such a radical decision at the outset.  If you have a larger breast and smaller \"lump\" you should be just fine.  I just have learned, not only by personal experience, but by many things I've read, that surgeons aren't always upfront with the scarring that you can be left with having a lumpectomy.    Hope I didn't muddy the water, but just wanted to share my experience.    Good luck!    Nancy",
      "MessageIndex": 9,
      "PostDate": "02/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/722155",
      "Title": "Have I made the wrong decision?? Brenny FrannyK"
    },
    {
      "AuthorID": "hostanut",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63420/profile",
      "Content": "Nov 5, 2008 03:22PM hostanut wrote:  Next stage is 12 weeks after healing, according to my ps.  Thought maybe I'd have a nipple for Christmas, as my surgery was Sept. 10th.  He says maybe for Valentine's Day!  (Almost there, but not completely healed.) Nancy",
      "MessageIndex": 5,
      "PostDate": "05/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721861",
      "Title": "How long before DIEP flap breast \"plumps\" up? hostanut hostanut"
    },
    {
      "AuthorID": "hostanut",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63420/profile",
      "Content": "hostanut wrote:   I know it takes awhile for a DIEP flap breast to look less flat, but not sure just how long before it's plumper and has more projection.  Does anyone who's had that done remember how long it takes?     Thanks!     Nancy DX 4/06, IDC, 2.5 cm.,stage IIa, grade 1, 0/3 nodes, ER+PR+, HER-2 neg. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721861",
      "Title": "How long before DIEP flap breast \"plumps\" up? hostanut hostanut"
    },
    {
      "AuthorID": "hostanut",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63420/profile",
      "Content": "Oct 8, 2008 01:01PM hostanut wrote:    I'm from a small town, and went to the closest city (still small, 30,000) for my initial mammos and biopsy.  I knew, though, from the outset that if it was malignant, I wanted to go someplace that specialized in breasts (i.e. The Breast Center at a university hosp.)  It does sound like you have every reason to trust the surgeon you have, and have a great deal of confidence in him. My co-worker went to an in-town general surgeon, then went to a teaching hosp. and an excellent ps for her DIEP recon.  My co-worker continues to do well and was satisfied with her choice.  I also was satisfied with my choice.  If you feel like you need to have the peace of mind, DO have a 2nd opinion, but if you are happy, then just move forward.     Nancy",
      "MessageIndex": 8,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/722425",
      "Title": "Breast Surgeon Versus General Surgeon soapsnug Looneymom"
    },
    {
      "AuthorID": "hostanut",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63420/profile",
      "Content": "Sep 23, 2008 11:16AM hostanut wrote:   Yes, I had a lumpectomy followed by radiation.  Over a yr. later I opted for scar revision and bilateral implants.  Well, the breast that had been irradiated promptly contracted.  So......another yr. went by and I finally opted for a skin sparing mast. completion with an immediate DIEP flap reconstruction.  Though I presently look a bit like the Bride of Frankenstein (hey, even SHE was married!) my new breast finally feels like it's ME......which it is.  The other was just plain hard and felt like a softball stuck to my chest.  The new one is great.   Hope this info helps you.    Nancy",
      "MessageIndex": 3,
      "PostDate": "23/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721635",
      "Title": "Skin Sparing Mastectomy after Radiation ? kay12 hostanut"
    },
    {
      "AuthorID": "hostanut",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63420/profile",
      "Content": "Nov 7, 2008 07:02PM hostanut wrote:   I DID have a lumpectomy, followed by radiation.  After a yr., and a deep scar on a small breast, I opted for implants bilaterally.  All was great for 6 weeks, when my irradiated breast contracted, making the breast shoved, tight, and tender.  I waited another yr., and for my own comfort and peace of mind, I went ahead and had a mastectomy completion with immediate DIEP flap re-con. I now feel like the breast I have is my own, and am glad I did it.  If I knew before what I know now, I would have just had the mast. with immediate DIEP re-con., but alas........we get more informed as we make our way through this journey called cancer. I guess I just had to evolve.    Nancy",
      "MessageIndex": 2,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724088",
      "Title": "For those who \"could\" have Lumpectomy.... why choose Mast? Estepp sbmolee"
    },
    {
      "AuthorID": "hostanut",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63420/profile",
      "Content": "Sep 26, 2008 11:33AM hostanut wrote: Hi gang!       This is great!  Just another nurse weighing in with our 2nd common denominator......RN with bc.  I'm a home care nurse, working for a county in WI.  I love the flexibility of the job, and all the great support from my co-workers.  We have had an exceptionally high rate of cancer in our office, and thankfully, due to the \"nurse network\" we're able to point each other in the direction of capable and personable medical help.  Whenever I want a good specialist, I always ask other RNs!  My bc journey started in May '06 with a lumpectomy.  I haven't had a recurrence since, but due to a scar revision and bilateral implants last Sept., my affected breast (that had had rads) contracted just 6 weeks post-op.  Anyway, it took me another yr., and I just had a mast. completion with DIEP flap reconstruction 2 weeks ago (a fantastic ps recommended by a co-worker who'd had him!)  So glad I did.......I'd do it again in a heartbeat, and I'm 60 yrs. young! Nancy",
      "MessageIndex": 56,
      "PostDate": "26/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "hostanut",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63420/profile",
      "Content": "Sep 24, 2008 10:46PM hostanut wrote: jbr3.....You've come to the right gal!   I had bilateral implants after having an original lumpectomy followed by rads.  Well, about 6 wks. after the implants, the one I'd had rads on, contracted.  That side felt firm and tender, and basically didn't feel like ME.  The implant had shifted due to the contracture, and I've been debating what to do for the past yr.  I FINALLY made the decision to have my affected breast removed (mast. completion) with immediate DIEP flap reconstruction.  That was 2 weeks ago to the day.  From day #1, my new breast felt like it was me......because it IS now!  I'm 60 yrs. young, and I'd do it again in a heartbeat.  For me it was the answer I was looking for, as I didn't want to compromise any muscle.  Oddly enough, not only was no muscle used, but my perforator wrapped AROUND my muscle, so my ps didn't even have to split the muscle!!  He has a CT scan of the abd. done prior, so he can draw a map and listen with a Doppler to know just where he's going.  Milwaukee was the first place to use CT scans as a protocol prior to the DIEP flap procedure.   Good luck with your decision.  I know it's a BIG one, but looking back for me, I'm so thankful I did it (despite some of my best friends thinking I was nuts!)     Take care!      Nancy",
      "MessageIndex": 3,
      "PostDate": "24/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721734",
      "Title": "DIEP vs. Implant Reconstruction-need advice jbr3 hostanut"
    },
    {
      "AuthorID": "hostanut",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63420/profile",
      "Content": "Sep 24, 2008 12:51PM hostanut wrote:  The \"bundling board\" pillow thing sounds pretty good, for a little added protection.  With my surgery, I haven't been able to lay flat on my back nor on my affected side, so I've had to sleep in a bent-knee, half sitting up position!!  I do normally sleep on my back, but I have a feeling I'll need pillows tucked everyplace.  I'll have to ask tomorrow how long I need to assume this position.  With the complementary tummy tuck with the DIEP flap, it sure makes things taut through the middle!   Thanks!     nancy",
      "MessageIndex": 2,
      "PostDate": "24/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721719",
      "Title": "Moving Back to Bed with Hubby hostanut Massgirl"
    },
    {
      "AuthorID": "hostanut",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63420/profile",
      "Content": "Sep 20, 2008 09:38PM hostanut wrote:   I had a mast. completion with DIEP flap recon. about 10 days ago.  The drainage in 3 out of 4 of the drains decreased to 4-13 cc. within 6 days post-op., and I had them removed.  For the past 4 or 5 days, the one remaining drain has been less than 30 cc., but my ps would like it 20 cc. or less!!  Man, it's such a picky, burning feeling everytime I stand up (the remaining one is in my lower left abdomen), that tomorrow I'm going to do NOTHING and see if I can't get it to decrease dramatically and call with my plea on Mon.  I know it's not wise to pull them too soon, but I've been in the 20s for some time now!  Patience really is a difficult pill to swallow! Nancy",
      "MessageIndex": 20,
      "PostDate": "20/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721216",
      "Title": "Removing Drains and Getting Pathology Report Route53 hostanut"
    },
    {
      "AuthorID": "hostanut",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63420/profile",
      "Content": "hostanut wrote:   My original posting of this seemed to disappear into thin air, so I'm doing this again.  I still have a drain in till tomorrow, and I'm 2 wks. post-op.  I've been sleeping in a recliner in the family room ever since I got home.  When have you girls moved back into a bed?  We have a queen-sized, so it's not like a big, spread-out king sized area.  I'm thinking about trying one of our other double beds first to see how that goes.  Any particular suggestions to make the transition easier? (I had a DIEP flap).   Thanks again, if the other one pops up!!   Nancy DX 4/06, IDC, 2.5 cm.,stage IIa, grade 1, 0/3 nodes, ER+PR+, HER-2 neg. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721719",
      "Title": "Moving Back to Bed with Hubby hostanut Massgirl"
    }
  ]
}