{
  "AuthorID": "HouseDivided",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238821/profile",
  "Posts": [{
    "AuthorID": "HouseDivided",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238821/profile",
    "Content": "HouseDivided wrote: Hi -I am a new poster. I've been lurking for a few weeks and found great info in this discussion board. I have an unusual situation, I think... A quick history: 8/2/16 had a mammogram (last one was in 2010, I know, I waited way too long:-) 8/12/16 had a follow up mammogram as a spiculated spot was found on my right breast, they called radiologist and I went right to Ultrasound 8/16/16 got results of both tests: there is an 8.8 x 5.6 x 9 mm spiculated carcinoma within the 9:00 position of the right breast which warrants biopsy for histologic diagnosis. BIRADS 4B (suspicious for malignancy) 8/23/16 had needle core biopsy with ultrasound guide with four biopsies. I was told it would take 45 minutes, it took an hour and a half and the entire time the radiologist seemed to lose the spot constantly and the ultrasound tech looked more annoyed as time went by and would nod to her when she found it again and then she would lose it. I could see the spot on the ultrasound myself as I was facing the machine. During the test the radiologist told me she had issues and if we didn't get the right cells they would bring me back for another biopsy using a different tool like a roto rooter that is painful for women so she didn't like to use it unless necessary. She told me they would redo it at no cost. I was an emotional wreck when I left there, not because of the possible diagnosis but because it took so long and I was not confident at all that she got the right spot. My PCP left her practice during this so I decided to go right to an MO on my own prior to the biopsy coming back. I am glad I did. 8/25/16 Met with the MO and he reviewed reports and did an exam. I told him my concerns with the biopsy not being correct and he said if it came back benign there were other options. He agreed that this was most likely cancer. 9/1/16 Finally got Biopsy results 9 days after the biopsy. The MO's Medical Assistant had to beg to get the results for my appt. that day. Here is the FULL report: Clinical History: ICD10 code N63. Infiltrative cancer, right upper quadrant. Gross description: received in formalin labeled \"right breast at 9 o'clock\" is a 1.0 x 0.6 x 0.2 cm aggregate of yellow-tan fibrofatty core biopsies. The specimen is inked black and entirely submitted in cassette 1. Microscopic description: sections reveal needle core biopsies of breast tissue. There is some increased fibrous stroma. No significant epithelial hyperplasia is present. There is no evidence of atypical hyperplasia or malignancy Same radiologist read both mammograms, ultrasound and did the biopsy and reported on the biopsy. The MO read me the results and I asked if they made sense to him and he said no and he had a call in to talk with the radiologist. He said she recommended a follow up mammo in six months and he was very uncomfortable with that. He said I should have another biopsy or see a breast surgeon in their practice. I said I would not go back to the radiologist but I would go to a breast surgeon. So I have an appt. in a week. He also ordered a DNA Analysis. I have some questions for you experienced ladies: Why would the mammo report say carcinoma before a biopsy was done? Does the DNA Analysis test for the breast cancer gene? Why would the biopsy report say infiltrative cancer (I have no history of cancer) and yet the findings say benign? What were your experiences with an ultrasound guided needle biopsy? How long did it take? Did the radiologist have to fumble around looking for the spot? It sounds like they would remove the spiculated mass whether it is benign or cancerous so why not go to that at this point and do the second biopsy in the lumpectomy? Does the size of the mass listed on the mammogram include the spikes (which on the mammogram looked quite long like spider legs) or is that the measurements of the spot and the legs are extra? What can I expect from the BS at this point? I think that's it for now! I'm very frustrated trying to get properly diagnosed. I'd be thrilled if this was benign but I just want an accurate diagnosis at this point. BTW, I have never had breast surgery or an injury that I can recall that would leave a scar. Thanks for letting me vent and thanks in advance for any input and advice! Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "02/09/2016",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/847653",
    "Title": "Issues with Biopsy and results Spiculated spot HouseDivided HouseDivided"
  }]
}