{
  "AuthorID": "howhm02l",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
  "Posts": [
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jul 10, 2012 07:49PM howhm02l wrote: Gamergirl - I am 40 and within the past 2 weeks have been diagnosed with DCIS (Pre-surgery) and BRCA2 positive. I am I the midst of trying to schedule surgeries now. Had an appt with BS and GO. Have appt with PS on Monday. How long after our BMX did you have the hysterectomy?",
      "MessageIndex": 16,
      "PostDate": "10/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/787411",
      "Title": "Prophylactic hysterectomy/oopherectomy jessica749 howhm02l"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jul 19, 2012 11:32AM howhm02l wrote: I am not as nervous about the surgery itself or even the recovery.  I'm too focused on the final pahtology report.  My DCIS lesion is big - 8 cm x 3 cm x 2 cm, and even though the biolpsy revealed DCIS, stage 2, I'm afraid there's IDC in there as well.  I watched my mom go through chemo when I was 10, and I vividly remember how sick she was.  I think the fear of my children seeing me sick and being as worried as I was 30 years ago is stronger than the fear of me going through chemo myself - if that makes any sense.  I have not had trouble sleeping, but I have a cold so I've taken nyquil the past couple of nights . . . I must get back to work so I'm sorry I can't do personal hellos to everyone now - will stop in again tonight. Tazzy - thank you for the welcome.  Shabby - I am having BMX, and the right side is prophylactic.  My mom was diagnosed at 34, and her sister was 42.  I am 40.  I had decided when they came out with the genetic testing (in 1995, I think) that I would have BMX if I tested positive.  Unfortunately, DCIS was detected on MRI (confirmed with mammorgram and biopsy) before I was able to get the testing done!  I now know that I am BRAC2+ and did not blink at the decision to do BMX.  Although I have to admit that it would be a tougher decision if it were not for the DCIS diagnosis. Omeggo - I'm also planning to hit the gym pretty hard in the next month.  I want to try and be as fit (which is a LONG way off for me - I sit at a desk all day, every day) as possible before surgery, especially if they are able to do my DIEP 2 weeks after the BMX I think it helps with the healing process. Beckers - I LOVE the idea of renting the chair after my DIEP (assuming I do not need rads or chemo after BMX).  I wonder if they could/would take it up stairs to our bonus room . . .",
      "MessageIndex": 105,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jul 22, 2012 12:43PM howhm02l wrote: Hey August Ladies, I have been MIA for a few days - our beloved golden retriever we have had for 9 years had to be put to sleep yesterday. Seriously, now? The dog who so patiently sat with me constantly when I was on bed rest for weeks seven years ago. Seriously? I am so angry and sad! Thanks for letting me vent. I know it may seem trivial to be so upset about this in light of everything else, but it is heartbreaking, truly heartbreaking. Heather",
      "MessageIndex": 152,
      "PostDate": "22/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jul 26, 2012 08:41AM howhm02l wrote: Beckers - I had the same thought.  Vanderbilt, where I am being treated, has an online portal where all my reports, labs, etc. are posted.  I ehcked to make sure mine was clear - and it was . . . Tazzy - I am so glad you got you date.  Thoughts and prayers for you for next week!  Leah and Mcc - I am so sorry you have had to join us. Hard to believe August is almost here.  I think I'm just still in denial.  I'm starting to get concerned about the recovery - reading posts, etc.  It's a fine line between reading what is necessary to be prepared and crossing into information overload and complete hysteria!",
      "MessageIndex": 190,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 1, 2012 06:34PM howhm02l wrote: Marilyn - awesome news. You are an inspiration! Trinity - I am so sorry. Not something you need to have laid on you right now, at all. Damiana and Tazzy - warm thoughts and prayers for tomorrow. Beckers - I absolutely remember your concerns. I am with you in that I try to \"prepare\" myself for the worst so I am not surprised or caught off guard. As others have said, there are so many things that could cause a shadow or spot to appear on x-ray. A couple of weeks ago, I read a quotation from Michael J. Fox on this site: “Don’t spend a lot of time imagining worst-case scenario. It rarely goes down as you imagine it will, and if by some fluke it does, you will have lived it twice.” I am not a quotation sort of person and am not at all trying to minimize your concern, but I pass that along because it did help me think that my attempts at preparing myself do not accomplish much. I will be praying for a clean CT on Monday and for peace of mind as you wait.",
      "MessageIndex": 292,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 2, 2012 08:20PM howhm02l wrote: Trinity - I do not know about CT/ RI requirements, but you should be able to pick anyone for your power of attorney. There is likely a form online or in the state statutes. One thought-pick the person that you trust to do what YOU want them to do, someone who will follow your wishes, and not their own. If that is your SO, pick your SO.",
      "MessageIndex": 308,
      "PostDate": "02/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 13, 2012 04:54AM howhm02l wrote: Beckers - I have been looking for your post! Glad to hear you are doing well. OttowaMom - thank you! With my surgery coming up on Thursday, my anxiety is at a fever pitch.",
      "MessageIndex": 658,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 5, 2012 05:20PM howhm02l wrote: Just checking in quickly. We have been traveling for the past 2 days. Altough I had wanted to have my surgery in July, I am so happy we have been able to make this 12 hour trek to the beach. My kids were ecstatic when we got here! Welcome to our newest members! Old Navy has lots of button down sleeveless and short sleeve shirts now. Prayers for everyone with surgery dates tomorrow and prayers for continued healing for our trailblazers. Heather Heather",
      "MessageIndex": 375,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 20, 2012 12:55PM howhm02l wrote: Thank you all so much. You are all truly a blessing. Off to nap, now - and picture the big rocking chair. Heather P.S. June - I am in Nashville. My husband and I both went to Sewanee. Such a small world.",
      "MessageIndex": 889,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 20, 2012 02:29PM howhm02l wrote: Welcome Lisa. This is a great group. Leah - please keep us up to date. Shabby - I am so sorry you are feeling bad today. It does make me feel better knowing we are feeling the same - that it is normal. I do not have the TEs, but I hear they are bad. My BS is out this week, but she said one of the PAs would call with the pathology. I hear you on the scale - I know the huge breasts they removed must have weighed 8-10 pounds total, but I have not seen that . . . Is anyone else completely bloated? I was thick around the midsection before, but I look fairly pregnant now.",
      "MessageIndex": 893,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 28, 2012 01:58PM howhm02l wrote: Beckers and 301724 - how are you doing? I am going for DIEP on Thursday. Getting very anxious. 301724 - sorry about the DVT, and so so glad you mentioned it to the doctor!",
      "MessageIndex": 1103,
      "PostDate": "28/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Sep 2, 2012 05:31AM howhm02l wrote: Hey ladies - checking in from DIEP on Thurday. Surgery lasted about 11 hours. Still heavy pain meds so not yet able to read through posts. I hope you are all doing well.",
      "MessageIndex": 1217,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Sep 20, 2012 06:59PM howhm02l wrote: It is amazing how far we have come in the past month. I am 3 weeks post DIEP today and 5 weeks post BMX. In the past 2 days, i have had all sorts of tingling and itching. Is it nerve regeneration? Have you all felt that sort of tingling at all? It is in my new boobs, arm where SNB was done, tummy, etc. ARGH! Is there anything I can do for this? Tylenol? Thank you!",
      "MessageIndex": 1438,
      "PostDate": "20/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Sep 30, 2012 05:43PM howhm02l wrote: Just - I love the new photo! I hope the dizziness will subside soon. 301724 - when I sprung a leak the first time, it was like a flood. I used a maxipad, we'll several maxipads, over the leak. It drained slot for the first 12-24 hours. After that it slowed significantly, but it has been 2+ weeks since then and I still need a gauze for some drainage.",
      "MessageIndex": 1485,
      "PostDate": "30/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Oct 24, 2012 06:57AM howhm02l wrote: For all the ladies receiving chemo - you are in my constant thoughts and prayers.  I wish for minimal and SEs and strength for each of you. Melmcbee - I hate to hear all that you are going through with your family.  I will be praying for strength and peace. Waterpolomom - I was interested to read about you going back to work.  I have been working from home for the past few weeks, but am planning to go back into the office in a couple of weeks.  I'm nervous about it! Bras - I went to my local mastectomy shop to be fitted for an LE prevention sleeve, and the employee told me that any woman who has had breast cancer surgery receives 4 bras per year that must be covered by insurance.  Please go visit your local shop to be fitted! Help with Family Issue - I think most of you know that my mother passed away from BC at 38, when I was 14.  My dad remarried shortly thereafter, and for the past 27 years, my stepmother has been a complete nightmare - a bully, insecure, emotionally abusive, makes EVERY situation about herself, completely obsessed with us viewing her as \"our mother,\" which she is not.   Anyway, we had a big family blowup on Saturday (we all live within 15 minutes of each other) because she accused my sister and me of not thinking about her enough.  For example, she accused my sister of being selfish because my sister did not talk to her enough, hug her, etc. on the day of my BMX.  Seriously?  Accused my sister, who's mother, aunt, and sister all have had BC of not thinking about the stepmother the day of my BMX. Then, she accused me of not being thoughtful for not calling her enough and inviting her to do things. I told her I had been a little preoccupied because I have BC.  Her response, \"No, you don't - not anymore.\"  I understand that I had DCIS and that it was removed in my BMX, but in my mind, it will always be there due to the risk of recurrence (although I understand it is a small risk).  Plus, I'm BRCA positive so I have an ongoing increased risk of developing any number of ther cancers.  I guess it bothered me coming from her because given her background of sociopathic behavior, it was basically a statement that none of it ever happened - and a warning that it should never be mentioned again.  Thanks for letting me vent.  It really helps.",
      "MessageIndex": 1695,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jul 30, 2012 01:31PM howhm02l wrote: Argh - just need to vent!  Since I am BRCA2+, I have 25% risk for ovarian cancer.  I had an ultrasound on Friday to make sure everything was okay.  Planning to have a ooph and hysterectomy at some point once the BMX and reconstruction are behind me. I called the GO's office today to get results.  The nurse called back and said the report was on the doc's desk, that the doc was out of clinic this week, and that they would call me next Monday.  Seriously?  I asked if there was someone else who could review to give me the results, and she said no - it will be next Monday, at least.  Seriously?   I am on vacation next week at the beach.  I don't want to be waiting for a phone call. I do not have any family history of ovarian cancer so I'm not completely freaking out like I was after the breast testing, but it is my medical record.  It absolutely baffles me that I can't get a copy of it. ",
      "MessageIndex": 228,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 14, 2012 01:24PM howhm02l wrote: Shabby - yippee!  Now REST.  Cassie - So glad to hear it went well.  (BTW - I have a 4 year old daughter and 7 year old son.)  I got a call from the surgeon's office today seeing if I had questions, knew where to go, etc.  I cannot believe it will be over (at least this part) in 48 hours. Thoughts and prayers for our sisters tomorrow.",
      "MessageIndex": 694,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 16, 2012 04:27AM howhm02l wrote: On the way to the hospital. SNB injection at 7:00 a.m. YIKES!",
      "MessageIndex": 730,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Nov 17, 2012 06:24PM howhm02l wrote: August Sisters, I have been happy to read through your posts and catch up. I went back to work at the beginning of November so I have not been as able to check the boards. I am doing well. Going to PT for residual pain in left arm. Had some concerns about LE but those concerns seem to have resolved. Best news is that we made decision to cut off all contact with stepmother. Thank you all so much for your input and help dealing with that situation. I feel free from her, which is awesome! You are all in my daily prayers. I do not know how I would be making it through all of this without you. Heather",
      "MessageIndex": 1855,
      "PostDate": "17/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 8, 2012 07:07AM howhm02l wrote: Beckers - my PS wanted at least a week in between the BMX and DIEP to make sure I would not need radiaition. He wants to wait on the final pathology report. At first I was disappointed to think I will have two separate surgeries, but I think it is best under the circumstances with my large area of DCIS. Carrie- I am so sorry to hear about your childhood friend. Lisa - so glad to hear things went well. Omeggo - I am so glad to hear it is helping you. My worst memories of my mom's treatment are associated with Chemo. If my final pathology shows anything that requires chemo, I will most definitely be seeing a therapist-oncologist. For me, I think the wait between the surgery and that pathology will be overwhelming. August sisters - I have not had any trouble sleeping until this week, but my brain is on cancer and surgery overdrive. All I dream about is hospitals and surgery and treatment so needless to say I am not sleeping much at all. Hearing good reports from all of you is helping. Keep them coming! I do not know what I would do without all of you. Thank you so much for being here. Heather",
      "MessageIndex": 482,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 21, 2012 12:48PM howhm02l wrote: BS office just called with surgery pathology: no invasive disease, 9 cm of DCIS, clean nodes and clear margins. They are presenting to the tumor board tomorrow night and will call me back with any treatment recommendations. Maybe tamoxifen? We did not discuss, but I am assuming DIEP will proceed as scheduled next Thursday, 8/30! Heather",
      "MessageIndex": 922,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 26, 2012 10:08AM howhm02l wrote: Bjmarz - welcome. This is a great group. Very helpful in the tough times. Waiting on the pathology is one of the hardest parts. There must be something in the air. I am really struggling today. Beckers and Shabby, please know you are not alone! I also feel like I should be better than I am by now. The drains are driving me nuts. Surgery was 10 days ago but left side is still at 35 or 40 cc so not likely to be coming out before DIEP on Thursday. Argh - the thoughts of another r surgery just 4 days from now is enough to send me over the edge. Above my drains on my side I have 2 fairly large bumps (running the width of my sides) areas of swelling. No redness any where so I do not think it is infection. Seroma maybe? Just wondering if anyone else has had this? I have not had any post op appt because I have the next surgery this week. Final complaint - my chest and back muscles are so tight! Justine graciously emailed me her exercises because I was not given anything due to upcoming DIEP. I am hoping they will help. Thank you all so much for listening, being there, and helping. I feel better already just \"talking\" about it.",
      "MessageIndex": 1035,
      "PostDate": "26/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 11, 2012 07:13PM howhm02l wrote: Trail girl - so good to hear from you. Sorry about the recovery problems , but it sounds like things are moving in the right direction. Thoughts and prayers for our Monday warriors. I cannot believe Thursday is my day!",
      "MessageIndex": 625,
      "PostDate": "11/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 13, 2012 07:20PM howhm02l wrote: Summer - look at that precious baby! From what everyone has told me, this is the worst time with the waiting and uncertainty. It is totally fine to abe a pity party. There are wonderful women on the board. I feel honored to share with them. We have a mantra \"in six months, in six months.\". I know how hard it is now, but in six months we will be in a different place. We will be there for you as much as we can. Damiana - I am so sorry about the chemo experience today, especially when ou had begun feeling better. I think it is that sort of kick in the gut that is the hardest. I will have fleeting moments when I totally forget about BC, and then it hits me like a ton of bricks. Prayers for all of us.",
      "MessageIndex": 677,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 17, 2012 10:41AM howhm02l wrote: Checking in post BMX. I spent one night in surgery center and am no home! Surgeon said it went well. The took 4 nodes on left and all were clean. :). SNB injection did not hurt at all, which was pleasant surprise. Sore but on pain meds - lortab Some of you mentioned exercises? I did not get anything on that. Thank you all. You are making this so much more bearable. Heather",
      "MessageIndex": 777,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Sep 3, 2012 04:46PM howhm02l wrote: Beckers - I am still in he hospital. The nurse has said 48 hours of I hour lap checks, 48 hours of 2 hour flap checks, and another 48 Of 4 hour checks. That puts me in herem6 nights!!!!!!!! They are both still hard as bricks, but everpn keeps telling met is swelling, and they look great. I am just so frustrated.",
      "MessageIndex": 1249,
      "PostDate": "03/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 18, 2012 06:05AM howhm02l wrote: Mumtothree - I am so sorry you are slumping. When I think about how overwhelming all of this is , it is amazing we are not all slumping all the time. That is why we are here for you - to pick you up on the days you slump, knowing that you will do the same for us, when it is our day to be down. Thank you to everyone about the exercises, I will wait until the drains come out. Quick question for those of you who had SNB - how long has the numbness lasted under your arm? I had not really noticed it until I had an itch, and when I went to scratch, nothing - I could not feel a thing!",
      "MessageIndex": 796,
      "PostDate": "18/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jul 18, 2012 07:09PM howhm02l wrote: Is it too late to join? My surgery date was confirmed for August 16. Depending on final pathology and whether I will need any other treatment, my DIEP reconstruction is set for 8/30.",
      "MessageIndex": 95,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 19, 2012 08:02AM howhm02l wrote: Oh Cherrie - I am so sorry. The Pre-op stress has been the worst, and to have it without the surgery. I just feel for you. Please keep us updated. I showered today for the first time. Fabulous! I am still on hyrdocodone every 4 hours, it is not making too foggy - I don't think . . . . I feel much better than I thought I would, physically and mentally. I am anxious for the path report and just am hopeful that it will allow for the DIEP, which is tentatively scheduled for the 30th. I am getting a little more sore since some numbness is wearing off at the incision site. Still completely numb from about midway up the inside of my left arm down to the area where the drain comes out. It does not burn, for which I am grateful, but the numbness is more than annoying. Payers and thoughts for everyone waiting for path reports this week and for those of us going into surgery. Continue healing thoughts and payers for everyone. Heather",
      "MessageIndex": 835,
      "PostDate": "19/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 22, 2012 08:45PM howhm02l wrote: Oh Tazzy! I am ecstatic. It has been a good day, indeed.",
      "MessageIndex": 965,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Sep 29, 2012 06:06PM howhm02l wrote: 301724 - you need to catch a break! Is it a deep type whole or a surface looking? Does the oozing look like it is infected? I have a small area on the left incision underneath the breast that leaks an orangish fluid. On the right where my nipples will be, the stitches have dissolved, but the entire area of what will be aerola is essentially an open surface level wound. It looks good and pink so I believe it is healing. I keep wondering when I will be able to quit wearing gauze pads!!!",
      "MessageIndex": 1480,
      "PostDate": "29/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jul 31, 2012 09:03PM howhm02l wrote: I cannot believe tomorrow is August 1. Spent too much time watching the Olympics tonight so just a quick message. Good thoughts and prayers to everyone. To all of our new friends, I am so glad you are here. We have a wonderful mix of incredible women. This will be a bump in the rear view mirror - our mantra is \"in 6 months, in 6 months\" A couple of sites that have been helpful to me as as an, ahem, younger woman, facing this - I think 40 is young, isn't it, at least all my friends turning 40 say it is the new 30 - Anyway, www.brightpink.org is for young women with family history of breast and ovarian cancer and www.youngsurvival.org for women who are 40ish and younger at diagnosis.",
      "MessageIndex": 261,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 22, 2012 06:37PM howhm02l wrote: Thoughts and prayers for our 8/21 and 8/22 ladies. Moolean - I am so glad to hear it went well! Congrats to Shabby and everyone getting drains out! I am jealous. They definitely make getting dressed more difficult than I had anticipated. I am slowing but do not thnk it will happen this week. Tazzy, I hope they will pull them tomorrow. Carrie - I am so glad you had a good weekend with your daughter. I know that will be a tough decision. 301724 and Beckers - I am scheduled for DIEP next Thursday. My path report over the phone said clean margins. I,am hoping enough of a margin so rads are not necessary. It's getting hard to imagine another surgery next week! I am sorry to have been MIA except or a quick post about path reports. Struggling with the SNB arm pain - like tiny little daggers stabbing map and down my left arm. I thought I would try to wean off some pain meds, which as a complete disaster yesterday! I am still trying to catch up today. My bedside table is a mess - books , magazines, chargers for my phone and iPad, cups, etc.",
      "MessageIndex": 957,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Oct 10, 2012 07:08AM howhm02l wrote: Nbnotes - I was crushed to read your news.  Please know that I am praying for you.  Love the photo! ",
      "MessageIndex": 1540,
      "PostDate": "10/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 26, 2012 12:26PM howhm02l wrote: Shabby - please add my DIEP to the schedule for Thursday, 8/30 if you have a chance. We need an administrative assistant to keep up with all if us! Thank you.",
      "MessageIndex": 1041,
      "PostDate": "26/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 27, 2012 01:12PM howhm02l wrote: I just returned from nurse appt at the Breast Center where 1 drain was pulled! It did not hurt at all, but thanks to Justine's advice, I had taken a hydrocodone. I still have the one on the left, which is the one that I really dislike. That one will remain and will likely just be replaced by a new one on Thursday. Then I will have 4 drains, yeah for me. :( Beckers - yes, DIEP is Thursday! I cannot believe it. Not excited to go through another huge surgery so soon, but I am glad we waited for the pathology report.",
      "MessageIndex": 1072,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 7, 2012 06:50PM howhm02l wrote: Beckers - I am so glad the CT was clean. I know how worried you were. Omeggo - I am so glad you are making progress in therapy. I have never done therapy, not even when my mom died from BC when I was 14. I have thought that I would probably benefit greatly from it. Welcome to our new group members. Warm thoughts and prayers to everyone who goes in on the 8th! Heather",
      "MessageIndex": 464,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Sep 3, 2012 01:20PM howhm02l wrote: Quick question. - I will read through all the posts I have missed in the next few days when I get out of hospital. I am now 4 days post DIEP. My chest is really swollen and tight Feels like what some of you have described with TE. Foobs are pretty hard. Just wondered if anyone has insight? Thanks, Heather",
      "MessageIndex": 1244,
      "PostDate": "03/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 8, 2012 06:34PM howhm02l wrote: I just know I will sleep well with all of your advice, thoughts, and prayers. Hugs to everyone!",
      "MessageIndex": 510,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Sep 3, 2012 06:52PM howhm02l wrote: Thank you Rebecca - these pain meds ate a doozie. Just read my previous post, and it was a little comprehensible! Will be here 6 nights. Doing much better with tightness. One day at a time. Thanks to all of you.",
      "MessageIndex": 1253,
      "PostDate": "03/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Sep 11, 2012 06:18PM howhm02l wrote: Beckers - I am sorry you are feeling down. This DIEP recovery is rough. I joke that I feel fine as long as I don't move. Seriously, I know I need to get moving more. I putter around the house, but have not ventured out in the 6 days I have been home. I had 3 of 4 drains removed today, which I think will be a big boost. I have the followup with the PS next Monday and hope to have final drain removed then. Then, I will really focus on increasing movement and range of motion in my SNB arm.",
      "MessageIndex": 1378,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Sep 13, 2012 05:32PM howhm02l wrote: Hello August Friends - it is hard to believe it is mid-September. My birthday is next week,and I will be 41. My mother was only 38 when breast cancer took her life. I am so thankful to have had all of you to get me through this month. I cannot thank you enough.",
      "MessageIndex": 1394,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Sep 26, 2012 08:33PM howhm02l wrote: Nbnotes - you are in my prayers.",
      "MessageIndex": 1476,
      "PostDate": "26/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 20, 2012 12:37PM howhm02l wrote: Numbness is wearing off, and discomfort is setting in. I am now 4 days out from BMX and left SNB. I feel pretty yucky today. Left side in particular. Feels like I have something tightly wrapped under my left arm, but there is nothing there. itches that I cannot scratch, etc. I am trying not to be too consumed with waiting for my pathology results, whochcould come on wednesday. Maybe that's why I feel worse today? Still taking the pain meds every 4 hours but definitely feel worse than I have since the surgery. Sorry for the pity party. I am having one of those days.",
      "MessageIndex": 884,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Oct 8, 2012 06:46PM howhm02l wrote: 301724 - glad to hear things are going well. It is definitely a process. I met with PS today for second post op. He said everything looks great. Wants to wait until my open wounds heal (where stitches dissolved) before scheduling Stage II. He thinks all we will need to do at Stage II is niple construction and a little lipo on the side of each beast to remove some excess tissue. Right now there is a triangular bump on the outside of each breast, but otherwise the girls look good now! Great cleavage and very soft. Best news though is he agreed that I can have ooph during the same surgery. Is it possible I cold have just one day surgery left in this journey? I hope you are all doing well.",
      "MessageIndex": 1514,
      "PostDate": "08/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 23, 2012 08:26PM howhm02l wrote: I LOATHE these damn drains. One of the bulbs opened and leaked all over me during dinner - nice. It will be Monday before I can even call about getting them out. They said 3 days of 25-30, and I have had 1 day. Thank y'all (I am from TN, after all) for letting me vent. Omeggo - I am so sorry you did not get the path results you wanted. We will do everything we can to lift you up. Shabby - we are not finished with August yet. Please add me to the schedule for 8/30 for my bliateral DIEP. I am really having trouble getting geared up for another surgery and recovery.",
      "MessageIndex": 1003,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 26, 2012 12:29PM howhm02l wrote: Jmemama - welcome! I have a 4 year old and a seven year old. Hats off to you for homeschooling! My kids have been great with my recovery from the BMX on the 16th. Very gentle with me.",
      "MessageIndex": 1042,
      "PostDate": "26/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Oct 22, 2012 05:40PM howhm02l wrote: Loved it, Just! What an incredible family.",
      "MessageIndex": 1675,
      "PostDate": "22/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 28, 2012 07:01PM howhm02l wrote: Thank you, Beckers and 301724. Your experience has really been helpful to me. Welcome j-bug. I had not thought about that as an issue. I had a -section 4 years ago, and do not recall that it was a problem, but I know this is different. I do recall having a squirt/wash bottle that was very helpful with the c-section. I had BMX on 8/16 and am scheduled for DIEP on Thursday, 8/30. I am also 40. Cottontail - best wishes. I will be praying for you. We go the same day. Deader - welcome! I share your thoughts on the drains - absolute loathe them. I still have 1 from my BMX on the 16th and will be getting 4 drains again on Thursday when I have DIEP reconstruction. Ugh!",
      "MessageIndex": 1111,
      "PostDate": "28/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Oct 25, 2012 07:18AM howhm02l wrote: Thank you all so much! It helps to vent and definitely helps for others to confirm that stepmonster is totally out of line. Beckers - it was the mastectomy shop that told me about the bras. They said anyone who has had cancer or BRCA related breast surgery is eligible. The bras they sell do have the pocket, but it was not noticeable. There were some really pretty ones that seemed very supportive without wire. I went to get measured for sleeve yesterday for prevention. Left arm measures between 1/2 and 1 cm larger so I am going for LE screening today. Do you ever feel like it is all never ending!?!",
      "MessageIndex": 1708,
      "PostDate": "25/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Sep 7, 2012 05:46AM howhm02l wrote: Cottontail - YES!!!!!!! I am one week post Bilateral DIEP, and the most painful part of my body is my upper left drain. It pulls and stings and sends shooting pains all down my left side. All the service providers say it looks fine, but I know something is going on. Thank you for your post. I know I am not alone! And if you find any miracle cure,please pass along. I have been home for 2 days now. 7 nights in the hosptial was just brutal - all the poking and prodding. I feel better every day. I know I will really feel better once I get these 4 drains out. I have a follow up apt with my BS on Tuesday, and hope she will give give the okay to remove them and does dot want to defer to PS.",
      "MessageIndex": 1328,
      "PostDate": "07/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Oct 9, 2012 01:40PM howhm02l wrote: So good to hear from folks today - you have all been so important to me. Even if we are not posting as much, I know we think of each other often. Beckers - my tummy is pretty flat, which has made me notice my thighs, hips, and back! :)",
      "MessageIndex": 1523,
      "PostDate": "09/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Oct 15, 2012 07:29PM howhm02l wrote: Beckers- I am with you! All sorts of itching in numb areas. It is really driving me nuts! Gma- I will try the hydrocortisone for this annoying itching. I am working a bit from home but am hesitant to go into the office for fear of springing a leak that I am unaware of because I am numb in all the areas that would leak! I worry I would not notice it until I was covered in fluid.",
      "MessageIndex": 1606,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jul 22, 2012 04:56PM howhm02l wrote: Thank you all so much for your kind words and hugs! Shabby - I had my Pre-op visit last week. They did a chest X-ray, EKG, drew 3 vials of blood, and did a complete medical history. I hope that helps. Prayes and good thoughts!!!",
      "MessageIndex": 161,
      "PostDate": "22/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jul 24, 2012 06:47PM howhm02l wrote: Marilyn - I got excited for you as I raed your post. My chest has got bigger with each child, and I have to admit that I am looking forward to something much smaller. I am just hopeful that my reconstruction can come sooner rather than later depending on the pathology. Why did you have a mammogram last week, just curious? Omeggo and Shabby - I was planning to step up my gym efforts -(from 3 to 5 days each week) to assist with recovery, but my precious 4 year old graciously shared her cold, and the congestion and cough have completely wiped me out. I have to admit that I have not thought too much about the 16th. Like Sahbby, I am worried most about the following week and the pathology results. Now, I am trying to get things wrapped up at work, we go on vacation to the beach the week of the 5th, school starts soon, etc. I am very grateful to have those distractions. I think it helps makes the time pass by more quickly. Plus, because I am BRCA2+ and have an increased risk for Ovarian cancer, I have an ultrasound on Friday to make sure all is well there. The gynecological oncologist has recommended that ovaries, tubes, uterus, and cervix all come out once the beast cancer issue is under control. The BMX is not as scary to me as removing everything else. I am only 40 (never thought I would say that!) and fear menopause and the loss of sex drive. No one in my family has ever had ovarian cancer so I don't fear it as much as I have always feared breast cancer, but since there are no symptoms and no wall way to screen, I do not feel like I can risk waiting too long. Thinking good thoughts for us as August approaches, Heather",
      "MessageIndex": 175,
      "PostDate": "24/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jul 31, 2012 06:16AM howhm02l wrote: Tomorrow is August 1 - I cannot believe it.  Quick update on the pelvic ultrasound - a good friend is a family medicine doctor.  I called and had him added as a treating physician so they faxed him the ultrasound results.  Ovaries look good! At least I can cross that off the list of worries for now.  I also asked by BS to refer me to a different GO.  When I went to the first GO, who is supposed to be the best in town, she did an exam, ordered the ultrasound and blood test, and said if you are finished with your family, we need to take everything out - call her office to schedule as early as 6 weeks after the BMX and reconstruction.  No discussion of risk of developing ovarian cancer (other than the 25% that is tied to the BRCA2+ positive status), no discussion of family history - no one in my family has had ovarian cancer, no discussion of side effects related to ovary removal since I'm (only) 40, the fact that I'm surely not a candidate for any HRT due to BRCA2+ status even if I am having BMX.  Don't get me wrong - I know I don't want to mess with ovarian cancer because it is completely silent, and I know that ooph is the best method of preventing.  I just want to know what I'm getting into by having ANOTHER surgery - as if the two major surgeries I have scheduled for August (BMX on 8/16 and DIEP on 8/30) aren't enough already.  Thank you all so much for letting me talk through this! Onelife - Welcome.  This is a fabulous group of women.",
      "MessageIndex": 236,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 6, 2012 11:02AM howhm02l wrote: Market - glad to hear things went well! Just - I love the image of your dad sewing zippers onto tanks. :) Funny thing happened this morning-you may remember last week when the GO office would not give me ovarian ultrasound results because the doc was out of the office. Anyway the nurse called this morning to tell me the results were fine. The funny part was when she said she was calling from Dr. Williams' office, and I had to think, - now which one is that? Ha! You know you are a cancer patient when ou cannot keep all your doctors straight. Heather",
      "MessageIndex": 398,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jul 26, 2012 07:44PM howhm02l wrote: So much wisdom on this board tonight. Thank you all so much. I truly feel blessed to have you all in my life to help put everything in perspective. Trinity - I am so sorry about your mom! Leah - I think it is wonderful that you are participating in the clinical research programs. It is only because of research that we face the positive outlook we have today in comparison to what my mother faced 20 years ago. I am BRCA2+ so in addition to the BMX, I am also looking at an ooph soon. I am 40, and I am concerned about the early menopause. I think I am more attached to my ovaries than my breasts! I have a vaginal ultrasound tomorrow just to make sure there is not anything happening with the ovaries. Now as I go to bed, I will repeat the Marilyn and Tazzy mantra - in 6 months, in 6 months.",
      "MessageIndex": 200,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jul 30, 2012 09:11AM howhm02l wrote: Prayers for everyone with surgery this week - we are there with you!",
      "MessageIndex": 226,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 28, 2012 08:59AM howhm02l wrote: My mom died from BC when I was 14. I ally's wished that she had written letters to me for special times, birthdays, wedding, birth of my children, etc. because I always miss her so much then. I also wish my brother and sister, who were younger, had more to hold on to. They do not remember much about her. I think the journal jeijk described would have been great for me.",
      "MessageIndex": 11,
      "PostDate": "28/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792649",
      "Title": "What should I be doing for my young children 4myangels momto2angels"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "howhm02l wrote: My mother was diagnosed at 34 and passed away at 38. Her sister was diagnosed at 42 - survivor. I turned 40 about six months ago. Went in for regular screening MRI on 6/15. Had a clean mammogram in September. MRI Radiology report shows clumped non- mass like enhancement 5 cm x 4 cm x 2 cm with mixed kinetics including rapid washout. Bi-Rad of 4. I have a biopsy scheduled for 6/26. I had blood drawn for BRCA test on 6/21. I am scared. Thank you. Dx 6/28/2012, DCIS, 6cm+, Stage 0, Grade 2, 0/4 nodes Surgery 8/16/2012 Mastectomy: Left, Right Surgery 8/30/2012 Reconstruction (left): DIEP flap; Reconstruction (right): DIEP flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/789618",
      "Title": "Biopsy On Tuesday and Waiting for BCRA results howhm02l howhm02l"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 13, 2012 12:57AM howhm02l wrote: This is a fascinating post. I was just diagnosed at 40. I am BRCA2+. My mother was 34, and her sister was 42 (it was not until I was diagnosed that I learned she was 42- I had always thought she was post- menopausal). Anyway, I am interested in how many women who were younger than 40 had a family history and whether the BRCA test had been recommended prior to your diagnosis. Even with my positive BRCA2 test, my DCIS diagnosis, and out mother and aunt's BC, my sister's ob/gym office was completely clueless in how to get her tested. They still haven't figured out how to ask for \"short form\" test to see if she is positive for my mutation. I had the genetic counseling a few years ago and just had not done the testing yet in part out of concern that the results would make me uninsurable. I know I am fortunate that a routine MRI caught my tumor at the DCIS stage, and I had the MRI done as part of my routine screens. I have had mammograms since I was 24. I wonder how many people with family history are being told about BRCA testing by their regular ob/gyns? I know that my daughter, who is now only 4 years old, will need to get tested at some point, maybe 18? I am sorry for the rambling - thanks for listening.",
      "MessageIndex": 843,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Aug 13, 2012 04:45PM howhm02l wrote: Kam170 - Thanks for the response - it just astounds me!  I understand that BRCA cancers make up only a relatively small percentage of BC, but if you knew you could eliminate it or at least greatly diminish it in that population, why would you not recommend testing?  The genetics counselor I met with a few years ago asked the same thing, what would you do differently - I think it is nearly impossible to answer that question in the abstract.  My sister has a friend who's mother AND grandmother had BC and no one has even suggested that she see a geneticist.   I did not necessarily mean to limit requests to people 40 and under - sorry it read that way.  I included that only because 40 has been the age when they recommend mammo so if you are not having them before then and have one of the BRCA genes unknowingly then you would be completely in the dark until you find a lump.   I hope your GF never has to face this.",
      "MessageIndex": 848,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jul 31, 2012 11:51PM howhm02l wrote: Totally worth a few bad days! When I think about the changes and advances in the past 30 years since my mom was diagnosed - just imagine what can happen in the next 30. Thank you all. I feel so fortunate to have found this group of strong women.",
      "MessageIndex": 7,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/791371",
      "Title": "Need support having a pbmx on August 8th and I am scared Pointvalue camillegal"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jul 31, 2012 04:01PM howhm02l wrote: Elise - I am BRCA2+ (was tested right before biopsy) and lost my mother to breast cancer when I was 14, and she was 38.  I ache with you for my mother, for my daughter, who is only 4 years old, and for my sister who is about to be tested for BRCA at 36.  The hardest part for me about all of this has been reliving the four years my mom was sick from when I was 10-14.  I have days that I am that terrified 10 year old all over again. I think you and Shabby are so brave to have a PBMX.  In a way I feel like my decision has been somewhat easier because I do have DCIS in the left. The ooph that has been recommended has been tougher because my ovaries, at least for now, \"look great\" on ultrasound. I fear the recovery from the BMX (8/16) and reconstruction (8/30) and the pathology report, but I know that I am fortunate that it has been caught so early in me.  I just hope that by the time my daughter is old enough to be tested for BRCA, they will have figured out a way to fix that genetic mutuation so that she won't be faced with testing and biopsy and surgery and pathology and all the waiting in between. ",
      "MessageIndex": 4,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/791371",
      "Title": "Need support having a pbmx on August 8th and I am scared Pointvalue camillegal"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Sep 26, 2012 04:11PM howhm02l wrote: I am 41. I had a routine screening MRI in June due to family history. My MRI had an area of non-mass enhancement that did turn out to be DCIS. I was able to have stereotactic biopsy. During the mammogram for the biopsy, there were extensive calcifications, which had not appeared on a mammogram just 9 months before - CRAZY, I know. It may be worth a second opinion from another radiologist. Best of luck.",
      "MessageIndex": 1,
      "PostDate": "26/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/794061",
      "Title": "to wait 6 months or not....... RachelS RachelS"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jun 25, 2012 10:35PM howhm02l wrote: Thank you so much. I will post an update.",
      "MessageIndex": 3,
      "PostDate": "25/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789658",
      "Title": "Biopsy Tomorrow - Strong Family History - Scared howhm02l Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jun 26, 2012 05:14PM howhm02l wrote: Update - they did a mammogram this morning and were able to see calcifications in the area identified in the MRI. This allowed them to do a stereotactic biopsy instead of MRI biopsy. The doctor was concerned about the size of the area because I had a mammogram in September, which was clear. He said statistically, my films would point toward DCIS. He expects pathology report by Friday. BDavis - I had blood drawn last week for BRAC testing. They said it would be 2-3 weeks. Thank you all. I will post when I get path results.",
      "MessageIndex": 5,
      "PostDate": "26/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789658",
      "Title": "Biopsy Tomorrow - Strong Family History - Scared howhm02l Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "howhm02l wrote: I have a biopsy scheduled for tomorrow, Tuesday, 6/26. MRI radiology report (MRI was scheudled due to strong family history - no lumps, etc.) shows clumped non-mass like enhancement 5 cm x 4 cm x 2 cm with mixed kinetics including rapid washout. Bi-Rad of 4.   Live in Nashville so going to Vanderbilt Breast Center. I have talked to a breast radiolgist friend who explained the conern is DCIS, possibly IDC due to large size and rapid washout. My mother was diagnosed at 34 and passed away at 38. Her sister was diagnosed at 42 - survivor. I turned 40 about six months ago, and I'm terrified for my husband and my two small children. I would welcome any advice, thoughts, prayers, etc.  Thank you. Dx 6/28/2012, DCIS, 6cm+, Stage 0, Grade 2, 0/4 nodes Surgery 8/16/2012 Mastectomy: Left, Right Surgery 8/30/2012 Reconstruction (left): DIEP flap; Reconstruction (right): DIEP flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789658",
      "Title": "Biopsy Tomorrow - Strong Family History - Scared howhm02l Beckers"
    },
    {
      "AuthorID": "howhm02l",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154872/profile",
      "Content": "Jun 28, 2012 03:50PM howhm02l wrote: I recieved the biopsy results today - DCIS intermediate grade - non-invasive.  The radiologist who performed the biopsy and reviewed the mammograms from Tuesday said the area is larger than it was on the MRI two weeks ago when it measured 5 cm x 4 cm x 2 cm. I appreciate the advice regarding waiting for BRCA results before making decisions.  I had decided years ago that at the first hint of any problem I would have BMX.   I have an appointment with the surgeon on Monday.   Thank you all!  Support and understanding are incredible.",
      "MessageIndex": 9,
      "PostDate": "28/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789658",
      "Title": "Biopsy Tomorrow - Strong Family History - Scared howhm02l Beckers"
    }
  ]
}