{
  "AuthorID": "hsant",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105465/profile",
  "Posts": [
    {
      "AuthorID": "hsant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105465/profile",
      "Content": "Sep 25, 2016 01:02PM hsant wrote: I had my surgery in Los Angeles at Cedar Sinai. My surgeon is Dr. Scott Karlen and my oncologist is dr. Michael Van Scoy Mosher. They are both excellent doctors",
      "MessageIndex": 2,
      "PostDate": "25/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/848362",
      "Title": "How to find community in LA area? SandysAunty jpBCfree"
    },
    {
      "AuthorID": "hsant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105465/profile",
      "Content": "Aug 28, 2016 07:56AM hsant wrote: My BS strongly recommended that I meet with PS before making my final decision to go flat. I was very clear about my decision and declined. I absolutely agree with poster who said to get it in writing that patient requests no extra skin or fat, because future reconstruction won't be necessary. My BS put my request to be \"completely flat\" in writing on his own. He was obviously protecting himself in case I changed my mind at some point. I think in the case of my BS, he's been practicing for over 30 years, and has seen women change their mind in his experience.",
      "MessageIndex": 14,
      "PostDate": "28/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/847319",
      "Title": "Surgeon doesn't believe me ... christmas718 radgal"
    },
    {
      "AuthorID": "hsant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105465/profile",
      "Content": "Aug 28, 2016 07:59AM hsant wrote: I also highly recommend showing your BS a photo of what you want to look like after surgery. You can find numerous pics on the Internet. Also, requests photos of his work on women who opted out of reconstruction",
      "MessageIndex": 15,
      "PostDate": "28/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/847319",
      "Title": "Surgeon doesn't believe me ... christmas718 radgal"
    },
    {
      "AuthorID": "hsant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105465/profile",
      "Content": "Jul 8, 2016 06:17PM hsant wrote: I was told my results over the phone from my BS, and my MO. I think it's good that you've inquired about this,because mistakes are made, even in the best facilities.",
      "MessageIndex": 34,
      "PostDate": "08/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/842209",
      "Title": "Oncotype DX results are in... Nachout818 Lisey"
    },
    {
      "AuthorID": "hsant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105465/profile",
      "Content": "Jul 8, 2016 05:46PM hsant wrote: Dara, 4 1/2 weeks seems awfully long for oncotype results. I was told it would take 2 weeks, but it ended up only taking one week. This was a year ago. The BRCA results took a lot longer. I think it was around 8 weeks before I got my results",
      "MessageIndex": 32,
      "PostDate": "08/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/842209",
      "Title": "Oncotype DX results are in... Nachout818 Lisey"
    },
    {
      "AuthorID": "hsant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105465/profile",
      "Content": "Jul 26, 2016 08:56AM hsant wrote: Karen, I am so, so sorry for your loss. I lost my mother to breast cancer 11 years ago, and I miss her everyday. My prayers are with you and your family during this difficult time",
      "MessageIndex": 1,
      "PostDate": "26/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846333",
      "Title": "My mom has passed Alphabet RonnieKay"
    },
    {
      "AuthorID": "hsant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105465/profile",
      "Content": "Jul 2, 2016 05:34AM hsant wrote: AnnieMae, you should absolutely be able to meet with the anesthesiologist the day of your surgery. As far as I'm concerned, the anesthesiologist is just as important as the surgeon. I had minor surgery when I was 19, and I felt so sick after that surgery I was terrified that I would feel the same way or worse after my BMX. I am also sensitive to medications. Most antibiotics make me extremely nauseous, and I'm allergic to a couple of them. I took Codeine once for a toothache, and I had a horrible allergic reaction to it. I told my anesthesiologist all of my concerns and spared no details with respect to my history and experiences with meds. He was fantastic. He had an anti nausea med attached to my IV in case I felt sick when I woke after surgery. And I did for about 5 seconds when I woke, but the nurse released the med and the nausea dissipated immediately. When I had surgery to clear the margins, that anesthesiologist put an antinausea patch on me before surgery. You may want to inquire about this to the doctor. Wishing you the best for an easy surgery and fast recovery!",
      "MessageIndex": 20,
      "PostDate": "02/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/845415",
      "Title": "Good news / bad news AnnieMae bethanygb1"
    },
    {
      "AuthorID": "hsant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105465/profile",
      "Content": "Mar 31, 2016 03:49PM hsant wrote: Tjay, I think all Oncs have different methods. I get my TM's checked every 3 months, and I was prescribed Tamoxifen for 10 years",
      "MessageIndex": 4,
      "PostDate": "31/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/842632",
      "Title": "Blood Test tjay wallycat"
    },
    {
      "AuthorID": "hsant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105465/profile",
      "Content": "Mar 31, 2016 09:39PM hsant wrote: It's checked through your blood. Some oncologists don't do this, because there's a question with respect to the accuracy. You mentioned that your MO checks your blood every year. He could be checking your markers.",
      "MessageIndex": 6,
      "PostDate": "31/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/842632",
      "Title": "Blood Test tjay wallycat"
    },
    {
      "AuthorID": "hsant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105465/profile",
      "Content": "Apr 1, 2016 08:27AM hsant wrote: I would ask your doc about doing a CA 27.29 or CA 15-3 to check your TMs. However, based on what I've read on this forum, this isn't common practice. When my sister was diagnosed with early stage bc over 20 years ago, MRIs, scans, Checking TMs were common practice. I'm not sure why this is no longer the case. When she was diagnosed with liver mets, she didn't have any physical symptoms. It was found through a routine scan. I was the same way when I was diagnosed last spring. I had personal issues that overshadowed my cancer diagnosis. I knew I wanted a BMX, but otherwise, I was satisfied with an oncotype score of 16, and a 5% risk of recurrence. Recently, I've become more curious about certain aspects of my path report. I'm also curious about the CEA test, which measures the amount of CEA protein which may appear in ones blood. I have an appt. with my onc. next week to get my chest wall and TMs checked, and I've made a list of questions that really should've been addressed last summer.",
      "MessageIndex": 8,
      "PostDate": "01/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/842632",
      "Title": "Blood Test tjay wallycat"
    },
    {
      "AuthorID": "hsant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105465/profile",
      "Content": "May 8, 2016 09:42PM - edited May 9, 2016 02:13AM by hsant It was \"real\" for me as soon as I got the call that there were \"areas of concern\" on a routine mammogram. I have a strong family history. I lost my mom and sister to breast cancer, and my paternal grandmother was a breast cancer survivor. So, regardless of what the radiologist said (80% is benign), I knew this was not the case for lil ole me. When I found out it was DCIS, I was grateful. Yay! That's not \"real\" cancer. I'm not swimming in the pink ribbon pool. I'm just tipping my big toe into the water. I opted for a BMX, and pathology found IDC, 1.5 cm. That's when it became really real.",
      "MessageIndex": 6,
      "PostDate": "08/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/844094",
      "Title": "When does it become \"real?\" Addlantan Shirlann45"
    },
    {
      "AuthorID": "hsant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105465/profile",
      "Content": "Feb 28, 2016 07:02AM hsant wrote: I opted for a BMX (no recon) for a couple of reasons. 1. Although I tested brca negative, I have a strong family history (mother, sister, paternal grandmother). 2. I wanted to avoid radiation. I'm very happy with my decision, but it's personal. If you have the option between a lumpectomy, UNX or BMX, there is no right or wrong choice",
      "MessageIndex": 17,
      "PostDate": "28/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/841483",
      "Title": "after diagnosis Supportive hsant"
    },
    {
      "AuthorID": "hsant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105465/profile",
      "Content": "Nov 22, 2015 08:43AM hsant wrote: I was diagnosed with DCIS, with a possible borderline invasion of 1mm. I opted to get a bilateral mastectomy (no reconstruction), because of my strong family history. Pathology found a 1.5 cm invasive tumor that went completely undetected by mammograms, ultra sounds, etc. I had a second surgery to clear the margins, but I can't help thinking that if I opted for a lumpectomy, that tumor would still be in me",
      "MessageIndex": 4,
      "PostDate": "22/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/836389",
      "Title": "Was stage 1....second lump found in mastectomy.... hughesy84 dtad"
    }
  ]
}