{
  "AuthorID": "HSMOM2011",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136961/profile",
  "Posts": [
    {
      "AuthorID": "HSMOM2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136961/profile",
      "Content": "Oct 2, 2011 05:31PM HSMOM2011 wrote: Thanks so much everyone for the support and encouragement.  My husband will be going with me to all the appts.  If for some reason he is unable to come, my daughter will come with me. I have written some questions down to take to the dr. tomorrow.  Dh (dear husband) will be bringing a notebook to each appt. to take notes, and he also has it when talking to a doctor's office on the phone.  We're also starting a three ring binder for pathology reports, bills, insurance info, etc. Today I went and bought some post surgery clothing that will be very comfortable for at home and going back and forth to the doctor.  The clothing has room for bandages, etc., and the shirts button up the front. I've been reading the boards and a couple of books to get ideas of what to expect so we can be as prepared as possible for surgery and afterwards.  I know there will be plenty of \"unknowns\" along the way, but I want to do what I can to prepare now. It's scary, but at the same time I feel like everything will be okay.  Dh and I both have a very strong faith in God, and know He is there with us everyday. Thanks again.  I'm so glad I found this board.",
      "MessageIndex": 8,
      "PostDate": "02/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/775711",
      "Title": "Diagnosed yesterday HSMOM2011 elimar"
    },
    {
      "AuthorID": "HSMOM2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136961/profile",
      "Content": "HSMOM2011 wrote: I'm new here and am so glad to have found this forum.  Had a screening mammography 2 and 1/2 weeks ago.  Was called back in for a diagnostic mammography and ultrasound.  Then was asked to go in for an ultrasound needle biopsy.  The radiologist called yesterday and told me I have  cancer.  I have to say that everyone I've seen has been very supportive so far. My husband and I have an appt. with our internist next week, and we have also called the office of the surgeon recommended to us to make an appt. The radiologist said that the cancer is in the early stages.  The shock is beginning to wear off a bit, and I'm trying to learn everything I can, but still feel a bit dazed by it all.  We'll ask for the pathology report when we see our doctor next week.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/775711",
      "Title": "Diagnosed yesterday HSMOM2011 elimar"
    },
    {
      "AuthorID": "HSMOM2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136961/profile",
      "Content": "Sep 30, 2011 07:32AM HSMOM2011 wrote: Thanks so much for the support.  Will be starting the rounds of doctor visits next week. ",
      "MessageIndex": 3,
      "PostDate": "30/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/775711",
      "Title": "Diagnosed yesterday HSMOM2011 elimar"
    }
  ]
}