{
  "AuthorID": "husker",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218379/profile",
  "Posts": [
    {
      "AuthorID": "husker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218379/profile",
      "Content": "Jan 21, 2016 10:19AM husker wrote: I have just completed 6 rounds about 1 month ago but will continue on with Herceptin until August because I am HER2+. It sounds like what I'm experiencing is fairly typical. Because I am on Herceptin which can challenge your heart, I receive echocardiograms every 3 months and everything is working perfectly there so we know the swelling and water retention is not cardiac related. My MO is not crazy about diuretics - neither am I, don't need one more drug entering my body, but if I have to go to that I will, he is leaving it up to me to decide based on my tolerance. For now I think I will focus on the physical therapy to help move the water out, drink more water so that I am not dehydrated and inadvertently storing it, and have some patience. :)",
      "MessageIndex": 5,
      "PostDate": "21/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/840525",
      "Title": "Water retention after steroids and chemo husker Binney4"
    },
    {
      "AuthorID": "husker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218379/profile",
      "Content": "husker wrote: I didn't have lymph nodes removed so my water retention is not due to that but significant nevertheless. I gained about 14 lbs and my legs and arms are so puffy I look like the Pillsbury Dough Boy!!! My doctor keeps saying this is from Taxotere and Steroids and will go away in time, but my skin actually hurts its stretched so tight and it hurts to walk or move my arms. My feet look like I have baseballs around my ankles. I've read I should keep my feet up then I read that I need to do exercise to move the fluid. Which is it? Does anyone else have this problem? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/840525",
      "Title": "Water retention after steroids and chemo husker Binney4"
    },
    {
      "AuthorID": "husker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218379/profile",
      "Content": "Jan 22, 2016 10:14AM husker wrote: Thanks SpecialK I feel better just knowing I'm not alone. I have an appointment next week and will discuss options with my doc. ",
      "MessageIndex": 7,
      "PostDate": "22/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/840525",
      "Title": "Water retention after steroids and chemo husker Binney4"
    }
  ]
}