{
  "AuthorID": "Huskerkkc",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
  "Posts": [
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 8, 2011 07:43AM Huskerkkc wrote: lrw...I changed rad doctors and while it was very upsetting and I am now driving 95 miles one way for daily treatment instead of 25 miles, I am glad I did. Unfortunatley I had already done the mapping, simulation and tatoos, but had not started first treatment. then decided i could not go back, even though he is the only RO in town. He was so unprofessional, even if I did only see him weekly.  Got a referral to a new RO and got new simulation, mapping, but these tatoos are black light, so are not visible until they put a special pen light to my chest. I started my first rad on Wed. Yesterday they told me the rad doc hires a massage therapist to come in weekly, so after my appointment I got a very nice 15 min chair massage. She was very careful to ask what kind of cancer I had, where, if I had nodes removed, and then used less pressure on that side and used a motion that moves the lymph fluids the right way. She is specially trained to treat chemo/rad patients. I will seriously consider going to her spa and paying for a full hour treatment. I want someone who KNOWS what they are doing.  It's not too late for you to find someone you trust. It is not unreasonable to have anti-anxiety drugs. I would venture that 80% or more of the women here take (or have taken) an anti-anxiety, anti-depression, and a sleep aid! One ativan is not going to cut it. See if your center or clinic has a social worker and enlist his/her help.  ",
      "MessageIndex": 145,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jun 30, 2011 09:43PM Huskerkkc wrote: I am being screened for the Canadian protocol but not sure of the criteria. Looking that up now! If I fit eligibility, it will be shorter (but more intense) treatments-21 with 5 boosts, I think? Otherwise, I will have 28 treatments with 5 boosts at the end, or 6-7 weeks. So much for summer. Going to a relative's lakehouse for the weekend. That is the extent of my summer vacation. After this is all over, I am going somewhere far away. And do what I want. And not be dictated by doctor's appointments and pills and lotions and diets and...",
      "MessageIndex": 76,
      "PostDate": "30/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 8, 2011 07:07PM Huskerkkc wrote: Julie, my RO's office likes to have people go the same time every day, but will work around that. this week (my first three days) I went at 3pm, but that means leaving home by 1:15. Next week I will go at 8:45 in the morning. I hate getting up early but at least I will have some \"day\" left. The next week I will probably go different times because I have some appts to work around and will probably start spending 1-2 nights at my parents instead of driving every day. Just depends on how I feel.  Pejkug3, I only got little samples of Aquaphor but I don't like that for the day. They said I didn't need anything yet either, but I went and got some Baby Aveeno (on the first page of the June 2011 list). We use lotions to prevent sunburn, why wouldn't we use lotions to prevent this burn? I have not yet found the Fruit of the Earth aloe vera. I hate Wal-Mart, and have checked Walgreens, Target and Shopko with no luck. Amazon.com has it but it doesn't qualify for free shipping. Any other ideas (besides Wal-Mart?) While I was waiting today for #3 treatment there were 2 old guys talking about how they were almost done with radiation (prostate I think) and were comparing diarrhea stories. At least we don't have to worry about that (do we?!) yorelh, I don't have to hold my breath, but my treatment is on the right side no heart involvement. However, the glasses sound fun!   PSU222...why did your appointment take so long? My first day was probably 45 minutes with digital x-rays, then days 2-3 were just 10 minutes.  ",
      "MessageIndex": 154,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jun 30, 2011 09:09PM Huskerkkc wrote: Ladies, I started in the June rads thread, but after meeting with my RO last week, I cancelled my treatments that should have started on June 29 and asked for a second opinion. First RO was so insensitive and unprofessional. Very dire comments and suggesting a treatment that did not seem to fit my situation. Suggested I needed a flu shot (had one in Feb), a pneumonia shot, and a shingles shot (seems like if I needed all that I should have done it pre-chemo when I was most vulnerable to infection). Said it probably wouldn't hurt if I had a hysterectomy (I was BRCA negative) or a mastectomy (I had a lumpectomy for small tumor, no node involvement, clear margins; however, am a grade 3 and triple negative). I just couldnt see having two additional major surgeries that were medically contraindicated. Cried throughout the appointment with no acknowledgement from RO, went through mapping, simulation, etc. came home, cried some more (cried a LOT) and decided I just could not do it. Husband agreed. Was able to get 2nd opinion scheduled, although it will be a 90 minute drive one way. Went today and loved this guy. Much more in tune with my needs, not looking to add treatment I don't need, spent lots of time answering lots of questions, and just seems like a very knowledgable guy. No pomp, very confident, no condescention. I've had enough of that. Got remapped, tattoed (this time with black light not ink) and simulated. Will be flexible with my schedule since I am traveling 90 miles to get there. Will be able to stay with parents if I get fatigued. I have been highly emotional since I finished chemo (can cry easily anyway, but this is worse); more so as rads draws near. Then add a jerk for a doctor and I became a wreck. Have taken Ativan at night with Ambien for sleep, but just started another Ativan in the morning. Prescription allows for 3 a day, but I am going to start with 2. Plus hang out with gals that know what I am going through and don't look at me with pity or fear! Kristy (aka Huskerkkc) I c",
      "MessageIndex": 74,
      "PostDate": "30/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 22, 2011 01:06PM Huskerkkc wrote: Elizabeth, I am doing well so far. Thanks for asking! I finished 13 of 33 today. I get tired mid-afternoon, but I am off for the summer (school counselor), so that helps immensely! I did chemo while working March-May and that was tough sometimes. I would miss chemo day (usually Thu), then work Friday. Sometimes Monday I could not work-or would come in at 10:00 or 11:00. I'll still have 10 or so rads to finish when school starts again in August, so am planning on working half-days I think. I overdid with chemo, and I don't want to do that again. Maxine, I hate to hear you have to wear the tape and markings. Mine are black-light tattoos. You can't see them until they shine the pen light on them. They mark them each day with the tip of a Sharpie. When I \"lube up\" afterward, I wipe them off. They remark every day. But I have read on here and the June thread that several have to keep the tape and lines of marker. The indignities that we endure. SIGH",
      "MessageIndex": 330,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 21, 2011 08:00PM Huskerkkc wrote: Elizabeth...hate to contradict your hygenist, but thought I would share some info. My husband is a dentist so I asked him what he thought about your fluoride treatment. He said that your teeth are not in danger from radiation unless your treatment is along the jawline or above. Not supraclavical, and not thyroid area. But if it is jaw or higher the saliva glands can be damaged, so then the teeth/roots are at risk. If you have extensive dental work, fluoride treatments may not be a bad idea, he said. He thought no drinking for three hours was excessive. He recommends no drinking for one hour after fluoride. Radiation is very targeted, so it is very unlikely that your teeth roots are at risk from that. You might want to call and ask the dentist specifically.",
      "MessageIndex": 320,
      "PostDate": "21/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 24, 2011 10:21AM Huskerkkc wrote: I was taking anti- anxiety meds (Ativan) since the beginning of treatment but only at night to help me sleep, along with Ambien. On rare occasions I will also take an Ativan in the morning if I am felling anxious about treatment or whatever ? Pounding heart is usually my indicator. But when rads started and I had gone through a major emotional event with my first oncologist, I realized that I was about as low and stressed and emotional as I had ever been. So MO suggested talking to primary doc for anti- depressant and I started on Cymbalta two weeks ago. I have also had several sessions with the oncology social worker. As a school counselor myself, I am a big believer in therapy along with meds. A support group is also beneficial. Unfortunately the days mine meets are not at all convenient. So I try to meet with or call the social worker at least every two weeks. I guess the main thing is to realize there is no shame or weakness in asking for drugs for anxiety or depression or both. This is situational; it doesnt mean you will need them forever for most of us. And I hope by so many of us sharing our stories, others will see you are not crazy and you are not alone and it is okay to cry and be scared, but it is also okay to ask for help to get you through this.",
      "MessageIndex": 360,
      "PostDate": "24/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 30, 2011 01:12PM Huskerkkc wrote: pejkug3...I am a Kristy too! Although with a \"k\" instead of a \"ch\". I also have a friend who spells her name Christie. I always teased her that she didn't spell her  name right I am 18 of 33 treatments (7 of those are boosts I think) So far, just a faint pink and minor sensitivity. RO said I look better than most at this stage, but warned that it will get worse. Just hard to tell how everyone responds. But I am pleased that I'm doing good so far! Fatigue is the main issue, made worse by the driving I do every day (3 hours round trip). But I am trying to go to bed earlier and the Ambien helps too! Just wish I could sleep when I try to nap. I just lay there, except for one day last week when I slept for 90 minutes! But that only has happened once in three weeks. But RO says rest is fine too; it doesn't have to be sleep.  Hope you are all having a good, cool, SE-limited weekend, the last one for July.",
      "MessageIndex": 437,
      "PostDate": "30/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 12, 2011 08:41AM Huskerkkc wrote: There is a good explanation of boosts on this website: www.breastcancer.org/treatment...",
      "MessageIndex": 190,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 13, 2011 12:45AM Huskerkkc wrote: Elizabeth, so sorry you weren't able to see the RO today. I had treatment #5 today and saw the RO. Coincidentally I saw my family doc to check a mole (thank you BC; now paranoid about everything) and I asked him about anti-anxiety meds too. My onc preferred that my family guy oversee that and I didn't even think to tell the RO. Oops probably should tomorrow. But he was agreeable and knew how hard it was for me to ask (I am a school counselor-recognize the signs but don't want to ask for help. I am always the \"strong\" one). Unfortunately it will take 10 days or more to kick in (some as long as a month) but just knowing I am doing something to overcome all of the irrational drying and irritation is a relief. You could also ask a tech tomorrow. Sometimes they are easier to talk to than the doctor!",
      "MessageIndex": 193,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jun 24, 2011 01:52PM Huskerkkc wrote: I had my consultation yesterday, with mapping, simulation, and tattoos. It did not go well and I have been second-guessing ever since. tdsmgb I think we must have the same rad doc! OMG, it was horrible. I should not have gone forward past the consult, but I got paralyzed even with DH along (a very practical/logical sort of guy-total opposite of me-and he was not impressed either!) First thing RO said was \"You're young (50), you're triple negative. That's bad. Real bad.\" Didn't hear much else he said as I pretty much cried through the rest of the consult. He did say, \"You're probably cured already, but we want to be sure.\" Treatment suggested seems to be standard of care, but was surprised about his recommendation to extend the field to the clavicle area, as I am stage 1, 0/3 nodes, excellent clear margins. BUT...grade 3 and triple negative. This idea of extending the field to include the clavicle area has not been mentioned before and I am concerned about adding it and thereby increasing the SE's (although he says it does not increase the risk of lymphodema). He is the only RO within 50 miles. Question to the group: are any of you early stage, no node involvement, triple negative AND getting clavicle area radiated in addition to breast? We are all so unique, I know it is hard to compare. I've asked the same of the TN thread as well. It is done for those with node positives, but not often with node negative, even if TN. I found one research paper (very recent) that would support this however. After crying all through the appointment and all the way home (husband was in separate car because it had been at the mechanic's) and having a long talk and restless night, I finally called the nurse navigator.  She apologized and said she had talked to her manager before about his doomsday approach and lack of tact. She even suggested a second opinion and said it would not be a problem to delay the start of rads in order to meet with someone. It means going either 50 or 70 miles away, but if I get confirmation that his suggested treatment is appropriate (which I think it is, except not sure on the clavicle thing yet), it may help me decide if I can suck it it up and deal with him for the one time a week we'd see each other or that it IS worth the extra hour's drive to have someone I can trust and be comfortable with. Husband supports me 100%. It is so rare for him to have such strong feelings about a doctor; he is a dentist and is much more logical and be much more objective. He's never felt the need to \"like\" his doctor as long as they get the job done and know what they are doing! With his own patients he tries to make sure they understand exactly what he is going to do and why, especially when it is something involved and complicated. That is when they need to trust you the most! So, for now, I am feeling so much better about getting a second opinion.  P.S...Beetlebum! I can totally relate to having feelings hurt, rather than getting angry. That's me! I must say, I did like the techs so if I do go back at least I know they won't beat me up! P.S. S. Cancer sucks, doesn't it?!",
      "MessageIndex": 225,
      "PostDate": "24/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jun 28, 2011 07:23PM Huskerkkc wrote: I will see a new RO on Thursday. My consultation with first RO last Thursday was a distaster, as Ipreviously posted. I did a lot of thinking and researching and talking and agonizing. My onc called me last night at 9:30pm and is supportive of me getting a 2nd opinion, although he feels the treatment will be the same no matter where I go. Maybe-but I will at least be with someone with whom I have some trust and faith. I will not start rads until next week, so guess I will need to check out the July rads, but it has been very helpful to know what you have all experienced, from emotions to actual treatments. Hopefully will have some good news on Thursday after my appointment. Downside is the drive will be 90 minutes one way, but my parents live there so am hoping I can get a late appointment one day, spend the night w/parents, get the first appointment the next day and come home. Repeat again for next day. That will reduce my drive time by two days if I end up with the fatigue that seems to be inevitable.",
      "MessageIndex": 303,
      "PostDate": "28/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 12, 2011 11:41AM Huskerkkc wrote: I have gotten 3 different opinions on the chemo port. I finished June3 and onc said he'd prefer 3 years since Iam triple negative. He also said that is probably overly cautious and if I had any trouble with it he'd remove it. PS who placed port said probably a year was sufficient unless I had trouble. RO said he'd like it in through rads and then he didn't care. I'm leaning toward a year or less. 3 seems extreme. It is annoying and sometimes uncomfortable.",
      "MessageIndex": 444,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jun 21, 2011 01:09PM Huskerkkc wrote: I am new to this thread, but not to the forums. Great gals no matter what the conversation!  I will see the RO on Thursday and probably start next week with actual treatments. Does anyone have a list of questions that they asked? I researched so much on chemo, and triple negative (ack), and just have done nothing to prepare much for radiation. I can see the first question will be about creams...starting immediately rather than waiting until the skin turns pink! Melanie, I got Aquphor at Shopko, I believe, or possibly Walgreen's. You don't need a prescription for that. It was on some list I saw on this site somewhere...probably before, during, after chemo. That's the one thing I have on hand, but am seeing that other creams may be more beneficial. I expect to be popping in more frequently after Thursday! Kristy (aka Huskerkkc) ",
      "MessageIndex": 195,
      "PostDate": "21/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jun 26, 2011 09:26PM Huskerkkc wrote: I talked to a sorority sister of mine today who finished her BC treatment (chemo and rads) in March, so she is about 3 months ahead of me. She gave me the name of her RO which is 90 minutes away (vs the 60 or 75 I was originally contemplating). My parents live in the same town. She did her appointments at 4pm on Monday, spent the nigt with her brother, then had the first appointment at 8am on Tuesday. Wed was a drive up and back trip, then did 4pm on Thu, spent night, 8am on Friday. So she was only driving 3 days instead of every day. AND she loved the RO. So having a personal recommendation and a way to reduce driving time if possible now makes the longer drive seem do-able. I can stay with my parents if I need to. I am thinking that in the beginning it may not even be much of an issue driving up and back in one day, but as I get further into treatments, it would be good to have the option. I have been second-guessing myself all weekend, but after an hour conversation with my friend and discussing with husband I feel much better about getting a second opinion and making a switch. Thanks for all the support ladies...now I just hope I can get an appointment quickly. That is the part that worries me now (ha-everything worries me; this is just at the top of the list!); delaying the start of rads to find a new RO. But the nurse navigator assured me that it would not be a problem. Now for some zzz's.",
      "MessageIndex": 258,
      "PostDate": "26/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 18, 2011 03:01PM Huskerkkc wrote: Congrats Lynn!! I drive 3 hours a day also; not fun but I am listening to Harry Potter Bk 1 on tape! Saw the final movie Friday in 3D (don't bother; doesn't add that much) and have read all the books . Thought it would be fun to revisit in a differrent format to help pass the time. Had to stop at Starbucks about halfway back because I was getting tired. I had 9 of 33 today. Still a ways to go but so glad to hear from those of you that are done or almost!!",
      "MessageIndex": 530,
      "PostDate": "18/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jun 30, 2011 07:02PM Huskerkkc wrote: Had my second opinion rad consult today in Lincoln, 90 miles away. DH went with me. RO was great-such a relief! He knew I was there for a second opinion but I think he thought I didn't want/need rads so his first comments were about how effective rads were. Once I told him I was okay with rads, just not the guy giving them, we were good. I will get 28 treatments, with 5 boosts at the end, unless I am eligible for the Canadian protocol. I guess I'll find out when i start treatments next Wed, which is only one day different from the original plan. He also sees no need to treat the supraclavicle area-I have no node involvement. No dire predictions, no doom and gloom.  So I guess I will need to switch over to the July group, but you guys have given me lots of inspiration and courage for what is to come. Such a relief! And congrats to all of you half way, 3/4 or done! Whoo hoo! I am getting scratch tickets on Wed.  ",
      "MessageIndex": 329,
      "PostDate": "30/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 2, 2011 08:22PM Huskerkkc wrote: Where did you get the aloe vera? I've looked at Shopko and Walgreen's. i do not shop at Wal-Mart. Any other suggestions.",
      "MessageIndex": 353,
      "PostDate": "02/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jun 21, 2011 08:44PM Huskerkkc wrote: Maybe484...What makes a good candidate for the Canadian/European protocol?  tdsmjb...OMG...what kind of beside manner does that rad doc have? I meet mine Thursday and my regular onc told me not to be put off by him...he's kind of a \"worst case scenario\" presenter. I don't mind hearing it like it is and I know they have to tell you all the possibilities, but it is the WAY they tell you. You can tell things in a way that doesn't scare the @#$% out of people but they still know what they are in for. I guess it is good you only  have to see this guy once a week, but too bad you don't have other options. My options are limited too, unless I want to drive 70-90 miles one way or stay with my parents during the week for a 10 minute daily procedure! But I haven't met him yet so will give him a chance...just have heard that others don't like him very well.  ",
      "MessageIndex": 204,
      "PostDate": "21/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 7, 2011 09:53PM Huskerkkc wrote: Had Day #2 of rads today. Am going with the 2nd opinion RO...although driving 95 miles one way. Found out from my new center that if you drive more than 100 miles for treatment the American Cancer Society will send you a gas voucher for $100. So check with your social worker or receptionist and see if they have the paperwork for it. There is a form, but the receptionist filled it all out for me. don't know how long it will take. But had not heard of that benefit before.  There was a massage therapist today when I left my appointment. The RO hires her to come once a week for his patients. She is trained to work with cancer patients; very nice touch. It was a chair massage, fully clothed, shoulders/back area for about 10-15 minutes. But still a very nice thing to offer patients. I will see her weekly  and might make an appointment with her for a full-fledged massage! No tears for first appointment yesterday, but today I did when the masseuse was so caring and gentle. Glad I only have 3 sessions this week. Next week will be the full five treatments. I got scratch tickets today. 33 of them. Won a dollar on the first one, so off to a good start. Love that idea.  ",
      "MessageIndex": 401,
      "PostDate": "07/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 8, 2011 07:32AM Huskerkkc wrote: mamadog-check with your doctor's office and see if you can get a gas voucher. I just found out yesterday that patients who travel over 100 miles for treatment are eligible for a $100 gas voucher from the American Cancer Society. They just filled out the paperwork for me yesterday. Now it won't help with the fatigue, but it would certainly be something to look forward to! You can also check with the ACS and see if they have driver's in your area. I my little town of 2800, there are 2 women who will drive cancer patients to their appointments, no cost. Many local chapters have volunteers who want to do this. Many have had cancer in their family and know the hardship of driving. So consider that as well.  I have had several offers of people who will drive me. Seems silly for a 10-minute appointment, but I'm thinking that having someone in the car would be a nice thing. They could even drive my car! Some have friends/family in the town where my treatment is so if I want to spend the night with parents they would go see their relatives. With co-workers (teachers), we're thinking that several could go and we'd have brunch before or after my treatment. The hardest part is asking, but the best part is how willing people are when you do ask.  ",
      "MessageIndex": 405,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 11, 2011 08:13PM Huskerkkc wrote: Shelf cami is a camisole that has a built -in bra, sometimes called a shelf bra. Some tanks tops have the built in bra too. Softer and less binding usually than a regular bra.",
      "MessageIndex": 435,
      "PostDate": "11/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Apr 13, 2011 11:49AM Huskerkkc wrote: Mine was twilight. I remember nothing, woke up wondering when they were going to start. In and out in just a few hours. I would do twilight over general. An ipod is a good idea, but I would not have heard a thing!",
      "MessageIndex": 4,
      "PostDate": "13/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/767408",
      "Title": "Port with sedation or only local? BioAdoptMom3 msphil"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 1, 2011 12:40AM Huskerkkc wrote: I met with RO today and will be screened for the Canadian protocol. Don't know yet if I qualify. I know the breast measurement will probably be the key. He told me that if I am 1 cm off, he will not do it. It has to be exactly within the guidelines. So we'll see. My RO also had a fellowship at MD Andersonin Houston. This isn't experimental.",
      "MessageIndex": 17,
      "PostDate": "01/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/735000",
      "Title": "3 weeks of radiation seaotter lauribob"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jun 24, 2011 08:34PM Huskerkkc wrote: Lisa,  here is the website: www.nioxin.com You have to get from a salon or order online...check online like Amazon for deals too. Seems like most are using system 2, but not all. There is shampoo, conditioner, and a follicle booster. My salon owner told me the scalp booster is really the one she thinks is the most important. Expensive! But she has offered to sell it to me at cost. Have not compared what that would be compared to Amazon or others. But I bought it 'retail\" for $20 for 1 oz! I see Amazon has for $15-not sure what my stylist's cost is. But a little goes a long ways.  ",
      "MessageIndex": 10034,
      "PostDate": "24/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jun 29, 2011 10:33PM Huskerkkc wrote: I am 4 weeks PFC...at 2 weeks onc and nurses said if I hadn't lost lashes I probably wouldn't but I was not confident of that, especially after reading many on the threads here. My inner lashes are gone, a patch in the middle, and a few on the outer edges. Wearing a little eyeliner helps and the mascara enhances the ones that are there. Wig also has long bangs, so unless you are looking for it, I don't think youd notice. But they are getting thinner. I called to get a prescription for Latisse and will start that Friday. Will also show onc that yes, lashes do go a month or more post-chemo! ",
      "MessageIndex": 10126,
      "PostDate": "29/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 20, 2011 11:42PM Huskerkkc wrote:",
      "MessageIndex": 10452,
      "PostDate": "20/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jun 15, 2011 12:43AM Huskerkkc wrote: Question ladies...my onc said I could use Nioxin for hair growth...After looking at Walgreen's and Shopko, finally figured out that you have to get from salon. Wish he would have told me THAT part. So I got the shampoo/conditioner (GIANT bottles...all my stylist carried...should last a YEAR!) and I read on the bottle that it is a 3-step system, so i called stylist back and sure enough, there is also a spray, which she recommended I use too. She said the spray (can't remember what it is called) can be a bit irritating and even cause scalp to turn red, so not to be alarmed. Said I should use at night. Anyone else using these products? I am only 2 weeks out from final chemo and have some very light fuzz similar to Christine's picture I think. Onc would not agree to any Biotin during chemo since I was on clinical trial; am considering that as well. Any/all advice appreciated!  Also, what about Minoxadil? Saw that recommended too and bought that. Then read fine print which says it isn't effective for hair loss due to chemotherapy, although I guess it is still frequently used by chemo patients. Can you use both the Nioxin and Minoxadil at the same time? ",
      "MessageIndex": 9837,
      "PostDate": "15/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jun 20, 2011 09:07PM Huskerkkc wrote: I am 2 weeks post-chemo and have white fuzz. Was a blonde (mostly), and my wig is platinum blonde so am hoping I can pull off the white look, but not for a long time. SIGH.  Also, I had asked about Nioxin. Didn't realize it came in so many versions...the one I got from my stylist is #3 system, which looks like the \"normal/thinning\" version! I looked at the website (cant' remember who posted, but thanks) and now I am not sure WHAT system I should be using. I may have to call the shop owner-she goes to my church-and clarify. She told me yesterday she would get me refills at cost when I need them; she felt bad that I had already paid the retail sale price. The girls rent the chairs and get commission on the products they sell. Is everyone using System 2? ",
      "MessageIndex": 9966,
      "PostDate": "20/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Apr 19, 2011 10:56PM Huskerkkc wrote:",
      "MessageIndex": 8759,
      "PostDate": "19/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Apr 21, 2011 09:55PM Huskerkkc wrote: dawn, I did go to the LGFB class but was disappointed. They showed a video with a gal sporting a whole bunch of different wigs. Really cute styles. We got the bag of cosmetics, which had some good stuff. But we did NOTHING with it, although we each had a mirror and makeup wipes, there we sat. The gal leading it was a cosmotologist, talked about ways to wear scarves in general, showed a way to take an old t-shirt, cut it and make a turban/sleep hat, and talked about having a good attitude, laugh a lot, God will see us through. At the end, found out she goes to Toastmasters, so is trained to tell stories, and she had lots. But she never really got to anything useful. There were six of us there, three in wigs, three just starting out. There were no introductions. I was so disappointed! So at the end, I asked if we might at least share names/stories. I told my sister that I didn't intend to take over the group (I'm a school counselor) and she said YES YOU DID! THAT'S YOUR JOB!  Once we started talking about our journey and how far into it we were, they shared alot about what worked for them, ordering wigs/hats online (tlc.org...got a cute RED wig for cheap, and it is returnable! although haven't worn it yet-will when I get brave after school is out or feeling bold!) I would still recommend to others to go from everything online I've heard...I got a dud leader, unfortunately, but the makeup is worth the trip and I will get helpful hints right here for all the other support I need.",
      "MessageIndex": 8822,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Apr 21, 2011 09:11PM Huskerkkc wrote: Dawn, I am triple negative too, so no meds either. Am half-way thru chemo (3/6) and hope to be done first week in June, then start rads. I am on DD (every 2 wks) treatment of cytoxan and taxol. I have the Head & Shoulders too...shoulda done the trial size! I have a lifetime supply! I have round 4 April 28. Want to ask about the Biotin. Would like to get somethng started, but I am on clinical trial and there are some things that I can't do because it could affect the results.  But i keep asking! I think I have a little stubble, hope it sticks around but not enough to tell for sure. Eyelashes and brows still in tact and about 60%? down below :) My brows are light anyway, but really not looking forward to lashes. Got some false ones to try, but don't know if I can carry that off.  Thanks to all of you for sharing your pix and progress. It gives us gals with nothin' something to to look forward to and gives us hope!",
      "MessageIndex": 8820,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 8, 2011 10:14PM Huskerkkc wrote: bkj66...I just started Latisse. I am 5 weeks PFC. Onc would not prescribe during chemo. It is for lashes only...not brows. And only the upper lashes. Mine cost $127 for 1 month and my insurance doesn't cover. However, Latisse offers a $19 (or close to that) rebate to help defray the cost. I only started this week, so too soon to comment on effectiveness I guess. ",
      "MessageIndex": 10263,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Apr 4, 2011 03:44PM Huskerkkc wrote:",
      "MessageIndex": 8466,
      "PostDate": "04/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "May 7, 2011 12:33AM Huskerkkc wrote: Stacy, I would recommend Bali as well. ",
      "MessageIndex": 9147,
      "PostDate": "07/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 22, 2011 04:10PM Huskerkkc wrote: thegood5...I didn't have a good experience with the Look Good class either. Except my instructor was in her 60's, a member of Toastmaster's, and seemed most interested in telling stories. We watched the video, got a bag of makeup, but no wigs and no time spent on how to apply the makeup. we also did not introduce ourselves until I asked if we could at the end. I was very disappointed. But have heard so many that found it to be so helpful.",
      "MessageIndex": 10499,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jul 1, 2011 09:54AM Huskerkkc wrote: paula, way to leave 'em wondering! why people feel compelled to comment on new styles, clohing, etc. is beyond me. whatever happened to \"if you can't say something nice, don't say it!\" what response did she hope to get? Walk tall, head up, no excuses girl! you've got the right attitude. Hope I can develop the same when I go topless. I am on 4 wks PFC and just a lot of fuzz up top so far. but Nioxin is speeding things up I think",
      "MessageIndex": 10160,
      "PostDate": "01/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Feb 25, 2011 09:48PM Huskerkkc wrote: Just saw your post Tif, sorry I'm late in responding. I ended up with bad stomach cramps, pain, and diarrhea after two doses so they switched me to Ceftin. My regular doctor and my surgeon said Levaquin is a good drug and I shouldn't have been so worried. However, the diarrhea made it not a good choice. turns out I had pneumonia-of-all-things! Much better now, except for cough and lack of appetite. it's always something, isn't it?!!",
      "MessageIndex": 2,
      "PostDate": "25/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765157",
      "Title": "I have an infection!! Huskerkkc marticcrn"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Mar 1, 2011 09:37PM Huskerkkc wrote: I finish my antibiotics tomorrow (Wed) and then will see the dr Thu to be sure my lungs are clear as well as bloodwork. Can't get a port or schedule treatment til I'm \"clean\". I hope i'm good to go; hate to say I'm looking forward to treatment but this limbo business is doing me in too. Time to get on with something. Hope you all are feeling well this week! Kristy ",
      "MessageIndex": 5,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765157",
      "Title": "I have an infection!! Huskerkkc marticcrn"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Huskerkkc wrote: Had lumpectomy 2 wks ago with 3 nodes removed. All clear; however just found out I am triple negative. Seeing onc this week. Getting along okay until yesterday. Started coughing but not bad. Flu going around school where I am a school counselor. Achy last night but just thought I just had sore muscle pain. Woke up this morning and had 101.8 fever so figured I better go in. PA at family doctor thought surgery site felt warm but no oozing. Redness underneath breast (slight) but I thought it was bruising that had migrated south. Did blood work and chest x-ray. WBC ok but there was a differential that suggested a bacterial infection. Flu test negative. on Levaquin once a day. Temp was as high as 102.2 but now 100.something. Have to stay home until fever free 24 hours and I see doctor. Was really hoping to save my sick days for future treatments. This drug has 4 pages of SE's that scare me more than infection. I really think I just have a nasty cold but now I am \"at risk\". I'm just miserable and hoping it is nothing worse. Wondering if they should have called surgeon? Sick and tired and worried. Sorry for the whining. Just needed to vent i guess. Kristy “If we had no winter, the spring would not be so pleasant: if we did not sometimes taste of adversity, prosperity would not be so welcome.” - Anne Bradstreet Surgery 2/3/2011 Lumpectomy: Right; Lymph node removal: Right, Sentinel Chemotherapy 3/17/2011 Cytoxan (cyclophosphamide), Taxol (paclitaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765157",
      "Title": "I have an infection!! Huskerkkc marticcrn"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Feb 13, 2011 01:44PM Huskerkkc wrote: Bevin, I appreciate your response. I do not know if theOnco was ordered, but I am still waiting to here on the er/pr status, so hopefully it will be a part of that. But definitely something I need to find out   It sounds like I don't yet have the whole picture and seeing an oncologist is just part of that. But knowledge is power and I am learning lots! Thanks!",
      "MessageIndex": 25,
      "PostDate": "13/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/764716",
      "Title": "Does what my surgeon said sound accurate? BioAdoptMom3 BioAdoptMom3"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jan 15, 2012 02:19AM Huskerkkc wrote: Wow, very cool!",
      "MessageIndex": 214,
      "PostDate": "15/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/764107",
      "Title": "New type of LE Garment Journey purple32"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Feb 12, 2011 10:23PM Huskerkkc wrote: Hi all-I am brand new to the site. Have been lurking a couple of days, but doing lots of reading on the other pages on the website. I had a lumpectomy on Feb 3 and had my post-op with surgeon yesterday  (Friday, Feb 11). I already knew the tumor was approx 1.9 cm and that it was grade 3 prior to surgery. The surgeon then shared that I was Stage IA, with no cancer in the margins, and the nodes were all cancer-free (3 were removed). This should have been great news and it was. However, for some reason I was not at all prepared for his recommendation to see an oncologist next. Both my husband and I knew that radiation would be required but have not yet met with the radiologist. But the surgeon asked twice prior to surgery and then after if we had met the radiologist yet. We hadn't because my surgery was moved up two weeks due to a cancellation. Just not enough time. We also knew that chemo might be needed if the tumor was larger and/or there was cancer in the nodes. 1.9 was confirmed in the path report, making it just under the one guideline. Clear nodes makes the other guideline. We don't yet know the ER/PR receptor status. That will take another week. So why, if I'm clear on two counts, do I need to have chemotherapy? I was devastated and cried all day yesterday, even though my results were so good. He said it isn't a sure thing, but something that should be reviewed with the oncologist. I just don't understand why we weren't told right off the bat-regardless of size or nodes, you'll need an oncology consult. I would have been so much more prepared. Radiation? I'm ready. Chemo? I would have been with some prep. Now I feel like I've received the C diagnosis all over again.  Sorry this is so long, but seems so similar to what others are going through. I have been given two oncology referrals in two different towns (I'm in a rural town-one oncologist 30 miles away; the other 90 miles away) and I plan to see them both to get two opinions. I have not heard about the Onco test. Does he do that or the surgeon? Or will that be part of the missing lab report still to come? Also, what is a cold cap? I'm gonna have lots of questions for y'all, I'm afraid! ",
      "MessageIndex": 22,
      "PostDate": "12/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/764716",
      "Title": "Does what my surgeon said sound accurate? BioAdoptMom3 BioAdoptMom3"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Apr 23, 2011 11:15PM Huskerkkc wrote: I am taking Taxol in combination with Cytoxan in DD (every 2 wks) for six treatments. I am half-way through. I have had lots of tingling/numbness. I take 2 scoops of glutamine 3x/day, plus Neurontin (an Rx) 3x/day. Because I am on a clinical trial, they won't allow me to take any other supplements such as B6. As long as it is not severely impacting \"daily skills/living\", they will not change or stop the Taxol. If I was stumbling, or couldn't button, things like that-then they would reduce or stop. I keep a daily journal of symptoms, just in case. After round 2 I had severe weakness in my right leg/knee. I was limping-even went for 2 acupunture treatments (w/onc approval). That is when I started both the glutamine and the Neurontin, so hard to tell now if acupunture helped. It has been better after chemo 3 and I will have chemo 4 this Thursday. It does have me concerned. Nails so far are okay, but dry. ",
      "MessageIndex": 3,
      "PostDate": "23/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/767930",
      "Title": "3 vs. 4 Taxol Treatments? Ker Huskerkkc"
    },
    {
      "AuthorID": "Huskerkkc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119894/profile",
      "Content": "Jan 15, 2012 07:56PM Huskerkkc wrote: I'm surprised at the comments about BC treatments being one-size-fits-all. I can only speak  factually about my own treatment, but have talked to many in a support group and of course by the interactions with the many women on different threads on this site. I guess I can understand your frustration and concern if some of you get a cookie-cutter treatment! Chemo is clearly different for each patient. Some go weekly, some go every other week and some go every three weeks. Some get 4 doses, some six, eight, or 12 or 16! The medicines vary. I was weighed every time and the dosage adjusted accordingly. I was also questioned extensively about previous SE's, especially nausea and neuropathy and again-the dosage was adjusted accordingly. Because I had stage 2 neuropathy my taxol was reduced 25% for my 2nd dose and again on the 3rd dose. They were prepared to eliminate the taxol if my symptoms didn't subside. That scared me as much as the neuropathy did! Surgery can be before or after chemo. Many patients participate in clinical trials, including me. That by definition deviates from the norm. Radiation is not always 33 sessions. I was originally scheduled for 40+, but then got a second opinion and ended up with 33. However, if my skin didn't hold up, I could have been done sooner. I was weighed and had a CT scan and x-rays every week to very precisely measure where the beam would go. Some have 28 rads then boosts immediately following; others have a week or two in between. I know some who had 28 rads, but not the boosts. Still others had more or less than 33. Because I was stage one, 3 nodes all negative, I was prepared for rads only. It was the triple negative status that added the chemo for me. Rads is a very important piece of treatment, IMHO. I think Beesie gave a very thorough explanation. I would probably give up chemo before rads if forced to make a choice. To those that have a center and/or hospital nearby, you are so fortunate! To have a naturopathic oncologist, how cool is that! My clinic only has two oncologists and they are 30 miles away. I got a second opinion at a center 95 miles away. For radiation, there was only one RO and he was a jerk! So I drove 95 miles one-way, every day, for 33 treatments. Although it was a hardship, I did have a choice. It's just that sometimes the choices we have aren't all that great.",
      "MessageIndex": 25,
      "PostDate": "15/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/781063",
      "Title": "Radiation Therapy for early stage Kaara mimikitty"
    }
  ]
}