{
  "AuthorID": "Huz",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200712/profile",
  "Posts": [
    {
      "AuthorID": "Huz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200712/profile",
      "Content": "Jul 2, 2014 04:38AM Huz wrote: Hi Alexa, My sister went through a short denial phase when I informed her of my BRCA 2 diagnosis, she is now being tested, and my father is still coming to terms with it 6 months later, but they saw things went well for me so it made it easier. I also had no family history of breast or ovarian cancer, my mother died of pancreatic cancer about 20 years ago so I suppose she was the carrier and she must have inherited the gene from her father whom she never met. I was tested because I had a DCIS at 43. I had a double mastectomy in March, heading for my exchange surgery later thing this month, as well as an oophorectomy back in April that put me in surgical menopause. I'll be happy to share my experience if you have questions.  Hang in there,  Huz",
      "MessageIndex": 6,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/822440",
      "Title": "Brca2 positive no family history AlexaP AlexaP"
    },
    {
      "AuthorID": "Huz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200712/profile",
      "Content": "Jul 2, 2014 05:53PM Huz wrote: Hi Alexia,  I haven't noticed any changes in my moods, I have always been even tempered and no changes there.  I have some mild hot flashes, very tolerable so far. The only uncomfortable change is the vaginal dryness,  trying over the counter remedies (replens), and if it does not work, I'll go back to my oncologist/GYN to get the e-ring or tablet. I talked to 2 oncologists before the oophorectomy and they both confirmed this is ok even for breast cancer patients. My libido is not great, but I would be surprised if it were after a double mastectomy, I assume it will get better once the reconstructive surgery is all done and I feel more comfortable with my new \"parts\". No changes so far in my hair or skin, no confusion, no weight gain or major sleep issue. I take menopause specific vitamins, I don't know if that helps.  I hope it helps, I read so many horror stories on the internet before my surgery, I was expecting the worse but it has not been bad at all. I feel relieved my breast cancer was caught so early that I avoided radiation and chemo, I don't have to worry about ovarian cancer anymore and I'll be screened for pancreatic cancer and more vigilant about my health in general. I am glad I have a chance to see my son grow up, and with all the medical research going on, I am confident cancer treatments will get better and better. Huz ",
      "MessageIndex": 8,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/822440",
      "Title": "Brca2 positive no family history AlexaP AlexaP"
    }
  ]
}