{
  "AuthorID": "Hypatia",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245737/profile",
  "Posts": [
    {
      "AuthorID": "Hypatia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245737/profile",
      "Content": "Jan 25, 2017 02:46AM - edited Jan 25, 2017 03:12AM by Hypatia seq24 - Friday will be 8 wks PFC. Have a lot of very light or no color hairs with the new darker spots so the overall look is a blurry colored fuzz. Weirder than the color is that under the occipital bone, there is very little hair at all. It goes from fuzz to practically nothing. As insane as it may sound, I've been more vain about losing my hair than my breasts. CC2016 - Any hair (on the head) is a total win!",
      "MessageIndex": 1554,
      "PostDate": "25/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Hypatia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245737/profile",
      "Content": "Feb 3, 2017 04:25PM Hypatia wrote: Bagsharon - My scalp started itching as soon as my hair started growing back. No itchiness of arms or legs (until I read your post ;-) Yay Emily and seq24! ♡ Hair update... Now that it is growing, I don't have the suction effect of a bald head to keep the wig in place. I'm constantly checking the status. Right now the hair is so short and sticks straight up, so there is nothing for a clip or bobby pin to catch on. Will have to look into some wig tape or something, because I'm afraid this thing is going to flying off my head at a most inopportune time.",
      "MessageIndex": 1598,
      "PostDate": "03/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Hypatia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245737/profile",
      "Content": "Mar 13, 2017 06:42PM Hypatia wrote: seq24 -- I'm about 14 1/2 wks out. First noticed a bit of color about 3 1/2 wks ago. It's slow going, but it is progress. Hang in there!",
      "MessageIndex": 1694,
      "PostDate": "13/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Hypatia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245737/profile",
      "Content": "Jan 24, 2017 01:04AM - edited Jan 24, 2017 01:06AM by Hypatia Nayda and Smile - Kinda tried to block the whole drain business out... Only pain I had was once after stretching too far which pulled on the glue, then later when one of them was removed by the BS nurse. Mostly they just got in the way. I also had a home care nurse to check on the incisions, change the dressing and measure the drain output. Wasn't allowed to shower until they were removed. (If you can't, both Walgreens and Walmart have some good cleansing towels.) Luckily I got the drains out after a week. Washed hair in the sink with help. Speaking of hair... I agree that it should grow out as fast as it left the scalp! At first most of what was growing was white (had a few strands here and there pre-chemo, but not noticeable). Now I have a fine sprinkling of darker hair coming in up top. I can feel a difference from last week, so I guess it's growing fairly quickly. Just has quite a ways to go.",
      "MessageIndex": 1551,
      "PostDate": "24/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Hypatia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245737/profile",
      "Content": "Jan 26, 2017 04:02AM Hypatia wrote: Whew! What a relief. Congratulations!!!",
      "MessageIndex": 1556,
      "PostDate": "26/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Hypatia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245737/profile",
      "Content": "Jan 21, 2017 08:45AM Hypatia wrote: Hi, Nayda - I had BMX, no reconstruction Sept 1 followed by chemo 4wks later. Everyone is different in terms of recovery, but I stayed home for three weeks and went back to work parttime the following week. That Friday was when I started chemo. I worked fulltime after that (when the SEs allowed). Most of the pain was in the first week. After that it was mostly tightness in the incision area and just general tiredness. Check with your BS about stretching exercises. Mine had me start prior to surgery and after the drains came out. It really helped to get the range of motion back. Good luck! Denny - I decided against reconstruction because I didn't want any more surgery, chances of complications, or recovery time. While healing, I wore a lot of layers to masquerade the flatness. As the sensitivity diminished, I got a set of prosthesis from Nordstroms (insurance covered) and had pockets sewn into bras to hold them. This allowed me to keep most of my wardrobe as much of women's clothing is cut to accomodate breasts. It also helps balance my posture. I wear the prosthesis to work, but they come off once I get home (there's a certain freedom in that). Best wishes for whatever decision you make. seq24 - I couldn't ring the bell at the end of chemo either. For me, I just felt so overwhelmed with emotion. I ended up bawling my eyes out in the finance office (and that was before they gave me the bill! ;-). Hope your scans come up clean. Sending you all healing thoughts!",
      "MessageIndex": 1528,
      "PostDate": "21/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Hypatia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245737/profile",
      "Content": "Jan 30, 2017 05:00PM - edited Jan 30, 2017 05:01PM by Hypatia Surgery tips - Put high use items on lower shelves for easy access. Pack a small pillow to put between you and the seat belt on your way home. Get non-child proof caps for any med bottles. Use paper and pen to keep track of meds and times taken. Wear comfy, easy on and off clothes. (I found a soft hoodie with internal pockets for those pesky drains.) If you have a tall bed, use one of those plastic one-step stools to help you get in and out. Do your stretching exercises, once your bs o.k.'s it, to get your range of motion back. (My bs had me start prior to surgery.) In times of stress, do whatever relaxes you whether it's music, books, exercise, meditation, puzzles etc. You've got this!",
      "MessageIndex": 1583,
      "PostDate": "30/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Hypatia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245737/profile",
      "Content": "Mar 12, 2017 08:02PM Hypatia wrote: Congratulations to all those declared cancer free! I see the BS in a couple of weeks (was supposed to be last month but she rescheduled) and then the chemo doc at the beginning of next month. Hoping to get similar news. seq24 - My hair started off with white and colorless sprouts and gray mixed in, making for a weird \"blurry\" color. There was definitely way more gray than I was comfortable with! Slowly more brown and redish blonde started peeking through. As of now, still have gray at the temples and anywhere else that is sparse, but the top (which still has a large section with Chia pet action) is growing with actual color. Brows are still sparse. Area not to be mentioned is coming in jet black, which is way darker than normal. Good luck! smilethrupain - Thanks for the article link. I'm trip neg.",
      "MessageIndex": 1692,
      "PostDate": "12/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Hypatia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245737/profile",
      "Content": "Sep 25, 2017 05:30PM Hypatia wrote: Hit the one year mark from surgery at the beginning of the month. Found it way more emotional and stressful than I expected. (Not sure why I thought I would just sail right through.) Blood work isn't perfect, but all my levels are heading in the right direction and I have hair. Just need some energy. It's been frustrating as I seemed to be gaining strength, but then started to backslide. My BS says it is not unheard of and to rest when I need to, which seems like an awful lot lately. Chemo brain is active again too. Having a lot of trouble remembering words and sometimes names of people I've known for years. Caught a cold right before Hurricane Irma. (Thanks, crappy immunity!) Had added stress due to our county administrator deciding that employees should man the public shelters instead of the Red Cross. My MO had already said no way I should be around large groups of people, but I had to get it officially in writing. I know a lot of people who got last minute mandatory assignments and no real training or support. It's disheartening as I generally enjoy my job (and need the insurance). Hope everyone is doing well. Healing thoughts to all.",
      "MessageIndex": 1819,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Hypatia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245737/profile",
      "Content": "Jun 12, 2017 06:15PM Hypatia wrote: Just wanted to touch base. The breast surgeon says everything looks good. The medical oncologist took blood and said that with the surgery and chemo, my chance of reoccurance is about 10%. I am optimistic, but know that I can't take my health for granted. Much of my energy has returned, but I still tire much easier than I'd like. Still have some chemo brain, but the lapses in memory seem to be filling in, albeit with a bit of a delay. My hair is growing back slowly, but surely (and wavy). It's growing unevenly and if I try to comb it back it's a bit too Christopher Walkenish. Hoping it won't take much longer until I can craft it into some type of style. This hasn't been an easy journey, but it would have been much harder without all the caring and support you all have shared. Thank you for that. You are AWESOME! P.S. My dermatologist recommended using Nailtiques. It's usually used by people who have damaged their nails with acrylics. It helped strengthen mine. Good luck.",
      "MessageIndex": 1776,
      "PostDate": "12/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    }
  ]
}