{
  "AuthorID": "i2willsurvi…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134938/profile",
  "Posts": [
    {
      "AuthorID": "i2willsurvi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134938/profile",
      "Content": "Nov 12, 2011 12:14AM i2willsurvive wrote: Emma Watson is my inspiration to go ahead and go topless.  If she chose a very short pixie cut then why should I be afraid to go with a very short hair cut when people will know why I am.  I am 10 weeks since my last treatment and my hair is about an 1\" long and has filled in.  My husband asked me this week how much longer I am going to wear my wig.  I had decided that Thanksgiving is the latest date, but if I like my hair before then I would stop then.  My drab brown hair didn't make it look like much of a hair do so I have put in my own highlights - waiting for them now - hopefully my hair won't be a total mess in 30 minutes!",
      "MessageIndex": 12360,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "i2willsurvi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134938/profile",
      "Content": "Nov 12, 2011 10:50PM i2willsurvive wrote: The highlights last night did not go so well, but it was the first time I tried to do my own highlights.  After a trip to the store today for color (to cover up my mess from last night) and highlights - I love how it turned out.  I figured short hair needed to be a bolder color than my brown hair so I ended up with a copper color.  Debating about whether to go to work on Monday without the wig.  I am taking baby steps and have stopped wearing the wig everywhere except work.",
      "MessageIndex": 12374,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "i2willsurvi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134938/profile",
      "Content": "Nov 17, 2011 10:30PM i2willsurvive wrote: I am so happy to be finished with the wigs.  I never wore them at home - my husband and boys said they didn't care, so they were only to go out of the house for errands, doctors and work.  I got a compliment on my hair today from someone who does not know the reason for my short hair!  So maybe it looks like it was meant to be this short?  I couldn't figure out how to add a picture to my post so I updated my avatar.",
      "MessageIndex": 12519,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "i2willsurvi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134938/profile",
      "Content": "Nov 16, 2011 10:23PM i2willsurvive wrote: I did it - went without the wig yesterday and got lots of compliments from the women at work.  The men didn't say anything - I think they are not sure what to say.",
      "MessageIndex": 12489,
      "PostDate": "16/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    }
  ]
}