{
  "AuthorID": "iacai",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104701/profile",
  "Posts": [
    {
      "AuthorID": "iacai",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104701/profile",
      "Content": "iacai wrote: I just had lumpectomy + lymph nodes dissection about five days ago. I have not seen my report yet but was told there were a lot of lymph nodes taken out. This news made me worry about getting lymphedema. Could anyone share your thoughts how to deal with this? I am 32 years old, imaging having lymphedema for the rest of my life just depressing. Is lymphedema automatic? Or am I just at risk of getting lymphedema? Thanks for sharing your thoughts in advance! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/756277",
      "Title": "Worry about getting Lymphedema :( iacai kane744"
    },
    {
      "AuthorID": "iacai",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104701/profile",
      "Content": "iacai wrote: I was diagnosed of ER-PR-Her2+ breast cancer in November 2009 when I was 32 years old. Due to lymph node involved, my oncologist recommended chemo first. I started my chemo in January 2010 and finished my 8 rounds of chemo in mid April, but I am still on Herceptin every 3 weeks. Recent MRI shows that the tumor is no longer present, and it doesn't show in the mammogram, either. However, the surgeon still recommends me to go thru surgery: mastectomy or lumpectomy + radiation for 6 weeks (30 times). I was told even if the pathology report shows no more cancer cell is found, radiation is required as long as the surgery is a lumpectomy. I have been having difficulties to decide whether I really need surgery and radiation since the tumor is no longer present. Just imagining the numbers of radiation appointments makes me depressed. Could you share your thoughts? Thanks in advance! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/755007",
      "Title": "Did anyone choose not to have surgery and radiation? iacai gutsy"
    },
    {
      "AuthorID": "iacai",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104701/profile",
      "Content": "Jul 7, 2010 11:22PM iacai wrote: Thank you all for sharing your thoughts and experience. I'll complete the rest the treatments. Thanks again!",
      "MessageIndex": 5,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/755007",
      "Title": "Did anyone choose not to have surgery and radiation? iacai gutsy"
    }
  ]
}