{
  "AuthorID": "Idahogirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154987/profile",
  "Posts": [
    {
      "AuthorID": "Idahogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154987/profile",
      "Content": "Aug 23, 2012 07:25AM Idahogirl wrote: I don't post very much and am new to these boards, but I prefer BCO for my support group too.  I think I may have had stage IV disease from the beginning too, as it recurred within about 7 months of my original surgery.  I didn't get the proper scanning at the time, so I will never know.  Anyway, anastrozole seems to be working for me, as in 2-1/2 months it has shrunk some large nodes under my arm down to almost nothing.  I also have some lung mets so I am hoping it will work on those too.  I seem about the same to everyone I know, as I didn't have chemotherapy, so I don't think they even realize I have stage IV because I don't talk about it, and I do the same things as before.  Actually I exercise more now and watch my diet a lot closer, so feel better in most ways than I did when I had a job that required me to sit most of the day.  I guess if there is an advantage of stage IV, we don't have to worry about it metastasizing like the earlier stage people do.  I like to think of the situation as being \"it is what it is,\" and am trying to get the most out of each day.  I really have been helped by reading these boards as no one else really understands what we are going through.",
      "MessageIndex": 54,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792240",
      "Title": "I thought this was supposed to be rare 4myangels carpe_diem"
    },
    {
      "AuthorID": "Idahogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154987/profile",
      "Content": "Aug 31, 2012 12:54AM Idahogirl wrote: Thanks for the post Ann. I just found out in May that I am stage IV with liver, bone, and lung mets. I have been trying to be positive but sometimes it is hard as I know I probably don't have a good prognosis. My doctor hasn't given me a time frame, probably because I also had a very aggressive uterine sarcoma 13 years ago, and my current doctor gave me two months to a year at that time. I did fine until the last two years when I was diagnosed with breast cancer. I also had an aunt by marriage who had metastatic breast cancer in her 50s. She had a mastectomy, chemo, the works, and was basically sent home to die. She recovered and lived into her 90s. I am a Christian and think we live until our time is up. I don't think doctors can tell, and I definitely think the will to live has a lot to do with it. I heard a doctor say that people with a strong will to live usually do, while those who think they are going to die soon give up and don't live long. So I think it is important to concentrate on living. I am fortunate enough to have raised my 3 sons, the youngest being 34, for which I am very grateful. I am concentrating on doing things I enjoy every day and trying not to think too much about what is down the road.",
      "MessageIndex": 13,
      "PostDate": "31/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792749",
      "Title": "Interesting article regarding prognosis and doctors CoolBreeze Mzmerz"
    },
    {
      "AuthorID": "Idahogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154987/profile",
      "Content": "Sep 1, 2012 12:15AM Idahogirl wrote: As far as I am concerned, it is not over til its over.  As long as we are breathing there is still hope.  No doctor knows our expiration date.  I was supposed to be dead 12 years ago from an aggressive sarcoma but I am still here and now battling breast cancer. I think it is okay to possibly get some paperwork in order, etc., but I don't want to resign myself to dying just now from stage IV breast cancer.  I have too many things I want to do.  I want to fight the urge to give up.  I think if we wake up in the morning and tell ourselves we are fine and we will have a good day, it will be a better one than if we think about dying. Just my 2 cent's worth.",
      "MessageIndex": 25,
      "PostDate": "01/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792749",
      "Title": "Interesting article regarding prognosis and doctors CoolBreeze Mzmerz"
    }
  ]
}