{
  "AuthorID": "Idontdosick…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143588/profile",
  "Posts": [
    {
      "AuthorID": "Idontdosick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143588/profile",
      "Content": "Jan 21, 2012 05:45PM Idontdosick wrote: Hello Beautiful & Strong Ladies! My name is Kathy, and I have been reading your posts for over a month, everyday.  You bring me such comfort on this roller coaster, as I too believe that despite all of the love around me, no one really understands.  Knowing I am not alone, and most of all NOT CRAZY, I can find peace. I am very lucky that my SE are very minimal, and I am fighting with all of my might.  Do you know that the American Cancer Society has a 24/7 phone number that you can call, if you dont want to bother the doctors or seem like you want to call them for every little thing?1-800-227-2345     I hardly ever get sick, but I find myself feeling every twinge and pulse since my diagnosis, and think I am turning in to a hypochondriac.  I am constantly molesting myself, looking for another tumor, though I know that after 2 treatments of T/C, any cancer cells in my body are running scared or discinigrated. Again, thank you to all of the women before me, and beside me....this too shall pass!  Find joy in your day, and hug a little longer. Kathy",
      "MessageIndex": 723,
      "PostDate": "21/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "Idontdosick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143588/profile",
      "Content": "Feb 5, 2012 11:49PM Idontdosick wrote: Bailey, I have twitchy eyes too, and it is driving me crazy!  I also have episodes of extreme sensitivity to smells & sounds.  Some days I think I did too much and my brain can not handle any  more stimulation.  Once, I had to put the pan of cooling bacon grease out in the garage b/c I was going to vomit with the smell that was filling the house.  I used to love bacon. I keep telling myself hang on until March 1 and things will start to turn around!  Hope everyone has a relaxing Sun, and prepares for what the new week has to offer us. kathy",
      "MessageIndex": 942,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "Idontdosick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143588/profile",
      "Content": "Feb 21, 2012 07:31PM Idontdosick wrote: Hello  strong and beautiful ladies!  I am day 6 post chemo and I am feeling great!  Not back to normal yet, but each day is a little better, and I am so glad to be done and moving on with my recovery. Today I received a perfect card from my co-workers, and would like to share it with you.  Enjoy your day, and I hope that you find joy and strength from those that love you. Kathy  Life is  hard Sometimes crazy, mixed-up, messed up. And there you are, in the middle of it all, just doing your thing... being strong and brave and beautiful like it's no big deal. But let me tell you, girl, it is. Not everyone can do wat you can do. Not everyone can handle things the way you can. While you wonder sometimes if you're doing ok... the rest of us are just watching in wonder.",
      "MessageIndex": 1215,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "Idontdosick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143588/profile",
      "Content": "Jan 22, 2012 08:06PM Idontdosick wrote: I enjoy reading about the small things that are making everyone feel normal.  Today I went for a walk in the snow and wind, and loved it.  I am gearing up for #3 on Wed, and have started my super hydrating, and blah eating to get myself ready. My mom is coming to town to be my care taker for this part of the journey, and I hope that she brings her strength to watch me in the chemo chair.  Everytime I talk to her she tells me how helpless she feels.  I have been blessed to have many people offer to take me to my treatments or take care of my son. I hope everyone has  a good week, and can count the days until they are done......about 30 for me.  I can do this!!!! Kathy",
      "MessageIndex": 740,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "Idontdosick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143588/profile",
      "Content": "Mar 10, 2012 12:15PM Idontdosick wrote: Hello beautiful and strong ladies!! Thank you for all of the posts and the moral support.  Is anyone else tired of wearing a wig or hat?? I am ready to let my head be free, just wish I had hair.  How long will this take?  I am ready to get off of this roller coaster! I had a rough week.  My rads consulation scared me, and sent me back to the surgeon to talk about getting rid of the girls.  But, the people with MD after their name say that breast conserving therapy is the right choice for me, even though my gut tells me otherwise.  Can't believe how much I let fear control me! I had my first tatoo, and start rads on the 19th.  My center has a limited schedule so I will have to miss a half a day of school.  I have the sick days built up, but it is hard to be away from my kids that much.  I know I will survive, as well as my students. Summer break can not come soon enough! Thanks for reading!  You are specail to me, and I appreciate that I can be apart of your journey. Kathy",
      "MessageIndex": 1432,
      "PostDate": "10/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "Idontdosick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143588/profile",
      "Content": "Feb 2, 2012 05:05PM Idontdosick wrote: Hello Strong & Beautiful Ladies! I have started to round the corner after #3, and think I will have almost 2 weeks of feeling good, other than a little tired!  But, I have to say, I crashed pretty hard the day after treatment, and think I will have to strap myself down if I have another roid rage the night of my last treatment.  I over did it, and was miserable. Heather, I have started looking in to the paraben free products, and it is hard to find them in everyday stores.  My friend just became an Arbonne consultant, and has said that her products are paraben free.  I am going to check out the ingredient lists online and see about trying some.  I also think that Bare Minerals has a paraben free line, and is sold at specialty makeup stores.  I am also currently using a deodarant by Tom's of Maine. Hard to tell how well it is going to work for me, b/c I think my body chemistry is changing, and I have not had a \"good\" workout to test it with my stink factor.  Summer will tell. I am disappointed, but understanding about the time line for radiation that people posted about. My doctor has been pretty quiet about it, as the focus is getting me through chemo without losing my mind.  I just assumed radiation would start about 2 weeks after my last chemo, and I could get on with the show. I have signed up for my anniversary race at the Cleveland half marathon at the end of May, and I am hoping that I will be done, and able to pick up my \"WOG\" training in March.  I am still questioning my decision of whether I made the right choice for me with the lumpectomy.   My head was spinning so fast, that I just wanted the crud OUT OF ME, I am not sure I thought everything through.  I have large breasts, and feel pains that send me into a panic attack, and then I feel the fibrous tissues, and I panic some more, and, and,and....see what I mean?  I am so thankful for everyone who posts!  I do not post often, but I read EVERYDAY!  I feel like I belong hear, and dont have to worry about straightening my wig :) Enjoy your day!  Kathy",
      "MessageIndex": 895,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "Idontdosick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143588/profile",
      "Content": "Feb 16, 2012 12:36PM Idontdosick wrote: DONE with Chemo!!  It was a great day considering the circumstances.  My superman husband took good care of me, my MIL came for a visit (a BC survivor herself), and a dear friend made a celebration pineapple upside down cake to share with the clinic.  I wore my shirt from my first half marathon to remind me of the great feelings I had when I accomplish something difficult.  I also brought my finisher medal and my dear friend put it around my neck after the nurse pulled the iv out.  Woo hooo!  Lots of hugs from the staff, and a huge sense of relief!  Now just to get through the next 5-10 days...I know I can do it! I am waiting for a call for my first appiontment with the radiologist, not sure when I will start, but the sooner the better. I hope that everyone had a good day, or was restful if the side effects were too much to handle. Kathy",
      "MessageIndex": 1111,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "Idontdosick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143588/profile",
      "Content": "Mar 27, 2012 11:10AM Idontdosick wrote: Hello Strong and Beautiful Ladies!! I have been following everyone's posts, but have been keeping to myself.  6 rads down, trying to find my new normal. Bailey- Great big HUG!  I can totally relate to how you feel.  About 2 weeks after my last chemo, I was starting to feel pretty good, and I wanted to be \"normal\" again so badly.  I stopped reading, posting, blogging, etc anything about cancer.  I put my wig on daily, but that was about it.  I even stopped taking my depression medicine...I wanted to be better, done being sick, done being a patient, done with C!  When I had my rad consultation I flipped out!  I was an emotional mess, questioning my path again.  I called my surgeon as soon as I got home from the RO and made an appt for the next day.  I wanted to know more about getting rid of these breasts that are killing me.  They have always been too big, in the way, uncomfortable, and now \"full of disease.\"  He went through all of the info about having my breasts removed.  I toiled about this for days.  My \"superman\"  asked me, \"If you have your breasts cut off, aren't you going to worry about getting cancer anyways?\"  I had to be honest with myself...yes I will.  I will always worry about it. I had to accept that I did not have a medical degree, and the professionals around me were telling me it was my choice, but they were recommending breast conserving therapy.  The first rad was rough. I was shaking and quietly crying.  I was so scared, and felt so alone.  I pray each time they say hear we go.  I pray that the techs have me set up right, that the beams can find the cancer cells, and that the healthy cells live. I have accepted, and am only allowing my mind to believe, that I am on the right path.  There is no looking back.  I need to have peace in my mind. I was lucky to meet with a nutrionist on Fri at my center. She was so nice to me.  She  is a 15 year BC survivor, and just found cancer on her tongue 2 months ago.  I have been concerned that I have caused my cancer, I am over weight and do not make the best choices.  I have been driving myself (and husband) crazy with trying to figure out how I gave myself cancer...silly huh?  I have to learn to relax, life is too short for all of this worry and I definitely do not want to go to medical school. I hope that everyone had an uneventful Mon. I am counting down the days, without wishing my life away. Take care of yourself. I am so thankful you are here with me. Kathy",
      "MessageIndex": 1585,
      "PostDate": "27/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "Idontdosick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143588/profile",
      "Content": "Jan 26, 2012 06:22PM Idontdosick wrote: Hello beautiful and strong ladies! It is 230 am and I think I am on a steriod high after a \"good\" treatment #3 yesterday.  I was able to come home, light exercise on my eliptical for 45 minutes, attend soccer practice for an hour, pick up my car (and drive), eat a decent blah dinner, and watch the one of my recorded shows.  I hope this lasts, but afraid the crash on Sat will be hard.   I am trying to keep my head one day at a time, but that is SOOO hard.  Though I wish this was not apart of my life, I am so blessed that I am able to tolerate what is thrown at me.  I hope that everyone can have a day of feeling good on Thurs. ckk - my MO put me on an antidepressant right away, even though I told him I did not feel depressed, just anxiety about what was happening to me, and all of the unknowns.  He was concerned about becoming hooked on the ativan that the surgeon put me on, and said the short term goal was helping me feel better, so I can be the strongest fighter (physically and mentally) that I can be.  I DO NOT regret the decision at all.  I have always had terrible emotional mood swings with my \"cycle\", so I knew it wouldnt hurt me.  I hope you can find some peace. Heatherw - congrats on your goal!  I am signed up for the Cleveland half marathon (3rd anniversary) and I am looking into joining one of the charity/training teams this year. I told my doc that he had to have me patched up so I can start training soon. My bro wants to do a 3 day event in Aug for a total of 60 miles.  Sounds like a lot for a turtle, but my motto is slow and steady! I hope that you find joy in your day... call/talk to someone to cry on their shoulder (you deserve the release and it is a sign of strength not weakness), do a random act of kindness (always makes my heart smile), take an extra nap, exersice (walk in place for 5 minutes, do a few squats in the kitchen while you are waiting for something, situps), or google find joy in your day ...http://www.psychologytoday.com/blog/now-is-everything/201106/50-ways-add-joy-your-day. Take care of yourself, and let others help you. Kathy",
      "MessageIndex": 779,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "Idontdosick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143588/profile",
      "Content": "Feb 15, 2012 12:19PM Idontdosick wrote: Hello Beautiful & Strong Ladies! This is the eve of #4, and the final day in \"the chair.\"  I am exicted and nervous all at the same time. I am soooooooooo ready for this $#!t to be over with.  I am looking forward to finding out what comes next.  I need more info as I am still debating on whether to go forward with the rads or revisit the idea of mastecomy.  I am a planner, and feel like I am in the dark about my future.  I feel so lucky b/c my SE's have been minimal, and after the first week, I hardly even believe the I am on this yucky road.  I dont feel like a survivor, more like a champion.  Tomorrow I am wearing my Cleveland 1/2 marathon shirt with my finishers medal.  I am going to finish this with the strength that I use to endure 13.1 miles.  I am looking forward to my next goals: finishing rads, training for Cleveland, and then completing my 5th half marathon. I am very greatful to the ladies who have walked the path before me, and appreciate all of the info that everyone shares.  Thank you!  You have been so helpful in my journey. I am so surprised what everyone is eating. My MO gave a do & dont list of foods to try to help me be gentle on my digestive track.  I am hoping that there is a Onco Nutritionist in my area so I can work to improve my eating and loose a few pounds to help eliminate some of the extra estrogen in my body.  For the ladies who were ER+, what was you percentage?  Mine was 10% and I need to research about how significant that is. My MO has mention \"anti'hormone\" meds after chemo, but has not been very specific. Thank you for reading, and I hope everyone felt loved today!  I know that I did! Take care Kathy",
      "MessageIndex": 1096,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "Idontdosick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143588/profile",
      "Content": "Mar 14, 2012 09:42PM Idontdosick wrote: Hello beautiful & strong ladies!  It is good to read that I am not alone.  Intellectually, I know that I am not the only one with the feelings that I have.  The support on here, whether  you know it or not, is priceless to me.  I have been an emotional basket case lately, since the end of chemo. Scared about the next decision...did I make the right one to help me live a long life?  I am going through with radiation that was recommended by my MO, S, RO, several nurses, and a comment from my husband to help me put my fear in perspective.  I was anxious and worried that I had made the right decision to keep my breasts.  Now, I have my tatoos, and will begin radiation on the 19th keeping the attitude that this is the right path.   I am struggling with finding my new normal.  I spent the 3 months of chemo making all of the right choices, begging to be normal again.  Now that chemo is over, I have gone a little ape $#!T, not making the best choices.  I know that I can get back on track, and I know that I should cut myself some slack, but I feel that I am killing myself.  I do not have a family history of BC, so it must have been the choices that I made, right?  I dont know!  The doctors dont know!  I hope this phase of the roller coaster passes soon.  I am excited to support my HS student Relay for Life team this Sat.  They are holding a polar plunge in 70 degree weather, and I am going to go with my husband and son.  I plan to wear my fight like a girl shirt, with some borrowed boxing gloves, and my husband is going to wear his superman t-shirt that I bought him.  I am going to try and focus on the positive and the things that really matter.  I hope everyone can find joy in their day.  I truly appreciate this forum as a place of support, info, and comfort.",
      "MessageIndex": 1482,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "Idontdosick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143588/profile",
      "Content": "Feb 25, 2012 09:11PM Idontdosick wrote: OMG Rachel!  I almost lost mine yesterday, had to put my hand on my head to hold it together.  I am sure you handled it with grace. I too have had pains in the area of my lumpectomy, and my MO said it is part of the healing process.  I made him tell me again, because I am so afraid of the cancer coming back.  I only hopes it subsides and my brain will let me get through the healing process without going back under the knife.  I am still questioning my decision to do the lump vs. all of it. I am trying to move on with things and look for better ways to live a healthier life.  Cancer does not run in my family and I know that something environmental turned on the cancer cells in my body.  Today, I have been looking at how to have a backyard chicken coop. I hope I am not going off the deep end.  Who knows, maybe this city girl will find a new way to live.  I never dreamed I would want to have chickens in my backyard, but life is full of surprises these days. Take care of yourself, you deserve it. Kathy",
      "MessageIndex": 1273,
      "PostDate": "25/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    }
  ]
}