{
  "AuthorID": "iHEARTu",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97122/profile",
  "Posts": [
    {
      "AuthorID": "iHEARTu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97122/profile",
      "Content": "Aug 28, 2010 09:22PM iHEARTu wrote: Hello. I don't mean to frighten you, I had a bloody discharge from only my left nipple and it was DCIS. Yes, insist on getting a biopsy.  Like Elamar, I'd want to know what that lump was. A sample of the tissue would seem to be most accurate for a correct diagnosis. Perhaps a second opinion would be in order, IMHO? I will be thinking of you. -c",
      "MessageIndex": 8,
      "PostDate": "28/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/757317",
      "Title": "My MRI was negative!! heyjude62 elimar"
    },
    {
      "AuthorID": "iHEARTu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97122/profile",
      "Content": "Feb 20, 2010 11:34AM iHEARTu wrote: Sorry this is happening! Someone had asked about this on another forum and hadn't heard about Alloderm or what it was made of for that matter!! Then on Friday I noticed something different on one of my incisions sites and decided to going for the PS for them to take a look. The first thing the nurse asked was, \"I see we used Alloderm on you'?, and my heart just sunk. They didn't see any signs if infection but I have to go back in on Monday to make sure. AlloDerm is a dermal graft/implant material made from donated skin!!!!! The moral of all these stories is ASK QUESTIONS! I was SHOCKED they used this. Not that I don't trust my PS, and I believe this product is the common practice, but it would have been nice to know this...but then again, did I...UGH..so much to know. GOOD LUCK!!! CAthy",
      "MessageIndex": 3,
      "PostDate": "20/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748650",
      "Title": "Has anyone had a reaction to alloderm? chris14 chris14"
    },
    {
      "AuthorID": "iHEARTu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97122/profile",
      "Content": "May 13, 2010 06:26PM iHEARTu wrote: Oh how I am with all of you!!! Sometimes I fix the imaginary (steel) bra I have on...LOL!! My sternum always aches B U T soon no more b/c my exchange is in 11 days!!!!! Most expanders are high, so no worries:) Here's a very touching and informational youtube video of a brave breast cancer survivor who talks about her journey and shows her filled expanders. She has a few, but here is the first, www.youtube.com/watch?v=OcvkiT...",
      "MessageIndex": 15,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/751837",
      "Title": "These %$@* TEs! joyko mawhinney"
    },
    {
      "AuthorID": "iHEARTu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97122/profile",
      "Content": "iHEARTu wrote: I wasn't sure where to past this? I have a friend who for the last few week has been going through tests. She has been diagnosed stage iv, and so young, 41 with two not in elementary school yet. We've have once connected through FB so we have been communicating that way only. It had been a few days since we've talked so I asked her if her surgery was set...and now she says she has spots on her liver, breast bone and other places! I have NO IDEA what to say. Please help :) Catherine DCIS 10cm+ / grade 3 / bi-lat mx 1.5.2010 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/765094",
      "Title": "What to say to friend? iHEARTu Shirlann"
    },
    {
      "AuthorID": "iHEARTu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97122/profile",
      "Content": "Mar 28, 2010 08:20AM iHEARTu wrote:",
      "MessageIndex": 1,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750429",
      "Title": "80 years old......???? Mamita49 ruthbru"
    },
    {
      "AuthorID": "iHEARTu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97122/profile",
      "Content": "iHEARTu wrote: http://minnesota.cbslocal.com/2010/11/16/mayo-clinic-to-offer-proton-beam-cancer-therapy/ Thought I'd pass this on...... DCIS 10cm+ / grade 3 / bi-lat mx 1.5.2010 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/760829",
      "Title": "Mayo Clinic To Offer Proton Beam Cancer Therapy iHEARTu iHEARTu"
    },
    {
      "AuthorID": "iHEARTu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97122/profile",
      "Content": "Mar 18, 2010 07:55PM iHEARTu wrote: Kimmie4- come to think of it, my onco looked at me in amazment when I told him I was doing the BMX too! I apprecited his concern, and he said he wanted me to know my options. He was the only one who made me 2nd guess myself. Good luck!!!cathy",
      "MessageIndex": 15,
      "PostDate": "18/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/749207",
      "Title": "Stage 0 options ambyrp Kimmie4"
    },
    {
      "AuthorID": "iHEARTu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97122/profile",
      "Content": "Feb 20, 2010 01:18PM - edited Feb 20, 2010 01:20PM by iHEARTu Hi lovemygarden, My mx was 1.5.20 and yes, the same thing happened to me. The first two weeks were relatively uneventful,l then I started to get the phantom feelings and the itchies started.  With the phantom feelings I thought my nipples were well, nipping out. Then the creepy crawlies started, I thought I was going to go crazy. Ice helped a bit to get the edge off and I used some heat too, just the edge off. I did take some alprazolam, which seemed to help some. I guess it works on the nervous system. You get those itchy feelings because the nerves are trying to regenerate and find their 'new' home. My PS encouraged me to rub and lightly massage by breasts to help the nerves, which has helped too. I wore a cashmere zip up sweater alone and opened it up when I started to get that feeling. It REALLY does get better. I'm 5 weeks out and now it only occasionally happens if I wear something too tight or the seams of my shirt are too rough. Good luck, and take it easy. I'm learning the hard way by not resting. My PS gave me a verbal whooping that I'm doing too much...so take a nap when you get a chance:) (((H U G S))) Cathy",
      "MessageIndex": 6,
      "PostDate": "20/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748642",
      "Title": "BMX, discomfort just starting 2 weeks out? lovemygarden lovemygarden"
    },
    {
      "AuthorID": "iHEARTu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97122/profile",
      "Content": "Mar 18, 2010 02:08PM iHEARTu wrote: These were some of my Pros and Cons, I'm sure there are more, but off the top of my head... Cons -No feeling (arousal) -Long recovery -Not real breasts -Double the itchies while nerve endings were healing, plus just the double of everything Pros -Less breast tissue to worry about. I'm a bit of a worry wart and would worry about the 5 to 10 reocurrance percent risk rate. Plus I'm 40, so it's relatively younger to be diagnosed, and you even younger -Perky girls if you decide to reconstruct -No bra if you choose to do so -Symmetry -No rads or chemo, although I would have had to have a single mastectomy because my area was pretty large, 10+ cm -No Prosthesis Good article www.cbsnews.com/stories/2002/0... I NEVER looked back! Good luck on your decision! -Cathy",
      "MessageIndex": 13,
      "PostDate": "18/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/749207",
      "Title": "Stage 0 options ambyrp Kimmie4"
    },
    {
      "AuthorID": "iHEARTu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97122/profile",
      "Content": "iHEARTu wrote: Hello- The spots look like birthmarks that trail along the sides of an incision from the 'nipple area' to the bottom underneath my breast. They appeared underneath the scabs. I don't know if they're part of the healing process and eventually go away? I'm 7 weeks post op and they've been there a while. I didn't have these before my surgery? Has anyone experienced this or perhaps may know about it? DCIS 10cm+ / grade 3 / bi-lat mx 1.5.2010 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748899",
      "Title": "Brown blemishes around incisions...? iHEARTu RegulJ"
    },
    {
      "AuthorID": "iHEARTu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97122/profile",
      "Content": "May 13, 2010 09:00PM iHEARTu wrote: I went to see the BS and she said all of my breast tissue was removed, so it couldn't be a fibrocystic cyst. The cyst is about where the nipple would have been. The BS did an ultrasound and said it was in my muscle and all looked fine and nothing to worry about. She thought it was a small sernoma (sp?) and PS wasn't concerned. If the lump would have been on my BC side I would have freaked, but all is well. Hope that helps? -catherine",
      "MessageIndex": 3,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733502",
      "Title": "Continued fibrocystic changes AFTER mastectomy? sherry64 phoenixsmom"
    }
  ]
}