{
  "AuthorID": "ik0106",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46571/profile",
  "Posts": [
    {
      "AuthorID": "ik0106",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46571/profile",
      "Content": "ik0106 wrote: While I realize everyone is a little different, was is the average time to stay in the hospital after a Bilateral Mastectomy with immediate implant insertion and how long can you drive or at least go out with someone else driving? What is a reasonable time to be able to go back to work (desk job) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/871713",
      "Title": "Recovery Time ik0106 ipenelope"
    },
    {
      "AuthorID": "ik0106",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46571/profile",
      "Content": "ik0106 wrote: I have to go for a diagnostic mammogram tomorrow.  This all started back on May 8th when I got a call that they saw some calcifications on my routine mammo.  I was supposed to go for the diagnostic on June 12 but got a call a few days before cancelling it because the doctor wasn't going to be in that day. I have spent almost every day since May 8th reading about calcifications and have been kind of calm but now that I know the diagnostic mammo is tomorrow, I am getting very worried.  I was told I would get the results right then and there, but I am just wondering if I am told I need a biopsy how soon do they usually schedule it?  Would I need a surgeon or can they do it at the breast center?  What type of biopsy do they usually do for calcifications?  Thanks for listening Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707488",
      "Title": "Diagnostic Mammogram Tomorrow ik0106 omo"
    },
    {
      "AuthorID": "ik0106",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46571/profile",
      "Content": "Jun 18, 2008 12:01PM - edited Jun 18, 2008 12:02PM by ik0106 Thanks to all of you for your compassion.  I just got back from the mammo and I am happy to report my calcifications are benign!  They first took 3 views and then did a compression mammo.  The hardest part was waiting for the radiologist to come into the room.  I feel like a weight has been lifted from my shoulders. ",
      "MessageIndex": 4,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707488",
      "Title": "Diagnostic Mammogram Tomorrow ik0106 omo"
    },
    {
      "AuthorID": "ik0106",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46571/profile",
      "Content": "Jun 18, 2008 04:47PM ik0106 wrote: Omo, When I called to schedule the mammo I was told I would get the results immediately.  After the tech did the mammo she had me wait a few minutes and then the radiologist came into the room with the good news.  I hope you get the same news as I got.  Good luck",
      "MessageIndex": 8,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707488",
      "Title": "Diagnostic Mammogram Tomorrow ik0106 omo"
    },
    {
      "AuthorID": "ik0106",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46571/profile",
      "Content": "ik0106 wrote: I had a biopsy on Friday and got a call today from the Radiologist who performed the biopsy, She told me it is IDC but it is very tiny (5mm) and caught very early and from all my imaging (sonogram, mamogram) there doesnt appear to be any lymph node involvement. She told me a nurse navigator will call me tomorrow and I also have an appointment with my OBGYN tomorrow who will set me up with a breast surgeon. The radiologist assured me this is very curable but I am still a wreck. Thanks for listening and any words of encouragement would be greatly appreciated Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/871656",
      "Title": "Just Diagnosed and very scared ik0106 Sofiejo"
    },
    {
      "AuthorID": "ik0106",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46571/profile",
      "Content": "May 21, 2019 07:15PM ik0106 wrote: I am hoping to meet with the surgeon ASAP, my OBGYN has good connections and she should be able to get me to one of the soon. The timing for all this stinks, I just found out my job is going to be be closing up shop and I will be out of a job on Aug 31 so I am hoping to get everthing done by then, I am not too worried about sick leave. If I just need a lumpectomy I dont think I will need much time off ( I can also work from home for a few days) We are having an engagement party for my daughter on June 22 and dont want to put a damper on that/\\ ",
      "MessageIndex": 3,
      "PostDate": "21/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/871656",
      "Title": "Just Diagnosed and very scared ik0106 Sofiejo"
    }
  ]
}