{
  "AuthorID": "IllinoisNat…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
  "Posts": [
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Dec 8, 2013 11:14AM IllinoisNative wrote: I was also diagnosed at 36 with IDC three years ago. Now I'm doing great. Now, I'm not going to lie, the first year was rough but it more emotionally draining than anything physical (xanax helped!!!). I had surgery first, fertility treatments, chemo, then radiation. My doctor told me I needed chemo for three reasons: my age, the size of my tumor (4 cm), and the aggressiveness of my tumor (Grade 3). I handled chemo relatively well. I was in fairly good shape, had no other medical issues, and was young. I also handled fertility treatments and radiation well. I was also lucky that I had no node involvement. While none of it was fun, it was totally doable. I'm very sorry you have to go through this. :( I chose a lumpectomy with radiation for a few reasons. One, I was really attached to my breasts despite the fact that they were clearly trying to kill me...lol. Seriously, though, I liked them. They weren't too large or too small. Two, I didn't want to lose feeling in my breasts. Three, the outcome was the same with lumpectomy with radiation as it was with mastectomy. Four, I didn't have the time to take from work for the recovery it would have taken for the mastectomy. I mean, I would have taken the time if I had to but financially it would have been much more difficult. Five, once they are gone they are gone...as opposed to a mastectomy which I can always have at a later date should circumstances change. Six, recovery. After everything I was going through, I wanted an easier option. A lumpectomy was a piece of cake. A Mastectomy is so much more involved...more time, more appointments, more pain, more help, more money. I don't regret my decision. I just have a slight indent in my left breast from where the tumor was and my scars are barely noticeable. I'm happy with my decision and the results. Whatever you decide or whatever your options are, it will be the right decision for you. Good luck on your journey.",
      "MessageIndex": 8,
      "PostDate": "08/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815331",
      "Title": "Invasive Ductal Carcinoma - age 36.... oh crap!! Tam178 AndreaJ50"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Apr 22, 2012 11:23AM IllinoisNative wrote: I would do the genetic testing just for your family.  It may help others in your family. As to the statistics...I defy the odds.  Less than 4% of women under forty get breast cancer and I got it (36 yrs old at diagnosis).  I had less than 1% chance of being BRCA 2 positive after my BRCA 1 came up negative and I got it.  I had less than .05% chance of being first generation BRCA 2 positive and I got it.  Therefore, 18% chance is huge to me...LOLOL.  I remember my genetic counselor told me not even to get the BART test after my BRCA 1 came up negative because the chance I was BRCA 2 was so incredibly small.  Only because my insurance paid for it did I get that test.  She actually told me that my situation changed how she dealt with her other patients.  She now recommends every get the BART test if their insurance can cover it no matter how small the statistic. I had a lumpectomy before my genetic testing came back so I only had a lumpectomy.  My doctor told me even with the gene, the statistics for survival were about the same for lumpectomy vs mastectomy.  Although a lumpectomy does have a slightly higher percentage of recurrence (which, of course, means I'll get it ). Even if I had known I had the gene, I'm not sure I would have opted for a mastectomy.  Because, like you, the drains scare me.  And not having feeling in my breasts would scare me.   I love my boobs...even though they are clearly trying to kill me.  It's like an abusive relationship.  ",
      "MessageIndex": 6,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/786281",
      "Title": "Sister and I just diagnosed within a week of each other bevg49 AnewBeginning"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Apr 22, 2012 11:12AM - edited Apr 22, 2012 11:13AM by IllinoisNative I was VERY scared and don't do pain well, either.  In fact, before my diagnosis I had never had any type of surgery before.  I don't even think I've taken anything stronger than an advil in my life.  Therefore, I was scared of everything. I have to say nothing was as bad as I had feared.  I virtually had no pain through this entire process...and I had a lumpectomy, node removal, port installation, chemo, radiation, fertility treatments, etc.  I never had to use my vicodin prescription.  Of course, I didn't have to have a masectomy, either.  But everything was very manageable.  The only thing I semi-relied on was xanex.  I was so TERRIFIED in the beginning that xanex (and some ativan) helped me sleep, show up for chemo, and do the surgeries...lol. Being scared to death is normal.  I would look into some anti-anxiety meds (and before my diagnosis I was too scared to take any kind of medicine...my how things change).  It really does help in the beginning.  And the beginning of this journey is the absolute WORST part.  It really does get better.  Good luck!",
      "MessageIndex": 3,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/786281",
      "Title": "Sister and I just diagnosed within a week of each other bevg49 AnewBeginning"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 23, 2014 07:41AM IllinoisNative wrote: I was 36 when I was diagnosed.  I tested positive for the BRCA 2 gene.  I opted for the lumpectomy, chemo, radiation route.  I did not want a mastectomy and I didn't need one.  The gene just tells you the likelihood of getting cancer.  You already have it. I chose a lumpectomy for a variety of reasons...even with a mastectomy, I would have needed chemo, financial reasons, recovery time for healing is faster/easier, the fact that I would NEVER have feeling in my breasts with a mastectomy, a mastectomy vs lumpectomy/radiation have the same survival rates, and I viewed pictures of mastectomy reconstructions and was horrified.  I found out the goal of mastectomy was to get you looking normal IN clothes not out of them. If I needed a mastectomy, I would have had it.  But with my tumor, grade, clean margins, stage, etc., I didn't need one.  It's a very personal decision.  Good luck.",
      "MessageIndex": 2,
      "PostDate": "23/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/822874",
      "Title": "Lumpectomy vs mastectomy/ BRCA gene Scaredmama35 lintrollerderby"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 1, 2011 04:33PM IllinoisNative wrote: Hi guys!  I'm currently going through radiation (4 weeks instead of 6).  Started in June and I'll be done mid July.  I'm starting to get a little red but they said I'm right were I should be.  I'm just glad I get three days off!!! Question about weights above.  I had 4 nodes removed and they were all negative.  I forgot to ask them about doing weights on the side being treated.  I've heard anything from 5 to ten lbs.  I don't have lymphadema...would lifting 5 lbs put me at risk? Thanks.",
      "MessageIndex": 347,
      "PostDate": "01/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 14, 2011 03:14PM IllinoisNative wrote: Well tomorrow is my last day of radiation.  I only had to do four weeks but at a higher level of radiation.  The last three have been boosts.  I'm red, itchy, and tender but the skin looks good and my RO is very pleased.  No blistering, sores, open wounds.  I'm just tired.  I could sleep all day if someone would let me. And I never quit wearing underwire.  I just can't.  The only cream I used is what my RO gave me and that is Radioplex.  The whole experience has not as bad as I anticipated, thank God. And are the shelf camis the ones with soft built in bras? Next is the journey on Tamoxifin.  Oh, joy.",
      "MessageIndex": 486,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 14, 2011 07:03PM IllinoisNative wrote: Suebak, as far as my period goes, my last chemo was 4-29-10.  I got my period July 5 for the first time since being done with chemo (2 months later)...and while in the middle of radiation.  So it didn't really affect me.  I'm 36 years old.",
      "MessageIndex": 491,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 2, 2011 08:14AM IllinoisNative wrote: Thanks, GmaFoley!  I guess I'll have one toned arm and one that, well, isn't.  lol Have a great weekend, ladies.",
      "MessageIndex": 351,
      "PostDate": "02/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 2, 2011 05:34PM IllinoisNative wrote: I don't remember anyone saying I needed a boost, either.  I'm IDC, stage 2a, Grade 3, and 0/4 nodes.  I also had the lumpectomy and my margins were clear.  And I do trust my doctor.  Anyone want to enlighten me?  Do I need one?",
      "MessageIndex": 1,
      "PostDate": "02/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/771115",
      "Title": "Radiation Boost lindaonthelake lindaonthelake"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Aug 19, 2011 09:26PM IllinoisNative wrote: Don't wait.  It can make all the difference if you catch it early.  You are young and that is in your favor (mostly likely it will be nothing). You can always get a job that has health insurance...and I believe in another year (I could be wrong), they are doing away with pre-existing.  Also, if you go from your parents coverage to your own, they may not have pre-existing if you have continuous medical coverage (no gap in coverage between one policy and another).  I could be wrong on that one. If you have coverage now...and for the next year...go see the doctor.  Most of the treatments are within that first year.  Don't wait until you have nothing.  What if it gets worse after a year and then you have nothing?  That will be a nightmare. And if it's nothing, you'll have peace of mind by having it checked out now.   Good luck.",
      "MessageIndex": 1,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773350",
      "Title": "Update: waiting to see a dr waybacktexas kikiwiki"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Apr 17, 2012 07:23PM IllinoisNative wrote: Josie, although I'm not a stage 3, I do appreciate what you originally said.  Therefore, I'm glad you shared your feelings.  I had feelings similar to yours.  I was jealous of all the stage 0 and 1's, I was jealous of all those that didn't have the BRCA 2 gene and didn't have to have their ovaries ripped out of them, of all those who got diagnosed later in life (I was diagnosed at 36) because their youth wasn't ripped away from them, of all those who had lesser grades than me, of all those that had children first since I may never get the chance.  Those were my feelings in the beginning.  Because less than 5% of breast cancer patients were diagnosed under 40 and I was the lucky one.  There was less than 1% of breast cancer patients who had the BRCA 2 gene and I was the lucky one.  Then there was the less than .05% who were first generation BRCA 2 and I was the lucky one.  I hate statistics because I literally defy the odds. But I think as I move through this journey I've been on, I've realized that we are all scared ishless when we are diagnosed.  None of us knew our stage when they said we had cancer.  The fear of the unknown is something we all share.  We all go though every back ache thinking our cancer has spread.  We share a similar journey that I hope unites us in the end.  But the feelings you had are completely normal...as are the feelings you're having now.  I'm glad you shared.  :)",
      "MessageIndex": 166,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780849",
      "Title": "Why am I only ok talking to stage III ladies?feeling like a jerk Josiekat lkc"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Apr 22, 2012 02:42PM IllinoisNative wrote: I had many days like that.  I would wake up crying, cry in the shower, cry on the way to work, cry at work, cry on the way home...lol.  Every commerical about family made me cry.  And I'm not even a crier.  And at Christmas, I was a puddle of tears.  Could. Not. Stop. Now that I'm almost a year out from my last treatment, I recently had another episode.  I had to go see a new family doctor.  She asked about my history.  I just mentioned the word cancer and spent 40 out of the 60 minutes crying hysterically in her office.  I honestly thought I was over that part.  It's funny what triggers it. I wish you strength and peace through this journey.",
      "MessageIndex": 12,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/786257",
      "Title": "Today is an emotionally bad day :( teeballmom ByFaith"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jun 30, 2011 02:24AM IllinoisNative wrote: When I heard I had breast cancer in November of last year, I was 36 and no children.  So I went through fertility treatments (I only had one cycle to get the eggs I needed since I had to start chemo).  I have two embryos waiting for me.  After I went through fertility treatments, I tested positive for BRCA 2.  That's not going to stop me from trying to get pregnant with them.  What's worse is that I was diagnosed with first generation BRCA 2 (currently forth person in history)...so I didn't even have a family history to blame it on! ;)  Just because I have the gene doesn't mean they will get it...and even if they get the gene, it doesn't mean it has to develop into cancer.  So I'm not letting that stop me.  Anymore than having alcoholics in my family is preventing me from having children.  LOL!   Life is one big, messy risk.  Go for it!",
      "MessageIndex": 19,
      "PostDate": "30/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/730717",
      "Title": "BRCA 2+..still want to have children.. what can I do? MKMS22"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 15, 2011 05:33PM IllinoisNative wrote: Your tumor is tiny.  Mine was 4 cm and I had clear margins and no lymph node involvement.  Mine was Grade 3 which is more aggressive (faster growing) than yours. I had a lumpectomy and some lymph nodes removed.  I have a scar on my left breast and under my arm pit, but that will fade with time.  My breast looks fine.  It slightly indents but it's not really noticable.  The surgery was a breeze for me and I recovered quickly.  I think I took one vicoden for the whole ordeal...and I'm not sure I even needed it.  They told me to take it before the pain hit.  It just never did. Good luck!",
      "MessageIndex": 15,
      "PostDate": "15/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771647",
      "Title": "just diagnosed, overwhelmed and worried katehudson25 katehudson25"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 24, 2011 09:51AM IllinoisNative wrote: Well I was diagnosed last November at age 36.  And my cancer, stage, size, and grade are worse than yours...and my doctor still assures me I'm going to live to be an old lady.  I also had the genetic testing (no family history) because I was under 40.  I am BRCA 2 positive.  I'm also first generation since my parents both tested negative (and, yes, my dad had a paternity test just to make sure...lol). The scariest part is the beginning.  Once you have a plan for treatment, you'll feel more relaxed.  Good luck.",
      "MessageIndex": 12,
      "PostDate": "24/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772030",
      "Title": "just diagnosed yesterday.... MustangSally67 Jen42"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 16, 2011 04:03PM IllinoisNative wrote: kitty, the waiting is unbearable.  You're are in the toughest place right now.  The biggest stress/fear period for me was feeling the lump to the first chemo appointment.  Everything after that was a breeze.  Once you have a plan in place, you'll feel better. I also couldn't stop crying during that time period.  I cried when I woke up, I cried in the car on the way to work, I cried at work, I cried on the way home, I cried at home.  Hell, I cried at the supermarket.  Every commercial, every TV show, every person who was compassionate set me off. My doctor told me eventually I'd get to a place where \"I have breast cancer\" wouldn't be the first thing I thought of when I woke up.  I'm only about eight months into this so I'm not quite there yet.  The good news is that I went through chemo relatively easy, I just finished radition, I went through fertility treatments...I only have to get through a few years of Tamoxifin and I'm good to go!  I finally see the light at the end of the tunnel. Best wishes and I hope everything works out for you!",
      "MessageIndex": 8,
      "PostDate": "16/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771698",
      "Title": "Do Breast Surgeons do anything at virst appointment kitty16 IllinoisNative"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 16, 2011 02:05PM - edited Jul 16, 2011 02:08PM by IllinoisNative Mine did.  I felt a lump and went to see my gyne.  She gave me an order to go see a BS.  I called the breast care center and told them I had a lump.  They scheduled me right away.  On my first visit, they did an ultrasound (didn't even meet the doctor yet).  The ultrasound showed a mass wrapped in a cyst.  They went and got the doctor.  He aspirated it and biopsied it and immediately sent me across the hall for a bi-lateral mammogram. So, on my first visit, I had an ultrasound, aspiration, biopsy, and mammogram.   Good luck.",
      "MessageIndex": 5,
      "PostDate": "16/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771698",
      "Title": "Do Breast Surgeons do anything at virst appointment kitty16 IllinoisNative"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jan 9, 2012 10:04PM IllinoisNative wrote: I would be getting a new doctor just based on the staff.  I worked in a medical office and a bad staff is a bad sign.  I simply won't put up with a lack of compassion or disinterest.  Of course I wouldn't be going to a doctor who insisted on an appointment no matter the results or what *I* wanted.  I pay for this service. If I want to know my results by phone, they better d@mn well tell me on the phone.  And if they got the results on Friday, I should have them on Friday. My breast surgeon is OUTSTANDING!  I have his home cell number.  He's managed my care since day one and I haven't had one problem.  Not one.  And is staff is simply amazing.   It's not your fault that you fell through the cracks.  My doctor didn't allow me to fall through the cracks.  They had the results on Friday and it's the end of the day on Monday.  There is no excuse for that.  If I fell through the cracks, I'd be getting a new doctor.  As if you aren't stressed enough!!!",
      "MessageIndex": 154,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780533",
      "Title": "How did you hear biopsy results--phone or appt? frazzledmom schoolmom"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jan 6, 2012 06:22PM - edited Jan 6, 2012 06:25PM by IllinoisNative I went in for the biopsy on a Tuesday and they told me I'd have the results in two days.  I called their office at 4:40pm on Thursday night because I wanted to know before they closed.  They told me my doctor would call me back.  Well, he had four radiologists review it and he was on the phone discussing it when I called.  He called me back after 6:00pm and told me it was cancer and he wanted to see me in his office the following day on Friday.  He spent two hours with me and my family going through all my questions. If he wanted to see me in his office before giving me the results, I would have known it was cancer anyway.  So I don't see the big deal with him telling me over the phone.  I would rather know sooner rather than later.  Although my world fell apart when he told me...lol. It all happened very quick.  I called the Breast Care Center when I got a lump.  They fit me in immediately.  I had a ultrasound, biopsy and bi-lateral mammogram the same day and two days later it was confirmed.  I think I was in surgery about a week later.",
      "MessageIndex": 69,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780533",
      "Title": "How did you hear biopsy results--phone or appt? frazzledmom schoolmom"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jan 9, 2012 10:09PM IllinoisNative wrote: Oh, boy.  Well, what did the radiologist's report say?  LOL",
      "MessageIndex": 157,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780533",
      "Title": "How did you hear biopsy results--phone or appt? frazzledmom schoolmom"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 8, 2011 07:47PM IllinoisNative wrote: Teddy, when I had radiation, they told me that I had an increase in lung cancer.  Could that be what happened to you? Because you're scaring me.  I also felt great during chemo and radiation.  I also had clear margins and chemo.  The only difference between us is that my tumor was larger but I didn't have a positive lymph node.  It worries me that I will get secondary cancer.",
      "MessageIndex": 125,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 8, 2011 08:10PM IllinoisNative wrote: Teddy, I should have put a LOL after, \"you're scaring me.\"   It's just that you think you've got all your bases covered with chemo, radiation, hormone therapy and then it can still spread.  It's such an uncertain place to be in.  Would they have done chemo on you just because of your tumor size and high grade even if you didn't have some evidence of cancer in your lymph nodes? I suppose the lucky thing about having grade 3 is that it responds well to chemo.  It's the small things that make me happy.  Ha!",
      "MessageIndex": 128,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 8, 2011 07:40PM - edited Jul 8, 2011 07:44PM by IllinoisNative Intereting topic. In my case, my tumor died...so it filled with blood making it large enough for me to detect it.  When my doctor biopsied it, he originally thought it was a papilloma since the needle filled with blood which mimiced a papilloma. So, did my immune system recognize the cancer cells later and destroy them?  I had bronchitis months before and drank a ton of green/white tea along with taking mega doses of Vit C/D, etc.  So was it my immune system or did I take something that killed them?  Because I didn't have the lump then.  Did anyone have a dead tumor when they were diagnosed like I did?  Because, if it didn't get that big, it could have spread before I knew it.  I was 36 with no family history...and the kind I have is aggressive. I also have the breast cancer gene (BRCA 2) and my onco dx score was high.  But why did my body kill the tumor given all my risk factors?  I ended up having 4 treatments of chemo as a preventative.   Obviously, chemo didn't kill it.  I also wondered why I need radiation if the chemo went all over my body.  Wouldn't the chemo have targeted the cells?  They say secondary cancers are common after one has cancer...because cells know how to mutate.  But if I had the gene, didn't it know how to mutate all along, in which case is chemo effective at all?  Because even if it kills everything, my cells already know how to mutate.",
      "MessageIndex": 121,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 1, 2011 06:50PM IllinoisNative wrote: I just read this thread.  Kasi, you remind me of myself.  I felt a sizable lump in the shower.  And a cold feeling of dread coursed through my body.  I went to see the gyne and, like you, they told me it was probably a cyst.  I am only 36 and was diagnosed right after Thanksgiving last year (about 6 months ago).  It was also IDC.  And, like you, mine was also 4 cm.  I can't even begin to tell you how utterly terrified I was...or maybe I can. Ha! Mine was a grade 3.  They told me the younger you are, the higher the grade.  Usually. But everyone has given you great advice.  The worst thing about chemo was the dread prior to it.  The anticipation of the unknown was so much worse than the actuality of it all.  And there are perks...I got a fabulous wig and can walk out the door in 20 minutes flat.  With nothing to shave or blow dry, I feel like a man.  LOL!  I'm going to miss that when my hair gets longer.  And my wig doesn't react to the humidity unlike my real hair.  I love it!  Although, in the beginning, I did get slight headaches from the tightness of it.  That eventually went away. I also went through fertility treatment since I didn't have children and didn't know if I'd get my period back.  Let me know if I can help you. I wish you much love/support/good vibrations on this journey.  *hugs* ",
      "MessageIndex": 132,
      "PostDate": "01/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Mar 17, 2012 12:59PM IllinoisNative wrote: I'm BRCA 2 positive which means I have a higher liklihood that I will develop ovarian cancer.  So mine need to come out.  I'm only 37.  My breast surgeon told me I can wait a few years since ovarian cancer, with BRCA 2 hits later.  However, it will also decrease my rish of my breast cancer coming back.  Not looking foward to losing my ovaries so early. However, considering they have breast cancer genes out there that they haven't identified, whether you had/have the BRCA gene or not, I'd think about having them removed. Heck I have the gene and my parents tested negative.  So I have no family history.  When I tested negative to the BRCA 1 gene, they told me I didn't even need the BART test.  I only did that because my insurance paid for it.  I'm  glad I did.  I would have kept my ovaries and may have been lethal.",
      "MessageIndex": 4,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/784234",
      "Title": "Just diagnosed...what about ovaries TeriR Deirdre1"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Mar 21, 2012 12:20PM - edited Mar 21, 2012 12:22PM by IllinoisNative Blood came out of my cyst when they aspirated it.  My doctor originally thought it was a papilloma.  Basically, I had a lump.  Went for an ultrasound and they found the lump was cystic and solid so they sort of knew it may be cancer.  They aspirated it and blood came out.  It turned out that the tumor in my breast died filling the cyst with blood mimicing a papilloma. Good news was that something it my body killed it or starved it...lol. It's normal to be scared.  After the aspiration, they sent me down the hall for a bilateral mammogram.  I practically ran out of the doctor's office imagining the worst.  Everyone here knows how scared you are.  It's a terrible state of mind to be in.  I'm sorry you have to go through this. It may just be a papilloma which wouldn't be that bad in the grand scheme of things.  I know it's a small comfort.",
      "MessageIndex": 1,
      "PostDate": "21/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/784475",
      "Title": "Blood apirated from a breast cyst!!! roorooep inspiewriter"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Apr 30, 2012 04:48PM IllinoisNative wrote: I got panic attacks before being diagnosed.  So you can imagine how bad it got after...lol.  I never took anything for them until I got cancer.  Now, I take xanax as needed.  I don't take it every day.  I don't even take it every week.  In fact, I can go a month without it.  I have a fear of addiction and fear of pills.  So my panic attack has to be worse than my fear of taking xanax.  That's when I know it's bad.   Some days I can talk myself out of a full fledged panic attack and some days I can't.  When I can't, I have the peace of mind of knowing I have xanax if that makes sense. My attacks also come right before bed time, if I wake up in the middle of the night, or from a situation (MRI, surgury, etc). I used to take xanax just to get me to chemo, and then they included Ativan in my chemo cocktail.  I was bad.  LOL  In my opinion, you do what works and what you need.  Period. Marijuana will never be a choice for me.  I'm allergic to smoke and can't handle any of that.",
      "MessageIndex": 25,
      "PostDate": "30/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/786627",
      "Title": "Help with Anxiety Shayne Shirlann"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jan 9, 2012 10:56PM IllinoisNative wrote: Thanks, frazzledmom!  I was wondering if it had some more information on it.  I really hope it's b9 for you because cancer sucks!  Although I've met some of the best people since my diagnosis.  I wish you all the best. :)",
      "MessageIndex": 161,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780533",
      "Title": "How did you hear biopsy results--phone or appt? frazzledmom schoolmom"
    },
    {
      "AuthorID": "IllinoisNat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131578/profile",
      "Content": "Jul 13, 2011 09:50PM IllinoisNative wrote: I'm so incredibly sorry.  We have all been there.  I remember my shock because I honestly thought it was a cyst.  Especially at my age, 36.  I was also told on the phone...but if they wanted to meet with me first, I would have known it was cancer immediately, anyway.  My doctor then told me to come in the following day to discuss everything.  My family and I spent two hours with him. And it was so surreal.  And I panicked.  And I took my first xanex.  LOL!   The hardest part, as everyone has mentioned, is the beginning.  Once I met with all the doctors and had a plan, I was much more at peace. I wish you the best!",
      "MessageIndex": 18,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771591",
      "Title": "In shock motheroftwins SoCalLisa"
    }
  ]
}