{
  "AuthorID": "IllyanaWho",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248185/profile",
  "Posts": [{
    "AuthorID": "IllyanaWho",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248185/profile",
    "Content": "Mar 7, 2017 07:16PM IllyanaWho wrote: Does anyone here have experience with abnormal findings on their post 6 month followups? I was diagnosed last July with ADH and FEA, left breast. I turned 42, at the end of July. Following stereotactic biopsy, I underwent a lumpectomy to completely remove the tumor, which pathology confirmed was ADH. I now have to have 6 months alternating scans of T3 MRI's and mammograms. When I had my MRI on Friday, the scans on the breasts came back normal (extremely dense tissue, oh joy), however the following was found: \"Indeterminate cystic lesion in the right paratracheal region extending into the mediastinum. Recommend a contrast enhanced chest CT for further evaluation.\" So, my oncologist called me this morning to schedule the CAT with dye. Wohoo, I'll be a glow worm in no time, at this rate! I was told that basically the MRI is showing a lesion on my sternum. O_O From what I can tell (brought up in a medical family: Mom, grandma and Mom #2 were all nurses, Dad and bro-in-law were firefighters/EMTs and aunt is an OT), that usually indicates the possibility, if malignant, of lymphoma, breast cancer having spread or bone cancer. Any experience in this area? I wasn't a candidate for tamoxifen due to my sister and dad's history of clotting factor 8 (they've not tested me?!) and I just underwent a hysterectomy in November thanks to the evils of endometreosis. :/ Just have the right ovary left, which had to be kept, thanks to the stupid breast cancer risk, since I can't do HRT! Grrrrr..... And I'm not a candidate for Lupron either, so endo is still rearing its ugly head. Thoughts or experiences?",
    "MessageIndex": 771,
    "PostDate": "07/03/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
    "Title": "ADH Club Chickenpants SarBar22"
  }]
}