{
  "AuthorID": "ilovemysweetmomma",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
  "Posts": [
    {
      "AuthorID": "ilovemysweetmomma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "ilovemysweetmomma wrote: Hey all, I just thought of some information that I wanted to share with you all.  With my Mom's brain tumor, she was getting really fatigued a lot.  We talked to a friend of my Mom's who is a three time brain tumor survivor(primary brain tumor)..now of like fifteen years!  Anyways, she told us that she was on Provigil for her fatigue.  We talked to my Mom's doctors and they perscribed Ritalin because they said a lot of insurance companies wouldn't cover the Provigil unless we tried Ritalin first.  Anyways, the ritalin worked for a little bit.  We then switched to Provigil which really helped for a while.  So any ladies that are feeling fatigued..I would ask your doctor about ritalin and/or provigil!  I hope this helps.  Love Megan and Kathy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739450",
      "Title": "Something that might HELP with cancer FATIGUE ilovemysweetmomma ilovemysweetmomma"
    },
    {
      "AuthorID": "ilovemysweetmomma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "ilovemysweetmomma wrote: Hello everyone, I had a question about brain mets chemo.  I've heard from various people that Xeloda crosses the blood brain barrier and can be used for brain mets from breast cancer; however, I just recieved an email from my mom's PA saying that that is not true.  Has anyone heard about Xeloda for brain mets? Thanks, Megan Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726968",
      "Title": "Xeloda for Brain Mets? ilovemysweetmomma vhqh"
    }
  ]
}