{
  "AuthorID": "ilovemyswee…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
  "Posts": [
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Oct 29, 2009 05:35PM ilovemysweetmomma wrote: Sorry you're having issues with fatigue..it's no fun to be tired when you're trying to enjoy your day.  My Mom tried ritlan first and then provigil.  They worked okay.  Ritlan was a lot cheaper.  I would definitly look into it. ",
      "MessageIndex": 2,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742991",
      "Title": "Ritlan, Provigil, etc for fatigue? Runnr terryv"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Oct 23, 2008 08:56PM ilovemysweetmomma wrote: have you gotten a second opinion yet?  If I'm not mistaken, I think they do monitor you closely during a clinical trial.  And I think if you show any sort of progression, then you can get off the study.  That's what I understand, but I'm not sure.  And just a side note about avastin..it's not actually chemotherapy, which is good in that it's not toxic to non-cancer cells.  It prevents growth of blood cells, which will hopefully prevent the tumor(s) from growing.  HOpe that helps..but if I were you I would definitly get a second opinion.  Good luck with everything. ",
      "MessageIndex": 5,
      "PostDate": "23/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723271",
      "Title": "Opinions Please KellyC saint"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Aug 23, 2009 05:19PM ilovemysweetmomma wrote: People may be in different boats..but you all are in the same lake. ",
      "MessageIndex": 70,
      "PostDate": "23/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739271",
      "Title": "Advice for metsters konakat RobinWendy"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Aug 25, 2009 11:36AM ilovemysweetmomma wrote: Has anyone ever tried or heard of this?",
      "MessageIndex": 1,
      "PostDate": "25/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739450",
      "Title": "Something that might HELP with cancer FATIGUE ilovemysweetmomma ilovemysweetmomma"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Aug 25, 2009 02:50PM ilovemysweetmomma wrote: Hey Athena, thanks for your post.  I'm so glad the provigil is at least somewhat helpful.  That's great you were able to find the drug for cheaper.  I have not ever used one of the Canadian pharmacies, but I have thought about it.  Those insurance companies really make you work for drugs, dont' they.  Frustrating.  Thanks for letting me know about Nuvigil..I had never heard of it, and I will have to check it out.  Again, thanks for your post.  Best of luck.  I wish you lots and lots of energy! Megan",
      "MessageIndex": 2,
      "PostDate": "25/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739450",
      "Title": "Something that might HELP with cancer FATIGUE ilovemysweetmomma ilovemysweetmomma"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Oct 12, 2008 03:16AM ilovemysweetmomma wrote: Hey there, my mother has a lot of experience with brain mets, so I have some advice that hopefully will help.  She told me the hardest thing about WBR was the fatigue.  THe steroid, Decadron, also caused us some issues.  They didn't tell us, but that steroid can cause people to become alittle moody on occasion and sometimes more emotional, so just a heads up on that.  Also, it's good your mom is taking something for her stomach along with the steroid, but make sure she's also taking it with milk or food to avoid those stomach pains.  Did they increase your mother's' steroid dose after that night she was having those bad headaches?  Also, in terms of chemotherapy for the brain mets, I see other people have already told you about tykerb and temodar.  Tykerb I've heard is a very good option for HER + people with brain mets.  Temodar was originally designed for patients with primary brain tumors, but it is thought it can be helpful for breast tumors to the brain.  Also, something I wish we would have don different..is to go ahead and look at clinical trials.  There is this one by Reata pharmaceuticals, it's on the www.clinicaltrials.gov website.  The drug is called RTA 744, and it is showing good promise for breast cancer mets to the brain.  Might wanna check it out.  I hope that was helpful.  Good luck to you too!!  That's awesome that the tumors are so small!!",
      "MessageIndex": 30,
      "PostDate": "12/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722063",
      "Title": "MOM NOW HAS BRAIN METS! cneal318 TripleNeg"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Oct 1, 2009 11:08PM ilovemysweetmomma wrote: I don't no much about Navalbine, my Mom was never on that med.  If I were you, just based on the fact that Navalbine is already FDA approved, I would go with that.  I know other woman on this site are on Navalbine or have been, and I hope you get a big response from them.  Also, if you choose to do a clinical trial, I'm not sure, but I think you're never guarenteed the drug.  They may give you a \"standard\" treatment instead of actually getting the Dasatinib.  You could always try Dasatinib if you don't like the Navalbine.  That's what I would recommend to my Mom..but whatever you decide I'm sure will be good.  Hugs, Megan",
      "MessageIndex": 1,
      "PostDate": "01/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741338",
      "Title": "HELP! Dasatinib or Navalbine? gma5279 gma5279"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Sep 9, 2009 10:42PM ilovemysweetmomma wrote: Connie, I'm glad your friend has you looking out for her.  I also agree that the oncologist saying her cancer is \"incurable\" is likely a sign she is stage IV.  LIke Carter said though, incurable does not be intreatable.  There are so many chemotherapies and other therapies out there now, she'll have lots of options.  In terms of financial resources I also agree with Carter, in that you might want to tell your friend and her husband to ask the oncologist and also ask the social worker.  Social workers are invaluable resources so I'm told.  Also, I would see about contacting Susan G. Komen.  Best of luck.  You're a good friend, Megan",
      "MessageIndex": 2,
      "PostDate": "09/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740173",
      "Title": "?stage iv or stage iii, No insurance? cats_love_me Irina"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Sep 15, 2009 01:33PM ilovemysweetmomma wrote: Marsha, You do sound like a fighter!  Sorry you're having to fight so hard.  My Mom had WBR and stereotactic radiosurgery.  I was wondering which you were planning on having done?  Do you have a single lesion, or multiple? Hugs, Megan",
      "MessageIndex": 1,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740420",
      "Title": "brain mets questions.......... Marsha56 chainsawz"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Oct 13, 2008 05:43PM ilovemysweetmomma wrote: I hope your scan was clear.  Just to ease your mind a little, even if for some reason you or someone else you knows ever finds yourself in a situation where it doesn't come back clear, I wanted to give you some of my mom's story.  She was originally diagnosed with the brain mets in june 06.  Her craniotomy went soo well.  She was at Wal-Mart three days later, and talking to us right when she got back from surgery..crazy awesome.  Also, there's whole brain radiation they can do, stereotactic radiosurgery (a form of radiation) they can do, chemotherapies, clinical trials.  So try and stay positive, and remember, even if you don't get the news you're looking for, there is hope.  Try checking out the brainmetsbc.org website.  Women are living longer and longer with breast cancer, so in the past there were not many people that survived long enough to get it to the brain; therefore, a lot of the statistics you may find may be more negative then they should be.  Try to keep that in mind too.  I hope your scan is clear, all this information is just knowledge you can share or have.  Good luck with everything!!  Maybe you're just stressed, or maybe it's the flu..there are so many things it could be.  No need to worry yourself.   ",
      "MessageIndex": 13,
      "PostDate": "13/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722270",
      "Title": "Scared that I have brain mets mollyboc ilovemysweetmomma"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Sep 9, 2009 12:20AM ilovemysweetmomma wrote: Hey Ellzmom, I was wondering if the CT scan they did of your Mother's head was with or without contrast? ",
      "MessageIndex": 4,
      "PostDate": "09/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739724",
      "Title": "What could it be this time???? ellzmom chainsawz"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Oct 21, 2008 04:54PM - edited Oct 21, 2008 04:55PM by ilovemysweetmomma Hey there Kelly, sorry for all you're going through.  I wanted to tell you that my sweet momma was on Avastin for brain mets.  It is not chemotherapy as it is not toxic.  It is an angiogenisis inhibitor, which means that it is supposed to cut off the blood supply to the tumor; thereby, keeping it from growing.  The only real side effects the doctor told us about were risk of bleeding, i.e., bruising, etc.  Blood pressure I think is the most common side effect, so you just need to make sure they monitor that, and I'm sure they will.  Just keep away from salty foods while you're on it, and hopefully that will also keep your blood pressure down.  Also, you might want to ask your doctor whether he was planning on putting you on Pacitaxol with the Avastin because we ran into some problems with insurance because of that.  Good luck with everything, keep on fightin'.   ",
      "MessageIndex": 23,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722986",
      "Title": "Avastin Questions KellyC KellyC"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Jan 26, 2009 07:37PM ilovemysweetmomma wrote: Hey there, I can relate to you.  I was eighteen when my mom was diagnosed with breast cancer.  I'm not sure what your question is exactly, but would love to talk to you more about it or try to answer any questions you might have.  If you can tell us a little bit more about her case that would be helpful.  Is she nervous about getting the masectomy, or is she getting a lumpectomy?  Same questions as Fumi actually.  There are a lot of different types of treatment.  Good luck, and we'll be here for you.   Megan ",
      "MessageIndex": 3,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727547",
      "Title": "my mum diagnosed a month ago.. ekyn spar2"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Oct 12, 2008 09:02AM ilovemysweetmomma wrote: Ozzie, sorry for your breast cancer and NHL..you're tough stuff.  I myself have never had cancer, but my mom did, and I tried to be very active in her care.  I don't know how comfortable you feel with your doctor, but maybe you should think about getting a second opinion..or even a third.  We did that a lot with my mom..it seemed like each doctor we went to had a different idea of what we should be doing.  And in terms of you possibly loosing your hair, I've got some brocheres from the American Cancer Society I'd totally be willing to send you..they ahve soo much stuff in there.  And Winters coming up, so if you don't mind hats, maybe you could find some comfortable ones to make things easier.  Let me know if you want me to send you the brocheres, I'd be more than happy to.  Good luck with whatever it is you decide.  It's your body, you have to go through it all..but I would try to make sure you know what all your options are before you make any final decisions..maybe that second opinion.  God bless!!",
      "MessageIndex": 27,
      "PostDate": "12/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722336",
      "Title": "I have had enough.. ozzie2 AusAla"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Apr 23, 2009 12:42PM ilovemysweetmomma wrote: Hey Questions, I don't know much about navelbine..what are your mom's hormone receptors?  Does she have mets anywhere besides the brain?",
      "MessageIndex": 4,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732953",
      "Title": "My mom's still here and moving on! Questions_77 Questions_77"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Sep 15, 2009 06:58PM ilovemysweetmomma wrote: Hey Marsha, it sounds like you have a single tumor and not multiple ones.  My Mom had a single lesion in her right temporal lobe area.  They did a craniotomy and then WBR.  It reoccured again in less than a year and we decided on stereotactic radiosurgery.  My Mom ended up having a lot of problems with the radiation including necrosis.  Looking back, I wish we would have just done the stereotactic radiosurgery.  The radiation was really hard on her.  The cumulation of them is what caused it I believe.  Everyone is so different though.  It looks like you are HER+ which is a plus because you also have a lot of chemo options that will cross the blood brain barrier.  My Mom did loss her hair, but it did come back.  It just came back alittle different.  And I believe my Mom could drive, but I wouldn't let her.  I tried to drive her around whenever I could.  But I dont' believe there are any restrictions on driving.  I've heard the main side effect is fatigue.  Also, if you haven't checked this out yet, there is a really good website about brain mets.  They discuss whole brain radiation and other treatments.  www.brainmetsbc.org.  Hope this was helpful, hugs, Megan",
      "MessageIndex": 7,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740420",
      "Title": "brain mets questions.......... Marsha56 chainsawz"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Sep 10, 2009 12:33AM ilovemysweetmomma wrote: Hey there, I don't know much about bone mets, but I know about being confussed with doctors and what's going on for sure.  I would talk to your Mom's oncologist to get more answers.  Also, if you don't feel comfortable with their decisions, your Mom may want to look at getting a second opinion from another oncologist.  Hope this is somewhat helpful, Megan",
      "MessageIndex": 3,
      "PostDate": "10/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740194",
      "Title": "No chemo therapy for stage IV? ks123 kelly1215"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Nov 20, 2008 07:43PM ilovemysweetmomma wrote: Something that helped my mom..was thinking about her cancer as a chronic illness.  She knows it's something she'd have to deal with everyday of her life..whether she was NED or not.  I don't know, I just thought that might give you a different perspective. ",
      "MessageIndex": 84,
      "PostDate": "20/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724122",
      "Title": "Me, too LisaSDCA EGAL"
    },
    {
      "AuthorID": "ilovemyswee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73471/profile",
      "Content": "Oct 13, 2008 01:21AM ilovemysweetmomma wrote: I read on a breast cancer website that it has not been proven that eatting certain foods can for sure decrease a risk for cancer; HOWEVER, fat tissue produces a small amount of estrogen and estrogen can increase a ER/PR+ person's risk for cancer.  At least that's what I understand.  I could be wrong though of course, but I do know that fat tissue does produce a small amount of estrogen, and estrogen in large amounts and/or over long periods of time can increase a women's risk for breast cancer.  So a low-fat diet is a good idea. ",
      "MessageIndex": 12,
      "PostDate": "13/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722111",
      "Title": "Yesterday's Oprah- Confused ck55 koshka1"
    }
  ]
}