{
  "AuthorID": "ILSunrise",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
  "Posts": [
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Nov 19, 2016 06:37AM ILSunrise wrote: There are so many acronyms used in these forums, I recommend you take a look at the discussion board abbreviation key. Here is a link - community.breastcancer.org/for... Your list overwhelmed me...but I'm getting ready to start chemo on December 15, so will review the list and for sure buy some Claritin.",
      "MessageIndex": 13,
      "PostDate": "19/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850163",
      "Title": "Questions about Preparation Hanging_in_there ILSunrise"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Nov 19, 2016 08:18AM ILSunrise wrote: scaredashell07 - It is really scary knowing you have to get chemo. It makes your cancer seem much more \"real\" and of course will make it visible to so many others around you. I was in a situation where I had to decide whether or not to have chemo. My MO said she discussed my case with a group of colleagues prior to recommending the treatment. Following are the reasons they recommended chemo when I had an Oncotype score is in the middle (23). I have a high KI67 rate (23), lymphovascular invasion, my ER + % 49 (not closer to 100), my PR + % 44 (not closer to 100), and my age (longer life expectancy). So, I'm going to have 4 rounds of chemo including Taxotere and Cytoxan, every three weeks. I decided to have it done through IV versus a port. I'm hoping I don't regret that decision. I'm just now at the point where I'm trying to plan for my appearance. Today is my first trip to a wig shop. So, we'll see what happens. I'm thinking I might need to get three - so I can be a blond, brunette or redhead depending on my mood!! Anyway, just a thought to try and put some fun in this process. gmmiph - Thanks for all the great information about what to expect and how to prepare for chemo. Knowledge is power, and as scary as it is to be facing the cancer battle, knowing what to expect so you can ask the right questions about treatment helps you make better decisions about your care.",
      "MessageIndex": 5,
      "PostDate": "19/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Nov 20, 2016 07:18AM ILSunrise wrote: StayMom - I agree with you I'm thinking the surgery was probably the easy part too.....sigh. I went wig shopping yesterday....found one I ordered since the shop didn't have the right color for me. I hope I like it when it arrives. There is another thread I took a look at that has some lists of I think Nfullblume's suggestion of looking through the October and November chemotherapy threads will help answer some questions for us newbies and have a lot of good information. There is also another discussion thread that has a list of many things to consider and possibly purchase in preparation for chemo. Here's the link from Forum: Chemotherapy - Before, During, and After → Topic: Questions about Preparation in case anyone else wants to check it out. https://community.breastcancer.org/forum/69/topics... Welcome everyone. We're going to get through this together! ",
      "MessageIndex": 14,
      "PostDate": "20/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 10, 2016 07:11AM ILSunrise wrote: Sammy3 - Thanks for popping back in to check on us. Your suggestion about using AYR is a good one. I've used it a couple years anyway since I have allergies and my nose gets really dry in the winter. It does help. Covered69 - so glad you haven't had an SE's yet, that is wonderful! Summer2016 - glad you made it through your first infusion. Your description of being on an amusement part ride and/or skiing for 3 hours really highlights how dizzy you felt. I was also amazed at how much water your drank during the treatment. I know I've heard hydration is really important....I guess I'm going to need to do a much better job of drinking water. I hope you're hanging in there today since I've heard that day 3 can be the worse for some people. bareclaws - I hope you're now feeling a little better after the SEs you had on day 3 and feel more like yourself and even up for working out a bit again. scaredashell07 - I wouldn't take the anxiety medicine unless it's something you want to do. That in itself can have it's own SE's...especially if you don't already take that kind of medicine. I've tried anxiety meds once or twice and did not like them at all. For me I felt worse take the meds that dealing with the anxiety in other ways. I think Jezikah is probably right that the doctors just wanted to give you the option. I'm starting to get pretty nervous for my first treatment (next Thursday), so I scheduled a massage to help me relax and may also make a point to go to yoga. Hanging_in_there - sorry you had to deal with chest pain and end up in the hospital. I'm sure that was very scary. Glad your case manager explained the difference between bone pain and joint pain. Seems like they should have done that before you had chemo though. Thanks for the tip on bringing Tylenol with you everywhere. Shell72 - glad your treatment went smoothly! Irishmom3 - glad you only had a few jitters during treatment. I hope you're not feeling to bad now that it's been a few days. scaredashell07 - I'll be thinking of you next Friday when you start your chemo. My 1st one is on Thursday... Carolg516 - Two off days doesn't sound too bad. I hope that holds true for you during each cycle. Well, it's Saturday and I'm working at the German Christmas Market (Kristkindlmarkt) in a couple hours. I hope this puts me in a festive holiday mood seeing all the people shopping, listening to some Christmas Carols, etc.",
      "MessageIndex": 137,
      "PostDate": "10/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 16, 2016 05:53AM ILSunrise wrote: gmmiph - I checked Scaredashell's posts in other forums, and I think maybe she was getting a second opinion to see if she can have a KI67 test prior to deciding whether to have chemo. So, I'm not sure if she started any treatments yet. scaredashell07 - we're thinking of you and hope you're getting the information you need to make informed treatment decisions.",
      "MessageIndex": 203,
      "PostDate": "16/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 23, 2016 05:04AM ILSunrise wrote: gmmiph - Thanks for making me laugh with your post! I needed it today. Hazel15 - sorry to hear you cannot each much. You may want to also try some applesauce or rice...as that is part of the BRAT diet that appears you may be able to stomach right now. I am not taking the same chemo drugs as you. I worry that you might be getting dehydrated. I think you should call your MO because you might need some IV fluids. Six days of not being able to eat much seems like a very long time. As far as your body getting back to normal....I have no idea when that happens. Good luck and I'll be thinking of you.",
      "MessageIndex": 266,
      "PostDate": "23/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Jan 26, 2017 04:37AM ILSunrise wrote: Shell72 and Jezikah - I use Ayr nasal gel for dryness and also use a Q-tip to apply it. It is a saline base gel just for you nose and can be purchased at most drug stores (got mine at Wal-greens). I do still get the bloody nose thing too, but it's not all the time. Well, I'm off to my third round of chemo today. Not looking forward to anything but checking it off the list when I'm done. So, like everyone else I have my crying moments too. Last night was I started crying at just the thought of going back to the cancer center today. I too am having night sweats (well also hot flashes during the day). Seems like I wake up about every two hours - blanket off, blanket back on.",
      "MessageIndex": 517,
      "PostDate": "26/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Jan 28, 2017 07:08AM ILSunrise wrote: Summer2016 - I'm so sorry about your fingers. I had tingling and hot feelings in my hands after treatment too and the skin did start to deteriorate a bit. I've done a couple things to try and help but mine never got as bad as yours did. I recommend buying a pair of moisturizing hand gloves (approx $7). You put on some heavy duty hand cream (I'll recommend a couple), then wear the gloves to bed at night. It really helped me turn around the cracked peeling skin on my hands. I alternate using the two hand creams I listed below. I also have been applying Jessica cuticle cream or oil every day to my nail beds. These have both helped a lot. Here are links for ideas about these types of products Moisturizing gloves (can get at Bed, Bath & Beyond, drug stores, Amazon) https://www.bedbathandbeyond.com/store/product/pai... O'Keeffe's Working Hands Hand Cream (more of a heavy duty lotion)- http://www.okeeffescompany.com/working-hands Mary Kay Extra Emollient Night Cream (much thicker and almost like Vaseline but works well)- https://www.marykay.com/en-US/products/body-and-su... Jessica cuticle cream or oil - https://www.amazon.com/Jessica-NOU-Nourish-14-2g-0...=sr_1_3_a_it?ie=UTF8&qid=1485608676&sr=8-3&keywords=jessica+cuticle+cream https://www.amazon.com/Jessica-Phenomen-Intensive-Moisturizer-Treatment/dp/B000GXDADA/ref=sr_1_5_a_it?ie=UTF8&qid=1485608676&sr=8-5&keywords=jessica+cuticle+cream",
      "MessageIndex": 536,
      "PostDate": "28/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Jan 28, 2017 07:21AM ILSunrise wrote: For those of you who have been talking about mouth sores, I too rinse my mouth 3 times a day with the warm water, baking soda and salt mixture. So, far this has worked for me and I haven't developed sores. I was told to avoid toothpaste with whitening in it, any mouthwash with alcohol or peroxide. So, I switched and started using Sensodyne to brush my teeth. It was much easier on the tissue inside my mouth than the toothpaste I was using before (Aquafresh). So, I think that has helped too. I use Aquaphor on my lips for the extreme winter dryness. As far as exercise goes, I agree with bareclaws and mistyeyes, it really helps to try and move your body at least 30 minutes a day most days of the week. It does help with the gastro and fatigue. I too burp a lot and feel the gas moving around in my system when I get some exercise. This also helps offset some of the constipation you get from the various drug cocktails we're all on right now. Welcome SueIL07 and NotVeryBrave...you've found a great group of ladies that can help answer your questions, provide a shoulder to cry on and just help you \"Get Better Every Day\". Well, I made it through round 3. I am thankful to say that this is the first time I didn't have shortness of breath when they started the Taxotere infusion.....thank goodness. Maybe it's because they actually started it at a two hour drip rate right off the bat and kept it that way the entire time. Anyway, now if the rash will just stay at bay and I don't have to take an extra steroid dose pack this cycle that would be excellent....we shall see. Have a great weekend everyone. It's cloudy and gloomy out today...typical for January in IL I'd say.",
      "MessageIndex": 537,
      "PostDate": "28/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Feb 28, 2017 05:36AM ILSunrise wrote: Pamela23 - thanks for the information and videos. Sorry to hear you've developed lymphedema but hopefully the PT will help. SCGirl50 & Pamela23- What is cording? Is that something to do with the lymph nodes that were removed or related to the surgical site healing? Gingkoleaf12 - good for you booking a trip to Hawaii! Well deserved to treat yourself after going through this whole BC ordeal. For those of you who have had to cancel vacation plans (StayMom, Hopfull, Jezikah), I'm so sorry. Be sure to plan a new adventure that fits your time table between or after treatments. You deserve some well deserved pampering and celebration of kicking it to the cancer beast.",
      "MessageIndex": 712,
      "PostDate": "28/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Nov 29, 2016 10:00PM ILSunrise wrote: Jezikah - glad to hear you got your chemo postponed so your second round will be after your daughters's birthday and Christmas. Hope the port surgery goes well tomorrow and you're not in too much pain after it's over. I see you have an ATM gene mutation. I have a variant of unknown significance with the ATM gene and am participating in a clinical trial. Did your MO or BS plan anything differently in your treatment plan based upon that factor?",
      "MessageIndex": 55,
      "PostDate": "29/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 12, 2016 04:21AM ILSunrise wrote: SoCalAimee - my chemo starts on Thursday too. I've had several people offer to sit with me for the infusions. I haven't been too keen on the idea either. I may change my mind, but right now just want to get the first one over with as soon as possible. I'm dreading this much more than the surgery. Hang in there everyone battling all the SE's right now.",
      "MessageIndex": 154,
      "PostDate": "12/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 18, 2016 06:15AM ILSunrise wrote: gmmiph - Thanks for the tips on grip exercises. I did some wrist curls at the gym which should help somewhat. Cyn55 - welcome to the group! Glad you're not feeling too bad yet. My next infusion is the same day as yours. bareclaws - just wondering how you're doing since we haven't heard from you in a few days. I'm so sorry you ended up in the hospital. I sure hope the stronger steroids, followed by immunoglobulin are helping your platelets. SCGirl50 - I hope you're starting to feel a little better and the antibiotics are helping with your blood counts. DizzyGirl - Glad you're feeling pretty good so far. How are you surviving our deep freeze in central Illinois? So far, I've been feeling pretty good. I worked from home on Friday and plan to do the same thing next week if I'm feeling up to it. Fortunately I have a supportive boss and I have that option. I've had just some minor nausea and have eaten small amounts of food more often like they recommend. I've also really been trying hard to drink extra liquid. I'm gargling with the baking soda/salt water mixture several times a day too to hopefully combat part of the mouth sores. I've been to the gym twice, gone out to eat a couple times and run some errands that were close to home. I am anxious about the delayed side effects I'm expecting such as the nausea and blood count drop. Today I'll probably stay inside most of the day. We're in a polar acrtic zone. Right now it's -2 degrees with only a high of 4 degrees expected. So, I plan to continue working on my Christmas cards and maybe to start wrapping some gifts. Take care everyone. ",
      "MessageIndex": 214,
      "PostDate": "18/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 22, 2016 06:13AM ILSunrise wrote: Droak - welcome to the group and glad to hear you're feeling OK so far after your first chemo treatment. Shell72 - sorry work is being unrealistic that you should be 100% just because your outward appearance looks fine. I've been fortunate because I've been working from home since my first chemo treatment and haven't been into the office. That will change a bit after the first of the year and I am kind of dreading having to deal with the SE's while at work. I went back into the cancer center yesterday so they could take a look at this rash that's been driving me crazy the last few days and came home with an RX steroid dose pack and some cream. So, hopefully that will help with the continual itching and discomfort. I also go back in today to have my blood work checked. I did notice an unusual bruise on the back of my left thigh. So, we'll see what they say about that latest development. Merry Christmas everyone! I've still got a couple presents to buy and a wee bit of wrapping left to do. So, I guess I better get on that soon ... but for some reason lack my usual motivation (go figure)!",
      "MessageIndex": 256,
      "PostDate": "22/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Jan 9, 2017 12:40PM ILSunrise wrote: Summer2016 - so far I've not had pain from the Nuelasta shot. How long after the shot, did your pain start? I got the shot last Thursday, so it's only been 4 days. I am taking Claritin to hopefully offset some of the bone pain I may get from the shot. dcdrogers - I have the same bloated gut issues going on. I have not been able to get the whole digestion regulated as well as during my first round of chemo. Even though I've been drinking prune juice, eating prunes, walking, I already had to resort to taking a laxative. I really hate that.....last time I only had to take them once and it wasn't until about 10 days after the infusion. Oh well, once again C'est la vie.",
      "MessageIndex": 407,
      "PostDate": "09/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 6, 2016 06:17AM ILSunrise wrote: Hanging_in_there - Love you humor! How does the DH like being called your \"Uber Driver\"? I've heard from other BC Community discussion groups that exercising even a little does help with the fatigue. So, I hope you find some friends to walk around your neighborhood with you even if it's just for 5 or 10 minutes. It should really help with your mood. Anything you can do to help you feel more normal should also help ease some of this stress/tension/depression. OhHeyItsDeeDee - Congratulations on completing round one! I agree it's going to be interesting to see how the ladies trying cold capping do with their hair. Knowing myself, I just wouldn't be able to tolerate being that cold for so long. Funny thing I've heard from a few people about their eyebrows during chemo - some of them didn't lose their eyebrows until after all their rounds of chemo were done. Anyway, I'm laughing at the visual of you \"icing\" your eyebrows! Once again, humor is a great stress reliever for all of us! Jezikah - I don't think counseling is ever a bad idea. The diagnosis and treatment is enough to put anyone over the edge. Then when you add in your own plans for a family and the insensitive SIL announcement at Thanksgiving, well that certainly would be unbearable. So, anything you can do for yourself right now to help you fell better physically or emotionally you should do it which certainly includes some counseling. You were very smart though and saved your eggs......so when you do get all this treatment behind you, expanding your family is still in the cards for you! Hazel15 - I'm not having a port installed, but my MO didn't really think it was necessary for 4 cycles of chemo. I did have the nurse look at my veins to see if she thought I'd do OK without the port. If you are having more rounds or have small veins that are not easily accessible it might be a good idea to get the port. I've also heard that some chemo drugs may be harsher than others and a port might be beneficial in those cases too. I'm not positive about my last comment, so perhaps you could ask your MO that question or even check in the November chemo group to see if they know for sure if that is the case. Good luck making your decision on the port. I start my chemo on the 15th and feel like I have my countdown clock going.... Not sure if you want to make your diagnosis and treatment public, but if you do just fill out your profile and make it public via SETTINGS. As we continue on our journey together, its' hard to remember what everyone posts. Just a thougt. M0221 - Thanks for the information about Neulasta. I almost had them reschedule my chemo training...but then it was just another appointment where I'd have to schedule around work. So, in the end I just kept it the way it's set up. This is my busiest time at work and with the holidays, the month is short anyway.",
      "MessageIndex": 104,
      "PostDate": "06/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 7, 2016 07:23AM ILSunrise wrote: SCGirl50 - No doubt your anxiety was so high with starting chemo. I'm amazed you plan to work after your infusion. I do agree with trying to keep life as normal as possible. However, be sure to listen to your body and if you need to rest, disconnect from the office/work. My plan to hopefully ease the anxiety I'm know I'm going to have next week when I start chemo, is to have a massage the evening before the infusion. Congrats on checking one infusion off the list! Irishmom3 - We'll be thinking of you during your first infusion and sending hugs. Covered69 - Wow that is overwhelming news especially the part about the MRI not showing anything. Glad you went back for more tests and listened to your aunt so you could get genetic testing. That certainly can help you make much better treatment decisions. We're here for you and don't worry about the lurking. Many of of did that before we first posted anything. I was diagnosed in July and lurked around various communities on this website before posted anything in October. If you want to make your diagnosis and treatment public, fill out your profile and make it public via SETTINGS. KB870 - way to go, two rounds done! Pamlamb - Oh my, that news certainly was terrifying. Thank god the blood clot was discovered so the doctors could treat it. We're thinking of you as you have to face just one more twist in the winding road.... bareclaws - congrats to you too on checking off the first round of chemo. Sounds like you're a very healthy person. Guess I should google probiotic foods. I don't even know what kombucha and kefir are - ha ha. Did you feel up to the three mile walk? I've heard that exercise can really help minimize some of the side effects. Yikes - when did you start the steroids? Certainly you were bummed with weight gain so quickly.",
      "MessageIndex": 116,
      "PostDate": "07/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 15, 2016 03:39AM ILSunrise wrote: So, I've been trying not to read everyone's posts the last couple days simply because I've just been getting too nervous about my first infusion. I melted down several times yesterday.....but thankfully was actually able to sleep some last night. Well today I get to face the music so to speak. Anyway, I'm hoping the nurses don't have to stick my multiple times to find a vein that will work for the treatment. I know it's going to be a long day but am thankful to have this sounding board and a group of wonderful women who are there to support each other and share experiences. After today, I'll try to go back and read what everyone's been saying in this forum. I hope everyone is managing their SE's and emotions so far.",
      "MessageIndex": 193,
      "PostDate": "15/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Jan 2, 2017 01:08PM ILSunrise wrote: dcdrogers - sounds like we're having a similar experience with the period that never wants to end. Maybe we are going into menopause from the chemo. scaredashell07 - good point on just cutting the hair short and not shaving it entirely off in order to avoid scalp sensitivity. So far, I've just cut mine about 3 inches. But it's still coming out pretty good so may cut the rest off tonight. I have to go back to work tomorrow and will probably be wearing the wig. Carolg516 - good for you....another treatment done and you can check it off the list! Take it easy and have the naps if your body is telling you that you need it. StayMom - I hope your next treatment goes well on Wednesday. My next one is on Thursday and I'm starting to dread it. Well ladies, let's all push on strong as we continue into the new year.",
      "MessageIndex": 336,
      "PostDate": "02/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Jan 7, 2017 06:04AM ILSunrise wrote: Gingkoleaf12 - I stay really bloated especially when I'm on the steroids and for about a week after an infusion. I just had my second round of Taxotere and Cytoxin on Thursday. I couldn't sleep that night so felt pretty out of it (dizzy, tired,etc.) yesterday. Anyway, I did manage to drag myself to the gym and walk the track for 30 minutes. I think the walking really helps aid the digestion and get the drugs moving through your system better. I have to say it's a bummer about your taste buds and the fact that chocolate no longer tastes right. On my first round of chemo I didn't have a Nuelasta shot but have to start getting them now since my WBC got so low the first time. So, I'm kind of anxious to see if I get any side effects that people talk about (bad bone pain). What has been everyone's experience of SE's with Nuelasta? I feel much better this morning since I was finally able to sleep last night. Unfortunately I think my allergic reaction to the Taxotere is already starting up again so will probably have to start taking a 6 day dose pack of Methlypredinisolne (steroids). The good news is at least I have the RX in advance this time so maybe the horrible rash won't get as bad as before. I still have some hair left but not much. I had my husband cut all but an inch of two off all around on 1/2/17. I'm still amazed every time I comb it how much hair comes out when it doesn't seem like there is much there. I've been lucky that my scalp hasn't had too much discomfort, but my hair was already fine and not that thick. I wore my wig to work and out and about town after the new year and got a few compliments from people I didn't know too well. So, when they asked if I had a new hair style I just said yes. Hang in there ladies, we just keep marcher closer to our end game.",
      "MessageIndex": 388,
      "PostDate": "07/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Jan 9, 2017 12:32PM ILSunrise wrote: HoneyBeaw - so sorry you are having to deal with this stuff. It is really hard. It makes it tougher when the family is not in tuned with what the future treatment options might hold (or cannot accept them). Take a deep breath and try to have your list of questions ready for the MO. I see from your signature, that you have IDC so your cancer is invasive. Do you know the % of your tumor receptors ER/PR +? The closer they are to 100%, the easier it is to pinpoint your treatment. So, if your hormone receptors are say 50%, then something other than hormones also feed the cancer. Ask your MO if they did an Onco-type DX test on your tumor. It helps tell if chemo will decrease your chance of cancer recurrence over a 10 year period. Good news that there was no cancer in your lymph nodes. Did you have any lymphovascular invasion (channels to the lymph nodes) in your breast tissue. These items can impact the need for chemo. scaredashell07 - I have IDC like you with no lymph nodes positive. Even though my tumor size was small, there were other factors that made chemo potentially helpful for me. For example, not everyone's tumor hormone receptors are really high - close to 100%. So, that can be a reason chemo might be a good idea. In my case, mine were 49% and 44% (ER/PR). Also, I had lymphovascular invasion (microscopic cancer cells in the channels to the lymph nodes). So, with that even with rads (required since I chose a LX), can I really be sure all the microscopic cancer cells will be killed. I also had the Onco-type DX test done. Once again, I was kind of in a gray or middle area as far as whether to have chemo or not. So, I had to make a decision what to do. It was really tough, but in the end, I just couldn't ignore the potential benefit of having chemo if it helped reduce my chance or recurrence.",
      "MessageIndex": 406,
      "PostDate": "09/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Jan 12, 2017 05:32PM ILSunrise wrote: Ladies I found a great place to order some hats, scarves, etc. I just got my shipment today and I like what I bought. Here is the link in case you want to check it out. http://www.hatsscarvesandmore.com/c-womens-hats.ht... I have been wearing my wig to work and if I go out to dinner, grocery shopping, etc. But when I'm home, at the gym, or doing something active I wear a hat or scarf. As far as my hair goes, I had only cut it real short. It's really patchy now and quite pathetic looking. So, I think I'm going to have DH, shave or cut it all as close to my scalp as possible this weekend. Just looking in the mirror when I'm not wearing a hat is kind of depressing because I have a lot of bald spots. So, I need to go totally bald to see if I can rock that look. I didn't have a port and have had two rounds of chemo. My veins are OK so far, but I do have a nasty bruise on one from my treatment last week. I am also losing my eyebrows, eye lashes, and rest of the hair on my body at this point. I have only shaved my legs twice since I started chemo and don't think I will have to again. That's all for now. Hang in there.",
      "MessageIndex": 441,
      "PostDate": "12/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Jan 15, 2017 06:52AM ILSunrise wrote: chickensandgoats - I got the Neulasta shot after my second infusion. My WBC got too low after the first round, so I'm getting the injection for the last three chemo cycles. I'm going in for the shots versus using the on-body injector. I chose to have the shot administered by nurse instead of automatically due to the rash I'm getting from Taxotere. I didn't want something else stuck on my body that could possible cause more skin irritation. I did not have bone and muscle pain but have been taking a Claritin every day as a preventative measure. My MO also said I should take Tylenol versus anti-inflammatory meds such as Ibuprophen if I did have any pain.",
      "MessageIndex": 451,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Feb 16, 2017 06:12AM ILSunrise wrote: dcdrogers - good luck with your 4th infusion I do hope the additional fluids help. Yes - once step closing to the finish line. Hang in there! Summer2016 and Shell72 - congratulations on finishing your last cycles of chemo! I have my 4th (and final) infusion today. So, really looking forward to getting this one behind me. Next step on this wagon train....rads. Not thinking about it yet....just trying to stay in the moment and face today's challenge. Good news is we had a beautiful sunrise here in Central Illinois today...so I'm hoping that means I'll have no issues during my treatment. Hang in there everyone.......it's going to get better every day.",
      "MessageIndex": 659,
      "PostDate": "16/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Mar 16, 2017 12:24PM ILSunrise wrote: SCGirl50 - glad you finished chemo! I just had my one month post-chemo follow-up with my MO which included blood work. My liver counts are still high, so I have to have another blood test next week. I sure hope they come back down soon. I was hoping to have a drink this weekend to celebrate my birthday and for St. Paddy's Day. Guess I'll have to wait on that a bit longer. My MO is also calling in my RX for Tamoxifen. So, let the hot flashes continue. Is anyone else taking Tamoxifen yet? If so, what SE's are you having? I am scheduled to start rads on Monday. I'm trying to gear up for the next phase....",
      "MessageIndex": 766,
      "PostDate": "16/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Mar 24, 2017 02:42PM ILSunrise wrote: Pamela23 - thanks for the hint about getting a baseline uterine check before starting Tamoxifen. I started rads on Monday and have my RX but have not started taking it yet. My MO said I could take it at the same time I start rads. Has anyone had elevated ALT and AST in your blood tests which relate to liver function? Mine were high right before my 4th round of chemo, were higher a month after round 4 and then again last week. I am now scheduled for an ultra sound of my liver. Makes me nervous. Needless to say, after I got the lab work back, I decided not to start taking the Tamoxifen yet.",
      "MessageIndex": 792,
      "PostDate": "24/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 5, 2016 06:39AM ILSunrise wrote: Summer2016 - looks like we're having the same chemo cocktail and number of rounds. I had a similar situation where I had to choose whether or not to do chemo. My KI67 was 23 as well as my Oncotype. I start chemo on December 15. Since you're trying the Dignicap, if you're not already part of the community on Cold Capping - you may want to join that online support group too. https://community.breastcancer.org/forum/6/topics/... M0221 - I see you're taking the same chemo as me too. You mentioned the Neulasta patch. Is that something that everyone getting chemo is prescribed whether in a patch or perhaps injection? I don't get my chemo \"training\" until the day of my first treatment so was just curious. ",
      "MessageIndex": 87,
      "PostDate": "05/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 24, 2016 10:18PM ILSunrise wrote: I've also tried to figure out if there was something I should of done differently to prevent getting cancer. I always thought my diet and exercise were healthy. None of us should let these types of thoughts consume us. It's mentally unhealthy. We just need to move forward and make the best choices we can. Take care and Merry Christmas!",
      "MessageIndex": 277,
      "PostDate": "24/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Jan 7, 2017 07:37AM ILSunrise wrote: Pamela23 - I'm not in any real pain yet from the Neulasta shot. I am taking Claritin as a precaution. I have allergies anyway, so normally take some kind of allergy medicine. The steroids I'm taking are not for pain. I get allergic reactions to Taxotere and get a horrible rash on my body almost everywhere (thighs, chest, back, arms, thighs, butt). It is really itchy and super uncomfortable. I also have a steroid cream to use. So, it looks like this SE is not going to change for me and I can expect it with every infusion. Is your pain in you heels and toes from the Nuelasta or the chemo drugs? The other SE I get from the Taxotere infusion is shortness of breath when they start administering the drug (within 5 to 10 minutes). This of course is scary. So, then the nurses have to stop the IV drip and give me some saline and wait a few minutes before they start the IV back up. I also have to use a really slow drip rate. During my first infusion the shortness of breath was a lot worse than the last time. Since I was expecting it, I didn't get near as anxious and the nurse showed up quicker. So, I didn't have to be put on oxygen...they just took my BP and pulse.",
      "MessageIndex": 390,
      "PostDate": "07/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Feb 27, 2017 07:23AM ILSunrise wrote: Congrats to those who are finishing up chemo! For those who have not....you are one step closer in the journey. Hang in there! Chemopause - the last time I had a period was right after my first chemo infusion in December. My period started, stopped and restarted again the same month and was pretty heavy. The hot flashes have definitely been affecting me all times of the day. I can't say that I'm a fan and feel lucky that this started during winter. I'm a little more concerned about how bad they'll be during the summer. Has anyone started Tamoxifen or AL's yet? I have a follow-up with my MO on March 16 and she is going to prescribe Tamoxifen then. I appreciate all the nutrition tips. I was a fairly healthy eater before and did exercise regularly too. My downfall was social drinking. Anyway, I have cut out most caffeine now (tea and soda) as well as alcohol. I've never been that much into sweets, but oddly find myself craving them more since starting chemo. I think maybe that's because I was eating more bread and some sweets because they seemed easier to digest. Anyway, I do need to really consider my overall diet and work more towards only eating whole foods. Has anyone else started rads yet? I have my simulation today and expect to start by mid-March.",
      "MessageIndex": 706,
      "PostDate": "27/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Nov 29, 2016 06:39AM ILSunrise wrote: I hope all the US ladies, were able to somewhat enjoy Thanksgiving during this stressful time. Loved the pictures that were posted. I was traveling so didn't get a chance to keep up on the posts. NextStorm - Glad you completed your first round! One down!! Sounds like you got the bonus with a private room. Looking forward to hearing more Frank Turner quotes. Twinsmawmaw - How did you first round of chemo go? Sorry to hear you have to travel so far to have it done. Hoping your side effects are minimal. Hugs. myth - So sorry to hear to hear your reconstruction was delayed. If I were in your shoes, I would definitely have opted for chemo too. I had an oncotype test done and I was in the middle or gray area - 23. My KI-67 was higher though 23 plus I had LVI even though my nodes were clear. So, it was a struggle to decide whether to have chemo or not. In the end I thought like you that I'd kick myself if I didn't have it and then the cancer comes back. Jezikah - How overwhelming to have two different types of cancer. Good plan on the fertility preservation. Did you end up starting chemo or have it postponed due to the holidays and your daughters birthday? Glad to hear you are prepared with remedies, scarves and friends to help you. I have purchased a wig but need to start working on all the other preparations. Hugs. Sammy3 - Thanks for the pep talk. I'm pretty sure our December 2016 thread will take all the positive thoughts we can get :-) Pamlamb - Sorry to hear your niece upset you. I doubt she intended to.....but this journey is so emotional. Sadly, those kind of comments happen more often than you'd care to hear. I received a get well card from my niece after my surgery and she said \" I hear you are feeling under the weather\". Needless to say, that comment upset me quite a bit as well. I hope your first chemo treatment does not cause too many SEs. I'm sure you're nervous and we're all here for you. gmmiph - Thank you for all the information on what SE to expect with chemo and when we should mention something to our MO. I don't get my chemo training until the day of my first treatment (Dec 15) although I have tried to read up on it a little. Hanging_in_there - Good idea to get some professional pictures of you and your family. I always appreciate professional photos, but never take the time to schedule a session with a photographer. Sounds like you made the right call and got your port in advance of your first treatment since you had a little time to heal. That's great news that the additional tests showed the cancer has not spread. No doubt very overwhelming and emotional. Deep breathes......inhale, exhale slowly. StayMom - my chemo starts the day after yours - Dec 15. I'm not getting a port although I did ask about it. My MO thought I'd be OK getting treatments through IV since I'm only having four rounds. I agree with you.....I want my life back too. So, that should be this groups mantra!! I imagine everyone else feels the same way.   ",
      "MessageIndex": 50,
      "PostDate": "29/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 1, 2016 06:37AM ILSunrise wrote: Hanging_in_there - Thanks for the play by play on your chemo experience. It sounds very overwhelming especially with the cold cap thrown into the mix of things. I asked my MO about cold capping and she didn't want me to consider it. Hang in there. You can check the first round off your list and at least know what to expect going forward. Jezikah - I can send you some information about the ATM gene trial, but I think it's geared more toward if you have a variant of unknown significance (VUS). My genetic counselor told me since it's VUS it should not play into my treatment option. But it still makes you doubt some of the choices you make and I hope I don't regret going the lumpectomy route versus the mastectomy route. Michelle - welcome. The waiting game really does make you crazy. Hugs to you as you start this journey. It does really help to have this forum to ask questions and share your experience with others.",
      "MessageIndex": 60,
      "PostDate": "01/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 15, 2016 03:36PM ILSunrise wrote: So, I'm now starting my countdown clock - one infusion down, three to go. I was at the cancer center from 8:00 AM to 2:45 PM. I had a little bit of a rough start.The first vein they tried to use, didn't cooperate, so that had to choose a different one which was the side of my right wrist. It was kind of an awkward place,so my plan of working on Christmas cards while I was sitting there didn't happen. Oh well.... Then when they started the IV drip of Taxotere, I started to have shortness of breath after about 5 minutes. This of course freaked me out, so I started getting really anxious and crying. The nurses were great though. They came right over and stopped the drip. They took my BP, pulse ox and gave me some oxygen. After consulting with the MO's assistant, they started it back up after about 15 minutes at a slower rate. After that I had no other issues other than feeling a little off when I left. Anyway, I'm really glad to be home and am hoping I sleep OK tonight. Jezikah - glad to hear you made it to counseling. I can't imagine how overwhelmed you must feel. Give yourself time to make it through all the stages of grief. I hope you had a good rapport with your counselor and feel comfortable seeing them for more sessions. Good for you that you can still count your blessings and be thankful. Don't be too hard on yourself either when you feel sorry for yourself. Pamlamb - glad to hear you're feeling pretty good so far. chickensandgoats - heartburn and dry mouth don't sound to bad. Way to go, two treatments done! Naniisscared1 - It's definitely been a roller coaster for you having all the diagnosis and treatments so close together. I've had a little more time to process my news and research everything. Hang in there. You've come to the right place for support. ",
      "MessageIndex": 197,
      "PostDate": "15/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 20, 2016 06:56PM ILSunrise wrote: Well the heavy fatigue finally hit me yesterday around noon. Fortunately, my boss told me not to worry about working on Monday. So, while I'd planned on working a full day (from home), I quickly decided just to do a few e-mails and call it a day. I still went to the gym later on and walked for 30 minutes. but by the time I got home all I wanted to do was lay down and hit snooze. For me, the prune juice has helped stay regular and other than feeling bloated and crampy in the mornings, my nausea isn't too bad. What's driving me crazy is the rash. It started on my back Friday afternoon. Now it's spread to my arms, shoulders, hips, chest and thighs. I have a follow-up appointment scheduled for Thursday for blood work, etc. So we'll see if the MO gives me anything for the rash. For now, I'm using Benadryl cream for the itch and am going to take a Benadryl tablet too. Anyone else having similar issues with a rash? Oh, I can't remember if I told everyone, I'm participating in a clinical trial at my cancer care clinic. The study of 3,600 US patients (90 from my clinic) hopes to improve the information around the protocol to prescribe certain medicine to people receiving chemo. The study is trying to find out if an automated system should be used to help doctors determine when to prescribe colony stimulating factor (CSFs) medicines in order to help reduce a patients risk for febrile neutropenia (condition involving a fever and low number of neutrophils (type of white blood cell)). I think the most common CSF used is Neulasta. Anyway, in my test group, if my MO does not agree with the automated systems recommendation to use a CSF, she does not have to follow the suggestion. bareclaws - That's awesome news! I bet you couldn't get out of the hospital quick enough. Jezikah - glad to hear you're embracing and rocking the GI Jane look. I'm not sure I'm quite there yet....although I did think GI Jane was a bad ass! scaredashell07 - my mouth feels strange occasionally. Have you tried eating some frozen fruit or hard candy? Also, be sure to gargle with the salt/soda/water combination - it doesn't exactly taste good, but is supposed to help prevent mouth sores. Hang in there everyone. I agree with StayMom, I\"m glad I have the Christmas distraction and extra holiday activity to help keep my mind off my health.",
      "MessageIndex": 244,
      "PostDate": "20/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 22, 2016 02:29PM ILSunrise wrote: Well, after the blood test from my follow-up visit at the cancer center today, I found out my white blood cell count is really low. The APN told me that the rash I have is a reaction to the Taxotere. So, she'll need to talk to my MO, to see how to tweak my upcoming infusions which could mean a lot more steroids. Also, she said that I'll end up getting a Neulasta shot which I did not have with my first infusion. So, I am slightly bummed that now I am supposed to avoid crowds of people and was told not to go to my gym since they consider that a germ factory. Oh well, c'est la vie. ",
      "MessageIndex": 259,
      "PostDate": "22/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Dec 31, 2016 07:14AM ILSunrise wrote: Hi ladies, I've been MIA since I went up to Chicago for a few days to get \"away\" from it all. Had a great time with DH enjoying the holiday lights and other sights and sounds of the windy city. Several of you have been talking about icing your nails and feet if on Taxotere. I haven't heard of doing that before. I did just notice last night that the skin underneath my fingernails is starting to look a bit raged - very dry and cracking. Also, when I touch my finger tips, it leaves little indention's that don't pop right back our immediately. That seems really weird. Question for anyone who has not gone through menopause yet. I started my period right after my first chemo treatment (as expected). It stopped after a couple days (as expected because mine are really light). But then it started up again a few days later and has lasted now for 9 days. Is this normal? My MO did say that chemo would put me into menopause.....Anyway, just wondered if anything similar happened to anyone else. My hair has started falling out quite a bit the last couple days. My hair is very fine and was already thin, so I'm not having any discomfort in my scalp. I'm still not ready to shave it off but think I'm going to have to soon. So, I'm trying to decide if I should do that as part of NYE. I think my options, probably need to be one of these three - (1) shave it today sometime, (2) shave it when the clock strikes midnight, or (3) shave it sometime tomorrow as my start to 2017. I think for me it's going to be really emotional and I can't decide. Boy, I listen to myself talk about this and it sounds so pathetic. I'm glad that several of you can now check another round of chemo off your list....that's one less treatment until you get to the other side! Congratulations! Happy New Year everyone.....2017 is going to be a better year for all of us! When we get through our various treatments, we will all be stronger more resilient women!",
      "MessageIndex": 328,
      "PostDate": "31/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Feb 16, 2017 08:13AM ILSunrise wrote: For those of you with the watery eyes SE, my MO recommended that you used a warm compress on your eye in the morning. Then gently massage your tear duct (in the inner corner of your eye). This helps unblock the build up of gunk from chemo. I'm going to try it later when I get home. I've had this SE non-stop for three weeks",
      "MessageIndex": 661,
      "PostDate": "16/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Feb 28, 2017 10:03PM ILSunrise wrote: Pamela23 - thanks for the information about cording. Yikes - that's is a crazy amount of fluid retention you had. So, glad it is better now. I have heard that sometimes the brown and eye lash loss occurs after chemo ends. My brows and lashes are pretty sparse. I'm just about two weeks past my last infusion.",
      "MessageIndex": 715,
      "PostDate": "28/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Mar 9, 2017 01:28PM ILSunrise wrote: scaredashell07 - I also have LVI (lymphovascular invastion). It was described to me as I had microscopic cancer cells in the channels that lead to my lymph nodes. So, the cancer was not in my nodes, but probably would have been if I had been diagnosed later. So, the presence of LVI is why I needed whole breast radiation and I could not have bracytherapy type radiation. Having LVI was also a reason I opted to have chemo (I was in a gray area of needing it based upon my Onco-type DX score). Irishmom3 - what drip rate is your MO using for your Taxotere infusion? Have they tried slowing down your drip rate? Because of the reactions I had with Taxotere (extreme shortness of breath), I received my infusions over a two hour period versus one hour. This really helped me and I was able to tolerate receiving it I am still having extremely watery eyes and the tears just drip down my face constantly throughout the day. I'm really looking forward to this going away. I have finished chemo (Feb 16) and just had my marking session and simulation for rads this week. I expect I'll probably start radiation sometime the week of March 20. Just a tip for everyone who has the muscle aches, etc. I recommend massage therapy. I had a massage treatment every three weeks when I started chemo. I would have it the Monday before my Thursday chemo treatment. It was helpful for some of the muscle ache issues. I'm going to go two weeks in a row this time, because I won't be able to have massage therapy for awhile once I start rads. .Hang in there everyone....one step closer!",
      "MessageIndex": 738,
      "PostDate": "09/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "May 10, 2017 08:20AM ILSunrise wrote: lohoff - Do you have a medical supply story near you? You might try checking it versus your local pharmacy. I used TriDerma radiation cream and not calendula cream which I got from a medical supply store. Also, you can buy pretty much anything on Amazon....so you could probably order the celendula cream. RoseRN1 - sorry to hear you had issues on your dry run. That is frustrating. The machines do have issues from time to time because sadly they are used so often. I have been stuck on the table like you a couple times during my course of treatments. The rads techs had to call in the engineer to help get the machine up and running again. I was fortunate they were successful though so I didn't miss a treatment. I hope your dry run goes better today. Hugs",
      "MessageIndex": 82,
      "PostDate": "10/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "May 15, 2017 11:12AM ILSunrise wrote: My RO also said to avoid hot tubs. He said if I got in a pool (after I'm done with rads), to cover my chest (so I'll have a rash guard) and be careful of chlorine. He also said to put petroleum jelly over the radiated area to help shield it and create a barrier from the water and chlorine.",
      "MessageIndex": 116,
      "PostDate": "15/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "May 7, 2017 05:49PM ILSunrise wrote: I am finally getting close to finishing rads. I only have 7 boosts left out of 37 total. If anyone starts having pain from the radiation burns, you could try a mixture of half Alocane (alocane.com/) with the cream you are using to moisturize your breast/underarm area. I use TriDerma radiation cream with aloe and alantoin(https://www.triderma.com/radiation-skin-relief.htm...) It has helped me with some of the pain. I just picked up the Alocane at Wal-greens. Also, for those of use wondering about deodorant, I use Alra a non-metallic deodorant that contains aloe. I was able to buy it a local medical supply store as well as the TriDerma but they also sell both on Amazon.",
      "MessageIndex": 64,
      "PostDate": "07/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "May 24, 2017 10:05PM ILSunrise wrote: lohoff - I had the unpleasant smell when I was getting rads. It will go away. Sorry you have it too. Hug",
      "MessageIndex": 175,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "May 15, 2017 12:47PM ILSunrise wrote: Butterfly1234 - the precautions are just temporary while the skin is healing. Of course, as you said sunscreen will always be needed. I'm somewhat fair skinned, so I generally put on a rashguard anyway if I'm going to be out by the pool for more than one hour. I also, usually spend time under an umbrella. I love the outdoors, so I do get outside whenever possible.",
      "MessageIndex": 120,
      "PostDate": "15/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    },
    {
      "AuthorID": "ILSunrise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240610/profile",
      "Content": "Jun 9, 2017 07:01AM ILSunrise wrote: Hanging_in_there - make sure to include enough protein in your diet. It is very important to help your body stay strong and support healing. If you're going vegetarian then be sure to include beans in your diet. If you're still having some meat, try to incorporate some fish for protein. You could also consider having protein drinks for extra calories and nutrition. Your doctor is probably concerned because you have lost quite a bit of weight. Anyway, I'm certainly not a nutritionist but am just sharing information from my RO. I was also told to make sure and have 7 to 9 servings of fruits and vegetables per day.",
      "MessageIndex": 289,
      "PostDate": "09/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    }
  ]
}