{
  "AuthorID": "ILTMB",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139480/profile",
  "Posts": [
    {
      "AuthorID": "ILTMB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139480/profile",
      "Content": "ILTMB wrote: I am back. I was here back in November due to breast pain that increased. Had a mammo and US. Showed nothing. Since then, I still always had the engorged feeling in my right breast. Now my breast is hurting again and my entire armpit hurts. Went to the dr for something else and had her check it out. I was telling her how I always feel the urge to dig into my breast and massage it. Now she can feel something on the duct and when she touches several areas on the duct, very painful. So back to the BS on Monday. She is sending me back to make sure we didn't miss something. She did explain that people can still produce milk but your talking to the girl who had a breast reduction 15 years ago and was unable to breastfeed due to lack of milk. So back to worrying but as crazy as this sound, at least I feel justified in my concerns. that she did feel something. I know something isn't right but now waiting to make sure its not the \"worse case\" scenerio.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786124",
      "Title": "Here I am again ILTMB lago"
    },
    {
      "AuthorID": "ILTMB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139480/profile",
      "Content": "Nov 22, 2011 09:19PM ILTMB wrote: Thanks! My mammo came back normal. Yes my breasts are larger but I have also gained weight in the last 6 months, so I would assume it's from that. The specialist just thinks it is normal pain, one of those we don't know why. However, he ordered an US just to make sure they didn't miss anything and I am to come back in 3 months for a follow up. Until then, I can take mobic until I finish it and then IBprofen as needed. I just don't see how pain this bad can be considered normal. However, I am thankful that none of the doctors have pushed me aside and called me crazy. At least to my face. I hope it continues to be nothing. Thanks! My US is next monday. ",
      "MessageIndex": 19,
      "PostDate": "22/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778029",
      "Title": "help..symptoms getting worse ILTMB ILTMB"
    },
    {
      "AuthorID": "ILTMB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139480/profile",
      "Content": "Nov 27, 2011 10:28AM ILTMB wrote: So I actually got the written version of the mammo. It says where patient has focal pain, there are focal abnormalities. How come the dr. didn't bring this up? I see the word abnormalties and it just doesn't sit right. I did find out I don't have dense breast which makes sense because I had a breast reduction when I was 16. The extreme pain has calmed down but now it's just back to an itching and burning sensation unless you touch a certain area which I try not to because it hurts pretty bad. I have the ultrasound scheduled actually Wednesday not monday. I just feel lost and confused. I know this isn't normal. I don't get breast \"tenderness\" not with pregnancy or with my periods. I don't even feel them during sex and over the last month my nipple hurts and this doesn't stop. I spoke with my mom and God bless her because she is the first one to say its nothing, don't worry in her very blunt way. Just from reading people's stories, it doesn't sound like cancer but I can't shrug it off and I don't care what the dx is but I can't just go on saying it's just an undescribable pain that young women get. I am at the point where I just want the whole thing removed. THanks everyone for thoughts and support.",
      "MessageIndex": 21,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778029",
      "Title": "help..symptoms getting worse ILTMB ILTMB"
    },
    {
      "AuthorID": "ILTMB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139480/profile",
      "Content": "Nov 14, 2011 09:04PM ILTMB wrote: The pain has relieved a little bit. Today was a better day. Talked with my doctor and he recommended seeing a breast specialist. He said he was baffled by the symptoms and he felt it really was out of his scope and especially since they have been escalating for the past few months.. He prescribed hydrocodone for when the pain is really bad which I will only take if it was like this past weekend. My mammo is for the 23rd, and I see the specialist the following monday. He doesn't think anything will show up on the mammo. He thinks maybe nerve damage and worst case, breast cancer. Thanks for all the responses. I will definitely let you know what I find out. ",
      "MessageIndex": 16,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778029",
      "Title": "help..symptoms getting worse ILTMB ILTMB"
    },
    {
      "AuthorID": "ILTMB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139480/profile",
      "Content": "Nov 20, 2011 08:15AM ILTMB wrote: Update: My pain was getting worse so last monday I called my family doctor and he said he was baffled and since we were waiting on my other appointments, he could try to treat the symptoms. So he prescribed hydrocodene. I didn't take it until Thursday night because it said it could make you loopy and no driving. I am a single mom of four kids so I was scared to take it. After a week of pain getting worse and finally thursday night, I could not sleep. I decided to take a painkiller. Nothing. I did absolutely nothing. I finally got three hours of sleep and scheduled an appt online with my family doctor.    I am very lucky because he was understanding and wants to help. He did another breast exam. He noticed a change in my armpit but there are no lumps. He found the spot that makes me come off the table. It hurt so bad that I started crying. He left the room and called the breast surgeon and spoke with him. I have no idea what was said. They moved my Mammo up to Friday afternoon and I see the breast surgeon on Monday. The radiologist didn't see anything on the mammo. He took only 4 pictures. I was told it could take up to an hour. It took 10 minutes. He didn't even come talk to me himself. My regular doctor prescribed a different pain regiment. I am to take this prescription anti inflammatory with tyelonol until I see the surgeon so that they can see if it helps. My family doctor said they will just keep ruling out diagnosis until they find out what is wrong. He admits the symptoms are beyond his scope but his thoughts are somekind of infection or ductal issue (which is what the breast surgeon  can determine) or possible nerve damage. Anyone had extreme pain? I told my doctor that the pain from where he touches is not what I feel. (i'm gonna see if I can explain this) this is near thebottom of my breast into the arm. It is very very painful. However, the pain I feel all day is a burning, itching, radiating pain near the top of my breast. I told him it feels like something is stuck in there.   After reading posts, I am glad that as a young person, my doctor is helping me and taking me seriously.I just can't seem to find anyone who may have similar issues but you all seem so supporting.  ",
      "MessageIndex": 17,
      "PostDate": "20/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778029",
      "Title": "help..symptoms getting worse ILTMB ILTMB"
    },
    {
      "AuthorID": "ILTMB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139480/profile",
      "Content": "Nov 13, 2011 03:06PM ILTMB wrote: My doctor knows. He had me schedule a mammogram which is not for another two weeks. He did a breast exam and felt no lumps but found area of soreness. That was almost two weeks ago and it is getting worse. I actually emailed his office last night because of the pain and the lump in my armpit now. He seems to think it is an infection or ligaments as breast cancer does not have pain unless it is an advanced stage. However, I am only 29 (30 in 3 weeks) and being told to schedule a mammogram is a bit frightening (though I think it would be at any age). I am just more scared about the symptoms getting worse from a inconsistent pain to a non stop pain and burning along with my armpit very sore. Hoping I can talk to the dr. again tomorrow. Thanks! I was just curious if anyone thought it was related to breast cancer or not. ",
      "MessageIndex": 4,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778029",
      "Title": "help..symptoms getting worse ILTMB ILTMB"
    },
    {
      "AuthorID": "ILTMB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139480/profile",
      "Content": "Nov 13, 2011 09:46PM ILTMB wrote: Ladies, thanks for your help. I think the best thing I can do is wait tomorrow for the doctor. I am nervous because of the pain and burning. My sister seems to think it is because I am about to turn 30. ",
      "MessageIndex": 14,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778029",
      "Title": "help..symptoms getting worse ILTMB ILTMB"
    },
    {
      "AuthorID": "ILTMB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139480/profile",
      "Content": "ILTMB wrote: I have been having breast pain in my right breast that has been getting worse and now it's all day. I went to the doctor on the 11/2 for my annual. Which my pap came back negative. I had the biopsy done. Funtimes! and totally unrelated. My doctor had me schedule a mammogram but they couldn't get me in until the 23rd.. He could not find a lump in my breast but found tender areas that were located in the bottom and extended under the arm, I was flinching. Now my pain has started to be more fire-like and all day. My boyfriend last week was messing with me during sex and my nipple hurt like nothing before. As I had a breast reduction 14 years ago, I never have sensation in my breast. Last night, my arm pit was very painful and there is now a small lump near the breast. I had a lump in my arm pit about a month ago but it went away and it was more in the middle of the arm. I didn't sleep much last night because of the pain. And it is still there this morning. Things are changing quite fast and getting worse. Anyone have any clues?  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778029",
      "Title": "help..symptoms getting worse ILTMB ILTMB"
    },
    {
      "AuthorID": "ILTMB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139480/profile",
      "Content": "Nov 13, 2011 04:07PM ILTMB wrote: Thanks guys! I will probably have my doctor my move up my mammo. I have taken Ibprofen but it does nothing. Nothing seems to help and it just feels like with each day it gets worse. ",
      "MessageIndex": 10,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778029",
      "Title": "help..symptoms getting worse ILTMB ILTMB"
    }
  ]
}