{
  "AuthorID": "iluvkitties…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184577/profile",
  "Posts": [
    {
      "AuthorID": "iluvkitties…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184577/profile",
      "Content": "Jul 21, 2013 05:50AM iluvkitties wrote: Please take this opportunity to learn something about sleep. I spent so many sleepless nights and I thought I was going crazy. It really plays with your head. My best advice is to not feel angry/frustrated about it. That hinders you falling back asleep. I had an agreement with my husband to have the TV on constantly bc I thought turning it on in the night would wake him. So when I would sleep from midnight to 2:00 am, I would just happily decide to watch TV not allowing the frustration to set in. Usually I would drift back off that way. I had terrible nightmares too with one of the anti-nausea drugs and I got that changed by my onc. I would suggest lighthearted shows. One of my favorites was a cooking show (if it doesn't make you feel sick) or silly reality shows. Anything boring. Reading is good too, but that involves turning on a light so I avoided that. By the way, when I got off chemo, I had some days where I would lie down for a nap at 5:00 and wake up and it would be 10:00 at night! My family was checking on me to see if I was breathing! So you will catch up on your sleep at some point. Hang in there - I finished chemo in Jan and I feel great now - you can do it!!!",
      "MessageIndex": 471,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "iluvkitties…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184577/profile",
      "Content": "Jul 21, 2013 05:40AM iluvkitties wrote: Congrats to you for being so pro-active. That will help you so much. I had long curly hair when diagnosed and the next day I got it cut short. I wanted the transition to be a bit slower mostly for my kids' sake. I was doing the \"cold cap\" treatments to prevent hair loss (I live in Europe). The treatments didn't work bc my cancer is very aggressive and I had really strong chemo every 15 days instead of 20. I don't regret it though, because I believe in life we should always give it our best shot. I did the strongest treatment available both before mx and after. I'm still on Herceptin till Sept. I promised myself to come back to this board which helped me so much when I'm better. Well ladies, it seemed like chemo would never end, but it did!! One day you will feel so good and proud of what you went through. All I can say is cancer is \"the best of times, and the worst of times\". I have never been happier in my whole life. The things I used to complain about are laughable. Your last infusion day will come too! Keep up the good fight! P.S. I've got a full head of hair too + eyelashes/eyebrows. I gave the wig away since I was only using scarves at the end. I wore dramatic long ones hanging down my back. I'll never wear a wig again if I ever get treatment again....",
      "MessageIndex": 470,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    }
  ]
}