{
  "AuthorID": "ILvTink",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71628/profile",
  "Posts": [
    {
      "AuthorID": "ILvTink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71628/profile",
      "Content": "Oct 30, 2008 10:38AM ILvTink wrote: .",
      "MessageIndex": 1,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723628",
      "Title": "Pathology Report Questionable ILvTink TheQu33n"
    },
    {
      "AuthorID": "ILvTink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71628/profile",
      "Content": "ILvTink wrote: It has been 2 weeks since my surgery and things seemed to going so well. Got the Alloderm with immediate reconstruction, drains were out after a week, and slow but steady recovery.  End of last week I received a call from bs office who told them that there was something questionable in my pathology report. She said SNB came back fine, everything else was fine except the report was not clear on a margin near the epidermis. Of course I was so distraut I didn't really understand all she said and didn't ask all the right questions but DH called her back and she said questionable margin near skin. I am assuming near the incision.  She said could need another surgery or possible radiation for this small spot depending on final clarification of results. BS was going to called pathologist directly for clarification since it wasn't clear and I also authorized a 2nd opinion to a Dr. Masood with the U of Florida here in Jacksonville. She is a reknowned breast pathologist right here in my own back yard. My main question is if I already have the Alloderm and implants and need a 2nd surgery to remove a bit more or radiation how will this affect the reconstruction I have already had?  Has anyone experienced this? Of mentally I was so positive and on the road to recovery but now I am back to the way I felt before surgery and scared and anxious.   Dx 8/15/2008, DCIS, Stage 0, Grade 2, 0/8 nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723628",
      "Title": "Pathology Report Questionable ILvTink TheQu33n"
    }
  ]
}