{
  "AuthorID": "IndianaDeb",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134227/profile",
  "Posts": [{
    "AuthorID": "IndianaDeb",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134227/profile",
    "Content": "Jul 6, 2013 08:45PM - edited Jul 6, 2013 08:59PM by IndianaDeb Adding my voice,too... I was diagnosed June 2011 with Micropapillary Stage IV TNBC and am learning to LIVE with this diagnosis.  Never dreamed that I would still be here 2 years later (you know, we have ....CANCER... Stage IV)!!  Taxol originally took  me to NED, then when it wasn't effective against recurrent tumors (multiple lymph nodes in my axilla and neck)  I switched to Doxil. That was effective against my cancer but beat me up too much - horrendous mouthsores -poor quality of life. Now giving my body a rest and will start Xeloda next. In fact, I have been on a chemo break for 4 months now, I feel great and have been able to take a couple of trips.  Fortunately my cancer has been staying in my lymph nodes and not any vital organs. I heard ithe Xeloda was easier to 'live' with and hope it will be effective against my cancer.  I will share my experiences and would love to know other's experiences with this drug. I have continued to work part-time, maintained my exercise regimen (strength & toning & yoga) throughout treatment.  It helps to live my life as normally as possible. I am blessed such that I have been able to check off some of those things on my bucket list, for example to visit a friend from elementary school that I haven't seen in over 20 years and to go for a hot air balloon ride!!  This diagnosis has helped me to reprioritize my life.  I have also discovered that there is abundant love and caring out there....... It  helps to know there are others out there with the same diangosis, thanks for sharing.",
    "MessageIndex": 236,
    "PostDate": "06/07/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
    "Title": "Triple Negative Stage IV Renae64 thrivingmama"
  }]
}