{
  "AuthorID": "IngridJ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178032/profile",
  "Posts": [
    {
      "AuthorID": "IngridJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178032/profile",
      "Content": "Jun 20, 2013 09:59AM IngridJ wrote: Soccermum; In same boat as you also..2 months ago diagnosed, now doing chemo.. Four kids; 13,11,8,7.. Really difficult telling them but kids are nothing if not resilient, and are optimists too.. My 11 year old gave me a pep talk on being positive and enjoying every day!!! Was a strange experience being on the other end of the life lecture but I felt glad he could be so positive and obviously that was how he wanted me to be so.... Take it one day at a time.. Trite but true..",
      "MessageIndex": 17,
      "PostDate": "20/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/806411",
      "Title": "My daughters tears are killing me.... soccermomof4 lekker"
    },
    {
      "AuthorID": "IngridJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178032/profile",
      "Content": "Sep 26, 2013 06:17PM IngridJ wrote: Hi Shoppygirl, I am in Australia, but have been trying the Spectral products. There is one; DNCN, a liquid, and a spray that you put on at night. The girl in the hairdressing salon where I got them, rang their consultant here to make sure they were ok to use post bc. They said they were.. I am not quite 8 weeks out, have a fine but definite covering pretty much all over my head that seems to be thickening up.. Think the spectral is helping.. I was going to try nioxin but saw this range so...Think it is pretty similar but has a slightly different compound. Good luck with yours.. I know the feeling, so want more hair.... Oh and I am taking biotin at recommendations from several on this thread..",
      "MessageIndex": 19519,
      "PostDate": "26/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "IngridJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178032/profile",
      "Content": "Sep 26, 2013 08:07PM IngridJ wrote: Shoppygirl- re biotin.. Not sure, I don't see why there would be an issue with the tamox though..It's vit b I think..",
      "MessageIndex": 19524,
      "PostDate": "26/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "IngridJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178032/profile",
      "Content": "Sep 24, 2013 07:02AM IngridJ wrote: I am 7 weeks out, trying Spectrum products.. Hope they're not too toxic...Like nioxon i think.. Think they've helped a bit...Very fine growth all over, but top is like yours Pattysmiles, coming in ok, sides, especially temples...mmmm not so much.. The back looks ok..I have a really high forehead so have always had a long fringe, except for a terrible 80's cut with a tiny short fringe and that wasn't good.. Is it safe to say I am obsessed.. Read where rubbing olive oil could help.. Lucky no one to complain when I go to bed smelling like an oily mess..just want hair... any hair...",
      "MessageIndex": 19511,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "IngridJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178032/profile",
      "Content": "Sep 26, 2013 08:06PM IngridJ wrote: Wow Ms Phoroah, You are lucky.. Wish mine was fuzzy and full. I look like a man with a very very short cut to try to hide his very receding temples... Still have wig, sick of her, great though she's been but don't dare go topless yet. Shoppygirl, You are welcome.. Good luck and roll on better (any) hair days ahead for us all..",
      "MessageIndex": 19523,
      "PostDate": "26/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "IngridJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178032/profile",
      "Content": "May 6, 2013 07:01PM IngridJ wrote: Hi, Thanks VR for clarification and for replies!!! Thx Alaska Angel too.... Just re-read all posts, Positivethinking- did you get your oncotype score? Hope it was low.... Your stats sound similar to mine... Interesting re the dense breasts.. I always thought because mine were so small that they couldn't be dense, but on my first mammogram where the idc was picked up, they said that they were....Does the dense ness mean less response to the tamoxifan or more??? Thanks Ingrid",
      "MessageIndex": 102,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "IngridJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178032/profile",
      "Content": "May 7, 2013 03:28AM IngridJ wrote: Thanks AA.... Interesting...!!! I suppose high breast density must relate to high(er) levels of oestrogen circulating in the body ... I breast fed all four of my kids, yet still did have quite dense breasts.. Hopefully tamoxifan will fix that... Still waiting on oncotype info first though. Six weeks post surgery- it's hard not to stress.... I wonder how many t1a sisters here are opting for chemo? . If er and pr pos that is... Anyone else with a small t1a tumour here who opted for chemo ?",
      "MessageIndex": 104,
      "PostDate": "07/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "IngridJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178032/profile",
      "Content": "May 6, 2013 04:27AM IngridJ wrote: Hi all from Melbourne, Australia.. A valuable discussion for me... Have been reading with interest all your posts.You all sound amazing.... I am awaiting oncotype at the moment for 5mm idc. tumour highly er and pr pos. The Initial path reports made chemo look highly unlikely, but final report showed ki67 was borderline high at 20, and mitotic rate was 3/3, so the onc suggested oncotype as some small tumours can be aggressive. Felt so lucky to get it when I did but now having nervous anxiety about it all.. Just still not sure if size is factored into the oncotype score? Read somewhere that it was, and somewhere else that it wasn't.... Any clues??",
      "MessageIndex": 92,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "IngridJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178032/profile",
      "Content": "Jul 5, 2013 05:52AM IngridJ wrote: Hi I was/am in a similar situation to you. Small grade two tumour, no nodes, found early.. All good.. But the oncotype came back one below intermediate, the tumour had borderline high ki67, and mitotic rate was 3/3; I was told no chemo by one onc, and yes, no, maybe by another. Age 43 at diagnosis.. So have opted for 4 x CT.. Hasn't been fun, but it hasn't been too bad either; have another two to go. Basically a month more.. I feel your pain... in the beginning it all seems so good.. But then the bit that isn't so good trickles in and you think hmmmm... For me, it came down to wanting to do everything to reduce future risk..... Am a thinker so knew it woukd play on my mind also.. Am not convinced it was completely necessary (the chemo), but then...it is all unknown... Good luck w your decision, hope the oncotype is low, low, low... From my observations, it is grade two that can have the widest variability in oncotype scores. Generally grade one tumours are low and three high, (although there are the exceptions), but grade two can seem to go either way...",
      "MessageIndex": 2,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/807212",
      "Title": "Stage 1, Node neg. has unique dilemmas Power-House IngridJ"
    },
    {
      "AuthorID": "IngridJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178032/profile",
      "Content": "Jul 5, 2013 11:38AM IngridJ wrote: You're welcome Power-House! Remember knowledge IS power, so gather all that you can re your situation... Makes it easier to make a decision when all of the facts are in front of you.. The other thing to remember is that you can get more than one oncologist's opinion. Two or even three.. I found following the threads on here about oncotype scores and other women's decisions very helpful. Type oncotype into the search and see what comes up. There is an oncotype roll call thread, and many, many threads to look at...There are some really detailed threads.. I found much more information from these boards than from my oncologist, as you'll learn I think that's fairly common. I remember stressing more over the oncotype results than anything- to be presented with a number, like a score in a competition.... Seemed (still does really) so freaky.. But because I'd done enough looking into how they arrive at the score, I was pretty sure I'd be in the grey zone.. And i was almost right...Not quite, but close enough to it... Check out the Tailorx trial which is going on at the moment, the upper end of the low range and the intermediate are being tested to ensure the right people are getting chemo. I think it's more to test over treatment than under treatment but its interesting. Also see if you can get the ki67 and the different components of the tumour's grade. I was told that the mototic rate was the one to look at.. Cancer math and predict are interesting tools to help....All in all, good luck and happy to help...:))",
      "MessageIndex": 4,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/807212",
      "Title": "Stage 1, Node neg. has unique dilemmas Power-House IngridJ"
    },
    {
      "AuthorID": "IngridJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178032/profile",
      "Content": "Jul 13, 2013 11:33PM IngridJ wrote: Hi Terrican My mother had bc too, but because she wasn't diagnosed until 68, I and my GP, thought no need to worry until in my 50's anyway.. However...Found a small idc in March, grade two, was on the fence re chemo (oncotype just below intermediate) am age 43, but am doing the 4xTC that you have been suggested. Have my third tomorrow.. It hasn't been too bad. Definitely doable so far.. As Flanelette says its insurance, and this is the chance to throw everything at it... I chose to have mastectomy on that ca side, turns out was the right choice as I also had two types of ca insitu.. Even if id opted for lumpectomy, would have been back having mas... Once chemo is done, will have the other side (mas) and recon, the mastectomy op not too bad.. Alleviates some of the future worry.. So fwiw- that's my story. It is your decision, and yes, can relate to all your thought processes, the freaked outedness etc...the whole thing..... Keep your sense of humour... Bite me comment made me lol..:)) Plus....Who could eat and do all that stuff with kids to look after??? Also- I haven't done the genetic testing yet.. Unlikely to be BRAC but maybe some genetic connection not yet fully identified.. That's poss, and my father had prostate so there is a link there possibly too.. Sigh...",
      "MessageIndex": 19,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/807212",
      "Title": "Stage 1, Node neg. has unique dilemmas Power-House IngridJ"
    },
    {
      "AuthorID": "IngridJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178032/profile",
      "Content": "Jul 13, 2013 11:37PM IngridJ wrote: PS if you do do chemo think about cold caps, there is a thread on these boards.. That has been my only regret....:(",
      "MessageIndex": 20,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/807212",
      "Title": "Stage 1, Node neg. has unique dilemmas Power-House IngridJ"
    },
    {
      "AuthorID": "IngridJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178032/profile",
      "Content": "Jul 10, 2013 01:13AM IngridJ wrote: Hi Just wanted to echo Wren's words, don't panic, try to stay calm... And agree the combo of childbirth and tamox would be a hormonal overload.... Had/have similar diagnosis to you... Trying not to over think everything (not easy I know), and to keep some hold on perspective and reality... Counselling does help... Also, Wren your mafia comment gave me a laugh too... Soooo true.....x",
      "MessageIndex": 14816,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}