{
  "AuthorID": "Iniah",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150907/profile",
  "Posts": [
    {
      "AuthorID": "Iniah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150907/profile",
      "Content": "Sep 26, 2012 04:24PM Iniah wrote: Morningperson, good luck while  you wait for your results! Hugs and prayers coming your way!!",
      "MessageIndex": 1,
      "PostDate": "26/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/794066",
      "Title": "Mammo clear, mass found on ultrasound morningperson morningperson"
    },
    {
      "AuthorID": "Iniah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150907/profile",
      "Content": "May 14, 2012 03:06PM Iniah wrote: Hi everyone I am new to breast cancer, and have a lumpectomy scheduled for Wednesday, incl. SNB. I am not scarred about the surgery, but do hope that my nodes will be negative. I will need radiation later. My tumor is 12mm as well, E+P+Her2neg. I will go buy a front closure bra like many of you suggested. I will let you know how it was for me, all the help I can get is very much appeciated. This is not easy for sure!! ",
      "MessageIndex": 39,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786356",
      "Title": "Lumpectomy - what can i expect? Shayne Angelaw69"
    },
    {
      "AuthorID": "Iniah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150907/profile",
      "Content": "May 17, 2012 01:49PM Iniah wrote: Hi Everyone and hi Shayne! I had an infiltrating ductal carcinoma, 12mm.. Surgery was yesterday and it went very well. I took 0.5mg of Xanax witha sip of water before going in (had surgeon's ok) and then had the wire placement with dye injection into the breast. Not fun, but not bad. They took out two lymph nodes which are preliminary negative. Bought front closure sports bra one size bigger than normal at JCP. I had some after effects of the anesthesia which made my heart race during the night, but other than that I did not need any pain meds. I had Motrin 800 mg after the surgery while in recovery. No real pain today, just soreness in the arm pit area where nodes were removed. Breast looks the same as before in size etc. This part so far was easy and I hope it will be for you too and everyone else waiting for the surgeries. Will start radiation in June as well as Tamoxifen, most likely. ",
      "MessageIndex": 48,
      "PostDate": "17/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786356",
      "Title": "Lumpectomy - what can i expect? Shayne Angelaw69"
    },
    {
      "AuthorID": "Iniah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150907/profile",
      "Content": "May 17, 2012 10:41PM Iniah wrote: Shayne, I think because you have Carcinoma in situ, which means it has not spread (or infiltrated) out of the duct. That is great news for you! You will just fly through your lumpectomy and maybe some radiation? Lucky that you found your lump so early. Did you find it via a mammogram? I did mine... My cancer infiltrated the area outside the duct, that is why the lymph nodes were checked. Hope that helps!! ",
      "MessageIndex": 50,
      "PostDate": "17/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786356",
      "Title": "Lumpectomy - what can i expect? Shayne Angelaw69"
    },
    {
      "AuthorID": "Iniah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150907/profile",
      "Content": "May 15, 2012 04:12PM Iniah wrote: Shayna I know what you mean. I have been diagnosed 2 weeks now with same size tumor as you. Lumpectomy and SNB tomorrow. Ups and downs for me too, wondering if things will ever be the same. Hang in there, I will post my surgery experience. ",
      "MessageIndex": 40,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786356",
      "Title": "Lumpectomy - what can i expect? Shayne Angelaw69"
    },
    {
      "AuthorID": "Iniah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150907/profile",
      "Content": "Dec 13, 2016 06:28PM Iniah wrote: I am 4.5 years out post lumpectomy and radiation. I have moderate to severe pain in my lumpectomy site, my SBX site and in my arm pit. The pain comes and goes. It feels like a burning, sharp, sore, inflamed swollen mess. The past 2 weeks have been very painful. It feels like my breast is on fire. As per my mammogram I do have scar tissue forming; I had less pain right after surgery compared to now. I am on Tamoxifen. Not sure if I should go see my surgeon?",
      "MessageIndex": 51,
      "PostDate": "13/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797780",
      "Title": "Pain in lumpectomy site years later Rachel1 mom2bunky"
    }
  ]
}