{
  "AuthorID": "Inigo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275346/profile",
  "Posts": [
    {
      "AuthorID": "Inigo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275346/profile",
      "Content": "Aug 6, 2018 03:42AM Inigo wrote: pmac- I'm a couple weeks ahead of you - tomorrow will be 5 weeks post PBMX direct to implant - and obviously everyone is different. That said, I was very disappointed with how much pain I was still in at 3 weeks. And similarly, it was worse in the morning (sometimes waking me in the middle of the night). I've had a number of surgeries in my life, and I've been surprised at how much longer it is taking to heal from this one. Some things to consider: How are you sleeping? I'm a side sleeper, and that's just not possible yet. I have to wedge myself with pillows to keep from rolling over on my side. There have been a few nights where even that doesn't work, and I'm back in the recliner. What are you wearing to sleep? I found I needed different levels of support during the day and at night. For the sunburn feeling - I noticed it felt better if there was some light pressure on that are. During the day I'd find myself pressing my hand to my upper chest. I bought a large hot/cold compress that's slightly weighted - it's filled with something like buckwheat. I don't actually heat it or chill it, but i find the weight very soothing at night. Again, everyone is different, but it's been all uphill since week three. I'm off all pain meds now. I'm stiff more than sore in the morning - nothing a hot shower and some gentle stretching can't fix. How old/big are the little ones? Have you talked to your surgeon about when you'll be released from lifting restrictions?",
      "MessageIndex": 2,
      "PostDate": "06/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/866425",
      "Title": "double masectomy and implant surgery pmac NotVeryBrave"
    },
    {
      "AuthorID": "Inigo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275346/profile",
      "Content": "Jun 11, 2018 06:51PM Inigo wrote: Another July 3rd! Preventative bilateral mastectomy, prepectoral, and hopefully direct to implant. I’m BRCA2+, had the BSO two years ago when diagnosed.",
      "MessageIndex": 10,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Inigo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275346/profile",
      "Content": "Jul 17, 2018 08:18PM Inigo wrote: Hi all. I've been following along, but haven't posted since my first post. I'm two weeks out from prophylactic bilateral nipple sparing mastectomy with pre-pectoral direct to implant reconstruction. Knock on wood, everything's been good so far - well, now that the drains are out. Except I'm super exhausted. In fact, I think this is the latest I've been awake in two weeks (and it's only 8 PM!) I saw some comments about bras and irritation, and wanted to mention that I found a sports bra that so far offers just the right amount of support, has a front zip, and the bottom band is wider and doesn't irritate my incisions. It's called Copper Fit, and no joke I found it at Bed, Bath & Beyond (guess that's the Beyond part!) I went back today and picked up two more. Pathology report came back with all benign changes, but with the BRCA2 mutation my breast surgeon said if I had and doubt about whether this was the right decision, it definitely was. I know the surgery and healing has been easier without having to deal with an actual cancer diagnosis on top of it all.",
      "MessageIndex": 129,
      "PostDate": "17/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    }
  ]
}