{
  "AuthorID": "invisible",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119216/profile",
  "Posts": [
    {
      "AuthorID": "invisible",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119216/profile",
      "Content": "May 30, 2013 09:12AM invisible wrote: thanks for the responses.  I took the chemo on offer, and await results of further testing.  My care team here in Germany is seems uninterested in sampling the ascites,  Perhaps because every time they've put a needle or knife to me this week has resulted in a transfusion.  I am wrestling now with where/how proceed with a decent second opinion which is for many esoteric reasons more complicated than it should be.   I really do need a home language consultation though.  MD Anderson or any of the major centers is an option.  SAMayo - are you seeing the H. Lee Moffitt folks?  they seemd to have a relatively robust abdominal/thoracic cancer group - at least from what the web can tell you. SophieJean- thanks for your detailed response.  My original oncologist did not use tumor markers however i had them taken at diagnosis in 2010 and regularly with this group since late 2011 and they have always been dead flat normal.  ",
      "MessageIndex": 9,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805133",
      "Title": "oncologist says recurrence, can't locate mass invisible EnglishMajor"
    },
    {
      "AuthorID": "invisible",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119216/profile",
      "Content": "invisible wrote: It appears i have joined your ranks today, but all my results are weird.  Oncologist says based on high tumor markers and potentially suspicious mri results in the peritoneum and omentum I have recurred and should go back to active chemo today, right now.   Had an inconclusive biopsy of the peritoneal area yesterday, and moved on to a bone biopsy today.  Hemoglobin and platelets have been crashing  over the past 2 weeks and i have CT confirmed small aceites.  Onc says lungs, liver and brain are all clear on scans this week. Does anyone else have any experiences in which progression to stage iv was determined without locating a focal mass or hyperdensity? Dx 7/28/2010, IDC, 3cm, Stage IIIC, Grade 2, 11/15 nodes, ER+/PR+, HER2- Dx 6/2/2013, IDC, Stage IV, mets Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805133",
      "Title": "oncologist says recurrence, can't locate mass invisible EnglishMajor"
    },
    {
      "AuthorID": "invisible",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119216/profile",
      "Content": "Nov 26, 2011 10:14AM invisible wrote: I could have been your cousin a year ago.  My mantra was why would I choose to make myself physically sick?  I may have cancer but I feel great right now. Unlike her, I did not refuse surgery, but it was touch and go up to my first infusion.  I was both terribly afraid of the side effects I'd both witnessed in my relatives and read about.  I addition, I believe substantially depressed.  Talk therapy for the depression and fear are completely compatible with a holistic lifestyle.  I'd encourage her to start seeing a therapist who works with cancer patients and see what develops. ",
      "MessageIndex": 53,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "invisible",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119216/profile",
      "Content": "Aug 25, 2013 07:24AM - edited Aug 25, 2013 08:44AM by invisible Mike - I'm recently diagnosed myself.  Given the high number of unknowns and my relative good health at this point I've told my 13 and 18 year old only that I'm back in active treatment.  The older child moved into the freshman dorms at university on Friday, and we live thousands of miles away.  I didn't want to burden him with this information when he'd be separated from me for so long.  I think there will be plenty of opportunity in the course of events to disclose additional information as it becomes relevant.  Certainly they're old enough to handle more information and if they ask me before the opportunity presents itself, I'll tell all. ",
      "MessageIndex": 3,
      "PostDate": "25/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809873",
      "Title": "Children Question MikeJohn invisible"
    },
    {
      "AuthorID": "invisible",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119216/profile",
      "Content": "Nov 22, 2014 10:59PM invisible wrote: I too had tiny arm veins; my sureon elected to go with a jugular connection instead. If your insurance will approve this may be a good option for you to keep a chest placement. I'm sure they'll find the perfect spot and will be thinking of you.",
      "MessageIndex": 7,
      "PostDate": "22/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/826448",
      "Title": "Alternative place for port bhd1 chris1959"
    },
    {
      "AuthorID": "invisible",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119216/profile",
      "Content": "Jul 30, 2013 12:41AM invisible wrote: y mother, in her later years began sending my sister and I vingettes of her own youth and times with her mother who died when she was 12.  How her mother insisted they do the dishes by rinsing them with boilng water to sterilize them,  The sense of achiement she had when her mother deemed her competent at age six to iron father's shirts,  How preparing lunch for a church function made her moritfied but left her with the few recipies she has from her own mother, not her step mother.  I am kicking myself now for not saving these messages.  They provided a wonderful context of the family she come from, how it shaped her and I can see parallels in myself.    On the subject of recipies - they can be wonderful shared moments of history and enhancers of memory.  My sister and I are still trying to recreate with various degrees of success one of my Dad's frequent contributions to the dinner table.  It's always a hoot to taste the latest version and share memories.  I'd encourage you to cook some of your recipies with your daughter now, and include the actual recipies, properly measured or not, in your box.  Kudos to you for being proactive about this. ",
      "MessageIndex": 7,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/808524",
      "Title": "Memory box - what to put in it? Latte DivineMrsM"
    },
    {
      "AuthorID": "invisible",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119216/profile",
      "Content": "Oct 5, 2011 11:30AM invisible wrote: ok this is sort of indelicate, but as a new glove wearer something I've been trying to decide the best method for restroom hygiene- to remove the glove or carry disposable surgical gloves to cover with.  Reading this makes me lean towards gloves, but hate the hassle.  Are there any more innovative solutions?",
      "MessageIndex": 28,
      "PostDate": "05/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/775100",
      "Title": "Feel like the worlds biggest dummy cookiegal BeckySharp"
    }
  ]
}