{
  "AuthorID": "invirginia",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143399/profile",
  "Posts": [
    {
      "AuthorID": "invirginia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143399/profile",
      "Content": "Jan 19, 2012 08:56AM invirginia wrote: Oh Fran, that sucks! Even my 9-yr-old knows not to mention events around kids who aren't invited like birthday parties and such. How insensitive of that person, although they might not have even been aware of what they did--but adults should know better. Well, if I was there I would go get Chinese with you! :-) ",
      "MessageIndex": 1,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781293",
      "Title": "vent about friends in chemo fredntan fredntan"
    },
    {
      "AuthorID": "invirginia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143399/profile",
      "Content": "invirginia wrote: Hi Everybody, I don't even know if I have BC yet but I just need to vent for a minute. I'm 48, married, 9-yr-old daughter. My diagnostic mammo shows microcalcs and tomorrow is my stereo biopsy. I'm actually ok with all of that. I've come to grips with what the future could hold and will deal with it if it happens. But what's really stressing me out is that I have a big annual business trip coming up in 3 weeks and for right now I haven't told any managers/boss here at work about this because it could all prove to be nothing. But if it's not, then it's going to mess a lot of things up for my boss - he'll have to find a replacement for me at this conference (I'm part of the team that puts on the conference) etc etc etc. So while we're sitting around talking about the plans for this conference, in the back of my mind I'm like \"I don't even know if I'm going!\" I don't want to share this info with my boss (male) just yet because 1) it's not something I want to talk about with him (or anybody not close to me),  and 2) I have nothing to tell him yet anyway. Of course if I get bad news I'll be telling him and everybody else who will be impacted. But right now.... no. My parents are both dead, my sister is estranged from me and my brother has enough on his plate right now to not want to tell him anything unnecessarily. Only my husband and two friends at work know. I see a lot of people on this board who have real troubles and here I'm not even diagnosed yet so I feel petty complaining about this. I do usually keep all my troubles to myself, but thought I'd give this board a try. Thanks. Dx Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/781275",
      "Title": "Biopsy Tomorrow invirginia hopeful123"
    },
    {
      "AuthorID": "invirginia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143399/profile",
      "Content": "Jan 19, 2012 10:04AM invirginia wrote: Thank you Gail! I sincerely hope and pray that you get good news soon! I see you're going in tomorrow, just like me. The waiting and not knowing is sooo hard. I'll be thinking about you tomorrow :-)  So my post came out weird like I'm worried about my job/trip, but what I really mean is, I'm sitting there while they talk about how many envelopes they'll need and I really want to stand up and scream \"Screw the envelopes! I might have BC!\" It is constantly on my mind. I don't want to plan my trip. And then if it's nothing, I still don't want to go on this trip. I don't know what I'm feeling, just overwhelmed and wanting to stay home with my husband and daughter and not go on a business trip for 8 days no matter the outcome.  ",
      "MessageIndex": 2,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/781275",
      "Title": "Biopsy Tomorrow invirginia hopeful123"
    }
  ]
}