{
  "AuthorID": "IrishKatie5…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243505/profile",
  "Posts": [
    {
      "AuthorID": "IrishKatie5…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243505/profile",
      "Content": "Jan 23, 2017 08:03AM IrishKatie55 wrote: Our DX is very similiar. My after surgery tumor measured 1.9cm, comes up as 1cm on the chart. I am hoping 'New Normal' is coming in the near future.",
      "MessageIndex": 15,
      "PostDate": "23/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "IrishKatie5…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243505/profile",
      "Content": "Jan 23, 2017 07:36AM - edited Jan 23, 2017 07:37AM by IrishKatie55 Fightingirl. I had lumpectomy on 12/28, spacer for brachytherapy radiation was put in at that time. On the 3rd of January spacer was replaced with the actual balloon catheter at surgeons office. Started my 10 rads in 5 days on January 5th. 8:30am and 2:30pm. Final treatment was January 11th (weekend involved) and balloon was taken out right at the last treatment. My surgeon, radiologist and MO were all supportive of this treatment. Not everyone is eligible depending on Stage, pathology, placement of tumor. Was comfortable with the fact the radiation was going to the cavity and margin areas, avoiding some other organs. I was lucky to be only 6 miles from the Charles Wood Cancer Center here in the Adirondacks of NY so 2x per day was convenient. I am thirteen days from the therapy and so far no major issues. 3 incisions healing (catheter area took a few extra days to want to close up) Certainly still tender in my breast. Meeting with MO this week to see what is recommended from here. Original biopsy Ki-67 was at 38.8%, after surgery was 22%. Waiting on Oncotype results for firm results next few days. Hoping low. Feel free to message if you have any other questions I can help you with. Make sure they give you the supportive front zip bra...world of difference in holding those pesky, swinging, catheter tubes in place for that period. Best of luck.",
      "MessageIndex": 13,
      "PostDate": "23/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "IrishKatie5…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243505/profile",
      "Content": "Feb 11, 2017 07:34PM - edited Feb 11, 2017 07:38PM by IrishKatie55 Hello CecyRev Go into the Stating Chemo February 2017 forum and read a few posts. All sharing information of what, how much, and when we are receiving. Many different types of Chemo based on your diagnosis. Having knowledge will help you be prepared and that was most helpful in getting thru. Had my first chemo treatment on Friday, Feb 3rd. Came through and feeling ok right now Also helpful is to look at all the diagnosis under the posts. That really helps to see who might be close to you. While you are waiting, this site also has many places you can look up information on chemo, side effects and what to expect. Hope you get your information soon. As anyone will tell you, once you know your treatment plan you will feel better about getting it going. Nothing you want to be happening, but information will give you power and strength. Folks will answer any questions you have. Hang in there ",
      "MessageIndex": 2,
      "PostDate": "11/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/852663",
      "Title": "Will start chemo soon CecyRev Moderators"
    }
  ]
}