{
  "AuthorID": "irishdreama…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
  "Posts": [
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Dec 5, 2008 07:15PM irishdreama wrote:",
      "MessageIndex": 5,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/725486",
      "Title": "feeling lonely,nervous,anxiety ridden auntiekayro GryffinSong"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Jul 19, 2008 12:12AM irishdreama wrote: Hi Tweeker I also chose to have a bilateral mastectomy. The cancer was in my left breast, but a friend of mine's mom had had a unilateral mastectomy for ER+ breast cancer, was on Tamoxifen for 5 years, and 2 years later got a totally different type of cancer ER- in her remaining breast. NO WAY did I want to take that chance. I did have reconstruction, expanders, then silicone implants, but went with only 304cc (approx. B cup) so I( don't have to wear a bra if I don't want to, yet I have enough \"Foob\" that I can wear cute tank tops etc. The bottom line is, you have to do what feels right to you. Good Luck!",
      "MessageIndex": 24,
      "PostDate": "19/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/706536",
      "Title": "prophylactic mastectomy-your input wanted tweekerbeeker lilith"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Jul 25, 2008 10:59AM irishdreama wrote: I completely agree with Shirlann. I chose to have a bilateral mastectomy, but I put a lot of thought into it. I have a young daughter, and I had two tumors in my left breast. I could also feel the lymph nodes under my left arm, and on the ultrasound, they found 16 lymph nodes-9 were definately cancerous. My best friend's mom had had ER+ breast cancer, a mastectomy, tamoxifen for 5 years, and then 2 years later, she ended up with a completely different breast cancer in the opposite breast-ER-. I took all of these factors, as well as my age at time of Dx (45) into consideration when I made my decisions regarding my treatment. I don't regret any of the choices I made. I wanted to treat this very aggressively. But as Shirlann said, there's no such thing as a cure for cancer, and there are no guarentee's. I felt the double mastectomy gave me a better chance to avoid getting it again. Good luck to you!",
      "MessageIndex": 14,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/709468",
      "Title": "masectomy - seems like this sucks rseaw22 Mandy1313"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Aug 21, 2008 12:27PM irishdreama wrote: Kevin, just caring enough about your wife to come here for support and information shows how much you love her. She's a lucky woman to have such a supportive husband. I am a single mom of a 10 year old, so believe me, as all of us singles who went through all this alone, just you being there and helping is a HUGE thing. Best of luck to both of you",
      "MessageIndex": 21,
      "PostDate": "21/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/719344",
      "Title": "How to support her KevinK 1Cathi"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Jul 24, 2008 09:33AM irishdreama wrote: Hi Roxy, I'm not sure any of the over the counter meds would be all that effective on your pain, especially if the narcotics are working well. But you might want to ask your doctor about Ultram (tramadol) it's a prescription, but not a narcotic, and that worked really well for me after my mastectomy. Good luck, and I hope you feel better! Jeri",
      "MessageIndex": 1,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/709609",
      "Title": "pain meds roxy42 evieo"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Jul 17, 2008 02:02PM irishdreama wrote: I'm a lefty too-I've been very fortunate that I haven't had to deal with any insensitive comments at all, and it sounds like I'm in the minority. Fortunately for me, people have been nothing but supportive-to the point where sometimes I have to say Stop, I can do it! Lisa and all the rest of you, I'm so sorry you've had to deal with such insensitivity. You're right, if it were them, their attitudes would certainly be different.",
      "MessageIndex": 17,
      "PostDate": "17/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/709171",
      "Title": "Very Angry! LisaG42 BessB"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Oct 1, 2008 02:02PM irishdreama wrote: Liz-Here's what I'd like said on your radio program. There are millions of young, often single moms being diagnosed with Breast cancer every day. And while I think it's great that so much money is raised for research to find a cure, there should be an organization dedicated to helping financially strapped women, especially those with young children, who are trying to work through treatment. We need to help those with the disease, not just the future generations who MAY get the disease.",
      "MessageIndex": 29,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722024",
      "Title": "Christina Applegate my new hero KiminJax Daffodil"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Oct 1, 2008 01:16PM irishdreama wrote: Carol, I agree with you. I think Christina has a lot of guts, and admire her a lot. And I respect that she's filled with hopefulness. But I also get what the other women are saying. People need to realize tha this is CANCER. There is NO CURE. We hope and pray that we will live cancer free for the rest of our lives, but I for one will not call myself a \"survivor\" until I die from something else! I'm not being negative, really. I have a very hopeful and positive outlook. But I'm also a realist, and it is what it is. For the moment-Uncurable.",
      "MessageIndex": 26,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722024",
      "Title": "Christina Applegate my new hero KiminJax Daffodil"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Oct 21, 2008 10:40AM irishdreama wrote: I agree with Rock and kerry_lamb. I'm sure if there were something that prevented hair loss during chemo, SOMEONE other than a know-it-all store clerk would have mentioned it. My hair came back pretty quickly, but I'm just now getting my eyebrows back and this is a year and a half after chemo!",
      "MessageIndex": 449,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Aug 6, 2008 02:12PM irishdreama wrote: Hi Danyel Your onc does sound like a jerk. I had one of those throughout chemo and surgery, and got a new one even before I started radiation. I lost a lot of weight during the AC treatments, but I did gain weight during the taxotere, most of which was fluid. I still take a diuretic because my feet and legs still swell up because of the taxotere. But remember, everyone handles things differently, and chemo affects people in different ways. Good luck. Jeri",
      "MessageIndex": 3,
      "PostDate": "06/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/719128",
      "Title": "update from doctor Danyel98 Maryiz"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Jul 31, 2008 01:01PM irishdreama wrote: Hi Carly, I had AC every 2 weeks for 4 cycles, then taxotere. With the AC I got the hair loss, very low white cell counts, mouth sores, diminished appetite, and very bad headaches after the 2nd and 3rd treatments that lasted for days. The neurologist gave me a prednisone taper for the last treatment, so no headaches then. I was very lucky-the Emend worked great-I never had the nausea or vomiting, and never had to take the Zofran, or compazine that was prescribed. Chemo reacts differently with everybody, but Libragirl is right, drink lots and lots of water, as cytoxan i9s very bad for your kidneys. Good luck!",
      "MessageIndex": 4,
      "PostDate": "31/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/718796",
      "Title": "Side Effects?? Carly68 irishdreama"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Nov 21, 2008 05:22AM irishdreama wrote: Hi Jasminn I had to have a mastectomy, and I did have recon as well, and am very happy with the outcome. However, you have to do what's best for you. I'd definitely pay attention to your tumor grade as well as lymph node involvement, as grade 3 tumors tend to be more aggressive. Just get all the facts before you make a final decision. Good luck to you!",
      "MessageIndex": 8,
      "PostDate": "21/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724746",
      "Title": "Please tell me I'm not crazy Jasminn bettysgirl"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Dec 2, 2008 08:32AM irishdreama wrote:      ___ Other (please list)­­­______________________________     ___Nausea   ___Loss of Appetite  ___Vomiting   ___Weight Loss     ___Leg pain ___Swelling  ___Neck Pain   ___Muscle Pain     ___Migraines ___Seizures  ___Insomnia __X_Other__Estrogen Blocker to prevent recurrence        ___Yes __X_No 4.   Have you ever researched natural alternatives, such as marijuana or other herbs?             _X__Yes ___No 5.   Thinking of the symptom you suffer the most from in question 2, how likely is it you       would use medicinal marijuana instead of chemical prescriptions if it were legal?       _X__Lease Likely  ___Somewhat Likely  ___Most Likely",
      "MessageIndex": 1,
      "PostDate": "02/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725331",
      "Title": "Survey-medication side effects Luvstrwberry LisaAlissa"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Jul 22, 2008 05:14AM irishdreama wrote: Hi Daisy Having such a poitive attitude is half the battle! Sorry you have to be here, but glad you came. Best wishes!!! Jeri",
      "MessageIndex": 6,
      "PostDate": "22/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/709420",
      "Title": "Can I come in?? Mom3 footprintsangel"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Nov 4, 2008 07:12AM irishdreama wrote: It's true. If you're talking, your legs are crossed, etc. it can affect the b/p reading. At my Dr.'s office, they always ask me not to speak while they're taking my b/p.",
      "MessageIndex": 1,
      "PostDate": "04/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/723825",
      "Title": "question about those automated bp machines althea jerseymaria"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Jul 21, 2008 02:41PM irishdreama wrote: Elisa, After my drains came out, I usually wore either the cami, a t-shirt or like Sheila, a front hook sport's bra. Whatever makes you comfortable!",
      "MessageIndex": 3,
      "PostDate": "21/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/709447",
      "Title": "What do you wear after the drains come out? lisa27 robin711"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Sep 13, 2013 09:53PM irishdreama wrote: 4myangels, I REALLY wish this site had a \"like\" button. I could not have worded your reply to Andrea any better!",
      "MessageIndex": 8,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810889",
      "Title": "Anyone have a good anti-Komen op ed letter? Iwillwinthisbattle chanah"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Oct 21, 2008 08:43AM irishdreama wrote: I think that it may be healthcare professionals in general. I have it (I'm a medical asst.) and my friend has it-she's the senior advocate(social worker) for the hospital. I was diagnosed just a month or so before she was. That would be a very interesting survey.",
      "MessageIndex": 95,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Jan 22, 2008 09:47AM irishdreama wrote: Otter I'm so sorry to hear of your diagnosis, and your struggles with making the choice that's best for YOU. It's your body and your life, and you need to feel as comfortable as you can with your decision. I had to have the works-Chemo, then mastectomy (I chose to have bilateral) and then radiation. I'm very fair skinned as well, but I was very lucky. The rad doc and techs did a wonderful job, and I just got a little pink, and some very tiny blisters under my left chest. I really had NO side effects from the radiation at all. I wish you the best of luck in whatever choice you make. Jeri",
      "MessageIndex": 29,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698898",
      "Title": "Feeling pressured to have lumpectomy instead of mastectomy otter irishdreama"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Oct 28, 2008 01:56PM irishdreama wrote: I'm with you dawnmrn1! We are given what we're given in life, and there's always somebody in worse circumstances than we are-I thank God every day that I feel as good as I do RIGHT NOW and that I have a beautiful, healthy daughter. I went back to work 10 days after my bilateral mastectomy (with a nice dose of shingles at the same time) and think I'm stronger for it. Everyone has to do what they think is best for them.",
      "MessageIndex": 99,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "irishdreama…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55155/profile",
      "Content": "Dec 3, 2008 09:31AM irishdreama wrote: Hi Leah So sorry about your mom. I did 4 cycles of AC then 4 cycles of taxotere. I have to agree with Bmac-for me, taxotere was brutal. I also took the steroids, didn't have a problem with fatigue, I couldn't sleep at all. I did have the nail issue, mine turned yellow, then black, and curved in a very funky way. I also had really bad body aches and swelling in my feet, legs and a puffy face. Also, am still bothered by neuropathy, although it's finally subsiding. BUT your mom could have completely different SE's or none at all. Each person reacts differently to everything. I really hope that she can tolerate the taxotere. Take care!",
      "MessageIndex": 5,
      "PostDate": "03/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725367",
      "Title": "Docetaxel (Taxotere) anyone? lemon_acosta MrsJMS"
    }
  ]
}