{
  "AuthorID": "Irishtess",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
  "Posts": [
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Irishtess wrote: I recently posted this info for my sisters in the 2010 April Mastectomy club, and thought others might be interested.  Before I was discharged from the hospital 2 weeks ago, I received a booklet (plus instructions from a pt) on post-surgery exercises.  You can download the booklet by going to this link:  http://www.mskcc.org/patient_education/_assets/downloads-english/21.pdf.  If that doesn't work, go the Memorial Sloan-Kettering Cancer Care website (http://www.mskcc.org/), select Breast Cancer (roughly middle of page), then select Patient Education. T. \"Nothing in life is to be feared. It is only to be understood.\" Marie Curie Dx 3/18/2010, IDC, 6cm+, Stage IIIA, Grade 2, 5/14 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752021",
      "Title": "Exercises after surgery Irishtess Irishtess"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Irishtess wrote: I found a hard, non-moveable mass in my left breast 3 weeks ago (knew immediately this would not turn out well), and the biopsy just confirmed invasive ductal cancer (cancer cells in the lymph nodes as well).  I've been following the discussions here, and am \"gobsmacked\" ~ as my Irish girlfriend, Evelyn, would say ~ by your support, care and concern.  Although I'd rather not be in this club (no offense!), I hope that I can emulate all of you as I move forward on this path. I'm facing the dilemma so many of you have had on whether to remove the other breast.  Last year, I had thyroid cancer.  We knew pre-surgery that the left side had a cancer nodule; turned out the right side did as well (not apparent on the ultrasound).  Surgery is set for April 14, so I have some time to consider this, and make arrangements for my law practice (I'm a solo).  Fortunately, I have very supportive colleagues, and my family is terrific! Two weeks ago, I found this quote by Marie Curie, and I think of it everyday:  \"Nothing in life is to be feared.  It is only to be understood.\"  Thanks again, girlfriends! T. \"Nothing in life is to be feared. It is only to be understood.\" Marie Curie Dx 3/18/2010, IDC, 6cm+, Stage IIIA, Grade 2, 5/14 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/750177",
      "Title": "Thanks to all the women who share Irishtess dlb823"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Mar 23, 2010 11:44PM Irishtess wrote: Ladies:  I was just diagnosed with IDC (both invasive and in situ) in the left breast (also cancer cells in the lymph nodes).  MRI has not detected any problem in the right breast, but I'm really agonizing over whether to have it removed as well (surgery date is April 14).  Adding to this dilemma is the fact that I had my thyroid removed last year (cancer nodules on both sides, but only the left showed up in the ultrasound and the biopsy).  Any thoughts would be greatly appreciated! T.",
      "MessageIndex": 20,
      "PostDate": "23/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/750039",
      "Title": "Should I take off the second breast? Glendora LVLinda"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Mar 31, 2010 01:03PM Irishtess wrote: Jenni:  My u/s indicated a 5 cm x 1.8 cm mass (L breast).  My surgeon (Memorial Sloan-Kettering) ordered new u/s, biopsies, & MRI.  Those reports contain the info in my profile.  As a precaution (I had thyroid cancer last year & biopsies show IDC and IDCS in breast, with cancer cells in lymph), my doc ordered a PET scan.  Just got that report, which found \"focally increased activity in the left transverse process of C4 with a SUV max of 5.4, correlating to mildly sclerotic changes.  Metastatic involvement is possible.\"  So, I'm going for another MRI.  Doc wants as much info pre-surgery as possible, which is ok with me - the more I know, the better!",
      "MessageIndex": 52,
      "PostDate": "31/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Apr 30, 2010 08:03AM Irishtess wrote: Dustysmom:  Sorry I missed you in my last post.  Good luck on Monday!",
      "MessageIndex": 298,
      "PostDate": "30/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 14, 2010 07:21AM Irishtess wrote: Thanks, Tory!  Intellectually, I know that all of these treatments are life-saving ~ it's the sometimes (but thankfully not too often) emotional junk that gets in the way! Welcome to jdoubow & hope!  I know you ladies will receive the same support and care I've found here.  Hope:  I had thyroid cancer last year (surgery June 15) with total thyroidectomy.  Because the cancer nodules were < 2cm, I didn't need radioactive iodine treatment, just replacement hormone.  I thought ~ well, \"hoped\" is a better word! ~ that the thyroid cancer would be the only type I'd need to deal with, so finding the mass in my L breast in late in Feb was a real kick in the teeth (no family hx).  However, I'm going to do everything I can to conquer this and get on with my life! Thanks again to all the ladies for being here!",
      "MessageIndex": 384,
      "PostDate": "14/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 23, 2010 04:31PM Irishtess wrote: Sasshland:  Sorry about the confusion with your report, but at least the onc is referring it to someone else for review.  Good luck! Hanta:  I agree with Cafe: Although it's easy to want to twitch my nose like Samantha on Bewitched & be past all of this, I keep reminding myself not to wish any days away ~ life is too short. Cafe: I have those poofs too ~ my surgeon's nurse says they're called \"dog ears\" & most go away with time & exercise.  Some women, she said, have the PS take care of them.  She explained that the breast pulls that fatty area forward so you don't really notice it, but once the breast is gone, there's nothing to pull it down! Had my 1st treatment (AC) on the 21st - not near as bad as I was expecting, so thanks to all for your good wishes and tips!  Hope you all have good weeks coming up.",
      "MessageIndex": 407,
      "PostDate": "23/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jun 9, 2010 10:35AM Irishtess wrote: Jenni:  I agree about Paxton and the other moms of little ones ~ can't even begin to imagine how hard that is!  Glad you're doing ok so far.  I should be working, but, as you can see, I'm not!  I'd better go, though, so I can keep myself in the shaved-head style to which I've become accustomed!",
      "MessageIndex": 461,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jun 30, 2010 07:17AM Irishtess wrote: Hi Girls!  Just saw the most recent posts here & wanted to tell ChoirLove about Zofran.  My onc gave me Compazine for nausea (also got Ativan).  Compazine did nothing for me, but my sister, who's an RN, suggested Zofran & it really helped.  I take the Ativan at night before bed so I'm able to get a good night's sleep.  Hope:  So glad to hear about your good outcome. Cafe: I was hoping that rads would be a cakewalk compared with chemo ~ is it just the fatigue, or do you have other SEs? I have my 4th AC tx on Friday, then start the Taxol.  SEs after the 3rd AC were worse than the first 2 ~ I guess because of the cumulative effect of all that s***!  As Jenweg says, though, we will get through this!  Happy Hump Day everyone!",
      "MessageIndex": 487,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Aug 30, 2010 01:31PM Irishtess wrote: Hi Ladies!  Yep, I finished chemo on Friday!  Went shopping on Sat with my sisters.  Later, Mom, sibs & spouses went to dinner & then back to my sister Margi's house.  Mom entertained us with a wild story about the night before my sister, Judy, was born (her birthday was Sun so we were celebrating that as well).  Oddly, I didn't ~ & still don't ~ feel as excited as I had expected about finishing.  Anyone else have that reaction?  I'll probably be a lot happier in 2 weeks when I don't have to drive to NYC for an appearance at the chemo lounge! Day:  So sorry you're having such a hard time, esp with the cording & the lymphedema.  Your ability to put that all aside to help a fellow artist is inspiring. Drim:  Wow, it's hard to believe you're so far into the rads regimen!  Hope you don't overdo it at work. Kim:  I triple dog dare you!  Thanks for the website info ~ I'm going to check it out! Leanna:  Kim is right ~ hang in there!  AC is really tough, but you're almost done.  Pretty respectable showing at the bowling alley ~ sounds like a lot of fun! njbhwgirl:  Thanks ~ I did enjoy my wkend!  Speaking of which, what dates do you have in my mind for our visit?  Please let us know what we can bring. Packjen:  Sorry to hear about the ongoing SEs ~ hope you get some answers.  Happy Anniversary! Patricia:  Glad you had some time with your sister, but sorry to hear about the numbness starting up.  It's no fun!  I think you're right about the transfusion making you feel better.  I will pray that you are in tip-top shape for your Paris trip. Paxton:  Your pain and frustration are palpable.  I hope you get good news today. Sacphoto:  Isn't it great when you hear about survivors, & doubly great when they and their family reach out to you?  Happy Anniversary! Summer:  We didn't make the biscotti martinis this time, but decided we'll try them next time we're together.  I forget ~ when do you start rads?  I see the rad oncologist this Fri & hope to get started soon. x-ray: Your family sounds awesome ~ love the T shirts!  What a wonderful suggestion about reaching out to new members here.  It's so easy to forget how scared & isolated we all felt.  I'm so looking forward to meeting you and some of the other ladies from our group! usmcwife:  Welcome, Stacey!  I had a bmx in April.  Sloan-Kettering docs also want a 6-month post-rads waiting period before seeing the PS for recon.  I developed neuropathy in my hands & feet from the Taxol, so I know what you're going through.  Ditto on the runny nose! Everyone else:  Hope you're ok & continuing to improve.  Here's to a good week for all!",
      "MessageIndex": 1405,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 18, 2010 07:45AM Irishtess wrote: Denise:  Totally get the steroid high!  Congrats for finally getting finished with chemo!  I understand if you aren't as excited/happy as you/others think you should be ~ I had the same experience when I finished on 08/27!  Re \"Brandy\":  I think you should take the pic even if you feel tired ~ let's see what she looks like! Magda:  Thanks for the insight into the serum markers.  I sort of know this, & I suspect that an 8-point difference is not significant (statistically).  Nevertheless, I really expected the number to go down, not up, so most ~ if not all ~ my reaction was an emotional one.  I'm thinking also that the radiation will kill the last remaining breast cancer cells, so the scan on 11/19 will reflect that outcome. Everyone else:  Have a good weekend!",
      "MessageIndex": 1586,
      "PostDate": "18/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Oct 6, 2010 11:04AM Irishtess wrote: Hi Ladies!  My am rads got moved to late this afternoon, so I had a chance to catch up.  Today is 15 out of 30!  I have some skin irritation (looks splotchy in a few places) so will talk with the rad onc tomorrow. Barb:  Wow ~ finishing rads on Friday!  Hope you're able to celebrate reaching that milestone.  It sounds as if you really enjoyed Pink Power, & it's great that you feel so comfortable with your docs.  Will you be on a drug therapy?  BTW:  You can come in my suitcase!  (Loved that story!). Drim:  Always happy to hear from you.  Let me know how the organic coloring went.  Although I'm still bald, I do expect to have hair some day, & I don't know if whatever color ~ or lack thereof ~ comes back will suit me! LauraM:  Thanks so much for sharing your friend's approach to bc.  Until I read that, I thought \"survivor\" was one of the most beautiful words in this journey.  Now, I'm re-thinking that.  Today will be your 12th rad ~ how many total? Glad you're not having skin issues.  I'm also driving 70 miles round trip on the days I work from home, & my rads also are in the am.  Theresa has a 2-hour round trip, so she also has a lot of time invested just in getting to tx. Leanna:  It seemed as if your surgery date would never arrive, & yet, here it is, just a few weeks away!  I understand your good news/bad news dilemma about your mom!  My mother, also hard of hearing & loud volume control freak, is a drama queen & \"Debby Downer\" as my sister Margi calls her.  A good example:  To get her passport info, the husband told her I was planning a spring trip.  Two weeks after telling her about the Nov trip, she called my sister-in-law Maureen (almost 6 yrs out from her bc experience & doing great!) & said, \"I think there's something wrong with T.\"  Why?  Because I changed the trip to this year, like I wouldn't make it til spring!!.  Gee, thanks Mom!  She also called my sister Judy after the Michael Douglas cancer story to ask if I'm stage IV.  No, I tell her, I'm Stage III, & no, there's nothing wrong well, other than the obvious!); the spring trip was a ruse to get your passport info.  I also told her that if she says 1 negative thing on this trip, it'll be her last!  Maybe she got the message!  Have a great time with your GF this weekend. Magda:  Shrinking tumor is great news ~ you must be so relieved!  I understand how easy it is to be upset and angry with yourself for not overcoming the fatigue, not being able to do what you used to, not having the energy, etc.  I struggled with this throughout surgery & treatment.  The acceptance came just a few weeks ago, & while I still have those moments, they are not as hard to shake as earlier.  Hope the blood results were good. njbhwgirl:  What a difference a year can make!  It may seem as if you've consumed all your strength battling bc, but I know you've got more in reserve & will be able to handle your mom's health issues.  Do you have access to visiting nurses or area agency on aging to assist with her daily care?  Also, could your son stay at your mom's house while she's with you?  Just a thought. Packjen: Your new photo is beautiful!  I'm sure it's been rough being a parent 24/7 for so long, but you're a strong woman & can handle anything (even if you get tired in the process!).  I think you're on to something, with cancer being the \"and then\" disease.  Your question also is very provocative (in the traditional sense of the word).  When I had my thyroid cancer surgery last year, I immediately knew it was in the past tense: removal of gland, replacement hormone.  Done.  This time is different.  I certainly don't feel that I \"had\" breast cancer.  Maybe once rads are done & the PET scan my med onc ordered (11/19) shows no evidence of suspicious metabolic activity, I'll ditch the present tense \"have.\"  How about you?  How do you define it? Patricia:  Hope it's not too late to say Bon Voyage!  Eat, drink, enjoy Paree and, as my Irish friends say, \"safe journey.\"  Also, congrats on finishing chemo & on the nouveau bebes!  My last chemo felt anti-climactic, so I can relate to your experience last week.  What a gift from your onc when he corrected you!  Paxton: Thanks for defining cancer that way ~ \"the\" not \"my.\"  It's a really good approach.  This is my 1st ~ & I hope & pray only ~ bc experience.  However, it's the 2nd time I've had had to deal with cancer ~ thyroid cancer dx'd in 2008 & surgery in 2009 ~ so I can appreciate how difficult this year has been for you, esp with Gage to worry about.  Hope it gets a little easier each day. Sacphotomom/Denise:  I started to phone you, but worried I'd wake you up.  If you feel up to talking, PM me about a good time.  How did the initial rads meeting go?  How many do you need?  When do you start? Summer/Theresa:  Hope rads are going ok. wellsey66:  Your info on the bull riding was really interesting.  I didn't read your post until too late to catch the CBS show, but I bet you were cheering your hero on!  When do you finish rads?  x-ray/Daiva:  I know you're enjoying your Vegas trip, and the Canyon Ranch Spa is really wonderful!  Postponing your Italy trip to next year so you're not rushed was a good decision ~ you want to make the most of it.  Re sleeping pills:  I take an Ativan each night.  Tried not taking them & didn't sleep.  Here's the thyroid cancer story:  Sept 08 lung CT scan picked up a nodule on my thyroid.  Got ultrasound (not good) then biopsy which suggested papillary carcinoma.  Picked Sloan for treatment & had surgery on 06/15/09.  Pre surgery, we knew there were nodules on the L side, but Dr. Shaha found nodules on the R also, so he took the whole gland.  Sloan's protocol is no radioactive iodine tx if the nodules are less than 2 cm, which mine were.  So, surgery & Synthroid were all I needed.  I really thought that it would be my only cancer issue ~ silly girl!  When I first met with my Sloan breast surgeon on 03/16, I asked her about a link between the cancers.  She said there is no research confirming a causal connection, but 10% of women who get one type, get the other.  However, thyroid cancer is 3x more prevalent in women than men, so it's probably hormone-fueled.  That should have tipped me off! Everyone: You are amazing women, & I count all of you as blessings in my life.",
      "MessageIndex": 1690,
      "PostDate": "06/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 20, 2010 12:50PM Irishtess wrote: Good morning all you brave ladies!  I just finished reading the recent posts & want to thank everyone for sharing your experiences.  I'm still a chemo virgin ~ my 1st treatment is tomorrow!  Although I'm anxious about it, I've drawn great comfort ~ and really good tips ~ from all of you.  Countryfrau:  I really enjoyed your post about your \"first time\" ! Mommy:  Welcome ~ the ladies here are wonderful.  Nana & packjen:  So sorry about the hospital trips ~ hope that's the one & only time you'll be there. On the hair side:  I decided to shave my head while I was still feeling healthy, so did it last night.  Two girlfriends joined me & we took pictures & drank champagne!  When I figure out how to upload photos here, I'll show you. Hope all of you have a restful weekend.",
      "MessageIndex": 367,
      "PostDate": "20/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jun 9, 2010 05:46PM Irishtess wrote: Redbarb & LauraM:  Way to go on the fundraising!   Giving back while going through this is even more impressive!   Barb:  I grew up in Scranton & moved to Carlisle in 1983 - been here ever since, although I still think of Scranton as home! Hope everyone continues to have a good week.",
      "MessageIndex": 631,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jun 30, 2010 07:35AM Irishtess wrote: Hello to all you brave and gorgeous women!  I've been away for 2 weeks ~ nothing glamorous, just work and a rough time after my 3rd treatment (AC).  After the first 2, I started feeling better by Day 6.  Not so this time!  (Wicked headaches, gastro issues, overwhelming fatigue).  So I've been in a real funk (yeah ~ I'm dating myself big time by using that word!).  njbhwgirl:  I know exactly how you feel ~ no boobs, no hair, feeling sick a lot of the time.  It's no wonder the tears come. Around Day 17 or 18, the tiny head hairs left after the buzz cut started falling out, so the husband shaved my head.  At first, it felt great (smooth) ~ now, my head feels like 800 grit sandpaper!  I decided against a wig (I've always been a hat person), so I've been using scarves for work, caps for walks (trust me, that's not been an everyday thing, although it should be!) and nothing when I can! I just caught up on the last 2 weeks of posts.  My heart goes out to everyone who's had scary reactions, hospital trips, and just plain \"enough is enough\" of this.  Thanks to bbd & maltomlin for the encouragement, & welcome to Lisa and Kristin.  Congrats to Sunflower for finishing chemo, and to everyone else who's moving on to the next tx phase.  My last encounter with the \"red devil\" is this Friday!  Then on to 4 bi-wkly treatments of Taxol (Summer:  I think we're on the same schedule), then radiation (4 wks).  Fotopet: I have the same eye tearing and nose running ~ it's constant.  LauraM:  I see that you're being treated at Sloan - so am I.  Who are your docs?  Sacphotomom:  I still have a lot of post-mast (bi-lat) pain.  Over the last several weeks, it's felt like I have a boa constrictor around my chest! patricia48:  Did you get your thyroid scan results back?  Hope it's nothing.  Pre-surgery, something suspicious at the C-4 level turned up on one of my scans.  An MRI confirmed it as a hematoma - a bundle of blood vessels.  Maybe that's what going on. Nana, Day, Drim, Paxton, Jenny B, cleob, Leanna, Kim, packjen, Golfergirl, MNLLinda, LibraryJenn, & everyone else in our not-so-little group:  Thanks for sharing your experiences.  There really are angels on earth who help make this awful journey a little easier.",
      "MessageIndex": 840,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 13, 2010 03:23PM Irishtess wrote: Ladies:  Thanks for the welcome!  I really relied on the posts from the April 2010 mastectomy group to get me through Round 1, so I'm glad to be here!  Thanks, also, for the great tips. fotopet: I'm also an attorney, but appear only in front of judges and masters (my practice is limited to divorce, custody & support).  I thought long & hard about needing a wig for those appearances, but decided to stick with scarves.  It'll be an interesting summer!",
      "MessageIndex": 234,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 23, 2010 05:18PM Irishtess wrote: cleob: I started my chemo (ACT) on the same day as you ~ sorry you're here, but welcome!  Welcome also to cfb1957:  The gals here are great & very supportive.  I have no family hx of bc, but opted for a BMX (04/14) even though the R breast was clean. Path report confirmed the IDC & the DCIS, which we expected, but also located LCIS in the L breast so I'm glad I made that choice! JennyB & Summer: Thanks for good wishes.  The pre-treatment anxiety was worse than the treatment itself.  I had a great onc nurse, no problems with the IV (no port), and few SEs: queasy stomach, headache, heartburn, foggy-head the morning after the Ativan (although I did sleep from 10 til 6 ~ YAY!), some flushing after the afternoon Neulasta shot on Sat (still there today so I called the on-call doc who said it's no big deal).  I'm more tired today than yesterday, but I'm sure it's the lack of sleep.  All in all ~ not bad!  One down, 7 to go!  Hope you all have good weeks coming up, & for those starting, take a deep breath & relax!",
      "MessageIndex": 407,
      "PostDate": "23/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jul 9, 2010 10:53AM Irishtess wrote: Wow - so much to catch up on in such a short time. Hope I don't miss anyone! Foto:  Love the pic, & your Poconos story.  I grew up in Scranton & my parents often took us to the Poconos to the Animal Farm or just for a ride in the car.  Brings back a lot of great memories! njbwhgirl & summer:  Dr. Heerdt is my surgeon and Dr. Dang is my onc (love them both!).  I opted to have my chemo at the Breast Center, but will need to coordinate rads closer to home.  I get a copy of my blood work each time I see Dr. Dang.  You also can get some test results directly from the MSKCC patient portal.  If you need info on it, send me a PM.  I don't have a ps yet because I delayed recon.  Would love to meet up with you sometime.  Drim also is in NY and I'm sure would join us.  I see you both are starting Taxol  ~ hope you do well.  I start it on the 16th, so let me know how you do. sacphotomom:  I was so sorry to read about your Dad.  Hope you've had good news this week.  I agree with Leanna about talking directly with his nurse and/or doc.  Also ~- that drink looked really cool and satisfying! Patricia48:  What an ordeal with the transfusion ~ as if the regular crap isn't enough!  LibraryJenn:  You sound really psyched about the port - sorry you needed an ER visit. JennyB and Drim:  Congrats on reaching the end ~ I'm really envious!  Drim:  The Puerto Rico trip sounds like just the antidote to all of this! Redbarb, Golfergirl, snipinfool & Nana:  I agree ~ Tx 3 was way worse than than the others, including # 4 (which I just had on July 2).  Barb & Merry:  Hope you have a good outcome with your 4th.  GG: Congrats on the last tx!  Nana:  Lovely story ~ thanks for sharing. Leanna:  Complain all you want here ~ it's not like you don't have reason to do so!  We all do!  Ditto on the other comments about chemo pellets!  Also, great news on the job front.  Day:  Glad your teas give you some relief.  I've been a tea drinker since I was a child (strong black tea with milk), but haven't been able to drink it since the chemo started ~ it tastes awful.  That's one thing I really miss. x-ray girl & wellsey66:  Hello & welcome!  As you can see, we've got a great bunch of women here.  Wellsey:  After my dx, I started buying organic & steroid-free milk, eggs, chicken and veggies, etc.  I realize that I can't control everything I eat, but I think it makes sense to limit additional exposure.  Daiva:  I see you're in Frederick, MD.  Nice town & not far from me ~ I live in Carlisle, PA. cleob:  Thanks, but I think we all inspire each other.  Going through this takes enormous emotional reserves & it's hard to be positive and optimistic when you feel like crying and taking to your bed ~ or when well-intentioned people tell you how good you look when you feel like crap and you know your appearance is just smoke & mirrors!  When I went for my treatment on July 2, I bought a tankini at the Breast Center boutique (got the swim foobs for it, also!).  I used it on the 4th ~ actually got into the lake.  Nearly killed myself trying to get out of the lake!  Never had a problem climbing up the ladder on the dock before ~ but this time, I forgot about the bi-lat surgery & stretched something ~ badly ~ when I reached out with my left arm (the lymph node side) to pull myself up .  It still hurts!  However, I did look fantastic, & not having to remove a whole suit to pee was a big bonus! I love you all ~ have a great weekend!",
      "MessageIndex": 932,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Aug 3, 2010 02:50PM Irishtess wrote: Hi Girlfriends!  I've been busy at work ~ still part-time, but I need to have a practice to come back to, so when I feel good, I really push myself.  I suppose that's not such a good thing ~ I actually broke down & cried at the end of a very difficult custody conference (not in front of anyone, just by myself).  Anyway, I spent the better part of today catching up with everyone, which I would much rather do! Nana:  How terribly scary for you ~ I hope everything resolves quickly and successfully.  Paxton:  Sorry to hear about your hx.  I can't imagine having to go through this a second time.  Your little boy is adorable, though.  Thanks for posting his picture!  Hope you enjoyed your visit with your dad; glad you spoke w/ your onc about Avastin. Barb:  Glad you enjoyed your vacation, but sorry to hear about the upcoming test.  Here's hoping for clear margins, & YAY on finishing tx.  Cleob: Thanks for your wise & comforting words.  Day:  Thanks for all the info & the links, esp. the one on the immune system.  Congrats on your last tx!  DancerMel:  Thanks for the article ~ I really appreciate it.  Packjen:  Great news about Casting for Recovery!  Can't help w/ the hot flashes, but I totally get the ups & downs.  Banana splits for dinner certainly sounds like an up!  Kim:  I loved your post about bare ass dancing on the deck!  I also took to heart your comment about reminding yourself to LIVE life.  Congrats on the last chemo! GolferGirl: I think you started rads yesterday, & JennyB:  I see you also are starting rads. Hope it went ok for both of you.  GG:  Glad to hear you'll be here through rads, drugs, etc.  Drim:  YAY on getting the insurance issue resolved.  Please keep us posted on how you're doing. LibraryJenn:  I understand your angst about the stage & grade.  I worry about those issues, too.  It was good to hear about all the cooking and other good things you're doing.  Congrats on finishing the AC.  Sacphotomom:  Love that quote!  I agree with your Irish husband about potatoes ~ nothing better!  (Although my Italian side loves pasta too!).  Sorry to hear about the pain you've had & the emotional crap ~ I know what you're going through.  I'll be here for quite awhile ~ chemo til end of Aug & then rads starting the 3rd wk in Sept., so don't worry about when your treatments ends.  We'll still be here! Patricia:  WOW ~ your Jan. trip sounds awesome!  I love reading your posts, & really admire your commitment to getting & staying healthy.  I also loved your comment that \"[w]e are all more than these damn treatments.\"  Beautiful!  LauraM:  I hear you about the really bad joint/bone pain after your 2nd Taxol tx.  I had some after the 1st, but I just had my 2nd on 07/29 & it's def. worse this time.  Leanna:  Congrats on ending the Taxol.  Here's my 2 cents on AC.  My biggest complaints were fatigue & the GI/mouth stuff.  Nothing tasted right, & nothing got processed right (constipation, diarrhea, etc).  Days 1 & 2 were ok ~ steroid high!  Days 3 & 4 were the worst for me. Daiva:  Hope you get in to the Casting for Recovery & that you had a great time in San Diego.  I love that town!  Also, thanks for asking about the neuropathy.  My onc prescribed Neurontin, which helped a great deal.  I still have tenderness in the fingertips & a little loss of dexterity, plus, after Taxol # 2, my feet hurt.  However, it could be worse.  I'm sorry to hear about the UTI ~ hope it's resolved soon. njbhwgirl:  How awful that you had to go to the hospital.  How are you doing now?  I bet that granddaughter gives you lots of pleasure, & distraction from all this nonsense.  Re the Casting for Recovery:  There's no way I would share a room with anyone now, esp. a stranger, so I understand your reluctance.  On a positive note, if you're still serious about the get-together, count me in! Summer:  Sounds like we're on the same schedule, & I don't mean just the Taxol infusions.  (My 2nd was on 07/29 (onc moved it up a day because she wasn't going to be there on Friday, the 30th.  My 3rd is on Friday the 13th ~ isn't that ominous?! ~ & the 4th and last is on Friday the 27th).  On Friday, the 23rd, my ankles swelled up twice their size.  I figured it was the strappy, sexy, gold shoes I wore to a wedding that night!  Not so ~ by the time I saw the onc the following week, they were like elephant feet!  She said it was a Taxol SE & gave me a script for Furosemide (generic of Lasix), a diuretic. BTW Daiva, Pat48 & Summer:  I totally get the snappiness & impatience, esp. with the significant other.  The last few weeks, my husband just grates on my last nerve!  I know ~ it's not him ~ it's me! On the issue of mortality and \"hurt feelings\" as Patricia described it:  My Italian grandmother lived to age 97, & my Irish grandmother was 88 when she died (many of her sisters also lived into their upper 80s).  So, I always envisioned a long, relatively healthy life.  Since getting the BC diagnosis ~ & mine was really advanced by the time I found the mass ~ I've thought a lot about how much time I have.  Will I be an old lady when I finally go, or will this do me in long before I expected?  Seeing and hearing about survivors ~ some who are out 20+ years ~ is comforting, but there's still that \"thing\" lurking in the shadows, & it's very scary at times.  I've not shared these feelings with anyone ~ not husband, family, or friends ~ because I don't want to upset them, so I'm grateful, Daiva, that you had the courage to bring up the topic, & I thank everyone who has weighed in on the subject. Summer suggested a rule that we all keep coming here, & many of you seconded it!  I wholeheartedly agree.  I really would miss you guys!  Have a good rest of the week.",
      "MessageIndex": 1195,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Aug 24, 2010 08:27AM Irishtess wrote: Summer:  Thanks for the recipe ~ my sisters were talking about opening some bottles of champagne this wkend to celebrate my last chemo tx on Fri, but I think the martini's will be sooo much yummier!  Sacphotomom:  Your get-away sounded so relaxing!  The husband & I took a trip to CA some years ago ~ drove up the coast (Highway 1?) from LA to points north (San Fran, Nappa, Carmel, etc).  It was one of the best trips we've ever taken.  Beach gazing does wonders for your soul, doesn't it? StacyA:  I'll finish my 4 courses of Taxol on Fri.  Good news:  I didn't have the naseau & weird mouth stuff where everything tasted like cardboard (from the AC).  Bad news:  I developed neuropathy ~ for which my onc prescribed Neurontin ~ & have had some really bad bone & joint pain (Advil works sometimes; other times I've taken the Vicodin I had left after my bmx).  It also is a much longer infusion ~ 3 1/2 to 4 hrs.  However, the Benadryl made me sleep through most of it!  Some gals also have had nail issues ~ I've kept mine polished throughout, so they are still in good shape. Paxton:  I'm so sorry you're still having such a hard time. Sacphotomom is right ~ bitch here all you want!  Please let us know as soon as you get your results ~ we're all pulling & praying for you. Daiva:  When my sister's next-door neighbor, Joanie, went through this 4 years ago (she's doing great today!), she hooked with a nutritionist who really pushed the alkaline stuff.  I looked at some of Joanie's paperwork when I started chemo & it was a little too fringe for me.  The theory in those papers is that cancer, & most if not all other disease, is caused by an imbalance in your sytem ~ alkaline vs. acidic.  However, you might want to check out this link I found this morning from the Mayo Clinic:  http://www.mayoclinic.com/health/alkaline-water/AN01800. Hope everyone has a good day!",
      "MessageIndex": 1362,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 25, 2010 01:26PM Irishtess wrote: Barb:  Great to hear that you're getting so close to finishing!  Sorry to hear about the weight gain,  I think I'm holding steady, but others may have different experiences.  Hi Leanna, Magda & Jenn (great post about your trip to the city of bridges!). Question for everyone going through or having completed rads:  Any throat issues?  The last 2 days, I've felt a constriction in my throat, & trouble swallowing, especially pills.  Can hardly get one pill down (used to be able to take a bunch all at one time).  I don't see the rad onc til Thursday next week, so thanks for any info/insight.",
      "MessageIndex": 1630,
      "PostDate": "25/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 14, 2010 02:57PM Irishtess wrote: Leanna:  I'm a solo ~ so friends & colleagues are covering cases for me.  The judges in my main county (where my office is located) all know what's up, & they're all great (no one is pushing me to do anything right now!).  One male colleague told me (this was the night before my BMX) that he hoped I'd do reconstruction because I just wouldn't be me without the big tits!  Apparently, he shared that sentiment with some colleagues (typical Jack!).  Until earlier this year, we had only 1 female judge, and she emailed me pre-surgery about someone locally who does nipple tattoos!  All things considered, I'm really fortunate, & glad we can laugh about these issues! Stay well, everyone!",
      "MessageIndex": 261,
      "PostDate": "14/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 24, 2010 11:54AM Irishtess wrote: Fotopet: So sorry to hear about your experience.  Know that we'er all sending good thoughts your way.",
      "MessageIndex": 415,
      "PostDate": "24/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jun 1, 2010 12:36PM Irishtess wrote: Hello all you lovely May ladies!  I just finished reading the last few days' of posts & I'm awed by how much good there is in the world, despite the problems some - Day, I really hope things improve with your medical team - are having.  Summer & Packjen:  Loved the co-worker stories! I also love your chemo celebrations, Jen!  Redbarb:  I have my 2nd treatment on Friday, so I'll be thinking of you. With apologies to all you youngsters:  Before my 1st treatment, I took my script for the foobs to the breast center's boutique.  The fitter said she'd select \"age-appropriate protheses.\"  \"What do you mean, age-appropriate?\" I ask.  \"You see how there's some give to these?\"  I nod.  \"Well\", says she, \"they'd be harder & firmer for a 30 year old.\"  I just wanted to smack her!!",
      "MessageIndex": 535,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jun 10, 2010 09:02AM Irishtess wrote: JennyB:  I'm so sorry to hear about your father-in-law.  Your cancer diagnosis was a big enough stressor for everyone, and this is just adding more to the mix.  I agree with Barb about how resilient kids ~ and adult kids ~ are, so try to take things one day at a time. Leanna:  I'm Irish on my Dad's side, and spend a good bit of time in Ireland ~ well, not this year yet ~ those plans got de-railed!  The husband & I hope to get there in Nov, after I'm done with rad, & I'm already planning a girls trip (Mom, sisters, nieces) next year to celebrate getting past this. For all you ladies with \"period\" issues ~ I agree with Nana - I can't imagine going through this process with those issues.  You ladies are awesome!   Snipin:  Ditto on the photos ~ I'm really glad to be able to see everyone.  Daisy:  You'll be fine - this is so intimidating & scary, but you'll get through it. Hugs to everyone!",
      "MessageIndex": 652,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jul 14, 2010 08:26AM Irishtess wrote: Happy Wednesday, Girls!  Thanks, Leanna, for the Taxol info.  I was so hoping that the mouth & stomach issues would not be a part of that, but I guess not! Jen:  Awesome pictures!  What a great way to end tx (hope your L arm continues to behave!). Drim:  Congrats on finishing!  How soon do you start rad? Daiva:  Love martinis ~ haven't had one since all of this started, but I have had some wine.  Problem is nothing really tastes right.  Good luck with the Baltimore trip, or should I say break a leg?! Barb:  Good luck tomorrow. Have a good rest of the week to all ~ I'll be thinking of you when I start my Taxol tx on Fri.  Onc says it takes 3 1/2 to 4 hours ~ what a way to spend a Fri afternoon!  Oh well, maybe I can catch a nap!",
      "MessageIndex": 986,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Aug 31, 2010 09:23AM Irishtess wrote: Paxton:  WOW ~ that's such great news!  We all are so happy for you. GG:  Glad to hear from you.  Sounds as if the BF is happy about the job, but I can imagine that you are worrying already about commuting in the winter.  Good luck on the \"where to live\" issue, & congrats on getting through so many rads with so little SEs. wellsley:  Sorry to hear about the SEs ~ how many more tx do you have? Magda:  Welcome!  Sorry you have to be here, but you've definitely come to the right place.  These ladies are wonderful!  Hope the positive outlook outweighs the SEs.  I just finished my last T (x 4; had AC x 4 before that) ~ still dealing with neuropathy & bone/joint pain, but at least I'm done with chemo.  Now, on to rads! Sac: Feel better soon. Leanna:  Just checked out your link ~ good luck with the fundraising!  What date is your surgery? Gotta run ~ have a good day, girls!",
      "MessageIndex": 1415,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Aug 31, 2010 03:15PM Irishtess wrote: Jean:  I'm hoping for a good outcome from your last scan.  I understand completely about the tears, the uncertainty, etc. Bet your visit with your son will help put that all aside.  Denise & Patricia:  Thanks!  I got so tired of the bald and scarf pics.  This one always made me feel good ~ an ice cream cone and my dog looking out the window!  wellsley:  Meeting your fave will be quite the thrill.  Hope you can get his autograph! I just got the results from the blood sample they drew before the last chemo.  Seems my ALP (part of the liver panel) is way high (onc wants to repeat the testing before I start rads).  Researching it today just gave me the shivers, so I'm going to do a Scarlett O'Hara and think about it tomorrow! ",
      "MessageIndex": 1422,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 1, 2010 08:34AM Irishtess wrote: Daiva:  I'll be thinking of  you tomorrow as you finish.  Hope the after-effects are minimal & YAY for the last Neulasta shot (I had mine on Sat).  A tropical get-away with your husband sounds like just the thing to re-energize.  Hope you can do it!",
      "MessageIndex": 1433,
      "PostDate": "01/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 7, 2010 02:26PM Irishtess wrote: Good Morning Girlfriends!  I saw the rads onc on 09/03 & he's recommended 6 ½ weeks of rads.  I'll give him credit for at least considering the 4 weeks my BS and med onc seemed to think would work, but he felt that I would not get the benefit from a shorter regimen.  So, says I, I MUST be done by the end of October (Ireland trip).  Can't you change your travel plans, he asks?  No, I tell him, I can't (non-refundable tickets are purchased & I'm not waiting until after Thanksgiving).  Well, he says, your chest is going to be sore.  What else is new?  It's been sore ever since my surgery! He then went through all the risks ~ heart damage, lung scarring, increased risk of lymphedema to the node arm, rad burns.  Great ~ more good news! Day: That baby fairy is adorable ~ you're really talented! Leanna:  Can't help with your Qs ~ I decided to delay recon.  Hope you get it worked out. LibraryJenn:  Congrats on the shrinking tumor! Magda:  I'm so glad you found us ~ love hearing from you.  I think many of us needed to plan post-treatment trips.  I see it as not only putting all of this behind me but also as an affirmation that there is life after BC dx and tx. Packjen:  Love the new pic!  It's so nice to see some concrete evidence that all those toxins are packing up their suitcases and leaving! (Can you tell how travel-focused I am?!!)   How are the rads going?  I had seen the info on ACS reimbursement for mileage earlier into my dx, but forgot about it, so thanks for the reminder.  Did you ever resolve that cough issue?  I've had a cough for the last 2 months, & I'm sure it's a SE. Patricia:  Great news about no transfusion!  Thanks for your positive energy and thoughts, & for reminding us to eat healthy and move! Sacphotomom:  I understand your frustration with the insurance company.  It's so hard to deal with the physical & emotional junk & then have all that crap, too. Summer:  Hope the little ones settle in to the new school year quickly.  When do you start rads?  On the dizzy spells:  My blood pressure sometimes is really low.  It can make me lightheaded if I stand up too fast, for example.  Maybe your pressure is low?  I haven't noticed a difference with the chemo per se, but the Taxol definitely gave me more severe headaches than I ever had on AC. wellsey66:  You're right about that thread ~ I look at it often, especially when I really need a chuckle! I'd rather stay and visit, but I really need to get to work!  Hugs to all my sisters here!",
      "MessageIndex": 1476,
      "PostDate": "07/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 22, 2010 09:46PM Irishtess wrote: Hi Girls!  Thanks to everyone who helped me get through the weekend & over my angst about the CA15-3 results.  I really had my panties in a knot over it, but I've decided I can't worry about it.  It is what it is. Day:  You have so much hair already!  I was surprised by the salt & pepper look, but I guess you're going back to blonde?! GolferGirl/Beth:  I'm a little late with this, but congratulations on finishing rads!  How are you feeling?  Do you have any drug therapy starting up? LauraM: You started rads yesterday?  Hope it's going ok.  How many will you have? Latte:  I had my surgery first.  Opted for bi-lat because I wanted to increase the odds of beating this & just couldn't imagine having to go through it again.  Some risks of radiation include lung scarring, heart issues (my bad breast was on the L side), rad burns & lymphedema (had node involvement so that's being radiated, too).  So, I'd be really concerned about radiating the good one.  Just my 2 cents! Leanna: I'm with you on the nails ~ see my comments to Magda ~ & the neuropathy.  What a pain!  On the bright side, I agree with Denise ~ your posts about chemo brain made me laugh!  What's not funny is the state of our health care system.  I'm self-employed and the monthly premiums I pay for myself, my husband, and my paralegal are obscene.  What really grates on my last nerve about this is the huge surpluses the health insurance companies have stocked away, while raising premiums every year.  Ok, as my mother-in-law Dorothy, God rest her soul, would have said, \"Oy, enough already\"!  LibraryJenn:  I don't know anything about Lupron, but I hope it helps.  I'm sure it's a big comfort that your little one enjoys the sitter so much!  Hope the cold doesn't wear you out. Magda: I hope you have minimal SEs from the Zoladex.  Do you get that after each chemo tx?  I thought I'd dodged the Taxol nail issues because I kept them polished all through treatment.  However, 2 weeks ago, I lost ½ of my L thumb nail, and now all but 2 nails have varying levels of white/striated areas at the tips (looks sort of like a bad French manicure!). njbhwgirl:  Welcome back!  I can imagine how frustrating and nerve-wracking it is to be waiting for answers & not getting clear ones.  However, your onc seems satisfied that there's no cause for alarm, so try to relax until the next round of tests.  That's the advice I just gave myself this weekend!  I'm really sorry I can't join you for this get-together, but would love to next year. Packjen/Jenn:  What a wonderful trip you've planned!  My sister was in Hawaii many years ago & still talks about how beautiful it was.  You're right ~ you deserve it! Patricia:  A baby grand is just the thing to say \"f*** cancer\"!  Do you play?  I took lessons for 4 years in grade school, but abandoned it for the guitar when I reached high school.  Funny story about motivation:  On the first day of school, all students attended Mass & sat with their teachers - first grade in the first row, and so on.  When my girlfriends & I saw the new, young, male, 6th grade teacher, we about swooned in our pew - he was gorgeous!  The next week he organized students to play guitar and sing at the weekly folk Masses (I'm really dating myself now!).  Although I could sing ~ actually, I'd been singing in church for years ~ I desperately wanted to play the guitar with him, so I learned enough cords to get by the \"auditions\".  Once I started, I really enjoyed it and improved a great deal under his tutelage (musical, that is!). Sacphotomom/Denise:  I'd love to see \"Brandy\" ~ don't wait until you feel less tired, just do what I do:  makeup!  It's all smoke & mirrors! Summer/Theresa:  Get some rest and get over your cold soon. x-ray/Daiva:  Manis and peds with Emma?  How lovely!  I'm sure you enjoyed every minute of being with her.  Loved your chemo brain stories.  Don't fret about not recovering as fast as you thought from the last tx.  I think it's normal, especially when you consider how much toxic stuff was poured into you over the last few months.  You'll feel better soon. Hugs to everyone!",
      "MessageIndex": 1617,
      "PostDate": "22/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 25, 2010 08:13PM Irishtess wrote: Denise:  I was checking out lymphedema sleeves on the web (want one for my upcoming flight) & decided to see what's going on here.  I'm so sorry about your medical issues.  Being in the hospital is no fun, but at least there you can rest & get the attention you need (although it must have seemed really weird with everyone suited up just to come into your room!).  We're all pulling for you! Latte: Thanks for the reply, but no ~ I didn't have a port.  My mother-in-law, Dorothy, went to Israel many years ago & absolutely loved it.  I'm sorry she wasn't able to return before her death (ovarian cancer). Hope everyone else is ok!",
      "MessageIndex": 1633,
      "PostDate": "25/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 28, 2010 10:55PM Irishtess wrote: Hi Ladies!  The throat tightening/constriction is \"radiation esophagitis\" (rad onc dx'd it yesterday after I gave the symptoms to his nurse).  When he saw me today (moved up the weekly meeting from Thursday), he said the radiation is hitting part of the esophagus, but he doesn't think the problem will get worse (also did not order any change in the treatment field).  He also didn't think it was bad enough to give a script for lidocaine syrup.  Meantime, I'm supposed to avoid really hot/cold food/drinks.  As my cousin Joey would say, \"Fuggedaboudit!\"  I'm not giving up my tea in the morning after finally being able to enjoy it (well, I guess I can let it cool off a bit before I drink it!).  9 down, 21 to go! Leanna:  Sent you a message on FB.  Also, I found this article on lymph node transplant after bc surgery ~ being done at St. Francis Hospital in Charleston, SC by Dr. Marga F. Massey:  http://www.ivanhoe.com/science/story/2010/03/686a.html! Sacphotomom/Denise:  I PM'd you. Summer/Theresa:  A week of rads behind you already?  How great does that feel?  I noticed the pink starting up before the end of the first week.  Today was # 9 for me, & I'm starting to feel as if I was out in the sun a little too long.  x-ray/Daiva:  I ordered the sleeve & the gauntlet (for the hand) for my flight to Ireland.  My index finger is still swollen from my mishap on July 4th when I used the L hand to try to pull myself out of the lake on the dock ladder, so I'm not taking any changes.  I looked on line for products ~ many must be purchased at a dealer.  Some available on line were just plain boring.  I decided to order from LympheDIVAS because they had really colorful items.  I opted for the dragon & lotus tattoo pattern! Have a good evening, everyone!",
      "MessageIndex": 1647,
      "PostDate": "28/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 17, 2010 03:37PM Irishtess wrote: Good luck to everyone starting this week (I join you on Friday)!",
      "MessageIndex": 311,
      "PostDate": "17/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jun 3, 2010 06:33AM Irishtess wrote: Day:  Glad you got a kick out of my story - my non-bc girlfriends also thought it was very funny! Patricia48: I love your idea about a dark chemo humor book (& thanks for the MB comments!).  When I was first diagnosed, I read \"Cancer on $5 a day (Chemo not included)\" by Robert Schimmel (a comedian).  Much of it was really funny!  Other than that, the other \"survivor\" stories & books are more serious and factual, so why not?  Any interest in this?  I'd be willing to start pulling some our better material together! fotopet:  That was my reaction, too!  Redbarb: Good luck today.  TriciaB:  I agree with the others - it's a comfort to hear from someone with concrete proof that this stuff is working!  Njbhwgirl:  I also had all my scans pre-surgery.  However, if my doc wanted to check something out now, I'd err on the side of caution & do it (that's just me).  Westiemom:  I hear you about being in Nappa next year!  My destination is Ireland, downing many pints of Guinness & shots of Middleton's Irish Whiskey!  Nana, JennyB, LauraM, Packjen, Summer, Leanna & sacphotomom:  Thinking of you also & thanks for the posts.  [Sorry if I missed anyone]. Humor for today (I'm Catholic & my husband is Jewish, & this is one of my favorite jokes): A priest and a rabbi happen to be sitting side by side during a flight.  After briefly reflecting on their respective beliefs, the priest turns to the rabbi and says, \"Rabbi, pardon me for asking, but I know that your religion has a prohibition against pork.  Have you ever tested your beliefs and tried pork?\"  The rabbi, being an honest man responds \"Why yes Father, I did try pork once and I am ashamed for allowing myself to be tempted.\"  The priest nods his head and says \"I understand.\"  Both men sit in quiet contemplation for a while and then the rabbi says \"Father, pardon me for asking, but I know that your religion requires priests to be celibate.  Have you ever tested your beliefs and made love to a woman?\"  The priest responds \"Why yes rabbi, I did have sex with a woman once and I am also ashamed for submitting to temptation.\"  The rabbi nods quietly and after a minute responds \"It's a lot better than a ham sandwich isn't it?\" I'm off to NYC tomorrow for treatment 2 - will check in next week.  Have a great weekend everyone!",
      "MessageIndex": 554,
      "PostDate": "03/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jun 11, 2010 03:09PM Irishtess wrote: LibraryJenn:  Welcome - as the other ladies said, we're sorry you're in this club, but glad you founds us.  I'd be a real \"loo-la\" as my Irish girlfriend, Evelyn, would say, if not for these gals! Summer:  Great pic of you and your daughter!  Kim:  Your photo is priceless!  Fotopet & packjen:  Glad to hear from you, but sorry you're dealing with more stuff.  Day:  I'm lucky to have my husband here, but I understand totally how sometimes this feels like being in a vortex - not here, not there, just somewhere we want to leave.  Drim:  Love the idea of a reunion!  Patricia48:  I'm awed by your energy - I've been trying to walk every day, but this week, it's been a struggle!  LauraM:  Can't help with the blister issue; hope it resolves quickly.  Golfergirl, Daisy, Paxton, sacphotomom, snipinfool, Leanna:  Thanks for the updates.  JennyB: Still thinking of you and your family. Everyone (sorry if missed anybody):  Have a good weekend!",
      "MessageIndex": 680,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jul 15, 2010 08:42AM Irishtess wrote: Thanks for the comments girls!  I figured since so many of you had posted the baldie look, I'd take a pic without the scarf.  Actually, with the heat, I've been baring it more often than I expected, including in public!   It actually feels pretty liberating! njbhwgirl:  I agree with Barb - count me in if you're up to it!  I'm in the same boat re no vitamins, supplements, etc (that seems to be the Sloan Kettering protocol).  I think it's because there's no regulation on those items, and quality and ingredients can vary greatly. Yesterday, I spent some time gathering clothing ~ mainly tops ~ I can't wear anymore (too low cut) to bring to my sisters.  I couldn't believe how upsetting this small task was ~ I mean, I understand why, I just didn't expect to be so sad.  Then today, I read about your son ~ that's really something to cry about.  I'll pray that he keeps out of harm's way. Patricia:  Good luck with your 1st Taxol tx.  I'm right behind you ~ mine is on Fri. All:  Have a great weekend.",
      "MessageIndex": 1000,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jul 19, 2010 04:06PM Irishtess wrote: Hello May chemo sisters!  I just finished catching up with everyone.  It's odd ~ after a few days of not checking in, I feel like I need a fix!  No matter how supportive & understanding my family and friends are, they're not walking in the same shoes. Paxton:  I'm glad that you're getting some help.  I think a lot of us have trouble asking for help, especially when we're the ones on the giving end, but we need to do so.  I've struggled with this, & I don't have young children to care for.  Barb:  I guess by now you're on that much-needed vacation.  Hope you have a great time! Day:  I was sorry to read about your family cancer hx.  When I talked with my surgeon about taking the \"healthy breast\", she said \"I don't have to live in your skin.  If you need to do this to improve your quality of life & not wake up every day worrying about what will happen next, I'll support your decision.\"  I think its great advice. Leanna:  What a relief on your MRI results, & sounds like the b-day party was great fun for everyone!  When do you have your surgery, & what are you having?  My pre-surgery biopsies all showed IDC and DCIS (plus it was into the lymph nodes & the main mass was 10 cm), but post-surgery path report also confirmed LCIS.  So I was really glad I made the decision to have the bi-lateral. Drim:  Hope you get that darn insurance issue resolved.  This fight is hard enough without having to deal with bureaucratic bullsh*t.  Daiva:  Sounds like you and your daughter had a great NY trip.  Hope by now the fever is gone & you're feeling better.  JennyB:  Sorry to hear about the chest pain ~ hopefully, it will be gone soon & you can enjoy being done.  GolferGirl:  Congrats on getting your port out - must be a relief!  Fotopet:  By now, you had your last tx.  I know you were dreading it, but I'm betting it wasn't nearly as bad as you expected.  LibraryJenn:  What a great get-away!  I'm sure your husband needed it as much as you did.  This is really tough on them.  njbhwgirl:  Thanks for the invite ~ what a great way to meet up & celebrate life & strong women! BTW:  Is everyone here moving on to radiation after finishing chemo?  If not, what's next? Sacphotomom:  Sorry to hear about your night ~ hope you get past this soon.  YAY for no stomach/gut issues.  So far after my first Taxol tx, I've not had any of those issues either.  My onc is keeping me on the Neulasta until I finish my 3rd tx ~ don't need it after the last one.  Probably just as well - my counts have been good all along. Summer:  How scary for you ~ any sense from your onc about how to avoid it next time?  Patricia:  My Taxol treatments are every other week, so I'll have more recovery time in between txs.  I got the Decadron via IV first, then Benadryl, then the Taxol.  For me, the \"Uncle Ben\" ~ as the onc nurse called it ~ was the worst part of the infusion.  During the last 5 minutes, it burned like hell (even though she put a hot pack over the infusion site which is supposed to help cool it down!  HUH?!!).  Achy feeling seems to be a common SE ~ my onc & the onc nurses all said expect joint/bone pain.  I also have not had any of the AC gastro issues & I'm keeping my fingers crossed that it continues! I seem to have developed neuropathy in my fingers ~ feels like I burned them on a hot stove (plus swelling).  I've started doing some research on this - one study suggests taking L Carnitine.  I also thought I'd read ~ maybe here ~ about gloves?  If anyone knows about that, I'd appreciate the info, & I'll post whatever I can find out. Hi to everyone else in the May chemo group.  I hope you all are doing ok!",
      "MessageIndex": 1029,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Aug 10, 2010 01:43PM Irishtess wrote: Good Morning Ladies!  I'm rushing to get to work, but just wanted to say hi to everyone.  Leanna:  Ask your onc for Zofran for the nausea.  It worked wonders for me. Have a good day, girlfriends!",
      "MessageIndex": 1249,
      "PostDate": "10/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Aug 12, 2010 04:43AM Irishtess wrote: Leanna:  Glad to see you're back!  Hope you enjoy the visit with your Mom. Day:  I'm really envious about your hair growth ~ right now, my head feels like 800 grit sandpaper!  I hope everything works out with your ALND surgery & good luck with the scans! I'll be MIA until next week (leaving tomorrow for my Friday the 13th infusion).  Until then, keep well, everyone ~ I'll be thinking of you all as I nod off to sleep after my Benadryl drip!",
      "MessageIndex": 1263,
      "PostDate": "12/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Aug 23, 2010 12:23AM Irishtess wrote: Hello to all my girlfriends here!  I couldn't sleep tonight ~ even with the Ativan ~ so I decided to read through all the posts I missed the last 10 days and catch up with everyone.  I have my last Taxol tx on the 27th ~ YIPPEE!  Bone pain has been really bad since # 3, plus I'm still having chest tightness & pain & dealing with the neuropathy.  Also trying to work (p-t), but it's a struggle.  Ok ~ enough whining!  On 09/03, I meet with the rad onc.  Both my BS & my med onc said 20 rounds, so if the rad onc says any more, I'll be really p*ssed!  At any rate, I need to be done, done, done, by Halloween because I'm heading to Ireland with my sisters & my mom, leaving Nov 3 and returning Nov 12, which gives us a week on the \"auld sod\"!  Can't wait! cleob:  Wow, that's great that your tumor is shrinking with each tx ~ you must be feeling really good about that.  Hope you enjoy(ed) Atlanta. Day:  Glad to hear about your good PET/CT & tumor marker results.  Your surgery seemed to go well (ugh on the drain!), and please let us know the path results.  I'm glad Patricia asked about the sculptures ~ I'll check out the thread.  In my spare time, I make jewelry, although, since my dx in March, I haven't done much other than a piece I donated for a Leukemia Society fund-raiser in June.  I know I'll get back to it once the chemo is over ~ I've been missing that creative outlet. Drim:  I'm so glad you had a good time in PR.  Your suitcase saga sounded like something I'd do!  Hope you continue to do well on rads & shepherd the rest of us through this next phase. Kim:  That pic still cracks me up!  Sorry to hear about the cold ~ hope by now you're feeling better. LauraM:  Congrats on finishing!  Glad you enjoyed Cooperstown.  You sound really excited about your Mom's visit ~ I'm sure you'll treasure those days. Leanna:  Sorry you're having such a tough time.  My neuropathy started the day after my 1st Taxol treatment.  My onc prescribed gabapentin (generic of Neurontin), which has helped.  Still have some numbness in fingertips, toes and the heels of my feet, but it's not nearly as bad as it was before I started taking the drug.  Hope it resolves quickly for you.  The bathroom re-do sounds very pretty.  It's amazing how simple things can really brighten up a space and make you feel good! LibraryJenn:  I understand all too well about aggressive tumors (mine was 10 cm), but I'm sure you'll have a good outcome between the drug combo & your surgery.  Keep us posted on the date (& I hope that rum & coke hit the spot!). njbhwgirl:  Congrats on having your last Taxol tx!  My 2 cents: don't worry about why you were emotional and crying.  Reaching the end of a long and difficult road can be both happy and sad at the same time.  I understand the need to take a break from everything you've had to take since this began.  However, I decided when I first found the mass that I would do everything I could to beat this.  My onc has prescribed Arimdex &, although there are risks to taking it ~ hell, what BC treatment or drug doesn't have risks? ~ I will take it. Packjen:  I had read about the L-carnitine studies when I was on AC, but forgot about it when my Taxol txs started.  Glad you had good results with it!  Your story about your teacher's wife is a real inspiration, as are you for going back to school.  I love our court reporters here, & I'm sure you'll be a terrific one!  Hope you enjoyed your C for R wkend. Patricia:  So much to catch up on with you, girl!  Great news about no transfusion.  How great, too, that your sweetie rescued a Goldie!  Our good friends here have been doing that for many years.  Wonderful news about your impending household change ~ I wish you many, many happy and healthy years together.  Sorry you had some bad days ~ sounded like you were being too hard on yourself for feeling low, so I hope you not only are feeling better but cut yourself some slack, too! Paxton:  Hang in there ~ you're almost at the finish line! Sacphotomom:  Sorry to hear the bone pain is continuing, but hang in there ~ as you said, just a few more and done.  How often are you getting the lymphedema massage?  I really hope the water/circulation problems resolve ok.  Your wkend away sounded so wonderful ~ did you find a really interesting martini? Summer:  Love your reasoning about the reflexology package! Actually, I'm surprised I haven't used it myself!  An hour is a long way to go for rads, but if I had the choice, I'd have done them at Sloan.  For me, though, the distance is too great, so I'll be doing them at Hershey Medical Center.  Biscotti martini?  Can you send several in a refrigerated package? wellsley66:  Bull riding?  You go girl!  Sorry I was too late reading your post to vote for you.  Congrats on the neg. PET!  Loved your analogy. x-ray:  Great new photo ~ I would never have recognized you!  Sounds like it was a great grad party & bday (even tho you had tx that day).  I'm sure you also had a great time with your Dad in Toronto & you are def. blessed to have him.  Are you really having doubts about going to Paris?  Tell me it ain't so!!  You have to go! Fiver05 and rcca:  Congrats on finishing chemo and thanks for sharing your thoughts with us. Sorry if I missed anyone.  Hugs & kisses to all you wonderful ladies!",
      "MessageIndex": 1354,
      "PostDate": "23/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Aug 26, 2010 04:56AM Irishtess wrote: Leanna:  Glad to hear from you, &, as I told Paxton, complain here all you want.  I usually give everyone the benefit of the doubt, but if my GFs who offered help didn't come through for me, I'd be really hurt, & then angry, because it's easier to be mad than hurt.  I echo what Daiva told Paxton ~ if we lived closer, we'd be there to help. Day:  Awesome news!  Thanks for letting us know. njbhwgirl:  Thanks so much for the invite.  I haven't planned anything for Sept except starting rads, so would love to come on any wkend you pick! Summer:  Sorry to hear you had to go it alone, but I'm so happy for you that you're finished.  I'll join that club on Friday.",
      "MessageIndex": 1383,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 2, 2010 09:38AM Irishtess wrote: Daiva:  Hoping your last tx is uneventful (medically) ~ enjoy the T-shirt celebration!  Your story sounds like something I would have done! Patricia:  Thinking of you today.  Hope the transfusion tomorrow goes well & you are back to your old self soon.  I just know you'll be ok for the Paris trip. Majdula:  My onc prescribed Neurontin (generic: gabapentin) for the neuropathy I developed from the Taxol.  Although I have numbness & tingling, it's not nearly as bad as it was before the meds.   Your onc sounds like a great woman. Day:  I'm really envious ~ your hair looks great! LibraryJenn: I also have limited strength in my hands (I think it's part of the neuropathy), so it should go away.  I know what you mean about times when you completely forget you're a BC patient, & then realize what you've been through & still have ahead of you.  I don't think that will ever change, but I hope that the times we forget about it start to outweigh the others. njbhwgirl:  I've been following the reports on Hurricane Earl & hope you don't have any problems. Leanna:  Don't fret about losing the post!  Happens to everyone at some point. marmalade:  Great to hear from you.  I usually wear a scarf or a hat, but have taken them off in restaurants and clothing stores (esp when it got too hot).  It's very liberating, & I think I'll do more of it once it gets a little cooler.  Good luck with your last 3 tx.  Some of the ladies here already have been through a number of rads, so they're trail-blazing for the rest of us! Paxton: Although your good news may not have sunk in yet, you sound much more future-looking than ever before.  Congrats again! Well, I'd better get back to work.  Love to everyone!",
      "MessageIndex": 1445,
      "PostDate": "02/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 9, 2010 10:49PM Irishtess wrote: Well, girls, I had my mapping/planning session yesterday & got my markings & schedule.  Dress rehearsal ~ or whatever it's called ~ is the 15th, with the first rad on the 16th.  My \"final treatment\" ~ it says so on the paper ~ is Oct. 27.  The tech commented about my warp-speed scheduling & the onc said it's because she's going to Ireland and needs to be finished!  WOW! Barb:  Good to hear from you, but I'm sorry about the emotional turmoil.  I think that's a normal part of this process, though, and we all have those episodes and periods when it's just too much.  Glad you're doing better, but I'm sure the news about your cousin hasn't helped.  At least, she'll have you to help her through this. Chris:  Welcome to our little group!  These ladies are so supportive and helpful ~ glad you found us. LauraM:  Hope you don't have too much work, even if you are able to work from home.  I sometimes forget that I don't have the energy or the stamina I did before all this started and overdo it.  Take it slow and easy! Latte:  Welcome!  I can't help with your questions because, like Daiva, I had my surgery first. Leanna:  Glad you got the PS issue straightened out.  Are you done now with chemo?  I lost track of when you're last day is (was).  Our weather in PA has really cooled off, so I've been enjoying having the windows open and the AC off.  Hope you get some relief from the heat there. LibraryJenn:  Good luck on meeting with your surgeon tomorrow. Magda:  My husband and I have a holiday home in Castlebar, County Mayo (West Ireland), so my sisters, mom and I are headed there.  We'll spend some time with our friends there, and take some day trips.  Dublin is about 3 hours away by train (a little longer by car), & I agree ~ it's a great city!  I'd love to visit Prague sometime ~ it looks absolutely gorgeous! Patricia:  I hope #9 Taxol went ok today.  I can drink tea again, so I understand how you feel about the coffee!  Also, you are so right ~ I'd rather have a sore chest in a pub in Ireland than in my living room here!  Sacphotomom: Denise and Leanna:  I suspect we all have those conversations while going through treatment, and just trying to adjust to this new life.  I hope you're comfortable with whatever you decide. Summer:  You look like a cancer patient?  I thought I was the only one!  In fact, just yesterday morning, when I was getting ready for work, I looked in the mirror before putting on the war paint and thought: Boy, that poor girl ~ she really looks sick!  Then I realized it was me! wellsley66:  Hope your last ride today was uneventful ~ side effects, that is.  You'll treasure the hat & the autograph forever, and thanks for sharing his \"one jump at a time\" philosophy with us!  How great to hear from another survivor ~ it gives us all hope! x-ray/Daiva:  I'm so sorry to hear about the SEs and missing the college trip with Emma.  How exciting, though, about the chance to make the surroundings more comforting for those to follow you. Hi to everyone else - hugs to all!",
      "MessageIndex": 1505,
      "PostDate": "09/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 10, 2010 01:36PM Irishtess wrote: GolferGirl:  Your info on Miaderm is too weird in terms of timing!  After researching lotions for radiation, I ordered some & it arrived yesterday!  You're right ~ it's pricey: $28.80 per tube.  I decided to bite the bullet & order it because I'm really fair-skinned, get sunburned easily (I never go out without a sunscreen), & I'm anxious about rad burns.  Ever since my bilat mast, I've been slathering Vit E oil & other lotions all over my chest, so I should be ok getting started.  You sound so excited about seeing that finish line.  Hope the last week of boosts don't cause any more problems. For anyone interested:  According to the website, Miaderm was developed by rad oncs.  It contains calendula, aloe & hyaluronate, all of which have been shown to improve the condition of radiated skin.  Here's the link: http://www.miaderm.com/about.html. Leanna:  I'll be thinking of you on Tuesday.  It will be a relief to be done with that phase. Enjoy your weekend! Barb:  Also thanks for the info and tips.  Doc didn't say anything about bras, but I had already decided that I was going to stick with my men's cotton tank undershirts and not wear my prostheses while going through rads.  I've found they fit better than women's tanks, which assume you have boobs!  The end-of-treatment party is a terrific idea ~ no wonder you sound so excited!  I still have some eyelashes & some eyebrows ~ never lost either entirely.  Fingernails, however, are another story.  Just lost one (left thumb) & several others are literally hanging on for dear life!  Apparently, this is a Taxol SE.  Paxton:  I know it's easy for me to say, because I haven't been through this before like you, but try to take it one day at a time, \"one jump at a time\" as wellsey's bull rider says!  You have lots of ladies here pulling for you. Yikes ~ I didn't realize it was so late in the am.  Got to get to work.  See you all later!",
      "MessageIndex": 1512,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 18, 2010 04:00AM Irishtess wrote: Hi Ladies!  As you can see, I've posted a new pic.  No, I have not discovered a miracle hair growth serum!  Although the husband thinks my hair is growing in, I can't see ~ or feel ~ any signs of impending re-growth, so I decided to switch my look from hats & scarves (especially now that the weather is getting colder). Don't let that upbeat opening fool anyone.  Got my repeat blood test results & it's another good news/bad news outcome.  The ALP, which was so incredibly high & the reason the onc ordered the repeat, is normal.  However, the CA 15-3 jumped from 40 to 48 since 8/27, so doc has ordered a 2nd PET scan for 11/19, my next appt with her.  Probably making too much of it, but right now I feel like Roseanne Rosannadanna: \"It just goes to show ya, it's always something.\"  Anyway, I'm sitting here licking my emotional wounds & nursing a Black Bush (Bushmill's Irish Whiskey).  But then, as Scarlett O'Hara would say, \"tomorrow is another day!\"  (Don't why I'm channeling all these fictional characters ~ maybe just a good escape!).",
      "MessageIndex": 1583,
      "PostDate": "18/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 27, 2010 11:54AM Irishtess wrote: Denise:  Just sent you a PM. Drim:  A big hug on finishing rads ~  glad you had only minimal SEs.  Jersey is having the get-together on Oct 16.  I can't make it (some high school GFs contacted me after learing about my dx, so we're having dinner that night in Scranton, where I grew up).  I'll really miss seeing all you girls, but hope we can meet again soon. Magda:  Thanks for the info.  Since I don't see the rad onc til Thursday, I'm going to mention this to the techs today.  What's your paper on?  How far along are you? I brought some work home to review this weekend & didn't look at any of it, so I need to get to it this am before leaving for rads.  Hope everyone has a good day.",
      "MessageIndex": 1638,
      "PostDate": "27/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Oct 2, 2010 10:53PM Irishtess wrote: Hello Everyone!  I've finished 12 of 30 rads!  Although I still have the tightness in my throat when I swallow, it's not too bad.  Weather here today was cool, but sunny ~ really beautiful. Latte:  Magda's right - folks who haven't gone through this can't appreciate the bone-crushing fatigue.  Is there anyone who can give your dad some info so he can get a little more insight into what you're experiencing? Magda:  I'm sorry to hear about your past week.  We really walk on a tightrope through dx, treatment, & just living with bc:  tough cancer fighter on some days, emotionally fragile on others.  It's no wonder you hit a wall, especially with the death of someone you liked & admired.  I also felt more \"unhinged\" during the last few txs than earlier, & couldn't figure out why until recently.  Here's how I explained it to some of my non-bc girlfriends: At some point after my 2nd Taxol infusion, though, I retreated, like a little hermit crab, into the shell of my pre-breast cancer self. I did not want to see anyone, or talk with anyone.  Everything reminded me of what I was going through, and I simply did not want to think about it. It's not that I felt sorry for myself.  Rather, I was slowly, painfully, coming to understand that breast cancer is a chronic condition ~ neither surgery nor chemo nor radiation will change that fact.  Finally, when I accepted this realization, I crawled out of the shell, tossed away the mourning crepe, and said goodbye to what I had lost. Hang in there!  Oh, I loved the story about your dad & the wig! njbhwgirl:  Jersey:  I'm so sorry about your mom, & all the additional worry & stress you're going through.  Just concentrate on her & don't worry about us.  We'll all be here next year.  Paxton:  You have your hands full not only with recovering but with Gage, so I'm glad that you're not being as hard on yourself as you were earlier.  Eating well half the time is better than no time! Sacphotomom/Denise:  Glad you're home.  More later. Summer/Theresa:  So, now you've finished 10 of 25!  Good for you, & glad you're not having any issues! wellsey66:  I can't count how many times someone has said \"one day at a time\" (re getting through this) & I immediately think \"one jump at a time!\"  Thanks for that!  BTW:  How did you get into bull riding ~ & JB in particular? Have a good evening & a nice day tomorrow!",
      "MessageIndex": 1667,
      "PostDate": "02/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jan 30, 2011 12:58AM Irishtess wrote: Hi to Everyone!  I haven't been here in quite awhile, so started reading the posts I'd missed.  I'm only up to Nov 2, so won't be able to \"speak\" with each of you personally.  Just want you all to know that you are in my thoughts & prayers always. I finished rads on October 27 ~ it was really ugly.  On Nov 3, left w/ sisters & Mom for our Ireland trip.  We had a wonderful time.   I got back to work on the 15th, & the next day my paralegal went to the hospital for emergency surgery to repair a hole in her small intestine.  She's been out since then, so the husband has been manning ~ no pun intended ~ the phones & trying to help me.  I really hadn't expected to be at work as much as I was since Nov 16, & I'm really exhausted (although not able to sleep tonight).  Just started physical therapy because of the tightness under my L arm from rads.  No SEs from the Arimidex I started in mid-Nov.  I see my onc in Feb, & will also meet w/ the recon surgeon to review options.  Best news:  Blood work & PET scan results from 11/19 showed NED!  Will continue working my way through the news & reach out to everyone later.  Much love.",
      "MessageIndex": 2131,
      "PostDate": "30/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 13, 2010 02:02PM Irishtess wrote: Rock and Company:  Many thanks for the great tips.  I start chemo on May 21, and the info is invaluable.  Just another example of the angels on earth I've found through this site.",
      "MessageIndex": 441,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 12, 2010 10:45AM Irishtess wrote: Fotopet:  I just learned I start chemo on 05/21, so I'd like to join you & the other ladies who also are starting this journey this month.  Good luck to everyone, & I'll keep you all in my thoughts & prayers!",
      "MessageIndex": 211,
      "PostDate": "12/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 14, 2010 08:51AM Irishtess wrote: Leanna:  Thanks for the welcome ~ I start (ACT) a week today, May 21 (8 sessions over 16 wks, followed by rad, followed by hormonal therapy).  I'm an atty & will be returning to work next wk (BMX was on 04/14), but I don't have to tell anyone (friends, colleagues & clients all know what's going on & why I've been out this past month). Thanks to everyone for sharing your experiences ~ it's a real help as I get closer to Day 1!  Have a great weekend!",
      "MessageIndex": 256,
      "PostDate": "14/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jun 7, 2010 03:06PM Irishtess wrote: Good Morning!  Hope everyone had good weekends (or as good as can be expected with everything we're going through). Drim & njbhgirl:  My treatments are at Sloan Kettering's Breast Center on E. 66th St.  When I was dx'd with thyroid cancer last year, I decided against staying in Central PA for treatment & chose MSKCC (that surgery was June 15, almost a year ago!).  So, when I found the mass in my L breast at the end of Feb, I knew I would go back there.  I'm on a 2-wk rotation, just had # 2 on June 4.  I'd love to plan a get-to-gether - did that with one of the gals from the April mastectomy group who lives in Scranton, PA (where I grew up - all my family is still there; I live in Carlisle, near Harrisburg).  Drim - thanks ever so much for the offer of help! For anyone still dealing with nausea:  I had a terrible time with it after my 1st treatment - took 1 Compazine which did not help, made me feel jittery & worse.  My sister, Margi, an RN and the director of an out-patient surgery center in Scranton, told me that Compazine has lots of negative SEs and they haven't used it for years.  She suggested I talk with the onc about substituting Zofran, which I did  - what a difference!  I had no nausea on the ride home this time (took 1 tab with some dinner before leaving NYC) & none since (haven't needed many of them).  I was warned about headaches and constipation (what doesn't give us constipation?) with the Zofran, but I didn't notice any worse headache than I had with the other treatment.  I still take an Ativan before bed, so I can get a good night's sleep (even if I get up to pee 6 times from all the liquids I'm drinking, I can still fall back to sleep!) I didn't have any immediate reaction to the Neulasta shot, but 1 week to the day, I had pain in both hips.  The onc nurse on Fri said the pain is a good sign - regeneration in the bone marrow.  So, even though it's a pain - literally - it's one more bullet in the chamber! Packjen:  Love the T shirt - I was getting ready to order one last week, but couldn't decide on a color.  Can't wait to to get it!  Nana & Snipinfool:  Great photos!   Kathy:  Sorry you have to be here, but welcome!   Golfergirl, Summer, JennyB MNLinda, fotopet sacphotomom, westiemom, Day:  Thanks for sharing all your experiences, good and bad.  Some days are so much harder than others, the tears come for good reasons and no reasons.  I just know that, no matter how I'm feeling, reading about your days and knowing how you all are coping with this helps me more than I can say.  Love you all!",
      "MessageIndex": 594,
      "PostDate": "07/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jul 13, 2010 09:33AM Irishtess wrote: Hi Girls!  I'm so sorry, Paxton, that things seem so bleak.  Some of the other ladies have suggested asking for help from family & friends ~ they're right.  You really need to do so, as much for your own sake as your child's. Barb:  My 4th tx was a breeze compared with 3 ~ I'm sure you'll be fine on vacation.  I also have a cough ~ my lungs are clear, so I chalked it up to one more SE.  JennyB:  Sorry you had to see one more doc, but good outcome.  Patricia:  Your theory about the cough makes sense.  Like your sense of humor about Tuffy.  Same comment about Brandy to Sacphoto:  Gotta keep laughing!  Glad to hear things are improved for your Dad.  I've also had heartburn from hell (had been popping Zantac and Tums to no avail) so onc gave me a generic of Prilosec 2x per day, which has helped tremendously.  Nana:  Hope your 4th tx went ok.  Daiva:  Good luck on your 4th this week.  Leanna: Like the new photo ~ keep your chin up, girl!  Day:  What an awful experience with the nursing staff - hope you can make sure you have better care moving forward.  Golfergirl:  Congrats on finishing ~ I'm envious! I have my first of 4 Taxol tx this Fri ~ onc says not as many SEs as with the AC (assuming no allergic reaction!!).  Anyone who's been through Taxol already, I'd really appreciate your input.  Thanks!",
      "MessageIndex": 976,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Aug 8, 2010 09:36PM Irishtess wrote: Hello to Everyone!  Barb:  Way to go girl!  Hope we see you on the tube!  If you prefer Ireland to the beach (I know, some people would question that, but I understand), PM me.  My husband & I have a house in Ireland.  wellsley66:  Sorry I missed you last time.  Hope you're doing ok.  Day:  After seeing your photo with that long, gorgeous hair, it's hard to picture you with a Mohawk!  Hope that bug clears up soon. Cleob & Leanna:  Hang in there ~ the 1st AC tx was the worst for me (nausea, gastro issues).  On the fatigue side, the 3rd really did me in.  However, you'll get through it.  Just keep your protein levels up & eat something even if you don't feel like eating.  I also experienced the steroid high & bursts of energy ~ makes it worse when you crash!  Also, Leanna:  It really doesn't matter what anyone else thinks ~ you need to do what makes you happy now.  I don't think anyone who hasn't experienced this can understand how much you/we need to live in the now.  Cleo:  My next Taxol tx is on Friday the 13th ~ I'll be thinking of you & hoping no black cats cross our paths! Packjen:  I don't have TEs (opted to delay recon), but I admire your tenacity re getting all the info you can.  That's been my approach ever since I found the mass (like you, L breast & opted for bmx).  Knowledge is power.  Kim:  I used to sew a lot, but my head was spinning after reading your post on the panty conversion to wig liner!  GolferGirl:  Thanks for the info on rads going so smoothly.  What a relief!  LibraryJenn:  Glad to hear you're doing better.  Sacphotomom:  I really appreciated your too-funny story.  I've had similar experiences (haven't we all?). LauraM:  Hope your Cooperstown trip was enjoyable.  I hear you about the really bad joint/bone pain after your 2nd Taxol tx.  I had some after the 1st, but I just had my 2nd on 07/28 & it's def. worse this time.  I'm having radiation because I need it ~ my tumor was 10 cm & in all 4 quadrants of the L breast; 5 out of 14 nodes were positive; the post-surgery path report showed not only invasive DC and DCIS, which we knew about, but also lobular in situ.  I'm 58 (no family hx).  Most importantly, I want to do everything I can now (opted for the bmx) to up my chances of survival and non-recurrence. DancerMel, JennyB, Drim, Paxton, Fotopet, & anyone else I missed:  Be well & know that I think of you, and all the other women here, every day. Patricia:  You did custody evals?  Are you a psychologist?  One of my dear friends & her husband went to Paris a few years ago ~ they loved it! Daiva:  So glad you had a great time in San Diego.  It's wonderful to get away & do something \"normal.\"  I usually don't work on the days right after tx ~ esp. the last Taxol tx ~ it really wiped me out.  So, I try to make up for it the week before the next tx, but I'm still only part-time.  I've also thought about setting my thoughts on paper ~ other than what I've share with you & the other gals here.  I think it would help. njbhwgirl:  Finished with your 3rd Taxol tx?  How great!  Interesting that if affects the weakest joints ~ I guess that makes sense, although I hadn't thought about it that way before.  Can't believe the C for R folks are being so inflexible. Summer:  I'm a Theresa, too!  Shortly after I started taking the diuretic, my elephant ankles disappeared.  I've had similar pain issues with the Taxol, so I'm glad I have only 2 more to go! Hugs & kisses to all!",
      "MessageIndex": 1236,
      "PostDate": "08/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Aug 11, 2010 02:57PM Irishtess wrote: Hi Ladies!  Hope everyone having txs this week feel ok & have minimal SEs. Library:  I don't fish, so I am doubly amazed at what you caught - thanks for the photo.  It would have been hard to visualize how big that walleye is!  Paxton:  I'm sure you'll start feeling better soon.  Hang in there! Friday the 13th is my 3rd Taxol tx (#7 of 8 txs), so I'm getting close to the chemo finish line.  Back in May, before I started, it seemed like it would never end, but here it is!  I'm trying to coordinate the radiation between my onc (in NY at Sloan) with a radiation onc closer to home.  It's a little scary to think about handing over my treatment to someone else, but there's no way I could do 5 days a week for 4 weeks in NY! To celebrate the end of chemo & rads, I'm returning to Ireland in November.  Husband can't make this trip, but one of my sisters is coming with me (the other sister is thinking seriously about joining us).  Can't wait!  It will be so good to do something normal and non-cancer-related.  Hope you all have the chance to celebrate when you finish. Gotta run - have a good day girlfriends!",
      "MessageIndex": 1259,
      "PostDate": "11/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Aug 26, 2010 05:08AM Irishtess wrote: Well, I hit \"submit\" by mistake, so here's the rest: Daiva:  Hope the SEs don't prevent you from getting Emma to MU.  I also hope we can all meet in Sept! Jen:  I agree with the others ~ your story was so moving, on so many levels.  Thanks for sharing. Kim:  Your attitude is great!  I always enjoy reading your posts. Ok - that's as much as I can remember, girls!  I leave tomorrow, have my last tx on Friday, & will be home on Sunday (spending the weekend in Scranton with my mom & sibs).  Hope you all enjoy the weekend & that we continue to move through treatment, SEs, frustrations, setbacks, and tears to join all the survivors who have traveled this path before us.",
      "MessageIndex": 1384,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 1, 2010 08:17AM Irishtess wrote:",
      "MessageIndex": 1430,
      "PostDate": "01/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 13, 2010 07:16PM Irishtess wrote: Hi Ladies!  My med onc ordered blood work to see what's up with some numbers from the sample drawn at my last chemo tx (alkaline phosphotase ~ a liver panel test ~ was way high). So, I was at my PCP's lab earlier today for a blood draw.  While there, I met a woman (looked to be in her 70s) who recently finished chemo & 33 rounds of rads.  She looks great, really upbeat, & was very re-assuring about getting through this.  What a great way to start the day! Barb:  I haven't noticed lashes falling out, but my eyebrows are def getting thinner. Drim:  I'm glad that rads are going ok.  So sorry I can't join you guys this time ~ prior commitment that weekend.  Hope you're not pushing yourself too much. Leanna:  I don't think it's unreasonable at all to expect family to step up to the plate when another family member is going through a difficult time ~ so I disagree with your DH!  If my sibs & their spouses behaved like that I'd be devastated, & really angry.  There's also no excuse for his brother & family to not call, send a card, check in with you directly.  Bottom line:  his brother and his sister are narcissistic and immature.  They have no empathy and absolutely no appreciation for what you're going through (sounds as if his mother has the same lack of insight).  I know it's easy for me to say, but it's their loss.  They missed an opportunity to get closer to you and your children and to help you and their brother/son. LibraryJenn:  WOW ~ what fantastic news!  No wonder you sound so happy & excited. Magda:  Glad you were able to get out after being inside for so long.  Hope the genetic results are good news. njbhwgirl:  I hope your scan results come back quickly & the news is good.  I'm sorry to miss the October get-together.  After hearing about my dx, several high school GFs reached out to me & we're meeting that weekend in Scranton.  I hope you and the other Cancer Vixens have a wonderful time! Paxton: I'm sure it wasn't easy to be at your friend's house.  Keep up the walking ~ it really helps me! Denise: I have the same gosh darn watery eyes ~ worse on the left (my \"bad\" side!).  The runny nose has been constant throughout chemo, & I had some of this as well, but it seems as if it's worse the last few weeks.  I hope you're right ~ that all the toxic grap is leaching out of us! Theresa:  Your DH is a NYC firefighter?  Now, that's courage.  I can't imagine what it's like for him and his firefighter brothers/sisters during this month.  God bless him/them. Daiva:  The anger can be overpowering at times, but you handled it really well.  Enjoy your visit with your dad, & get some rest (try spraying some lavender water on your pillow or breathing in some lavender oil). Hang in there everyone!",
      "MessageIndex": 1534,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 16, 2010 06:05AM Irishtess wrote: Hi Girlfriends!  I have my 1st rad tx today & I'm actually looking forward to getting started! Day:  Good luck with the festival!  Looking forward to hearing all about it. Kim:  So good to hear from you.  Thanks for the prayers & good wishes for those of us following you into radiation land. LauraM:  My, you have your hands full!  Do your feet hurt from neuropathy?  Are you taking anything to alleviate it?  My toes and heels are numb; some days are worse than others.  On the rad issue, from the red outline on my chest at the \"dress rehearsal\" it looks like the radiated area spans from mid-chest up along the lower throat area, under the arm, & down the side about 3\" below my incision. Latte:  Have you made your decision about removing your ovaries, or are you still just considering it?  I had a complete hysterectomy in 1999 & never regretted the decision (I'd had horrible period issues; wound up with cramps just about all month, every month for a few years before the surgery).  Unfortunately, I was placed on hormone replacement therapy right away & stayed on for about 6 years, way too long as I now know.  On the positive side, I think I've avoided ovarian and cervical cancers.  Now that I've been through thyroid cancer (that was last year; a piece of cake compared to this!) & BC, I'm really glad that I elected to have everything removed. Leanna:  It's always something, isn't it?  Hopefully, the antibiotics will do their thing & your DH will be on the mend in no time.  Thanks for the prayers on the blood work.  No word yet, but I'll let you know when I hear. Jenn:  What a lovely gesture from your co-worker!  Thanks for reminding us to focus on the good people in our lives.  Why such a long wait for your genetic tests?  At least the MRI will give you some indication of what's going on. Magda: Your work sounds fascinating!  I love the idea of a Prague get-together!  Also, thanks for the compliment!  From the time I was a teenager, I've worked with my hands ~ sewing, quilting, embroidery, etc.  I started stringing beads after my maternal grandmother died (re-strung one of her costume jewelry necklaces & thought, wow, this is fun!).  A few years ago, I started working in fine silver, then bronze.  Earlier this year, I had planned on doing some copper pieces, but then found the mass, got my dx in March, etc.  Haven't done much these past 5 ½ months, although I did a piece for a Leukemia & Lymphoma Society fund-raiser in June.  Lately, though, I can hear the metals & the beads calling me, so I think I'll be back at the workbench soon. Packjen:  Wow, you're almost at the half-way point in rads!  Glad to hear it's going so well. Patricia:  Good luck with # 10 tomorrow, & thanks for concern re the liver tests (no word as yet).  I also appreciate your insights into work.  I had planned on working as long as possible.  Heck, my Italian grandmother lived to be 97 & my Irish grandmother to 88, so I assumed I'd have lots of years.  I still may have those years, God willing, but now, after having gone through all this, I'm re-evaluating many issues, including that one. Paxton:  Don't beat yourself up about the cookies.  You've been through so much ~ twice ~ that's taken a huge toll, physically & emotionally, on you.  Maybe you could eat a carrot for each cookie you eat ~ you know, start off slow?! Denise:  I understand your reluctance to have the chemo on Friday, but it's the last one!  You can do this.  I'm sorry that your sister & brother have not been there for you.  Hopefully, the ladies here have been able to give you some of the support you missed from family, even if it's at a distance. Theresa:  OMG ~ I can't imagine how your DH must have felt/still feels.  On a happier note, welcome to the new addition!  Name?  My ALP  (alkaline phosphatase) # was 178 units/L ~ Sloan's reference range is 45-129 units/L, so way high!  The ALT, which the onc also wanted re-tested, was 38 units/L (reference range is 5-37 units/L), just a little over the upper limit.  Daiva:  I totally understand losing it at work (been there, done that, got the T-shirt!).  You sound so relieved about not having to return while going through rads.  No, I hadn't looked up de-tox ideas, but thanks for the lemon water tip.  Some research I did on the ALP test, which was the really high one, suggested that what you eat before the test can affect it.  The night before my last chemo ~ which was the day the blood sample was drawn ~ I was at my cousin Joey's house.  Not exactly \"My Cousin Vinny\", but close!  On the menu: lasagna, mashed potatoes, chicken cutlets, broccoli rabe, 3 different kinds of salad, wine, pastries ~ you get the picture! ~ & refusing anything is akin to an insult!  So, I'm hoping that my healthful eating, non-drinking (boy, was that tough!) & fasting before the re-test pays off! Thanks to all of you for helping me on this journey.",
      "MessageIndex": 1561,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 24, 2010 01:10PM Irishtess wrote: Happy Friday! Latte:  There are so many decisions we have to make during this process that it sometimes is hard to keep doing it without freezing up and/or having doubts about what to do or what we've decided.  I'm sure you're relieved about the clinical trial decision.  Keep us posted on what the BS and the PS tell you. Leanna: I'm glad you're feeling better.  The farther away I get from the last chemo, the better I feel, so just keep that in mind.  I know you're anxious to get back to your pre-BC life & activities ~ well, maybe not work! ~ & you will.  It just may take some time. Magda:  You've got the right attitude: doing all you can to keep estrogens out of your system, even with all the SEs!  Thanks for reminding me/us about why so much of this is necessary. njbhwgirl:  I think we had the same storm here in PA.  The rain was really welcome.  Someone once said that getting old is not for sissies.  Getting cancer isn't either! Patricia:  How wonderful about not only taking lessons again, but playing with your Sweetie!  Sounds as if the two of you are very much in sync.  I have the same darn nail issues ~ not pretty.  I'm still keeping a nail strengthener on them, hoping that staves off more damage.  I also hope we can all meet sometime.  I don't know how I would have managed without you and the other cancer babes here. Paxton: Good to hear from you.  I understand your impatience, especially with caring for an active little one.  Just try to enjoy each day. Gotta get to my rads session ~ #7 of 30!!!!  Have a good weekend everyone! ",
      "MessageIndex": 1625,
      "PostDate": "24/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Sep 29, 2010 12:42PM Irishtess wrote: Hi Girls!  Daiva:  No, it's not painful (it can be, just depends).  My problem is with swallowing, & it's just like after my thyroid cancer surgery last year (doc removed the whole thyroid):  feels like someone is holding a thumb at the base of my throat whenever I swallow.  If stays like this for the rest of rads, I'll be ok. Patricia:  The National Lymphedema Network posts papers, one of which recommends the compression garments for plane travel (has to do with the cabin pressure).  Here's the link to the info: http://www.lymphnet.org/pdfDocs/nlnairtravel.pdf.  YAY on getting to the chemo finish line tomorrow! Denise:  I waited to hear from my onc last night, but didn't (it was her 1st day back after being out & she probably had her hands full).  Fell asleep early, but will reach out to you today. Leanna:  Is Dr. O'Neill a Dr.McDreamy (never watched that show, but I remember hearing  the term!).  It's wonderful to have confidence in your docs, isn't it?  I know exactly what you're dealing with with your mom.  My mom also is hard of hearing (doesn't want to admit it, though).  She has the volume on her TV turned way up, & doesn't even turn it down when she gets a phone call!  Just being with her on a weekend is challenging!  You sound really upbeat about the fast-approaching surgery & the good news about the tumor. Magda: Thanks for the info on your paper. I loved my biology and chemistry classes ~ & English, & Latin, & history ~ most anything but math, so I'm awed at the thought of complicated calculations of any kind! Have a good day, girls!",
      "MessageIndex": 1656,
      "PostDate": "29/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Oct 21, 2010 07:04PM Irishtess wrote: Hi Everyone!  I just read all the posts I've missed over the last several weeks.  I've been MIA because I've had really severe radiation burns, plus I've been working each afternoon.  I started the first of 5 boosts today, & will finish next Wed (the 27th), thank heaven! I think about all of you every day, & will write more this weekend.  Love to all. ",
      "MessageIndex": 1774,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Dec 5, 2011 10:42PM Irishtess wrote: Dear, dear friends:  I have not visited this site for many, many months, but had to do so today.  I saw a Facebook post today about Jenn, and could hardly believe it.  As I read her obituary, I realized how much I had missed her, and all of you, during this time.  I regret deeply that I did not have the opportunity to \"hold her hand\" and comfort her during these her last months. This year, I had focused on re-building my practice & returning to a more \"normal\" life.  I guess that's why I've been AWOL.  However, I've felt like the proverbial fish out of water, not feeling completely part of the day-to-day routine of work.  I think it's because I've not had this lifeline, this tether, to women who know, without words, what BC is all about. My absence here did not stop me from thinking about you & keeping you in my prayers.  You are brave, courageous, and irreverent, and I love all of you!",
      "MessageIndex": 2608,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Apr 19, 2010 11:51AM Irishtess wrote: Hello to all of my surgery sisters from last week!  I hope all of you are relieved - as I am - to have the surgery behind you.  I've not had as much pain as I had feared, and the husband has been doing a great job with the drains, so those of you who have your surgeries to come - don't worry - it will be ok. Love and continued prayers to all.",
      "MessageIndex": 205,
      "PostDate": "19/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Apr 20, 2010 02:19PM Irishtess wrote: Glad to hear that so many are doing well, but sad that so many women have to go through this.  I'm glad, however, to have you all in my life ~ this has been a great source of comfort, information, and motivation.  God bless and keep you always!",
      "MessageIndex": 220,
      "PostDate": "20/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Apr 23, 2010 09:04AM Irishtess wrote: ChoirLove:  I understand how you feel.  I've been a 34-D most of my adult life, and agonized over whether to remove the \"healthy\" breast.  Ultimately, I decided that I did not want to take the risk that I would be going through all of this again, so opted for the bi-lateral (surgery was on April 14).  Although it's a shock to see nothing there right after the surgery, and I'm still getting used to the new look, I don't regret the decision at all.  I intend to have recon after chemo & radiation, but even if that's not an option, I still would have made the decision to remove both.  Good luck on Monday! mtbookworm:  I understand your reluctance to undergo more surgery.  Just keep reminding yourself that the aggressive treatment is life-saving, and you can do this!",
      "MessageIndex": 238,
      "PostDate": "23/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 13, 2010 08:46AM Irishtess wrote: Hi Ladies!  Just read through the latest posts, & hope everyone continues to improve.  I start chemo on 05/21 (ACT) 8 sessions over 16 wks, then rad, then hormonal therapy & have been following the May 2010 chemo thread for tips, etc.  I'm more anxious about this phase than I was about the surgery, but I know it's necessary (my cancer was really aggressive; main tumor was 10.5 cm) and that many of you already have been through this.  Keeping positive thoughts ...",
      "MessageIndex": 374,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Apr 10, 2010 08:55PM Irishtess wrote: Hello again to all the girls having their surgeries next week.  I'm leaving tomorrow to go \"home\" (Scranton) to spend the day with my mom, 2 sisters, 3 brothers, their spouses, and my nieces and nephews (always a fun time and good for the soul!).  On Monday, I head to NYC for appt with my endocrinologist (follow-up to the thryroid cancer surgery last year) & pre-surgery tests, then countdown to Wednesday!  I'll check in with everyone next weekend after I get home.  I think of all of you every day, and I pray that God watches over all of us, our doctors & nurses, and our loved ones.",
      "MessageIndex": 135,
      "PostDate": "10/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Apr 28, 2010 04:40PM Irishtess wrote: Hugs to all the Ladies of the April 2010 Mastectomy Club who made it through surgery this month!  I hope everyone continues to improve and get stronger, and that we make it through whatever is next with the same grace and courage that sustained us thus far. My path report (got it yesterday) confirmed the IDC and IDCS, but also showed lobular carcinoma in situ, so my decision on the bilateral turned out to be a really good one for me.  I meet the onc on May 11 (my birthday, can you believe it?!!) and then on to chemo & then rad.  Hope we all keep in touch!",
      "MessageIndex": 276,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Apr 29, 2010 10:22AM Irishtess wrote: HantaYo:  I just read your post, and I agree with algreach ~ welcome and I hope you come through ok.  You'll find lots of support here, so let us know if you need anything.  Bookworm:  I received a booklet for post-surgery exercises (my surgery was at Memorial Sloan-Kettering).  Here's the summary:  Start with exaggerated deep breathing to relax.  Then: 1) shoulder roll: forward 10x and back 10x; 2) clasp, lift & stretch: clasp hands together on lap, head level; slowly raise hands toward head keeping elbows together; slide hands over head til you reach back of neck; at that position, spread elbows out to side & maintain for 1 min; 3) back climb: place hands behind back & slowly slide hands up center of back as far as possible; hold 1 min; 4) wall climb: walk fingers up wall to highest point you can reach; hold for 3 deep breaths, walk back down; repeat 5x; 5) side wall climb: same idea using each arm; 6) arm circles: make small slow backward circles in the air with arm & increase circle size until they're as large as comfortable; complete 10 backward circles & then do 10 front circles.  I was told to do these 3x per day. Hope this helps!",
      "MessageIndex": 282,
      "PostDate": "29/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jun 1, 2010 11:09AM Irishtess wrote: Hi to all my April girlfriends!  Hope everyone had a good holiday weekend.  I'm 7 wks out from my BMX & still have the tight band feeling (some days, it's really bothersome).  I'm also still really tired, but some of that is after-affect of general anesthesia (or so I'm told). I got my foobs a week ago Friday before my 1st chemo tx.  The fitter said she would select \"age-appropriate prostheses.\"  When I asked what that meant, she said \"You see how these have some give to them?\"  I nod.  \"Well\", she continues, \"they'd be much harder and firmer for a 30 year-old.\"  I just wanted to smack her! Tx 2 is this Friday - good luck to everyone this week.  Jenweg:  I'll be thinking about you tomorrow.",
      "MessageIndex": 448,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Mar 26, 2010 05:39PM Irishtess wrote: Hi Girls - looks like I'm in good company!  Just diagnosed - on St. Patty's Day no less! - and will have my surgery on April 14. Victoria21: I've been struggling with the same issue, but I'm leaning - heavily - on having the bilateral for some of the same reasons as rayofsun and 1marmalade1.  I also had thyroid cancer last year (surgical removal of the entire gland and replacement hormone). The u/s showed the left nodules - the right nodules were discovered only during surgery.  My last mammo showed no signs of anything and yet by February, when I discovered the mass, it was roughly 5 cm by 1.8 cm. I hope that you are comfortable with whatever decision you reach. T.",
      "MessageIndex": 25,
      "PostDate": "26/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Apr 30, 2010 07:23AM Irishtess wrote: Leisaparis:  Thanks for the info on fluid-reducing exercises!  Bookworm: Great news!  Hanta Yo:  Glad to hear of your progress.  Paxton:  Hope you don't have more fluid issues.  Suz:  You must be excited to have the protheses - I can't wait to get mine in 2 weeks!  Have a great time on your trip.  Jen:  Hope to see you soon! Hugs to everyone!",
      "MessageIndex": 297,
      "PostDate": "30/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 3, 2010 01:14PM Irishtess wrote: Hi April Girls!  I just returned home from visiting with my family in Scranton, PA, and met Jen (jenweg) and her friend, Kathy, another BC member, for lunch on Sunday.  We had a great time!  More later!",
      "MessageIndex": 323,
      "PostDate": "03/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Jun 8, 2010 08:16AM Irishtess wrote: Hope:  Just saw your post about the lump.  You deserve a good cry, so let it out!  I'll be praying for you.",
      "MessageIndex": 458,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Aug 11, 2010 08:42AM Irishtess wrote: Hi Everyone!  I've been following your posts & I'm glad to hear you're all doing ok (all things considered!)  I have my 3rd Taxol tx this Friday, the 13th ~ how ominous does that sound?  My 4th ~ & I hope ~ final Taxol tx is on the 27th.  Cafelovr:  I developed neuropathy after my 1st Taxol tx.  My fingers swelled up, were really red, & hurt like h**l, as if I'd burned them on a hot stove.  Onc prescribed Neurontin, which has helped a lot.  I still have some symptoms in fingers & toes, but it's nothing like it was. Jenni:  Sorry to hear about the vein issue ~ I hope you have smooth sailing with the port.  Looking forward to getting together when you're finished with the chemo txs! Have a good rest of the week & a good weekend, girls!",
      "MessageIndex": 525,
      "PostDate": "11/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Apr 6, 2010 05:10PM Irishtess wrote: Hi to all the April Girls!  I've been MIA because my PET scan on March 25 picked up possible metastatic involvement at C-4.  Had a follow-up MRI last Friday, and finally got the report today.  Looks like an hemangioma (an abnormal build-up of blood vessels; benign tumor), not metastasis, so my surgery (modified radical on the left; elective mast on the right; deferred recon til after chemo & rad) is on for the 14th!  I've been praying for all of you!  Brigidko, lsf, candyb and cafelovr - I hope you're ok & everything worked out.  Good luck tomorrow to lorieg.  Looks like we have 8 surgeries next week - wishing us all good outcomes.  Thanks to the March and the January ladies for their kind words & support, and especially to rayofsun for starting this thread! ",
      "MessageIndex": 90,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Apr 8, 2010 08:15PM Irishtess wrote: Just read the latest posts ~ thanks to Candy & Linda for the updates & the info.  Welcome to joansf & good luck on the 23rd.  Mantra:  I agree with hellome, ray & Linda that the fear & panic is normal, but you need to be comfortable with your decision.  I found peace when I decided ~ for many of the same reasons as the others ~ to remove both breasts, even though there's no indication ~ now ~ of a problem in the right one.  I just didn't want the uncertainty hanging over my head like the Sword of Damocles.  Will it guarantee that I won't have another cancer issue?  (My first was thyroid cancer last year).  No, but it lowers the risk, and that's good enough for me.  I hope you find the answer you need.",
      "MessageIndex": 111,
      "PostDate": "08/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "Apr 29, 2010 01:56PM Irishtess wrote: Suz and others:  Try this link for the booklet:  http://www.mskcc.org/patient_education/_assets/downloads-english/21.pdf If that doesn't work, go the Memorial Sloan-Kettering Cancer Care website (www.mskcc.org), select Breast Cancer (roughly middle of page), then select Patient Education.",
      "MessageIndex": 284,
      "PostDate": "29/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 5, 2010 06:20AM Irishtess wrote: Girls:  Your comments about shirtless gardening and \"gutadema\" are priceless!  I agree about the belly - never saw it until the boobs were gone! Saw my primary doc yesterday to drain fluid build-up, but he couldn't get anything from the R side (tried 2 different spots) & decided not to try the L side.  He wants me back on Thursday afternoon - hope he hits the bullseye this time cuz I'm really uncomortable.  At least I'll get some relief on the 11th when I see the onc & my surgeon's nurse.  Hang in there, everyone!",
      "MessageIndex": 334,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Irishtess",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99285/profile",
      "Content": "May 6, 2010 10:23AM Irishtess wrote: Jess:  My sister-in-law (a 5-yr survivor) told me getting the drains pulled was no cakewalk, so I was really worried about it.  All I felt was a little tug - no pain at all.  Before she pulled each drain, the doc said to take a deep breath ~ maybe that helped. o'mammal:  Sounds like a pretty good result, all things considered.  Are you a May baby?  My birthday is the 11th, & my first meeting with my onc had been scheduled for my birthday, but just yesterday, it was moved to the 10th.  How lucky can a girl get?  All things considered, it sounds as if you had a pretty good result, but I understand how much we grieve over having to go through this. April gals:  I agree with o'mammal (looks like I made her Irish!) to please keep up the posts.  I love hearing from everyone.",
      "MessageIndex": 342,
      "PostDate": "06/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    }
  ]
}