{
  "AuthorID": "ironmagnoli…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
  "Posts": [
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Aug 1, 2013 10:14AM ironmagnolia wrote: I was more terrified of the dye injections than I was of the actual DIEP flap procedure scheuled for the next day! The thought of my nipples being injected freaked me out. I asked for, and got, a RX for EMLA cream from my BS and slathered it on heavily before I went. I had already had a very bad experience with the first of my 3 biopsies, and was really scared of a repeat of that pain, which was due to not enough lidocaine being injected. I knew they would not deaden the nipple for this simple dye procedure. But, I barely felt the injection, used a very tiny needle, a slight brief burn from the dye itself was all. And I had both nipples done, as I had BMX. I was so relieved! The only thing I had a problem with was that the radiologist looked like Doogie Houser, he had to still be in high school he was so youngl!!! But his bedside manner was great and he really made me feel comfortable. His tech was a nice young man as well, and they had a female tech to stand in the room, I assume to make me feel more comfortable, which was nice. It was a breeze.",
      "MessageIndex": 20,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Jul 2, 2015 05:17AM ironmagnolia wrote: I see that you are located in Austin, TX. I strongly recommend that you see the PRMA group in San Antonio for a consult.They do all kinds of flaps and are one of the premier groups in the US doing the DIEP flap. These guys can guide you in your reconstruction decision and you will be in great hands, They are very well regarded in the US and I am very fortunate to have had them practically in my back yard when I needed BMX with immediate recon. Dr Chrysopoulo did a beautiful job for me and I couldn't be happier with the results.",
      "MessageIndex": 20,
      "PostDate": "02/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/832716",
      "Title": "difficult decisions- types of BMX surgery, experiences tshire MsVeryDenseBreasts"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Apr 26, 2013 03:39PM ironmagnolia wrote: I was diagnosed with early bc in the right breast after annual mammo, then had diagnostic mammo and US as well to verify. They also did both diagnostic mammo and US on the left breast. Nothing showed on the left. When I saw the BS, to discuss options for the right, she said she always send her pts for pre-op MRI of BOTH breasts so that she knows everything here is to know about both before going into surgery. So I had the MRI....guess what, it showed an even larger tumor in the left breast!! I had BILATERAL breast cancer. When I asked her how it was possible that the diagostic mammo/US did not show the left tumor, she said mammos are only 85% accurate.  While speaking with her last week, 7 weeks after surgery (BMX with DIEP recon), she further said that she presented my case to a group of physicians, and created an uproar because apparently ordering a pre-op MRI is NOT the standard of care and is very controversial among breast surgeons because of the costs.She says she doesn't care about the costs, she thinks it's good medicine and I agree. My left breast tumor most likely would not have been found for at least another year, and by then could have already invaded my nodes, worsening my prognosis. My SNB was clear on both sides. I'm so glad this women is my Dr.  ",
      "MessageIndex": 6,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803817",
      "Title": "Advice Please: MRI, Surgical Biopsy, or followup Mammo/US 4mos baml baml"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Feb 20, 2015 10:06PM ironmagnolia wrote: After reading on this site about this painful procedure, I asked my BS prescribe Emla cream to deaden my nipples. I had bilateral MX so both sides were injected. I felt the Emla cream really helped. I felt the injections but they were bearable and the discomfort was not nearly what I had expected. I applied it at home about 1 hr before the procedure. I was more scared of the injections than of the BMX and DIEP, as I had had my first breast biopsy done without full anesthetic effect. Apparently I need more Lidocaine then most folks so the usual amount did nothing for me. At my first biopsy, I felt like a nail gun had been shot into my chest. Twice. I ended up sobbing uncontrollably on the table, upset everyone in the room, including the radiologist performing the biopsy who apologized profusely over and over. I am normally pretty stoic, so this was not a common response for me. She immediately gave me more Lidocaine, waited for it to take effect and the rest of the biopsy was very tolerable. This experience made me very skittish regarding the nipple injections. But the Emla was very helpful.",
      "MessageIndex": 104,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/769441",
      "Title": "Radioactive Injection into Nipple NOT TERRIBLE waynesgirl50 Motherofall6"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Mar 27, 2013 07:42PM ironmagnolia wrote: seabeal--do you mind my asking if you were treated at the PRMA group in SA? If so, how did you hear about them?",
      "MessageIndex": 14619,
      "PostDate": "27/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Jun 26, 2015 12:53AM ironmagnolia wrote: Alexandra101--I was a postpartum nurse for years and steri-strips are OK to get wet, they usually start to fall off themselves in about 5-7 days. Its good to allow the warm soapy water to flow over the wound. After you shower, pat the area dry, and you can also use your blow dryer to dry the wound more if you want. It's most likely OK to allow the incision to be exposed to the air, it will aid in healing. Report any redness, swelling, or pain at the site which is new, red streaks from the incision,or fever over 100.4.  Hope this helps. Sandra",
      "MessageIndex": 2,
      "PostDate": "26/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/832909",
      "Title": "The days after Fibroadenoma removal surgery? Alexandra101 awb"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Jun 6, 2015 02:34AM ironmagnolia wrote: My personal experience with bilateral breast cancer is that the worst of the tumors is how you are graded. I had one tumor in each breast, one was stage 1 grade 1 the other was stage 1 grade 2. So, my prognosis was based on the worst of the two, or stage 1 grade 2. I thought I was toast when I was told I had bilateral breast cancer. But apparently my prognosis is based on stage 1 grade 2 ER+ PROG+ HER2 - . Highest Oncotypes were 15 & 19, no invaded nodes, so no chemo. Lucky, I guess.... :)",
      "MessageIndex": 5,
      "PostDate": "06/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/832354",
      "Title": "How is BC staged when you have multiple tumors? jmute Ridley"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Dec 10, 2016 09:36PM ironmagnolia wrote: Bilateral breast cancer has been considered in the past somewhat rare, but I don't think that's the case. MRI is instrumental in finding existing tumors that might not be found with mammogram/ultrasound. I was diagnosed with bilateral breast cancer in 2013 with MRI. It was not the standard of care at that time, and feel my life was saved by my brave breast surgeon who ordered it. Prognosis is based on the pathological findings of the \"worst\" tumor. Be thankful that you had a Dr who ordered MRI, that action most likely saved your life. You have many options for breast reconstruction and I hope you will take the time to research them.",
      "MessageIndex": 3,
      "PostDate": "10/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851104",
      "Title": "My life for the last four weeks Row Dafne"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Sep 2, 2013 03:15PM ironmagnolia wrote: Glad I'm not the only who has experienved this! Phantom itching mostly in my abdomen under the area where the flaps were taken. Less frequently it occurs deep within my new breasts. Of course, I'm so numb that I get no relief at all when I scratch these areas, so frustrating!!  Itching feels very deep...",
      "MessageIndex": 26,
      "PostDate": "02/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809416",
      "Title": "Phantom Itching txmomof2 Jennie93"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Jul 22, 2015 03:10PM ironmagnolia wrote: I was very afraid of this procedure...more than the BMX and DIEP flap scheduled for the next day! I asked my BS for RX for EMLA and used it one hour before with Tegaderm over both nipples. I felt some very slight stinging discomfort, but that was it. He injected several times into both areolas. I was so relieved!! Actually, I was totally distracted by the really handsome young radiologist who injected me. He couldn't have been more than16 years old.... :0",
      "MessageIndex": 2,
      "PostDate": "22/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/833592",
      "Title": "Sentinel node biopsy - do I need Emla cream? rleepac Aug242007"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Mar 3, 2013 05:47PM ironmagnolia wrote: Hi Maureen-- my surgery is scheduled for 0900 tomorrow, have to be there at 0700. I'm told it will be about 8 hours total for both BS and PS to do their thing. So will be a very long day for my family, about 12 hours from the time they take me back until I get to my room after recovery.  Good thoughts, prayers and wishes for both you and Anne, my surgery date sisters !!",
      "MessageIndex": 140,
      "PostDate": "03/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Mar 14, 2013 12:51PM ironmagnolia wrote: Hi Riverflows-- I'm in Tx too, San Antonio. Where are you located?",
      "MessageIndex": 370,
      "PostDate": "14/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Jun 26, 2015 04:36PM ironmagnolia wrote: I strongly feel you should follow your gut and get a second opinion.The wait and see approach would not set well with me, especially with your family history. I would suggest seeing a breast surgeon and insist on a follow-up ultrasound and possibly MRI. Good luck!",
      "MessageIndex": 2,
      "PostDate": "26/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832936",
      "Title": "Had my mammogram today--concerning Mwagn20 Mwagn20"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Mar 1, 2013 10:41PM ironmagnolia wrote: I am newly diagnosed, Rt IDC found on annual mammogram, and am having BMX with DIEP on March 4th. Also, not sure how to post this, but have bilateral IDC, the 2nd breast (left) diagnosed when an MRI was done pre-operatively before an anticitpated Rt lumpectomy. This finding was a game changer. I was originally a candidate for Rt lumpectomy/radiation, but now, BS says I seem to be at risk to develop these tumors for whatever reason, so need to have all breast tissue removed. No family hx of breast or ovarian canvcer. Am totally stunned. Even BS was shocked with the IDC being found simultaneously in the Lt breast. She has told us that this is very rare, but from my research, seems to occur in 1-3 out of 100. That doesn't sound rare to me. Have had the BRCA1 and 2 with BART sent out and am waiting for the results, have 2 grown daughters I am now worried about. So glad I found this forum , it has been extremely helpful to me! ",
      "MessageIndex": 113,
      "PostDate": "01/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Mar 2, 2013 09:53AM ironmagnolia wrote: Thanks for the welcome Maureen! Just wish none of us had to be in this club.... The March list has grown so much this week!! My surgery date was only set on Mon 2/25, so I've been scrambing this week to tie up loose ends at work and at home to prepare. So ready to get this show on the road.",
      "MessageIndex": 121,
      "PostDate": "02/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Mar 19, 2013 11:35PM ironmagnolia wrote: Riverflows, we're neighbors!!  Good to hear your are recovering well, I too am progressing right along, but am also having new aches and shooting \"zings\" through my breasts every now and again. Guess those nerve endings are healing. Interestingly, I find that some of the sensations in my new breasts remind of when I was lactating.",
      "MessageIndex": 460,
      "PostDate": "19/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Mar 20, 2013 07:37PM ironmagnolia wrote: Cuetang-- I know that some nerves as well as blood vessel were reconnected in the DIEP procedure and Dr's nurse warned me I would begin to feel more aches and some nerve discomfort as well as I recover and things continue to heal. I find I feel OK early in the day then feel an achiness across my breasts later in the afternoon. Not sure why. The skin across my breasts and under my arms is somewhat sensitive to touch as well. Another odd thing is what I call \"chills\" across my breasts/chest several times per day. No temp, and I'm not cold. Really odd feeling. I have to do twice a day massage to each breast and abdomen with lotion and find it difficult to carry out for the assigned amount of time (3-5 min) due to just feeling tender and sore.  I'm not, and never had, real pain, just tenderness and discomfort. Trying to just use tylenol, but find it doesn't really control the aches. So I usually end up taking a pain pill in the evening.",
      "MessageIndex": 476,
      "PostDate": "20/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Mar 26, 2013 04:38PM ironmagnolia wrote: Update-- Had another curveball thrown at me this week (was being diagnosed with BC and then being told I have it in both breasts simultaneously not enough?).  BS called me to tell me that my Lt breast margins were not clear in the area near the tumor. Rt breast margins are clear. She says this is only the 3rd time in her career that this has happened with mastectomy. Seems it's a fine line between taking enough tissue to eradicate the BC while leaving enough for the PS to get a good result on recon. Since I had a DIEP, radiation is out as an option (no thank you anyway), so I'm headed back to surgery within 2 weeks for a re-excision on the top of the Lt breast to clean where a few microscopic cancer cells were seen at the margin by the pathologist. Same day surgery, about one hour procedure, PS will be there in case he is needed.  On an up note, I was rather pleased with the final path report overall. New stats are in my siggy. Both the Rt and Lt tumors were smaller than I had anticipated, both Stage 1, and the Lt showed only one tumor when we had expected two. Oncotype was screwed up by the hospital, so only one side's report is back which showed a score of 15 on the Lt breast. I was expecting higher since we were under the impression that I had more than one tumor present there, so I am pleased. Now waiting impatiently for the Dr's office to get the Oncotype report on the Rt breast today. Have had a few down days recently, especially after the call about needing to go back into surgery.  But today after meeting with the BS, I'm feeling more encouraged about the path report and and my first Oncotype score. It's a rollercoaster ride for sure.",
      "MessageIndex": 547,
      "PostDate": "26/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Mar 3, 2013 05:54PM ironmagnolia wrote: Best wishes and good luck to you Anne!! Looks like you and I will be in surgery at the same time. Just go home from the SNB injections. I was so afraid, but it was a piece of cake!! I was not numb enough on one of my 3 biopsies so felt like someone had taken a nail gun to my chest. Terrible experience that has left me very distrustful of any procedure now. So glad this one went OK. Well, except for the Dr (radiologist) that looked looked he was still in highschool....!!",
      "MessageIndex": 141,
      "PostDate": "03/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Mar 3, 2013 08:55PM ironmagnolia wrote: Thanks Cuetang!! And best wishes for you as well! Looks like you and I are the only DIEP procedures on the March list so far. So intersting to me (as a nurse) that we all have breast CA, but all have different treatments/surgeries depending on our indivdiual needs. ",
      "MessageIndex": 150,
      "PostDate": "03/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "ironmagnoli…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172576/profile",
      "Content": "Mar 3, 2013 10:07PM ironmagnolia wrote: Maureen-- you are so fortunate to be able to stay only one night. I'll be staying 4-5 nights, hope to be home Fri afternoon at the earliest. I'll have 4 drains (two in my chest and two in my abdomen) along with a pain ball in my abdomen, the drains will stay 2 weeks. I'll have a catheter for 3 days, a morphine pump for 2-3 days, and be on a liquid diet for 2-3 days as well. I won't get to shower until Fri, just sponge baths. I am SO not looking forward to this, but trying to stay positive.  ",
      "MessageIndex": 151,
      "PostDate": "03/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    }
  ]
}