{
  "AuthorID": "IsabelArche…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210021/profile",
  "Posts": [
    {
      "AuthorID": "IsabelArche…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210021/profile",
      "Content": "Jan 27, 2016 07:55AM IsabelArcher wrote: bettie421--I happened to see your post while looking for something else. I had Paget's disease of the nipple, and it was not like what you're describing. My nipple was crusty and itchy, yet I didn't notice any discharge so I figured it was eczema. When it got intolerable I saw my gyn, who sent me to a breast surgeon, who diagnosed it. The rest of my story is really long and not relevant to yours (I'm in my 50s and had DCIS and HER2+ BC, along with the Paget's), but I just want to tell you two things: Don't try to diagnose yourself--try to see a breast surgeon or other breast specialist as soon as you can. And remember: most things are nothing. You are understandably scared because of your family history, and you're doing the right thing by seeing doctors, but truly, most weird things in or on the body do turn out to be nothing. The most important thing is to see a good doctor who specializes in breast health, and follow up on any concerns he or she may have. I wish you the best of luck. Try not to let panic run away with you--easier said than done, I know!",
      "MessageIndex": 2,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/840726",
      "Title": "Extremely worried about possible Paget's or IBC, please help bettie421 glennie19"
    },
    {
      "AuthorID": "IsabelArche…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210021/profile",
      "Content": "Jun 9, 2015 02:45PM IsabelArcher wrote:",
      "MessageIndex": 456,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    }
  ]
}