{
  "AuthorID": "Isabelle61",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199037/profile",
  "Posts": [
    {
      "AuthorID": "Isabelle61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199037/profile",
      "Content": "Apr 12, 2014 10:09PM Isabelle61 wrote: busymom3 & moderator-I am going to call my doctor Monday morning and see if they can tell me what showed up to request the comparison.  I did go to a different facility for this mammogram.  I wanted to switch because the place I went to previously was a hospital radiology department.  When I noticed I was having the discomfort I switched to a facility that specializes in breast cancer because I was concerned.  At the time of my mammogram they said it would be read on Monday and then it could take 2 weeks to get my previous films and compare them.  When I call my doctor I am hoping they can tell me it won't take another week.  Thank You for replying to my post.  I will let you know what I find out.",
      "MessageIndex": 8,
      "PostDate": "12/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820036",
      "Title": "Need Advice busymom3 TifJ"
    },
    {
      "AuthorID": "Isabelle61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199037/profile",
      "Content": "Apr 17, 2014 08:39AM Isabelle61 wrote: Great news.   The diagnostic mammogram showed everything is ok!!!!!!  For my screening mammogram it was the first time I didn't just go to the radiology department at a hospital.  It was also the first time I had a digital test.  The technician told me today that my breasts are very dense and have no fat.  They were not sure of an area from the screening mammogram so they wanted to do the diagnostic.  Today she really flattened my breasts much more that the first test and much further back.  Once they did that the area of concern showed up to be okay.  They also told me they were pretty surprised that I had never been called back for the diagnostic based on my previous films and the density I have.  I'm so relieved, I was so worried and my mom is pretty sick right now so I didn't want to add anything to her or the rest of my family.  Thank you so much for your replies and support.  I'm so fortunate, I will continue to visit this site to support others.  Please keep me updated on how things continue to go for you.",
      "MessageIndex": 12,
      "PostDate": "17/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820036",
      "Title": "Need Advice busymom3 TifJ"
    },
    {
      "AuthorID": "Isabelle61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199037/profile",
      "Content": "Apr 12, 2014 10:40AM Isabelle61 wrote: just wanted to get some opinions.  I scheduled a mammogram because I felt some discomfort at the top of my left breast and sometimes it feels like it goes to the left into my arm-front of my shoulder.  I do not feel any lumps.  I had the mammogram Saturday and today came home to a letter that said something showed up and they were requesting my previous mammograms to compare them.  Now I am really worried and they didn't say when they would give me more information.",
      "MessageIndex": 4,
      "PostDate": "12/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820036",
      "Title": "Need Advice busymom3 TifJ"
    },
    {
      "AuthorID": "Isabelle61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199037/profile",
      "Content": "Apr 15, 2014 11:01AM Isabelle61 wrote: busymom3.  I go Wednesday morning for a diagnostic mammogram.  When I called my doctor they said he would call me back to talk about what they saw on the screening mammogram.  He didn't call me so I called again but have not heard from him.  I'm trying not to worry.  My appointment is at the Cleveland Clinic Breast Center.   How are you doing?",
      "MessageIndex": 10,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820036",
      "Title": "Need Advice busymom3 TifJ"
    }
  ]
}