{
  "AuthorID": "Issymom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
  "Posts": [
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Jul 9, 2010 05:27PM Issymom wrote: We orginally thought my tumor was 8mm (turned out to be 2.5cm) and chemo was definately recommended.  I was told that because of the aggressiveness of TNBC, chemo is always the plan.  I was devastated at first, esp with the thought of losing my hair but I am now on the other side and accepting the new me.  I had some bad days but most were good even on chemo.  It is really hot right now and I am enjoying the VERY short hair.   This is the worst part of BC, the uncertainty and waiting.  Make sure you reach out to friends and family for help/support.  This site is wonderful.  When you decide when chemo will start join the chemo thread for that month.  These ladies were more help than anyone else.",
      "MessageIndex": 1,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/755136",
      "Title": "chemotherapy or not jsp1955 vangoghpro"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Jun 6, 2011 08:51PM Issymom wrote: #92  Think of you often.  You have obviously touched MANY MANY of our lives. Hope you are resting well. Lorrie",
      "MessageIndex": 369,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Jun 7, 2010 12:37PM Issymom wrote: I have worn glasses for 7 years.  While on chemo (A/C and Taxol), I was not able to see as well as before.  I am 6 weeks PFC and just went to the optometrist.  My eyesight actually improved on chemo (the prescription for glasses was off and that is why I thought they were worse).  My stigmatism went away and my farsightedness is basically gone.  I need glasses to read.  One good girft from chemo.",
      "MessageIndex": 6,
      "PostDate": "07/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753731",
      "Title": "Chemotherapy and eyesight question tania_s jeanne46"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Jan 7, 2010 10:23PM Issymom wrote: I am so sorry that someone responded this way to you.  Yes many don't get it.  I went to my facebook page and found MANY of my friends have put in their color.  All the responses to the post have been positive or the people just don't know why someone even put in the comment.",
      "MessageIndex": 3,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746451",
      "Title": "Hiding over here while the rocks fly my way... Running_Violet kim40"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Jan 2, 2010 09:59AM Issymom wrote: My doctor said I could remove the steri strips about 2 1/2 weeks after surgery.  That worked fine for me (I am 4 weeks out of surgery).  I did delayed reconstruction so I don't know if that would make a difference. As for sex, I think once you are comfortable with it it is OK.  If you can drive, you should be able to have sex.  Again, I am 4 weeks out and if it wasn't for a house full of family members for the holidays we would have already. ",
      "MessageIndex": 1,
      "PostDate": "02/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746154",
      "Title": "How long to leave on Steri Strips and resume Sexual Activity? precioustime dash"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Dec 6, 2009 02:12PM Issymom wrote: I had  a bilatral Mx on Friday the 4th.  I was home on by noon the next day (Saturday).  I spent the day on the couch and was surprised at how comfortable I was (it's all relative).  My surgery did not include reconstruction.  My PS really did not want to do it at the same time because there are so many different things that can go wrong.  I do look very deformed but I try not look at them.  I even took a shower this morning.  The drains are a real pain (sore) but manageable.  I can only sleep on my back which is very bothersome.  Good luck to those with surgeries this week.  It's my birthday today and we are celebrating the cancer is gone!",
      "MessageIndex": 34,
      "PostDate": "06/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/743855",
      "Title": "having bilateral mx December 4th klml4 Issymom"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Jun 18, 2010 12:22PM Issymom wrote: Wow Everett - Love your hair.  I am 8 weeks PFC and there is no way I will look like that in 2 weeks.  I have a mix of white super soft fuzz and hair.  I am trying to be patient.  At least the coverage I have is pretty consistent.",
      "MessageIndex": 5543,
      "PostDate": "18/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Dec 19, 2009 09:21PM Issymom wrote: I had my drains removed 2 days ago and I didn't expect it to hurt but was worried.  It didn't hurt.  She told me to take a deep breathe and then a strong exhale (that is when she pulled the drain out).  I don't know what the breathing did to help other than distract me.  It worked.  My only surprise is how sore I am.  I was so excited to be able to move around while sleeping but that kept waking me up as it hurt.  I guess that was the advantage with sleeping on my back, no moving, no pain!",
      "MessageIndex": 46,
      "PostDate": "19/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/743855",
      "Title": "having bilateral mx December 4th klml4 Issymom"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Dec 27, 2009 02:40PM Issymom wrote: Erika09 - Good luck with your surgery on the 31st.  I had my BMX on 12/4 and my 47th birthday was on the 6th.  When my doctor found out, he took my hand and said that I would always remember this birthday as the one that I got rid of cancer!!  You will be starting 2010 cancer free!  Happy New Year!",
      "MessageIndex": 48,
      "PostDate": "27/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/743855",
      "Title": "having bilateral mx December 4th klml4 Issymom"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Nov 28, 2009 01:58AM Issymom wrote: I am scheduled for my bilateral mastectomy on the 4th.  Life is going on (Thanksgiving,  a football games, etc...) and so it is very surreal to think that one week from now I will be \"boobiless\" as my daughter said this week.  I feel good about my decision but I too really worry about how it will affect our intimate relationship.  My husband was having some issue lately and I am so concerned that we will not be able to seperate the 2 issues.  We have not had sex since my diagnosis. These are very difficult issues to deal with and unfortunately add onto our own physical challenges.",
      "MessageIndex": 6,
      "PostDate": "28/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/743855",
      "Title": "having bilateral mx December 4th klml4 Issymom"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Sep 16, 2010 12:34AM Issymom wrote: I am 5 months PFC and my hair is growing on me.  There is much more grey than I am comfortable with but I get lots of compliments.  It is too short to consider coloring.  The interesting thing is that this morning I woke up with \"bed head\".  It means the hair is growing but it is something else I have to deal with now. I was prepared for this but I am starting to lose my eyelashes again.  My mascara was causing my trouble and today I got in good lighting and realized it was because there wasn't as much there as before.  I am doing the 3-day walk for the cure next weekend in Seattle and this is just one more reminder that the journey is not done and this is why we are doing this. ",
      "MessageIndex": 6007,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Feb 22, 2010 04:53PM Issymom wrote: Rosemary - I am so sorry about you going through this.  You have come to the right place for support and friends.  I have lots of friends and family around but it's the people on this site that truly know what I am going through and how I feel.  You are at one of the hardest parts of the journey, the unknown.  Waiting for results is scary.  Once you know if it is cancer, you meet with the doctors and develop a plan. It is good news that they don't think it is in the lymph nodes.  Good luck on the biopsy tomorrow.  It really shouldn't hurt (just a quick prick and then it is numb).  Let us know when you know more it there is anything else we can do to help.",
      "MessageIndex": 1,
      "PostDate": "22/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/748771",
      "Title": "Scared and Alone Rosemary349 Rosemary349"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "May 25, 2010 12:32AM Issymom wrote: I am new to this thread but have been reading it for months.  I am 5 weeks PFC and no visible growth of any type.  I am trying to be patient but if  I don't see anything soon, I will really begin to worry.   I shaved my head to about an 1/8th of inch to have a wig made out of my hair.  I lost about 90% of my stubble.   I have Biotin but have not taken it because I read several people said they had to stop it because they were having surgery.  I had my port removed last week and I am having a hysterectomy next week (BRCA1+).  After that, I can start taking it.  I am starting to really have hair envy.  One thing that is really hard for me is the lack of control.  What will my hair look like, what color will it be, will it be curly or straight, etc..?  I know you all have or are going through the same questions.  Thanks for all your posts and experiences.",
      "MessageIndex": 5420,
      "PostDate": "25/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "May 25, 2010 11:00AM Issymom wrote: Lilah - Thank you for words of encouragement.  It is good to know I am not alone with the slow hair.  I had a \"end of chemo\" party on Saturday.  A friend who finished chemo at the end of March (a month ahead of me) for Ovarian Cancer, was topless with a really cute hairdo.  It was about an inch long and stikey but so incredibly soft.  Several people who didn't know her asked me who the woman with the sassy short hair was. ",
      "MessageIndex": 5422,
      "PostDate": "25/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Jun 9, 2010 09:40PM Issymom wrote: I am 7 weeks PFC (can't believe it has been that long).  I just started to see growth on my head.  Looks like it is all over my head (yeah) but it is mostly the white/colorless fuzz.  I am just glad to see growth.  I am also feeling eyebrow and eylash growth but not enough to wear mascara, etc...  I have a question. About a week ago, I notice what looked like a bruise on both eyebrows right wear they start above my eyes/nose.  These \"bruises\" are the same size (about the size of an eraser head) and exactly the same place above both eyes.  I have had people look at it and they can see some new hair.  I am assuming this is kind of like a 5 o clock shadow.  Just odd looking.  Anyone else experience something similar?",
      "MessageIndex": 5493,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Jul 1, 2010 08:43PM Issymom wrote: I am 10 weeks PFC and my hair is growing in well.  I am still trying to figure out how grey I am going to be and what the dark color will look like (I was dk brown).  I had lots of white fuzz on my head and so the new hair is blended with the fuzz so the jury is out on what it will look like.  I am OK with waiting which surprises me. My question is about the \"fuzz\" that is ALL over my body (arms, stomach, FACE!).  I heard about the face fuzz but didn't expect it all over.  Will it eventually go away?  I am tempted to shave my face but I can't shave my entire body.  Probably no one will notice the fuzz but me.  I physically feel good but am bugged by the hair and my finger nails breaking off half way down the nail bed.  The gift that keeps on giving!!",
      "MessageIndex": 5581,
      "PostDate": "01/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Jul 8, 2010 01:18AM Issymom wrote: Nodapearl - thanks.  The interesting thing about this fuzz is that right now it is sticking straight out of my arms, legs (upper), and stomach.  The fuzz on my face is a little longer and lays down.  I wondered if I should use something like Nair on the stuff.  At least the hair on my head is growing.  I am completely covered with hair but it's not even 1/2 inch long.  I am taking Biotin, hum.  I had a few dark colored hairs on my upper lip and chin before chemo so I imagine that will come back.",
      "MessageIndex": 5596,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Jul 9, 2010 03:05PM Issymom wrote: I am 11 weeks PFC and really saw no new growth until week 6.  The good news is that once it started to grow, it really took off.  I have coverage all over my head but the longest is probably still only 1/2 inch long.  I am tired of hats and wigs (too hot) so yesterday I decided that I am going \"topless\".  This is who I am and why am I hiding. Charley - Now that you have seen some sprouts, I bet you see some amazing progress.  I have a lot of white chemo hair but I swear every day my hair looks darker as the real hair comes in.  Definately a work in progress.",
      "MessageIndex": 5613,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Sep 29, 2010 05:33PM Issymom wrote: Today I realized that my hair growth has slowed down substantially.  I am 5 months PFC and my hair is very thick but only an inch long.  I has not grown much in the last few weeks.  Today in the shower I realized I shaved my legs and under arms last Thursday and I don't need to shave yet.  I also lost my eyelashes again a couple of weeks ago.  They are growing back in again.  Has anyone else had their hair growth almost stop.  I started taking Biotin again yesterday.  Hopefully that will help. I did the 3-Day / 60-Mile walk this past weekend.  It was an amazing experience.  The part I didn't expect was all the support from people cheering.  These were people who had moms, daughters, sisters, etc... who had Breast Cancer (many of whom died from it).  Seeing their pictures and having them thank us for walking was quite emotional.  I still can't wear anything but flip flops but that too shall pass.",
      "MessageIndex": 6159,
      "PostDate": "29/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Dec 15, 2009 08:33PM Issymom wrote: Our diagnosis sounds very similar.  I was diagnosed on Nov 5th with a very small tumor (they said it was 7mm).  I then found out I was TN and grade 3.  Then we did the BRACA test and found out that I am BRACA1+.  It was like what other bad news can you throw at me.  I had a Bilateral MX on December 4th.  Fortunately, no lymph node involvement but the tumor was 2.5cm not 7mm.  I meet with my oncologist again tomorrow to finalize the chemo regimen.  We had a plan but now with the size of the tumor they want to do something more.  I'll let you know what they say. I have 2 kids but they are 12 and 16 so I don't have to worry about the germs.  Have you been in contact with a Patient Navigator at your hospital.  They may have some suggestions for you regarding the young kids.  You should also read the December 2009 thread.  Everyone is different but it sounds like there will be a couple of bad days per Tx.  That is when you might want more help.  I don't know about you but I am typically not someone who asks for help but I found that people are coming out of the woodwork to make meals, volunteer to drive me places, etc... I have been very open with my friends that I have cancer and shared my journey with them (I am typically private) but people have loved it. As many have said the unknown/waiting is the worst.  I think the hot bath idea is a great starting place.",
      "MessageIndex": 3,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/745442",
      "Title": "TN with Starting chemo in Jan. -- 2 young children at home 11tyBillion CoolBreeze"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Dec 29, 2009 08:59PM Issymom wrote: I had bilateral MX with delayed reconstruction.  I drove on day 6.  It was just to the store a mile away.  I wouldn't want to have to move quickly and moving my head a lot was definately bothersome.  The seatbelt still bothers me.  It is not the incision but the skin (or tissue under the skin) just above my breast area.  I guess our breasts actually go quite high on chests.  I was surprised at how good my range of motion was.  I know it sounds silly but I was glad I was able to blow dry my hair.  I like my hair and if I am going to lose it in a few weeks I wanted to look good right now.",
      "MessageIndex": 4,
      "PostDate": "29/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/745974",
      "Title": "When were you able to drive etc after surgery? cleomoon mollyann"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Jan 4, 2010 09:21PM Issymom wrote: I sent you a private message (PM)",
      "MessageIndex": 5,
      "PostDate": "04/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/746257",
      "Title": "Questions to ask Iamstronger Issymom"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Jan 4, 2010 08:43PM Issymom wrote: Don't spend time googling Breast Cancer as most likely it will not be cancer.  If, unfortunately, it is you will have the information from the pathology report to base your research on.  There are so many different facets to breast cancer that play into treatment, etc... that it is not a good idea to worry about something that may not apply to you. I found the biopsy interesting (I didn't feel a thing).  It was an Ultasound guided biopsy so I got to watch the entire thing.  I asked most of my questions after he was done.  He also showed me the samples which helped me understand what was really going on inside.  They won't tell you much and shouldn't because they really can't tell.  Good luck and hope you don't have to become a full fledged member of this group.  By the way, you are fortunate to be able to get your results back in 2 days.  The waiting is the worst thing.",
      "MessageIndex": 3,
      "PostDate": "04/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/746257",
      "Title": "Questions to ask Iamstronger Issymom"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Dec 11, 2009 12:19AM Issymom wrote: I was diagnosed a month ago with Stage I (7mm) BC.  Then found out I has TN and BRACA1+  Seems like one new set of negative news after another.  I had a Bilateral MX on the 4th of december.  It went well I feel pretty good.  I finally got my pathology report today and every thing is clear (no new cancer in breasts or lymph nodes), however, my original tumor is 2.5cm vs. 7mm as orginally diagnosed a month ago.  Even when they knew it was there no doctor chould feel my 2.5 cm tumor, amazing.  This puts me at Stage II and will change my chemo.  I will be meeting with my oncologist next week to see what is next.  I am part of the group!!!",
      "MessageIndex": 195,
      "PostDate": "11/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Mar 23, 2011 05:20PM Issymom wrote: Yan, I too have followed your story since i joined bc.org last year.  Your love and support for Olga was beautiful.  I am SO sorry for your loss.  I can't imagine how you must feel.  You had wonderful times together and built a wonderful family that carry you through these difficult days. You are in all of our thoughts and prayers.",
      "MessageIndex": 16,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766537",
      "Title": "Olga Simkin Z\"L leprechaun Bestbird"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Feb 5, 2010 09:29AM Issymom wrote: If you think about it, let me know what Dr Calhoun says.  I won't be having the surgery until June or so and am still looking at options, just in case.  My onc thinks I should just do the oomph as the uterus has a purpose and holds other parts in place but my friend said that is not a worry.  It's easier when the doc says \"you have to do _____\".  Choices are good but difficult.  I had such a hard time making the decision to have the Bi-lat when I found out about the BRCA1+.  Now it seems like such an obvious decision.",
      "MessageIndex": 11,
      "PostDate": "05/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/747524",
      "Title": "BCR1 gene KristaMay sarikasd"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Feb 4, 2010 07:59PM Issymom wrote: I had a bi-lat mastectomy in early December.  I was diagnosed with Triple Negative BC and then found out I was BRCA1+.  Didn't want to go through this again.  The surgery wasn't bad and I was driving, etc.. after 5 days.  I did delayed reconstruction as my BS and PS were adamant that I do them seperately.  This is different from what most people do but they are the top doctors in their field in Washington and so I trust them.  Manage one thing at a time. My sister (turning 40 in a month) found out last week that she is BRCA1+ as well.  Bummer.  She is definately having a hysterectomy but I think she will start with surveillance of the breast (assuming her first mammo/mri is OK - she hasn't had one yet).  Interestingly, I met with my BS today for a follow-up and I mentioned my sister and her decision.  He shocked me by saying that is not what he would do.  I was shocked because he is usually careful to say it is our decision, here are the facts.  I guess since she was not there and is not a patient he felt he could express his opinion.  I really appreciated his candidness.  The reason for his opinion is that recently, he has had 2 patients who are BRCA+ and have known it but did not prophylateclly remove their breast and now bone and/or lung mets.  He feels their Stage IV cancer was avoidable and just so sad.  At the end of our appointment he gave me a hug.  I was touched.  I will talk to my sister in a little while about his thoughts. Good luck to you Krista.  It will not be fun but it is so much better than Cancer.",
      "MessageIndex": 7,
      "PostDate": "04/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/747524",
      "Title": "BCR1 gene KristaMay sarikasd"
    },
    {
      "AuthorID": "Issymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92689/profile",
      "Content": "Feb 5, 2010 09:05AM Issymom wrote: Anacortes Girl - We have chosen a hysterectomy over the oomph so that there is one less thing to go wrong with our bodies.  I spoke to a very good friend who is one the top Gyn in Seattle and that is her recommendation.  She said the risks of complications (prolapse....) is so little that this is what she would do herself (that says a lot to me).  My body is doing things I didn't expect so there will be one less thing to worry about.  It is a personal choice. Most people don't have complications doing both together but when the PS described how we are removing our own tissue which is traumatic and then putting in a foreign substance, I realized lots can go wrong.  Also, the reconstruction surgery (implants for me) is much less of a big deal.  I will be asleep and given a local nerve block instead of the general anesthetia.  Sounds better to me.",
      "MessageIndex": 9,
      "PostDate": "05/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/747524",
      "Title": "BCR1 gene KristaMay sarikasd"
    }
  ]
}