{
  "AuthorID": "Issymommaof4",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180677/profile",
  "Posts": [{
    "AuthorID": "Issymommaof4",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180677/profile",
    "Content": "Issymommaof4 wrote: Anyone have a similar situation, and what were the results? I have a mass on the outer quadrant of my left breast, toward my armpit. Also, there is \"thickening\" above the breast (collarbone area) and I can feel swollen lymph nodes in the armpit. I am 31, have four children, and an extensive family history of BC on maternal and paternal sides (including two aunts diagnosed in early forties). This is also the breast that I had a very hard time breastfeeding my last two babies from (ages 3 and 22 months now)- it never produced enough milk (when I would pump, I would only get 1-2 ounces, the right side produced 4-6 ounces easily), and my last baby never liked to nurse on that side. I have very small breasts, but my left has always been very small. I call it my sad little boob- it has always been smaller than my right. At one point I would wear a \"filler\" in my bra to even out the appearance. Backstory: Before I found out I was pregnant with #3, I felt a small lump in my left breast. Went to Gyn, she felt it, and I had an US, which showed nothing. ( I have very small breasts- I can't even fill out a 32 A bra). A week later I found out I was pregnant, so I dismissed it due to that. The past 3 years have been insane- baby 3 was born with a serious heart defect, has had several open heart surgeries, I had a \"surprise\" baby #4 in the middle of it all, moved across the country, and my hubby went back to school full time and I went back to worl full time. Life has been crazy! SO, 2 weeks ago I was putting on a new bra, and noticed that my sad little left boob was not my little left boob anymore, it was larger than my right. (Of course its still small, but it is bigger than the right) Hmm. Got in the shower, felt around, noticed the mass from 3 years ago feels a lot bigger, extending toward my armpit.. And I feel another mass under/behind nipple (fairly deep). Also noticed left armpit is more swollen than right, and feels lumpier. There is also visible thickening above the breast on my collarbone. Scheduled an appointment the next day with my Gyn (needed my annual pap anyway). Gyn felt the mass, and arranged an ultrasound and mammogram. Of course, they couldn't see anything. ( I would love to see the mammogram- I seriously have almost no breast tissue, she had such a hard time \"smashing\" them!). The doctor was telling me they can't see it, I have very dense tissue, lets wait and see if it gets bigger. Well, I wasn't okay with that. I told her that has gotten a lot bigger, and is definitely NOT normal for me- I had her feel my left breast versus my right, very different feeling. She scheduled me with the NP for the breast surgeon that afternoon. NP felt MRI would be the next best diagnostic tool. So now I am waiting for that to happen, this Friday. Also, I have lost a dramatic amount of weight over the last 3 months. I have gone from 117 lbs, to 102. I have been very tired for the last year. I also sweat a lot now - I never used to. Deodorant doesn't cut it. Blood tests come up clear, always. Thyroid is fine, Vitamin D is fine, iron is fine. My primary dr has chalked it up to depression, I've been on meds (not helpful), but fatigue persists. Now the weight loss, and the mass, and I'm freaking out a bit. I have been reading on other possible causes of breast lumps, but none of the possibilities match the way my lump is presenting. It is not a \"hard\" ball- It can move a bit, more rubbery, not a distinct round shape, more of a pebbly texture around it. So I have read about how other cancers present, and what cancers typically are difficult to diagnose on US/Mammo. ILC fits- too well, really. I am scared- and wonder if anyone else has experienced anything remotely similar. Did something not show up on on mammo/US that did show up on MRI, and what was it? Has anyone had fatigue, weight loss, sweating prior to dx? It is relatively large- I would say maybe walnut sized? Also, I'm wondering if what they think is dense breast tissue, is actually a mass, because almost all there is to my left boob is this mass. They didn't US my right breast at all, only my left, and only where I felt one mass, not the other, and not my armpit or collarbone area (where the thickening is). I don't know, any insight at all would be great. Thank you! Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "04/06/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/805686",
    "Title": "Any experience? Mass not visible on US/Mammo- waiting for MRI Issymommaof4 scaredmum"
  }]
}