{
  "AuthorID": "IsThisForRe…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
  "Posts": [
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Sep 17, 2011 08:54PM IsThisForReal wrote: Hi Ladies, I haven't posted for awhile but things were coming along just fine, had one drain removed even.  Tuesday morning I woke up feeling extremely weak and almost collapsed.  I was admitted into the hospital where I stayed until Friday.  The left incision site was extremely painful, wbc's off the charts, rbc's low.  Obviously an infection which they were giving me IV antiobics for.  Thursday my fever broke, and wbc's 'normalized' so I was allowed to come home with oral antibiotics.  Hopefully I am on the mend.",
      "MessageIndex": 625,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Aug 13, 2012 05:25PM IsThisForReal wrote:",
      "MessageIndex": 877,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Aug 16, 2011 07:20AM - edited Aug 16, 2011 07:24AM by IsThisForReal Sending prayers and warm thoughts to BlondeLawyer, RangerMom and FLWarrior today.  Thinking of you a lot, and plz keep us updated as to how you are doing when you are able.  ((hugs))",
      "MessageIndex": 188,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Aug 26, 2011 06:16PM IsThisForReal wrote:",
      "MessageIndex": 323,
      "PostDate": "26/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Aug 28, 2011 05:35PM IsThisForReal wrote: Good afternoon Ladies, I seem to have run across something a little different today with my left drain.  The bulb kept inflating this morning and I couldn't figure out why.  It turns out, it is sucking air at the drain site.  I managed to doctor it up by taping it securely to my chest.  I'll be keeping an eye on that, as well as empying the drains often.  Everything else looks alright, considering.  Thoughts and prayers to those having surgery next week.",
      "MessageIndex": 346,
      "PostDate": "28/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Aug 11, 2014 04:54PM - edited Aug 11, 2014 04:55PM by IsThisForReal It's been 3 years already??  Boy, time does go fast, doesn't it! We switched over to Femera from Tamoxifen in May when I was diagnosed with lung ca.  Not mets, a new primary.  Love the femera, seems like few side effects if any...unlike the tamox. Chemo ends middle of Sept. for me then I believe I have rads again. This chemo is much easier for me to tolerate, although I'm told this is a much tougher regime.   I have very high hopes I will come out of this ok, as I have so far with the breast cancer.   Dixiebell - thinking of you and sending prayers. ((Hugs)) Ladies!!",
      "MessageIndex": 895,
      "PostDate": "11/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Aug 15, 2011 03:21PM IsThisForReal wrote: Ladies, can you add me to your list?  I'm having BLM on Aug. 24th, skin sparing.  Can anyone tell me what to expect afterward?",
      "MessageIndex": 175,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Aug 26, 2011 02:00PM - edited Aug 26, 2011 02:02PM by IsThisForReal It's amazing what I've missed in the last few days on this thread.  My prayers going out to those still struggling.  Healing thoughts going out to those still healing.  I honestly have to say I've not had a bad time of it at all!  Pain levels are about a 3, so I take something at bedtime for it to ensure a good rest.  My power port was removed at the same time, and I have more pain there, believe it or not! I stayed in the hospital overnight and was out the next morning.  I'm draining alot (over 100cc daily on the right side), so it'll probably be a while until they can come out.  Insicions look awesome and the surgeon 'spared' my tattoo!    I'm quite bruised and sore from the bruising, but as long as I stretch every now and then it seems alright.  Bonus, my back is not nearly as sore as it used to be.  That I noticed right away.  I'm already wearing a very loose mast. bra with foam padding and that seems alright.  So far it looks like I'm concave but the nurses have said all that will change as I heal.  I can't say I like the concave look, but hopefully it fills in better as the nurses said. I don't have the path. report yet, but will get that when I go in for my checkup.  ",
      "MessageIndex": 314,
      "PostDate": "26/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Aug 22, 2011 04:01PM IsThisForReal wrote: Thank you so much, Rockym.  Wednesday is coming up fast and I have to say I am 'almost' looking forward to it.  I still can't believe I'll have an 80% less chance of recurrance with PMX's.  That's just incredible and anything to avoid chemo and local recurrence sounds good to me.  I'm thinking of the other ladies having Sx this week, and sending warm thoughts.  Also to those healing, thank you for posting your experiences and may you heal very quickly. I'm hoping to be able to start posting my experience on this thread for others as early as Thursday when I return home, or Friday.  I know the information shared is so valueable to me, and I hope to be able to give to someone else.   Cheryl ",
      "MessageIndex": 258,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Oct 26, 2010 05:40PM IsThisForReal wrote: I just wanted to share this experience - yesterday I went to the grocery store and was asked to donate $1. toward BC. Sure, I said, and then asked how much of the $1. actually goes to research. The teller told me it was....hang on....2 cents. 2 cents??? You've got to be kidding me - needless to say I didn't donate as I'd rather donate directly to research in that case. Oh, and I sure got an eye opener in one of the hardware stores...they had a pink display so I went to check it out. Waterbottles, mugs, icescrapers, mitts, you name it. Companies are making a pile of money off of our misfortune and it's really starting to pi** me off! Talk about comercialized - I think I will post something to this effect on my facebook status, as a matter of fact. It's good to make people aware, after all.",
      "MessageIndex": 85,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/759281",
      "Title": "My pink problem Melinda41 daffodil45"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Dec 1, 2009 02:02PM IsThisForReal wrote: Thank you so much for your replies.  It defitely helps to know we are not alone in this and helps to set my mind at ease knowing this is a 'normal' (for lack of better words) course of action.  Lisa - your support is so greatly appreciatted at this time.  Thank you so much.  ",
      "MessageIndex": 4,
      "PostDate": "01/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/744624",
      "Title": "Not sure what to think here.... IsThisForReal IsThisForReal"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Sep 30, 2010 09:17PM IsThisForReal wrote:",
      "MessageIndex": 15,
      "PostDate": "30/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758695",
      "Title": "An Apology with a Twist.... Lowrider54 debbie6122"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Jan 13, 2010 01:20PM IsThisForReal wrote: Thank you for responding Claire.  I was told initially by my family Dr. and Surgeon that risk of recurrance increases approx 1 -2 % with a lumpectomy.  The survival rate is the same, but risk of recurrance is slightly higher.  I'd love to keep my breast, however, if my risk decreases by losing it, and I have some peace of mind, then that will have to be the way to go. There was only the one tumor in my breast, which is why lumpectomy with auxillary disection was an option. My margins were clear also, it's the darn recurrance thing that ges to me.  I do not want to have to go through this again if at all possible.  Also, I wouldn't have chosen the lumpectomy if the MRI would have shown enlarged lymph nodes, which it didn't. I agree the real danger is METS, and for that chemo is in order.   Thanks for your suggestions of exercise for sleep and whatnot, but I am already back on my treadmill.  I was able to go for an hour yesterday and today, and have been doing approx 1/2 hour about 4 days prior.  I would consider walking outside, but, I live in Canada.   Anyone else out there have a mastectomy after lumpectomy?",
      "MessageIndex": 2,
      "PostDate": "13/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746710",
      "Title": "Lumpectomy vs. Mastectomy IsThisForReal IsThisForReal"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Jan 15, 2010 07:42PM IsThisForReal wrote: Thank you ladies for your responses.  I spoke with my family Dr as well as the surgeon about this.  They were both incredible.  The surgeon will do a mastectomy if I choose, BUT, not right now.  She has indicated she will wait for chemo and radiation to be over with first.  I have to say that I agree with her as well as you with this.  I totally understand the thing to do now is go after any stray cancer cells now.  I am still not sure if I am comfortable keeping the breast or not, but,  I have time to gather my information and really really weigh it now. I am thankful to be given the opportunity to have further surgery if we find any benifit to it.  She also said if I just plain felt uncomfortable and was in fear of recurrance she would do it.  (I know, we all think about recurrance). That is reassuring this is an option.  Not a decision I take lightly.   I have to wonder how recurrances are tracked exactly....is it tracked for 5 years?  Or would it be tracked for 3 years if a woman was in year 2 since the original diagnosis?    These are questions I'll have to write down and talk to my Onc once I meet him too.   What a crazy whirlwind....I don't even know what else to say.... I just found out I am ER+/PR+ and HER2+ also.  Did everyone else get their path in bits and pieces, or am I just lucky that way ;-I",
      "MessageIndex": 7,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746710",
      "Title": "Lumpectomy vs. Mastectomy IsThisForReal IsThisForReal"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Jul 30, 2010 11:35AM IsThisForReal wrote: Beesie - I am in Saskatchewan and recieving Tx there.  Also, my path report said I had extensive DCIS to the same breast.  I am now finished the TCH regime and am starting rads next week.  In the meantime, my family Dr. has referred me back to my Surgeon so I will be able to discuss it with her further.  Thing is, if I have a local recurrance, I'm not sure if I could forgive myself for not doing everything possible to prevent that.  Know what I mean?",
      "MessageIndex": 20,
      "PostDate": "30/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746710",
      "Title": "Lumpectomy vs. Mastectomy IsThisForReal IsThisForReal"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Aug 13, 2012 03:46PM IsThisForReal wrote: Hi Ladies, I just wanted to conclude by letting you know I did have my BLM, and it was truly the right decision for me.  There is definitely a lot more peace of mind in regards to local recurrance.  Thanks to all for being there.  :)",
      "MessageIndex": 22,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746710",
      "Title": "Lumpectomy vs. Mastectomy IsThisForReal IsThisForReal"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "May 16, 2010 04:28PM IsThisForReal wrote: Sorry for taking such a long time to get back here. Alot has gone on since my original post - I will bring you up to date... Getting into see an Onc was an absolute nightmare.  I had to access our local and provincial health minister in order to get in.  The cancer clinic kept putting me off....long story short, my chemo of TCH started either 10 or 11 weeks after surgery (I can't recall exactly at this moment). In the meantime, I am ER+ at 100%, PR+ at 50%, and of course HER2+++.  Oh, and apparently I had DCIS also. Onc told me I am high risk.  No surprise.  Risk of recurrance in the affected breast is 25 - 33%.  That's pretty high.  The other breast is high risk for new or recurring cancer also.   I totally understand it is mets that I have to worry about...unfortunately.  But, the thing I can't get out of my mind is...there will be no screening after tx...a mammo once a year, that's it.  And if the cancer returns in the breast and isn't caught...then what?  Or if it is caught and has mutated further so that chemo/herceptin doesn't work...then what?  I can't do anything about mets other than exercize/diet, but this I can control.  I'd say a risk of 33% is pretty signifcant.  Wouldn't you? My Onc told me she could reduce my risk to 15%...that's 150% over a 10 year period. In light of this information - I've decided to have a BLM.  I don't want to deal with local recurrance if at all possible - heck - I don't want to deal with mets either but I don't control that. Cancer sucks, but, on the bright side, if I'm very lucky the chemo/herceptin will wipe it out.   You ladies are so supportive and a wealth of information - I am so thankful I found this site!!",
      "MessageIndex": 18,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746710",
      "Title": "Lumpectomy vs. Mastectomy IsThisForReal IsThisForReal"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Aug 9, 2010 08:49PM - edited Aug 9, 2010 08:50PM by IsThisForReal 46",
      "MessageIndex": 536,
      "PostDate": "09/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Mar 14, 2014 11:43AM IsThisForReal wrote: Well, I'm officially scared beyond scared. I wasn't feeling well last week and went to the Dr. with a fever. Antibiotics. Then this Wed went back and he did some more tests and changed antibiotics. Still fevered. The Dr. called me tonight and it appears there might be a nodule on the upper left lobe of my lung, so he's sending me for an emergency CT scan tomorrow. Has anyone else dealt with this? My Dr said he's hoping it's scaring...I'm so upset.",
      "MessageIndex": 2205,
      "PostDate": "14/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Oct 16, 2010 04:22PM IsThisForReal wrote: Praying for you BCMom. ",
      "MessageIndex": 36,
      "PostDate": "16/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759423",
      "Title": "May God Bless BCMomOf3 heatherbless BarbaraA"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Jan 25, 2013 11:37AM - edited Jan 25, 2013 11:39AM by IsThisForReal Hi ladies, I have a question I am hoping you can answer.  Two months ago, I developed a lump on my upper hip.  My GP assessed it and stated it was probably a lipoma, but wanted to do an ultrasound.  Well, I finally had the ultrasound yesterday, and they were completely baffled as nothing unusual showed up, even though the lump is clearly visible.  The Ultrasound tech marked it, and even called in the radiologist.  He was even baffled.  Anyway, they found nothing and the lump was quite sore last night from the pressure exerted during the ultrasound.  Not that they were rough, not by any means.   It does give me pain when trying to walk on the treadmill, while sitting, and does ache.  Anyway, I'm wondering if ultrasounds will even pick up bone mets, and if this could indeed be mets?   I see my Dr. again on Tues. but am becoming quite anxious about this. Thanks for any info you can share.  :)",
      "MessageIndex": 1058,
      "PostDate": "25/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Jan 26, 2013 06:54AM IsThisForReal wrote: bump",
      "MessageIndex": 1060,
      "PostDate": "26/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Jan 26, 2013 12:47PM IsThisForReal wrote: Thank you blainejennifer for your response and advice, I appreciate it very much.  I will most definitely requesting an xray for starters, and will go on from there if nothing shows on that one.",
      "MessageIndex": 1067,
      "PostDate": "26/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Sep 27, 2010 08:03PM IsThisForReal wrote: I'm also hoping my nodes were doing their job.  I was diagnosed in Nov 09, have gone thru sx (lumpectomy), chemo, rads, and am on tamox.  I just finished rads less than 2 weeks ago, and I was told even if I had a mx they would have still recommended rads due to being highly triple positive. They also radiated the supraclavicular nodes, just to be on the safe side. I had 2/12 nodes pos.  Am doing herceptin until March and am waiting, waiting, for a bmx.  So far everything has gone quite well, but have developed a throat/ear infection right after rads which I am on my 2nd round of antibiotics for.  They weren't going to do any additional scans for me either, but I asked for a baseline so they did a bone scan, and abd scan in addition to my chest xrays and mri. I don't post much, but read daily.  Have to say this thread is a very positve and informational experience!  ",
      "MessageIndex": 715,
      "PostDate": "27/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Aug 9, 2011 05:23PM IsThisForReal wrote: Sending thoughts and prayers, Glenna.  I hope it's ok.  Please keep us informed.",
      "MessageIndex": 1316,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Oct 26, 2010 06:54PM IsThisForReal wrote: Thought I'd share my quit smoking plan.... I've been trying patches, gum, cutting back and nothing is helping.  However, I did quit with Champix before, and so I've started that again today!  Next Tuesday will be my official quit date - wish me luck ladies!!",
      "MessageIndex": 728,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Mar 14, 2014 02:04PM IsThisForReal wrote: Ladies, thank you so much for your encouragement.  I had no idea that nodules were even common.  I didn't use Dr. Google to research anything, but came straight here instead.  You've helped ease my mind and I will keep you updated.  Thanks again for sharing your wonderful wisdom with me. ((hugs))",
      "MessageIndex": 2209,
      "PostDate": "14/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Dec 16, 2010 10:12PM IsThisForReal wrote: Barbe - I know what you're saying about slipping between the cracks!  I was 'this' close.  They triaged my file incorrectly and apparently it was going to be a loooong wait for me to start tx.  A person always has to be diligent about their care, and I'm so thankful for the internet and this website or I may not have realized how aggressive HER2+++ can be, and may not have pushed the system.  Knowledge is power ladies.",
      "MessageIndex": 14,
      "PostDate": "16/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762100",
      "Title": "Stage 1 and Mets mari65 barbe1958"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Sep 28, 2010 10:29PM IsThisForReal wrote: *big grouphug*",
      "MessageIndex": 95,
      "PostDate": "28/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758318",
      "Title": "Remission or \"cured\"? Halah wobbly"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Sep 29, 2010 10:13AM IsThisForReal wrote:",
      "MessageIndex": 82,
      "PostDate": "29/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758318",
      "Title": "Remission or \"cured\"? Halah wobbly"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Jul 29, 2010 10:48PM IsThisForReal wrote: I have no answers Debbi - but here's a bump for you. ",
      "MessageIndex": 1,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/756045",
      "Title": "Does anyone have a \"fluib\"? willy2351 worldwatcher"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Sep 29, 2010 10:16AM IsThisForReal wrote:",
      "MessageIndex": 83,
      "PostDate": "29/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758318",
      "Title": "Remission or \"cured\"? Halah wobbly"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Jul 1, 2010 12:01PM IsThisForReal wrote:",
      "MessageIndex": 494,
      "PostDate": "01/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Jun 7, 2010 07:31PM IsThisForReal wrote: My thoughts and prayers are with you Hope.  Please keep us updated.  (((hugs)))",
      "MessageIndex": 455,
      "PostDate": "07/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "IsThisForRe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93735/profile",
      "Content": "Jun 27, 2010 04:17PM - edited Jun 27, 2010 04:18PM by IsThisForReal",
      "MessageIndex": 478,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    }
  ]
}