{
  "AuthorID": "Isy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
  "Posts": [
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jul 17, 2015 04:48AM Isy wrote: My goodness Woody you have been through some really scary times but what an amazing outcome!! So pleased for you and long may it continue. before I had the HER2 test my MO said \"I would love for you to be positive\" as that very week they had authorised a new treatment in Australia for HER2+ and it had proved very successful, sadly for me it wasn't the case. He did actually call me this evening to see how I was going one week post treatment. impressed with that service (didn't get that in England!). He sounded even tierder than I was too. Discussed the tingling fingers with him and he said exactly as you said, and that hopefully it would resolve over the next few days. It's freezing here too which doesn't help numb fingers and toes! Enjoy your weekend everyon",
      "MessageIndex": 2094,
      "PostDate": "17/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Aug 21, 2015 06:37PM Isy wrote: Hi Woody, was thinking of you I remember you said your next scan was in August, have you had it yet? Hope everything continues to be good. Janey, I'm a new metster myself so don't have any experiences to describe. But you're right, the ladies on here are so knowledgeable, someone will be along to reassure you, that there are plenty more treatments to try but from what I've read here navelbine has been good for a lot of people. I'm doing fine EXCEPT peripheral neuropathy is getting quite bad and not improving between treatments. Onc seems more worried about that than my liver at the moment! So he reduced my last dose by 25%, he had put me on a large dose, and see if it improves. Am also going to try some B6 and B12 supplements which are supposed to help. All the best to everyone from Oz (spring finally on its way) ",
      "MessageIndex": 2205,
      "PostDate": "21/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Sep 19, 2015 12:20AM Isy wrote: So I need to rap myself on the knuckles and tell myself to stop being such a wimp. Have just spent the last few days reading this thread from the start and some of what you ladies have been through (and still going through) with such hope, faith,humility and humour is awe inspiring. There was I feeling ready to give up after the first chemo failed makes me feel quite pathetic!! Reading about your journeys and having a good long talk with my onc has given me renewed vigour and hope. He told me he is in it for the long haul with me. He said that in his experience it is often the third chemo that is found to be the magic potion and basically told me to hang in there. He goes more on clinical presentation rather than CT scans and simply can't reconcile the fact that I look and feel so good, bloods are all good and yet the scan looked disastrous. So we have scheduled a PET scan for next week to get a better idea of the activity in there and in the meantime have started with the gemcarbo combo two weeks on one week off. Feeling great today as steroids kicking in. Chemo nurse told me to get plenty of iron in my diet to fight off anaemia so stocked up with Guinness, spinach and liver! Thanks to all you lovely ladies and here's to supporting each other for years to come! ",
      "MessageIndex": 2255,
      "PostDate": "19/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Sep 21, 2015 07:57AM Isy wrote: thanks Shetland. It would be lovely if all those mets were dying but after only four treatments it's unlikely don't you think? Doc also said something about checking for any activity in areas outside the liver. Now that is scary. Fear of the unknown again. Sometimes I think I'd rather not know. I'm also in the scanner on Wednesday Moni though maybe in different time zones. Where are you? Hope it goes well. Will report back. Hope you sleep better tonight Woody. Xx",
      "MessageIndex": 2266,
      "PostDate": "21/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Sep 24, 2015 09:59PM Isy wrote: in the waiting room moni.",
      "MessageIndex": 2280,
      "PostDate": "24/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Nov 6, 2015 12:21AM Isy wrote:",
      "MessageIndex": 2427,
      "PostDate": "06/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Dec 7, 2015 05:04PM Isy wrote: funny that - mine exploded too - on Abraxane. Onc likened it to someone throwing a pile of gravel in there and it just splattered everywhere. Seems like current treatment is clearing up the rubble. Yours will too",
      "MessageIndex": 2562,
      "PostDate": "07/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Dec 24, 2015 02:12AM Isy wrote: Nancy, so sorry to hear what you are going through at the moment but the liver truly is an amazing thing and the fact that your liver function is still good is surely a sign that there's hope yet. It is so hard at this time of year. I used to LOVE Christmas but frankly I can't wait for it to be over. Everyone is out enjoying themselves and I have that little voice at the back (and front) of my mind saying \"is this the last one?\". Trying to stay upbeat and thinking of all you lovely ladies that there's plenty of Christmases in us All yet!",
      "MessageIndex": 2600,
      "PostDate": "24/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Feb 12, 2016 07:39AM Isy wrote: Kaayborg, I had bone scan when first diagnosed back in June but since then only CT scans like you, after every three rounds of chemo. Nothing showed on CT scans and no symptoms. I think onc just thought it was worth doing the full scans this time, so had brain CT as well which I don't normally have.",
      "MessageIndex": 2733,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Feb 23, 2016 11:24PM Isy wrote: Many happy returns leftfoot",
      "MessageIndex": 2792,
      "PostDate": "23/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 13, 2016 12:48AM Isy wrote:",
      "MessageIndex": 2897,
      "PostDate": "13/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 24, 2016 02:34AM Isy wrote: great news Woody. Happy dancing from down under too!",
      "MessageIndex": 3034,
      "PostDate": "24/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Apr 7, 2016 12:42AM Isy wrote: I really feel for you Mattie. Juggling work and cancer is not easy. Especially when you go out of your way to accommodate them and then they make stuff ups without any regard to what is going in your life! So I specifically ask for my scans to be on Thursday cos I teach on Wednesdays and what do I get? An appointment for Wednesday. Grrr,deep breath...",
      "MessageIndex": 3138,
      "PostDate": "07/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Apr 16, 2016 08:02PM Isy wrote: Lvin, I'm another one with mixed results. Some growth, some shrinkage. It's because our stage cancer is very heterogeneous (thank you spell checker!) and unfortunately nothing out there at the moment is a one size fits all. And as I suspected mine has now progressed into bones, one rib and two spots on pelvis, so time to move on. I was given the choice of Xeloda or Eribulin and choose Xeloda simply because I felt I'm not ready to risk losing my hair again so soon after getting a full set of curls back. So I'm on to pill popping and watching out for my hands and feet. There is a worldwide trial going on at the moment, targeted therapies for HER2 neg which we have in Australia, so Onc is looking into that for me too. Let me know how you go on the Eribulin Livin as it looks like that will be next for me. Hugs to all",
      "MessageIndex": 3222,
      "PostDate": "16/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jul 13, 2015 04:39AM Isy wrote: Woody you are such a tonic - your kind words made me feel better than the endone tablet I had earlier on. (My painkiller of choice and seems to take the edge off the bad thoughts). They should bottle what you are giving out and sell to everyone going for treatment! At the moment for me it is just a waiting game and trying to adjust to this new way of life. Thank you so much for your heartfelt response to a complete stranger on the other side of the world",
      "MessageIndex": 2071,
      "PostDate": "13/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jul 13, 2015 06:53PM Isy wrote: springwatch, thanks for the links, really useful, the more info we can get the more empowered we feel to take some ownership of what's happening to us. The area of being weakly positive to hormones is quite a contentious area with quite different schools of thought on the cut off points. Was really interested to see in bestbird's amazing resource that even letting a sample sit around for too long in the lab can affect results. Onc is quite open to further biopsy down the track. Scalp is starting to itch - I know what that means, off to buy myself a stunning wig. Love to all",
      "MessageIndex": 2075,
      "PostDate": "13/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Aug 11, 2015 05:21AM Isy wrote: Ella, very best of luck with your appointment on Thursday, it could be the future for all of us and you're the pioneer! Great to hear that you're out of the nasty dark place too, it's great to have something new to focus on. look forward to hearing all about it. Hugs.",
      "MessageIndex": 2191,
      "PostDate": "11/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Sep 11, 2015 12:53AM Isy wrote: oh no, more bad news. Had my first CT scan after just three treatments of Abraxane. The chemo has not worked at all (except to give me neuropathy!!), new spots in the liver \"too many to count\". Was expecting the treatment today but doc is taking a week out to consider new treatment for me or possibility of a trial. So disappointed, everything was pointing to the treatment working and they just can't explain to me why this has happened. In effect I've had NO treatment at all and tumours are just continuing to grow. May move on to gemcitabine and carboplatin but at the moment just thinking if Abraxane doesn't work, whose to say anything will? Docs had such high hopes for it. Therefore so did I. Continue to feel well physically but very down in my head. Need some words of wisdom/encouragement from you lovely ladies please",
      "MessageIndex": 2243,
      "PostDate": "11/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Sep 11, 2015 02:04AM Isy wrote: Sandilee and Woody, thanks so much for your replies. Should update my profile, my liver tumours were biopsied and have changed to more or less triple neg now so no hormone treatment and I think that's why the gem carbo combo is being mooted as it has proved successful for triple neg. I was having Abraxane every three weeks so basically have had nine weeks with effectively no treatment and now waiting another week. Only consolation is that my bloods are good, kidney function good and liver function \"not bad\". CA markers had slowly been coming down too. No-one seems to be able to understand why there is still progression but as you say Woody, stage 4 very unpredictable. Hate it!",
      "MessageIndex": 2246,
      "PostDate": "11/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Sep 12, 2015 07:09AM Isy wrote: hi shetlandpony, I will ask about chemo sensitivity test though it seems a lot of centres don't offer it as it's not thought to be too reliable. However it would be nice not to have to go through another 9 weeks of treatment that's doing nothing! See Onc next Friday to find out about next step. Hugsto all,",
      "MessageIndex": 2249,
      "PostDate": "12/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Sep 20, 2015 06:21AM Isy wrote: hi Woody, thanks for your words of wisdom as usual. Will keep a close watch on things like you say. Your post full of typos, not like you at all. Wondered what you were doing when you wrote it lol! Really enjoyed the Guinness though. First drink for three months. Welcome to this thread Moni. I'm also quite new to this lark so can't offer any advice on the treatment you're getting but there will be others on here soon enough who are full of knowledge and wisdom. So what's the translation of your Latin quotation? Can anyone enlighten me on what is likely to show up on PET scan I'm having this week, as opposed to the CT Ihad recently? Nerves are starting to build up again. Have a good week everyone. My sis is staying with me from England and it's been great doing loads of catching up and just chilling. Luckily I've been feeling good and we've managed to get some good days out. Xx",
      "MessageIndex": 2261,
      "PostDate": "20/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Sep 22, 2015 11:29PM Isy wrote: Moni, yeah it's all over now but was in the waiting room when I saw your post. Managed to get quite a good sleep waiting for the contrast to kick in! Should get results Friday. Good luck with yours",
      "MessageIndex": 2274,
      "PostDate": "22/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Sep 25, 2015 02:28AM Isy wrote: definitely the waiting room is worse - and getting calls like you did Monica! If only they could give you some idea",
      "MessageIndex": 2282,
      "PostDate": "25/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Sep 29, 2015 02:30AM Isy wrote: Freebird, so sorry for what you're going through at the moment but sounds like you've had so much love surrounding you in your life and I'm sure that will help you through. Sending warm thoughts to you and everyone else on here who is going through difficult times right now. Xx",
      "MessageIndex": 2302,
      "PostDate": "29/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Oct 15, 2015 05:25PM Isy wrote: Morning AussieSheila, from a fellow Aussie. I'm in Torquay, on Victorian Surfcoast not far from Melbourne. luckily we have a large regional hospital in Geelong, about 20 mins away that has a large cancer centre. I usually get to see the same onc. Though the waiting times can be horrendous. Must be hard for you to see different people all the time but you are still here and sounds like your keeping your spirits up. Where exactly are you? We lived in Townsville for couple of years. but it was way too hot and humid. Nice and cool down here. I love this forum and find it so much better than the BCNA which is really hard to find your way around and it's always interesting to Learn of the different treatments and protocols from our mostly american sisters. feels like we're missing out sometimes. Left foot best of luck with your scans today",
      "MessageIndex": 2344,
      "PostDate": "15/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Nov 6, 2015 10:39PM Isy wrote: Hi Debic like Woody my liver mets also caused digestive problems, bloating, diarrhoea loss of appetite etc and it was those symptoms that took me to the doctor initially. The symptoms persisted with my first chemo Abraxane which is known to cause stomach upsets but it didn't work for me anyway so now on gem/carbo combo which has cleared the bowel problems. Our bodies often have a funny way of showing us there is something wrong and without those symptoms I'd probably be sitting here blissfully unaware that the nasty C was growing inside me. If you read through this thread you'll see there's loads of options and lots of people doing really well with liver mets. All the best to you whatever you decide",
      "MessageIndex": 2439,
      "PostDate": "06/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Nov 28, 2015 10:39PM Isy wrote: lovely to be recipient of a happy dance at last so thank you! Interesting to see how we all react so differently to the treatments. When I had my first chemo, Abraxane, was encouraged to read how successful it was for so many ladies on here. Onc told me it was the \"gold standard\" as well as telling me how expensive it was. He was certain it was going to work and so was I. Well. Not only did I really struggle with it, neuropathy from the word go, baldness, constant fuzzy head, weight loss, it actually grew my tumours. Onc now telling me that particular scan was 'horrendous'. Feeling so much more like myself now, putting on weight, hair growing back and fingers/toe returning to life. Here's hoping our bloods hold out for a good long time kaayborg!!",
      "MessageIndex": 2517,
      "PostDate": "28/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jan 1, 2016 06:33PM Isy wrote: and happy new year to all of you from a very hot and sunny Australia. Here's hoping for a safe, happy and healing 2016. Personally speaking things can only get better! Stephanie, thank you so much for your totally inspiring post. I read it several times, your wisdom and serenity shine through and it resonates with me some of your insights that I am slowly coming to realise. Intuition is something I am really tapping in to as I realise that this journey is highly personal and our docs simply don't have all the answers. Luckily my onc is very much a \"how do you feel?\" Doc rather than a \"let's look at your test results\" doc. And for those of us who led very busy and frantic lives previously, being able to rest and recuperate is one of the \"benefits\" of this new life. A wake-up call to slow down and smell the roses, or the ocean in my case. All the best to everyone you have all helped me so much. Hugs and love from the beachside, down under",
      "MessageIndex": 2620,
      "PostDate": "01/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 3, 2016 08:47PM Isy wrote: Support is right, I just don't know what I would have done without you guys on here and you are all so amazinglyknowledgeable. Over here in Oz the docs don't seem to like to tell us too much, and whilst we do get some choices in our care it's mostly taken out of our hands. Perhaps they feel we're too delicate to make decisions! So the outcome of my tests is that my liver is \"slightly irritated\" - see, not much technical info there. My liver function was spot on and blood counts border line so had chemo today. Thinking the \"irritation\" and nausea may be down to nsome new painkillers (naproxene) so going to try something else. Was nice to see a new junior doc today, apart from the unsettling fact that she looked about 12, was full of enthusiasm and new knowledge. She felt my liver was less lumpy and softer than last week so I'm taking that with me as a positive and put the \"irritation\" (I presume that means elevated enzymes) at the back of my mind. Hang on in there everyone and have a great weekend!!",
      "MessageIndex": 2838,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 22, 2016 01:23AM Isy wrote: Holeinone and MaryK, you are at the start of a massive learning journey. In a few weeks you will know almost as much as your docs about stage four. When I was first diagnosed I was all over the Internet trying to learn as much as I could and only ended up confused, overwhelmed and in despair at some of the (very out of date) statistics. However your best advocates are the ones on here that are going through it and that you can relate to you. I'm sure like me you will learn so much and feel energised at the positive stories and support you'll get. It's. It's not easy but I promise you it will get better over the next few weeks and months. Life goes on just in a different direction. All the best to you,",
      "MessageIndex": 3003,
      "PostDate": "22/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "May 6, 2016 01:11AM Isy wrote:",
      "MessageIndex": 3331,
      "PostDate": "06/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jun 3, 2016 12:25AM Isy wrote: Great news Babs! I will find out how Xeloda is going for me when I get scanned in a couple of weeks. Meanwhile bloods have all been good so fingers crossed I get good results too!",
      "MessageIndex": 3425,
      "PostDate": "03/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Aug 1, 2015 04:36AM Isy wrote: hi Debbie, great to see your post and to meet you. Our dx seem quite similar. My liver mets are more or less being classed as triple neg as ER status is less than 5% though different people seem to have different views on this. Hope I'll be doing as well as you a year from now",
      "MessageIndex": 2166,
      "PostDate": "01/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Aug 22, 2015 03:14AM Isy wrote: thanks woody I'll ask about cymbalta also. To be honest don't have much faith in vitamin supplements, they usually take a long time to make any difference. Does the cymbalta just mask the symptoms or does it actually repair nerve damage? Good luck next week I'll be thinking of you,",
      "MessageIndex": 2208,
      "PostDate": "22/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Oct 8, 2015 05:21PM Isy wrote: Leah, so sorry you had to cancel your trip. Hopefully you'll be able to reschedule when you get on top of things. I'm beginning to realise that TMs are totally inconsistent. When I started treatment mine where coming down nicely only to find after three treatments that I'd been progressing all along! I sometimes wonder what is the point of them at all?",
      "MessageIndex": 2332,
      "PostDate": "08/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Nov 27, 2015 05:24PM Isy wrote: Wow kaayborg, you're the Gem/carbo poster girl. Hope I get to follow you on that particular journey! did you have any issues with blood counts whilst on it? My neutrophils have been borderline last two treatments but the protocol here is just to delay for a few days and so far so good.. X",
      "MessageIndex": 2512,
      "PostDate": "27/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Feb 7, 2016 01:20AM Isy wrote: wonderful news chichimaine!! Never feel guilty, your good news makes us all feel good that there is hope that we can all follow in your footsteps. When I first started this mets journey over sixmonths ago now, I really thought that was it. Now with stories like yours and all the positive stuff on here I can truly believe there's hope for me and all of us. Keep up the good work!!",
      "MessageIndex": 2715,
      "PostDate": "07/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 11, 2016 06:56PM Isy wrote:",
      "MessageIndex": 2885,
      "PostDate": "11/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 22, 2017 01:03AM Isy wrote: slepeint I was glad to see your post about Halavan. I haven't posted on here for ever but bob in from time to time to keep up with things. I've been going along with Xeloda for the last year or so, feeling great, working, travelling, my hair the best it's ever been! And generally forgetting about C when BAM! About two weeks ago the ascites kicked in big time, nine months pregnant stomach and mass discomfort and pain. I had ten litres drained initially which didn't give much relief and then about another four litres but I'm still looking as with child as ever. I started on Halaven (eribulin) on Monday and really hope to get some relief soon. I had my babies 20 years ago and don't want any more! Best to all",
      "MessageIndex": 4578,
      "PostDate": "22/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Apr 13, 2016 05:48AM Isy wrote: like someone else said, sooo much to catch on when you haven't been on for a while! Kay, glad to hear you're still doing well on our favourite gem/carbo. Feel I'm going to be moving on soon. Liver is good but pain in ribs and pelvis tells me that bones need attention. Scans tomorrow but feel like I know what they're gonna say. My body is talking to me loud and clear! Hugs to all,",
      "MessageIndex": 3180,
      "PostDate": "13/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jun 14, 2016 07:28PM Isy wrote: Viktorb, I first presented at docs with discomfort, swelling in liver area and very weird gut behaviour. A few doses of anti inflammatories (Brufen?) put that right before I even started on chemo, so you might like to give that a try. Like kaayburg I also found low dose OxyContin to be a godsend and still do. All the best to you and your mum",
      "MessageIndex": 3454,
      "PostDate": "14/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jun 28, 2016 04:50PM Isy wrote: excellent news Babs! I would sooooo love to hear those magic three letters it must feel wonderful. I'm also doing well on Xeloda. Last scans showed shrinkage in liver and bone spots now gone or barely seen! I feel good on it too, just sore feet but hey, years of wearing silly shoes I'm used to that. Hope you celebrate well",
      "MessageIndex": 3527,
      "PostDate": "28/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Nov 16, 2015 04:49PM Isy wrote: Hi Lainey, I've just completed my third round of Gem/Carbo and have found it really easy to tolerate. Not muc fatigue and my hair is growing back! I was previously on Abraxane for liver mets which did nothing for me except cause neuropathy which is thankfully now going away. The main issues with gem /carbo are blood counts, they will also keep an eye on your kidney function. My wbc was slightly down after first treatment so onc adjusted the dose slightly. He'd prefer to do that than give injections. You have enough pricks to deal with (his words). Since then I don't even feel like I'm having chemo, just hope it's doing the trick. The gem can also be tough onthe veins and may sting when going in. Ask chemo nurse to put a hot pack on your arm as it's going in. All the best to you,",
      "MessageIndex": 1244,
      "PostDate": "16/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jul 31, 2015 04:17AM Isy wrote:",
      "MessageIndex": 2162,
      "PostDate": "31/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Sep 25, 2015 02:38AM Isy wrote: Oops! I'll continue.. If only they could give you some idea of what it's about before telling you to rush in. I had something similar. After my PET scan the tech said she just had to show it to the doc before I could leave. She then came back and said they were now going to do a brain CT scan as well. I knew my onc hadn't ordered this so was of course immediately convinced that they had found something in brain and needed a closer look. And as I was leaving I got that sympathetic, head on one side look from the tech that made me even more convinced I only had days to live. When I told this to onc he said it seemed they had started doing this as standard practice and not sure why. However he would tell them to explain that to patients in future! Anyway, back to PEt scan. Nothing to report that we didn't already know: mets are extensive and haven't responded to treatment yet. However, they have NOT spread which is what I wanted to hear. I feel if I can contain it within my liver I can deal with it. She's a tough old boot my liver and when I looked at the scan there were still large green areas there so I'm not feeling too bad about it. Just got to find the chemo that works! Hope your treatment goes well Monica, make the most of the time off work if nothing else. Welcome to the roller coaster indeed! Hope everyone else doing OK",
      "MessageIndex": 2283,
      "PostDate": "25/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Sep 26, 2015 02:09AM Isy wrote: Oh Moni so sorry to hear you're going through all that I hope you manage to get some pain relief soon! And something to calm you. Like we said before, transparency and honesty by our medical professionals is so important, it is NOT nice to find out these things by yourself or give you so little information you're left wondering if you're getting the whole story. herceptin is doing great things for those with liver mets and once you get yours I'm sure the fog will begin to lift and you'll start seeing results. Thinking of you,",
      "MessageIndex": 2293,
      "PostDate": "26/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Nov 4, 2015 10:40PM Isy wrote: GoldenGirls, like Shetland my doc suspected something was up as soon as he felt my tummy and noted that my liver was swollen though I had no idea. I'd had some twinges every now and again but I wouldn't say they were painful. They came and went whether I was moving or not and continue to do so now I'm having treatment. Initially I also got right shoulder pain which is also indicative of liver problems but they went away shortly after treatment started. I think as we get older we all suffer from aches and pains but anything that is persistent should be investigated for sure",
      "MessageIndex": 2409,
      "PostDate": "04/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Nov 27, 2015 03:50AM Isy wrote: Woody, thanks for your lovely and positive reply, as always. Shetland, just LOVE Shetland ponies. Used to ride a little black one called Tinker. And a right tinker he was too! Hope everyone has a good weekend",
      "MessageIndex": 2509,
      "PostDate": "27/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Feb 12, 2016 01:17AM Isy wrote: So, mixed bag on my latest scan results. Liver continues to shrink on gem/carbo and most of lesions necrotic, just a couple of persistent ones. However, cancer has been marching on in my bones, where previously had none. Feeling very disappointed as felt I could cope whilst it was in just one area, even if it was the liver. I now have a few spots in pelvis, right femur and scull. Looks like the chemo is good for the liver but not the bone. Having a two week break from chemo and onc is going to confer with radiologist as to whether bone spots are definitely new. What next I wonder? P.s. Just had a fabulous week in Singapore, walking round for hours in heat and humidity, eating very dodgy and cheap street food, no ill effects! Am encouraged by this, as at least I feel really well and have loads of energy which has got to be more important than crappy scan results",
      "MessageIndex": 2731,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Feb 12, 2016 11:24PM Isy wrote:",
      "MessageIndex": 2738,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Feb 22, 2016 10:24PM Isy wrote: great news Diana! gemzar is good! make it a double on next scan to 100% reduction!",
      "MessageIndex": 2774,
      "PostDate": "22/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Feb 23, 2016 04:06PM Isy wrote: wonderful news Babs!! 'Significantly' is such a beautiful word. Celebrate well..",
      "MessageIndex": 2782,
      "PostDate": "23/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Feb 26, 2016 02:29AM Isy wrote: the mystery of my bone progression, or not, deepens! Although some spots showed up on the CT scan, nothing appears on the bone scan or the X-Ray, not even any arthritis. Spoke to one of the junior oncos today who said that chemo can causeCT scans to be misleading and after all, it's only a set of grainy black and white images. (A bit cynical for a junior doctor I reckon). So I'm labelled a bit of a puzzle and continuing on gem carbo for now. Any insights from you well informed ladies appreciated!",
      "MessageIndex": 2800,
      "PostDate": "26/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 3, 2016 01:44AM Isy wrote: unsettling is right Leftfoot. Everything about our lives with this disease is unsettling but hopefully it's just a blip and your last scans showed the true picture. Had my bloods drawn just now so will get news on that tomorrow. Have felt really tired and a bit nauseous all week so thinking that something is going on. Yuck and ug",
      "MessageIndex": 2825,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 7, 2016 08:42PM Isy wrote:",
      "MessageIndex": 2857,
      "PostDate": "07/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 8, 2016 05:51PM Isy wrote: Sonyarizzo, I was initially on Abraxane when my cancer markers went right down, however my tumours continued to grow alarmingly so you can see why some docs don't really take much notice of cancer markers. My onc didn't seem that bothered they were so high so neither was I, we were just happy to see them come down. I came off Abraxane because of this but also because it was causing me really bad neuropathy in my fingers. The doc said it was very unusual for it to come on so quickly and was worried it may become permanent so like your doc, he is most concerned with QOL so took me off it. The neuropathy went away as quickly as it started. Since then I've been on the gem/carbo combo which is working very well for me and I'm tolerating well. Don't worry too much If you do have to go back to IV chemo. i also had a really hard time first time round but find these stage 4 chemos a lot easier to tolerate and there are so many to try when one stops working. You still have a lot of weapons in your arsenal and the motivation of being there for your kids will keep you going!",
      "MessageIndex": 2866,
      "PostDate": "08/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 29, 2016 03:17AM Isy wrote: absolutely love that POM juice! Gives a sweet hit when you need it but you know it's good for you. cranberry juice also does the trick and can bite through that yucky metallic taste you get with chemo. Lvin your sad post really resonated with me and reminded me of the place where I was a few months ago. I remember thinking my life had ended. I thought I was never going to be happy again, I'd never work again and I'd never travel overseas again. Well I've done all three within six months of diagnosis and there are times when I feel almost 'normal' whatever that is.. I no longer wake up in the morning with my first thought bring cancer.Helped in no small part by everyone on here who just get it and the only ones who can truly understand what's you're going through. Well it's after 6pm here and I reckon a good time to crack open a bottle and raise a glass to all if us, so Cheers, bottoms up",
      "MessageIndex": 3084,
      "PostDate": "29/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Apr 14, 2016 06:51AM Isy wrote: thanks Woody, you are a tonic - a liver tonic, ha ha. And ever the voice of reason. I do believe my body has had enough of this chemo, I'm tired and have a constantly grumbly belly.had scans today and Onc will decide tomorrow whether it's time for a rest or change chemo. Graman, the worst thing that ever happened to me was being diagnosed stage 4. Once you get over that, and you will, nothing seems ever as bad again and you will be able to take it in your stride whatever the future holds. I just booked a ticket to go to family wedding in London in September. At the start I would have thought things like that impossible but you can and will carry on living well cos what's the alternative? Kay, I love modern dance and was fascinated to see your vid about the cancer project. What an inspiring and amazing way to get the message across and yet it makes complete sense to express it through dance. Would love to see the complete project but don't suppose they'll come to Australia!",
      "MessageIndex": 3196,
      "PostDate": "14/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "May 31, 2016 07:49PM Isy wrote:",
      "MessageIndex": 3415,
      "PostDate": "31/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jun 1, 2016 07:50AM Isy wrote:",
      "MessageIndex": 3420,
      "PostDate": "01/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jul 13, 2015 03:05AM Isy wrote: thank you for your kind and positive words ladies. I really admire your positive outlook and hope I can get some of that soon! Yes I did have a biopsy Woody which is when they found out that my previously ER+ status had morphed to triple negative. Although apparently it is at 3% - some practitioners class that as weakly positive for others it needs to be at <10%. I've already been discounted for a triple neg trial becaus of this. Last time I saw onc he was talking about maybe combining some hormone therapy in the treatment - in the next sentence he was saying that hormone treatments would not work for me. I feel a second opinion coming at some stage soon.. HER2 is definitely neg. as you say you never know what comes next and I'm finding the uncertainty so hard. All the best to everyone",
      "MessageIndex": 2069,
      "PostDate": "13/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jul 17, 2015 12:05AM Isy wrote: I hear you dune sleeper! I'm tired of people bursting into tears on me whilst I'm the one holding it together. Mind you, eldest son is off school today with tummy grumbles and I'm enjoying being here for him, making him cups of tea and just made a lovely batch of soup fur us both. Energy levels coming back after last treatment though starting to feel slight tingling/numbness in the tips of fingers while typing this. Worried as I thought this happened a lot further down the track. Anyone else experienced this? One of the leaflets I have says this could be a sign of nerve damage, another says it should resolve within a week or so. Woody, how long did it take you to get to NED and how extensive were your mets? Let's hope we all follow you down that path soon! Xx",
      "MessageIndex": 2092,
      "PostDate": "17/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jul 23, 2015 05:09PM Isy wrote:",
      "MessageIndex": 2117,
      "PostDate": "23/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Dec 3, 2015 02:04AM Isy wrote: kaayborg, all the best for your scans tomorrow. I find the weather is a definite pick me up when it's sunny. I look back to those gloomy dark days when I was first diagnosed in July (winter here in Oz) and it definitely made everything all the more gloomier. Don't know if it's the weather getting better or me just becoming more used to it But i do find now that it's not consuming my every waking moment and I can find time to think about andenjoy other things. You just gotta get on with life don't you cos the alternative isn't worth giving the time of day to!",
      "MessageIndex": 1285,
      "PostDate": "03/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Nov 17, 2015 11:29PM - edited Nov 17, 2015 11:31PM by Isy Hi Ladies, I'm also on CT scans after every three treatments, though I've just started on the stage 4 treadmill so don't know if this will keep going. Both times my onc has left the final decision up to me, always says we can wait another cycle if you wish. Surfdreams was also really happy to hear about your success with Gem/Carbo combo. I'm feeling really good on it so far and feel I could stay on it indefinitely if need be. Telling kids is such a hard one. I want our household to be as normal as possible, I don't want doom and gloom to pervade especially while I still feel so well. We've decided to take each day as it comes and just be there to answer any questions as they come up. I've got two teenage boys who both find it hard to do deep and meaningfuls especially with their mum, they both find it a bit awkward to talk about and I don't want to pressure them. Be really glad to hear others perspective on this and the gender debate. I do think it's different for girls..",
      "MessageIndex": 1253,
      "PostDate": "17/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Dec 9, 2015 06:06AM Isy wrote: fantastic news kaayborg! I'm sure that NED is only just around the corner for you and hopefully for me too. When first diagnosed it's the feeling that your future has been taken away from you that's the hardest to bear. But now, to be able to start planning just a few things here and there is the best feeling. All the best to everyone",
      "MessageIndex": 1292,
      "PostDate": "09/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jul 12, 2015 09:35PM Isy wrote: Hi everyone, I've been around several forums for a couple of weeks now, have found this one to be the most informative, supportive and easiest to navigate! I'm in Australia, we moved here about 18 months ago from the UK, which only adds to the fear and loneliness I'm feeling right now. Was originally diagnosed in 2007, had lumpectomy and went through the standard chemo and radio regime quite easily helped by massive support from friends and family. Did five years of tamoxifen and got on with life with a vengeance, changed careers, travelled loads and brought up my two boys with my husband, I really thought the big C was all behind me. Coming here to start a new life was challenging but something we'd always wanted to do. Hubby is Australian so it's home for him and the boys were keen to experience life here too, the first 18 months were great and we just bought a beautiful house by the beach. Then about three weeks ago everything came crashing down. A trip to the GP with a dicky tummy led to a scan as he thought my liver felt a bit swollen, to being told I had 'multiple' mets in my liver. All other areas clear. To top it all they now class me as triple negative although the onc is not sure about that has I do have a 3% ER positive, he says it's a bit of a grey area which is not very helpful. Have just started on nab-paclitaxel chemo every 3 weeks (Abraxane) to hopefully shrink them, at the moment the whole area is quite hard and swollen. I can't believe how quickly this has all happened and how ill I suddenly feel. Friends and family back home are all devestated and its so hard being so far away. have had to turn down a job offer and the financial situation is looking dire. On top of that its cold and rainy and things just couldn't be any more depressing!! Hoping to hook up with some fellow fighters for support and friendship. Isy",
      "MessageIndex": 2066,
      "PostDate": "12/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jul 15, 2015 06:02PM - edited Jul 15, 2015 06:03PM by Isy Baby and Dune I, like you have just started on the liver mets nightmare. This is my first recurrence and after 8 years of putting it all at the back of my mind it just feels like life has been turned completely on its head. I'm having just Abraxane at the moment, every 3 weeks and first treatment is behind me now and the fog just starting to clear. Full of lots of little aches and pains and niggles which you try to interpret but really have no idea what it all means. The worst for me has been swelling and discomfort in liver area which now seems to be resolving slowly with steroids. The worst thing over the last week has been all the long, emotional phone calls to friends and family back home in England as we moved from there to Australia recently. I think dealing with others reactions is often the hardest thing. Here's hoping that we soon adjust to our new lives as all the others lovely lacies on here seem to do so well. All the best to you. Xxx",
      "MessageIndex": 2084,
      "PostDate": "15/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Aug 1, 2015 09:16PM Isy wrote: Hi Sue, Negative hormone receptor status used to be dx to anyone reading below 10% and mine is now about 3%. However the latest NCCN guidelines state that hormonal therapies should be tried on anyone wtih MBS irrespective of hormonal status as long as they are stable and relatively well. This represents a significant shift in treatment options. Bestbird on this forum has written an amazing guide to MBC, you can get it on the thread in the stage IV forum: Topic: Just Sent the 400th Copy of My MBC Guide! It has lots of links to very current research and also a report that discusses how the biopsy results can be fairly inaccurate depending on where in the tumour the biopsy needle goes. The middle of the tumour may give a lower result as there is very little blood there, the very edge of the tumour may also give misleading results that could be mixed with normal cells. So it's all a bit hit and miss! I guess all we can hope for is to stay well enough to try out all the different options and see what works for us.  ",
      "MessageIndex": 2172,
      "PostDate": "01/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Nov 6, 2015 01:48AM Isy wrote: Hi Woody We e been without internet for a while, the modem went kaput you can't believe the near riots it's caused in the household. Never mind kids, us adults just can't survive without it either. Not having my iPad at my side felt like me right arm was missing. Sad I know. You are just great Woody. i so appreciate you replying with such detail to everyone individually. You are so giving of your time and knowledge which is always spot on. Both me and onc are being very vigilant with my bloods and kidney function but saw him today, everything is good, even liver function has improved. Vitamin D is a bit low so good thing the summer is coming here and I'm near the beach! I'm feeling good on this chemo, been doing some voluntary work. In my former life I taught English and citizenship to migrants. We have several hundred Syrian refugees arriving soon to our town and I'm glad to help out while I feel so energetic. My onc said he would assess after six cycles whether to continue because of said side effects which is why I was so surprised to hear Smiley say she had been on it for 20 months, maybe on lower dose? Glad to hear you're still doing so well and SOOO happy to get my iPad back! Xx",
      "MessageIndex": 2434,
      "PostDate": "06/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Nov 13, 2015 12:16AM Isy wrote:",
      "MessageIndex": 2472,
      "PostDate": "13/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Nov 13, 2015 03:06AM Isy wrote: Thanks dear Woody.mforgot to mention also that liver enzymes down to 290 from 450 previously so allowing myself to feel a bit hopeful. Have a great weekend",
      "MessageIndex": 2474,
      "PostDate": "13/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Nov 27, 2015 12:10AM Isy wrote:",
      "MessageIndex": 2506,
      "PostDate": "27/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Dec 2, 2015 02:49AM Isy wrote: Diana, so sorry to hear what you're going through at the moment with SEs but worth hanging in there as it seems to be working. Maybe reduced dose will lessen SEs over time whilst your body adjusts to reduced chemo load. You know how fast Christmas always comes and goes. Hang on in there and it will be January before you know it",
      "MessageIndex": 2523,
      "PostDate": "02/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Dec 12, 2015 05:39PM Isy wrote:",
      "MessageIndex": 2574,
      "PostDate": "12/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Dec 16, 2015 02:59AM Isy wrote:",
      "MessageIndex": 2585,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jan 23, 2016 02:31AM Isy wrote: So sad to hear about Leah's passing. She was such a fighter, always positive about taking on new treatments and with a great sense of humour. She will be greatly missed but at least she has no more pain. Rest in peace Leah. Thoughts to family and friends x",
      "MessageIndex": 2681,
      "PostDate": "23/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 3, 2016 08:48PM Isy wrote: fantastic news babs!",
      "MessageIndex": 2839,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 8, 2016 05:40PM Isy wrote:",
      "MessageIndex": 2865,
      "PostDate": "08/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 13, 2016 12:52AM Isy wrote: MaryK/Sonya My first few treatments I used to get stabbing pains in my liver. This turned into a dull ache and now I rarely feel anything, just the odd twinge every now and again. I'm sure it means the treatment is working and I hope it soon resolves for you both to",
      "MessageIndex": 2898,
      "PostDate": "13/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 18, 2016 03:32AM Isy wrote:",
      "MessageIndex": 2956,
      "PostDate": "18/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 18, 2016 09:19PM Isy wrote: Artist, such brilliant news! stable is good, slightly better, a real cause for celebration. No matter how little the steps, all going in the right direction. So pleased for you",
      "MessageIndex": 2959,
      "PostDate": "18/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Apr 3, 2016 12:25AM Isy wrote: Shetland, I've been feeling a bit like that lately. Some of my original symptoms but milder - breathlessness, bloating, slight nausea, metallic taste in mouth and very grumbly tummy. TMs were coming down for a while but have been consistent, with just slight fluctuations on last few draws. Onc says all these symptoms could be signs that liver is playing up again, or would also be consistent with having been on chemo for a while. So far I've tolerated well but this could be a sign that my tolerance is wearing thin! I'm off to be scanned in a couple of weeks to see what's going on. Let's hope we both get to the bottom of things soon",
      "MessageIndex": 3099,
      "PostDate": "03/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Apr 27, 2016 04:31AM Isy wrote: seem to miss so much going on here with the time difference to Oz! Livin, so sorry to hear how rough it's been for you. I had the choice this time of starting Xeloda or Eribulin so thinking could be a good thing I chose the X although not been feeling too good on that either. It's really been messing with my stomach, cramps and diarrhoea and so so tired. Have nearly done first two weeks so then I get a week off. Have become obsessed with lumps and bumps of my liver, sometimes it feels bigger, sometimes it doesn't, messing with my head more than anything, I just wish I could leave it alone! Starting new treatments is the pits. Sending warm thoughts and positive vibes to all",
      "MessageIndex": 3299,
      "PostDate": "27/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "May 18, 2016 06:29PM Isy wrote: Cjanet I'm still working and on second round of Xeloda. Funny, I had side effects after first round, diarrhoea, watery eyes and sore, cracked lips. Those side effects now completely gone! Just feel very tired (what's new!) and feet are feeling a bit tingly today, though I did a lot of walking yesterday. So, so far so good, and much easier to take but shame I only just got round to getting a port put in and now I don't need it! kaayborg,what is the chemo you have lined up next? I know we went on gem/carbo about the same time and both have liver mets triple neg. have you considered Xeloda. You get to keep your hair!!",
      "MessageIndex": 3388,
      "PostDate": "18/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Jun 14, 2016 07:21PM Isy wrote: Aghhh, I also did really well on gem/carbo with no side effects to speak of. I was bald when started due to abraxane but hair soon came back thick and fast, and really curly! I had loads of energy, did a couple of holidays and wish I could have stayed on it for ever but although it was doing great things for my liver, after six months it was moving into bones so have since moved onto Xeloda. Feeling much more fatigued and sore feet mean I'm not as active so putting on weight. Grrrr! Hope you go well on it, let us know",
      "MessageIndex": 3453,
      "PostDate": "14/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Isy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218327/profile",
      "Content": "Mar 22, 2017 06:52PM Isy wrote: Hi JFL Yes this is the first time I've met the ascites monster. Scary when it happened so quick. I'm still swollen but managed to sleep really well last night, hopefully the Halavan is kicking in",
      "MessageIndex": 4582,
      "PostDate": "22/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    }
  ]
}