{
  "AuthorID": "Itchyscratchy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163935/profile",
  "Posts": [{
    "AuthorID": "Itchyscratchy",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163935/profile",
    "Content": "Itchyscratchy wrote: Hello everyone I have read through many post before deciding to join and well I guess I just wanted some input on my stuffs going on. Tomorrow morning at 10 I will have my first mammogram (diagnostic) due to 3 lumps I noticed about a week ago. I have two in my right booby and 1 in the left. The one I am really concerned about is the guy I have nick named funky lump due to the other two which are located one in each areola that are round like marbles and hard. Old funky is located on the right booby close to my cleavage up towards the top. Anyhow funky feels hard and lumpy and spread out some what if that makes any sense he doesn't hurt. My boyfriend and mom have told me not to worry and that it probably isn't anything, and yet, I just have this deep down feeling that I already know its cancer is that crazy? I'm not thinking negatively rather the opposite, it is what it is and now I have to go through the steps to get better. Now I do have some things to back up this belief, in the past six months I have went from a size five or seven to a size zero in my clothing, without changes to my diet. I went to the doctor because of terrible swelling of both calves and ankles, tired all the time, short of breath ( I sigh quite often). Well long short of that my TSH levels were pretty high and I was put on armour thyroid for hashi's. that was about a month ago I have felt a bit better but I still am so forgetful, tired (not as bad). So the other day I felt a pea sized lump right below my ear at the very angle of my jaw it's hard but does not hurt sooo this then prompted me to check my breast (which GASP at my age 39 I have never done) I know, I know should of been but honestly just never thought about it who me? Cancer? pftt please :( Dingbat what was I thinking? Exactly I wasn't! So then I found the twins and funky. Crazy thing is the itching I have been experiencing for quite sometime now. I have literally taken my hair brush to my armpits and was like YES!!!!! Momma likes and to my thighs and arms and groin hence my name lol Mind you I don't scratch hard but just having to even resort to this is in my mind a little wacked know what I mean? I have read about others in here who are itchy and I was like wow I'm not really a fruit cake. Well I guess I have rambled on long enough, i am nervous about tomorrow and scared but I just want to feel \"well and normal again\" thanks for letting me vent wish me luck and I hope to God I am wrong :( Ta Ta for now Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "07/11/2012",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/796043",
    "Title": "Just need to vent sigh........thanks Itchyscratchy 38DD"
  }]
}