{
  "AuthorID": "Itsallgood28",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287014/profile",
  "Posts": [
    {
      "AuthorID": "Itsallgood28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287014/profile",
      "Content": "Itsallgood28 wrote: had a duct excision about 4 weeks ago and was diagnosed with duct ectasia. Today I noticed bloody discharge again from the same nipple. Called the surgeon who said to come in Monday and they will schedule an MRI to allay my fears. I'm very worried, anyone have any similar experiences? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/871216",
      "Title": "Continued Bloody Discharge after Microductectomy Itsallgood28 Itsallgood28"
    },
    {
      "AuthorID": "Itsallgood28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287014/profile",
      "Content": "Itsallgood28 wrote: Im 28 and recently found blood when squeezing my left nipple. Had an ultrasound which showed nothing. Scheduled for excisional biopsy this Tuesday band very nervous. The surgeon is saying likely intraductal papilloma. Did anyone have a benign papilloma in their 20s or 30s? Being my negative self, I'm assuming it's got to be dcis or worse. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870431",
      "Title": "Bloody discharge ultrasound clear Itsallgood28 Moderators"
    },
    {
      "AuthorID": "Itsallgood28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287014/profile",
      "Content": "Itsallgood28 wrote: I have been diagnosed with duct ectasia and have a few questions. 1. Being that I am young (28),nlwould it be prudent to get a second opinion or further follow-up? I understand this is a benign condition with no increased risk but it appears uncommon in my age range. My report states: benign breast tissue with stromal fibrosis dilated ducts and mild periductal acute and chronic inflammation. Measurement: 2.3 cm S-l x 1.3cm l-M x 0.4 cm. Weight 0.9 grams. Appearance: ratty fibrofatty tissue. Cut surface: unremarkable firbrofatty tissue; no discrete dilated duct appreciated. Fibrous: 40% lesson/biopsy cavity: none appreciated. 2. My excisional biopsy was ultrasound guided. My ultrasound before biopsy showed nothing. My research seemed to indicate in this case MRI guided should be performed. Should I be concerned that the biopsy missed something because MRI was not used? 3. My only symptom was bloody discharge on expression of left breast. Came from one duct. From what I have read there seems to be a contradiction on whether duct ectasia caused bloody discharge or not. Any clarification on this? Thank you! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/870842",
      "Title": "Duct Ectasia at 28? Second opinion? Itsallgood28 KBeee"
    }
  ]
}