{
  "AuthorID": "itsmevaleri…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73293/profile",
  "Posts": [
    {
      "AuthorID": "itsmevaleri…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73293/profile",
      "Content": "Oct 8, 2008 02:05PM itsmevalerie wrote: It could be a milk gland at MY age? (52) I mean I know they are still there but I thought that only happened in younger women who are pregnant and/or breastfeeding? (which I am neither ) Sorry if my ignorance is showing!",
      "MessageIndex": 5,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/722447",
      "Title": "paralyzed with fear itsmevalerie itsmevalerie"
    },
    {
      "AuthorID": "itsmevaleri…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73293/profile",
      "Content": "Oct 8, 2008 01:54PM itsmevalerie wrote: Thank you so much for taking the time to reply to my post. Your words help alot. I am trying to stay as busy as possible...it does help. I'm a real worrier by nature (like most women tend to be, I think) and the rational side of me says....slow down and don't bring on trouble till you know what's going on. But there's that other part saying ahhhhhh! I will post tomorrow after my appt. Again, thanks for your kind words.",
      "MessageIndex": 2,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/722447",
      "Title": "paralyzed with fear itsmevalerie itsmevalerie"
    },
    {
      "AuthorID": "itsmevaleri…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73293/profile",
      "Content": "Mar 23, 2010 07:08PM itsmevalerie wrote: Thanks so much to all for the kind words and good advice. Navygirl, I will push for an ultrasound now that I've read your story. I think I'm so anxious to hear \"everything is fine\" that I'd do the same thing you did. So thanks again and I'm sorry for what you went thru...how are you doing today?  I will post whatever I find out tomorrow......Valerie ",
      "MessageIndex": 5,
      "PostDate": "23/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750191",
      "Title": "really worried itsmevalerie Fidelia"
    },
    {
      "AuthorID": "itsmevaleri…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73293/profile",
      "Content": "Mar 23, 2010 03:18PM itsmevalerie wrote: What exactly does density mean in this case?  Potential for a problem or benign? Good luck to you tomorrow! ",
      "MessageIndex": 2,
      "PostDate": "23/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750191",
      "Title": "really worried itsmevalerie Fidelia"
    },
    {
      "AuthorID": "itsmevaleri…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73293/profile",
      "Content": "Mar 27, 2010 03:17AM itsmevalerie wrote: Well, they did another mammogram, from different angles and then did ultra-sound just to be sure. The guy went over it twice with the ultra-sound and couldn't find anything. They said alot of times tissue will overlap and cause a shadow. Don't get me wrong...that's GREAT news! But, it doesn't explain why I'm having some pain. I go back to the Dr. week after next and will be discussing it further. Here's part of my problems....I have several other issues going at the same time....mitral valve prolapse (that I have chest pain with), fibromyalgia (again, widespread pain), and arthritis. I noticed the arthritis bothered me alot more since around the holidays this year. I have complained of pain to at least 4 doctors and either no one seems to listen, or they say oh it's probably just the arthritis, etc. But when it involves the breast area, that worries me more than anything, naturally. It's really frustrating to get someone to listen to me....I get the feeling they chalk it up to a \"complaining woman\", if you know what I mean! Sorry to get off on a rant...I just don't know where to turn to anymore.  Valerie",
      "MessageIndex": 7,
      "PostDate": "27/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750191",
      "Title": "really worried itsmevalerie Fidelia"
    }
  ]
}