{
  "AuthorID": "Ivy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74676/profile",
  "Posts": [
    {
      "AuthorID": "Ivy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74676/profile",
      "Content": "Jan 12, 2009 11:51PM Ivy wrote: Dear 07508125, My rad onc prescribed Radiaplex cream, and I pressed for a prescription the first day of treatment, because I wanted to use it proactively, like we put on sunscreen before going out in the sun.  So I used it daily as soon as I got the prescription filled.  When my nipples got sore on Day 4, I began applying liquid Vitamin E to them, the same as I did when nursing a newborn.  My nurse ok'd it and just said wash it off in the morning shower and don't reapply till after radiation. It really helped my nipples not be sore; and my skin did great.  I hope this helps! I finished 34 treatments last Wed., and celebrated with church friends at a birthday party 2 days later that someone offered to give me when I said I wanted to have a party but didn't want to clean my house! Ivy",
      "MessageIndex": 123,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "Ivy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74676/profile",
      "Content": "Nov 23, 2008 02:28PM Ivy wrote: Thank you both for answering, Wendy and Peeps.  I will check out that thread.  Wendy, I hope you are pleased with the results of the antidepressant.  I understand your feelings.  For me it was very humbling to ask for the prescription, and to tell my husband I was going to ask.  But I'm glad I did.",
      "MessageIndex": 90,
      "PostDate": "23/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "Ivy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74676/profile",
      "Content": "Jan 4, 2009 01:23PM Ivy wrote: Hi everyone - we've all taken a Christmas-New Year's break, it seems.  Traveler, I am so sorry about your friend.  Amazing how she worked till the Tues. before she passed away at hospice.  Liz19, welcome to the group.  How's your rad progress?I I have only 3 links left on my red and green chain!  I'll finish the 8th and last boost Wed. and my birthday is Thurs. the 8th.  I had so wanted to finish by my birthday, then gave up that hope because I thought it was mathematically impossible; then found I'd finish the day before, because now the doctor said 34 treatments instead of 35!  You know, God has actually blessed me through radiation.  I have been grateful to get the treatment, the techs and nurse and receptionist have been so kind that I will miss them, and I enjoyed Christmas more through doing less and understanding better how important it is to enjoy life while we have it. Happy New Year everyone!",
      "MessageIndex": 117,
      "PostDate": "04/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "Ivy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74676/profile",
      "Content": "Nov 22, 2008 07:14PM - edited Nov 22, 2008 07:18PM by Ivy Hi!  I just found this group tonght and just had my first 4 rads this week (31 to go).  I had wanted to start sooner and felt discouraged to wait; but once I got a start date, I was vastly encouraged.  Now I find I'm energized to go to each treatment and get one done and know that something good is happening to heal me.  I am feeling like me again!   But I will say, especially to TJW, that I asked for an anti-depressant and started it 2 weeks ago today.   They say it doesn't even have an effect for 2 weeks, but - I was really sad ever since I learned on 9/8 that I needed a biopsy; and now I'm not sad.  So whatever is the reason:  antidepressant, starting treatment, or the Lord, who of course works thru the other 2 anyway - I am relieved.  So I realize it's a personal decision, TJW, but if the med is helping, I want this help.  It did cause loss of appetite for 5 days or so; and I got worried; but that passed, and I'm eating whenever I feel I can. Question:  my onc. had me start tamoxifen after my first visit with her.  So I am on that and doing radiation simultaneously.   This does not seem common at all.  Anyone else doing both, or understand why tamoxifen is usually prescribed for afterwards?  Thanks!",
      "MessageIndex": 87,
      "PostDate": "22/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "Ivy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74676/profile",
      "Content": "Dec 14, 2008 05:44AM - edited Dec 14, 2008 05:46AM by Ivy Hi everyone - I've gotten busier and more sleepy each night, with the daily trip, but I do enjoy driving to and from rads with the snow falling and the carols playing in the car - just less time to be online.  Sherrie, everyone is different, so I can't say you'll have the same dramatic change as I did if you take an antidepressant.  There are even many different anti-depressants.  My doctor prescribed me Lexapro because it was the one that was supposed to start working the fastest.  For me, the difference has been night and day!  I don't wake up in the night with tears running down my cheeks.  I don't feel frozen and immobilized thinking that I am a total drain on my family and especially husband.  I am receiving help from my two sisters, friends and church folks without feeling guilty.  I am looking to encourage others instead of feeling trapped inside myself hopig and waiting to be encouraged. TJW, how are you doing now that you're closer to the end of rads? I have finished 18 of 34 tx.  I made a green and red paper chain of 34 links, and take one off each day after a tx.  It is so much shorter now! Ivy",
      "MessageIndex": 115,
      "PostDate": "14/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "Ivy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74676/profile",
      "Content": "Nov 28, 2008 05:01PM Ivy wrote: I'm so glad for you!!! Now Thanksgiving has a new meaning for you!!",
      "MessageIndex": 7,
      "PostDate": "28/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/725048",
      "Title": "Wonderful results!!! japennington Daffodil"
    },
    {
      "AuthorID": "Ivy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74676/profile",
      "Content": "Dec 14, 2008 08:30AM Ivy wrote: Dear Momonjava:  I just read this thread this morning and just want you to know I'm rooting for you!  It was only Sept. 8 that I learned out of the blue that I needed a biopsy.  I'd say I was in shock for about 2 months, as well as depressed.  Had lumpectomy and am now halfway thru radiation, and am so different: happy, and grateful to get the treatment.  I did ask for an anti-depressant.  I am hoping that JustSaying's suggestion above is the explanation for your rib pain.  I totally understand why you are worried and that you had been able to back-burner it but now you are on high alert.  Before I had cancer, I had no idea there was this world of women wondering and worrying and waiting.  I'm glad we have each other.  I'll pray that the excision gets everything and that your don't have the BRCA gene.  It's very rare.  Hugs.",
      "MessageIndex": 6,
      "PostDate": "14/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/724292",
      "Title": "kind-O freaked out momonjava awb"
    }
  ]
}