{
  "AuthorID": "ivy2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225909/profile",
  "Posts": [
    {
      "AuthorID": "ivy2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225909/profile",
      "Content": "Dec 27, 2015 06:19PM ivy2 wrote: Thanks to everyone for posting. I have found so much useful information from reading this and other threads. I see the RO the day after tomorrow and so have no schedule, or idea, really as to treatment duration or start. I had a lumpectomy almost 3 weeks ago and have been able to get back into excercise slowly. Does anyone here know if you can kayak/paddleboard during radiation? I've gone out twice since the surgery but am concerned about the sun and salt water. I'm in Australia so it is our summer and the beach beckons! Thanks again!",
      "MessageIndex": 292,
      "PostDate": "27/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "ivy2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225909/profile",
      "Content": "Feb 26, 2016 10:18AM ivy2 wrote: Yay Shopgal! I finished rads yesterday - 16 plus 5 boosts - and have benefitted so much from reading everyone's posts here. In the end my skin got a bit red and itchy but nothing horrible. I feel for you all who have had a worse go. I did get bad indigestion during treatment and lost interest in eating. I'm looking forward to something more than plain crackers. The fatique was noticeable but as long as I could stop and rest for 20 minutes it was ok. Thanks again to everyone for posting, it has been a huge help in managing this whole thing.",
      "MessageIndex": 1654,
      "PostDate": "26/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "ivy2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225909/profile",
      "Content": "Jan 13, 2016 09:10PM - edited Jan 13, 2016 09:13PM by ivy2 Keepwalking- that is such a lovely photo! Chocolate seems to be an almost universal balm, doesn't it? Shopgal2- I start with the sim and breath training on Monday. Thanks for sharing your experience! My son sent this to me to cheer me up:  I admit it makes me feel better.",
      "MessageIndex": 581,
      "PostDate": "13/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "ivy2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225909/profile",
      "Content": "Dec 30, 2015 02:25AM ivy2 wrote: Thanks for the welcome! I saw the RO today and she said I'll have 16 sessions and 5 boosts. Probably start the end of January as they like to wait a minimum of 4 weeks after surgery and I still have to see the MO to discuss endocrine therapy. She totally nixed the idea of paddling or kayaking or any swimming, no water or sun! Ugh, well I can go in up to my knees if there are no waves and I'm wearing a muumuu :)",
      "MessageIndex": 317,
      "PostDate": "30/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "ivy2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225909/profile",
      "Content": "Jan 2, 2016 02:14AM ivy2 wrote: Octogirl I hope your drysuit was dry indeed. mdoc - I'm trying to get as much beach and water in as I can with rashguards and 50 sunscreen! Phoebe - I love Tennyson, thank you for that line. HappyHammer- I asked about music but the RO nixed that as well :(. Unfortunately she said the music they play is horrible. I may just wear earbuds anyway...",
      "MessageIndex": 376,
      "PostDate": "02/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "ivy2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225909/profile",
      "Content": "Jan 19, 2016 05:04PM ivy2 wrote: Congrats on finishing, HappyHammer I hope all continues well for you:) Etnasgirl I hope all of your treatment goes smoothly. I had the sim on Monday here and begin rads on the 28th. It seems like a lifetime has passed the diagnosis.  ",
      "MessageIndex": 730,
      "PostDate": "19/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    }
  ]
}