{
  "AuthorID": "iwannabefre…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211514/profile",
  "Posts": [
    {
      "AuthorID": "iwannabefre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211514/profile",
      "Content": "Mar 10, 2015 04:00AM iwannabefree50 wrote: Thanks so much!",
      "MessageIndex": 2,
      "PostDate": "10/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829297",
      "Title": "What is an MRI guided biopsy like? iwannabefree50 pennsygal"
    },
    {
      "AuthorID": "iwannabefre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71372/profile",
      "Content": "Dec 7, 2008 09:07AM iwannabefree wrote: Hi. I am really sorry for your new diagnosis. I just had my mastectomy 5 weeks ago. We were in family counseling for other issues at the time of my diagnosis. Our counselor was insistant that we tell the kids right away. It forms a solid ground of trust between them and you. Life is full of hard things. And it is okay to fall apart in front of him. I was told to tell my kids. \" It is good for mom to cry some now to get the sad and angry feelings out. I will not cry forever, nor will I keep crying more and more each day. Tomorrow will probably be a much better day for me.\" Show him healthy ways to deal with hard things, rather than teaching him that the best thing is to avoid pain at all costs. You sound like a very loving and kind mother. Kids need to learn to cope with emotional pain now.( I also wrote emails to my kids teacher so that they could be a support system to them) You might consider asking your son to journal his feelings or give him a drawing book if he likes to draw, or take walks with him if the weather allows. My breast cancer was one of the best things that happened to our family. We are now much closer and stronger and united and supportive and caring. My best to you my friend! Laura",
      "MessageIndex": 8,
      "PostDate": "07/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/725443",
      "Title": "Just diagnosed, question re: children, please guide me... gcpommom Rarity"
    },
    {
      "AuthorID": "iwannabefre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71372/profile",
      "Content": "Nov 6, 2008 03:05PM iwannabefree wrote:  Hi Penny- I used ot be a mamography tech and want to share some advice with you. 1. take something strong ahead of time for pain, but do NOT use anything with iboprophen or aspirin. This compression sounds like it's gonna be painful if you are already in pain. Aspirin and ibuprophen are both products NOT to take before any kind of biopsy as they increase bleeding.You might call your doc today and ask for an pain killer and an anti-anxiety med to help you through tomorrow. 2. do not leave the mamography office without speaking with the radiologist who reads your film. That is part of their job. They should be able to give you a good answer tomorrow as to what you are feeling and what your next step should be. Have him/her show you your pictures and explain them. That is a reasonable thing to ask. 3. You are very young. Do not let the medical world push you around. Demand your answers and question everything. I know an 18 year old who had something similar to what you are describing. She had mas that grew very fast. It was not cancer, but it had to be removed anyway because of it's rapid growth. She is now doing very well. You can do this! Laura",
      "MessageIndex": 7,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723969",
      "Title": "21 Years Old & 1st Mammogram Tomorrow JenMarie iwannabefree"
    },
    {
      "AuthorID": "iwannabefre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71372/profile",
      "Content": "Dec 6, 2008 10:43PM iwannabefree wrote: Hi Sue- I just had a mastectomy 5 and a half weeks ago. I have a 21 month old very active son. You are voicing the same concerns that I had. It will go okay. You will just learn to do things differently.  I put a simple rubber step stool on the floor in front of the car seat and taught him to crawl up there (for a Smartie candy reward) BEFORE my surgery. I also bought one of those teddy bear back packs with the harness on a leash, and took him for walks and little shopping trips prior to my surgery to get him used to the fact that I couldn't carry him on errands. My son is still in a crib and I made a set of stairs with diaper boxes and duct tape that he thought was great fun and still uses to climb in and out holding my hand. My main problem was the dressing and diaper changing. We ended up using the floor for most of that.This is definately a great time to line up friends who can take your little girl for the mornings and feed her lunch, then help you tuck her in for a nap. I had friends and family taking my son for the first week I was home because I was too wore out to care for him.  As for reading books, I was so worried about that and it turned out to be no big deal...he just sat beside me and was very happy with that. Try to start living now like you cannot lift her, and then make the adjustments that you see need to happen. You'll be okay. (Oh, I just remembered that I did phone a neighbor lady a couple of times for help when I needed baby lifted...she was so glad to help! ) I also had the DIEP flap abdominal incision to deal with. I would say that by 4-5 weeks out I was back to my normal self. Best wishes to you! Laura",
      "MessageIndex": 7,
      "PostDate": "06/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/725339",
      "Title": "Experiences after BM with small children susan13 iwannabefree"
    },
    {
      "AuthorID": "iwannabefre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211514/profile",
      "Content": "Mar 18, 2015 12:45PM iwannabefree50 wrote: Thank you, ladies!",
      "MessageIndex": 3,
      "PostDate": "18/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/829645",
      "Title": "Can the core biopsy spread cancer? iwannabefree50 Hopeful82014"
    },
    {
      "AuthorID": "iwannabefre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71372/profile",
      "Content": "Jun 4, 2009 07:11AM iwannabefree wrote: Ok, Number  53 takes the cake. My mouth is still dropped open in astonishment.",
      "MessageIndex": 44,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735274",
      "Title": "100 things never to say to a woman who has had a mastectomy: iwannabefree jillyG"
    },
    {
      "AuthorID": "iwannabefre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71372/profile",
      "Content": "Dec 6, 2008 10:47PM iwannabefree wrote:",
      "MessageIndex": 8,
      "PostDate": "06/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/725339",
      "Title": "Experiences after BM with small children susan13 iwannabefree"
    },
    {
      "AuthorID": "iwannabefre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71372/profile",
      "Content": "Jun 3, 2009 09:11PM iwannabefree wrote:  #40 \" It's all about you, isn't it?\" Uh, sorry. This isn't the kind of attention I really wanted.",
      "MessageIndex": 24,
      "PostDate": "03/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735274",
      "Title": "100 things never to say to a woman who has had a mastectomy: iwannabefree jillyG"
    },
    {
      "AuthorID": "iwannabefre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71372/profile",
      "Content": "Jun 3, 2009 09:15PM iwannabefree wrote: #44 The worst one I heard was after a made my decision to have a UNI mastectomy. \" So are you gonna have one breast that's all up and firm and one that's all down and saggy?\" This was by a gal I wasn't even very close to. I responded with a simple \"Yes.\" She was speechless.",
      "MessageIndex": 25,
      "PostDate": "03/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735274",
      "Title": "100 things never to say to a woman who has had a mastectomy: iwannabefree jillyG"
    },
    {
      "AuthorID": "iwannabefre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71372/profile",
      "Content": "Dec 7, 2008 02:17PM iwannabefree wrote:  Hello there...I had my mast. 5 weeks ago. I have been pulling shirts on for about 2-3 weeks.  Do you still have your drains in?   Once the drains are out things will daily get easier. Your arms will not just suddenly be able to go up. It is a matter of stretching them to regain the mobility you lost while you weren't raising them. My dad broke his arm and was in sling for a while and had the same issues. I am thinking that somebody goofed if they didn't give you any instructions on  execises for your arms. A physical therapist saw me in the hospital in my room to instruct me. maybe you got missed.( If you still have drains you are not supposed to raise you arms above shoulder height.",
      "MessageIndex": 5,
      "PostDate": "07/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/725566",
      "Title": "when can you wear clothes going on over head? rayhope sunflower45"
    },
    {
      "AuthorID": "iwannabefre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71372/profile",
      "Content": "Nov 6, 2008 03:36PM iwannabefree wrote: I am a  totally full blown OCD woman. I used to have to have everything clean here. Really this drain thing shouldn't be that big of a deal. Your sheets probably won't be touching your drains.Be reasonable.  Let me tell you that you will be feeling badly enough that you will stop worrying about the infection. Your mind will be consumed with other things, like just making it through the day. My PS has told me that he freaks out about infections happening in the expanders. ...And that only instructions he gave me regarding their care was not to let water find a pathway in. I think that is the real big no-no. So I am sitting here feeling grungy 8 days post op because I still have my drains in. I agree with always using a clean (not sterile) towel and I would pat dry that area first and not last. Put on laundered clothing, but there is no way you can kill every germ. If you are strong and basically healthy you don't need to obsess about this. I was given those little alcohol prep pads to use to slide down the drains to strip them. It made sence, more sence than a lubricant which collects bacteria. They are working well.",
      "MessageIndex": 3,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/723962",
      "Title": "Disinfecting laundry to prevent infection rayhope swimangel72"
    }
  ]
}