{
  "AuthorID": "j1e1n1a",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
  "Posts": [
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Feb 25, 2013 06:16PM j1e1n1a wrote: So sorry for your loss.",
      "MessageIndex": 19,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801017",
      "Title": "Sheff is an Angel Sheff dawny"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Mar 10, 2013 05:31PM j1e1n1a wrote: Thanks guys....I have to admit working, being a mom and wife was a lot easier pre-cancer/chemo...understatment of the year...right. Well i have found that we can only do so much. Naps after work are sometimes a must and crockpot meals are extremely necessary...lol. Hope everyone had a great weekend. I have found someone for next 5 questions....will try to post tonight.",
      "MessageIndex": 12,
      "PostDate": "10/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801470",
      "Title": "Five Questions - J1e1n1a brandall texasrose361"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Mar 7, 2013 06:15AM j1e1n1a wrote: Sorry guys got off work yesterday...we had soccer practice. Will post my answers tonight. :)",
      "MessageIndex": 2,
      "PostDate": "07/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801470",
      "Title": "Five Questions - J1e1n1a brandall texasrose361"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Mar 7, 2013 08:04PM j1e1n1a wrote: Well here goes...sorry took so long. Got off work and have to be mom first. Hope I do not bore everyone...somewhat of a homebody here..lol. 1. If you had to pick 5 words to describe yourself, what would they be and why? First i would have to say mom before anything else. I have always known that I would be a mom. I was the baby in my family, and never had very many little ones to play with except neighbor kids and their siblings. I always knew I would have at least 1 child. I have 2 of my own and husband has child with his 1st wife who lives w/us from time to time as well.  I just hope that I will be with them long enough to prepare them for this world we live in... Next i would have to say loyal. I am one of the most loyal people I know. I only have a couple  really good friends...but would do anything for any of them. I have never had lots of acquaintances. I have the best husband and he makes being loyal very easy for me. He is a great father and my best friend. I have always been an introvert until one gets to know me. I have always been quite shy or quiet until I get to know someone...at times I am afraid that people think I am a snob. Once I get to know someone I open up. I am and always have been fairly generous with my things, time, ideas ect.  I have always been one to give a little too much. I have also been known to enable people...Trying to do more for me right now. I am learning to let others do what they need to learn how to get by on thier own. I am hard working. I lived on a farm when I was little. We took care of animals, picked the garden and had a very different childhood from what other kids my age did. Funny how farm life creates work ethic. 2. I know that you have little ones at home.  How many children do you have and what is one special quality that you see in each of them? Elizabeth my daughter is 11.  She is one of the most positive people I know. She is so strong and being the oldest I hope that I never put too much on her. She is a good girl. She loves helping mom cook and irritating her 9 year old brother. Christopher is 9 and so loving. He is a little monster at times and so unorganized compared to sister but very loving. He is also a ladies man a school which I find funny. I have great kids. Alex my 16 year old step son is only with us from time to time but he is still mine. :) He has been through soo much and still manages to stay grounded. 3. You have said that you are going to work 5 days a week (while on chemo and radiation) what type of work do you do?  Is this your dream job?  If it isn't, what IS your dream job? I am a Social Service Specialist II. Basically what this means is that I determine eligibility for Aged, Blind and Disabled Medicaid, Child care assistance and Food Stamps. It is not an extremely physical job which is why I am able to work 5 days/week. I am able to help many people, but at the same time I am an enabler...at times. I also get discouraged b/c I am able to help some people more than others. I would never call this my dream job, but I am ale to help many people and I work with some of the best people I know. My dream job would be a sculptor, artist-oil painting, and stay at home mom..lol. 4. Do you have any hobbies that you enjoy? I love spending tome with family, gardening, painting, drawing, and sculpting. Although I have to admit I have not done any 3 -dimensional art in several years. Don't have a kiln. 5. I saw that you live in Oklahoma, have you always lived there?  Would you ever consider moving?  If so, where would you move and why? I was born in Fredrick, Maryland. However I family moved to Oklahoma when I was 6 i think. We also lived for a short time in Pennsylvania. I don't think at this point I would move as my family and husbands family lives here. However I still have great memories of the East coast-- I remember rocky beaches, horseshoe crabs, and some of the best seafood. You can not find decent seafood in Oklahoma...lol. Bonus question - What famous person do people people say you look like?  Or what famous person do you think you like? When I was younger people said I looked like Neve Campbell- The actress from Scream, but I never saw the resemblance. I think I look like Jena..lol. There is an annoying guy at work that makes a GI Jane comment occasionally... No I don't think I look like Demi Moore either. He is not trying to be tacky he is trying to complement me with my nice shaped head...lol. Thanks for the questions-Brandall. Hope I didn't bore anyone. Have a great night!!",
      "MessageIndex": 4,
      "PostDate": "07/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801470",
      "Title": "Five Questions - J1e1n1a brandall texasrose361"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Apr 30, 2013 04:31AM j1e1n1a wrote: 201",
      "MessageIndex": 342,
      "PostDate": "30/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Aug 23, 2013 10:43AM j1e1n1a wrote: So sad...praying for her husband and family that they find peace....there are no words. I am in shock. I just pm'd her a couple months ago and she was on vacation...doing well. She will be missed...",
      "MessageIndex": 12,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809781",
      "Title": "Kasi is an angel Momof2inME Catesmom"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Feb 24, 2013 05:39PM j1e1n1a wrote: No one can truly understand until they deal with stage 4...but that doesn't make me appreciate them any less. I have a lot of support....family,friends spouse. Even coworkers are so supportive. I know over time they may become less supportive...but i hope i am wrong. Yes...i get occasional strange questions at work...but it is just concern and lack of knowledge on their part. I try not to let it bother me,bc they just don't understand. Thank you all for being here and understanding...LOL.",
      "MessageIndex": 19,
      "PostDate": "24/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800938",
      "Title": "Here for you but don't talk about cancer or anything related mommyjamieof2 Moiralf"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Aug 28, 2013 11:09PM j1e1n1a wrote: Great questions and answers! It's nice to know you better syrmom. I am also greatful to you wonderful ladies. I got the \"horse is out of the barn\" speech from the orthopedic that did my Kyphoplasty. I am glad i didn't tell him off b/c he did a great job on my back...lol. I really wanted to tell the turd off. Anyway thanks for sharing! ;')",
      "MessageIndex": 2,
      "PostDate": "28/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809962",
      "Title": "Five Questions - SyrMom susan_02143 texasrose361"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Oct 26, 2017 06:35PM j1e1n1a wrote: Thank you all for the welcome and positive wishes for my treatment tomorrow. Grannax2 - I have been getting treatment at Integris in OKC since my initial DX in 2012. I realy like and trust my MO, but feel like I have a million questions now. Wendy3 - Of course Jena is fine...lol. I didn't realize that the 1's would be so pesky until too late. Zarovka - I will definitely look in to Rational Therapeutics and Dr Nagorny. I understand that there will always be a bit of coin flipping involved and pricision is probably not something that I will be getting...If I sounded like I was ungrateful for the effort my MO has put into choosing my treatment, this was not my intention. I think I'm just a bit overwhelmed with all the changes at one time. I did get a biopsy and they said the pathology changed. With regard to genetic testing I didn't have the BRAC mutation. I think I need to do a lot more research and start asking questions because you ladies are a lot more informed than I am. Shetland - Yes they told me that the liver biopsy came back as tnbc. I plan on getting a copy of the report tomorrow since it does not show in my file online. I do not know about the basal type or lumina A or B but plan to ask questions. I don't know if they did any genomic testing on this biopsy or not but will ask tomorrow. I am obviously not as informed as I should be...feeling a bit overwhelmed. Thank you all again for your help and support. Jena",
      "MessageIndex": 6352,
      "PostDate": "26/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Oct 17, 2018 07:18PM j1e1n1a wrote: Hello, I don't post much but thought I would check in. I have had mixed response on carbo/gemzar. Liver and adrenal met have disappeared as well as a soft tissue met in right thigh. Have had some improvement to bone mets as well but new uptake in an area on the left femur. Currently I'm having a weakness/tightness with the muscles around my right femur though. MRI shows swelling and onc thinks it might be due to radiation in this area....had radiation recall when I started gemzar after rads to femur. Anyone experience anything similar? Thinking of you all. (())",
      "MessageIndex": 10000,
      "PostDate": "17/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "j1e1n1a wrote: I just had mammogram in Dec 2012. Biopsy came back positive-invasive poorly differentiated ductal carcinoma. I just found out last week Pet scan shows that it has spread to bone. All happened so fast. i am still in shock. very scared. Jena -mother of 2, daughter age 16 and son age 15 Dx 12/7/2012, IDC, 4cm, Stage IV, Grade 3, mets, ER+/PR+, HER2- Radiation Therapy 1/16/2013 Bone Hormonal Therapy 1/16/2013 Arimidex (anastrozole) Chemotherapy 1/16/2013 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Taxotere (docetaxel) Hormonal Therapy 7/1/2014 Aromasin (exemestane) Targeted Therapy 7/25/2015 Afinitor (everolimus) Hormonal Therapy 1/5/2017 Faslodex (fulvestrant) Targeted Therapy 1/5/2017 Ibrance (palbociclib) Dx 9/27/2017, Stage IV, metastasized to liver/other, ER-/PR-, HER2- (FISH) Chemotherapy 10/27/2017 Halaven (eribulin) Chemotherapy 4/9/2018 Carboplatin (Paraplatin), Gemzar (gemcitabine) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/798715",
      "Title": "Just diagnosed. j1e1n1a j1e1n1a"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Feb 23, 2013 10:17AM j1e1n1a wrote: 33 almost 34... stage 4 from get go.",
      "MessageIndex": 894,
      "PostDate": "23/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Feb 21, 2013 02:04AM j1e1n1a wrote: you are all so good at putting my thoughts into words....lol..I love my DH and children soo much and can only hope that I have many years ahead with them....the alternative is unimaginable for me. I plan to live...be it ....one day at a time..with lots of hugs, kisses and hand holding. Enjoy what you have while you can... i don't want to have any regrets.....si es possible. ;-) Jena",
      "MessageIndex": 12,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800496",
      "Title": "Husband, best friend Renae64 Trebor"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Oct 25, 2017 11:23AM j1e1n1a wrote: Hello. This is my first time posting here and I would like to thank you all for sharing your knowledge and beautiful pictures. ;) Until this last month my Mets were all in the bone. I had a PET in Sept 2017 that confirmed it has moved to my liver and adrenal gland. I was initially diagnosed with primary er+ pr+ Her- the hormonals seemed to have worked for almost 5 years.... Alas the pathology on liver biopsy has changed to triple negative...so bye bye hormonals. This tnbc is a bit scary. In the last 3 weeks I have heard different names of possible chemos for me and was even considered for a trial. At times it feels like decisions are made to the flip of a coin and that really freek me out. I was denied participation for the trial 2 days ago due to not having enough slides from my primary tumor. This you can imagine was bit frustrating. I'm not even sure why this was needed as the trial was for tnbc and my primary tumor was er+pr+.... Anyway I start Halavan (Eribulin) on Friday...hope it knocks the socks off those little buggers. Wishing you all well with you current treatments and sending you all my love. Sorry this was so long. Jena",
      "MessageIndex": 6335,
      "PostDate": "25/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Feb 22, 2013 10:44AM j1e1n1a wrote: Hugs to you all. :-) Thinking of you on a sleepless night. Hope you are doing well. ;-)",
      "MessageIndex": 15,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800496",
      "Title": "Husband, best friend Renae64 Trebor"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Feb 18, 2013 04:53PM j1e1n1a wrote: I feel the same way Wilsie...about always looking over my shoulder. Or at least making myself nervous over a side effect. I am also having blurry vision... Have appt coming up with eye dr...my MO does not seem too worried, but is sending me to specialist...odd right? I am assuming that it is just se's from all the crap that they have been pumping into me lately...lol. Wish you the best. Jena.",
      "MessageIndex": 7,
      "PostDate": "18/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800627",
      "Title": "Blurry vision Wilsie2 Alphabet"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Aug 23, 2013 09:00AM j1e1n1a wrote: so happy for you.. :') ((hugs))",
      "MessageIndex": 26,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809627",
      "Title": "PET scan tomorrow brandall meima-Bev"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Aug 24, 2013 11:39AM j1e1n1a wrote: SPAMGirl you have not screwed up your kids memory of you, but I so understand where you are coming from. My mother died of melanoma when I was 14. She had hospice and I remember watching her slowly fade away over many months, but I also remember that she loved us so much that she wanted to stay with us as long as possible and she fought. It was very hard to watch...sometimes I feel like I did not do enough for/with her at this time. She was a beautiful women and I remember the good as well as the bad. Chickadee is right...Children have a hard time dealing with loss in general, but unfortunatly it is part of life. I don't think there is any way for us to make sense of this loss...but just by loving them I think we may be able to make it easier. ((Hugs))",
      "MessageIndex": 40,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809693",
      "Title": "How do they decide? Chickadee jlmacy"
    },
    {
      "AuthorID": "j1e1n1a",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167506/profile",
      "Content": "Jan 12, 2013 03:30PM j1e1n1a wrote: Thanks a lot everyone. I am so greatful for your support.",
      "MessageIndex": 6,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/798715",
      "Title": "Just diagnosed. j1e1n1a j1e1n1a"
    }
  ]
}