{
  "AuthorID": "Jackieb",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60465/profile",
  "Posts": [
    {
      "AuthorID": "Jackieb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60465/profile",
      "Content": "Jan 26, 2008 05:50AM Jackieb wrote: Hi Jewels I start chemo Jan 31 so I am jumping in a little late.  I have been keeping up with you ladies for a while but just haven't been ready to join. My journey has been : biopsies of two tumors in right breast, one Mammotest, the other ultrasound guided and was diagnosed November 23 2007 with IDC. Met with the Surgeon who ordered the Breast MRI and evidently I am very claustrophic,because with 10mg of Valium, I still couldn't do it.  :( Had surgery on Dec 21st 2007-Quandrantectomy (double Lumpectomy) of right with reduction of left. When path came back, 1 tumor was E/P - & HER2 +, the other E/P + HER2-. Met with Onc, had MUGA scan & port put in and am starting chemo Jan 31st. The plan is Cytoxin & Adriamycin every 3 weeks for 4 and then Taxol & Herceptin every 3 weeks for 4. Then radiation for 35 treatments. remaining on H for 1 year along with Tamoxifin for 5 years. Have Chemo Orientation on Tuesday. KarenL & Dana it looks like we will be traveling very similar roads. Your info has been so reassuring. I live  in Central Florida, am 46 years old, have been married to Bob, who is my rock for 28 years and have 1 daughter Kaitlyn, who is 18 and will be graduating HS and heading off to college in June,  I work full time for the State of Florida, as an administrative assistant for a wonderful man who is so supportive, that he is going to shave his head when my hair goes.  How cool is that?? I don't think my feet have touched the ground since diagnosis, since God has been carrying me and has given me a peace about it all.  He has also provide a great support system of family & friends and now you ladies. I am ready to kick some cancer butt.  I have got a wig and some hats & scarves, but am not looking forward to losing my hair.  They can have the boobies but my \"style\" is me, if that makes sense. I am not looking forward to Thursday.  The Onc gave me Emend, Ativan & Zantac for SE so I guess I am ready.  I know the first will be the hardest. Sorry to be so lengthy but wanted to catch up.  Since I am so late in Jan will probably also jump over to the \"Feb 08\" group. Email or PM my anytime. Hope everyone has an awesome Saturday. You are each in my prayers every day. Jackie",
      "MessageIndex": 843,
      "PostDate": "26/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Jackieb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60465/profile",
      "Content": "Jan 28, 2008 06:57PM Jackieb wrote: Sunshine I am right there with you.  But we are no sissys. We are gonna put our big girl panties on and kick some BC butt. Tomorrow is Chemo 101 and Thursday is my big day.  Like everyone has said it is the unknown.  Once we get this first one behind us the others will be a little easier. My thing is trying to figure out when the SE will be the worst. I plan on working as much as possible and planned on Thursdays so I would have the weekend, but that may not work.  Sending prayers of peace to you Jackie",
      "MessageIndex": 924,
      "PostDate": "28/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Jackieb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60465/profile",
      "Content": "Feb 6, 2008 07:59PM Jackieb wrote: Hi Jewels Today is day day 7 of 1st tx.  I went back to work on Monday and it has basically been go to work, come home & go to bed. I am exhausted by the end of the day.  So much going on with getting things finalized for my daughter to head off to college in June (housing, financing, etc) and taxes and my dh turns 50 the day after my next tx, trying to throw a surprise party in somewhere. Errgh, I really just don't have time for this right now.  OK the venting is over, Sorry about that.  God is so good and I know his plan is far better than mine.  I will definitely \"Praise him in this storm\". Day 3-5 were the worst for SE's so far. Tastebuds are history.  Hopefully next week will be all up hill. I am learning to love and enjoy those feel good days. :) All you recent baldies look awesome.  I am sure I will be joining the club soon. Praying everyone that had treatment today has peaceful night sleep and very minimal SEs tomorrow. Good Night Jackie",
      "MessageIndex": 1124,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Jackieb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60465/profile",
      "Content": "Jan 31, 2008 05:10PM Jackieb wrote: Hi Jewels Well I am no longer a chemo virgin,had my first tx (AC) this morning. God is soo good, he placed angels in my path all along the way.  My nurse, Tracey actually leads a support group at a local church. Infusion was uneventful. As the day has gone on I have started feeling a little green,have no appetite and have a good headache, but otherwise all is well.  I have drank so much today, I should be floating. Hope all you beautiful Jewels have a very peaceful night that is SE free. Jackie",
      "MessageIndex": 999,
      "PostDate": "31/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Jackieb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60465/profile",
      "Content": "Feb 6, 2008 07:59PM - edited Feb 6, 2008 08:00PM by Jackieb",
      "MessageIndex": 1123,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Jackieb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60465/profile",
      "Content": "Feb 3, 2008 05:48AM Jackieb wrote: Good Morning Jewels Day 4 after treatment and still fell nauseas and dizzy. Got up hoping to go to church, but heading back to  bed.  Taste buds are gone, but the nose is working overtime.  If I smell it it better be good. :)Popsicles are pretty good right now & Ginger Ale is helping get the fluids in.  The Miralax has been a lifesaver, thanks for the heads up Jewels. Deb, no shots for me yet.  I have bloodwork on Thursday and then we'll see what the numbers are. I am so thankful the SE aren't any worse than they are. I know others that have suffered so much worst in the past. Plan on going to work tomorrow, so pray that today things improve. Hope everyone has an SE free Super Bowl Sunday!! Jackie",
      "MessageIndex": 1034,
      "PostDate": "03/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Jackieb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60465/profile",
      "Content": "Feb 17, 2008 02:31PM Jackieb wrote: Hi Jewels Have been checking in but haven't had a chance to post this week. I am due to step up to the bar for Chemotini #2 this Thursday and other than complete exhaustion at the end of the day, had been having a pretty good week until Thursday.  Went for labs amd wasn't feeling so hot, the nurse called later and sure enough my wbc were pretty low. Started antibiotics and hope they work as I don't won't to get off schedule. Will have more bw before tx Thursday. Had a little get together for the hubbys 50th last night and it was a blast. We are big NASCAR racing fans and this weekend is the 50th anniv of the Daytona 500 so the party had a racing theme which he loved. He deserves so much more, but with the low counts, wanted to stear clear of big crowds.  I agree treatments in the winter are harder with so much going around and we seem to catch everything now. Before tx I never caught anything, now I think I have a welcome sign out. The hair is really thinning now.  I have shaved twice and leaving behind the short stubble everywhere instead of my normal legnth & style has really helped me deal with it. CHJ hang in there.  The first week and a half after treatment, were rough. But this past week I actually felt normal and accomplished quite a bit.  And yes, I am right there with you on the taste buds & appetite.  Never in my life have I had to force myself to eat. Normally I love just about anything and am addicted to coffee, & chocolate.  Right now, I can't handle either one. Salt is my thing right now, I think because I can actually taste it. Lost about 5 pounds so YEAH!! One of the many things I have learned from you lovely ladies is that I will listen to my body a little closer this go around and not challenge it all the time.  I don't have to try to be superwoman. :) Well, better go accomplish something while I can and get ready for work tomorrow.  Praying everyone has good days ahead with minimal SEs. Take care Jewels. Jackie",
      "MessageIndex": 1387,
      "PostDate": "17/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Jackieb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60465/profile",
      "Content": "Jan 26, 2008 08:55AM Jackieb wrote: Hi Fabulous Febs I start chemo Jan 31 so I am jumping in February and have also posted on the Jan Jewels ( great group with lots of info you should check out). My journey has been : biopsies of two tumors in right breast, one Mammotest, the other ultrasound guided and was diagnosed November 23 2007 with IDC. Met with the Surgeon who ordered the Breast MRI and evidently I am very claustrophic,because with 10mg of Valium, I still couldn't do it. :( Had surgery on Dec 21st 2007-Quandrantectomy (double Lumpectomy) of right with reduction of left. When path came back, 1 tumor was E/P - & HER2 +, the other E/P + HER2-. Met with Onc, had MUGA scan & port put in and am starting chemo Jan 31st. The plan is Cytoxin & Adriamycin every 3 weeks for 4 and then Taxol & Herceptin every 3 weeks for 4. Then radiation for 35 treatments. remaining on H for 1 year along with Tamoxifin for 5 years. Have Chemo Orientation on Tuesday. KarenL & Dana it looks like we will be traveling very similar roads. Your info has been so reassuring. I live  in Central Florida, am 46 years old, have been married to Bob, who is my rock for 28 years and have 1 daughter Kaitlyn, who is 18 and will be graduating HS and heading off to college in June,  I work full time for the State of Florida, as an administrative assistant for a wonderful man who is so supportive, that he is going to shave his head when my hair goes.  How cool is that?? I don't think my feet have touched the ground since diagnosis, since God has been carrying me and has given me a peace about it all.  He has also provide a great support system of family & friends and now you ladies. I am ready to kick some cancer butt.  I have got a wig and some hats & scarves, but am not looking forward to losing my hair.  They can have the boobies but my \"style\" is me, if that makes sense. I am not looking forward to Thursday.  The Onc gave me Emend, Ativan & Zantac for SE so I guess I am ready.  I know the first will be the hardest.Email or PM my anytime. Hope everyone has an awesome Saturday. You are each in my prayers every day. Jackie",
      "MessageIndex": 13,
      "PostDate": "26/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    }
  ]
}