{
  "AuthorID": "jacksnana",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
  "Posts": [
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Jan 9, 2011 03:05PM jacksnana wrote: I finished TCH the end of April and by August I felt comfortable going out without my wig.   My hair is totally grown back in now, and I am grateful.  Didn't lose eyebrows and lashes during chemo, but a couple months after chemo was finished they all fell out.  They came back slowly then fell out again!  They are back now and seem to be pretty much the way the were before.  Don't know if this can help anyone, but I used Nioxin shampoo and scalp treatment/conditioner during chemo (recommended by the chemo nurse) and until my hair was totally grown back in and I continue to use the shampoo still, about every other time I shampoo my hair. I am so sorry so many of you are dealing with this.  Our hair is important to us.  I did find out during my treatment that this was a possibility and I definitely stressed about it, but oncologist and nurses said they'd never heard of it.  I don't know why they don't at least acknowledge the possibility. ",
      "MessageIndex": 44,
      "PostDate": "09/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761295",
      "Title": "Did anyone had her hair back after taxotere??? melania janet11"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Apr 28, 2013 03:27PM jacksnana wrote: I have both floaters and flashes that started about a year ago, almost three years after chemo. I also have cataracts, but had them before chemo, and they aren't bad enough yet to require surgery.",
      "MessageIndex": 1,
      "PostDate": "28/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/803955",
      "Title": "Cataracts and eye floaters post treatment Stacie doxie"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Feb 28, 2012 04:31PM jacksnana wrote: Before I started chemo, the nurse told me to use Nioxin shampoo (you can find it in the beauty shop area at Walmart).  I used it before my hair started to fall out and until it came back after chemo.  And it all came back nice and thick and really quickly after I was finished.  My last treatment was in April and by July I had enough hair to feel comfortable going without anything on my head.  Also Biotene toothpaste and mouthwash to help with dry mouth.  It tasted funny at first but I got used to it, used it until I was totally done with all my treatments.  The dentist also told me to run my toothbrush under hot water for several seconds before using it, it makes it softer and more comfortable if your mouth is sore at all.  The chemo nurse also told me to drink lots of water, at least 8 glasses per day.  I really think that helped me to feel better and I've continued to do it.  Probably should have been all along anyway! All my best to you, chemo isn't fun but totally doable!    Veda",
      "MessageIndex": 2,
      "PostDate": "28/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/783362",
      "Title": "Pre-Chemo Haircut renaedarlene Momine"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Apr 2, 2012 01:44PM jacksnana wrote: Same here, about every three months they would fall out (not totally, but very, very thin) then grow back again.  I'm almost two years out from finishing chemo and that hasn't happened for at least six months now, so maybe those cycles have run their course.  Mine never fell out during chemo, only after finishing!",
      "MessageIndex": 7,
      "PostDate": "02/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/785123",
      "Title": "Eyebrows??? Do they fall out more than once? juviben TSB1"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Sep 5, 2012 09:33AM jacksnana wrote: Mine have a tendency to bounce around a bit.  Not much out of the normal range but once in a while one of them will be a few points out.  A lot of stuff can affect them, medications, even just a tylenol or a glass of wine.  About three weeks after I had my mastectomy, my urine started to look a little dark... went to my pcp and he did blood work, my all of my liver enzymes were 4 times the high end of normal!  They tested me for hepatitis (negative), took my off my statin, and in a few weeks they went back down.  Now almost 3 years later I am back on a statin and everything is good so far. I think it was all the stuff from pretesting and surgery meds, a new statin and I think it was just the perfect storm.   Maybe yours aren't so high and that's why your doc isn't worried?",
      "MessageIndex": 1,
      "PostDate": "05/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/793009",
      "Title": "MO not concerned about liver mets with ALT AST up? bedo Alicethecat"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Aug 24, 2015 10:21AM jacksnana wrote: You're not invisible! Sorry you feel down today, we all know how that feels! This whole BC ordeal can certainly take a toll on our emotions. But thankfully you have a strong faith! I always find comfort in Psalm 34, verses 17&18. Sending you good thoughts and saying a prayer for you. I hope your test results are all clear! Please keep us posted. Veda",
      "MessageIndex": 1,
      "PostDate": "24/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/834501",
      "Title": "Hmmm 071655 Leethiel1"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Mar 17, 2015 11:09AM jacksnana wrote: Hi Realtor, my diagnosis is the same as yours and I was 5 years out last November. I will complete 5 years on Arimidex in June and we'll see where we go from there. My oncologist says most recurrences for her2 positive is in the first 3 years, so I hope I can stop the Arimidex after 5 years. My MO and I will talk about me having the BCI test done at that time to see if it gives us a clearer idea of what my chances are for later recurrence (year 5-10l). Congrats on finishing treatment, seems like the are are lots of us her2+ gals doing well now thanks to herceptin!",
      "MessageIndex": 2920,
      "PostDate": "17/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Jul 31, 2012 01:17PM jacksnana wrote: srbl62, that is wonderful news!!  Hope the aromasin is much kinder to you!",
      "MessageIndex": 623,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Jun 13, 2011 10:01AM jacksnana wrote: Hi Kasi,    This kind of being in limbo until you can see the whole picture is hard but you'll have all the info you need soon. Sometimes I can get sort of immersed in this stuff - everybody says take a break, stay off the computer, but when it's your body it's easier said than done!  Glad you're getting a second opinion and are in a progressive city where you'll get excellent care.  Sounds like you're doing everything right!!   Hang in there... keeping you in my prayers.   Veda",
      "MessageIndex": 85,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Apr 9, 2012 09:19AM jacksnana wrote: I had watery eyes for a year after finishing chemo... I always thought it was due to the herceptin.  It continued for several months after finishing the herceptin, but it rarely happens now.  Maybe it does have something to do with not having lashes, they must be there to provide some protection for our eyes, even though we focus on how nice they make us look!  Congratulations on finishing chemo, hope everything is back to normal (whatever that is!) for you soon! ",
      "MessageIndex": 1,
      "PostDate": "09/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/785509",
      "Title": "Watery eyes? Whatashocker3 Leatherette"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "May 15, 2013 09:37AM jacksnana wrote: You are doing all the right things in getting this checked out. They will know more once they do an ultrasound. i know it's hard but try not to ahead of yourself. Even if you do need to have a biopsy, 80% of all breast biopsy results are benign. The odds are in your favor, especially given your age, that you will have a benign result. But of course this is a big scary thing for you to go through! Please keep us posted... thinking of you and sending hugs and positive vibes!",
      "MessageIndex": 1,
      "PostDate": "15/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/804718",
      "Title": "23yrs old being sent for Triple check appointment. Rachel231 fd1"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Jun 5, 2011 02:57PM jacksnana wrote:",
      "MessageIndex": 14,
      "PostDate": "05/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Jun 16, 2011 05:20PM jacksnana wrote: Kasi,  chemo sounds so scary but I think you will be surprised that it's not the nightmare it used to be - it's totally doable.  Honestly, after the first one I wondered if they'd even given me anything!  There were a couple of days after each one where you might feel just a bit off, but for the most part it shouldn't affect your normal routine too much.  I still went on vacation, went to basketball games, had lunch with the girls, entertained friends, just did all the normal stuff I usually do. I had a double mastectomy with reconstruction and was totally happy and at peace with my decision - never looked back.  You are doing so great!  Keeping you in my prayers... Veda",
      "MessageIndex": 102,
      "PostDate": "16/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Nov 19, 2013 06:50PM jacksnana wrote: 63",
      "MessageIndex": 73,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Jun 7, 2011 09:53AM jacksnana wrote: Hi Kasi, I  am so, so sorry you got this news, was hoping it would be benign.  Most of us would agree that once you have a little time to absorb this and have a plan in place, it helps.  You sound like a wonderful young woman and I'm sure you are surrounded by lots of people who love you so lean on them, let them help you.  Sending hugs and prayers your way... Veda",
      "MessageIndex": 50,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Feb 28, 2012 03:14PM jacksnana wrote: Barb, keeping you in my prayers...  Veda",
      "MessageIndex": 17,
      "PostDate": "28/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/783300",
      "Title": "Freaking out - questionable nodularity Shanagirl jennyboog"
    },
    {
      "AuthorID": "jacksnana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93802/profile",
      "Content": "Jan 20, 2011 01:06PM jacksnana wrote: Boy do I relate to each and every one of these posts!  I get myself in such a state... I know it's really bad for me because I believe stress has such a negative impact on our immune system and every part of our health and well being, but I cannot control it.  Not just worrying about me, but about every little thing that could possible go wrong my kids, grandson and husband.  Sorry all of you are going through this also, but at least I don't feel like I'm the only one.  Wish they made counseling a part of our treatment, I'm sure I could benefit but at this point I'm so neurotic I'd be afraid they'd find some mental disorder!  Hopefully this all gets better the further out we remain healthy and cancer-free!  All the best to all of you... Veda",
      "MessageIndex": 12,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763424",
      "Title": "Panic at ANYTHING medical related bookgirl frustratedrg"
    }
  ]
}