{
  "AuthorID": "Jackiegray",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191470/profile",
  "Posts": [
    {
      "AuthorID": "Jackiegray",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191470/profile",
      "Content": "Dec 7, 2013 04:47PM Jackiegray wrote: since my last post final pathology is in...each of the 3 sections carried a different pathology. ALH, ADH AND LCIS. BS has referred me to a specialist in downtown Cleveland. My appointment is Monday. It has been 4 weeks since my surgery I have a HUGE hematoma that is quite painful. I am exhausted I can't sleep because all I think about it is how can I make this decision? My head tells me I'd be insane to not have the PBMX. Then my insecurities take over and I think there's no way I can go through with this. I met with my BS on Wednesday she tells me it isn't a question of if you get breast cancer it's a question of when? What is wrong with me this decision should be easy?",
      "MessageIndex": 15,
      "PostDate": "07/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/814179",
      "Title": "Prophylactic Mastectomy questions sdekans1 hopedreams"
    },
    {
      "AuthorID": "Jackiegray",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191470/profile",
      "Content": "Nov 16, 2013 01:44PM Jackiegray wrote: Hi everyone 17 months ago I had biopsies on both breast. Pathology was ALH. Recommended treatment was 6 month mammograms and breast exams. 1st mammo was all good. 2nd follow up mammo showed 3 large clusters of microcalcifications. I had an open excisional biopsy Monday. BS removed 11/2\" mass of tissue from my right breast. Preliminary path is back ADH. I have a strong family history (Mom, Aunt) of BC. Surgeon has given me 2 options wait and see continue 6 month mammos, or bi-lateral nipple sparing masectomy. I had a brain tumor 7 years ago and have DVT. I can not take tamoxifen. I also have Lupus. I am leaning more towards the NSM due to I feel I am fighting a losing battle. In less than a year and a half I have had a total of 5 biopsies. This set of microcalcifications were larger and more spread out and grew in a short period of time. I feel like it is only a matter of time before it is DCIS and I will no longer be a candidate for the NSM.",
      "MessageIndex": 5,
      "PostDate": "16/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/814179",
      "Title": "Prophylactic Mastectomy questions sdekans1 hopedreams"
    },
    {
      "AuthorID": "Jackiegray",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191470/profile",
      "Content": "Dec 8, 2013 01:31PM Jackiegray wrote: I feel incredibly blessed to have 'met' you all...at this time yesterday I was overwhelmed. Today I feel empowered by your support and honesty. I am so thankful to each of you and am actually looking forward to my appointment with the surgeon tomorrow.",
      "MessageIndex": 19,
      "PostDate": "08/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/814179",
      "Title": "Prophylactic Mastectomy questions sdekans1 hopedreams"
    },
    {
      "AuthorID": "Jackiegray",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191470/profile",
      "Content": "Dec 7, 2013 08:22PM Jackiegray wrote: thank you farmerlucydaisy you are the second person who has told me (the first being my BS nurse) a woman with BC DX would trade places in a heart beat. 2nd opinion on Monday. More people have seen my breasts in the last 4 weeks than in my whole life! Ugh!",
      "MessageIndex": 17,
      "PostDate": "07/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/814179",
      "Title": "Prophylactic Mastectomy questions sdekans1 hopedreams"
    },
    {
      "AuthorID": "Jackiegray",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191470/profile",
      "Content": "Jan 5, 2014 07:34PM Jackiegray wrote: I'm not going to lie I'm pretty sore. It's the tissue expander a that are causing my discomfort. That being said each day is easier than the one before. What day is your surgery? ",
      "MessageIndex": 27,
      "PostDate": "05/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/814179",
      "Title": "Prophylactic Mastectomy questions sdekans1 hopedreams"
    },
    {
      "AuthorID": "Jackiegray",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191470/profile",
      "Content": "Jan 5, 2014 06:52PM Jackiegray wrote: beans I am 42 as well. I am 2 days post op from a PBMX. I woke up from surgery like a huge terrible burden had been lifted off my shoulders. ",
      "MessageIndex": 25,
      "PostDate": "05/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/814179",
      "Title": "Prophylactic Mastectomy questions sdekans1 hopedreams"
    },
    {
      "AuthorID": "Jackiegray",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191470/profile",
      "Content": "Jan 6, 2014 03:15PM Jackiegray wrote: beans breathing is tight. Ask for a spirometer. It helps clear all the gunk from your lungs. I just got home. My bed never felt so good. I am ready to switch to Advil only for the pain I hate narcotics. Private message me any questions. I am an open book. I was blessed to have a private message buddy through my experience. She was an amazing source of comfort and information. Thanks for the cheers of joy! ((Hugs)) Jackie",
      "MessageIndex": 29,
      "PostDate": "06/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/814179",
      "Title": "Prophylactic Mastectomy questions sdekans1 hopedreams"
    }
  ]
}