{
  "AuthorID": "jackboo09",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
  "Posts": [
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Sep 9, 2012 01:47AM jackboo09 wrote: Hi everyone This is my first time posting on this thread. I am waiting for a referral as my upper arm is slightly swollen. I am 18 months post surgery. I am scared because my friend has LE on whole arm. Not sure if my current situation means a sleeve straight away? Im 42. Liz",
      "MessageIndex": 1507,
      "PostDate": "09/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Sep 11, 2012 04:58PM jackboo09 wrote: Hi Thanks to everyone who has welcomed me and responded. I live in the UK and have just been told I have a 4 week wait to see a LE therapist. Very worried that I am going to end up with major LE. Our wonderful National Health Service for you! Anything I can do to self treat? Liz",
      "MessageIndex": 1525,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 30, 2017 10:54AM jackboo09 wrote: Hi Janis, Do you think I should ask about ovaries out again. My onco has said start THP THENhormonal to follow. They are kinda thinking that chemo will put me in to menopause, maybe it's not possible to do both at same time? Thanks for such positive posts. L x",
      "MessageIndex": 6,
      "PostDate": "30/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853660",
      "Title": "Herceptin for Triple positive mets lisajo6 jackboo09"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Jun 3, 2017 06:13PM jackboo09 wrote: Thanks Z, One day at a time is all I'm aiming for but I'm doing well so far with more good/ normal days than bad. Interesting point about hydration. During my chemo infusions I take on plenty of fluids. What I find surprising is that I am usually the only patient who does so. L x",
      "MessageIndex": 964,
      "PostDate": "03/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Jun 23, 2017 02:32AM jackboo09 wrote: Hi everyone Checking back on this thread after short absence. I am still in active THP tx so exercising is a little up and down week one but thereafter I am managing 7-10K steps most days. Just had a Lymphedema appointment and my arm is about 11% bigger. Hardly any leap from the previous highest reading which was 10. Steroids and a recent, unusual heatwave here in the U.K are contributing factors. New sleeve ordered and hope to start in a gym/ swimming once I finish the Taxotere and move onto maintenance HP. I get scan results today and will post on the shadow is recurrence thread. Love to you all Liz",
      "MessageIndex": 998,
      "PostDate": "23/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "May 16, 2017 12:20PM jackboo09 wrote: Hi ladies My name is Liz and I an jumping on this excellent thread. I was dx with a recurrence in my internal mammary lymph node in March and am due for my second THP on Thursday. My goal is to eat nutritious food and to move everyday. Today was 6k steps. I am only walking at the moment but plan to mix it up as I think doing more exercise and having fun with it will help me beat the blues. Z- as you know yesterday was a low mood day and I've paid for it with a migraine today. However I pushed through and got outside and with your support feel much better today. Eating a bowl of blueberries as I speak. I live in the UK and am currently getting Perjeta as part of the Cleopatra trial. I have 3 teenage children. My boys sat their first high school exam today( GCSES) So hello to everyone- I believe I have chatted with some of you before but want to contribute regularly, although early post chemo days I struggle. Oh and finally I think I have the onset of some neuropathy. Yuk... Liz",
      "MessageIndex": 857,
      "PostDate": "16/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "May 20, 2017 12:36AM jackboo09 wrote: Just checking in. Day 2 post THP chemo. Feeling rough. Sleep issues as it is 5.30am now for me and have struggled with steroids. I am flushed in face and chest and fatigue setting in. The change is hard to take having regained fitness at end of cycle 1 to a significant degree. So I wil aim for shuffling around the house and a possible trip to store with Richard ( husband) but I'm determined to stay positive and I'm going to lol into meditation, a yoga instructor who could come to my house and more tasty nutritious food. I need more ideas on meals I can prepare in advance as I'm struggling to cook in eve. But I get lots of help and support so the only pressure there is what I put on myself. Have swapped to organic chicken which is double the price but I'm eating that from now on. Z- the yoga in the sauna sounds amazing and I'm in awe generally of everyone's efforts on this thread. Looking forward to dropping my BMI and mixing up exercise. I like cycling and did Pilates years ago so these are on the plan. Sending best wishes Liz x",
      "MessageIndex": 877,
      "PostDate": "20/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "May 24, 2017 02:13PM jackboo09 wrote: Mara, Z and Micmel, I am so uplifted by your comments. Thank you so much.... I am heading off for an evening walk shortly, a more gentle one than this morning. My mum has given me these elastic band things for stretching. Will need to google some exercises to go with them. I think it's a kind of resistance training thing- sorry there must be an actual name for it. As yet I'm stuck with walking and cycling. Need to look into yoga and maybe martial arts I think. Liz x ",
      "MessageIndex": 926,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "May 17, 2017 10:29AM jackboo09 wrote: Combined my appointment with a psychologist ( first one) with a lovely trip around the historic city of York. Walked 12k steps and feel better for getting out the house. Also bought a pair of jeans in a smaller size which is also a mood enhancer. Nervous about tomorrow. Tx number 2. ",
      "MessageIndex": 866,
      "PostDate": "17/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "May 24, 2017 10:43AM jackboo09 wrote: Hello everyone, Today is day 6 Post 2nd chemo. Here is a photo of me about to walk in the hot Spring sunshine. I am wearing a baseball cap because hair very thin. Well I managed 4k steps and then felt exhausted but the sciatica type pain I had yesterday has resolved. Then at 1pm I had my head shaved and am pleased to say I love my wig. Love to all x",
      "MessageIndex": 919,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Jun 2, 2017 01:37PM jackboo09 wrote: Hi I've been quiet. Trying to keep moving and did 7.5K steps this afternoon. Then I came home to a scan appointment letter and I swing back down again. Why have I been given this appointment so soon? It will be day 4 post treatment for me. Got to get a grip but just the letter had freaked me out. It also says abdom on it. I have a mild concentric thickening on upper GI which they think is a hiatus hernia. The PET scan on April 13 DID NOT light up and my onco actually called me to say I had one area of concern. So does anyone know if abdom is routine? Yikes!!! Liz x",
      "MessageIndex": 955,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Jun 2, 2017 05:33PM jackboo09 wrote: Hi Micmel I am very touched by your support. My UK friend seems to think that a chest/abdom CT is fairly standard. I'm hoping that it still stands that the GI thickening didn't light up on that April PET and that this latest CT doesn't reveal anything more worrying. I will walk tomorrow morning as I did today and try yet again to put all this out of my head. So hard to just go with the flow isn't it and yes this is a truly crappy disease we are all dealing with. Liz x",
      "MessageIndex": 957,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Jun 2, 2017 06:36PM jackboo09 wrote: Hi Micmel I expected another PET scan to be honest because the onco wanted a PET as a baseline before I started chemo. Therefore I assumed I would have a follow up PET at the half way point. I don't know which is cheaper as we have the NHS system here in UK. It will mean another needle though and my veins are already poor. I also don't like the contrast. For me the whole thing about scans is scary. I will need to learn to get used to them. I will think of all the amazing people I have chatted to on here as I go through it and know that I've looked after myself as far as exercise and diet go. Having said that I did enjoy cake today!!!!!!!",
      "MessageIndex": 959,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "May 7, 2018 04:57PM jackboo09 wrote: Hi Jenn, Thank you for posting your wonderful update. When I was dx stage 4 in March 2017 you were kind enough to respond to my questions and, like others on the boards, I consider you a friend. I am delighted to hear about your exceptional response. This is truly wonderful news. My experience on this forum has been incredibly positive and that is what we should all be holding onto here. We are all in the same boat, whilst excepting that there are many different vessels in the harbour. As for those who have posted on Jenn’s thread, I would like to wave a collective hello to all the names I see on here. So many recognisable ‘ faces’ over many months and even years; public posts, private messages where we have stood together against this crappy, unpredictable disease. Best wishes to you all and long may we continue to lift each other in this journey. Liz x 💐",
      "MessageIndex": 67,
      "PostDate": "07/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864357",
      "Title": "I am a miracle?? Ok, I'll take that!! JeninMichigan Moderators"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "May 24, 2017 10:44AM jackboo09 wrote: My wig!!",
      "MessageIndex": 920,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 4, 2017 03:06PM jackboo09 wrote: Hi Chrissyb I am very grateful for your reply. I remember now the strength I got from this forum years ago. To log on and see replies is heartwarming. Yes I had 3 weeks of rads. I wish it could be anything other than a cancer but it's highly suspicious and could be the cause of this DVT. I face a long wait until they feel it's safe for biopsy.  Best wishes to you and thank you.",
      "MessageIndex": 3927,
      "PostDate": "04/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 4, 2017 10:38PM jackboo09 wrote: Hi again Chrissy, You are right to see the BC team's scrutiny as a positive thing. It is so easy to look on the dark side. There is a multidisciplinary team meeting about my case and I may know what the plan is by midweek. I am trying very hard to be posititive, for example just one area of concern at the moment. I just feel like there are so many uncertainties, I am a teacher and that's why I like to be in control. Do you know why where the lung posts are at all",
      "MessageIndex": 3932,
      "PostDate": "04/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 10, 2017 11:50AM jackboo09 wrote: Hi Chrissy Yes I have only known for 2 days and still do t have lab results back yet. My BC nurse has just chatted to me and that helps. I am praying that a thoracic surgeon will be able to operate on my chest. I do think that would be scary but mentally it would make me feel better. I know it wouldn't mean that further spread would be halted but I think survival times would improve. This shadow isn't too deep, so much so that they tried to see it on ultrasound. Keeping the teenagers out of this one for now as they are taking exams. 16, 15 and 14. My youngest worries me- my girl. I have to fight for them. Liz",
      "MessageIndex": 3964,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 13, 2017 02:20PM jackboo09 wrote: Hi Chrissy Tomorrow looms. Trying to hold it together, just very scared to the point of feeling like I cannot walk in that room. Richard will be with him. I pray for some positives and for the strength to face this all again. I may be 46 but o feel like a child. Lucy came in from school and we had a cuddle, she is 14 but still needs her mum. Hugs to you x Liz x",
      "MessageIndex": 3982,
      "PostDate": "13/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 4, 2017 10:46AM jackboo09 wrote: Hi It is 6 years since I posted. I developed pain in my lymphedema arm which then led onto a DVT in my neck whilst on my 6th year of Tamoxifen. A CT scan now shows a 29mm shadow behind breast or lung, they do t know yet. I am in total shock and praying it is bad chest infection from Jan. So I now have to wait for their advice on when to stop blood thinners in order to do a CT guided biopsy. I can't see any hope right now. Any thoughts most welcome.",
      "MessageIndex": 3923,
      "PostDate": "04/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 10, 2017 09:20AM jackboo09 wrote: Dear Chrissy Thank you for the comfort you have given me in replying. I am swinging between being a bit optimistic to being terrified. I font understand how I am supposed to adjust. 2 weeks ago I was teaching full time and now I feel I'm facing being ill again even though I now feel well. My kids don't deserve this either and don't know yet. I may have to get some medication to calm me. Wanting to rewind to when I was able to just be. Your story has given me hope. Liz",
      "MessageIndex": 3959,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 10, 2017 12:26PM jackboo09 wrote: Hi DivineMrsM Glad to hear from you. I have been given diazepam 10 mg but haven't filled the prescription. I'm already on blood thinners and am concerned about side effects. Anti anxiety pills are really what I need as it's the anxiety swings that are making things difficult. For example, yesterday I had a CT guided biopsy. I felt dreadful as we arrived at the hospital; to the point of collapse. I managed to calm myself down as the Dr turned out to be an acquaintance of my husband and we had some banter over playing tennis! Then today I am back to despair even though Richard has been at home with me today, husband I mean. Liz",
      "MessageIndex": 3965,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 14, 2017 10:00AM jackboo09 wrote: Hi Liz here, my results have been delayed and won't be ready now until Wed! My husband has an important audit at work on Wed too. All this is just too cruel.",
      "MessageIndex": 3990,
      "PostDate": "14/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 10, 2017 07:04AM jackboo09 wrote: Hi I am not yet diagnosed stage 4 but it's highly likely. I had a chest biopsy yesterday but have been warned to expect it to be cancer. I am swinging between some hope that there is only one small area not too deep into chest and complete terror about its location. My BC consultant has talked about living years and treatment options but I haven't read much about this location. I get some tumour biology results on Tue but in the meantime can anyone tell me down a little. Can I hope that they will be able to get it under control? Liz",
      "MessageIndex": 3957,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 12, 2017 11:47AM jackboo09 wrote: Hi Chrissy Thank you for your reply and for continuing to reach out and support many women on this forum. In between my post and this one I have taken Lucy out for lunch and had a good chat. I have put her in the picture with what I know and what I am dealing with and her reaction was better than I expected. She is a tough cookie and quite a logical child. I have suggested that she visits my brother and his fiancée in Wales over the Easter weekend. It would be a break for her. I will go if I'm able but I suppose I would be in treatment so may not be able to. The boys will be busy revising for their GCSE exams. Both are 16 yrs old. If I can see all 3 enjoying life, away from worry I will deal with it easier I think. Throughout all this, counselling has not been mentioned. There should be a service available for people given this news but our National Health Service is already severely stretched. Accident and Emergency departments across the UK are at crisis point. I really took on board your point about women feeling better a few months out from this first dx. It's just that I'm frightened about feeling ill with the treatments but then again I'm frightened by the whole thing. In theory I beat this disease once, or stopped it in its tracks. After 6 years I was so very sure that Herceptin was my saviour! Maybe it can work again? Thank you again, it helps so much to talk. Liz",
      "MessageIndex": 3970,
      "PostDate": "12/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 12, 2017 03:59PM jackboo09 wrote: Chrissy, You are making a lot of sense and helping me get through this- I think the key difference here is perspective. You are years on from this Stage 4 dx and can relate to the initial shock and how to deal with it. Good to know that you approve of my chat with Lucy. Although a personal decision; it's good to know that others think you have done the right thing and it's lifted the element of pretence that I have been carrying around with me! It wasn't as bad as I expected, although Tue will be hard. The gentler chemo regime has me both hopeful and a little concerned. Having chemo again really scares me. It's the thought of things going wrong and ending up in hospital and all the side effects. So gentle sounds good. On the flip side is there any mileage in going for a strong regime if I only have spread to one area? I will wonder whether the docs are more concerned for being gentle over best results. Is it unrealistic of me to hope for NED, perhaps if I can have surgery, followed by other treatments? Anyway I am second guessing for England here so will have to wait and see. Sending hugs back to you across the miles! Liz x",
      "MessageIndex": 3974,
      "PostDate": "12/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 13, 2017 02:40AM jackboo09 wrote: Hi Chrissy, Yes I need to hold on to the many treatment options that are available and if I am Her 2 again then my past history suggests that these drugs do work. Thanks for the note about gentler chemo. I am making some false assumptions here and jumping the gun before I have the whole picture! My breast care nurse says it's because I am a teacher and I love to plan. I have been given lots of great advice on this forum and being off work now means that I have the time to look into various options. The clinic in Manchester has excellent facilities but I very much doubt it as a treatment option because of cost. However I may well use its second opinion service. The cancer charities are one avenue of support and will be able to help me navigate financial matters. Macmillan offer grants and as yet I'm not sure what benefits I may be entitled to. The story of your dear friend is uplifting and I do hope she continues to do well. 6 daughters- goodness me, she must be one busy mum! My family and I have a holiday booked in August, in England so no foreign travel. I live in hope that we can go. It is a company called Center Parcs. They have a number of holiday villages set in acres of woodland and we love the whole family friendly set up. I am frightened about getting my results tomorrow because I think I will swing back down again. When I think about walking in that room I feel running in the opposite direction. I know my husband is hoping for a surgical option but we have been told it is unlikely. For me, the location of this mass is adding to my fear, but as you said treatment does work for many. I have only come across one other person who I believe had this kind of mets, but again I may be confused? I had one positive intra mammary node in 2011 and so it appears that the route has been through lymph nodes into the chest area. All very scary. Thank you Chrissy for holding my hand through this. Love Liz",
      "MessageIndex": 3980,
      "PostDate": "13/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 4, 2017 06:00PM jackboo09 wrote: hi again It is difficult to deal with this over a weekend somehow. I was also given false reassurance by the team dealing with the clot. They ordered the CT and told me it was all clear. Unbeknown to me they then passed it to the BC team who had a multidisciplinary meeting last Wed and discussed this \" shadow\". This has made the shock worse. I know I can't change this but I am not coping. I have hardly slept and feel sick at the thought of resuming treatment. I also can't seem to find many ladies with a reoccurrence in either lungs or behind breast? Perhaps I should try and get some anti anxiety meds",
      "MessageIndex": 3929,
      "PostDate": "04/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 4, 2017 06:14PM jackboo09 wrote: I was just wondering if anyone can shed any light on the vagueness of where my suspicious shadow is supposed to be. I've been told it is either behind the breast- does this mean chest wall or the lung itself. I'm scared because I can't find many examples of lung issues. they have said its only this area at the moment- can I gleam any hope in that",
      "MessageIndex": 3930,
      "PostDate": "04/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 12, 2017 08:37AM jackboo09 wrote: Hi to everyone, I am posting a pre results update, awaiting results for this shadow on my lung and really just wanting to talk with you all. Still in the dark. I find out biology of tumour on Tue. In the meantime I am on high dose blood thinners for this clot which is causing me fatigue and I seem to have bowel issues, lost some weight too. This medication in itself is a challenge as I am on a higher dose of a Rivaroxaban for another 9 days before I swap to a lower dose. My husband has been amazing but I think he is beginning to crack: he has just gone to the gym and is quiet. My 14 year old girl appears to have no friends and relies on me to take her out at the weekend. She really worries me. I am trying so so hard to be positive but it is like my world has stopped and already the relationships around me are changed. I am über clingy with husband and I have to try and pull back I think. Ideally I would suggest a holiday for us right now but I'm only at the beginning of my treatment- the very beginning. I looked into a private clinic in Manchester last night. Perhaps just for their second opinion service. I have a shred of hope that this could be benign but something has caused this clot and I'm prepared for it being mets. Chrissy I know you have said there is hope for me to return to something of the life I had just 2 weeks ago- will that be or am I at the start of becoming ill again with treatment. I want to start SOMETHING as soon as I can but I'm premenopausal so even anti hormonals won't be an immediate option, injections to switch my ovaries off was discussed. I love my family beyond words and I don't want any of this for them. I am sorry for the negativity guys- only you ladies will understand.  Liz",
      "MessageIndex": 3967,
      "PostDate": "12/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 12, 2017 01:55PM jackboo09 wrote: Icietla, Thank you Will ask about support when I get results. It's horrible going to a place ( hospital) and waiting for this kind of news. L x",
      "MessageIndex": 3972,
      "PostDate": "12/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 12, 2017 04:57PM jackboo09 wrote: Hi Mara So great to hear that you are NED. Thank you for posting. I am trying to remain optimistic. Is it possible to have the Her 2 drugs without chemo? My breast care nurse talked about single agent chemo given alongside Herceptin. I did well on Herceptin, just a runny nose and tiredness on infusion day. My \" shadow\" is in my chest/ possibly in an internal mammary lymph node. Maybe that makes it more of a candidate for full systemic treatment. 6 years ago the docs were saying that the future was mono clonal therapy and that it would be given without chemo. Forgive me, I don't know enough about this yet. I had hoped to never need it! Best wishes Liz x",
      "MessageIndex": 3976,
      "PostDate": "12/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jackboo09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126745/profile",
      "Content": "Mar 14, 2017 10:44AM jackboo09 wrote: Chrissy, My mum is on her way round. Trying to take it in baby steps x",
      "MessageIndex": 3992,
      "PostDate": "14/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    }
  ]
}