{
  "AuthorID": "JacquelineG…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
  "Posts": [
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Sep 27, 2009 10:02AM JacquelineG wrote: Hi there, I have some joint pains too. Lately I've felt it in my right hip and that's worried me (especially since next week is my 3-month and I'm concerned my onc will want to scan me) but today I walked for a while and it didn't bother me at all. These last 2 weeks I haven't exercised much because I had my exchange surgery, and those are the weeks I felt the pain -- so exercise does seem to help!) Everyminute, do you remember when you were allowed to run after your exchange surgery? I forgot to ask my PS and I'm getting very antsy after 2 1/2 weeks! Jackie",
      "MessageIndex": 12,
      "PostDate": "27/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/740936",
      "Title": "Still pain, when will it go away... Mamita49 lexislove"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 23, 2010 05:40AM JacquelineG wrote: I hear you Helena! I go through my ups and downs, and just when I feel like I'm going through a bit of a rut and think of doing something about it, I have some good days and forget about it for a while (never completely forget though). But yes, this is a grieving process and like you, I had never been sick before and really dislike the hypochondriac that I've become. But I can see a light at the end of the tunnel for us - the more time goes by, the better we will feel for more extended periods of time. About the hip pain, I'm on Tamoxifen, but I do hear some people experience hip pain with it. I'm comforted by the fact the pain goes away for days and sometimes weeks at a time... And yes, all those pains are normal - the mastectomy severed all those little nerves around the breast area and some of them will slowly regenerate and cause twinges of pain - that's how my BS described it.  Very exciting that your reconstruction is coming up! Jackie",
      "MessageIndex": 17,
      "PostDate": "23/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750105",
      "Title": "A Pain in the Rib helena67 MaineCoonKitty"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Apr 10, 2011 08:40PM JacquelineG wrote: Beautiful Mary :-)",
      "MessageIndex": 11,
      "PostDate": "10/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/767272",
      "Title": "Photo shoot for newspaper interview everyminute everyminute"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Sep 27, 2009 06:48PM JacquelineG wrote: Congrats everyminute! I'm training for the 3-Day walk in Atlanta... a half marathon is still daunting to me but I hope to do one someday! I'm excited to finally do a Susan G. Komen walk -- I haven't done any yet since I was diagnosed. I have been overwhelmed by the support I've gotten. I dreaded the fundraising part but it's been easy to reach my goal! Anyway - 13.5 mile practice run -- that's awesome! Jackie",
      "MessageIndex": 18,
      "PostDate": "27/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/740936",
      "Title": "Still pain, when will it go away... Mamita49 lexislove"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Oct 11, 2012 05:14PM JacquelineG wrote: oh i absolutely love your post, Weesa!!  I love your honesty, because I'm not always that conscientious myself and certainly have my pangs of guilt! I am so excited for your 10 years! I too had big nodes surrounded by cancer and a very high Ki-67. Reading a post like yours gives me SO MUCH hope and I will toast to you with my wine glass with no guilt whatsoever!!  CONGRATULATIONS!!!! what a fantastic milestone! Keep living life!!! jackie",
      "MessageIndex": 2,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/794824",
      "Title": "Postcard from the edge of ten years out.... weesa lifelover"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 22, 2010 06:51PM JacquelineG wrote: Helena, I'm a year out from radiation and I get all those weird pains too - the rib soreness and the weird stabbing pains around the whole breast area. I was also those weird pains could be some of the nerves which are regenerating - could be happening for an extended period of time. we are so aware of every little ache and pain in our bodies aren't we? I have pain in my hip from time to time that i'm almost positive is hip bursitis but still one wonders.... Jackie",
      "MessageIndex": 15,
      "PostDate": "22/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750105",
      "Title": "A Pain in the Rib helena67 MaineCoonKitty"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 9, 2010 08:46PM JacquelineG wrote: I did the 3 day in Atlanta last October. An incredible experience. I HIGHLY recommend it. I will be doing it again this year and hopefully for years to come! I didn't start training until end of August, beginning of September. I ran about 3 miles pretty regularly at the time, but mainly did long walks on weekends with a friend who walked the 3 day with me. We would do mainly bet. 5 and 7 mile walks the month before, and the longest walk was a 10 miler. I felt very ready by the time the walk came around. Which city are you walking in? Jackie",
      "MessageIndex": 3,
      "PostDate": "09/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/749517",
      "Title": "Have you done/are you planning on doing the Susan Komen 3-Day? bejuce JacquelineG"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 9, 2010 08:47PM JacquelineG wrote: oh, and my avatar pic is from the end of the walk, being greeted by my kids. It was amazing!",
      "MessageIndex": 4,
      "PostDate": "09/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/749517",
      "Title": "Have you done/are you planning on doing the Susan Komen 3-Day? bejuce JacquelineG"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 26, 2009 05:44AM JacquelineG wrote: I had a positive IM node as well. They found it during a PET scan after my mastectomy. They did not remove it surgically but I had a scan after chemo and it was GONE. I also had radiation of the IM nodes just for reinforcement. I had axillary nodes positive as well but I know of people that just had 1 IM node and no axillary nodes -- that is definitely a possibility! Try not to worry too much -- there are definitely options to treat this. My surgeon told me not to get too caught up in articles about IM nodes - most are outdated!",
      "MessageIndex": 4,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/731352",
      "Title": "The Hits Keep On Coming....HELP! shadow38 Tabbygirl521"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 26, 2009 06:04AM JacquelineG wrote: Hi - Just want to add, there's a really good chance yours will be BENIGN!! But even if it weren't, just wanted to reassure you there's a lot they can do and prognosis is not necessarily worse. But like Janet said above, until they know for sure, try not to worry.",
      "MessageIndex": 5,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/731352",
      "Title": "The Hits Keep On Coming....HELP! shadow38 Tabbygirl521"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 1, 2010 08:53AM JacquelineG wrote: Hi Pure I wasnt' able to access that article either -- even with the www  thanks for starting this thread though! Jackie",
      "MessageIndex": 6,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/749073",
      "Title": "Important Research Articles Pure Pure"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 1, 2010 08:50AM JacquelineG wrote: Love that study Kerry! Thanks for posting!",
      "MessageIndex": 5,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/749073",
      "Title": "Important Research Articles Pure Pure"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Sep 8, 2012 06:33AM JacquelineG wrote: They initially thought I just had DCIS, then stage 1 and I ended up with Stage 3c - it was a huge shock but 5 years later I have my life back and you will too:-) Jackie",
      "MessageIndex": 14,
      "PostDate": "08/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/793125",
      "Title": "Just got the news... Charliestweetie pp729"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 2, 2012 06:57PM JacquelineG wrote: Congratulations!!!!!:-) 3 years feels good!",
      "MessageIndex": 16,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782024",
      "Title": "3 years , and many more to come Mamita49 Mamita49"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 14, 2010 10:31PM JacquelineG wrote: Happy Valentines Day to all of you ladies! Jackie",
      "MessageIndex": 22,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748331",
      "Title": "Happy Valentines Day KerryMac JacquelineG"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Jan 17, 2012 07:56AM JacquelineG wrote: yay!!! Congratulations!!! jackie",
      "MessageIndex": 12,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781155",
      "Title": "4 YEARS!!! DCMom Kay_G"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Dec 7, 2009 11:23AM JacquelineG wrote: Hi Kimber! Another Stage 3er diagnosed at 39. My kids were 8, almost 7 and 2. I'm 18 months out and feeling great! You'll get through this! Jackie",
      "MessageIndex": 24,
      "PostDate": "07/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744994",
      "Title": "I'm so happy to find you guys! kimber3006 tchmuzik"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Oct 4, 2009 04:58PM JacquelineG wrote: I pulled my report today too! It's so interesting how different places do different things. Mine says nothing about Luminal A or B but I am 60% ER+ and PR- (0). Mine does have Ki67 (77% - yikes). And one of my axillary lymph nodes was over 2cm -- bigger than my tumor! OK -- I think I'm putting this baby away forever now... Jackie",
      "MessageIndex": 13,
      "PostDate": "04/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/741344",
      "Title": "making friends with your path report weesa Pure"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 24, 2010 09:08PM JacquelineG wrote: What a wonderful story - thanks for sharing!!! Jackie",
      "MessageIndex": 7,
      "PostDate": "24/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748905",
      "Title": "Checking in wallan SoCalLisa"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Jan 26, 2011 12:14PM JacquelineG wrote: I'm BRCA2 postive too! Yes, it's no fun to get the news... I was shocked, as I was the first in my family to get BC -- no breast or ovarian cancer in my family at all!! My parents were tested and my dad was the carrier. My sister is positive too. She had a prophylactic mastectomy last year and will have her ovaries removed once her 3rd child is born (she is pregnant now). I didn't find out I was positve until after my single mastectomy so I had the other side done one year later and ovaries removed at the same time.  The oophorectomy was a piece of cake (laparascopic).  Feel free to PM me if you have questions!! I know it's hard to swallow but once your shock is gone and you go through your surgeries, our prognosis should be no different than BRAC negative people -- that's what my oncologist has told me! take care,  Jackie",
      "MessageIndex": 2,
      "PostDate": "26/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763960",
      "Title": "Any BRCA+ women here? Rachel1 elmcity69"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 2, 2010 02:54PM JacquelineG wrote: Congrats Mary! What a relief! My onc doesn't do TMs. Sometimes I'm glad, sometimes I wish she did! Like everything else it's a love/hate relationship. I do wish I had that peace of mind sometimes though! Just had my 3 month checkup and they didn't even do a blood test (I had complications w/ one of my implants and surgery 3 weeks ago so i suppose everything looked OK w/ my blood test then). It was a bit disconcerting that she said I was doing well just by talking to me and feeling for lumps... but I'm taking her word for it!  have a great night! Jackie",
      "MessageIndex": 14,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747703",
      "Title": "Tms everyminute Gitane"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 3, 2010 10:45AM JacquelineG wrote: Hi Kandy, I had a dry cough that developed about 2-3 months after radiation. I was concerned but my rads oncologist was pretty confident it was from rads. He said the radiation can affect the lining of the trachea temporarily (something about thinning out the lining that would usually trap particles, like the bronchi) and cause you to develop a cough. I'm happy to report my cough is now completely gone (i probably had it close to 6 months on and off). Try not to worry! jackie",
      "MessageIndex": 7,
      "PostDate": "03/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747662",
      "Title": "Any advice? Kandy JacquelineG"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Jan 4, 2011 03:58PM JacquelineG wrote: Kerry I've been off the boards for a couple of weeks (NY for Christmas!) and just seeing this but I want to echo what everyone has so eloquently said! You are wise, comforting and just completely delightful! I don't even 'know' you but I love you :-) Jackie",
      "MessageIndex": 40,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762526",
      "Title": "Two years ago.... KerryMac geewhiz"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Jan 16, 2009 01:37AM JacquelineG wrote: I received 3 FEC and 3 Taxotere as well. I live in Atlanta, GA and have heard that FEC/T is being used more and more here in the U.S. as well. Side effects: FEC-- mainly nausea, general weakness, some night sweats (especially after the first round) and just an overall feeling of discomfort. The first round was the hardest, the following 2 not as bad. Oh, and I felt great after 1 week, so it was nice to have 2 good weeks before the next round... I took Emend and Zofran for nausea, which seemed to help a lot. Taxotere had very different SE's. More flu-like symptoms, joint and muscle pain (but only for about 10 days or so -- after that I felt fine). Although the first Taxotere was tough, it was nice not to have the nausea! I got some of those icky side effects like darkening of nails and watery eyes, but it really wasn't too bad. The last 2 Taxoteres were a lot easier to bear.  Chemo is no picnic, but I promise, it's worth it! My first PET scan after mastectomy revealed a positive mammary lymph node (aside from my 6 positve axillary nodes) so I was very freaked out knowing I still had cancer in my body. BUT I had another PET after chemo, and the lymph node completely cleared up -- no sign of cancer!! So every little discomfort was worth it!! You'll do great, Kerry! Jackie",
      "MessageIndex": 7,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/727401",
      "Title": "Starting FEC-T tomorrow.... KerryMac pip57"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 10, 2010 02:50PM JacquelineG wrote: My story is similar:  I had my 3rd child in 06, breastfed for a while (almost 15 months) and wasn't diagnosed until 08, Stage 3 by then. I was actually advised by my OB to get a baseline at 36 but then got pregnant, had a miscarriage, got pregnant again and then had my 3rd, so with breastfeeding, I didn't get the mammogram until I was 39. At the beginning I was very hard on myself for this, but now I'm trying to look forward. Thank goodness for all the Stage 3 ladies who are out 5, 6 7+ years and encourage us every day!",
      "MessageIndex": 10,
      "PostDate": "10/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/749546",
      "Title": "Were you Pregnant 2 years prior to your diagnosis? Pure KerryMac"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Sep 8, 2011 05:53AM JacquelineG wrote: Congratulations!!!!! That's wonderful! I had nipple reconstruction in May and will have tatooing done this fall.... I'm already feeling that feeling you have .... it's awesome!  Jackie",
      "MessageIndex": 9,
      "PostDate": "08/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774380",
      "Title": "My Breasts finally past the finish line!!!!!!!! faithfulheart faithfulheart"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 30, 2011 02:24PM JacquelineG wrote: Happy Birthday Mary!!! You are a role model to me and so many others!!! Jackie",
      "MessageIndex": 21,
      "PostDate": "30/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/766808",
      "Title": "Happy Birthday to me.... everyminute Beverly11"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 11, 2012 09:40PM JacquelineG wrote: Bugs you said it girl!! Agree with you 100% on every point. Lots of inaccurate statements by Barbe1958..",
      "MessageIndex": 97,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780849",
      "Title": "Why am I only ok talking to stage III ladies?feeling like a jerk Josiekat lkc"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 13, 2012 12:22AM JacquelineG wrote: Wonderfully spoken Beesie!!",
      "MessageIndex": 139,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780849",
      "Title": "Why am I only ok talking to stage III ladies?feeling like a jerk Josiekat lkc"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Aug 11, 2009 09:14PM JacquelineG wrote: I loved it too Lisa, made my cry! You definitely have my vote! Best of luck and thank you for doing this! Jackie",
      "MessageIndex": 19,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738768",
      "Title": "Stage III'er needs your help! It's QUICK. please!!!! lisalisa cherneski"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 28, 2009 05:51PM JacquelineG wrote: I am ER+PR-HER-. I have not heard it is a worse prognosis. In fact, my doctors were much more concerned about ER than PR and didn't give PR much notice... Hasn't been a year since my diagnosis but I'm planning on being around many more...  Jackie",
      "MessageIndex": 2,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/731537",
      "Title": "Stage 3 ER+PR-HER- Survivors aly Jane_M"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 31, 2009 10:37AM JacquelineG wrote: I just came back from seeing my surgeon, very well known in BC field and conducts numerous clinical trials. He had not heard being PR- meant any more resistance to Tamoxifen and firmly denied it! Also said PR- is not in any way worse... like everyone said, ER is the one they look at! I really trust my surgeon, so I'm gonna trust him on this one! Keep the faith, ladies! Jackie",
      "MessageIndex": 7,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/731537",
      "Title": "Stage 3 ER+PR-HER- Survivors aly Jane_M"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 1, 2012 04:32PM JacquelineG wrote: My oncologist said that drugs like Benadryl could slow down the metabolism of Tamoxifen but ultimately they're not sure about the degree of interference. She didn't think it was a big deal to take Tylenol PM once in a while but she didn't recommend taking it regularly. j",
      "MessageIndex": 17,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782866",
      "Title": "No Benadryl or Tylenol PM While on Tamoxifen????? pupfoster1 JacquelineG"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 11, 2012 09:50PM JacquelineG wrote: Your quote: \"Again - I have seen way MORE \"lesser stages\" become stage IV than see 3 go to 4!! I'd rather be stage III, grade 1, than be stage I, grade 3!!! See the difference? The stage 1 lady is in a worse position! \" Statistically, completely inaccurate, despite what you may have 'seen'. Easy for someone to say they'd rather be Stage 1 grade 3 than Stage 3 grade 1 when they're not in that position. Don't want to argue so won't post more about this. Just also made me want to gag when i saw it, for the second time.",
      "MessageIndex": 99,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780849",
      "Title": "Why am I only ok talking to stage III ladies?feeling like a jerk Josiekat lkc"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 18, 2009 08:23AM JacquelineG wrote: Hi there, I had a chest x-ray before my pet scan and it came back with 'nipple shadow'. They redid it and it turned out to be just that, a shadow. I'm not sure if they suspect the same thing with a CT,but I'm assuming if they use the word 'shadow', there's a good chance that's what it is? Here's hoping for the best for your best friend -- what a great friend you are! Jackie",
      "MessageIndex": 1,
      "PostDate": "18/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/730911",
      "Title": "Rib Shadow? MinAZ JacquelineG"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Aug 14, 2012 11:18PM JacquelineG wrote: Beautiful girls!! Hope I can join you one day!! Jackie",
      "MessageIndex": 6,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791981",
      "Title": "Sisterhood of the traveling.....uh...sistahs! everyminute NancyD"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Oct 4, 2009 09:07PM JacquelineG wrote: Hi Clariceak,  I, too, had a positive internal mammary node, found on my PET scan after surgery. For me this was a BIG hurdle, and I couldn't seem to find anyone else with a similar diagnosis. But since then I've heard of others with positive chest nodes who are doing fine. They also told me it was inoperable but that they would blast it with chemo and rads. I had a PET scan after chemo and BEFORE rads, and guess what? no signs of that chest node! I was ecstatic, and hopefully radiation to the IM nodes was just a reinforcement... So just wanted to let you know chemo and rads are just as effective on those nodes as surgery, if not more!  You'll do fine! Jackie",
      "MessageIndex": 11,
      "PostDate": "04/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/741429",
      "Title": "Need some encouraging words - Stage III, inoperable node clariceak clariceak"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "May 29, 2012 10:57PM JacquelineG wrote: Kerry you are truly amazing!!!!! I remember when you were running longer and longer distances, and i even remember your post when you did your first 6 mile run. And now look, more than 4 times that 6 mile run!! You really ROCK!!! You should be so proud! I know I am! Jackie",
      "MessageIndex": 23,
      "PostDate": "29/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/788234",
      "Title": "I ran a frickin' Marathon!! KerryMac NancyD"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Jun 7, 2014 11:47PM JacquelineG wrote: Yeah Mary!!! We are both 6 years out! I almost forgot too!!! Amazing, huh?? love to you my running friend! jackie",
      "MessageIndex": 6,
      "PostDate": "07/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/821708",
      "Title": "6 years ago today sucked everyminute YATCOMW"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 23, 2011 11:31PM JacquelineG wrote: Great news!!! I had a similar experience. Chemo got rid of the internal mammary node that lit up on the PET! The relief after that second PET was so great!!! Very happy for you! jackie",
      "MessageIndex": 9,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/766559",
      "Title": "Got some great news! Annie62 pupfoster1"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Aug 26, 2010 11:32AM JacquelineG wrote: Hope your appointment goes well today!! I just finally got an MRI after more than a year of pain in my hip. I kept trying to push it out of my mind, attributing the pain to a running injury, but in the back of my mindI was terrified. The MRI came back negative (thank God) and I have this peace of mind that i wish i had gotten a year ago. Here's hoping you get that peace of mind very soon Jenn! Jackie",
      "MessageIndex": 12,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/757176",
      "Title": "WORRIED & NEED TO TELL SOMEONE jenn3 AnacortesGirl"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Nov 19, 2012 04:46PM JacquelineG wrote: Hi there, I'm so sorry to hear about your mom. But, it really really  sounds to me like it would be a new primary vs. a recurrence, if it's a small tumor in the same breast, and that much later!! I'm sure she will be OK!! Try not to worry too much... Jackie",
      "MessageIndex": 1,
      "PostDate": "19/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/796571",
      "Title": "My Mom's Diagnosis Pure melmcbee"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Jun 16, 2011 07:31AM JacquelineG wrote: I had issues with my right hip for more than a year. Finally brought myself to ask my onc for an MRI, and it was just tendonitis! My boot camp leader gave me some great exercises for my hip and thigh -- my IT band was really tight -- and I have no pain anymore! the other thing that can help with hip pain is yoga, particularly hip opening exercises.Google -- yoga hip openers and you'll get a bunch of good exercises to try. best of luck and i'm sure it's nothing! jackie",
      "MessageIndex": 13,
      "PostDate": "16/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/770323",
      "Title": "What is up with my hip? jennyboog Merilee"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Nov 9, 2012 09:43AM JacquelineG wrote: Agree with everyone above! Change your doctor ASAP, you'll be so happy you did.  My oncologist definitely discusses exercise, diet etc. and is very open to everything i bring up to her (zometa, baby aspirin, etc). I hear about people changing oncologists all the time. All that needs to happen is a transfer of paperwork. You won't regret it, and this is a great place to ask for people's recommendations in your area! best of luck! jackie",
      "MessageIndex": 7,
      "PostDate": "09/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/796083",
      "Title": "Changing medical oncologists 4 years after diagnosis/treatment Texas357 RosesToeses"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Aug 31, 2009 01:17PM JacquelineG wrote: Just PM'd you.... Jackie",
      "MessageIndex": 1,
      "PostDate": "31/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/739762",
      "Title": "Let's get Lisa rolling luvtotravel JacquelineG"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Aug 31, 2010 10:10PM JacquelineG wrote: It doesn't sound like it's anything to be concerned about! I finished rads a year and a half ago and I still feel soreness/tenderness all around that area, including collar bone and below/above it. I bet some inflammation around it is completely normal. Ease your mind! It's normal to start focusing on parts of your body as you approach milestone dates -- i do it all the time :-) Congrats on one year since surgery and I wish you many, many more! Jackie",
      "MessageIndex": 1,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/757441",
      "Title": "Shoul I be Concerned Pure lkc"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Jul 27, 2009 09:44AM JacquelineG wrote: You look gorgeous -- have a blast!!! Love your hair! jackie",
      "MessageIndex": 13,
      "PostDate": "27/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/737999",
      "Title": "One year from surgery... everyminute KerryMac"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Dec 9, 2012 11:36PM JacquelineG wrote: So sorry to hear your news -- but you will soon be kicking cancer's you know what.... i really do believe the treatments in the pipeline will help you get NED!! jackie",
      "MessageIndex": 20,
      "PostDate": "09/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797357",
      "Title": "Cancer came back Mamita49 hopefour"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 21, 2012 12:14AM JacquelineG wrote: Wonderful news!! Ran my first half marathon last October, at 3 years as well!! Feels amazing! Wishing you many more years of health and happiness, Jackie",
      "MessageIndex": 6,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782968",
      "Title": "3 years, but who's counting... :p Laurie09 lexi4"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Aug 15, 2011 04:24AM JacquelineG wrote: Running beauties -- have fun!! Jackie",
      "MessageIndex": 3,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773140",
      "Title": "Kerry is here! everyminute Mamita49"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Sep 18, 2011 06:04PM JacquelineG wrote: Oh Bobbie, So sorry to hear this news... always admired you for going through both your battles with such grace and honesty... I know how loved you are by everyone here, and I send you my love too! wishing you peace always, jackie",
      "MessageIndex": 26,
      "PostDate": "18/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774995",
      "Title": "Spunkygirl (Bobbie) Fitztwins Mamita49"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 27, 2012 04:17PM JacquelineG wrote: So wonderful Diana! Been seeing your posts since 2008 and always encouraged and inspired by you!! sounds like you celebrate every day, keep enjoying life the way you do!! thank you for egging us all on! jackie",
      "MessageIndex": 19,
      "PostDate": "27/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/783260",
      "Title": "Diana50!!!!!! ck55 kimf"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Nov 13, 2009 12:51AM JacquelineG wrote: Hi precioustime, Like you, I had a PET/CT after chemo which showed no more cancer in IM node (i had mastectomy and node dissection prior to chemo). I still had radiation in 6 fields and am convinced the benefits outweigh the risks (at least for me) being a stage 3! didn't want to take any chances. Let us know how your PET goes! Jackie",
      "MessageIndex": 13,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743301",
      "Title": "Neoadjudvant Chemo no surgery needed precioustime mumito"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Jul 1, 2010 10:08PM JacquelineG wrote: That is the best news!!! Celebrate all summer long!",
      "MessageIndex": 17,
      "PostDate": "01/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/754775",
      "Title": "Thank You God!! precioustime JacquelineG"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Aug 3, 2011 09:09PM JacquelineG wrote: Congratulations Jen, Two years is big!! Many, many, more years of fitness and happiness for you! jackie",
      "MessageIndex": 19,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772594",
      "Title": "2 Years for Me Pure Pure"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "May 17, 2009 03:40PM JacquelineG wrote: Woo Hoo! Congratulations Linda! I am a IIIC as well (6 axillary nodes and 1 IM node) and your posts always give me so much hope. Very happy for you!!!!! Jackie",
      "MessageIndex": 5,
      "PostDate": "17/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/734339",
      "Title": "I made it to 4 years!!! lkc candie1971"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 25, 2011 12:52PM JacquelineG wrote: I know what you mean Pure, I'm trying to think what an oncologist told me. I think depending on the amount of progesterone you have in your body at the time of the biopsy, the results on PR might be impacted (not so the case with ER)... he also told me I may be PR+ even if my biopsy tested PR- - a false negative PR. It's interesting -- will have to research that more. Jackie",
      "MessageIndex": 4,
      "PostDate": "25/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765201",
      "Title": "ER+PR- kindone SpunkyGirl"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Dec 5, 2012 08:02AM JacquelineG wrote: I had the same thing as Celtic Spirit, just an inner stitch that had formed some scar tissue around it - my PS had to use some big stitches, particularly under my radiated side. I think maybe he said it was a granuloma in case you want to look it up. I'm sure it's NOTHING! jackie",
      "MessageIndex": 14,
      "PostDate": "05/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797195",
      "Title": "I found a lump Pure Pure"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "May 18, 2011 09:23AM JacquelineG wrote: Hey Kim, I'm thinking it's probably nothing but since we worry about all of these little things, may give you peace of mind to check it out with the doctor! hope you're even better today! Jackie",
      "MessageIndex": 18,
      "PostDate": "18/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/768996",
      "Title": "hmmm, what's this? kimf karen1956"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 6, 2009 06:39PM JacquelineG wrote: I had 25 rads with my TE in. I'm about 2 weeks from the last treatment, and my skin looks pretty good -- almost back to it's normal tone. I do feel a little tightness but it gets better when I stretch. My PS wants to see me 2 months after rads. Hopefully my skin will hold up -- I'd like to be an implant success story!",
      "MessageIndex": 22,
      "PostDate": "06/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730099",
      "Title": "What's your opinion on post-treatment tests staceyshusband bettysgirl"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "May 30, 2011 11:56PM JacquelineG wrote: Love this post Mary!!! My 3 years are coming up in 3 days... lots of emotions!! Sending you lots of hugs on this BIG milestone! jackie",
      "MessageIndex": 6,
      "PostDate": "30/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/769656",
      "Title": "3 years ago today... everyminute gillyone"
    },
    {
      "AuthorID": "JacquelineG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "JacquelineG wrote: Hi everyone, I just noticed a few red bumps on my radiated breast - not quite a rash, but look like small pimples. Can there still be changes on radiated breast even 18 months post treatment? They are not itchy at all but I don't have much feeling there so I'm not sure I would feel them itch... I'm trying to tell myself it's nothing but i remember reading somewhere that skin mets can look like pimples so I'm freaking myself out! thanks for listening - Jackie Dx 6/2/2008, IDC, 2cm, Stage IIIC, Grade 3, 6/40 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757984",
      "Title": "Red bumps 18 months post rads JacquelineG oaklandish1"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Dec 17, 2009 09:33PM JacquelineG wrote: Kim, you are wonderful and always give me SO MUCH HOPE!!!  Congratulations to you!!!!!!!!!!!!!  Jackie",
      "MessageIndex": 35,
      "PostDate": "17/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745496",
      "Title": "Today is my 5 year cancerversary kimf maryannecb"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 5, 2012 12:47AM JacquelineG wrote: Karen, Wonderful wonderful news!!! So happy for you!! many many more healthy years to you! Jackie",
      "MessageIndex": 29,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782097",
      "Title": "02/03/2006...6 years later and I'm still here!!!! karen1956 Annie62"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Oct 19, 2010 01:47AM JacquelineG wrote: You are all ROCK STARS!  I was telling my husband yesterday about your accomplishment, and you may have just inspired us to run a half marathon next year. Uh Oh, now that I've written it down I don't think I can back out of it!  Congratulations - you should be so proud of yourselves. I know I'm proud of you :-)  Jackie",
      "MessageIndex": 15,
      "PostDate": "19/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/759517",
      "Title": "I am a marathoner - wow! everyminute hymil"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 11, 2009 08:23PM JacquelineG wrote: I love it! Thanks for sharing! I love \"long may she run\" too!!!",
      "MessageIndex": 2,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730574",
      "Title": "New Tattoo everyminute shelloz1"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Jan 18, 2010 09:29PM JacquelineG wrote: I never get tired of seeing this one - thanks for reminding us Mary! Jackie",
      "MessageIndex": 8,
      "PostDate": "18/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746961",
      "Title": "Memorial Sloan Kettering Study everyminute karen1956"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Apr 1, 2011 10:00PM JacquelineG wrote: Congratulations!!!  And I LOVE that you forgot it was seven!! May we all forget one day how many years out we are :-) Wonderful news and thanks for sharing! Jackie",
      "MessageIndex": 15,
      "PostDate": "01/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/766895",
      "Title": "6 years out wallan geewhiz"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 2, 2010 05:42AM JacquelineG wrote: Wow!! I can see why you are so proud. she must be so proud of her MOM! Jackie",
      "MessageIndex": 17,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747679",
      "Title": "Proud Mama!!! jenn3 NancyD"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 7, 2011 02:21PM JacquelineG wrote: Wonderful!! So happy for you! Jackie",
      "MessageIndex": 34,
      "PostDate": "07/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764395",
      "Title": "I want to share, GREAT NEWS!!!!! faithfulheart JacquelineG"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Sep 14, 2010 11:57AM JacquelineG wrote: Thanks for your response! you know, the red bumps are right along the line of my sports bra under my arm, so that very well could be it! All sorts of funny things have happened with my sweat glands under the arm after rads -- i think the glands are now clogged (don't get sweat marks under that arm but certainly do under the non-rads arm!). Anyway that explanation makes sense to me and i choose to accept it but luckily my 6-month checkup with the rad oncologist is next month so I'll double check with him and hopefully ease my mind! thanks, jackie",
      "MessageIndex": 2,
      "PostDate": "14/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757984",
      "Title": "Red bumps 18 months post rads JacquelineG oaklandish1"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "May 28, 2013 12:43PM JacquelineG wrote: Congratulations to you Bugs!!! You are amazing! Also one of the very first people i remember here when i was first diagnosed, cheering everyone one! You should be so proud of yourself. I know we all are proud of you!!! I wish you a beautiful bright future! Jackie",
      "MessageIndex": 33,
      "PostDate": "28/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/805195",
      "Title": "Life really DOES go on! Bugs SpunkyGirl"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Sep 22, 2009 10:39PM JacquelineG wrote: Yahoo! Congrats!",
      "MessageIndex": 7,
      "PostDate": "22/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/740715",
      "Title": "TM Test - not run everyminute apple"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 6, 2011 09:54PM JacquelineG wrote: Thank you for sharing your beautiful story!! You give us all hope!! Jackie",
      "MessageIndex": 18,
      "PostDate": "06/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764397",
      "Title": "MY life changed forever on 02/03/2006 karen1956 JacquelineG"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Jan 5, 2010 08:42AM JacquelineG wrote: Praying everything goes OK Mary and DCMom! My 3-month checkup is this Friday, and I'm getting the jitters already. Also, my non-rads breast has swollen up like a balloon over the last 10 days (I was out of town in NY) so I'm a bit concerned. It's also bruising so I think I somehow injured it but I have no feeling there so I don't remember! Could be my 3-year old toddler???  Anyway, sending good vibes your way! As Kerry said, it's our year and only good news allowed! Jackie",
      "MessageIndex": 5,
      "PostDate": "05/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746282",
      "Title": "its all about me everyminute KerryMac"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "May 4, 2009 04:12PM JacquelineG wrote: Yes!! You inspire me too! Congrats :-)",
      "MessageIndex": 16,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/733575",
      "Title": "breast cancer didn't win today everyminute everyminute"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Mar 5, 2009 08:38AM JacquelineG wrote: You read my mind, everyminute! YES, Thank You everybody. Hearing your success stories has helped me tremendously. Please keep them coming! Sometimes feeling positive comes naturally -- and I just wake up feeling strong. Other days I have to fight to stay positive. The recurrence fear monster just wants to grip me. And that is when I NEED to come to this place and see your Stage 3 NED stories! KerryMac, I went through the exact same chemo regimen you did (3xFEC,3xTaxotere). I was done with chemo on Dec. 12 and feel no effects of chemo anymore, haven't for a long time! You will get through this and feel FANTASTIC again! Everyminute, we were diagnosed 3 days apart and have gone through treatment pretty simultaneously. Your positive spirit and support of others going through this, even as you go through your own treatment, is inspiring! Thank you! Jackie",
      "MessageIndex": 3,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730193",
      "Title": "Thank you to those who come back and give us hope! everyminute helena67"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 26, 2009 02:38PM JacquelineG wrote: Congrats everyminute, on your good appointment today, and also on going wigless! My hair is probably close to 1 inch around the sides but way too short and patchy at the top. I can't wait to go w/out the scarves though -- so sick of them! I stopped chemo Dec. 12. Might need at least one month til it's long enough to look decent. Keep running! I'm trying to do the same thing! Finally some motivation for me to exercise regularly",
      "MessageIndex": 5,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/729789",
      "Title": "First follow up appt today everyminute everyminute"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 5, 2009 04:09PM JacquelineG wrote: I love running to that song as well! Congratulations, everyminute!!!!! I have 7 rads treatments to go and I'll be done as well...",
      "MessageIndex": 14,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/728547",
      "Title": "End of active treatment everyminute everyminute"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Jun 22, 2009 09:21PM JacquelineG wrote: From what I hear, the longer it takes for your cancer to metastasize, the better (I guess it's less agressive). So 23 years is good in that respect -- hopefully it will be contained with hormonal therapy! Best of luck!",
      "MessageIndex": 4,
      "PostDate": "22/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736136",
      "Title": "23 Years Later - Here we go again... worktowin Crystalady"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Feb 6, 2012 04:33PM JacquelineG wrote: Hi Mary! I could have said your exact words, and i'm right behind you :-). I feel just like Sherry -- you are my personal trainer in my head, and when i haven't run in a few days, I think of you and get my behind in gear!  Congratulations on this important milestone and may you have many many years and milestones to come! Jackie",
      "MessageIndex": 3,
      "PostDate": "06/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782245",
      "Title": "3 years from last treatment everyminute AnacortesGirl"
    },
    {
      "AuthorID": "JacquelineG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77867/profile",
      "Content": "Sep 4, 2009 08:32PM JacquelineG wrote: You and your husband are always in my thoughts and prayers. Happy 3 year!!!!!!!! Jackie",
      "MessageIndex": 6,
      "PostDate": "04/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/739970",
      "Title": "A New Day SpunkyGirl Diana63"
    }
  ]
}