{
  "AuthorID": "Jag1110",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
  "Posts": [
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Feb 13, 2012 01:45AM Jag1110 wrote: I am new to this site and getting ready to start chemotherapy and would like to connect with others but can't seem to figure this site out.help!",
      "MessageIndex": 6,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782233",
      "Title": "breast cancer scaried and worried pam70 Moderators"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Apr 11, 2012 05:08PM Jag1110 wrote: I used to do hair and 1/2\" a month is normal hair growth. Nioxin and Minioxidal are good products also prenatal vitamins but don't know if you can take those. I'm still in treatment, 3 more to go plus rads. I did hear the lashes and brows go last and come back first.",
      "MessageIndex": 14886,
      "PostDate": "11/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Jul 3, 2012 08:34PM Jag1110 wrote: Hi everyone - I don't remember who asked about swimming but I was told no because of sun exposure and the the chlorine being drying to the skin. I was just going to complain that I hadn't heard from my doc and they just called and I go for my mapping Thursday and start Monday the 9th. I was also told to use Utterly Smooth for my cream and Dove unscented soap. She said I would probably be on a few lotions by the end. I hope everyone enjoys there 4 th of July, I'll be painting my basement, loads of fun,lol.",
      "MessageIndex": 45,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Aug 5, 2012 06:20PM Jag1110 wrote: I just completed 20 rounds and my breast is a little swollen and pink, starting to get a little rash. I'm just using hydrocortizone and Utterly Smooth cream right now. I'm starting to get a little more tired but nothing like chemo was.",
      "MessageIndex": 319,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Jun 27, 2012 04:20PM Jag1110 wrote: Thanks Momof2inME, I was a little worried about the tats. I'm getting nervous but also want this over with. My cancer was in the left breast so I worry alot about my heart and lungs. My RO said my heart wouldn't get hit but my lungs would get overspray. I will have to ask the percentage,  didn't know about that. I have alot of swelling in my ankles, but I guess that is a se of the chemo. Tomorrow is the ct simulation, what can I expect from that?",
      "MessageIndex": 20,
      "PostDate": "27/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Jun 28, 2012 05:33PM Jag1110 wrote: Teacup2012 - I just got marked and films taken, no tattos yet, I guess now they figure out the right way to line me up. Hopefully they still get me done in time to start on the 10th, I hate all the waiting.",
      "MessageIndex": 24,
      "PostDate": "28/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Jul 6, 2012 07:55PM Jag1110 wrote: onvacation - I'm also a triple neg. I start my rads Monday and am kinda clueless, everyone seems to be doing something different. I was told they wouldn't hit my heart by the doc but the tech told me during simulation that they would hit the edge and some lung which I new that. My cancer was left breast, I had a lumpectomy and chemo. Kinda worried about my heart since I had adrimyacin as one of my chemo drugs which is also hard on your heart. My diet is also crap and I eat alot of sugar since the steroids, can't seem to get a grip on the diet. Any tips?",
      "MessageIndex": 73,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Jul 9, 2012 11:02AM Jag1110 wrote: Thanks Teacup, I started today at 8:45 hoping for a later time. I have a half hour drive and don't like to get up early. I got my 3 tats to day also, they weren't too bad. 1 down 29 to go!",
      "MessageIndex": 95,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Aug 3, 2012 05:54PM Jag1110 wrote: Has anyone of you that lost there hair used Rogaine or Latisse or anything on that order to try and grow your hair and lashes back faster? ",
      "MessageIndex": 303,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Aug 13, 2012 06:24PM Jag1110 wrote: Graced - I went for my first boost today and they said the doc wanted to make some changes with my alignment so I didn't get anything done so now I get stuck going back Monday. It has gone by faster than I thought and my skin is a little burnt but that's it. I am starting to feel a little lost as to what to do after this. Being triple negative there is no hormone therapy for me, I feel like I'm just waiting for it to come back some day.",
      "MessageIndex": 412,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Jul 28, 2012 04:54PM Jag1110 wrote: kjiberty - maybe you could where one of those slimming cami's that fit under your breasts but will lift them up and they have nipple covers or petals i think there called that you can buy. If the cami is uncomfortable under your breasts you could maybe put some soft material between your breast and cami. I think they are meant to wear a bra with and slim your torso but since you can't do the bra maybe that would work. I'm half way through and just have some tightness in my skin and a little pink so far. Good luck!",
      "MessageIndex": 256,
      "PostDate": "28/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Aug 14, 2012 06:54PM Jag1110 wrote: I remember when my husband got burned they used silvadene and it worked pretty well. I went again today to start my boosts and the machine wouldn't line up right so now I am behind 2 days. I wish they could call me before I drive there and drag my butt out of bed. The doctor made some adjustments the day before, I guess I don't know why they can't get it lined up right. I think you all are right on doing something after, I just feel like I can't go back so the same old boring life I was living. I would like to volunteer maybe or go back to work, I'm onbly 52 but in the job market that might as well be 102, lol. Plus I feel like the village idiot half the time, can't remember anything and repeat things constantly, I wouldn't want to train me for a job.",
      "MessageIndex": 433,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Aug 21, 2012 09:42PM Jag1110 wrote: Last rads. today, I'm so happy. I\"m going out to dinner and having a few of my favorite drinks, I may even get a little drunk. I got my hope rock today for graduation that I wanted. I just took in a box of chocolates for the techs since I had so many different people. Hope you all are doing well, I feel like I'm on top of the world right now!",
      "MessageIndex": 502,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Jul 29, 2012 10:37AM Jag1110 wrote: My doc has me using Utterly Smooth cream like the stylists use on there hands, it's the one with the cow print. I think something similar used to be used on cows utters, lol. It's been working so far though she did say I might need to add aloe toward the end. I hate aquaphor it's gross like vaseline, I wouldn't want that slimed all over me. Kjiberty I wonder if you could stand a strapless bra since you have spagehtti straps. I had a September wedding once with a similar dress and wore a regular bra and I wanted to take that jacket off so bad because it was still very warm out and couldn't because of the straps.",
      "MessageIndex": 261,
      "PostDate": "29/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Jun 26, 2012 07:25PM Jag1110 wrote: Hi everyone, I was also posting in June but I am just going for my ct sim this Thursday and suppose to start rad July 10th, my 22nd wedding anniversary, what fun, with 30 rounds ending Aug 20th. I am enjoying my month off from chemotherapy and just starting to feel normal again. my rads doc told me to get Utterly Smooth cream ( with the cow print), I used this on my hands when I was a hair stylist so we'll see, I noticed no one else is using this. Not looking forward to the tatoo's, do they hurt?",
      "MessageIndex": 13,
      "PostDate": "26/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Jul 7, 2012 02:14AM Jag1110 wrote: Minimac thanks for the advice on the diet, i really need to make some changes. Graced and julz - I've heard of that CoQ10 and wondered how that works, I could use some energy and I am also on pravastatin, I'll check with my doc.",
      "MessageIndex": 78,
      "PostDate": "07/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Jag1110",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144971/profile",
      "Content": "Sep 30, 2012 10:17PM Jag1110 wrote: Ok I haven't been on for a little while finished treatment in August and hope everyone is doing well. I have a question for all, I have been looking for breast cancer car magnets EVERYWHERE and am getting really frustrated because I can't find a single one, well I take that back found one at Bed, Bath and Beyond but the magnet didn't work. Does anyone know of stores that carry these items or do you have to order online?",
      "MessageIndex": 705,
      "PostDate": "30/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    }
  ]
}