{
  "AuthorID": "jaime101",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49066/profile",
  "Posts": [
    {
      "AuthorID": "jaime101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49066/profile",
      "Content": "Mar 18, 2008 06:07PM jaime101 wrote: It took about 9 days, only 7 business days.  It actually wasn't bad for me, as I have been through this so many times before, I was totally expecting them to tell me the same thing they had ALWAYS told me in the past,\"Everything looks fine, why don't we just schedule a follow up in 6 months to check again\".  I don't know if you are currently \"waiting\", but just remember, worry will not make it go away, and chances are, that everything will be just fine.  God won't give you more than you are capable of handling.  I have been doing a lot of praying this week, for strength, resolution.  I am at peace with whatever the outcome.  I hope you can find that peace, it really makes \"waiting\" insignificant....  God bless... Jaime",
      "MessageIndex": 6,
      "PostDate": "18/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/701747",
      "Title": "They found cells jaime101 lvtwoqlt"
    },
    {
      "AuthorID": "jaime101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49066/profile",
      "Content": "Mar 19, 2008 01:21PM jaime101 wrote: Thank you, I am getting nervous about procedure.  Mary - did you have the ductal excision?  Was it painful - how sore are you?  I kind of wish they would put me under for this - ugh.  24 hour wait is not bad...",
      "MessageIndex": 9,
      "PostDate": "19/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/701747",
      "Title": "They found cells jaime101 lvtwoqlt"
    },
    {
      "AuthorID": "jaime101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49066/profile",
      "Content": "Mar 27, 2008 04:32PM jaime101 wrote: B9 -Papilloma blocked the duct and caused an infection which caused the A-typical cells!  YEAH!!!!!!  Thanks for all of your support. ",
      "MessageIndex": 10,
      "PostDate": "27/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/701747",
      "Title": "They found cells jaime101 lvtwoqlt"
    },
    {
      "AuthorID": "jaime101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49066/profile",
      "Content": "Mar 7, 2008 05:29PM jaime101 wrote: thanks ladies.  I can't tell you how bummed I was to hear this news.  It was the first time in four years I have heard Dr. X, NOT SAY,\"Don't worry, its probably nothing.\"  This time was,\"We need to get more out so we can figure out what we are dealing with\".  The duct excision is scheduled for March 20th, so not too much waiting.  I was just soooo sure that because they didn't call me right away this week, that it was a good sign.  I just feel like I was punched in the gut.  I wasn't expecting to hear it.. I guess you never are....",
      "MessageIndex": 4,
      "PostDate": "07/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/701747",
      "Title": "They found cells jaime101 lvtwoqlt"
    },
    {
      "AuthorID": "jaime101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49066/profile",
      "Content": "jaime101 wrote: OK, I know a few of you have been responding to me.  I was so excited last week because they had a counselor come in a speak with me and she gave me a really nice pep talk. You know,\"Don't worry, its probably nothing...yada yada yada\" So now what?  They found abnormal cells and now they want to go in and excise my duct to get more cells so they can determine exactly what we are dealing with and what to do.  So now I am back to BLAH!!!!!!!! Crap. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/701747",
      "Title": "They found cells jaime101 lvtwoqlt"
    },
    {
      "AuthorID": "jaime101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49066/profile",
      "Content": "jaime101 wrote: Ok, I have been here before....  Last time I was here it turned out to be an adeonoma.  They did a core biopsy and confirmed it.  Since, about 9 months later, I have started having sharp burning pains that radiate from my breast to my left arm.   Ultrasound today, diagnoses shows, at least 7 new cysts, the adeonoma, and a dialated duct?, plus, someone asked if i was having discharge, I said no, but when I squeeze my nipple, I can get a drop of brown sticky liquid almost everytime.  Its not much, but its enough to scare the crap out of me since it isn't the only symptom, but one of many?  Anyone having or had similar?  I have to call for a follow up appointment today. Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/701067",
      "Title": "Cysts, Adeonoma, dialated duct and brown discharge jaime101 jaime101"
    },
    {
      "AuthorID": "jaime101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49066/profile",
      "Content": "Feb 25, 2008 01:48PM jaime101 wrote: Shirlann, THANK YOU.  Just writing about this makes me feel better!!!  By the way, all of the cysts have developed within the last 9 months.  None were present with my last ultrasound?  And the duct thingy and discharge is new as well. ",
      "MessageIndex": 2,
      "PostDate": "25/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/701067",
      "Title": "Cysts, Adeonoma, dialated duct and brown discharge jaime101 jaime101"
    },
    {
      "AuthorID": "jaime101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49066/profile",
      "Content": "Mar 31, 2008 09:42AM jaime101 wrote: Thanks, I did get it to stop bleeding, no fever, no warmer than my other boob...  I guess I will just bite the bullet and call",
      "MessageIndex": 2,
      "PostDate": "31/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/703129",
      "Title": "Bleeding after Biopsy jaime101 LaughingWater"
    },
    {
      "AuthorID": "jaime101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49066/profile",
      "Content": "jaime101 wrote: Hi Guys, I have already received word that the duct excision I had was B9!  YEAH!!!  BUT!!!  I had my procedure twelve days ago and this morning I woke up and my bra was wet with black blood.  I took a shower and after I turned the water off, I swear it was two or three tablespoons of blood came out of my incision...  I finally got it to stop with a lot of compression and lots of band aids!!  Is this normal?  Or should I call my doc.  I have a $50 copay, so if I don't need to go in I would rather not.  Thanks ladies, any help would be appreciated.  Sorry if Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/703129",
      "Title": "Bleeding after Biopsy jaime101 LaughingWater"
    },
    {
      "AuthorID": "jaime101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49066/profile",
      "Content": "Mar 31, 2008 11:19AM jaime101 wrote: Hi Ladies!  I just got back from the doc!  I don't mess around with this stuff.  I didn't even call - just went in.  Good thing I did.  I took my bandage off in front of doc and I bled ALL OVER THE PLACE - Literally a stream coming out!  EWWWWW!  I have an infection and there is a very small hole where the blood is escaping.  He did not stitch me up.  It is very small and will eventually heal, and he says it is good to get the yucky stuff out (not his medical way of saying it...hehehe).  Anyway, Keflex, and lots of dressings to apply and reapply.  I am good to go. It was really funny when I took the band aids off...  We all (the doc, the nurse, and I) went into panic mode looking for somthing to put on it to catch the bleeding.  It was quite a site. And as for the blood thinning drugs, I don't take anything, not even naproxen.  This blood is BLACK!  The doctor says it is the blood that pooled after the procedure and caused the bruising.  If it doesn't come out, it eventually goes away, but in my case, it is escaping. Thanks ladies.",
      "MessageIndex": 7,
      "PostDate": "31/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/703129",
      "Title": "Bleeding after Biopsy jaime101 LaughingWater"
    }
  ]
}