{
  "AuthorID": "jamiemarie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
  "Posts": [
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Nov 26, 2017 10:34AM jamiemarie wrote: Hi Snowfall, I have the same insurance and was also recently denied. I was a bit upset when I found out and emailed Foundation One. They responded really quickly and said they would also file an appeal. I haven’t heard more from them or insurance - so have been trying not to worry about it. But if you havent talked to foundation one, it is worth an email or call. Andinterested to hear other suggestions too! Like you, this was the first denial of coverage I had too.",
      "MessageIndex": 1,
      "PostDate": "26/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/860406",
      "Title": "Insurance coverage for Foundation One Testing Snowfall keetmom"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Aug 2, 2017 03:54PM jamiemarie wrote: Hi Mazie, I've had further reductions in tumors after scans showing stable disease. So I wouldn't believe that stable automatically means the next step is progression! But stable is really a great thing! As you mention, people can be stable for years. And if you're stable, the status quo is working and thats something to celebrate. But I do remember being a little disappointed too the first time I was \"just\" stable - I wanted everything gone!",
      "MessageIndex": 1,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/857537",
      "Title": "Stable disease = unstable mind mazie73 Cure-ious"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Feb 4, 2018 04:44PM jamiemarie wrote: congratulations!! So inspirational",
      "MessageIndex": 3,
      "PostDate": "04/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/862240",
      "Title": "Five-Year Metsaversary pajim KSkier"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Feb 20, 2018 07:01PM jamiemarie wrote: Count me as another who was on letrozole alone for over a year. I have liver mets. Jamie",
      "MessageIndex": 3,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/862667",
      "Title": "Letrozole only for Stage 4 anyone? ShazzaKelly Heidihill"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Feb 5, 2018 08:06PM jamiemarie wrote: Hi all, just an update after seeing MO. She gave me a lot of options: aromasin with afinitor, xeloda, a taxane (she didnt specify which one). She even indicated she could be convinced to keep me on ibrance/faslodex because the progression was small. I asked about the aromasin/entinostat trial, but it had just closed. But she offered to contact a neighbor hospital to see if they had slots. She had also contacted a colleague about another trial testing a new mtor inhibitor but that trial wont open for another 4-6 weeks. So I was overwhelmed and felt a bit unprepared, even though I thought I was. I almost felt like she didnt know what to make of things. We are doing another biopsy and she will send to caris too. I am starting exemestane and she also prescribed afinitor, but instructed me not to begin it until we decide on what to do about a trial. I brought up localized liver treatments and she wasnt very excited. But said i could talk to IR when I do my biopsy consult. So I guess we’ll see... I wish there was a crystal ball on knowing exactly what to do when...Thanks again for all the help and kind words, it means the world to me! Jamie",
      "MessageIndex": 7410,
      "PostDate": "05/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Mar 12, 2018 05:18AM jamiemarie wrote: Hi Z, I echo Liwi’s advice about seeing a gastroenterologist. Long before I had cancer, I randomly ended up with gallstones. Numerous trips to my primary care physician were fruitless- they claimed I had a stomach virus, pulled a muscle in my back, etc etc. It got to the point where the gallstones traveled to my pancreas and I ended up in the hospital for over a week, severely jaundiced and with acute pancreatitis. I had my gall bladder removed and it was a relatively simple procedure, and this was 13 years ago, so I would guess its even better now! I will say, I think our minds and that of our doctors are quick to attribute our symptoms to cancer. It could very well be, but unfortunately, having cancer doesnt mean we dont have to also worry about other health issues too :(",
      "MessageIndex": 7794,
      "PostDate": "12/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Mar 20, 2018 05:43AM jamiemarie wrote: Good morning all, I’ve been reading the discussion of fevers with alot of interest. Over the past six months, I’ve been getting regular low fevers as well- first on ibrance/faslodex and now on exemestane. Even when I an not neutropenic. I havent seen a correlation with my two primary liver mets (they seem to continue to grow slowly). But I have wondered if my immune system knows something is wrong, but just not what to do about it. Or maybe its keeping other mets at bay. I got autoimmune hepatitis after a reaction to kisquali on trial, so have always thought my immune system is a bit wonky anyway :) Sorry, I dont have any words of wisdom to add, but thank you for continuing to educate me!",
      "MessageIndex": 7921,
      "PostDate": "20/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Aug 27, 2017 02:06PM jamiemarie wrote: Hi ladies, I just had lunch with one of my closest friends. Her mom was treated for breast cancer several years ago and just found out its recurred and spread - and significantly so. She's declining treatment. I just don't know what to do or say to support my friend! I feel i should have answers as to what to say and do and I just have no clue. I also feel horribly guilty that I dont know what to do and that I am doing relatively well right now. Any thoughts? I was going to put together a care package and help her out and be there as she needs it. But it feels so strange to be supporting her while also dealing with it myself. Im at a loss. And really upset! What an awful awful thing this is that we have to deal with..",
      "MessageIndex": 5652,
      "PostDate": "27/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Mar 12, 2018 05:19AM - edited Mar 12, 2018 05:20AM by jamiemarie",
      "MessageIndex": 7795,
      "PostDate": "12/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Jun 21, 2017 07:15PM jamiemarie wrote: Hi Maria, I don't know if I can help much but wanted to share - I was once on a trial and after months of tolerating things fine, I basically had an autoimmune reaction to the medication. In my case, it was my ALT and AST that were out of whack though. But since you are on a trial - any chance it could actually be a drug reaction and not the cancer? Jami",
      "MessageIndex": 5231,
      "PostDate": "21/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Feb 4, 2018 07:00PM jamiemarie wrote: Thank you all, youre the best! I almost didnt post, I read daily and think of you all, but I don’t post much, so it felt a little selfish. So thank you again!! Z, I had taken your advice to others to heart to look at trials before having progression, so I had my eye on this one, which my hospital participates in: https://clinicaltrials.gov/ct2/show/NCT02115282. Especially hearing the warnings on afinitor. Grannax, I’ve been following your amazing results with Y90, so thats something I want to explore too. I recently switched MOs to one closer to me (even tho I loved my previous one). My previous one wasnt too keen when I had asked before, but the head of IR at my new facility specializes in liver tumors, so will definitely ask. Will let you know what my MO suggests! It just sucks that I go from my first staff meeting in my new position to a doctor appointment to discuss progression! I almost didnt apply for the promotion- what ifs kept running through my head. I could coast in my previous position whereas this will be much more challenging. Part of me wonders if I made a mistake...overall,working helps me feel “normal,” but I’m starting to be aware that stress and overdoing things may not be in my best interest!",
      "MessageIndex": 7394,
      "PostDate": "04/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "May 5, 2018 01:06PM jamiemarie wrote: Hi Nouzay, I am on Eliquis. I have a history of PE and DVT that pre-dates cancer, but tests haven’t shown any cause. After my most recent PE in 2016, my doctor said I’ll be on blood thinners forever. I take 5 mg twice a day. I’ve been on coumadin, lovenox, and heparin in the past. For me, Eliquis is easy and I don’t have any side effects! Usually I stop two days taking it two days before any procedure, and then start up again following.",
      "MessageIndex": 8611,
      "PostDate": "05/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Aug 14, 2016 01:40AM jamiemarie wrote: So sorry you've had such a rough road lately. Sending you a virtual hug! -",
      "MessageIndex": 4,
      "PostDate": "14/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846897",
      "Title": "Too many hits Bad_At_Usernames Bestbird"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Feb 16, 2017 11:22PM jamiemarie wrote: Mama2twinsplus2, Z, and Louis, thanks so much for the words of advice and support. It means a lot to me!! More than I can express! Louis, I must admit, I saw the stats too and at the time, couldnt understand it. Never thought I would see myself in the same situation. But your description of your boys made me giggle. I have a three year old - just switch out \"electronics\" with \"Paw Patrol\"! :) but my son adds a whole dimension to all of this - it really devastates me to think of how I may or may not be able to care for him in the future if I'm alone. I found myself thinking about a lot of different scenarios of being sick and how it could play out in my new reality. I dont want to \"live for when I am feeling worse\" but its hard to escape reality too.",
      "MessageIndex": 4397,
      "PostDate": "16/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Jan 9, 2018 07:07PM jamiemarie wrote: Hi Grannax, I had the flu about 2 weeks ago. I am stubborn so didnt stop Ibrance or go to my PCP, I just tried to fight through. You are much smarter than I was! My MO told me yesterday to always call her if i am sick or have a fever- she can call in antibiotics, just in case, to keep things from getting worse. I am on my off week for Ibrance now, but for the first time, my neutrophils were low, which MO also thinks was likelydue to the flu. Have to get retested tomorrow to see if i can restart on time or not. I dont know how I would have felt if I had stopped ibrance while I was sick, but I definitely did not feel myself or back to normal for quite awhile. So no real advice, but I think you were smart to get a doctor to weigh in- I know next time, I will too!",
      "MessageIndex": 7090,
      "PostDate": "09/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Feb 4, 2018 02:08PM jamiemarie wrote: Hi all, hoping you can give me some suggestions to ask my MO tomorrow. My scan report just posted and says “appears to be an increase in size and number of liver lesions” with the largest increasing from 2.2x2.0 to 2.8x2.0. Ive been on faslodex/ibrance for 7 months and letrozole before that. No other tumors and the scan reported my primary breast cancer cant be seen. All labs are normal. My quality of life is good, just got a promotion at work and caring for my 4 year old. So part of me wants to stick with hormonals for QOL. The other part of me is p-ssed at these liver tumors and am ready to be more aggressive, especially while I feel OK. Im thinking of perhaps asking for a biopsy of this largest tumor, as its always been my problem. And my last was over 2 years ago and not of that lesion. Any other thoughts? Or things I should ask about? Thank you!! Jamie",
      "MessageIndex": 7388,
      "PostDate": "04/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Apr 21, 2018 01:45PM jamiemarie wrote: Hi all, I don’t post much, but do read almost daily and wanted to let you all know I think about each of you and wish I could give a bunch of hugs! Jamie.",
      "MessageIndex": 8422,
      "PostDate": "21/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Oct 6, 2018 01:11PM jamiemarie wrote: You look stunning, Grannax! So beautiful! xoxo",
      "MessageIndex": 9892,
      "PostDate": "06/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Jul 30, 2017 10:36AM jamiemarie wrote: I just had my first progression, and wow, is it tough :( I had been on letrozole alone for about a year, now on to faslodex and Ibrance. Interested to see how my body manges the Ibrance - I had been on one of the monaleesa trials and had an autoimmune reaction to the ribociclib. My MO is convinced that palbo is different enough than ribo to avoid those issue again, but he plans to watch very closely. I still have plans to run a half marathon in October - I'm halfway through my training plan! I think I've tricked myself into thinking if I can run a half marathon, I can't be too sick. Right?!? :",
      "MessageIndex": 5486,
      "PostDate": "30/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Aug 27, 2017 03:33PM jamiemarie wrote: Awe Lynne, thanks so much for the thoughtful response. I really appreciate it! I was thinking supporting my friend. I know her mom and we see each other once or twice a month through my friend but Im not even sure she knows my diagnosis, although my friend does. I love the helpful ideas you have- especially that they are specific. I know I'm more likely to accept help when its specific versus the \"let me know if you need anything!\" It just is so disconcerting to have to watch my friend go through this with her mom. I can think of things I'd want from people, but supporting someone else who is a family member/caregiver has left me at a loss. Like I should have more answers than I do! I also worry I'll be a reminder to her. And I'm while also seeing a glimpse of my future. When we talked my friend was getting pretty upset so I didnt push it about threatment. Its been about three weeks since she found out, and apparently when they found it, it had spread considerably. She's in her 60s. The only option they gave her to hopefully get it under immediate control was taxol, and she had that when she was first diagnosed and was miserable. She preferred to keep quality of life for as long as she can. They found out it was now HER+, so i mentioned that there are a lot of new treatments that do a good job at addressing that aspect. But at this point, my friend was upset and i didnt want to press or second guess what has been such a painful decision for them. Sorry for rambling! This has really left me upset - and feeling out of control!",
      "MessageIndex": 5654,
      "PostDate": "27/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Feb 15, 2017 09:38PM jamiemarie wrote: Hi all. I'm sorry, I don't post often, but read a lot. But feel I only post with problems, so I apologize. I thought about starting a new thread because I searched and couldnt find anything, but just couldnt do it. My husband and I are struggling through the process of divorcing. Between all the terrible emotions that brings up- and being stage IV- I pretty much feel like im failing at life right now. Id greatly appreciate any words of wisdom or ways to cope. OR if anyone has been through similar and can tell me it gets better... I do see a therapist, which helps immensely",
      "MessageIndex": 4383,
      "PostDate": "15/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Feb 16, 2017 07:25AM jamiemarie wrote: Hi kjones, thanks so much for the thoughtful comments. I really appreciate the perspective and being so caring. You bring up a lot of good points that hit home for me. We had our share of struggles, and then when I was diagnosed, instead of bringing us back together, it just widened and exacerbated the problems. When I went through all the shock and emotions of diagnosis, I turned inward and didnt want to talk about it with anyone - family, friends, or my husband. He has told me that hurt him a lot. Which then manifested in him disconnecting- in many ways, but in terms of cancer treatment, he wouldnt ask me how I was feeling or how doctor appointments or scans went. He just ignored it all. With all the feelings scans bring up, plus some health setbacks, I just couldnt get over him not being there. You are so on point with caregivers often feeling left out. In my own example, I can look back and now see some of that contributing too. I have kept the number of people who know about my diagnosis very small - its pretty embarrassing to say I didnt think much about how that was probably very hard on him to not have people to confide in. I guess I am just at the point where Im trying to get some perspective. I know we all wonder what life would be like if we didnt have cancer. Like I said, we had our share of struggles before my diagnosis, but there is no doubt in my mind that it (and all that goes with it) sent us over the edge. I know I would have done things differently post-diagnosis if I had the perspective I do now. But I also try not to blame myself (too) much, because I was just trying to survive mentally, physically, and emotionally then and now. Any maybe its just easier to blame the cancer than myself and my actions...! Thanks for listening to me ramble :) trying to get my head around things and feel safe here",
      "MessageIndex": 4390,
      "PostDate": "16/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jamiemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237390/profile",
      "Content": "Apr 13, 2018 07:08PM jamiemarie wrote: Lots of different things to consider, but just from my experience, I started on Zoladex and had surgery 6 months later. It was easy recovery for me and it was a nice relief to not have to schedule/come in for the shots. Just one less thing I have to think about. But have to do what is right for you!!!",
      "MessageIndex": 4,
      "PostDate": "13/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863922",
      "Title": "Stage IV-Tamoxifen, Lupron or Oophorectomy ? pdlc436 alwaysbepositive"
    }
  ]
}