{
  "AuthorID": "Jan2014",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206412/profile",
  "Posts": [
    {
      "AuthorID": "Jan2014",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206412/profile",
      "Content": "Jan2014 wrote: My worries started at the beginning of July when I noticed nipple discharge from my right breast.  The first few days, I blamed it on sweat as the weather was so hot and humid, then I thought it could be my body lotion.  I think I was just looking for any excuses as this was only happening on one side.  At that point, I was always wearing colored bras so I couldn't tell what color it was.  Then I wore a white one and got really scared when I seen it was yellowish/green.  Let me tell you that's when Google became my best friend or maybe my worse enemy.  Some things I was reading made me worried and then some made me feel more at ease.  After a week, I decided to call my doctor's nurse as the discharge was still happening and I wanted her opinion.  She made me an appointment that very afternoon to a resident doctor.  She did consult the doctor who was on call and she requested a mammogram and an ultrasound and made me another appointment to see her and my family doctor in 2 weeks time.  I went for my appointments the day before my schedule doctor's appointment.  When I saw my family doctor and his resident, they had only received the results of the ultrasound.  It said that it showed a dilated milk duct of approximately 3mm.  They reassured me that it happens a lot in women my age, 48, and it's probably nothing to worry about but because they are not breast specialist they were sending me to a breast clinic where I was to see a surgeon.  It took a little more than 3 weeks to get my next appointment.  She had received the results of my mammo and it showed a cyst on my left breast and the radiologist was requesting an ultrasound on it. I should say that I have fibrocystic breasts.  She proceeded to check my right breast and because the discharge was spontaneous and only from one milk duct she requested a galactography.  Two weeks later I went for both tests and returned to the specialist the week after for results.  She said that the ultrasound showed a 2.2cm cyst on my left breast and that she would repeat the ultrasound in 6 months.  The galacto on my right breast showed a tumor in my milk duct which she said was probably a papilloma.  She said that she would perform surgery to remove it.  She also said that I shouldn't worry that it was 90 to 95% not cancer.  I had my surgery almost 2 weeks ago and I see her again next week for the results.  It's safe to say that I've been worried a lot.  It's like there's a black cloud following me since the beginning of July.  The waiting is just too long...  Has anyone every had similar experiences?  I'm sorry now that I didn't ask more questions.  She is not forth coming with details.  I have no clue why she wants to do another ultrasound in March for the cyst.  I will ask her that next week.  Right now, I'm worried more about the results of the biopsy... Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825385",
      "Title": "Nipple Discharge/Surgery/Waiting for results/Worried Jan2014 Jan2014"
    },
    {
      "AuthorID": "Jan2014",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206412/profile",
      "Content": "Oct 14, 2014 07:26AM Jan2014 wrote: Thanks for your reply! It feels good to talk about it on this forum as I'm not letting on to anyone close to me how much it's bothering me.  It just feels good to get it off my chest and read about how others in this forum are coping with the \"not knowing\".  I'll let you know how it went. One more week of waiting. I can do it :)",
      "MessageIndex": 2,
      "PostDate": "14/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825385",
      "Title": "Nipple Discharge/Surgery/Waiting for results/Worried Jan2014 Jan2014"
    },
    {
      "AuthorID": "Jan2014",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206412/profile",
      "Content": "Oct 16, 2014 11:04AM Jan2014 wrote: I'm so sorry to hear that writesthing.  I feel so bad that you were told that kind of news on the phone.  I'm sure your mind is racing with so many questions right now.  I hope that you get answers to some of those tomorrow.  I will keep you in my prayers.  Take care..",
      "MessageIndex": 16,
      "PostDate": "16/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825267",
      "Title": "Biopsy on Monday, and (of course) scared writesthings Ariom"
    }
  ]
}