{
  "AuthorID": "JAN69",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149623/profile",
  "Posts": [
    {
      "AuthorID": "JAN69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149623/profile",
      "Content": "Jun 2, 2014 03:15PM JAN69 wrote: Holly,  I don't have any personal experience with pregnancy and lump, but I want you to know I'm here and I care.  I know this must be scary beyond words.  I'll hold your hand as you go through this.  Jan",
      "MessageIndex": 1,
      "PostDate": "02/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821613",
      "Title": "Lump found & 18 weeks pregnant hollyshennan Zillsnot4me"
    },
    {
      "AuthorID": "JAN69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149623/profile",
      "Content": "Apr 10, 2013 04:09PM JAN69 wrote: I think we can all agree that there is no one right answer; it is a very personal decision.  I had a single mastectomy, which was all that was offered to me. At the time of dx, I just wanted the tumor out.  After I healed and got my breast form and bras, I found how uncomfortable (heavy, hot, etc.) silicone is.  I got up the courage to ask for my healthy breast to be removed.  Oh how I love being a flat top.  No bras!  Just wish I had known I could have had a double from the onset.  I do have 2 new silcone forms, but only worn them once. This is my experience.  I'm 71, retired, and no one who knows me seems to care what I look like.  Best wishes to your mom.",
      "MessageIndex": 4,
      "PostDate": "10/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/803087",
      "Title": "stage IIIB and mastectomy need advice pls zohra pp729"
    },
    {
      "AuthorID": "JAN69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149623/profile",
      "Content": "Aug 11, 2014 09:40AM JAN69 wrote: Encouraging news.  In regards to what is available now AND works, for me it is WearEase Compression T.  It is the best thing I've found and is comfortable (after I get it on).  Jan",
      "MessageIndex": 216,
      "PostDate": "11/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "JAN69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149623/profile",
      "Content": "Sep 16, 2014 06:21PM - edited Sep 16, 2014 07:47PM by JAN69",
      "MessageIndex": 2,
      "PostDate": "16/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/824628",
      "Title": "Bloody discharge and cracked/flaky skin Omrm1 JAN69"
    },
    {
      "AuthorID": "JAN69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149623/profile",
      "Content": "Nov 13, 2014 02:51PM JAN69 wrote: I love my WearEase T shirt too. It's hard for me to fork out that money, but considering all the money spent on trial and error with other compression garments, I think it is well worth the price. I'm off to check on Spookybob's suggestions.",
      "MessageIndex": 273,
      "PostDate": "13/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "JAN69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149623/profile",
      "Content": "Jul 3, 2014 12:32PM JAN69 wrote: Meggy - I understand your frustration.  I'm in the middle of a similar situation.  My lymph pt says I have lymphedema and treats me very well.  I love that lady, but she tells me I need wear these major compression garments.  I mentioned this to my MO (I think I was in tears at the time), and he quickly said that I don't have lymphedema!   So I went to breast surgeon yesterday.  She thinks my lymph is so minor that I only need to wear my sleeves and gloves when flying, driving through elevation changes, or sitting in a car for a long road trip. I do lymph drainage and exercises every day, but I have swelling under my arms which always feels tender and sore. That's my story.  I'm still just so confused (but I love not having to wear all that compression stuff). I'll be watching for other responses.  Jan",
      "MessageIndex": 1,
      "PostDate": "03/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/822493",
      "Title": "Have trouble getting your Doctors to understand your Lymphedema? Meggy glennie19"
    },
    {
      "AuthorID": "JAN69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149623/profile",
      "Content": "Jul 3, 2014 07:46PM JAN69 wrote: Meggy, Hugz, VA B,  This seems to be a common story.  And I don't like it. When I asked my breast surgeon if my PT or my MO was correct.  Her point is that PTs are schooled in LE and that is their sole focus.  MOs are schooled to treat cancer.  She figured they are both right...  Well, that doesn't help! Hugz, I know you are right about my symptoms.  I need to get serious again and wear those awful garments.  My current excuse is that it is so hot (like 100+), plus I need help getting the compression T shirt on and off.  Pretty sad excuses, I know. Someone needs to wake up our MOs, at least in time for our daughters and granddaughters. Meggy thanks for starting this thread.  Jan",
      "MessageIndex": 4,
      "PostDate": "03/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/822493",
      "Title": "Have trouble getting your Doctors to understand your Lymphedema? Meggy glennie19"
    },
    {
      "AuthorID": "JAN69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149623/profile",
      "Content": "Oct 7, 2016 05:25PM JAN69 wrote: Heather, I have no experience or wisdom to help you, but I just want to let you know that someone will be along who can help you. I wish you the best. Jan",
      "MessageIndex": 1,
      "PostDate": "07/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/848755",
      "Title": "Pregnant with IBC Symptoms HeatherJS HeatherJS"
    },
    {
      "AuthorID": "JAN69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149623/profile",
      "Content": "Jul 22, 2014 06:26PM JAN69 wrote: Mellie and OneBB,  I'm hoping with a bit more practice, I'll be able to get it on by myself.  I've tried over-head and bottom-up, and so far still need help.  Both DH and I are retired, so he's always around.  I don't wear it every day, just when we travel.  By travel, I mean going to doctor appointments.  That's pretty much my life.  (DH has cancer too)  Mellie, I too live in California, in the mountains of Central California.  We go to Fresno for our cancer appointments, and UCLA for my macular degeneration and thyroid/parathyroid issues.  It's a 300 miles trip each way and we do it about twice a month.  (going tomorrow)   So I go well compacted with tshirt, sleeves, gloves, with at least 3/4 length sleeves on my outside shirt.  Yes, it's hot, really hot, but when I get home I can tell my lymphedema is well under control.  So far it's been worth it.  Oh, and my lpt told me to not wear a sports bra because the coverage under the arm and around in back of it, leaves too much area for the lymph fluid to get caught.  She insists I wear a very firm bra, high under the arm and wide panels in the back with very firm stretch.  I go 100% flat and she doesn't like it.  Good luck ladies as we all try to find what works without spending an arm and a leg.  Jan",
      "MessageIndex": 7,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/822933",
      "Title": "Help finding a compression cami? Mellie289 teacher911"
    },
    {
      "AuthorID": "JAN69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149623/profile",
      "Content": "Jul 20, 2014 02:15PM JAN69 wrote: Mellie,  After several expensive tries, I think I finally found what I need.  It's WearEase Compression T shirt.  It seems to be their latest compression garment.  My local mastectomy supply store had to special order it for me as they had not even heard of it.  It took 3 sizes to get to the correct size, but it has been a winner for me!  It's very hard to get on so my DH has to help and that is humiliating, but lately I've been able to get it off by myself.  No zippers, hooks, or velcro. The short sleeves could be snugger for me, so I wear my sleeve under the T shirt sleeve.  The shirt comes down to about hip joint and it stays there!  No riding up.  I go flat, but there are pockets.  It costs $90. and can be purchased on line, but I wouldn't recommend that.  Correct sizing could be difficult and perhaps you would need to send it back and try again for the perfect fit.  Good luck, Jan",
      "MessageIndex": 3,
      "PostDate": "20/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/822933",
      "Title": "Help finding a compression cami? Mellie289 teacher911"
    },
    {
      "AuthorID": "JAN69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149623/profile",
      "Content": "Jun 17, 2013 07:41PM JAN69 wrote: I had the whole deal:  modified radical mastectomy, chemo, and rads.  I thought I had a typical experience, but reading here I see such a wide range.  My mx was painful while I recovered, but now I have only an occasional twinge here and there.  Chemo was horrific and rads was no walk in the park.  I was mostly tired and weak from rads and they had to stop for a week to let me regain some strength.  But I was 70 years old at the time.  I had my good breast removed about 18 months later, and I love being flat!  I hate prostheses and just don't wear them.  Good luck with your decision.  J",
      "MessageIndex": 29,
      "PostDate": "17/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/806221",
      "Title": "Guidance on MX with no reconstruction. Infobabe Infobabe"
    },
    {
      "AuthorID": "JAN69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149623/profile",
      "Content": "Nov 18, 2013 09:58PM - edited Nov 19, 2013 02:07AM by JAN69 69 6 weeks after a clear mamo",
      "MessageIndex": 33,
      "PostDate": "18/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "JAN69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149623/profile",
      "Content": "Dec 4, 2013 02:17PM JAN69 wrote: TB90 I had to have a mastectomy and no one even suggested I could have my healthy breast removed. I wish someone would have. A year later, I discovered I could get my other breast removed. And I am so happy I did. I feel so liberated! I go everywhere flat. I'm 71 and retired, so I might feel differently if I were still teaching. Best wishes for your difficult decision. Jan",
      "MessageIndex": 3,
      "PostDate": "04/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815319",
      "Title": "How to decide to have the \"other\" breast removed. TB90 Stenokim"
    }
  ]
}