{
  "AuthorID": "Janet1210",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218157/profile",
  "Posts": [{
    "AuthorID": "Janet1210",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218157/profile",
    "Content": "Jul 8, 2015 06:52AM Janet1210 wrote: I've just started taking Turkey Tail, after watching a TED talk by Paul Stamets http://www.ted.com/talks/paul_stamets_on_6_ways_mu.... What convinced me was the fact that his mother at one time had stage 4 breast cancer. When she went on Taxol and Turkey Tail mushrooms (supplied by her son, who owns one of the main medicinal mushroom packagers in the United States), her cancer went into remission, and as far as I know it has stayed in remission. Apparently, Turkey Tail has been studied more than some other mushroom types. I have taken Paul Stamets' mushroom mix called Comprehensive Immune Support for some time, which contains Turkey Tail, but now I'm taking only Turkey Tail. I'm also on Halaven (just started). My onc would not approve. He's a bit behind the times in nutritional savvy. But I recently had a nutritional consult with the Block Cancer Center (where Keith Block, author of Life Over Cancer, practices), and they gave my mushrooms an enthusiastic thumbs up. I don't like going against my onc's advice, but when that advice is out of date, I will do it. (I live in a smallish city and so my access to breast oncs is limited.) Periodically I travel to a major cancer center for a consultation, and the onc there has no problem with the mushrooms. I take a high dose of the mushrooms (eight 1-gram capsules a day) because my brother is kind enough to supply them for me. They are pricey. The usual dosage is 2 capsules a day. I also eat a vegan diet and avoid sugar and alcohol, for what it's worth. Hope this helps. Janet",
    "MessageIndex": 3,
    "PostDate": "08/07/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833249",
    "Title": "TURKEY TAIL MUSHROOM Extract TOPIC (Use This Topic for Posting) Teakie88 leggo"
  }]
}