{
  "AuthorID": "Janeway69",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
  "Posts": [
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "May 3, 2015 10:23AM Janeway69 wrote: MelissaDallas, I heard that while breast MRIs are super sensitive, it's a matter of lots of false positives, which get biopsied and from there you can tell what is of concern and what is not. I had a breast MRI recently but not a biopsy. I was told that people ( in the USA anyway) are going less invasive if possible because the biopsies and anything invasive also involve risks, inc luding creating more scar tissue that makes future biopsies difficult, as well as hematomas or seromas ( hematomas sound horrid!). Then I was told that if breast MRIs come back \"Good\", your odds of having something cancerous are under 3%, and a recent article said that with better technology and data behind past MRIs giving us better knowledge, that likelihood is more like around 1%. So what do you mean by MRIs not being good at identifying good from bad? Wondering in case I need to ask my doctors more questions.",
      "MessageIndex": 3,
      "PostDate": "03/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830945",
      "Title": "6 month intervals for mammogram with magnification views dolfin Janeway69"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Apr 27, 2015 08:44AM Janeway69 wrote: I just got MRI results saying they found fibrocystic tissue.  I am overweight and feel like the weight is likely at the crux of my particular problem.  Anyone else here need to shed some pounds? Just wondering.",
      "MessageIndex": 4,
      "PostDate": "27/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/828215",
      "Title": "Fibrocystic breasts - any ideas how to treat them naturally. alicki Ddw79"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Apr 27, 2015 07:16AM Janeway69 wrote: Actually the BI RADS ratings are the one thing I have not completely learned about yet. Well, okay not the ONE thing but... So if someone had a 3% chance or less of having cancer, why would anyone NOT biopsy? 3% is still a considerable chance in my mind, when it comes to cancer. I don't think you'd want to chance someone being let go and being in that 3% would you? I'm also not clear about the explanation on scarring. Are you saying it can cause odd things to come up on future mammograms/sonograms which will MAKE them do more biopsies? I'm just trying to figure it out. The way you wrote \"About the \"internal\" scarring, well that is actually a big deal. If they biopsied every oddity that they saw on imaging, most women would be having biopsies after every mammo/sono\", those look like two separate sentences to me that are not necessarily connected or talking about the same thing. It looks like you could simply be saying internal scarring is a big deal, and then changing the subject, because \"If they biopsied every oddity...\" is something that could be considered generally true I suppose. BTW, that third paragraph may indicate anxiety to a lot of you, but this is how i converse with people more than half the time normally. LOL! :) Not that I am not nervous. I am! Thanks!",
      "MessageIndex": 2,
      "PostDate": "27/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830783",
      "Title": "Risks of removing benign growths Janeway69 ballet12"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Oct 5, 2015 11:08AM Janeway69 wrote: Ballet12 thank you for the clarification and the correlation does not equal causation explanation. I admit I was a bit perplexed when I read here that biopsies increase risk. I had never heard that biopsies themselves cause anything, and also read that for example, fibrocystic tissue is very common as in, over half of women get that, but that such tissue does not increase risk of BC. Not directly anyway. It COULD obscure findings on a mammogram or sonogram though. That can be problematic. I also considered that any breasts prone to changes of any kind, may be \"busy\" as MsPharoah suggested, and as such, MIGHT have an increased risk of triggering the wrong kinds of mutations? But that's so hard to ultimately predict. I've known so many women who had biopsies that came out B9 and are well into their later years and have not ever been diagnosed with BC so far. Thank goodness many of us do well!",
      "MessageIndex": 14,
      "PostDate": "05/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/835240",
      "Title": "Bi-Rad 3 Tracy1961 BarredOwl"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Janeway69 wrote: Hi, I am waiting for MRI results after a diagnostic mammo and sono. Sono found cysts, but mammo found something the radiologist said has no explanation, but he does not think it's another cyst or perhaps even related. I guess because of my age, he ordered an MRI rather than a biopsy directly. I hope that's a sign of non anxiety on his part BUT....... I asked about simply removing the area of concern with wide margins regardless and he said it was medically unadviseable. \"Do you want to risk scarring and infections?\" Okay, infections can be bad for sure, but I would think it's a center's job to minimize that risk. And scarring? I thought he meant outside in which case I thought, compared to cancer, who cares??!! But now I am learning from reading that there can be internal scarring that can make future screenings more complicated? Okay fine, but is that a reason to not do it? All my GYN said was \"That comes with risks too\" but we did not go into it for now. So,why all the hesitancy on the part of the doctors? Okay they don't know what it is yet but why leave ANYTHING there? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830783",
      "Title": "Risks of removing benign growths Janeway69 ballet12"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Janeway69 wrote: Hi, Not diagnosed but looking at some doctor names for a second opinion on my MRI and mammo/sono tests thus far. Is anyone familiar with any of the following names via Northwell (Formerly North Shore) on Long Island? Dr. Susan Pileski Dr. Filardi Dr. Kadison Dr. Chen/Chan? Thanks. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841884",
      "Title": "ANyone familiar with any of these names? Janeway69 Janeway69"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Apr 26, 2015 03:06AM Janeway69 wrote: Thanks to those who gave thoughts on Iris Cantor. Ann13820, it's a mental thing on my part. Also I have a friend who tried NY Presbyterian/Columbia and her experience wasn't so hot. The staff messed up her background information a lot, including wrong date of birth, wrong number of offspring, wrong age of first menstruation, etc. She also said they overtested though I cannot say if that was stress related or not, because hey, it's hard to know how many tests to do for these things, right? She later went to a North Shore/LIJ center and felt better going there and her doctor said messing with things too much can aggravate cancers; something I've thought about but I don't know the details. Anyway I think she also chose that place because it was \"state of the art\" whatever that means, and it was conveniently located. I appreciate convenience when you have only so many sick hours at work, but if I'm near other great options I'd rather go with what's best instead of convenient. As some have written here, people have traveled much further than I would have to, to attend these places if needed. To momschki, by \"NYU\" do you mean \"NYU langone?\" The Perlmutter center?",
      "MessageIndex": 8,
      "PostDate": "26/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830751",
      "Title": "Can doctors in NYC be recommended here? Janeway69 Fakeboobs123"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Janeway69 wrote: Hi. I was given an MRI due to a density found on a mammogram that did not respond to a diagnostic spot compression, in my second mammogram, as the radiologist would have liked. I guess if it had jumped right out with suspicious characteristics he would have gone right to ordering a biopsy. However, just in case I need more tests, or hear the worst.... I live in Queens NY. I'm fortunate to be near Manhattan and some good hospitals. I don't know if this is not allowed on the forum but for breast specialists, surgeons, oncologists, are there any people in particular that are well recommended? I have read in an article that getting the right person depends a lot on exactly what you have, so it can be tricky, and I don't even have test results yet. I'm jumping the gun but don't want to be scrambling if I hear bad news and my brain is frozen with fear. So far I am looking at the Iris Cantor Center through NY Presbyterian/Weill Cornell. Of course there is always Memorial Sloan Kettering. I'm avoiding it for a stupid reason; just the name of that place strikes fear in my heart; like everyone goes in there to die. Sorry such a downer. Thanks. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830751",
      "Title": "Can doctors in NYC be recommended here? Janeway69 Fakeboobs123"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Apr 25, 2015 08:51PM - edited Apr 25, 2015 08:52PM by Janeway69 Thanks moderator. I have considered that. I'm not sure where I'm most comfortable. The only reason I've been going to North Shore/LIJ places is because that is who my GYN for the last 15 or so years is affiliated and as a rule I trust her judgment. However when I asked for breast surgeon names just in case, the two she recommended were the top in the hospital and center, but were oncology surgeons/general surgeons and not breast specialists, plus they did not take my insurance. I feel like being near Manhattan leaves me with too many other, probably better options by comparison, to ignore them. However you are right about one step at at time. I'm known for jumping the gun. I would just hate to miss something catchable from not being prepared. Thanks!",
      "MessageIndex": 3,
      "PostDate": "25/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830751",
      "Title": "Can doctors in NYC be recommended here? Janeway69 Fakeboobs123"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Apr 27, 2015 04:37PM Janeway69 wrote: Since I posted I just thought I'd put my results here.  \"No evidence of malignancy. Fibrocystic tissue corresponding to findings on mammogram.\" Bi-RADS rating of 3. The tech on the phone said \"It's a GOOD report\" with that \"Trust me\" tone.  She was very nice. However they want me to do a follow up mammogram in six months to check stability. Before I got these results, my GYN said if things do not change for two years it's considered benign. That was when she hadn't even received results so I am guessing her statement applies to many things. I've heard cysts can make you more prone to cancer, but it doesn't mean you get it for sure. I know that fibrocystic tissue is not unusual in women. I'm having them mail me all copies of my reports though. By some amazing coincidence I'm having some pains in my left breast. They are very similar to pains I had in my right one back in 2002, which my GYN checked and said was likely due to a progesterone surge. Part of me wonders if a biopsy still should not be done, but I've been told that they generally are not done unless truly warranted. Before the MRI the radiologist said if it comes back good, odds are 99% that I don't have cancer. I realize in medicine they never say 100%, just in case. But I wonder just HOW much an MRI can really tell the doctors?",
      "MessageIndex": 18,
      "PostDate": "27/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830751",
      "Title": "Can doctors in NYC be recommended here? Janeway69 Fakeboobs123"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Apr 28, 2015 02:23PM Janeway69 wrote: Okay so, Cookiegal ( cute name), when you write NYH do you really mean NY Presbyterian? When I see NYH I think of NY Hospital Center ( of Queens in my case). Fakeboobs123, I'm so sorry about your insurance. Is this a state insurance that existed before the exchanges came along? I hate that in this day and age anyone who pays for insurance still gets turned away from good care. That should not happen in 2015 in the \"greatest country on earth.\"  :P Chef127, no one else does laser? Makes me wonder why this one place does and what the other centers think but in any event, I'm glad you had a great outcome and if it works, people should be looking into it more. It's 2015. I thought lasers should be rather standard for a lot of such treatments; esp if older procedures add to risk of infection, hematoma, etc. And thank you for the well wishes! Thanks to all the terrific ladies here. FIGHT!!!",
      "MessageIndex": 25,
      "PostDate": "28/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830751",
      "Title": "Can doctors in NYC be recommended here? Janeway69 Fakeboobs123"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Janeway69 wrote: Hi. I was given an MRI due to a density found on a mammogram that did not respond to a diagnostic spot compression, in my second mammogram, as the radiologist would have liked. I guess if it had jumped right out with suspicious characteristics he would have gone right to ordering a biopsy. However, just in case I need more tests, or hear the worst.... I live in Queens NY. I'm fortunate to be near Manhattan and some good hospitals. I don't know if this is not allowed on the forum but for breast specialists, surgeons, oncologists, are there any people in particular that are well recommended? I have read in an article that getting the right person depends a lot on exactly what you have, so it can be tricky, and I don't even have test results yet. I'm jumping the gun but don't want to be scrambling if I hear bad news and my brain is frozen with fear. So far I am looking at the Iris Cantor Center through NY Presbyterian/Weill Cornell. Of course there is always Memorial Sloan Kettering. I'm avoiding it for a stupid reason; just the name of that place strikes fear in my heart; like everyone goes in there to die. Sorry such a downer. Thanks. Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "25/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830751",
      "Title": "Can doctors in NYC be recommended here? Janeway69 Fakeboobs123"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Apr 27, 2015 06:17PM - edited Apr 27, 2015 06:18PM by Janeway69 MusicLover thanks. I checked the site and you're right, the location says Plainview. Thanks! Having said that, don't all centers use laser surgery now?",
      "MessageIndex": 21,
      "PostDate": "27/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830751",
      "Title": "Can doctors in NYC be recommended here? Janeway69 Fakeboobs123"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Apr 27, 2015 03:54AM Janeway69 wrote: Thank you all for the many options, reports, reviews and names. Esp where MSK is concerned. I did not know about the Pleasantville place. Thank you chef127! Voraciousreader I will PM you. Surgery only. Got it.",
      "MessageIndex": 16,
      "PostDate": "27/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830751",
      "Title": "Can doctors in NYC be recommended here? Janeway69 Fakeboobs123"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Apr 27, 2015 04:38PM Janeway69 wrote: Regarding Chef127's post of the center in Pleasantville, are not ALL cancer centers using laser surgery?",
      "MessageIndex": 19,
      "PostDate": "27/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830751",
      "Title": "Can doctors in NYC be recommended here? Janeway69 Fakeboobs123"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Apr 25, 2015 08:57PM - edited Apr 25, 2015 09:00PM by Janeway69 Thanks dlb823 for the link. I'm surprised that the Iris Cantor center is not on here and may email the NCI as to why, though I read the criteria for being listed already. Dr. Simmons takes my insurance for example. Sorry. I'm not trying to argue. I'm just wondering if this is okay. The idea of going to Memorial Sloan Kettering is terrifying. It's a mental thing. http://www.weillcornell.org/rmsimmons I'll give it some thought. Hopefully all will be well. THank you!",
      "MessageIndex": 4,
      "PostDate": "25/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830751",
      "Title": "Can doctors in NYC be recommended here? Janeway69 Fakeboobs123"
    },
    {
      "AuthorID": "Janeway69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214556/profile",
      "Content": "Apr 27, 2015 03:59AM Janeway69 wrote: One more Q for the MSK recommenders. Do all or many doctors work together on every patient's case. My virologist friend said his colleagues like Iris Cantor because no matter which doctor you use, you don't just go in with one doctor. All the doctors there discuss every case and work on it as a team. He told me of a woman who was Dx with Stage 3 BC in the 1990s and is alive and doing well today because of that place. I know that such cases can probably be found elsewhere, but it sounded good. I will give MSK more thought. I hope the doctors take my insurance. Any names in particular I should look for if I need it? I still don't even know yet what my outcome is.",
      "MessageIndex": 17,
      "PostDate": "27/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830751",
      "Title": "Can doctors in NYC be recommended here? Janeway69 Fakeboobs123"
    }
  ]
}