{
  "AuthorID": "Janet23",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125438/profile",
  "Posts": [
    {
      "AuthorID": "Janet23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125438/profile",
      "Content": "Janet23 wrote: It's taken me the better part of a month to get in for a diagnostic mammogram (booked for Mar 11). A month ago both my breasts got a hot, red localized rash on the lower outer quadrants after my armpits and breasts had been extremely sore for a couple weeks. The rash was incredibly itchy. Following an unrelated surgery I was given 100 mg of prednisone to control the symptoms of my systemic lupus and the rash almost went away. However, I still have areolar thickening, and the lower edge of both areola seems to have become less distinct. I also have scaly, dry and pink skin where it used to be quite red. I have new dimples in both breasts. I stopped trying to wear my bras about 3 weeks ago because they now leave \"seam marks\" on both my breasts. I haven't gained weight, so my boobs must be \"puffy\"!!  Because both breasts are affected, and because I have systemic lupus, I've had to fight to get anyone to take this seriously and not just put it down to being contact dermatitis or lupus-related. I moved to the city I'm in five months ago and because I don't work, I really have nobody here that I know. I came looking for a good forum for support and stumbled across this one. I've been really impressed with what I've read - seems like a family atmosphere prevails. As I sit here, really sore in that chubby part that overflows the bra cup between the breast and the armpit on both sides (my right side looks swollen in this area, too), I am very scared, anxious, and having a hard time concentrating on doing anything of any value with my day. If anyone can say anything that might let me know I'm not alone, I'd sure appreciate it. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765982",
      "Title": "waiting for diagnostic mammogram and scared Janet23 mdoak"
    },
    {
      "AuthorID": "Janet23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125438/profile",
      "Content": "Mar 9, 2011 11:35PM Janet23 wrote: Thanks, mdoak! I agree that it sounds suspicious for IBC, and I'm reasonably certain that my current prednisone is masking some of what would otherwise be more obvious skin symptoms (redness & peau d'orange). I'm actually going to be seen at Diagnostic Radiology at our local hospital, which is also the oncology centre  for where I live, so I know nothing about what is done for followup, when I get results, whether I get to talk to anyone. Part of my fear is that if nothing shows up on the mammograms they're going to dismiss me out of hand, and then I don't know how I push to get in to the surgeon for punch biopsies. I guess I just squeak and squeak until they decide to grease the wheel....meantime the uncertainty is just so frustrating, for me and for my husband, too. Another part of the fear is that if nothing shows up they'll just blame all these changes on my systemic lupus and walk away. In 23 years of having lupus and in all my research I've not ever read of breast or lymphatic symptoms, so that's not going to wash with me, but again, I'll have to squeak to get the grease. I find it terrifying to read how long women are waiting for diagnostic procedures. I'm praying that, living in Canada, our public health care speeds this process up, but I honestly have no idea. My sister had a lumpectomy last year but told nobody in the family anything about it, so I don't know how long everything took for her. The worry is just so all-consuming that I'm feeling rather like a zombie - just going through the motions of the day without actually participating. Thanks again for writing to me. I'll let you know what happens, and I'll DEFINITELY be back to blubber Hugs, Janet",
      "MessageIndex": 2,
      "PostDate": "09/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765982",
      "Title": "waiting for diagnostic mammogram and scared Janet23 mdoak"
    },
    {
      "AuthorID": "Janet23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125438/profile",
      "Content": "Mar 12, 2011 12:42AM Janet23 wrote: Well, I didn't get to see the radiologist - just the technician. And I was told the results would take 3 to 4 business days. However, I did take in my symptom journal for the radiologist to see, and they did have two previous screening mammos available to compare to, so I think that ought to be helpful. Now to just wait. Something everyone on this webiste has done. Reminds me of the saying \"Courage is not a lack of fear. Courage is feeling fear and going forward anyhow.\" Hooray for courageous women.",
      "MessageIndex": 4,
      "PostDate": "12/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765982",
      "Title": "waiting for diagnostic mammogram and scared Janet23 mdoak"
    },
    {
      "AuthorID": "Janet23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125438/profile",
      "Content": "Mar 21, 2011 08:49AM Janet23 wrote: Thanks to all for the informative and comforting info on MRI biopsy....please let us know how it went for you, KayG. (((Hugs)))) from Beautiful British Columbia, Janet",
      "MessageIndex": 5,
      "PostDate": "21/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766268",
      "Title": "MRI Biopsy tomorrow KayG Lisa1962"
    },
    {
      "AuthorID": "Janet23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125438/profile",
      "Content": "Mar 25, 2011 08:52AM Janet23 wrote: Dearest Nil; If you are still wondering how you can do good works with an apparently uncooperative body, I encourage you to read through the eight pages of posts on this thread......you are doing good and sharing joy, courage, and strength with every word you have written. You have touched many lives that you probably wouldn't have ever connected with if it weren't for the evil of cancer. By looking for support from others, you have graced others with support from you. You have given the greatest gift of all, sweet Nil - you have shared yourself with all of us here. God Bless you and keep you, make His light shine upon you and give you peace.",
      "MessageIndex": 243,
      "PostDate": "25/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764173",
      "Title": "28 YR Old Is Looking For Support from You wwaterlilyy ibcmets"
    },
    {
      "AuthorID": "Janet23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125438/profile",
      "Content": "Mar 15, 2011 04:14PM Janet23 wrote: I am a 45 year old awaiting confirmation of diagnosis of IBC. Diagnosed with lupus 23 years ago; it's been fairly chronic since diagnosis. One of my sisters had rheumatic fever as a small child and had BC last year. Another sister who is rheumatologically fine has BC - just diagnosed. I've been trying to find information on whether prednisone would mask skin symptoms of IBC but can't find anything. Had very clear skin symptoms until I was given a pulse dose of 100 mg prednisone, then skin symptoms have subsided to a pale pinkish tone. Hmmmmm.",
      "MessageIndex": 7,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/708385",
      "Title": "Lupus sufferer just diagnosed... Mikey2o7 Janet23"
    },
    {
      "AuthorID": "Janet23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125438/profile",
      "Content": "Mar 22, 2011 10:42AM Janet23 wrote: Julie & Phan; so glad things have turned out well for you. Wonderfullymade - You will be in my prayers - I am certain you will be given the strength and courage you need to face whatever comes. Gill27 - I'll be checking back in to see if you've posted results, and praying for you that everything is B9. Janet",
      "MessageIndex": 41,
      "PostDate": "22/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765794",
      "Title": "Cluster calcifications found on mammogram OJulie67 gill27"
    }
  ]
}