{
  "AuthorID": "Janejones",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264559/profile",
  "Posts": [
    {
      "AuthorID": "Janejones",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264559/profile",
      "Content": "Janejones wrote: After having a breast reduction in April 2015, I noticed some weird lumps in my breast. After a few mammo/US exams done in 2016 & 2017, it was determined that these lumps/issues are stemming from fat necrosis from my previous surgery. This past Oct, I noticed a lump in my armpit. I went to my PCP, assuming it was not breast related. She did a full work up (blood work/labs) and everything was normal. She suggested I monitor it for changes and come back in 6 weeks. 6 weeks later, it was still there so she suggested I have a Mammo/US done. Those came back normal so she said give it another 2 weeks and come back. It’s now been over 2 months and the lump is still there. I’ve also started to notice neck/shoulder pain and sporadic breast pain on the same side as the lump. It feels sore, like overworked muscles. She suggested I see a breast surgeon to have a biopsy done. I have an appointment with a breast surgeon next week, so hopefully he will be able to give me some insight. I’m not sure if he will want to do a biopsy, but after doing research online I’m starting to worry. This axillary lump (as my PCP defines it) seems to be something that appears after BC has spread to the lymph nodes. Could it be possible that the radiologists missed this in my last few exams? Should I be concerned about the lump and the breast/neck/shoulder pain? I’m 36 and at every screening they tell me I’m either “too young” to have cancer or “it’s probably nothing” since it doesn’t run in my family. I understand that they are professionals, but I would hate to think that my scans weren’t read thoroughly because of their assumptions. Has anyone else experienced this before? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860849",
      "Title": "Nervous & Anxious Janejones Janejones"
    },
    {
      "AuthorID": "Janejones",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264559/profile",
      "Content": "Dec 13, 2017 02:23PM Janejones wrote: MTwoman Thanks! I’m keeping my fingers crossed for good news at my follow up next Tuesday. I’m grateful everything seems to be normal so far, but I’m still very anxious to know why I have this lump.",
      "MessageIndex": 6,
      "PostDate": "13/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860849",
      "Title": "Nervous & Anxious Janejones Janejones"
    },
    {
      "AuthorID": "Janejones",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264559/profile",
      "Content": "Dec 13, 2017 10:32AM Janejones wrote: I picked up a copy of my report this morning. “In the left axilla corresponding to an area of palpable concern a 1.7cm hypoechoic lesion with a large central echogenic focus within is noted compatible with an axillary lymph node. This corresponds to the stable mammographic finding in this region. Further evaluation is deferred to clinical parameters” Recommendation - Clinical follow up BiRads - 2 - Benign findings",
      "MessageIndex": 4,
      "PostDate": "13/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860849",
      "Title": "Nervous & Anxious Janejones Janejones"
    },
    {
      "AuthorID": "Janejones",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264559/profile",
      "Content": "Dec 12, 2017 04:48PM Janejones wrote: djmammo, No, I don’t have a copy of the report. They sent it to my doctor. They scanned both breasts along with the area where the lump is after they did my mammo During the scan, the tech called the radiologist in because she saw something. The radiologist scanned me as well and they both pointed things out w/technical terminology, but they didn’t explain what was going on. She just confirmed I have the lump and said to wait for my doctor to receive the report. I wasn’t alarmed, but I did leave feeling like my questions went unanswered.",
      "MessageIndex": 2,
      "PostDate": "12/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860849",
      "Title": "Nervous & Anxious Janejones Janejones"
    }
  ]
}