{
  "AuthorID": "Janeth2012",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165001/profile",
  "Posts": [
    {
      "AuthorID": "Janeth2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165001/profile",
      "Content": "Nov 26, 2012 07:56PM Janeth2012 wrote: Hello, lovelikecrazy.....I am very new to this all as well. You are my first post, after reviewing several posts over the past several weeks.  I was recently diagnosed with breast cancer last month (October) with routine mammo and no family history of breast cancer. First DCIS and then DCIS with invasive. Underwent a lumpectomy 3 weeks ago and had a re-excision with sentinel node dissection due to path report after the first lumpectomy. Have some tenderness where nodes were removed, and quite a few interesting things with the affected breast, ie swelling fluid moving around, thickness, numbness to name a few. I've developed a sensation on the side and back area on the left side and a pulling feeling in the front just below the affected breast.  I found wearing a regular bra  (tried it out)increases the pain and wearing a sports bra seems to affect me as well, just not as severe. No bra seems most comfortable. See my surgeon tomorrow for another post-op and oncologist two days later. Have to go through radiation and hormone suppressants, so I've been told.  I've said all this to say.....often times we wonder....why me?  But I've quickly gotten over all that and have come to pray that this makes me a better person and that perhaps I can help someone else in the future.  It sounds like you have been through and are going through a lot but your \"SPIRIT\" about it all is what's important and it sounds like you are blessed with friends and family to help you through.  Well wishes for your upcoming surgery!",
      "MessageIndex": 2,
      "PostDate": "26/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/796889",
      "Title": "Glad to be moving ahead lovelikecrazy lovelikecrazy"
    },
    {
      "AuthorID": "Janeth2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165001/profile",
      "Content": "Nov 26, 2012 09:26PM Janeth2012 wrote: Hello Chiz.....I am new to this message board and recently diagnosed with breast cancer. I can totally relate to the stress of waiting and worrying about your kids. What's most important right now is to know that you are not alone in this process. Others before me have provided you with encouraging words. Be mindful that only a biposy can give you a definitive answer.  I know it's not easy waiting to have the test done but what I found helpful was realizing that I couldn't control the outcome, one way or the other.  I had many days of deep breathing and just convincing myself that no matter what, I would deal with it and be an example to someone else that might have to go through the same thing. Although it's easier said than done.....try to inhale and exhale.  You can and will get through this and you've got message board friends to help!!",
      "MessageIndex": 15,
      "PostDate": "26/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/796813",
      "Title": "33 and scared Chiz34 Chiz34"
    }
  ]
}