{
  "AuthorID": "janiceb00",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
  "Posts": [
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Aug 31, 2007 02:51PM janiceb00 wrote:",
      "MessageIndex": 26,
      "PostDate": "31/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Sep 28, 2007 06:25AM janiceb00 wrote: Sorry gals havent' checked in here for a bit...been in the chat rooms! I really do love this site... it's been a godsend. Karyll -- I'm glad your first  went so well...I think the strange feelings are of anticipation of \" is this the start of something?\" Just relax and enjoy feeling good if you can :). Congrads on the good test results. Paxton-- I haven't lost my hair yet, still waiting for that joyous occassion...but I did get it cut shorter last nite. I haven't felt any tingling or globs come out yet but I know its coming.And you are never alone you do have all of us :) Laurie -- sorry to hear about your reaction to your second tx, that would have freaked me out to. I'm glad your feeling better now though. Both of the MJ's---It's good that you both are doing well. I am doing good as well...wouldn't know anything has happened to me...I am having issues with my picc line the nurse seems to think my body doesn't like foreign materials in it ! GTG -- Hope you all are doing well and if your not I hope you get better :) ",
      "MessageIndex": 184,
      "PostDate": "28/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Oct 5, 2007 06:34AM - edited Oct 5, 2007 06:34AM by janiceb00 Hi everyone :) Paxton excellent idea!! I never had a lunch box only the brown paper bags and there was only 4 of us the ate lunch at school back then! Only 2 moms worked out of the home! MJ I had a Crissy doll too...my younger sister got jealous and cut the pony off the doll...I was so mad at her. Also had the usual barbies and easy bake off.  Loved the game \"operation\" and ker plunk. I can't think of any jingles! My best memories are of sunday nights... we all would sit down after supper and watch wild kingdom and then the wonderful world of disney. Nancy fight back ...can you bring a mask with you. I have a family wedding on saturday and I plan on bring a mask just incase there are sick people there this will help keep the germs away. Have a great weekend everyone Janice ",
      "MessageIndex": 258,
      "PostDate": "05/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Nov 7, 2007 07:52AM janiceb00 wrote: Hi all :) It took me forever to catch up!  Sorry for not being around in a while...3rd tx knocked the crap out of me! Not sick but really tired...no desires for anything but being a couch potatoe and major heart burn. I have gained major weight...the most in my life besides being pregnant! So far I have gained 12 lbs!! Doc said try to be active at least 3x a week for min of 30 mins. Mary Jo:  as for the holidays question... we celebrate thanksgiving earlier and what we decided was just to have a quiet dinner at home...although it was nice it does take a piece out of you. As for christmas...just taking it day by day and will probably do the same...alot of family want us to go to their homes but since you never know how you will be feeling my hubby and I have decided just to keep it simple and stay at home. Someone was going on to rads after AC... I will be too....I have rad consult on nov 15 and they will probably map me for when I do start. I have my 4th and final AC on Nov 20...onc told me that they have to wait at least a month before starting rads because it has something to do with the A reacting with the radiation.  Glad to hear you all are doing well as can be...take care Janice ",
      "MessageIndex": 437,
      "PostDate": "07/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Sep 26, 2007 07:19AM janiceb00 wrote: Hi all Just got my first chemo on the 19th...I'm not sick or tired yet. I don't know if that is a good thing or bad? Is this stuff working? How do you know? Will I get tired or sick? Wake up every morning wondering is this the day I am going to feel the effects. Anybody else feeling normal after treatments? ",
      "MessageIndex": 151,
      "PostDate": "26/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Oct 10, 2007 07:13AM janiceb00 wrote: Hi All :) Just checkin in. I had a pretty good thanksgiving weekend. Went to wedding on Saturday...didn't get home til 2:30. Hubby was a little ticked, he thought I over did it, but knew I was having a good time. Good to see extended family that you haven't seen in a while. Needless to say I didn't cook turkey dinner or anything major on Sunday..had to have dinner on Monday which is fine since I'm off work anyway. Just finished my 2 tx yesterday and I have been up most of the night with extreme heart burn / acid reflex. I drank a bottle of water took my pill and propped my pillows up so I wasn't lying down flat seemed to help a little, I kinda dozed here n there. I'm going to try gravel  tonight  for  a sleep aid. hopefully it works. Finally shaved my head last night too! Hey did you guys find your head tender where you shaved it? It's okay where the hair came out on its own but where the clippers cut my hair it is tender.:( I will take a pic later and post.  I also gained 10 pounds since this all started. I'm kinda worried and hoping alot is water but it still is scary.  Take care and hugs to all Janice ",
      "MessageIndex": 299,
      "PostDate": "10/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Oct 18, 2007 07:56AM - edited Oct 18, 2007 08:02AM by janiceb00 \" mce_src=\"\" alt=\"\" border=\"\" hspace=\"\" vspace=\"\" width=\"\" height=\"\" align=\"\" />I'm trying to download picture so I don't know if this will work",
      "MessageIndex": 340,
      "PostDate": "18/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Oct 18, 2007 05:04AM janiceb00 wrote: Oopps...I don't know how I did that..sorry about that!",
      "MessageIndex": 342,
      "PostDate": "18/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Oct 2, 2007 03:37PM - edited Oct 2, 2007 03:37PM by janiceb00 Hi everybody Here is a little tip my nurse told me about mouthwash...instead of mixing baking soda....use club soda it has the same effect...it's been working for me and no mess, just keep bottle on the counter.  I'm going to try next tx with just a normal IV...see how it goes, hopefully no issues and my veins hold up! Paxton-- The new do looks great! :) TTLY Janice ",
      "MessageIndex": 230,
      "PostDate": "02/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Oct 17, 2007 07:58AM janiceb00 wrote: Hi Gals I haven't been here for a while...took a long time to catch up! Paxton -I'm sorry to hear you still are not feeling well. My prayers are with you. Urbie - I had my husband buzz my hair off with the clippers you get from walmart. Your head might be a little tender tonight when you go to bed, I  bought a  soft cotton cap  for sleeping ... it works good. I found the little stubbys left  over from shaving stuck to my pillow and hurt. Karyll  & Tri - You both look good. MJ's -  I hope you both are doing good.  As for me I think the fatigue is finally setting in... not a whole lot of energy. Either that or boredom. Maybe both!.Why dust today...I can do it tomorrow! I haven't had any real sickness but did have a couple of bad days with heart burn. It seems to have setteled down now. Thats about sums it up for me... same ole same ole Hope everyone is doing better, take care Janice ",
      "MessageIndex": 333,
      "PostDate": "17/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Nov 10, 2007 06:13PM janiceb00 wrote: Laurie -  I'm going to try that for my next turkey leftovers...thanks Paxton - Good luck on your hunt. Hunters up here are really busy this year...seems like everyone is out. I haven't had any vision problems just alot of watery eyes seems to be worse first thing in the morning. Hope everyones having a great/ no se weekend Janice ",
      "MessageIndex": 459,
      "PostDate": "10/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Nov 19, 2007 07:43AM janiceb00 wrote: Hi everybody!! Hoping you all had a great weekend I seen my rads doc last Thursday and he said they are going to change the amount of tx. I will get 16 only and no double doses! yeah! I got mapped for when I start them... it didn't hurt just little pin pricks. Oh yes...the best news...tomorrow is my last chemo....yeah!! I just can't wait to get this all over with and get back on track. Hope everyones tx's are going good take care Janice ",
      "MessageIndex": 494,
      "PostDate": "19/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Sep 26, 2007 02:33PM janiceb00 wrote: marietta...im on 4X if AC then I will get 20 X of radiation with tamaxofen. I was given yellow pill b4 treatment then given 2 more to take 12hrs apart when I got home. Then was given 30 tabs of apo-prochlorarzine to take when needed... I take one of them a day just to keep wolf away from the door. paxton... im hoping im a lucky one...just dont want to get to relaxed and fall on my butt! Mary Jo... I know what you mean...I'm kinda getting scared for next one...maybe it gets worse as I go on. I hate the thought of all these drugs and side effects...it gets freaky! hope you all are doing well ",
      "MessageIndex": 156,
      "PostDate": "26/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Sep 30, 2007 07:44AM - edited Sep 30, 2007 07:44AM by janiceb00 MJ-- glad to hear you had a good time at the festival and you didn't over do it. Picture is big but your are pretty. I think you can shrink it in preferences with the original photo. Not quite sure on here. You will have to keep us posted as to how your 2nd tx goes...good luck. MJ-- How long after your tx did the fatigue  set in...my second one is do on Oct 9 so I'm kinda worried since nothing happened the first time that I will get it this time. Paxton-- sorry to hear your not feeling the greatest...hopefully you will be back to feeling better today. Oh here is some +++++++++ energy for ya! Karyll-- Awesome to hear that you are doing well and only with a little side effects, hopefully it stays that way. Urbie-- Its sounds beautiful there, I bet the trees look amazing.Can you take vit D and calcium supplements to help with the bone pain?  Take care all ",
      "MessageIndex": 206,
      "PostDate": "30/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Oct 2, 2007 07:06AM - edited Oct 2, 2007 07:06AM by janiceb00 MJ -- thanks for the info on the fatigue. I'm kinda getting a little nervous for 2 nd comming up. Urbie--- I just wanted to know it sounds like you just had an IV put in for the  chemo...they took my line out and I don't want one put back in as I only have 3 more to go.So I was hoping I could just go ahead with a IV and no port or picc line. Glad to hear you are still doing good. Paxton--- hang in there, day by day hopefully things will settle down soon or least be managable for you.  Aylnn---I'm glad you posted about the not sleeping...I to am not sleeping the greatest, so I look forward to a reply to your post. Hope everyone else is doing good...take care *hugs* Janice ",
      "MessageIndex": 222,
      "PostDate": "02/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Oct 4, 2007 06:29AM - edited Oct 4, 2007 06:29AM by janiceb00 Hi gals So far I haven't had any serious side effects...but yesterday my hair started coming out more...making arrangements to get the rest buzzed off hopefully by Friday as I have a family wedding to go to. I will try and put up a \"no hair-do pic\" if I get a chance. I have to go and get my blood counts done today to make sure they are good to have my dentist clean my teeth! Nothing is every simple anymore!  Hope you all are doing well and if not maybe today is the day you will be :) Take care & hugs Janice ",
      "MessageIndex": 245,
      "PostDate": "04/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Nov 8, 2007 02:41PM janiceb00 wrote: Here is a leftover recipe...subsitutions and add in's are okay too! Impossible Turkey Pie 2 cups of cut up cooked turkey 1 can of sliced mushrooms 1 cooking onion diced 1/2 teaspoon of salt & pepper 1 cup of shredded swiss cheese 1 1/2 cups of milk 3/4 cup of buttermilk baking mix (bisquick) 3 eggs Heat oven to 400 F. Grease pie plate, 10 x 1 1/2 inches. Sprinkle turkey, mushrooms, onions and salt n pepper and cheese in pie plate. Beat remaining ingredients until smooth. Pour into pie plate. Bake until golden brown and knife inserted centre comes out clean (30 - 35 min) Let stand for 5 min before serving. I also had leftover gravey to the turkey mix as well Janice ",
      "MessageIndex": 445,
      "PostDate": "08/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Sep 29, 2007 07:08AM janiceb00 wrote: Morning everyone Had to go to hospital yesterday and get the picc line removed! Now I'm on antibiotics for 10 days and have to go for ultra sound on my arm to make sure there are no blood clots. Looks like I will not be able to have another line put in either so I will be poked every time!  Paxton--- you look awesome... really. I hope I look as good as you when my hair comes out! MJ --- I'm sure you will have a great day. Just don't overdo it! Take care eveyone *hugs* Janice ",
      "MessageIndex": 194,
      "PostDate": "29/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "janiceb00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55665/profile",
      "Content": "Nov 14, 2007 08:12AM janiceb00 wrote: Cheryll-- My eyes are tearing alot too...I think someone here said it has to do with losing eyelashes... the eye makes up to clean it out because you have less lashes to catch the dirt and dust particles. Paxton -- Glad to hear you had a great time hunting. Hoping your taxol tx are okay for you too Mary Jo -- Happy Veterans day to you and your family...and hope all goes well for you to with you taxol tx. For all the others hoping all is good with you ttyl Janice ",
      "MessageIndex": 480,
      "PostDate": "14/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    }
  ]
}