{
  "AuthorID": "jax65",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81434/profile",
  "Posts": [
    {
      "AuthorID": "jax65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81434/profile",
      "Content": "May 12, 2012 04:51PM jax65 wrote: My DD found this for me right after brain mets DX and Jan I'm a duck too scans on Monday and I am already paddling. 'Tragedy should be utilized as a source of strength.' No matter what sort of difficulties, how painful experience is, if we lose our hope, that's our real disaster.\"  - Dalai Lama XIV",
      "MessageIndex": 47,
      "PostDate": "12/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786999",
      "Title": "Please post your favorite or an inspiring quote BarbRocks marymoir"
    },
    {
      "AuthorID": "jax65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81434/profile",
      "Content": "Mar 25, 2009 08:11PM jax65 wrote: Hi everyone, Met with onc today chemo starts April 2 so it looks like I will be joining this little group and hope we will all get through it together with as few SE's as possible. I also had very long hair that I just cut short in prep for this lovely ride and everyone loves it they say I look much younger great I'm only 43 how old did I look before LOL.. oh well. My biggest worry is my veins holding up I have tiny little veins but Onc seems to think port not necessary for 4 treatments I certainly hope he is right. I am doing 4 rounds of TC and hope that will be good enough as it seems most trip negs get AC or AC/T but he feels heart risks outweigh benefits with no node involvment. Best wishes to all of us on this ride.",
      "MessageIndex": 41,
      "PostDate": "25/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "jax65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81434/profile",
      "Content": "Mar 26, 2009 04:33AM jax65 wrote: aoandrews43- I am also 43 and doing 4xTC my Onc told me it would probably put me into menopause said usually anyone over 40. For me this is not an issue but if it is for you, you can have your eggs frozen.",
      "MessageIndex": 45,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "jax65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81434/profile",
      "Content": "Mar 26, 2009 09:10AM jax65 wrote: aoandrews-- I have a 17 yo DD and 2 dogs also so enough kids for me too. I know some women do AD's for menopause symptoms but I really don't want to go that road unless absolutely necessary. Hopefully we can get through it together. We have so very much in common both 43 and starting chemo on April 3. Of course you have the option of tamoxifen which I don't being TN. No port for me either onc says veins should be fine for 4 treatments. Have you decided which chemo you are doing? Where are you from? Did you have mastectomy or lumpectomy and do you know if you have to do rads? Sorry if too many questions just sometimes feel so alone. Jax",
      "MessageIndex": 48,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "jax65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81434/profile",
      "Content": "Apr 3, 2009 11:51AM jax65 wrote: Hi everyone, Just got home from 1st treatment am doing  TCx4. Didn't get much sleep last night but buildup was worse than actual treatment. They did have to poke me a couple times I have tiny baby veins I warned them. Feeling a little sleepy got a little lightheaded but so far so good, Will check in again later.",
      "MessageIndex": 118,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "jax65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81434/profile",
      "Content": "Apr 4, 2009 02:33AM jax65 wrote: Hi everyone, For all of us who already started hope you are doing well. For those about to start good luck!! The waiting and wondering really is worse than the actual treatment. I was able to eat dinner last night just very tired and up all night going to the bathroom all that water. But make sure you drink, drink, drink I do believe it is helping. I was able to go wig shopping after tx and my wig should be in just in time. Was able to get something very close to my own hair so pretty happy about that. Don't know if I will wear it all the time. But nice to have just in case. WasaBlonde--Everyone dr.s and wig shop told me to go for the cheaper synthetic wigs because they are easier to take care of and much cheaper. The one I picked out is very lightweight and very nice looking and was only 79$. Check with your insurance co. to see if they will cover a portion my did just needed to get a script from Dr. for cranial prosthesis.LOL. For scarves and hats check out heavenlyhats.com it was started by a high school boy and my package was sitting on my doorstep when I got home yesterday. You don't get a choice in what they send but I got a pretty good selection. They sent a ball cap, 2 scarves and 2 knit hats. Also check out franceluxe.com they will send a free wrap and very nice selection. Hope this helps. Hope everyone has a wonderful day.",
      "MessageIndex": 125,
      "PostDate": "04/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "jax65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81434/profile",
      "Content": "Mar 10, 2013 11:05AM jax65 wrote: Thank you for the warm welcome everyone Welcome Karen hope Xeloda kicks butt for you! Debbie I have beem doing taxol for almost a year it does take its toll but in my case is working wonders so keep trudging along, good luck with scans next week.",
      "MessageIndex": 98,
      "PostDate": "10/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "jax65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81434/profile",
      "Content": "Mar 4, 2013 07:22AM jax65 wrote: Renae thanks so much for starting this thread Here is my story originally dx in Feb 2009 at age 43 stage 2 no positive lymph nodes no vascular invasion had bmx and did 4 cycles of taxotere/cytoxin went merrily on my way and enjoyed life doing checkups every 3 months. 3 year checkup everything good MO says big milestone feeling great. 2 months later I start seeing flashing lights go to onc he says stress(working alot and friend dying from stage 4 bladder cancer but lets do an MRI to be sure but don't worry. MRI scheduled for next day I knew I was in trouble when they said we have your MO on the phone. MO tells me I have 4 tumors in my brain and need to see RO asap. See RO the day after that and started WBR that afternoon for 10 days worse time of my life between radiation and the steroids. I call it my twilight zone period I went to bed one night perfectly fine and woke up barely able to walk or dress myself it was horrible and I thought this is it I will be lucky to see summer. Pet scan also showed 2 tumors in the lung. After radiation started Taxol/Carbo had terrible nausea tried every med under the sun before finally getting it under control have been on this combo for almost a year every other week(body couldn't tolerate 3 weeks on 1 week off) got to skip 1 treatment last year right before Xmas feeling fatigue and joint pain but other than that I am hanging in there. Long story short all but 1 of the brain tumors are gone and the 2 lung tumors have shrunk significantly. I will celebrate my 1 year anniversary with mets in April by taking a cruise with DH and DD (who have been wonderful through this whole thing). Sorry this was so long but wanted to give you all some inspiration, a year ago I didn't think I would still be here but I am and not doing to bad. Live, Love, Laugh Jackie",
      "MessageIndex": 88,
      "PostDate": "04/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "jax65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81434/profile",
      "Content": "Mar 11, 2013 08:11AM jax65 wrote: Renae good luck with scans..I get scanned every 3 months brain MRI and CT I have been on carbo with taxol for almost a year sorry don't know what purpura is guess I will have to look that one up",
      "MessageIndex": 104,
      "PostDate": "11/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "jax65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81434/profile",
      "Content": "Aug 20, 2010 12:12PM jax65 wrote: Hope I just wanted to let you know you are not alone. I was diagnosed triple negative last year and was petrified also. It's hard to believe that 18 months has passed chemo is over, I have my hair back and luckily life does go on. It will for you too. There is a special section here on the board where everyone is triple negative make sure to check it out. You will see that there are alot of us here. There is also another site I recommend tnbc.com there is some very good information there. That whole site is dedicated to triple negatives. You can PM me anytime I don't post often but still read the posts everyday.",
      "MessageIndex": 5,
      "PostDate": "20/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/756941",
      "Title": "just diagnosed triple negative ...terrified Hope60 Hope60"
    }
  ]
}