{
  "AuthorID": "jaxster",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167630/profile",
  "Posts": [
    {
      "AuthorID": "jaxster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167630/profile",
      "Content": "jaxster wrote: Hello Everyone, Sorry was meant to put so why do they want me to have a MRI.. but wouldnt let me edit lol x Can anyone hep, i had my biopsy results today, the news was great, a Fibroadenoma? i am 43 and the doctors tells me this is most common in women in there teens - to 25, so he feels even though the Fibroadenoma is benign, i will benefit from a Brest MRI... Can i ask if Fibroadenoma can ever become cancer? can it dissapear? i no they said i had Dense breast do you think this is the reason why i have to have a MRI, the doctor just said we wish to do more research on women over 40 who have fibroadenma.. slightly confused xxx Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/799264",
      "Title": "Core Biopsy Benign. Why do they want me to have an MRI? jaxster Debbiedawn"
    },
    {
      "AuthorID": "jaxster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167630/profile",
      "Content": "jaxster wrote: Hello Everyone, Can anyone hep, i had my biopsy results today, the news was great, a Fibroadenoma? i am 43 and the doctors tells me this is most common in women in there teens - to 25, so he feels even though the Fibroadenoma is benign, i will benefit from a Brest MRI... Can i ask if Fibroadenoma can ever become cancer? can it dissapear? i no they said i had Dense breast do you think this is the reason why i have to have a MRI, the doctor just said we wish to do more research on women over 40 who have fibroadenma.. slightly confused xxx Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799267",
      "Title": "Core Biopsy Benign \"so why do they want me to have a MRI? jaxster MelissaDallas"
    },
    {
      "AuthorID": "jaxster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167630/profile",
      "Content": "Jan 14, 2013 07:10PM jaxster wrote: Hiya Hun I'm new here but think palpable means they can feel the lump, not to sure but benign is the best bit it means that you do not have breast cancer, xx maybe it was a cyst x",
      "MessageIndex": 1,
      "PostDate": "14/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798879",
      "Title": "Confused on information queenie-25 EmD"
    }
  ]
}