{
  "AuthorID": "Jay",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62187/profile",
  "Posts": [
    {
      "AuthorID": "Jay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62187/profile",
      "Content": "Apr 24, 2008 05:24AM Jay wrote: MRi has its advantages as well to the spine..But if the bone scan and PET/CT are both negative you have your answer.  The best evaluation is to have a PET before you recieve any Chemotherapy.  This can than be done at any time in the future after or during Chemotherapy to establish response and and progression of disease.  I stress to always get a PET and if it is negative than get a bone scan.  If it is posative a bone scane will give no further information than what the PET already gave you.  It is a more accurate test. Jay",
      "MessageIndex": 24,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698330",
      "Title": "PET Scan vs, Bone Scan JoyRebecca nuclear1"
    },
    {
      "AuthorID": "Jay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62187/profile",
      "Content": "Jan 24, 2008 08:28AM Jay wrote: I have been scanning cancer patinets for 4 years now with PET/CT. I will tell everyone fromallof the lectures and literature that for Breast cancer this should always been done as a staging scan.  The overall accuracy in PET/CT vs bone scan and CT combined is better.  It also is 15% more accurate than the 2 combined in detectionof early reccurance of disease.  As far as after chemo, PEt/CT will miss come osteoblastic lesions.  This is why they work in tandem together.  If your Oncologist does not order at Pet/CT  than have them look up some data on it.  This is a new test so now all Oncologists are used to it andnot all insurances cover it.  But believe me from someone who has scanned over a thousand woman with breast cancer this is the best test for you.  This is also they best way to evaluate if chemo. is working and a PEt/CT scan done duringa cycle of chemo will help evaluate response to treatment..please do more research and get a PET scan today..I tell eveyone I know and love to do this J",
      "MessageIndex": 16,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698330",
      "Title": "PET Scan vs, Bone Scan JoyRebecca nuclear1"
    },
    {
      "AuthorID": "Jay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62187/profile",
      "Content": "Jan 24, 2008 08:36AM Jay wrote: \"Anyway, after the PET scan showed \"hot spots\", he had me do the bone scan to confirm the mets.\" PET is more sensative and Specific than Bone scan..in this case it is not necassary. \"But the bone scan won't show organ mets...or will it????\" No bone only PET will help in liver, lung, breast and bone. \"am very new to this topic of bone mets......and will be honest in that I don't really understand what this is but it is scaring me.  I had a bilateral mastectomy in May of 2006.  Last week I found a lump under my left armpit which I am getting checked out next week.  For the last year or so I have been experiencing alot of back pain which I have been assuming is osteo arthritis - I am 48 yrs young.  Sometimes the pain is in more than just my lower back - upper back, hips, shoulders and neck.  I have felt under the weather like I'm coming down with something, but never really get anything, for the last 3 to 4 months. I wonder if I should ask my doctor next week about getting a bone scan? Thoughts?\" Please geta PET as well..PET is more accurate in detecting reccurance of breast cancer than CT, Bone scan, and US all 3 combined..I can share the article if you are interested \"So for all with bone mets, it seems Bone Scan is the way to go.\" Combination is the current recomendation Bone scan is 70% sensative for lytic bone lesions PET is 98% sensative. Pet is 75% sensative for blastic lesions, Bone scan is 99%. They need to have an overlap..they each will miss lesions. Most new breast cancer with bone mets are lytic lesions..so PET should be the first scan ordered.",
      "MessageIndex": 17,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698330",
      "Title": "PET Scan vs, Bone Scan JoyRebecca nuclear1"
    },
    {
      "AuthorID": "Jay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62187/profile",
      "Content": "Jan 31, 2008 11:40AM Jay wrote: Im glad I could give some help. As far as CT goes, it normally is very poor for detecting bone lesions.  It will miss far more than PET or bone scan.  What becomes the challange for an oncologist is once you receive chemo.  any lytic lesion will be treated and than change into a blastic or sclerotic lesion.  The basis on blastic lesion is bone breakdown and rebuilding.  This is why a PET before chemo is the most helpful.  Any restaging than will show if the patient is responded to any treatment.  The problem is most Oncologists are old school, and might have been doing things the same way for the last 15 years.  I have patients that are more educated than the oncologists.  They have lots to learn becasue PET/CT is such a new advanced test.  Let me know if you have any more questions.  One thing is for sure if your Oncologist says a CT and bone scan is better than a PET/CT..I suggest you have them show you some articles or proof of this..otherwise they need to order the best test for you J",
      "MessageIndex": 20,
      "PostDate": "31/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698330",
      "Title": "PET Scan vs, Bone Scan JoyRebecca nuclear1"
    },
    {
      "AuthorID": "Jay-Jay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67829/profile",
      "Content": "Jun 10, 2008 08:04PM Jay-Jay wrote: Ewesterman   My 12 weeks (4 A/C treatments every 21 days...first one today) will be followed by 12 weeks of once week treatment of Trastuzumab (Herceptin) and paclitaxel. Those 12 weeks will be followed by 40 weeks of once a week treatment of Herceptin. Total 64 weeks in all. I have a feeling my follow-up will be the rest of my life. They gave me 7 to 10 days before I'm bald. Two days ago I did a preemptive cut of 8 inches all over my head. So I'm close to bald already. After breast cancer in 2005 I grew my hair to donate to Pantene. In 2005 I only needed 7 weeks of radiation. If I can figure out how, I'll post a photo of the side effects",
      "MessageIndex": 855,
      "PostDate": "10/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Jay-Jay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67829/profile",
      "Content": "Jun 7, 2008 06:52PM Jay-Jay wrote:",
      "MessageIndex": 771,
      "PostDate": "07/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "cee-jay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112044/profile",
      "Content": "cee-jay wrote: Hi xx My name is Karla also known 2 the family as Cee-jay :)) I live in the U.K :)) Firstly The biggest hug and prayers 2 all of you on here, no matter what our diagnosis, I am so glad I have found this site and I so hope 2 make sooooo many new friends xxx sooooo a big HELLOOOOOOOOOOOO xx  Right here goes :- xx I found a lump a couple of weeks ago in my left breast, BUT being the person i am I didnt panick I have just been watching it closely, I have been a bit on the quiet side 2 all around me as my mind has been drfiting off, which didnt help my new relationship I am in x It caused an upset between us so I told him my concearn and he was so shocked bless him < i tried 2 make a joke etc but he had tears in his eyes so changed the subject and we carried on with our evening BUT late on on saturday evening  I went for my bath, and why what I dont know but (BANG) I felt a lump BUT this time in the left breast and I just knew something was not right not this lump thats 4 sure :(( ive always had lumpy bumpy big boobs lol, but wow This felt totally different,2 the right lump and this seriously went BANG in my head for alarm bells ( a big kick type of thing ...weired) I went to the doctors today and they are sending me for an urgent mammogram ? as i tick all the boxes ?? hmmm but I cant get my head around the waiting,.... My boobs for weeks felt/feel horrible, they just dont feel like mine ? so strange but finding the lump obviously explains the feeling,  BUT the worst feeling of all is what is going on in my head, The UNKNOWN ... What 2 do ??? MY PROBLEM thats driving me insaine .... I have 2 amazing teenagers, Adam who is 19 very sensitive, my little rock x My eldest Simon 20 who is also sensitive but quite a hard faced sort ( like his dad) lol, we are extremely close and were very open always have, I have been a single mum for 18 years and its been the best !!  lol, Hell at times BUT just amazing x as i know  they are such great boys and i am a great mum, who has always allowed them 2 live life 2 the full x.............. Problem is Do I tell my boys, when there is nothing 2 tell as yet, only that mum has found a lump, and watch their poor faces :((( as we have only just buried a precious friend of my eldest boy, who sadly cruely died of cancer aged 19 yrs old :((( so saying to my boys ...Ive found a lump like my son's friend did, will not make them not up set and worry bad, as how can I say o it will be nothing when my boy heard that via his friend to then bury him 6 months later :(( ........... I am also in a very new relationship, his name is Paul, great guy we have already had our up's and down's but were getting through, learning each other every day  :)) BUT NOW,  .......AGAIN!!! what do i do, with the relation i so enjoy being in, Ive just woken up from a dream........ that im going for the scan, Paul  (my boy friend) is down stairs waiting in a different corridor of the hospital, just when im due to go into the room, The nurse started acting strange dodging me asking 2 go and get paul, BUT eventually I find out  paul has left and gone home,  I Try 2 ring him etc but no answer ??? so a friend has 2 come and get me, and in the dream the drive home takes so long, it all seemed so real ??  but confusing as in my dream didnt go in2 the room for the scan, eventually I end up in paul's house asking why he left but he is silent and looks so scared so small, and i feel so sick and cruel as im doing this 2 him,........Then i wake with tears in my eyes as Im doing this 2 him :(( God my head is all over the place im fighting back tears as im not scared my self, im totally numb, Im scared for all around me ???  I just dont know what 2 do, do i run away now and free paul from what could be ?? as just these 2 weeks I know are going 2 be so hard as already I quickly got off the phone this evening, as I want 2 be alone a bit 2 take it in, 4 what could be and prepare my self.  O i dont know  2 be honest ?? It could be a cyst and i pray so much that it is, even though breast cancer is rife in my family ( my mum and nanna)  O what 2 do ....... Sorry i just dont know who 2 talk 2 so i am speaking a loud, as i dont want 2 tell every body i guess what i am feeling, though yet I dont even know what im feeling ( O what a mess)  do i run away from paul for the best as 2 weeks of the un known is 2 me right now a life time ......... do i tell my precious babies .............. I really feel in a nightmare ..........yet im wide awake :(((  cee-jay Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759857",
      "Title": "my head is spinning but not 4 myself but other's close 2 me :( cee-jay chrissyb"
    }
  ]
}