{
  "AuthorID": "Jaynina",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246293/profile",
  "Posts": [
    {
      "AuthorID": "Jaynina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246293/profile",
      "Content": "Jaynina wrote: First of all, I have to say sorry if my English is not good or clear enough because English is not my mother tongue. I am just diagnosed with stage IIb breast cancer. I just had a mastectomy and the report shown like this: - Invasive ductal carcinoma, Grade 2 - Tumor size: 3 cm. - Extensive intraductal carcinoma (EIC): 40% - ER+80%, PgR+90%, Ki67+80% p53+60% HER2/neu Score 3+ - Lymph node involvement: 2 out of 23 nodes (the largest is 1 cm.) - Extranodal extension present The doctor told me to do a bone scan, CT scan and Muga in the next two weeks. But now i am so worried about the phrase 'Extranodal extension present'. I search the meaning in dictionary and not clear about it. Please kindly help me to clarity my questions as follows: 1. Does 'extranodal extension present' mean that I have a high risk that the cancer might have spreaded to other organs already? For example, bone, liver etc. If it's like that, I might have to be in Stage 4, right? 2. I have to go with herceptin, as the doctor said. If i take it, what is normal or average 5 or 10 years survival rate for me? Thank you for all your kindness here. Nina Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/852269",
      "Title": "What does 'Extranodal extension present' mean? Jaynina Jaynina"
    },
    {
      "AuthorID": "Jaynina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246293/profile",
      "Content": "Jan 31, 2017 08:08AM - edited Jan 31, 2017 08:29AM by Jaynina Dear The Mods,  Thank you so much for your quick information. I have read that but still have a question.  In the article, it is stated that \"Extracapsular extension: Cancer has spread outside the wall of the node\". Is it possible to say that the cancer has spread to other organs in the body like bone, liver etc. (stage 4)?  Is there anyone here who have this phrase in the report? I am still new about having breast cancer and not really strong enough to fight with it. I have a 10-year-old daughter and wish I could stay with as long as I can. I will go for the bone and CT scan in the next two weeks but I'm too worried to wait for the results then.  Thank you in advance and I am very glad that I found a good place to share my thoughts and feelings about this hard time here!",
      "MessageIndex": 2,
      "PostDate": "31/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/852269",
      "Title": "What does 'Extranodal extension present' mean? Jaynina Jaynina"
    },
    {
      "AuthorID": "Jaynina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246293/profile",
      "Content": "Feb 3, 2017 04:31AM Jaynina wrote: Dear Jennie93, Thanks so much for sharing your inspiring information! :)",
      "MessageIndex": 10,
      "PostDate": "03/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/852269",
      "Title": "What does 'Extranodal extension present' mean? Jaynina Jaynina"
    },
    {
      "AuthorID": "Jaynina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246293/profile",
      "Content": "Jan 31, 2017 09:43PM Jaynina wrote: Lekker, thanks so much for your note. I'll look for the HER2+ board you suggested here. Love to know that you and your husband love my country. Thanks for that too!  Nina",
      "MessageIndex": 8,
      "PostDate": "31/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/852269",
      "Title": "What does 'Extranodal extension present' mean? Jaynina Jaynina"
    },
    {
      "AuthorID": "Jaynina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246293/profile",
      "Content": "Jan 31, 2017 07:19PM Jaynina wrote: Dear Lekker, Thanks so much for your information. I'm not sure that Perjeta is used here in my country or not (Thailand). I just known that my doctor will treat me with Herceptin. I'm glad to have a good place here to exchange information and will come back to update the scan results soon. Nina  ",
      "MessageIndex": 5,
      "PostDate": "31/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/852269",
      "Title": "What does 'Extranodal extension present' mean? Jaynina Jaynina"
    },
    {
      "AuthorID": "Jaynina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246293/profile",
      "Content": "Jan 31, 2017 07:21PM Jaynina wrote: Dear fd1, Congratulations for your great result! It made me feel a lot better to fight for it!  Thanks so much! Nina",
      "MessageIndex": 6,
      "PostDate": "31/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/852269",
      "Title": "What does 'Extranodal extension present' mean? Jaynina Jaynina"
    }
  ]
}