{
  "AuthorID": "jazrobinson",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213346/profile",
  "Posts": [
    {
      "AuthorID": "jazrobinson…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213346/profile",
      "Content": "Apr 20, 2015 04:31PM - edited Apr 20, 2015 04:31PM by jazrobinson",
      "MessageIndex": 2,
      "PostDate": "20/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830010",
      "Title": "Fibroadenoma/Complex Cyst or something else? jazrobinson jazrobinson"
    },
    {
      "AuthorID": "jazrobinson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213346/profile",
      "Content": "jazrobinson wrote: Hi, I'm 19 (about to turn 20 in a month), and about a couple months ago, I found that my left breast was starting to feel a little sore, and then I found a breast lump at the top of my breast. I went to the doctor and he told me that I should get an ultrasound and that it will be most likely benign, as I'm only 19. I went to the ultrasound, they found the lump, and then came back with results that said it could be either a fibroadenoma or a complex cyst. They also said they found some calcifications. My doctor said to go for a second opinion ultrasound. I'm about to do that in a couple weeks, but in the mean time, I've recognized that the lump has grown almost three times its size in a month and is starting to make my left arm ache like mad. The lump hurts mostly at night and is making lose sleep more than normal. I'm only wearing sports bras now and my left breast is sagging more than my right breast. This morning, I then realized that I may be forming another lump in my right breast. I went to my doctor again and he told me to take advil for the pain (which is not cutting it at all). With my period coming up in a few days, the pain has been really bad. I'm very paranoid as breast cancer runs in my family and I have had no biopsies or surgical removal of any lumps yet. I also have anxiety issues, which doesn't help the situation at all. I'm really scared about what this is and I am in tons of pain. Anyone have any advice? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830010",
      "Title": "Fibroadenoma/Complex Cyst or something else? jazrobinson jazrobinson"
    }
  ]
}