{
  "AuthorID": "Jazz123",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245141/profile",
  "Posts": [
    {
      "AuthorID": "Jazz123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245141/profile",
      "Content": "Jazz123 wrote: journey since 2008 march 2008 ...son still born, 23 weeks and maisie survived 10 weeks dad died off terminal cancer may 4th 2016 after 10 month lump found 2 dec 2016...reconstruction etc 11 jan 2017 lumph nodes removed 7 cm tumor chemo starts 8 th march 9 years to the date after the twins. every 3 weeks for 6 lots then a month off then 3 weeks of radiotheraphy. would be lovely to share the journey we are on, a place to do, to be who we feel that day its good to talk vicki aquarius sun sign lives in walton Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/852954",
      "Title": "Chemo starting 8th March ...journey since 2008 Jazz123 kbt"
    },
    {
      "AuthorID": "Jazz123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245141/profile",
      "Content": "Jazz123 wrote: morning ladies i have occassionally looked at the posts here over my treatment. i have since january had reconstruction, with expander last op due dec 2017 three chemos with ECT drugs and now chemo 4 with docetaxal, i have coped amazingly well on chemo 1 to 3 infact all family and friends have said inspirational but this docetaxal drug for sure has got me down and wiped me out.......pins and needles after first day still have them in my feet, finger tips now sensitive, taste buds gone, even water tasted naff. only two more to go i know then month off before 3 weeks radiotheraphy, but i am wanting to know if any one of you lovely ladies are having theses side affects and what you did to pick yourself up or even to go on the journey together, as nobody understands it unless you are in it yourself, and hubby is good but cant deal with the emotions of all of this love and light vicki Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855212",
      "Title": "docetaxal chemo 4 side affects Jazz123 Jazz123"
    },
    {
      "AuthorID": "Jazz123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245141/profile",
      "Content": "Jan 10, 2017 03:06PM Jazz123 wrote: tomorrow is the day i have my mastectomy after being told on the 13th dec that i have a 7cm moderate agressive tumor on my right side. i have good friends and family with a strong husband but its good to know what we can feel not alone together, as i feel we are the ones going through this.....chemo will be after 5 weeks recovery...hugs to you all x",
      "MessageIndex": 421,
      "PostDate": "10/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Jazz123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245141/profile",
      "Content": "Jan 14, 2017 09:58AM Jazz123 wrote: hi ladies Well op over.... period pain was the worst for a while then four after getting to ward had a hour of intense boob heat, fainting, sick... hubby had the shock of his life but was amazing. Day to leave in the afternoon due to possible morphine pain drug t went totally out while then sitting on chair... so stayed in...l have Boob drain out wed.. the other 2 the following week... LYmph nodes removed as two showed cancer !!! Await results .... into meditation. And mindfulness to this helps hugs and love",
      "MessageIndex": 631,
      "PostDate": "14/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    }
  ]
}