{
  "AuthorID": "jazziD",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/33548/profile",
  "Posts": [
    {
      "AuthorID": "jazziD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/33548/profile",
      "Content": "Nov 8, 2009 12:15AM jazziD wrote: Hi ALL... glad to be here... I recently had a brain scan on October 23rd because of a couple of bouts  with vertigo, but I found out this past week that the scans were clear and that the vertigo was probably caused by some inner ear problem...  I am so relieved...  I am meeting with my breast surgeon soon to schedule a bi-lateral mastectomy because I had reconstruction/augmentation (reduction) and augmentation (reduction) in my left breast.  The reconstruction didn't work...developed a hole that just recently healed and the bc breast is a mis-shapen, ugly mess... so since I am having the bc breast removed, I want to be symmetrical.   Regarding having positive lymph nodes, I remember when my breast surgeon first told me that my nodes were positive and I asked her, \"does this mean that it has spread throughout my body?\" ... and she said... \"no, it just means that the cancer spread to your nodes and that they did their job and caught the cancer\"... when the pathology report came back, it was found that the lymph node that was bothering me measured 5cm, but my surgeon said that they were impressed that when the node was examined no cancer cells were found on the outside of the node and there was no indication that the cancer had spread outside the node...so it did contain the cancer, based on the pathology report...  I look forward to getting to know you all... Take care, ~ Dee ~",
      "MessageIndex": 66,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "jazziD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/33548/profile",
      "Content": "Jul 21, 2018 02:19AM jazziD wrote: I can't have BP, etc. taken on my right arm, breast cancer / 0 lymph node side. One iv was in my left arm and when I woke up the other was in my neck. I was surprised about that. But that's how they addressed the issue of 2 iv sites for me.",
      "MessageIndex": 3,
      "PostDate": "21/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/866027",
      "Title": "Total Knee Replacement Surgery Issues - Left Arm Lymphedema Sher Sher"
    },
    {
      "AuthorID": "jazziD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/33548/profile",
      "Content": "Nov 8, 2009 08:45PM jazziD wrote: Hi Day, I just wanted to mention that I had 4 AC and 4 Taxol and it really wasn't bad at all... I worked through all my treatments... Yes, around the 4th day out of the treatments, I felt some of the SE's, but I had family leave and I just took the day off and the next day I was fine.. I just felt more tired on the 4th day...  The only painful SE with AC was a headache, about 5 minutes after the treatment, so after the first treatment, the nurse gave me tylenol right after the treatment and the headache subsided quickly...  I tolerated the Taxol better, but I did develop some neuropathy in my hands and feet, not bad though,and it has now gone away...  I had 35 treatments of radiation and I was fortunate enough not to get any fatigue... I worked everyday and walked over to the hospital..  I even asked my Radiologist, \"are you sure you are really giving me radiation treatments because I am not experiencing the fatigue that a lot of women experienced!\"...  I had a failed reconstructive surgery... I didn't have implants, but I had augmentation... breast reduction of both breasts and scar release in the bc breast..  Because of the radiation treatments however,  I lost skin and devloped an infection and a 2 inch hole that I had to pack/dress, from Feb/2009 through August, 2009...   It is now healed, but I am not satisfied with the reconstruction, the bc breast is very disfigured.... I have decided that I am going to have a bi-laterial masectomy in the near future...  I am ok with that... ... I hope that you fight as hard as you can to beat this dreadful disease and understand that chemo is one way of doing that...   I know that you can't see it now, but as you can see, we have all had chemo and don't have any regrets, at all... I looked at my chemo treatments as \"hope\", a way to \"kick cancers butt\"...  I really hate that you feel this way and hope that you allow us to help you through this and know that you are not alone and I hope that you can draw some comfort from us...  ((((HUGS)))) ~ Dee ~",
      "MessageIndex": 88,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "jazziD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/33548/profile",
      "Content": "Nov 6, 2009 10:58PM jazziD wrote: ... where are you posting?",
      "MessageIndex": 143,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "jazziD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/33548/profile",
      "Content": "Nov 4, 2009 03:41PM jazziD wrote: ... I am also stage II and I think that a forum for us would be great... I was just thinking about that the other day as I looked through the list of forum's to go to...  Count me in ... ... ~ Dee ~",
      "MessageIndex": 109,
      "PostDate": "04/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "jazziD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/33548/profile",
      "Content": "Nov 6, 2009 03:52PM jazziD wrote: ... I did not see the forum listed for Stage II ... is it on the pull down list?  ~ Dee ~",
      "MessageIndex": 136,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "jazziD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/33548/profile",
      "Content": "Nov 5, 2009 02:08PM - edited Nov 6, 2009 01:20AM by jazziD Dogsaver:  .. Don't blame yourself for not going sooner becauseI just wanted to mention that prior to my breast cancer being discovered, I had had a mammogram Jan./2006 and the lump was not there (mammograms are yearly)...  When I was doing step aerobics in July/06 I kept hitting a sore area on my right side... after I finished exercising, I examined that area, but I didn't feel anything... later on that night, I did a breast exam and still didn't feel a lum, maybe just a slight thickening, but it was hard to tell because I had gained so much weight in my breasts... Well, anyway, I felt that something was wrong...so I mad an appointment with my pcp... she examined me and couldn't feel anything, but then she asked me to sit up and raise my arm... it was only then that she could feel the lump in my breast, but it was not small or hard, it had more or a cyst like feel to it and that is what, initially she thought it was... we still couldn't find out what causing the pain on the right side and it only hurt when I would move my arm a certain way.  So they scheduled a diagnostic mammogram and ultra-sound; while I was waiting for my results, the breast surgeon came into the waiting room and said that there was a suspicious area and that she could give me the biopsy today... so I agreed (... thankfully my insurance paid for it, because I didn't have a referral for it).. anyway, the biopsy verified cancer, and the ultra-sound showed that the pain was coming from a lymph node that was 5cm...   Initially my surgeon thought the tumor in my breast was 3cm, but when I had it removed, it was 2.0, and when they received the pathology report they found that the tumor was a fresh tumor, it virtually popped up overnight, because there was no necrosis  or dead tissue on the tumor  that would indicate that the tumor had been there for awhile...  It was not there in January, and when I did my BSE in June, it wasn't there, but it was there in July...this indicates an agressive tumor...   ...That is why BSE are so important and when you get your mammogram report they always say to continue doing your BSE ... and always do the BSE lying down, sitting and standing up...    I am just glad that I went to the doctor as soon as I had... the pathology report noted that there was no sign of cancer outside of the lymph node, but at 5cm, who knows how long it would have contained it...  ~ Dee~",
      "MessageIndex": 117,
      "PostDate": "05/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "jazziD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/33548/profile",
      "Content": "Oct 30, 2009 11:41AM - edited Oct 30, 2009 03:47PM by jazziD  I remember Stephanie from when I was first diagnosed in 2006 and I am so saddened by this... I know that she is in a better place now, but it is still painful to lose another sister to this horrible disease...  Peace to Stephanie... my prayers to her family and friends... and yes, Stephanie, \"God is able\"...   ~ Dee ~",
      "MessageIndex": 102,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742956",
      "Title": "Stephanie is an Angel 2timer Britt"
    },
    {
      "AuthorID": "jazziD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/33548/profile",
      "Content": "Aug 23, 2006 09:47PM jazziD wrote:",
      "MessageIndex": 11,
      "PostDate": "23/08/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/353848",
      "Title": "pain after lymph node removal ktwist minnielee"
    },
    {
      "AuthorID": "jazziD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/33548/profile",
      "Content": "Aug 23, 2006 11:28AM jazziD wrote:",
      "MessageIndex": 9,
      "PostDate": "23/08/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/353848",
      "Title": "pain after lymph node removal ktwist minnielee"
    }
  ]
}