{
  "AuthorID": "jbaudit",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103500/profile",
  "Posts": [
    {
      "AuthorID": "jbaudit",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103500/profile",
      "Content": "jbaudit wrote: My wife is at the stage all you ladies were at a while back. First I want to wish you all great sucess with your treatment and hope the cancer will stop right in its tracks. I have a question concerning chemo treatment as a necessity. reading all the comments from the wonderful women  who have supported one another I find it so encouraging that help is offered based on previous and current experiences I Believe my wife has ILC stage 2 grade 2 with no lymph involvement and ER+ PR+ HER- She had her lupmpectomy + sentinal node biopsy 6/26 i am wondering if any of you ladies had similar diagnoses and did chemo and why. It seems to me that the lymph involvement and HER+ is more common to chemo treatment I wish all of you a wonderful 4th of July weekend and  pray for all here to be well and beat this SOB disease. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754931",
      "Title": "chemo or not jbaudit Shelly1953"
    },
    {
      "AuthorID": "jbaudit",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103500/profile",
      "Content": "Jul 7, 2010 09:51AM jbaudit wrote:  lovecranes. Thank you for taking the time to write. You women are so great in trying to help others. The info I posted may not have been clear My wife had her lumpectomy and sentinal node biopsy and what came was I think good news (No lymph involvement) After much pushing at the hospital I got the Patholgy and tissue report which tells me grade 2,stage 2, er+ pr+ ( 3+ with 75% involvement ) and clean margins 3cm in diameter. My wife is trying to avoid chemo and with this result it is questionable. We are seeing 2 Med onc 1 on  fri and 1 next thurs and 2 radiation onc one this thurs and one next thurs. My great concern now is the onco test takes two weeks to come back and its already two weeks since surgery. Can RADS be put off past 8 weeks after lumpectomy because  if we do chemo based on the Onco, that wont be decided for another 3 wks at best  and that puts us at 7 weeks + but we feel its important for 2nd opinions on both treatments and if she can get the onco, I would like to go that way. I read  somewhere that there is a time constraint with radiation anyone with actual experience please chime in here God bless you all",
      "MessageIndex": 5,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754931",
      "Title": "chemo or not jbaudit Shelly1953"
    },
    {
      "AuthorID": "jbaudit",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103500/profile",
      "Content": "jbaudit wrote: My wifes surgeon is on vacation and I asked his nurse for the pathology findings. She told me that the staging is based on size and hers  was stage 2 yet I read that on the information side of this web site that you are either stage 2A(cancer cells in lymph nodes )or stage 2B (larger than 2 and spread to lymph nodes) The nurse told me that there were no cancer cells in lymph nodes and it measured 2.5 +1.2 linear extension Does anyone knpow what the stage 2  without the letters mean and what the linear extension is.  If anyone knows Please advise as this is so disturbing . PS called pathologist who will only explain in person. we live 1/2 hours away Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754800",
      "Title": "stage 2 jbaudit msmpatty"
    },
    {
      "AuthorID": "jbaudit",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103500/profile",
      "Content": "Jul 7, 2010 09:36AM jbaudit wrote: Soulswithin, Thank you for taking the time to write. You women are so great in trying to help others. The info I pasted may not have been clear My wife had her lumpectomy and sentinal node biopsy and what came was I think good news (No lymph involvement) After much pushing at the hospital I got the Patholgy and tissue report which tells me grade 2,stage 2, er+ pr+ ( 3+ with 75% involvement ) and clean margins 3cm in diameter. My wife is trying to avoid chemo and with this result it is questionable. We are seeing 2 Med onc 1 on  fri and 1 next thurs and 2 radiation onc one this thurs and one next thurs. My great concern now is the onco test takes two weeks to come back and its already two weeks since surgery. Can RADS be put off past 8 weeks after lumpectomy because  if we do chemo based on the Onco, that wont be decided for another 3 wks at best  and that puts us at 7 weeks + but we feel its important for 2nd opinions on both treatments and if she can get the onco, I would like to go that way. I read that there is a time constraint with radiation anyone with actual experience please chime in here God bless you all JB",
      "MessageIndex": 2,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754800",
      "Title": "stage 2 jbaudit msmpatty"
    },
    {
      "AuthorID": "jbaudit",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103500/profile",
      "Content": "jbaudit wrote: Wife is having a  Pet/Ct scan test on Sat. Had a hard time with MRI (Claustrophobia) and had to take two drugs to calm her before going into chamber. After she was fully medicated and felt no pain she was able to do MRI Is Pet /Ct the same type of thing or can You see out and not feel that frightening confinement Any one with these experiences please chime in. Many thanks to you all Worried Husband Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754182",
      "Title": "some help re Pet/Ct scans jbaudit jbaudit"
    },
    {
      "AuthorID": "jbaudit",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103500/profile",
      "Content": "Jun 18, 2010 04:34AM jbaudit wrote: To all  tou wonderful ladies, Thank you for takijng the time and god bless.",
      "MessageIndex": 5,
      "PostDate": "18/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754182",
      "Title": "some help re Pet/Ct scans jbaudit jbaudit"
    },
    {
      "AuthorID": "jbaudit",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103500/profile",
      "Content": "jbaudit wrote: Wife is having Pet/Ct scan Sat and Lumpectomy and Sentinal lymph Node surgery on Wed. The surgeons office tells me that he will advise next step. I am thinking that I  should request that the surgeon give me someone who is a  non surgical Breast oncologist to  be part of this next step recommendation process Radiation chemo etc. My fear is that the person he recommends will tow the same line and go with what the surgeon recommends and if I try to go elsewhere this might pose a problem as to trust etc. (I left University Of Miami Cancer center  after bad karma and demeanor of radiologist  there and went to this surgeon on recommendation from a family oncologist who knew this doc who is head of cancer surgery at MT Sinai florida. Im very confused, nervous and fighting to get the wife into positive mode so that she can cope but with all thats hit her shes angry, emotional and very frighted so I am trying to do this as smothely as possible. Bottom line to this note is to see if its proper procedure to put yourself in the hands of the surgeon  operating on my wife after  the surgery or to seek other or additional  profesional help. Hope someone can shed light for us Thank you all! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754289",
      "Title": "what comes next jbaudit SoCalLisa"
    },
    {
      "AuthorID": "jbaudit",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103500/profile",
      "Content": "Jun 18, 2010 02:43PM - edited Jun 18, 2010 02:44PM by jbaudit J414 Thank you for the info I didnt understand when his office mgr tells me he prescribes the path as he is an Onco By the way the MT Sinai  hospital I refer to is in Florida..  I kinda  wish I was in NY Spent 66Yrs  there and all our Mds and friends are there miss it ",
      "MessageIndex": 2,
      "PostDate": "18/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754289",
      "Title": "what comes next jbaudit SoCalLisa"
    },
    {
      "AuthorID": "jbaudit",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103500/profile",
      "Content": "Jun 18, 2010 09:15PM jbaudit wrote: Clair, Thank you for your kind words. The family onco  I mentioned is a retired distant relative who was a hemotoligist in oncology  in the Miami area and knows this surgeon. I dont think they worked together as I think hthe relative would have told me. I had to do the choosing of this surgeon due to the panic and anxiety my wife is experiencing and hope to the good lord for the best. It sounds irrational but I was  not able to control this and we have been in a bad place these last three weeks leading to this.  the surgeon is chief  of surgery at Mt Sinai Miami . I felt that the previous experience with the  people (radiation oncologist) at U of Miami Sylvester when getting the core biopsy, mamography and ultra was  possibly unaceptable and indicitave of the rest of the staff  there  I  also read a negetave review about the  Miami Sylvester surgeon online. so I changed course and met  with the recommended surgeon at Sinai Miami I pray I did the right thing as my wife is fragile and anxious  .I will definitely try to get her calm enough  fo go forward. Sat is Pet/Cat and wife is a wreck. Thanks to you and all that have offered help",
      "MessageIndex": 6,
      "PostDate": "18/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754289",
      "Title": "what comes next jbaudit SoCalLisa"
    }
  ]
}