{
  "AuthorID": "jbdayton",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
  "Posts": [
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "May 23, 2015 02:49AM jbdayton wrote: MaryJC I did a colonoscopy in April this year. It was easy-peasy compared to any of this breast cancer stuff. What are you most worried about? The prep to get ready is the worse. I was able to get all the prep fluids down within a 4 hour window and was very clean for the test. I was put on a liquid diet for Saturday and the prep fluids beginning Sunday noon. Then water for the rest of the day. Procedure was early Monday morning. Relax it is not so bad.",
      "MessageIndex": 7,
      "PostDate": "23/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/831650",
      "Title": "So Many Different Emotions Heatherta7 MaryJC"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 19, 2013 09:33PM jbdayton wrote: Good luck KBeee. I will be having my bmx and SNB on Aug 26. No radiation was a big selling point for me also. Grade 3 tumor and against the chest wall was a bigger factor with lots of calcs in the other breast. I did chemo first and the tumor is no longer visible so hoping for great final path report. Have a great week as you prepare for your surgery. Wishing everyone calm thoughts as you make your surgery decisions I know this is a hard one.",
      "MessageIndex": 40,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/808846",
      "Title": "How did you decide on lumpectomy or mastectomy/ livingwithit IrishDancingMom"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 20, 2013 09:43AM jbdayton wrote: Thanks Beesie. I always expected to have rads but my surgeon said she is giving me a 99% chance of no rads. I am doing delayed reconstruction just in case i have to do rads. I am leaving the option on the table. I really have done lots of research and am prepared for rads if needed, just trying to think positive since she is so certain i will not need them. Don't want to mislead anyone a mastectomy does not guarantee no radiation. Sorry if I confused anyone or gave false hope, not my intention. Love to all.",
      "MessageIndex": 47,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/808846",
      "Title": "How did you decide on lumpectomy or mastectomy/ livingwithit IrishDancingMom"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Sep 22, 2014 01:59PM jbdayton wrote: My stats are the same.  I did 25 rads and no boosts.  Reason for radiation was the report from the mastectomy showed residual DCIS and about 5mm of tumor was left following chemo but it was located right against the chest wall.  It wasn't bad, no burns and my reconstruction of the radiated side has gone well. Your mom will have to make her own decision with the guidance of her doctors. Prayers for you and your mom.",
      "MessageIndex": 1,
      "PostDate": "22/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/824781",
      "Title": "Mastectomy and radiation mkkjd60 clarrn"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Mar 2, 2017 08:23AM jbdayton wrote: cdv, checking in to wish you a successful surgery. We on the DIEP 2017 thread are sending our prayers and good wishes.",
      "MessageIndex": 97,
      "PostDate": "02/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 15, 2013 09:36PM jbdayton wrote: Rosamond - Sorry for the delay but glad everything went as you wanted.  GrammaB - adventures that never end.  Be careful with the meds.  Yeah for clear SNB. Delerium - hopefully you are feeling much better by now.   ",
      "MessageIndex": 99,
      "PostDate": "15/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 16, 2013 07:52PM jbdayton wrote: Did my final pre-op stuff today.  One week to finish shopping and house cleaning before my surgery on the 26th.    Reading closely all your posts for anything that can help me.  Glad everyone seems to be healing well.  Keep taking care of yourselves and get plenty of rest. For those needing chemo, my prayers will be with you.  Glad I did that first.  blessings to all ",
      "MessageIndex": 104,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 23, 2013 01:58PM jbdayton wrote: I hope everyone with surgeries planned for next week can find time this weekend to enjoy your family and get some rest. I am busy getting ready for Monday's BMX.  I did all my floors today, laundry done, some meals cooked and in the freezer.  Still need to do a little more shopping tomorrow.  Plan on going to church and relaxing on Sunday.  Earty to bed then early to rise on Monday and head to the hospital.  Have to leave at 6a.m. for 12:00 noon surgery. By Sunday I may not feel as prepared as I do right now.  I am sure I will be super anxious by then.  Trying to stay positive but this is a big step. To all those healing hope you have a comfortable weekend. ",
      "MessageIndex": 165,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 25, 2013 12:54PM jbdayton wrote: JennH I personally understand since my BMX is tomorrow at noon (6 hr sx).  I am definitely getting very anxious.  Keep telling myself slow deep breaths.  Have a few quick things to finish here around the house then relax for the rest of the evening. I want to wish you a good sx and see you on the flip side.  To everyone else with surgeries this next week, best of luck and my God be with all the surgeons for steady hands. To those recovering keep the comments coming and keep encouraging the rest of us following in your footsteps.",
      "MessageIndex": 183,
      "PostDate": "25/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 26, 2013 08:29AM jbdayton wrote: In surgery holding area about to get started with pre meds will update tonight if feeling up to it. Nerves are holding up ready to get this done. Hope everyone else is doing as well.",
      "MessageIndex": 193,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 30, 2013 02:27PM jbdayton wrote: Jacquie sounds like we are on the same page. I don't know if the pain is more or I am just feeling it more since I quit taking pain meds. I have not had a bm either doubled up on colace. Concerned that I am only getting about 10cc in each drain since 9:00 this morning. Hope everyone else is progressing well.",
      "MessageIndex": 242,
      "PostDate": "30/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Sep 2, 2013 06:59AM jbdayton wrote: As for hair loss with chemo.  I did lose my hair beginning on day 12, on day 15 had appt to fit my wig.  Actually ordered the wig 2 weeks before chemo (it was ordered to fit my head dimensions).  The hair designer would not let me come in until my hair started falling out.  No adjusters inside and did not have to wear anything under it had it own web cap.  It breathed on its own and was not too unbearable even in Texas summer heat.    The wig was made of real hair that could be washed and styled however I wanted.  We cut the wig to look just my current hairstyle.  No one even realized it was not my own hair.  I am still wearing my wig daily even though I now have my hair growing back inI(about 1/2 inch).  If I dress like I am going to lounge around for the day my mind says lounge around and then I feel like I got nothing accomplished for the day.  I am not saying you cannot lounge for a day but not everyday.  I have a lot to do in my life and do not want to waste a single day if I don't have to.  Choosing to wear a wig or not is another one of those very personal choices you have to make.  I guess I am on the vain side of life.  I did not want to look different.  I wanted to feel as normal as possible.  My choice was right for me. I am doing fairly well for day 7 after surgery.  My appointments for followup are Wednesday with PS and Thursday with BS.  Hoping for final pathology reports at that time.  Both drains are down to about 10cc every 24 hrs so anticipate having them removed.  Then if no radiation is required can start planning DEIP reconsruction plans.  An end is in sight. Hope everyone else has a great Labor day today whether healing or preparing for the next step in your journey.  Hugs and Prayers to all.",
      "MessageIndex": 294,
      "PostDate": "02/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Sep 14, 2013 06:32PM jbdayton wrote: Thank you Babs for the tips.  I appreciate anything anyone passes on from their experiences.  Right now I am trying to get as strong as I can before starting another treatment routine. Have a great weekend everyone.",
      "MessageIndex": 492,
      "PostDate": "14/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Oct 7, 2013 07:15AM jbdayton wrote: Wow, I also had neo-adjuvant chemo and a port. My port was placed in my chest and the surgeon made sure it was to the side of my normal bra strap for comfort. It was visible with wide neck lines but was able to cover it with most v-necks. The incision is barely visible 6 weeks out from removal. I could feel the tube, it went upwards and then turned downward toward the heart but I don't think it will be visible. I would definitely do the port again. I did not have the metal taste as the needle was removed, but do agree I had a metal taste sometimes during the infusion. I had TAC chemo. I chewed shaved ice during my treatments and rinsed my mouth several times a day with both the magic mouthwash and the baking soda mixture. I did avoid mouth sores but had thrush and a very tender and sometimes raw tongue. I would totally lose taste of most foods for several days during the first few treatments and for a week or more in the later treatments. I did not ice my fingers or toes. I do still have some minor neuropathy in my fingers and toes up to the first joint. I am finally starting to feel some improvement. It has not prevented me from doing anything I want to do. I am 3 months out from last infusion. A good thing is my hair is very thick and about a half inch long now. When things start returning to normal it is easier to say chemo is doable. I kept a smile on my face throughout the whole process and it made it better even with the side effects. They do pass and you will feel better quicker than you think at the time. Good luck to all starting this adventure. My prayers will be with you. I will be starting rads in the next week or so my mapping has been done. Hope everyone has a great week as they pursue each step of this journey. Hugs to all.",
      "MessageIndex": 698,
      "PostDate": "07/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Oct 29, 2013 03:51PM jbdayton wrote: Lili are you taking Claritin for the bone pain? Could be a side effect from the Neulasta injection. I took it 2 days before chemo and for 6 days after. When I took it day of and for 3 days after, the pain was fierce. But taking it sooner and longer worked miracles for me. so sorry you are feeling nauseous hope you can get it under control for future treatments. (((HUGS)))",
      "MessageIndex": 816,
      "PostDate": "29/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 7, 2013 09:53AM jbdayton wrote: Just got home from my PS appointment.  I will be having a BMX on August 26 with tissue expanders.  Reconstruction will be in a couple of months if radiation is not needed.  My BS does not anticiapate needing radiation since there is no visible tumor left after chemo.  Of course we will have to wait for final pathology to be absolutely sure.  At the moment I am thinking I will do a DIEP.  Glad these decisions are finalized.  Now to take a deep breath and prepare for surgery and recovery. Songcat, Cinchud and Carrie - prayers for your surgeries this week.  Michele - so glad you are doing good at 5 days out.  Almost 2 years is a long time to still be dealing with this.  Rosamond- hope you got the all clear on the node and are scheduled for immediate recon.  Hugs to everyone as they go through this week whether surgery, recovery or still planning. ",
      "MessageIndex": 54,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Nov 8, 2013 12:03PM jbdayton wrote: Thanks for asking. I have 2 regular rads left. Holding up pretty well, just good sunburn look but no blistering. Weekend off to recover some. Have starting feeling fatigued the past 3 days in the early afternoon. the past 2 days I have had tummy issues, not sure if rads related or not. Meet with RO on Monday to discuss if any boosts are needed. Tuesday afternoon I meet with my MO and will probably be prescribed an AI. Thursday I have an appt. with my PT for LE. Off until Dec 4 when I will meet with my PS and start planning DIEP reconstruction for 2014. I don't know if will do any fills or not, wIll find out. I cannot believe this part of the journey is almost over; 10 months of treatments. I am going to consider reconstruction separately. That will be my 2014 journey. Good luck to everyone else. I keep reading up on everyone. Sorry so many of you have had a hard time with your chemo. I am glad my chemo was before any other treatment. Sounds more challenging when your bodies and immune systems have been compromised from surgeries. I know everyone will make it through this but remember many friends are in your pockets as you continue your journey. Many hugs to all.",
      "MessageIndex": 866,
      "PostDate": "08/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 23, 2013 07:39PM jbdayton wrote: Lyn - Welcome.  Sorry you have to join this group.  You will find everyone to be very helpful.  Feel free to say anything you would like.  No question is a dumb question.  We will give you our best answers.  We are all at different stages in this process.  Some of had chemo some are on their second or third surgery. Our best wishes to you for an easy surgery next Thursday.  You can do it and beat this disease. Have a good weekend everyone.",
      "MessageIndex": 171,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 29, 2013 02:50AM jbdayton wrote: Jo now your next for a great sx and recovery. To the rest of us healing, have a restful day.",
      "MessageIndex": 228,
      "PostDate": "29/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 30, 2013 05:15PM jbdayton wrote: Babs not anticipating rads unless something unexpected comes back in final path report. Right now all the docs think the chemo got it all. Praying for a complete response. Hopefully next step will be reconstruction.",
      "MessageIndex": 245,
      "PostDate": "30/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 31, 2013 11:52AM jbdayton wrote: The first week with them is hard to predict. I don't know if I will have any fills my TE's are just until final path is in and if radiation is not needed then on to diep reconstruction shortly. I did have skin sparing bil mx. They are tight but still lots of swelling.",
      "MessageIndex": 257,
      "PostDate": "31/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Sep 4, 2013 04:31PM jbdayton wrote: I had my first post-op appt with my PS this morning.  I was only putting out about 15 cc in each bulb for the past 4 days.  Wasn't a good thing though.  The drains actually had been obstructed at the drain sites and I had developed a fairly good seroma already in the left breast.  They set up the surgery suite and cut me back open cleaned out the infection packed with anti-biotics and resewed me back up with new drains.  The propylactic side was ok but cleaned the drain area again to be on the safe side. I never had warm breasts, no reddness and no fever so I was really surprised.   I will be taking it easy for another week or so.  I wanted to know what could have caused this because I was very careful with cleanliness.  He said I did nothing wrong, maybe my immune system was still compromised from chemo.  I will still be seeing my BS tomorrow morning and at least get my final pathology results.  Still want to hear NED while I finish up these last battles. Prayers to all  waiting for Onco results.  I will be glad to talk to anyone needing chemo. ",
      "MessageIndex": 340,
      "PostDate": "04/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 28, 2014 05:17PM jbdayton wrote: AMEN. Aviva.",
      "MessageIndex": 1163,
      "PostDate": "28/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Feb 25, 2015 08:43PM jbdayton wrote: Kbee so sorry for the positive node. I am in awe of your courage. I will pray for your strength to battle this again. I hope the ovaries are clean. Get your rest and keep us up to date on your progress.",
      "MessageIndex": 1208,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Sep 11, 2013 02:25PM jbdayton wrote: Hey fellow fighters, sorry I have been AWOL since 9/5.  For all who wanted an update thank you very much for your concern and prayers.  I healed very nicely after they cleaned out the infection.  In fact on Monday they removed both my tubes, staying on anti-biotics for an additional 10 day prescription for safety.  My AWOL problem was not me this time.  Seven years ago I quit work to take care of my mother suffering from dementia.  At the time of my diagnosis I had to find a nursing home to take her as a private pay resident.  She has progressed downhill and has fallen twice busting her head and needing care.  I got a call last Thursday night she had fallen again and we needed to pick her up at the hospital and return her to the nursing home.  My husband and I heard from a friend of his that the home his mother was in had a death and they would be willing to interview us to place my mother there.  We visited and were very impressed, visited Saturday and Sunday and decided to move mom there, moved her in yesterday.  Good feeling about this so now I can start concentrating on me again. Got to take my first full shower and it was heavenly.  Lisa -  so much can happen in one week.  Sure hoping you can get those drains out soon.  I was surprised mine were ready to pull after having been infected.  I was draining slow but steady at least I knew they were not stopping up this time.  I definitely know you are going crazy with them in this long.  Smaller more frequent fills sound more manageable.  Sorry to also hear of possible chemo.  I made it through the chemo with minimal SE’s but I was not coming off surgery rehab.  I do have lots of faith in chemo after enduring the process.  I will pray your “cocktail” will produce few SE’s and eat any remaining loose cancer cells in the process.  Glad going back to work gives you a little bit of normal back in your life. JennH – so glad you got to return to work as well.  Hope your visit with your BS was good.  Hope the swelling on the sides was just swelling and not a building up of fluids.  KBeee – your life never slows down.  Sorry about the disappointment of not being able to attend/work the football game.  That is like losing a best friend.  I spent so many years supporting one group or another at football games.  My children seemed to be involved in everything and I wanted to be there to support them.  Hope the next several months speed on by.  I have been at this since treatment started in February.  I am hoping to be through by this February.  I didn’t ask many questions at the beginning but am asking lots of questions regarding reconstruction.  You will have to live with the results for the rest of your life. You need to post your salsa recipe for us.  Hopefully you got your wigs, have fun at your hair shaving party.  I had both of my daughters go with me to have my head buzzed, wig cut and shaped.  We took videos and then met all the men afterwards for a nice dinner.  Make the best of it.  Aviva – good luck with your onco appointment. Did the underarm bulk ever go down?  I have the same issue and when on my side I feel like the 2 expanders are touching in the middle.  If I lift my arms and reposition them I seem to get release also.  I understand what you are feeling.  My BS is also sending me to a PT for LE she said it is so I can learn what exercises to do to help return to full range of motion and to prevent fluid build up even though I only had 2 SND’s removed.  It should only take 2 visits.  Ndgrrl – hope the rads went well. Babs – sounds like you are moving along as scheduled.  Glad you made it through your meeting ok.  I had my power port removed during the mx also.  I never had any problems with mine being in my chest.  I only used it to receive chemo, I used my arms for all blood draws but I could use both arms prior to surgery.  Now I guess I only have one arm for blood draws. Wrenn – I hope the fluid slows down and you can get the drains removed.  I had mostly yellow by the time they removed mine but I had an infection at day 10 and the PS opened me back up and cleaned me up.  I got them out 7 days later.  For everyone waiting for oncology visits and decisions my prayers are with you as you have to make these tough choices. For anyone I did not specifically address I do care about your progress and hope everyone peace.",
      "MessageIndex": 450,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Nov 9, 2013 03:22PM jbdayton wrote: Thanks Babs but I already have my PS . Glad I did chemo first to did give me several months to talk with both BS and PS and prepare for surgery and reconstruction. Originally I was going to do reconstruction day of mastectomy. Then the BS and PS decided since my tumor was originally against the chest wall we should do delayed recon (DIEP) in case we did not get clear margins. Good decision DCIS was found in the tumor bed and did not get a good enough margin so rads were needed. Too much risk in flap failure with radiation. PS is hoping tissue is good enough for surgery in the next 4 or 5 months. Good luck with your fills and I assume Implants in the future?",
      "MessageIndex": 876,
      "PostDate": "09/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 21, 2013 04:35PM jbdayton wrote: Delerium - so sorry the path report was not as positive as you hoped for.  I know you do not want to do more chemo but it's just a little more insurance to complete the cell destruction.  At least you know the cocktail worked.  Does the onc feel that more doses were needed than your original cocktail?  I really can understand my BMX is Monday and I did neo-adjuvant chemo as well.  No visible tumor on mammo or US but never know about micro cells.  I also did not have SNB before chemo so they will be removing those and testing them during surgery.  Kirsty - prayers and good wishes go with you on Friday.  Praying for clean margins.  My first surgery ever was in February to put my port in for chemo.  Was scared but no side effects from the surgery or anesthesia.  Hoping for the same for you. Aviva - so sorry you have to have additional surgery.  We will be in your pockets on Friday.  Praying for an easy recovery. Rosamond, Honeybair and GrammaB - wishing good continued recovery, you give the rest of us hope. DMarie24, JennH8 and KBeee - thinking of you as we prepare for surgery next week.  I know the closer it gets to Monday the more nervous I am getting.  Trying to make sure I am totally prepared at home.  Luckily I do not have any kids still at home.  I only have a great supportive husband to worry about.  No real worry he has been great and will do great through this. On my way to church prayer meeting, will lift everyone up to God tonight.",
      "MessageIndex": 140,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 26, 2013 09:57PM jbdayton wrote: Amazing in my room four hours out from recovery. Feeling ok fingers feel swolen so ignore typos. No super soreness of course have pain pump but no pushes so far rn wants me to give me severall pushes before calling it a night Just dozed off so chat in thr morning good luck to all with tuesday sx and continued healing for us today",
      "MessageIndex": 203,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 30, 2013 10:18AM jbdayton wrote: I do have some discomfort but I surely expected that for several weeks while my body heals. I have lots of pressure but stopped the pain meds to see if pain is bearable. Hubby is making sure i take it easy until appointment next Wednesday. Hope Jo had an easy surgery today and everyone else is healing well.",
      "MessageIndex": 239,
      "PostDate": "30/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Sep 2, 2013 08:03AM jbdayton wrote: My husband helped me bathe and we wrapped my surgical area with Saran wrap and that kept that area dry and sponge bathed that area afterwards.  Washed my surgical bra and had him put it in the dryer while I bathed.  Getting clean really made a difference.  My PS preferred no shower until drains removed but encouraged sponge bathing.  Really very careful with keeping surgical area dry to prevent infection.  But being a holiday weekend makes it 10 days post surgury for first follow up appt.  Could not wait that long with just sponge bathing. ",
      "MessageIndex": 296,
      "PostDate": "02/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Sep 5, 2013 04:34PM jbdayton wrote: I saw the BS this morning.  Path report was amazing.  Near Pathological Complete Response.  Only 5 mm left of the original tumor but 1.2 cm of DCIS found near the margins of the original tumor area.  They did find an area in one lymph node that could have been a metastsis but if so the chemo got it.  The only thing left to discuss is radiation because one margin was only .2cm the original tumor was against the chest wall so this is not a real surprise.  The BS thinks the chance of anything being left after chemo is low so the RO may not suggest rads.  Oh well, I will wait for that appointment and make the decision then.  I am very pleased at the moment and will just relax until I have to cross that bridge. I am tired today so I will try to catch up with everyone tomorrow. Prayers and hugs to all.",
      "MessageIndex": 363,
      "PostDate": "05/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Sep 16, 2013 12:55PM jbdayton wrote: Great news poodle mum.  Keep the positive attitude and get through this recovery with minimal problems. Jacquie - hoping for low oncotype numbers and you can avoid chemo and move on. I saw my PS this morning and gave him the news that I had to stop fills to do 5 weeks of radiation.  He was real encouraging and said he would wait for me just do what I need to do.  Good day all.",
      "MessageIndex": 509,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Oct 11, 2013 05:40PM jbdayton wrote: Lisa Hurray!! so glad you got such a good report on the node. Now you can continue your treatments without the worries. I did have any nodes checked before my neo-adjuvant chemo. The SNB at time of surgery came back clear during surgery and the micro reports did show an area that could have been active but had a complete response with the chemo. KBeee I am glad # 2 went so well. I kept up with everything chemo related from each treatment including my blood test results, how much water I consumed, if I needed any additional meds, etc. to compare as well as weight, blood pressure and heart rate. I was lucky that each treatment was very similar in tests. I also logged when I felt the weakest and when I what I was able to eat. The only thing that seemed cumulative was each treatment I had longer tongue and taste bud issues. You can make a game of it with the goal to be just a little better or at least as good as that first treatment. It is also good if you need to take it to a MO appointment if things are progressing worse than you wanted. Wrenn still praying for you to heal nicely over the next couple weeks and get your treatments back on schedule. I am moving along I have done 3 of 25 rads and so far so good. Hope everyone has a good weekend.",
      "MessageIndex": 731,
      "PostDate": "11/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 27, 2013 08:21AM jbdayton wrote: Cynthia i am praying the rest of the procedure goes smoothely for you. Talk later going for my first walk.",
      "MessageIndex": 207,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Jul 24, 2013 03:21PM jbdayton wrote: I will be joining this group.  Do not have surgery scheduled but have my first BS consultation on August 2.  I did neo-adjuctive chemo (last treatment June 23) and yes I got to ring the bell.  Had new mammo and ultrasound last Thursday and very pleased with the results; no tumor visible.  Undecided on LX or UMX or BMX.  Mammo from January pre-treatment showed several groups of microcalcs in the good breast.  MO wants surgery completed within the month.  Original tumor was against the chest wall so probably will need rads so no reconstruction until later.  Good luck to everyone scheduled for surgery in the next week or two.  Pamelot good luck with getting all the approvals necessary.  It can be such a run around getting everything lined up in the correct order.  I ran into this with who was going to cover my chemo drugs.  Had to submitt prescription to my drug company and wait for denial, then with Aetna drug and wait for denial, then Aetna medical picked up all the injectible drugs.  We should not have to go through all this when we pay our premiums timely for good coverage.  I was real frustrated at the process.  I understand what you are going through.  Stay persistent and you will get the ok's you need and want. Prayers to all.    ",
      "MessageIndex": 23,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 22, 2013 09:16AM jbdayton wrote: Celtic so sorry to hear of your second diagnosis and the timing just couldn't be worse.  Many prayers for you. ",
      "MessageIndex": 151,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 24, 2013 09:31AM jbdayton wrote: Way to go Rosamond. One step closer to normal. Have a wonderful dinner with the family.",
      "MessageIndex": 174,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 27, 2013 01:10PM jbdayton wrote: Today is my day. Both surgeons have released me. Sentinel nodes all clear. No t needing much pain meds, sat up for breakfast and lunch, and walked the halls twice. I was so surprised surgery ended last night at 8pm. Hopefully everyone else can recover as quickly. My prayers are with all upcoming sx and of course blessing all those recovering.",
      "MessageIndex": 212,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 29, 2013 03:59PM jbdayton wrote: Jacquie, KBeee, babs, jenn hope everyone is getting stronger each day. Prayers with jo for sx tomorrow. You can do it. Hoping everyone else is improving as scheduled.",
      "MessageIndex": 231,
      "PostDate": "29/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 31, 2013 11:11AM jbdayton wrote: I am hoping to have my drains removed on wed appt. Both are down to about 10cc for 24 hrs. Lots of energy but have to stay fairly calm until next wed. Hubby is not going to let me do much. Hope everyone has a great holiday weekend.",
      "MessageIndex": 255,
      "PostDate": "31/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Oct 1, 2014 02:52PM jbdayton wrote: Sorry you are still having pain.  I would check with the PS and ask for some fat grafting.  I just had fat grafted this past Monday.  I am pleased with the looks so far.",
      "MessageIndex": 1170,
      "PostDate": "01/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Feb 25, 2015 11:42AM jbdayton wrote: Kbee you are in my prayers as well. I hope the results are what you want and recovery goes smoothly.",
      "MessageIndex": 1204,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Oct 24, 2013 01:57PM jbdayton wrote: Yea Jo, no chemo. I know that is a big relief for you. Good luck with your rads I am at the half way mark tomorrow and holding up good so far, just a little pink. Wrenn glad you are pursuing psych help. I would definitely be doing the same thing if I had all the delays and complications you have had. You are a strong person to have made it this far. I don't understand the chemo time frame I thought it was supposed to work systemically. Have they explained why? Lili so sorry you cannot find your scones, you were looking so forward to that. Hope you got to start your chemo. KBeee glad you are moving along. Poodle mum hope your incisions heal up quickly.",
      "MessageIndex": 793,
      "PostDate": "24/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Oct 24, 2013 07:07PM jbdayton wrote: Thank you for the explanation. I still cannot believe your surgeon did not get concerned over the blood in your drains for so long. I still pray for you to recover completely from your infections. Keep us posted. (((HUGS)))",
      "MessageIndex": 795,
      "PostDate": "24/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Sep 14, 2013 11:22AM jbdayton wrote: Wow, poodlemum, sorry for all the complications.  I had an infection at day 10 post-mast and the plastic surgeon immediately opened me back up scrapped out the infection reinstalled new drains and sewed me back up.  Luckily 6 day later he removed both drains and all appears to be ok. Yesterday I had an appointment with an RO to discuss possibility of rads.  One margin was apparently not clear and is against the chest wall and cannot be reoperated.  So 5 weeks of rads to start first week of October.  My chemo killed the tumor and I only had 5mm of the 3cm tumor left, but DCIS was found in the tumor bed.  Two areas of DCIS were found in the prop breast.  Glad I did not choose the lumpectomy.  My new diagnosis is ypT1a, pN0, mx.  So great final diagnosis. What I am most disappointed about is now instead of going for DIEP in November I will now have to wait for probably 9 months to pursue recon.  I guess that will mean living with these TE's for a long time.  The RO does not want them filled any more than they already are.  Onward we march. Lili - I am praying so hard for the drainage to continue its downward output and you can safely have those drains removed.  It's your turn to march onward. Wrenn - I don't know about your red drainage but both of mine the final 3 days were a yellowish/clear discharge.  I only had red drainage for a few hours following surgery.  Hang in there your BS I am sure is watching you. Babs - you sound great.  Keep gaining more strength.  To those starting chemo, keep a positive attitude, drink water, drink water, drink water.  If no one has told you drink water  Hopefully everyones blood counts come into line.  I had my chemo before surgery so I was very healthy when I started, so I cannot speak about handling chemo after the body has already been worn down.  But your MO will watch you closely and will not treat if you are not healthy enough to handle it.  Praying for very few side effects.  My hardest days were days 3-5 after treatments.  I felt good on day after.  So I chose Tuesdays for treatment and could rest all I wanted on Thurdsay  - Saturday.  Just thought I would throw out that tidbit.  Never had any nausea.  They have lots of meds to prevent that. Take them even if you don't feel like you need them.  Good luck and the chemo threads are really supportive I couldn't have made it through those first 4 months without them.  Hope everyone is having a great weekend.  I am cleaning out the camper we are going to the beach next weekend for a surfer reunion of friends from the 60's and 70's.  This will be the third year to do this.  Need this so bad.",
      "MessageIndex": 485,
      "PostDate": "14/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Nov 9, 2013 08:46PM jbdayton wrote: Poodle mum. I hope the cold disappears overnight so you can attend the function. Wrenn are you still on for chemo later this month? Hope your wounds are healing better now. To those still in treatment enjoy the rest of the weekend and have a good week.",
      "MessageIndex": 879,
      "PostDate": "09/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Sep 24, 2013 10:45AM jbdayton wrote: Wow miss a week on this board and everything changes.  Wrenn - I cannot believe you have a new problem.  I was so excited when the final tube came out.  Hopefully the new surgeon can repair the affected areas and get you healing properly.  At my first followup appt at 10 days out my PS found small pockets of infection and immediately opened me back up scaped out the infection, sewed me back up with new clean drains and 6 days later removed the drains and said I looked great.  For all starting chemo my prayers are with you.  I still remember vividly the feeling of dread.  I was lucky and had very few SE's that slowed me down.  I did TAC but all 3 meds at once on a 21 day cycle.  My final pathology was great with a near pathologically complete response.  Just a very small margin not declared clear.  My original tumor was against the chest wall with possible invasion so radiation is still needed. My best tips for A/C is drink water, drink water and when you feel you are floating drink more water.  I also found eating 6 small meals was better for me.  I did get the thrush each time.  It was nasty.  I used a miracle mouthwash my onc staff suggested.  1 part Maalox, 1 part liquid advil, 1 part liquid benedryll, and 10 drops lidocaine.  It was a wonderful soother.  This is different from mouth sores, that I did not have a problem with, I did suck on ice chips throughout my drip of Adriamycin and Taxotere.  I did and do still have some minor neuopathy in the finger tips and toes and did lose both of my big toe nails but they are growing back in and looking great now.  I did not ice my toes or fingers, good luck to those who choose to.  Some ladies from my group used bags of frozen peas.  Some had luck and some didn't.  I did have a bad case of bone pain wth my first Neulasta shot so the onc had me start taking the Claritin 2 days before chemo and 7 days after and it worked like a charm.  The Neulasta did wonders on my blood counts, never even pushed a bad level in any blood test.  I know you get tired of hearing chemo is doable but there is no better word to describe it.  Not fun but not as bad as I dreamed it would be.  Lots of walking even when you do not feel like it.  I know it may be harder for some of you because you have already been knocked down with surgery.  I was very healthy going into chemo since that was my first treatment. Welcome to the ladies joining recently.  I will read and get updated on everyone.  I plan to remain here on this group and will join the fall rads group and lurk on the chemo boards for Sept. and Oct. to see how things are progressing with each of you.   ",
      "MessageIndex": 608,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Oct 9, 2013 07:38AM jbdayton wrote: Wrenn and Jo I wish you peace and good thoughts while you continue to recover from your healing issues. I don't know what it would have done to my spirits with this kind of set back. That being said, please take care and get as refreshed as you can before starting. We are all pulling for you. KBeee your thoughts about not worrying about what COULD happen and deal with what DOES happen is a great way to approach this. I was prepared for many issues that could arise and then only had to deal with my bodies reactions. The onco team is so helpful when you do incur a problem let them know and they will have a solution or remedy to help. The onco nurses I dealt with were very knowledgeable. Lisa - thank you for your responses. I could not get my thrush to actually clear up. It is the white yucky stuff on the tongue. Your MO can best advise you. I used Nystatin for topical treatments and did not clear it up quickly but did ease the problem and prevented it from spreading to my throat. I remember seeing some said to use L-Glutamine but check with your onc team first. For pain relief I made the \"magic mouthwash\". It can be ordered through the pharmacy many different formulas are available or a version can be made at home. I told him I was already using home version so he prescribed some lydocaine that I could add for pain relief. I used 1 part Maalox (I used Walgreens Liquid Antacid), 1 part liquid benadryll, 1 part children's advil and 5 drops of lydocaine. Mix it all together and swish for several minutes and spit out. I only added the lydocaine when I needed it. It will numb your mouth and throat. You might check if a prescription would be more cost effective if you have good drug insurance. It would have been cheaper for me but I had already bought the products. The standard baking soda and salt water mix is 1/4 tsp baking soda, 1/8 tsp salt and 1 cup warm water. Swish several times a day especially following a meal. I actually did this about 6 times a day. As far as radiation mapping in layman terms; it is where they draw lines on your chest to line up the placement of the lasers and I received 3 pin dot tattoos. Next they did a scan that went for review to the rad team. Yesterday I went back in for a simulation run, a run with lasers but no radiation and x-rays were taken to verify the proper areas were to receive the actual radiation. I will go live for my first treatment today. As always my prayers are with everyone.",
      "MessageIndex": 705,
      "PostDate": "09/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 28, 2014 08:32AM jbdayton wrote: it has been a wild year.   I did radiation during October and November.  I lost my mother 2 days before finishing radiation.  Had a gastric flair up Thanksgiving and was given meds to resolve those issues.  Husband said he thought it was gallbladder but doctors said no.  In March I did a bilateral DIEP reconstruction.  Woke up with only one breast reconstructed, luckily the radiated one. Had some minor healing issues with my belly incision and a small area on the breast. In June I did a Ruben's flap for my other breast.  Had major complications, lower incision opened back up after the staples were removed.  Had to do wet/dry packing for 8 weeks then decided to hook up a wound vac to assist in healing, had that for 3 weeks.  Got the pump off off on Friday then on Sunday started having bad gastric pains.  Took all the gastric meds I got at thanksgiving.  By Friday not getting better, so I went to my GP and he had tests run and said gallbladder was ripe and I needed to go get checked in to the hospital and get it removed immediately.  That was August 17. I have a followup appointment this afternoon with the surgeon.  Too many surgeries this year.  I think I am just going to heal and maybe start finishing revisions next year.  I did not anticipate all these hick ups.  Oh well, could have been worse.   Hope everyone else is moving along nicely. Hard to believe it was a year ago we were all going through our mastectomies.",
      "MessageIndex": 1159,
      "PostDate": "28/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Apr 4, 2015 06:42AM jbdayton wrote: Karen, I hope today finds you still doing good. You are a real trooper and I know you will get through this. Praying for a complete response this time around. Have a great Easter everyone. ",
      "MessageIndex": 1233,
      "PostDate": "04/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Apr 4, 2015 06:31AM jbdayton wrote: Babs prayers for the Ibrance/Letrozole combo doing its job.",
      "MessageIndex": 1232,
      "PostDate": "04/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Apr 3, 2014 03:05PM jbdayton wrote: I started chemo one month after my first visit with my MO.  The only test I had to do was an echo to check my heart since I was going to have adriamycin.   I actually went on a 4 day cruise that the docs approved.   As it turned out our 4 day cruise turned into an eight day cruise.  We were on the carnival triumph that had the engine room fire and we were stranded in the Gulf of Mexico for a few extra days while they towed us into Mobile, AL. I see a relaxing few days for you in your near future.  ",
      "MessageIndex": 1,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819828",
      "Title": "Steps prior to chemo Footballnut jbdayton"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Nov 23, 2015 04:17AM jbdayton wrote: I am one who had a BMX with DCIS remaining in the original tumor bed afterwards. This was a complete surprise it was never detected. I did chemo prior to surgery to shrink my original tumor. This was deep against the chest wall. I did 5 weeks of rads for this with my tissue expanders. Was able to do a tissue flap reconstruction 4 months later. The radiated breast is much firmer than the prop side. Good luck. Better to get it all removed if possible. I could not get mine removed so am counting on rads to have killed the rest of it.",
      "MessageIndex": 11,
      "PostDate": "23/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/836854",
      "Title": "Positive margins after bilateral mastectomy Jblmom Jblmom"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Feb 3, 2016 12:19PM jbdayton wrote: Not exactly the same scenario but I did chemo pre-surgery and had a skin sparing bilateral mastectomy with tissue expanders under the muscle, then radiation, then delayed DIEP. One suggestion make sure you discuss sewing the muscle back in its original place and put the tissue flap on top of the muscle like it would have been with immediate reconstruction. Mine had to be revised in a third revision surgery and took me three more revisions to get a result I was happy with. I don't want to scare you but I was the 1% that had a failed flap and other complications. I feel everyone needs to know the good and the bad. Would I do it again? You betcha.This seems to be a fairly common method to do delayed especially if they think you might require additional treatments. You have to go with your gut. I decided to do delayed even not knowing if I would need radiation. It was just a small chance going into surgery but my tumor was deep near the chest wall and after surgery they found DCIS in the tumor bed so we made the right decision because radiation was needed after all. Good luck as you go through this difficult period of decision making. I hope my comments possibly helped.",
      "MessageIndex": 5,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/840947",
      "Title": "Getting more scared by the minute StaceySue2U StaceySue2U"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Nov 21, 2013 08:23PM jbdayton wrote: I have the same reaction and my BMX was done the end of August. I guess this is a new normal. I am getting somewhat used to it. When was your surgery? Hopefully this gets better with time. If not, we will learn to live with it. Does anyone know if this will be a problem long term? ((((HUGS))))",
      "MessageIndex": 1,
      "PostDate": "21/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/814846",
      "Title": "Hot or Cold drinks and food, feel in chest on masectomy side vaper LindaKR"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Feb 18, 2014 12:00PM jbdayton wrote: yeah ceharman for benign results Geekyknitter I am praying for benign results for you as well.  What day do you expect the results?  Keep busy and stay as calm as possible. ((((Hugs))))",
      "MessageIndex": 18,
      "PostDate": "18/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817937",
      "Title": "should \"Jagged edges\" frighten me? ceharman ceharman"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Jun 2, 2016 03:27AM jbdayton wrote: Another note, you may be assigned an oncologist even if you don't have to have chemo. The oncologist many times is the doctor who will prescribe and monitor your Tamoxifen Or AI drugs. Just go with an open mind to this appointment. Good luck. Sending positive thoughts",
      "MessageIndex": 24,
      "PostDate": "02/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/842495",
      "Title": "\"Lymphovascular invasion is not identified\" Hester32 HelenWNZ"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Jun 5, 2014 05:17PM jbdayton wrote: My onc requested my 35 year old daughter have a mammo and come see him for a physical exam and start her on tamoxifen as a preventative treatment.  And he has requested my other daughter she 29 come next year.",
      "MessageIndex": 3,
      "PostDate": "05/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821707",
      "Title": "wait 6 months for another mammogram? andimd Mouche"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 8, 2013 05:39PM jbdayton wrote: Art - sorry you are here having to ask the hard questions.  Thank you for being so supportive of your new wife.  This will be an unbreakable bond for the rest of your lives. I did chemo first for a Grade 3 - 3 cm tumor against the chest wall (had other groups of calcifications not biopsied).  I did 6 treatments 3 weeks apart and after treatment #2 the tumor had shrunk by at least 50%.  A good response, so I knew the chemo was working.  The scans after completing chemo shows no visible tumor.  I will be having surgery Aug 26 and then I can get my final path report. I am very grateful we did chemo first.  It is scary having to make these decisions. Best of luck and praying for a great response from chemo.",
      "MessageIndex": 1,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/809078",
      "Title": "Fiancée diagnosed IDC 3 weeks before wedding Art123 jbdayton"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Mar 25, 2014 07:50AM jbdayton wrote: Minus two. I grew back the facial fuzz after chemo.  It took about 2 months and it all disappeared without doing anything to it.  Just my observation.",
      "MessageIndex": 20191,
      "PostDate": "25/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Dec 18, 2013 12:26PM jbdayton wrote: this was an issue that really bothered me.  I had the facial hairs also.  I left them alone and now 6months post chemo almost all is gone and face feels smooth again.  Hopefully you will have the same results.  The last thing I would do right now is shave.  My MO said it is best to be patient and let nature take its course before doing anything drastic. Good luck.",
      "MessageIndex": 19758,
      "PostDate": "18/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "May 17, 2014 01:26AM - edited May 17, 2014 01:30AM by jbdayton Here are my hair pics from Dec to May.  My last chemo was June 23, 2013. I have had 3 trims.  It is still very curly and course.  Thinking of trying a relaxer.  If you stretch it out, it measures just short of 4 inches. The first picture is hair cutting day; 13 days post Chemo#1.  I had already cut off about 10 inches.   March 26 2013     Dec 19 2013  (Week 25)     Feb 10, 2014  (Week 32)  Mar 13 2014 (Week 36)  April 18 2014 (Week 40)   May 16 2014  (Week 44)   ",
      "MessageIndex": 20302,
      "PostDate": "17/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Apr 18, 2014 01:23PM jbdayton wrote: My onc wants both my daughters to take 10 years of tamoxifen starting at age 35 due to my cancer and my mother and a few other relatives.   Preventative treatment even though braca negative.",
      "MessageIndex": 5,
      "PostDate": "18/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820303",
      "Title": "Biopsy results kk12903 Holeinone"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 19, 2013 11:35PM jbdayton wrote: I am ordering a product called Ovation. I heard about it on the radio several years ago. Bought some for my MIL for thinning hair from thyroid issues. It worked for her when nothing else did. It is a three step process. Look at ovation.com. Pricey but I am going to give it a try. I am 9 weeks post chemo and the soft fuzz is starting to grow in.",
      "MessageIndex": 19463,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Jun 24, 2014 09:28PM jbdayton wrote: I just realized today is one year from my last chemo.  My hair is now about 5 to 6 inches.  Thick course gray and dark brown.  I have no style yet, still curly and wavy, and of course unruly.  I cut it twice but not since January.  I guess next week I will make appt. to cut and maybe color.   I lost my two big toenails about 2 months post chemo.  They are almost completely grown back in.  Maybe by next month this time. I also had the facial fuzz and it went away on its own about 2 months after I first noticed it. Good luck to everyone trying to grow our hair and nails.",
      "MessageIndex": 20495,
      "PostDate": "24/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Aug 29, 2013 02:39AM jbdayton wrote: Congrats on yhe wedding. So glad the scans are looking positive. Now take a deep breath and begin the killing of the cancer. I just had my surgery on monday and am in the healing process. Just an encouragement chemo before surgery for me eas the correct path. No obvious cancer cells were found in either breast and the lymph nodes were clear. Hope it works the same for your wife.",
      "MessageIndex": 12,
      "PostDate": "29/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/809078",
      "Title": "Fiancée diagnosed IDC 3 weeks before wedding Art123 jbdayton"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Apr 29, 2014 01:52AM jbdayton wrote: I heard maybe the CMF cocktail.  If you go to their forum many said their hair just thinned out.",
      "MessageIndex": 20254,
      "PostDate": "29/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Nov 3, 2013 07:47PM jbdayton wrote: I am so sorry to hear this possible diagnosis of ALS. I pray this is not so. I had 2 brothers who both had ALS in their twenties. when my brothers were diagnosed there was no test to confirm the disease. The Muscular Dystrophy Association was so helpful with supplies and support for my brothers. When I was first diagnosed I researched the genes for breast cancer and ALS and there were no duplicating genes. I will definitely keep your mom and your family in my prayers. Many hugs.",
      "MessageIndex": 7,
      "PostDate": "03/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/813953",
      "Title": "Severe slurred speach, limp foot, and swallowing trouble ChattyChatty Momine"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Jul 25, 2013 07:58AM jbdayton wrote: Tracy so sorry you are having to make this decision.  I know you will make the one that you are most comfortable with.  You will be in my prayers.  I am having to make a similar decision but do not meet with the BS until Aug 2.",
      "MessageIndex": 6,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/808100",
      "Title": "Really? Breast Cancer? Tracy516 Peachygirl"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Feb 6, 2016 10:42PM jbdayton wrote: The blue dye will color any sentinel node whether positive or negative. The dye just colors the first nodes the fluid flows through . This allows the surgeon to only remove the blue nodes to minimize the number of nodes needed to be checked. If any of the removed nodes are negative then no more nodes need to be checked. I pray you get great results",
      "MessageIndex": 1,
      "PostDate": "06/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/841081",
      "Title": "Question about sentinel node biopsy and which ones turn blue seattlemamabear seattlemamabear"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Mar 6, 2014 07:32AM jbdayton wrote: Terri hang in their I did this same routine.  I started chemo last March did mastectomy in August rads during October and November  am having stage 1DIEP reconstruction this Monday.  You can do it also.  It has been a full year of treatments but apparently successful,as far as getting to NED now to stay that way. Good luck and keep the faith.  Praying for a complete response to chemo for you.  Then follow the rest of the protocol and you can join the NED crowd.   ((((HUGS))))",
      "MessageIndex": 41,
      "PostDate": "06/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818226",
      "Title": "Terrified!!! :'( Terri001 jbdayton"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Dec 4, 2014 07:18PM jbdayton wrote: The flap surgeries are very doable. It can result in several surgeries if you have complications. I know some who did the flap in one surgery and very little tweaking and nipples in a second surgery. Flaps are great for feeling warm and looking like real breasts as far as they bounce with you and age with you as well. I just wanted you to know anything is possible. If you encounter complications, you can still get the same final results but it may take a little longer and a few more procedures. I definitely did not want to scare anyone away. The majority of people have one flap surgery and one or two revisions only. I don't know if there will be time to squeeze in the nipples this year. I saw my hand doctor yesterday and he said I could not put off my carpel tunnel surgery any longer. I will do my right hand on Dec 19 and my left hand on Dec 29. The hands hurt horribly at night so the relief will be welcome. ",
      "MessageIndex": 94,
      "PostDate": "04/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Dec 5, 2014 12:57PM jbdayton wrote: Oh Sandra that is great news. I am so excited for you. This has been a long and winding road. I should be having my last revision on Monday and you the following week on Friday. I will keep you in my prayers. I will be doing carpel tunnel surgery on the 19th. My PS is still hoping to do nipples between Christmas and New Year if everything works perfect. But he does not know about my two hand surgeries that have been inserted into this month. The hands are hurting all the time now splints or no splints so, I can't put the hands off. My hand surgeon is off the month of January. Either way, we are both getting our final revisions in 2014!!! Congratulations on a date I know how happy you are. Never give up faith.",
      "MessageIndex": 97,
      "PostDate": "05/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Dec 8, 2014 08:04PM jbdayton wrote: Thanks for the prayers. It appears everything went well. I am at home in my recliner. No real pain as of now. ,hubby is fixing me some soup. I am in lots of compression this time. Knees to upper chest. Another surgery after our healing issues is a challenge mentally. I am thinking positive thoughts, after my gallbladder got removed my September Phase 2 went without a hitch. Incisions healed beautifully, my gallbladder was harboring a ton of infection my systems was trying to fix. Love and hugs to all, will follow with details later.",
      "MessageIndex": 121,
      "PostDate": "08/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Dec 22, 2014 05:06PM jbdayton wrote: chloesmom and Bippy so glad you both are riding high on good news. What a wonderful Christmas gift. Hoping everyone else with appointments this week gets good news also. Scottiemom hope your fill goes with minimal pain. ",
      "MessageIndex": 253,
      "PostDate": "22/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Dec 19, 2014 03:43PM jbdayton wrote: This is becoming a common problem. I had an emergency gallbladder surgery in August at an in network hospital. The anesthesiologist was out of network. I received his bill with a note to send it to my insurance company stating it was not fair to have to charge the patient the difference since they could not choose the anesthesiologist. I do not know if it has been resolved yet. I am letting them fight it out first. Tomorrow I am having a carpal tunnel surgery and I was told to call the anesthesiologist (I was actually given his cell phone, the doctor himself answered and talked to me). I asked if my insurance is in network. Of course, he isn't. He said he would work with insurance and I would probably have to talk to insurance as well, to get the bill paid. He said they have to do this all the time because they are doing services at the hospital and the hospital is in my network and my surgeon is in network. Insurance is being greedy with what they are paying them. Sounds like the anesthesiologists are banding together and none are joining the networks. I see a power struggle starting. Hopefully, this will resolve itself without many patients taking the hit. I hate paying big premiums and then having to fight for payment of doctors for their services. Good luck getting your bills covered. Be persistent it may take awhile. ",
      "MessageIndex": 4,
      "PostDate": "19/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/827055",
      "Title": "Anesthesiology and insurance network MeToo14 Kicks"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Jun 12, 2014 12:22AM jbdayton wrote: I am going to jump in here with another angle.  Sometimes chemo first allows you to do lumpectomy and rads instead of mastectomy.   I had a rather large 2.5cm ER &PR+ HER2- grade 3.  My oncologist used MDAnderson's standard of care to do neo-adjuvant chemo actually a 2nd generation of TAC*6 3 week intervals.  The goal was to shrink the tumor and do a lumpectomy instead of mastectomy.   I did have a complete response to the chemo but ended up with DCIS so ended up having to do mastectomy instead. I trust MDA; my doctors are previous MDA doctors with great reputations and I have been more than pleased.",
      "MessageIndex": 8,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/821821",
      "Title": "Confused as why everyone seems to have surgery first eva9310 april25"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Jul 16, 2017 11:52PM jbdayton wrote: I had severe mouth issues starting with cycle one. I chewed ice chips throughout my treatment and still reacted with sores and thrush. My MO had me make a magic mouthwash with 1 part Maalox (Walgreens equivalent), 1 part children's Advil and 1 part children's Benedryll. He also prescribed a small vial of lidocane so that I could add a couple of drops to the mixture for really painful days. I could not have made it through the mouth problems without this help.",
      "MessageIndex": 11,
      "PostDate": "16/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/857010",
      "Title": "Majic Mouthwash, probability of necesity? sweetp6217 SpecialK"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Apr 11, 2015 09:14AM jbdayton wrote: My tumor was a grade 3 and my ki67 was 60. My BS said even with those stats it takes a while to grow. I did chemo first because chemo works really well on fast growing cells. I started chemo 6 weeks after diagnosis. This of course was a suggestion from the tumor board. After the first treatment I could feel the tumor shrinking, this gave me the will to continue on with a smile on my face. I did end up with a near complete pathological response. Original tumor about 2.5 cm after chemo 5mm. One node came back showing possibly a micro met that was destroyed by the chemo. The reason for this is to reassure you to take your time and get all the options to make a good decision. I was just like you I told her I wanted them cut off ASAP and she said not until I could see what the tumor board recommended. I took a week cruise and then came back refreshed and moved forward with the tumor boards recommendations. Relax as much as possible and proceed after hearing them out. I will pray for your strength to get through this.",
      "MessageIndex": 17,
      "PostDate": "11/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/830270",
      "Title": "Just Diagnosed DizzParkMom happynewyorker"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "May 7, 2013 01:07AM jbdayton wrote: I had a marker placed at the time of biopsy and am doing neo-adjuvant chemo.  The anticipation is that the chemo will reduce or possibly dissolve the tumor.  The surgeon will use the marker to find the location to cut out the dead cells. ",
      "MessageIndex": 8,
      "PostDate": "07/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/804227",
      "Title": "Gel marker implanted in tumor? Dayna478 jbdayton"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Jul 13, 2013 12:57AM jbdayton wrote: A note on Claritin.  My onc told me to take Claritin day of and for 5 days after.  I still had severe bone pain.  Beginning treatment 3 he had me start 2 days earlier and surprise no bone pain just minor joint pain.  I think the Claritin worked for me. Good luck to everyone in treatment and minimal SE's.  Hugs to everyone, you can get through it. Luckily, I finished chemo the last week of June.  Now on to further testing, surgery and possible rads.   ",
      "MessageIndex": 270,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Apr 10, 2015 05:27PM jbdayton wrote: As far as Claritin. I took It the day before and three days after on treatment #1 and I had horrible bone pain. MO had me take 2 days before and a week after for the future cycles and I did great. I did the ice and so glad I did, I still had mouth problems (thrush and very raw tongue) but I can't imagine how bad it would have been without it. My MO told me to get magic mouthwash to ease the mouth pain. I know you will get through chemo. Remember the MO does not want you to suffer. If anything feels wrong be sure to call the after hours number. Do not be shy or feel like you are burdening them. I got my hand slapped for not complaining and suffering through a few side effects (the mouth issues above) they could have helped with. I was told this is their job to help you get through treatment as comfortable as possible. Keep us updated and go kill those cancer cells. ",
      "MessageIndex": 64,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/830231",
      "Title": "Chemo scares me more than the disease AnewBeginning lcm123"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Dec 18, 2014 10:28PM jbdayton wrote: oh Sandra, I will keep you and your hubby in my prayers. I have been with you on most of your journey and will remain so. I may not be able to respond for a few days, I am having carpal tunnel surgery in the morning. I should be able to read and keep up though. Off to bed. Great healing.",
      "MessageIndex": 209,
      "PostDate": "18/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Dec 21, 2014 04:40PM jbdayton wrote: Bippy, you continue to keep your selfishness. It is your job to stay focused on you right now. This will speed up your healing then you can pay back to others later. Happy healing.",
      "MessageIndex": 244,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Feb 6, 2017 01:21PM jbdayton wrote: Many prayers for everyone going through surgeries in the next few weeks. Not to worry anyone but I want people to know things can go wrong even with a great surgeon. My surgeon has performed over 2000 flap surgeries with a 1 % complication rate. Things can be fixed but take time and may not be perfect but livable. I am scheduled for February 20th in San Antonio for a final revision surgery. I will be using a doctor at PRMA. My original flaps were performed in Houston. This will be my 6th revision following a flap surgery with complications. This time we will be adding some fat volume to the upper chest area to hide the animation I have from my flap being put under my pec muscle (not usual but that is what I got). I also lost my fold under the second flap breast so it is about 2 inches lower than it should be. They will try to move it up but only about a 50% chance of success. They are also going to remove fat from the side under the armpit on that side as well. I am about 2 inches wider on this flap than my other side. Finally I am going to have my abdominal incision modified and fix a hernia or weak muscle as well. This will be my last surgery. I already had nipples reconstructed and tattooed last year. I went to the gym and worked with a professional to strengthen my abs and the conclusion is my abs are great it is the connecting muscles that we could not rebuild. I can no longer do sit ups, or roll over in bed without lifting my side off the mattress, or squat and get up without getting on all fours. My abdomen is as hard as a rock and I look 4 months pregnant most of the day. I decided to try one more fix for comfort. Hoping they find what is causing this while fixing my abdomen.",
      "MessageIndex": 30,
      "PostDate": "06/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Dec 3, 2014 12:53AM jbdayton wrote: Wow lots of mastectomies this month. I hope everyone gets through their surgery and recovery without complications. For those doing exchanges, I hope your surgeries go great and your results are fabulous. Dec 8, I will be having a second revision to both breasts with fat grafting and my left hip excised for symmetry. I had left breast by DIEP in March and a Ruben's flap (hip) for righty in June. Hopefully this will be the final revision. If not, a small revision can still be done when my nipples are made. If all heals well, my PS is going to try to squeeze nipples in the last week of the year (Merry Christmas and a Happy New Year). That would be great; in the summer I can get my tattoos and put this behind me. HUGS to all.   ",
      "MessageIndex": 87,
      "PostDate": "03/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Dec 20, 2014 01:41AM jbdayton wrote: Sandra, I am thinking of you and your husband. I pray both of you are making positive steps forward. You deserve an uneventful recovery. Hope your daughter gets there soon she will really lift both your spirits.",
      "MessageIndex": 227,
      "PostDate": "20/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Feb 14, 2017 04:37AM jbdayton wrote: I only had my sentinel nodes removed during my mastectomy. I had the EMG done on both wrists. Then I did Carpal Tunnel surgery on both arms 4 months after my reconstruction surgery. I did my non affected arm first and I had the IV in the foot. No more pain than a regular IV. I don't remember having a blood pressure cuff if I did it must have been on my leg also. 3 weeks later Idid my cancer side with an IV in my hand on the non affected side. It's now been over 3 years and all is well. ",
      "MessageIndex": 13,
      "PostDate": "14/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/852700",
      "Title": "Lymphedma and EMG test and carpal tunnel surgery question Tyge48 Tyge48"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Feb 26, 2014 06:03PM jbdayton wrote: Congrats on completing the test.  I know that is a big relief for you.  No more practice required:)",
      "MessageIndex": 13,
      "PostDate": "26/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/818459",
      "Title": "1st Meltdown BellasKids AZ85048"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Dec 8, 2014 10:18AM jbdayton wrote: I am on my way to the hospital for revision #2. Praying this will be last one before nipples. Blessings to everyone else still recovering and those preparing for surgery. I will update when possible.",
      "MessageIndex": 115,
      "PostDate": "08/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Jan 16, 2015 04:56AM jbdayton wrote: Oh Sandra, I am so sorry for the devastating news for your husband. Hopefully, a donor can be found. I will add him to my prayer list and you as well.",
      "MessageIndex": 435,
      "PostDate": "16/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Apr 19, 2014 03:54PM jbdayton wrote: Congrats on the benign results.",
      "MessageIndex": 5,
      "PostDate": "19/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820228",
      "Title": "biopsy Thursday JFT54 Stenokim"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Dec 20, 2014 01:37AM jbdayton wrote: I was surprised how many muscles it took to push a shopping cart. I thought I was using it like a walker. I quickly realized that wasn't the case. If someone can go with you I would suggest that. Just walk for the exercise. I had a hard time doing so little also, I made myself take it easy and my recovery progressed just as fast with less pain and exhaustion. Good luck ladies.",
      "MessageIndex": 226,
      "PostDate": "20/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Jun 7, 2014 09:54PM jbdayton wrote: You might start by contacting your insurance carrier and ask for your claims or EOB's and they should contain the doctor and procedure as well as lab etc.  Hopefully you had the same carrier all this time. The two doctors that get all my. Reports are my primary care doc and my MO.  That may help narrow down some of the research. Good luck.",
      "MessageIndex": 1,
      "PostDate": "07/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/821763",
      "Title": "Need help gathering medical records for the past five years auroaya auroaya"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Mar 26, 2013 01:21AM jbdayton wrote: I am currently taking emend with each round.  The retail amount is $301.69 at my specialty drug pharmacy. Walgreens quoted $465.  Luckily I have insurance (by mail order) it is only costing me $38.",
      "MessageIndex": 15,
      "PostDate": "26/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802278",
      "Title": "Anti Nausea Drug \"Emend\" Helpts to Halt Brain Tumor Growth Bestbird Rosevalley"
    },
    {
      "AuthorID": "jbdayton",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171920/profile",
      "Content": "Oct 28, 2013 06:23PM jbdayton wrote: I remember reading about this, in reference to your no insurance the BCCCP (breast cancer cervical cancer program) through the health department apparently only works if you get signed up before an official diagnosis. Please double check so if this is so you will not lose that opportunity to have your testing and any necessary treatments covered. Let us know what you find out. This could help many others as well.",
      "MessageIndex": 7,
      "PostDate": "28/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813632",
      "Title": "Needing some advice... hlm1987 hlm1987"
    }
  ]
}