{
  "AuthorID": "jburke1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87657/profile",
  "Posts": [
    {
      "AuthorID": "jburke1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87657/profile",
      "Content": "Aug 21, 2009 01:29PM jburke1 wrote: I didn't have a guide wire for my biopsy, but I did have one for my lumpectomy. I had to sit with it sticking out of my chest for about an hour and a half. It was covered with Dixie cups that were lossly taped to my chest. It wasn't that bad, a little uncomfortable, but tolerable. They give you a local, so you shouldn't feel much, and if you do let them know and they will give you more! Hope this helps! Stay positive, and stay strong! Jen",
      "MessageIndex": 1,
      "PostDate": "21/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/739298",
      "Title": "does the wire hurt in an excisional biopsy?? debnyc JCinAZ"
    },
    {
      "AuthorID": "jburke1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87657/profile",
      "Content": "Mar 18, 2010 01:15PM jburke1 wrote: Amen Binney! You said it all :)",
      "MessageIndex": 39,
      "PostDate": "18/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747129",
      "Title": "Feeling a little Depressed...Mild Le. lexislove Suzybelle"
    },
    {
      "AuthorID": "jburke1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87657/profile",
      "Content": "Mar 18, 2010 09:39AM jburke1 wrote: I have been dealing with lymphedema for the past month and a half now. It started in my arm, pretty painful, my arm was about 2cm bigger than my other arm. Went to a PT 3 times a week for 4 weeks. Went thru maual drainage massages and bandaging. During therapy we noticed the swelling moving downward into my hand. We unwrapped the arm and then just wrapped the hand. My arm is much better, but now my hand is very swollen and tender. It responded well to being wrapped, but I can't keep it wrapped all the time. The compression garments I have purchased are not the right amount of compression and I almost can't wear them. I probably need to get a custom garment, but I cannot afford it, as insurance doesn't pay for any of the garments associated with LE. I I am very physically and emotionally tired and drained from this. It is a constant reminder of what I have been thru. Just when I felt good and was moving on with life, I got this. I feel like it is such a set back. I am wondering if any of you have asked your breast surgeons why they opted for a axillary node dissection instead of a sentinal node biopsy? I had no positive nodes, but had 9 removed. Does anyone know how they determine that? I am curious and want to ask my BS, but I am kind of scared to, and it won't make a difference anyway. I have the LE and will always have it. Any thoughts? Jen ",
      "MessageIndex": 36,
      "PostDate": "18/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747129",
      "Title": "Feeling a little Depressed...Mild Le. lexislove Suzybelle"
    },
    {
      "AuthorID": "jburke1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87657/profile",
      "Content": "Dec 9, 2009 02:05PM jburke1 wrote: 35 DX with stage I, just finished rads in November, no chemo. Started Tamox 3 weeks ago.",
      "MessageIndex": 345,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "jburke1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87657/profile",
      "Content": "Aug 15, 2009 03:14PM jburke1 wrote: Hey ladies, haven't heard from either of you in a long while. How are things going for you?",
      "MessageIndex": 6,
      "PostDate": "15/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/738629",
      "Title": "35 and dx with bc jburke1 jburke1"
    },
    {
      "AuthorID": "jburke1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87657/profile",
      "Content": "Aug 8, 2009 10:59PM jburke1 wrote: Thank you both for your words of widsom and encouragement. I am all over the chocolate cake for a speedy recovery! That is totally my style. I will find out more on Monday when I go back to the surgeon for the path results. I will post more then. Wishing you all peace Jen",
      "MessageIndex": 3,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/738629",
      "Title": "35 and dx with bc jburke1 jburke1"
    },
    {
      "AuthorID": "jburke1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87657/profile",
      "Content": "Aug 11, 2009 02:53PM jburke1 wrote: Hello, went to doctor yesterday and got the full report. Stage 1, 1.2 cm, HER2 neg and est. and prog. positive. He kept saying it was all good news. I know it could be a whole lot worse so I am thankful for that. From what I have seen on here so far I almost feel guilty for getting such a relatively good report. I go to see the onc today to talk about radiation and whatever else he may want me to go through. all things considered I am feeling good, but I still can't believe this is happening to me and it is all happening so fast. Hope all is well with you Jen",
      "MessageIndex": 5,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/738629",
      "Title": "35 and dx with bc jburke1 jburke1"
    },
    {
      "AuthorID": "jburke1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87657/profile",
      "Content": "jburke1 wrote: I just got my dx on 7/31/09. IDC grade 1 on the left side. Within a week I have already had lumectomy with sentinal node dissection. I am home and recovering from surgery and still waiting for full path reports from surgery. I am really scared and confused. Not sure how to talk to people anymore without this being the topic of every conversation. My kids took it well, they are 9 and 13 both boys. My husband has been amazing, and I am learning that I have a lot of amazing people in my life. Not sure what is next. Dx 7/31/2009, IDC, 1cm, Stage I, Grade 1, 0/9 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/738629",
      "Title": "35 and dx with bc jburke1 jburke1"
    },
    {
      "AuthorID": "jburke1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87657/profile",
      "Content": "Aug 9, 2009 04:27PM jburke1 wrote: Good Sunday Morning Tami and Virginia! Hope you both are doing well today. I am feeling better than yesterday. My underarm where the nodes were taken out is still really sore and sesitive. Also, I have numbness in my upper arm from surgery, did either of you have that as well? Ironically enough where they took the lump out is not all that sore, just feel some pressure sometimes. Taking a shower is a bit of a chore though! Hope you both are doing well today, take care Jen",
      "MessageIndex": 4,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/738629",
      "Title": "35 and dx with bc jburke1 jburke1"
    },
    {
      "AuthorID": "jburke1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87657/profile",
      "Content": "Aug 13, 2009 08:53PM jburke1 wrote: Gonnabstrong- I love your name! And you will be! I just found out I had bc about 2 weeks ago, I have already had surgery and I am about to have a 2nd one on Monday. One day at a time is all you can do at this point. It is very overwhelming and hard to process. You will get through this and you will be stronger for it! You seem to have a good attitude so far and it also sounds like you have good friends and family. That will make all the difference for you in dealing with this. Take care and God bless Jen",
      "MessageIndex": 8,
      "PostDate": "13/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/738904",
      "Title": "Just found out gonnabstrong cheranthia"
    }
  ]
}