{
  "AuthorID": "jc254",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
  "Posts": [
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Dec 11, 2015 02:49PM - edited Dec 11, 2015 02:55PM by jc254 Keeping hair is very important to a lot of women. It was to me for a lot of reasons and I make no apologies for it. Notdoneyet was a bit harsh in her judgement. I was able to keep my hair using Penguin Cold Caps and it made the whole treatment ordeal a little bit easier. I am very happy I used them. It's unfortunately common to get push back from some medical professionals who don't know a lot about cold caps and have outdated beliefs about their safety and effectiveness. There is one type of cold cap that was just recently (this week) approved by the FDA. It's time to slow things down and get a second opinion so you can make informed decisions about your treatment, fertility issues and cold caps. Liloefer, please join us on the cold cap thread. You'll find lots of advice, tips and pictures from a great group of supportive women.",
      "MessageIndex": 6,
      "PostDate": "11/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/838355",
      "Title": "Becoming disheartened by Oncologist Liloefer"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Dec 11, 2015 05:59PM jc254 wrote: Lilo, if you give us an idea where you live, I'm sure you'll get some recommendations for a second opinion doc in your area.",
      "MessageIndex": 14,
      "PostDate": "11/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/838355",
      "Title": "Becoming disheartened by Oncologist Liloefer"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jun 29, 2014 05:18PM - edited Jun 29, 2014 05:18PM by jc254 Summer, your hair looks really pretty.  I love the color.  Warrior, did you do anything to your hair yet?",
      "MessageIndex": 56,
      "PostDate": "29/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jan 24, 2015 02:21AM - edited Jan 24, 2015 02:26AM by jc254 Raindew, I feel the same way about cold caps- not having to wait for my hair to grow back was worth all the aggravation. It allows you to get back to \"normal\" that much more quickly. Waiting months/years for hair to grow back must be excruciating. That's why I always try to suggest that women think long term when considering cold caps. I've been finished chemo for about 1 1/2 years now and I still really appreciate being able to wash my hair with hot water.in the shower. Life's little luxuries...",
      "MessageIndex": 158,
      "PostDate": "24/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jan 4, 2015 11:24PM jc254 wrote: Barremom, you look great.  Your hair cut is really cute-  definitely looks intentional rather than chemo related.  I think it's great that you've stuck around supporting other cappers even though your cold cap experience wasn't the best.  Hockeycat, go play hockey.  Let's all enjoy 2015 and put this cancer crap behind us.  You ladies are the best- what is it about cold cappers that makes this group so warm and encouraging?",
      "MessageIndex": 91,
      "PostDate": "04/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jan 21, 2015 12:57PM jc254 wrote: Ten hairs sounds pretty normal to me. My hair did completely stop shedding for a few months (no hair fell out at all) but I don't know if that's typical. Your haircut looks really cute- congratulations- you're done!",
      "MessageIndex": 143,
      "PostDate": "21/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "May 13, 2015 02:12AM jc254 wrote: My hairdresser used professional demipermanent color by Framesi from their Eclectic line. She did a lot of research to figure out what she considered to be the safest product. She did not use heat after applying the color. We just left it on longer. It covered the grey really well and I was thrilled with the results.",
      "MessageIndex": 329,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Sep 1, 2015 03:38PM jc254 wrote: I laughed at \"hair I never knew I lost sprouting everywhere\". Same thing for me. In my case, shedding was so gradual that I didn't really notice how thin my hair had gotten particularly around my hairline until I had a whole layer of short little baby hairs framing my face. It looked silly for a while. pch, you look terrific!",
      "MessageIndex": 460,
      "PostDate": "01/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jun 3, 2015 02:58AM jc254 wrote: Berlin, the caps are very cold on your head so most women take some kind of pain reliever before chemo starts. It's only the first 10 minutes of cold capping where it's somewhat painful, after that your scalp gets numb and it's not so bad. Shedding is normal when using cold caps. Your hair will thin but it shouldn't be falling out in clumps and you shouldn't have bald spots. I'm guessing you bought ElastoGel caps. I didn't use that brand but I'm pretty sure you need more than two. You should jump over to the other cold cap thread \"cold cap users past and present\". There are women posting who used ElastoGels who can help.",
      "MessageIndex": 344,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jul 1, 2015 03:37AM jc254 wrote: Jenndance, I think you'll be just fine.   Waiting a few more weeks won't make any difference. ",
      "MessageIndex": 376,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "May 4, 2014 05:37AM jc254 wrote: Sue, yes, it happened to me and many others.  My sheddding wasn't too bad during chemo, but I continued to shed for four months PFC.  There was a period for several weeks where the shedding got scary heavy and I was nervous.  The wonderful women on the cold cap forum calmed me down. The shedding really slowed at three months PFC (that's when I colored my hair) and completely stopped at four months.  In the end, my hair was thinner but looked fine.  Just hang in there.",
      "MessageIndex": 23,
      "PostDate": "04/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jun 17, 2014 07:57AM jc254 wrote: I was three months past my final chemo.  I was still shedding but it had slowed significantly.  Since I was going to a wedding, I deecided it was time to do something about the state of my hair.  I was more worried about using heat on my hair than I was about the actual color.  That's why I didn't sit under the dryer.  We weren't sure how well the color would take or last without using heat, but it turned out great.  In fact, she continues to apply it that way now. ",
      "MessageIndex": 43,
      "PostDate": "17/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jun 16, 2014 05:48PM - edited Jun 16, 2014 05:49PM by jc254 My hairdresser (who's also my friend) did a lot of research to find the safest professional product to color my hair the first time at three months PFC.  I trusted her to decide which product would be best.  She used demipermanent color by Framesi from their Eclectic line.  She did not use heat after applying the color.  We just left it on longer.  It covered the grey really well and I was thrilled with the results.",
      "MessageIndex": 41,
      "PostDate": "16/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jan 12, 2015 11:56AM - edited Jan 12, 2015 01:31PM by jc254 I had my hair trimmed and colored before I stopped shedding.  I was going to a wedding at three months PFC and my hair looked pretty ragged.  Just make sure you explain the situation to the stylist and either wash yourself before going to the salon or ask her to use cool water and wash gently.  My stylist even blow dried my hair on a cool setting and styled using only her fingers.  It looked great and I actually cried (good tears) when I walked out of there.  The shedding continued for about another month but I don't think the cut and color made any difference.  I really liked the Kenra leave in spray too although I didn't continue using it.  My hair gets really frizzy so I went back to my normal products at about six months PFC.  The one thing I have continued using is a wide tooth comb instead of a brush. I never used a comb before cold caps but now I don't like using a brush.  Not sure why.",
      "MessageIndex": 113,
      "PostDate": "12/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Feb 27, 2015 07:57PM - edited Feb 27, 2015 07:58PM by jc254 SueBe, if it's any comfort, long term shedders ( I was one of them) usually stop at about 16-17 weeks post chemo.  You're getting close. I can't imagine that hair gel would do any harm now.",
      "MessageIndex": 231,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "May 13, 2015 02:03AM jc254 wrote: Hi Suladog. I think you'll find many of us colored before the recommended 6 months. A lot depends on the state of your hair. I had my hair colored at three months even though I was still shedding. I trusted my stylist (who is also my friend and well aware of the cold cap situation) to pick the gentlest color she could find. My hair is brown so I doubt there was any peroxide involved. She applied the color without using heat as I was more concerned about heat on my scalp than the actual color. It turned out great. At one month PFC you're pushing it, but since you haven't had much (any?) shedding it will probably be OK. You might want to try the no heat method however. I posted a while back with the name of the product. I'll see if I can find it. Good luck.",
      "MessageIndex": 328,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jun 3, 2015 02:59AM jc254 wrote: Suladog, that is awesome news about your friend in Japan!",
      "MessageIndex": 345,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jan 3, 2015 09:42PM - edited Jan 3, 2015 09:43PM by jc254 JoeyJamesmom, you did really well for AC chemo.  It's not unusual to shed for 4 months PFC.  I definitely lost more hair PFC than during chemo and the amount is similar to your picture.  Hang in there... I have never read of any cold cappers needing a wig post chemo because of continued shedding. Keep following the hair care protocol until shedding stops (or at least signficantly slows).  Raindew, let us know when it finally stops shedding... Warrior, good to hear from you!  You've had a tough road and I hope this is the end.   ",
      "MessageIndex": 81,
      "PostDate": "03/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "May 14, 2015 02:00AM jc254 wrote: We liked the color so much I'm still using it with no heat two years later. Good luck tomorrow.",
      "MessageIndex": 333,
      "PostDate": "14/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 13, 2014 02:55PM jc254 wrote: I'm really surprised to read this.  My injections were done during surgery after I was put under with anesthesia.  I would be asking my surgeon why it can't be done that way.",
      "MessageIndex": 24,
      "PostDate": "13/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746169",
      "Title": "Nuclear Injection pre-surgery pagowens Accepted2018"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jan 31, 2015 06:21PM jc254 wrote: Hi ladies, you are certainly not alone. There's a whole community of women here who have been right where you are. We understand. Cold caps really do work to save hair during chemotherapy. Search for the thread titled \" Cold Cap Users Past and Present\" on the discussion boards. Unfortunately Penguin Cold Caps (the brand most of us used) are expensive and generally not covered by insurance. There is a less expensive brand called Elastogel that some women have successfully used recently. There is also a nonprofit called the Cold Cap Assistance Project \"CCAP\" that has helped defray the cost for some women. It's worth checking out. Hope you don't need chemo, but if you do, please know that for most of us it was very manageable. I was able to continue working full time and because I kept my hair, most people at work had no idea I was being treated for breast cancer.",
      "MessageIndex": 3,
      "PostDate": "31/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/828058",
      "Title": "Cold caps? Copperlisa jc254"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Oct 13, 2015 03:59PM jc254 wrote: Keepstrong, using cold caps was one of the best decisions I made during treatment and I invite you join us on the cold cap thread here on bc.org to find out more. You will find lots of advice and tips and a strong support network should you decide to use them. Lots of pictures too! Search for \"cold cap users past and present\". fd, I'm sorry they did not work for you. There are many women who have successfully saved their hair while receiving ACT chemo. You are correct that the odds of success are lower on ACT (about 50%) than on other chemo drugs but that's much more than a little chance. The odds of success if receiving TC are close to 90%. Keepstrong, I know this is almost impossible to believe right now but you will get through this and life will return to normal. Lean on those who love you, that's what they're for.",
      "MessageIndex": 8,
      "PostDate": "13/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/835735",
      "Title": "27 & Struggling :( Keepstrong88 nem126"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jun 10, 2015 03:56PM jc254 wrote: Yes, with DCIS you certainly have time to process your diagnosis and get a second opinion. I always think a second opinion is a good idea. For the majority of women, a lumpectomy is very manageable surgery. Not a lot of pain or downtime when compared to mastectomy. You can always get the lumpectomy and have a mastectomy at a later date if genetic testing leads you there. You can't undo a mastectomy so that's a decision that deserves a lot of research and a lot of thought. Good luck with your decisions, things seem to fall into place once the initial shock wears off.",
      "MessageIndex": 7,
      "PostDate": "10/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832499",
      "Title": "Feeling overwhelmed... Js5 Js5"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jan 18, 2016 04:19PM - edited Jan 18, 2016 04:22PM by jc254 I was also diagnosed at a regional hospital (Paoli Memorial) and went to Penn for a second opinion. I never went back to Paoli. Penn is an NCI designated cancer facility with a dedicated breast cancer center. My surgeon at Penn was a breast cancer specialist, my surgeon at Paoli would have been a general surgeon. Not saying that you wouldn't receive good care at DCMH, but why not take advantage of the wonderful resources that Penn has to offer? My surgery was at the hospital but I had my chemo and radiation treatments at one of Penn's satellite facilities in Valley Forge which was much closer to my house and really convenient.",
      "MessageIndex": 5,
      "PostDate": "18/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/840041",
      "Title": "Dcmh or penn ?? Ruby_saphirre craftysandy"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Oct 1, 2014 10:34PM jc254 wrote: Swegirl, a lot us share your distaste for pink October.  I was diagnosed late September 2012 and trying to come to terms with my treatment plan during the October pink blitz.  I'll never forget one Sunday when I was determined to put all things breast cancer out of my mind and sat down to watch an NFL game.  It was like a bad dream seeing the players with their pink cleats and mouthguards.  Or... hearing the teenage clerk at the grocery store ask me if I'd like to make a donation for breast cancer awareness.  Let's just say I was glad when October was over.   Waiting for tests and then the results is difficult no matter what month.  I hope you find these boards a good source of information and support.  Good luck.   ",
      "MessageIndex": 2,
      "PostDate": "01/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825041",
      "Title": "October.... The cosmic joke Swegirl Hopeful82014"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Oct 26, 2014 09:31AM - edited Oct 26, 2014 01:02PM by jc254 Being only one year past the end of active treatment, I can so relate to the almost amazement I feel sometimes that life has completely returned to normal..  There were some dark days when I never thought it was possible.  Thanks for sharing.",
      "MessageIndex": 6,
      "PostDate": "26/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/825732",
      "Title": "Encouragement for the early days... belleb belleb"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 18, 2013 07:59AM jc254 wrote: First chemo is tomorrow and I can't sleep. I was diagnosed back in September 2012 and kept my BC private for a long time.  I didn't want to hear stories about everyone's sister, aunt, neighbor etc who had breast cancer and I didn't want people to treat me like I was dying. People generally don't understand how many different breast cancer types there are and the implications of each. I certainly didn't and I found it very difficult to explain to others. I also didn't want to deal with the pain and worry of others- I had enough worry of my own. So I told a few trusted friends and only a few family members. I figured the rest would find out after I had completed surgery and radiation. It wasn't until I got the surprise chemo recommendation in February that I began to rethink my need for so much privacy. So as of now, my friends and family are all aware of my diagnosis. I recently (today) spoke to my boss and only because I will be taking some planned days off for chemo treatments and probably missing some other time when not feeling great. Only two of my coworkers are aware of my diagnosis and I plan on keeping it that way. My delay in sharing the news was the right decision for me. It gave me time to accept my diagnosis, and become educated about the disease and my treatment plan.  I am a very independent person (single for 6 years with two daughters away at college) and don't like feeling needy. But it is comforting to know that I have large network of family and friends who are willing and able to help should I need it in the coming months. I hope that I don't and my side effects are minimal. Indenial, I agree, the arrival of spring has been a real boost to my spirits.  I've been working outside in my garden in my free time, something I've enjoyed doing for years.  I've always joked that gardening is my \"therapy\", and now I'm finding that to be true.  Just hope I have the energy to continue once chemo starts.",
      "MessageIndex": 394,
      "PostDate": "18/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 22, 2013 10:37AM jc254 wrote: So I decided to take today off.  I'm considering it a mental health day.  Hopefully I'll return to work tomorrow refreshed and recharged.  Thanks to everyone for your kind words and support.  It really helps, especially in the middle of the night when things look bleak.  Feeling much better today!",
      "MessageIndex": 489,
      "PostDate": "22/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 25, 2013 11:34PM jc254 wrote: Well I made it to one week past my first TC treatment and I'm feeling pretty good!  Even had a good and productive day at work.  The first week was pretty rocky both physically and emotionally, but I'm hoping the next two weeks are normal before I start again.  Welcome to the new ladies, you've found a new home full of supportive women who get what you're going through.  I found it's a great place to conduct my frequent late night pity parties.  Feel free to join me.",
      "MessageIndex": 594,
      "PostDate": "25/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "May 10, 2013 01:40PM jc254 wrote: I had my second TC treatment yesterday and feeling pretty good this morning.  I developed chemo burn on my wrist from the first infusion and if it happens again I'll have to get a port for my last two infusions.  : (    The good news is that my WBC count is high (probably as a result of fighting the infection from the chemo burn) and I don't have to get the neulasta shot this time.  It caused bone pain last time even with the claritin.  Hoping for few side effects this time and happy I'm half way finished. I'm using cold caps and so far my hair is hanging on.  Wishing everyone a happy and pain free weekend.",
      "MessageIndex": 858,
      "PostDate": "10/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "May 11, 2013 11:40PM - edited May 11, 2013 11:48PM by jc254 I developed a large red mark on my wrist similar to a burn and you could see that it was traveling down my vein.  My neighbor ( a nurse) took one look at it and told me to call the doctor immediately.  Of course, it was a weekend but the on call oncologist prescribed antiobiotics.  I went in on Monday for my regular oncologist to take a look and she tried to tell me it must be a spider bite.  Are you kidding me?   I told her very forcefully that it was not a spider bite, but a result of the chemo.  Of course it turned out it's not a spider bite, it's chemo burn.  Antibiotics cleared it up but if it happens again I have to get a port.  Trust your instincts when it comes to chemo related side effects. ",
      "MessageIndex": 882,
      "PostDate": "11/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Mar 27, 2013 12:31AM jc254 wrote: Shipsgirl, I am also starting chemotherapy sometime in April and will be trying cold caps.  I agree, it's about having some level of control over this awful situation we all find ourselves in.",
      "MessageIndex": 38,
      "PostDate": "27/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 23, 2013 11:30PM jc254 wrote: Take regular Claritin, not Claritin D, the day of your shot and for 4-5 days afterwards.  This was the advice of my oncologist.  She didn't volunteer the Claritin information but when I asked (thanks to reading these threads) she said \"Oh yeah, that's a good idea\".  I'm just using the Target generic brand and it seems to be working.  I'm getting strange pains that travel throughout my body randomly- thigh to elbow to ankle etc- but I can't say it's awful, just strange and annoying.  Who knows what it would feel like without the Claritin?",
      "MessageIndex": 529,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Sep 27, 2013 10:28PM - edited Sep 27, 2013 10:47PM by jc254 Moderators- I have great respect for the work you do and really appreciate this website.  But I feel compelled to point out that BreastCancer. org's site contains some inaccuracies about cold caps.  The caps work much better with taxanes than with anthracycline (your information is backwards).  Also, some treatment centers have special freezers to chill the caps (but not many). Most women who use cold caps transport them to the treatment center in coolers filled with dry ice. The caps are kept in your home freezer between treatments. Finally, the Dignicap is not yet available to the public in the United States. Plans to begin a clinical trial of the Dignicap were just recently announced. If that trial is successful and the Dignicap system gets FDA approval, it will most likely make Penguin Cold Caps obsolete.   For anyone reading this who is considering cold caps- the caps work well for those who receive TC chemotherapy.  For those receiving ACT, the results are not as good, although some have had success.  Bugs, please join us on the cold cap users thread as the mods suggested.  We'll be glad to answer any questions and help you through it if you decide to use the caps.",
      "MessageIndex": 2,
      "PostDate": "27/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/811769",
      "Title": "Cold Caps Help! bugs512 BanR"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jul 7, 2013 10:47PM jc254 wrote: Portland, please join us on the thread \"Cold Cap Users Past and Present\" under the category, \"Help Me Get Through Treatment\".  You'll find lots of advice and tips from women who have used the caps in the past and those currently using them.  It's a great group of postive women who will be happy to help.    I finished chemo about two weeks ago and kept my hair.   You can too.",
      "MessageIndex": 139,
      "PostDate": "07/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Aug 24, 2013 08:52PM jc254 wrote: I'm joining your group and starting radiation on Monday.  I'll have 16 whole breast treatments and 5 boosts, although my radiologist said the decision on whether to have the boosts is up to me (I hate being put in that position- how am I supposed to know if I should have boosts?).  Anyway, I strangely haven't given radiation much thought until now and have been reading this thread trying to figure out what I'm in for.  It's been 9 weeks since I finished chemo and it's been great to have that time to take a vacation and get my energy back.  I'm feeling good, ready to tackle radiation and finally get this breast cancer treatment finished. I've already started taking femara with few side effects so far. It will be almost exactly one year since my diagnosis when I am finished radiation. I appreciate everyone who posts with their experience.",
      "MessageIndex": 1400,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Sep 6, 2013 08:13PM jc254 wrote: I finished 9 of 21 radiation treatments today and so far, it's all good.  I'm using Miaderm 3x a day- didn't ask, just started using it after reading posts here.  I am having the shortened radiation protocol of 16 whole breast treatments and 5 boosts.  My radiologist said not to expect any skin changes until near the end or after treatment is finished.  The best thing about my treatments is that I'm going to a facility that only opened a few months ago.  There's never a wait and since I'm the last appointment of the day, there's never anyone else there besides me and the rad techs. I walk in, get changed and they're waiting for me.  I'm back in my car and on my way home in less than 20 minutes. ",
      "MessageIndex": 1483,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Oct 15, 2013 06:51PM jc254 wrote:",
      "MessageIndex": 1576,
      "PostDate": "15/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 10, 2013 01:55AM - edited Apr 10, 2013 01:56AM by jc254 Virginger, I know what you mean about birthday fun.  Yesterday was my birthday and I spend it getting much needed dental work in preparation for my chemo treatments that start 4/18.  I hoping next year's birthday finds me in a much better place.",
      "MessageIndex": 171,
      "PostDate": "10/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 19, 2013 09:43PM - edited Apr 19, 2013 09:57PM by jc254 Erin, surround yourself with positive people who make you laugh.  I had my first treatment yesterday and so far feel fine. The actual infusion time is not a big deal. It's painless and can be relaxing, and yes, ask your oncologist for an ativan prescription.  I took one yesterday before my infusion and I am not generally one to take many medications. Once you begin treatments, you're that much closer to being finished and getting on with your life. Remember, you will not likely get all (or possibly any) of the bad side effects we hear about.  We're all in this together. I don't mean to minimize your fear.  We've all been there and I was devasted with the chemo recommendation.  You will get through this, we all will.",
      "MessageIndex": 431,
      "PostDate": "19/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 24, 2013 04:23AM jc254 wrote: I went back to work today.  Chemo brain hasn't been a problem so far but I'm an emotional mess and dreading going back tomorrow.",
      "MessageIndex": 532,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 26, 2013 05:12AM jc254 wrote: Irene, this is the place to complain. No apologies necessary. I was told by my oncologist to take the meds at the first sign of nausea, not to wait until nausea had gotten the best of me.  I'm sorry you're feeling so badly. ",
      "MessageIndex": 598,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 7, 2013 11:44PM - edited Apr 8, 2013 12:44AM by jc254 I will also reluctantly be joining the club.  My first TC treatment is scheduled for 4/18.  I'm determined to live my life as normally as possible during treatment and plan to continue working with days off here and there when I feel particularly bad.  I'm hoping there won't be too many of those days.  I hope to get (and give) support over the next few months to those on this forum who really understand what we're going through.  I'm single with two college aged daughters and feel lucky to have a great support group of family and friends. I am normally a very independent person. It's taken me a while to accept that it's ok to ask for help- those that love me are glad for something to do. I was initially diagnosed back in September 2012.  I'm ready for this to be over with!",
      "MessageIndex": 128,
      "PostDate": "07/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 21, 2013 11:59PM jc254 wrote: Going forward, I'm an independent contractor and not subject to the FMLA unfortunately.  If I don't work, I don't get paid.  With two kids in college, not working for three months is not an option.  I think I was kidding myhself that I'd be able to sail through chemo and not miss a beat. I know that the company I'm working for will arrange my schedule so that I can work from home on some days and we'll get it figured out.  I'm just having a bad night emotionally and think I should stay home another day to get my act together.",
      "MessageIndex": 482,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 23, 2013 05:58AM jc254 wrote: I am also 4 days past my first chemo treatment and heading back to work this morning.  My biggest problem so far has been constipation and I finally solved that this morning after taking every laxative known to mankind over the past few days. Now I'm a little worried about being trapped in my car for an hour during my commute! Fatigue has also been an issue.  I'm hoping back to work and my normal routine will give me a burst of energy and help take my mind off my troubles. I also have a prescription for Ativan and have been taking one at night to help me sleep.  It's working.  Hope everyone has a good day.",
      "MessageIndex": 508,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 24, 2013 12:58PM jc254 wrote: Runnersmom, I had my first of 4 TC's five days ago.  First met with my oncologist who went over the results of my bloodwork. Then downstairs to the infusion room.  I had about 40 minutes of premedications (benedryl and antinausea meds) and then they started the actual chemo drugs. The infusion took about two hours and is not bad at all if you can keep your nerves calmed. The first infusion will take longer than the other three since they start the taxotere drip very slowly to make sure you don't have any reaction.  I had taken an ativan beforehand and combined with the benedryl, I was pretty relaxed throughout. It helped that I was the only one in the infusion room.  I left tired but feeling fine and sort of glad I had started the process since it meant I was that much closer to the end. Good luck to you today. ",
      "MessageIndex": 539,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Oct 12, 2014 09:27PM jc254 wrote: sjacobs, your doctor is sorely misinformed about cold caps like so many in the medical community.  Cold caps work extremely well for those receiving CT chemotherapy and there's no doubt CT will cause hair loss.  There's a very active cold cap thread on breast cancer.org for anyone considering cold caps. ",
      "MessageIndex": 193,
      "PostDate": "12/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jan 1, 2015 10:14AM - edited Jan 1, 2015 10:27AM by jc254 A little late to this conversation, but I'm another satisified Penn patient.  I live in Downingtown (Chester County).  Originally diagnosed at Paoli, I went to Penn for a second opinion and ended up enrolling in a clinical trial at Penn that wouldn't have been available to me had I remained at Paoli.  Had my surgery at HUP in the city and had chemo and radiation at Penn's Valley Forge facility.  It was very convenient and I love the oncologist in Valley Forge- Tracy D'Entremonte. She's also a supporter of cold caps if anyone's considering using them.  We're lucky to live in an area with such an abundance of high quality medical facilities.   I think it's always a good idea to get a second opinion, even if it just confirms the original findings and treatment recommendations. ",
      "MessageIndex": 19,
      "PostDate": "01/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826802",
      "Title": "age 45, just diagnosed, Philadelphia jarpsyd Jenmarie9"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 19, 2013 04:26PM jc254 wrote: Had my first TC treatment yesterday.  I slept peacefully last night, despite the steroids and feel pretty normal so far today.  It's weird and unsettling just waiting to see what will happen next.  Good luck to all just starting out. Hope we can coach each other through.",
      "MessageIndex": 423,
      "PostDate": "19/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 21, 2013 10:47PM jc254 wrote: I'm three days past my first TC treatment and supposed to return to work tomorrow.  I don't think I can pull it off.  Physically I'm not too bad, but I feel incredible fatigue and emotional exhaustion. I can't imagine getting in the car for my normal hour commute and I'm beating myself up about it. Just venting I guess- chemo sucks.",
      "MessageIndex": 479,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Jun 18, 2014 11:51AM jc254 wrote: Kelly, you'll get through this.  I finished chemo almost a year ago.  I'm a CPA and worked fulltime throughout chemo.  It wasn't ideal, but it was manageable and I haven 't noticed any lingering chemo brain effects.  It's not at all silly to be worried about losing your hair, especially at such a young age.  Please check out the cold cap thread.  There may be a way to save your hair if chemo is necessary.  You'll find a great community of women here of all ages who offer advice, support and friendship.  We'll help you through it.",
      "MessageIndex": 21,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/822044",
      "Title": "It was confirmed today (33 years old). Kelly1217 whatnow"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Aug 27, 2013 05:54PM jc254 wrote: I had my first radiation treatment yesterday, following about an hour of set up.  I was surprised that they put big sharpie marks on my skin covered by clear bandaids during the set up.  I got tatoos during the simulation and thought that was the end of it, so I wasn't expecting the sharpie marks.  One of the marks is very high on my chest and difficult to cover when dressing for work.  Is it normal to have tatoos and sharpie drawings? ",
      "MessageIndex": 1421,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Mar 29, 2014 12:42PM - edited Mar 29, 2014 12:52PM by jc254 Hi ladies.  I started chemo in April 2013 and I know exactly how nervous you all feel right now.  I felt the same way in the days leading up to my first infusion.   I thought I'd give you all some hope.  I found chemo not nearly as bad as I had imagined or feared.  I worked full time throughout.  Yes, there were days I felt rotten and my energy level was pretty low, but I did not get most of the more serious side effects.  Let me add that I'm not superwoman and if I had the choice I would have worked part time but for various reasons full time was necessary.  It turned out to be very manageable.  I also used cold caps and it was one of the best treatment decisions I made.  Not looking sick helped me to feel less sick and was a huge emotional boost.  Please don't apologize for your \"vanity\".  Losing hair is a very difficult, visible and traumatic side effect of cancer treatment for most women. There is an active cold cap forum on breastcancer.org if anyone is interested in finding out more.  I will pop in here from time to time and share my chemo experience.  I hope it helps. ",
      "MessageIndex": 13,
      "PostDate": "29/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 5, 2014 10:04AM - edited Apr 5, 2014 10:07AM by jc254 Like many of you, I wasn't expecting chemo.  I was diagnosed with DCIS through a diagnostic mammogram, MRI and biopsy.  It wasn't until the pathology from the lumpectomy that a \"surprise\" area of IDC was discovered.  I was devastated with a higher end oncotype score and the chemo recommendation. But...chemo wasn't nearly as bad I imagined.  I got through it just fine and I'm glad I had it.  I just had to comment about \"being strong\".  It really got on my nerves after a while when people kept commenting that I was \"so strong\". I wasn't that strong.  I was just doing what I had to do to get through it. Believe me,I had many pity parties, although usually late at night when no one else was around.  During the day I was consumed with my normal daily life.  A crying jag once in a while is good for the soul. I started chemo a year ago this month and I'm happy to report that life does get back to normal..You will all get through this, it's just a little unexpected detour. ",
      "MessageIndex": 60,
      "PostDate": "05/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 6, 2014 11:21AM jc254 wrote: Hi Swissmiss.  It has to be hard to be in a new area without the support of friends and family.  You'll be surprised that you will walk out of the infusion center that first day feeling fine. The weird part for me was waiting and wondering about the dreaded side effects over the next few days because you're not sure what will happen. The anxiety was much worse that the reality for me. You might be surprised to find that you're able to do a lot more during chemo than you think.  You don't specify your chemo regimen, but if it's every three weeks, you'll most likely feel fairly normal for at least two weeks out of each cycle.  Get the kids more involved with the day to day household routine.  It's their way of helping you. Please don't be afraid to ask for help from others with the kids when you need it.  Most people will want to help when they hear about your situation, but might not feel they know you well enough to bring up the topic.  If people offer to help, be specific with what you need- (can you pick up son every Thursday after soccer practice?).  Good luck and we're here for you.",
      "MessageIndex": 68,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "jc254",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173900/profile",
      "Content": "Apr 17, 2014 01:57PM jc254 wrote: Everforward, I had Aetna at the time of my treatment (through cobra, but that's another story) and only had to pay out of pocket a $40 specialist co-pay at each infusion.  I saw my oncologist before each treatment.  You're right, those chemo drugs are ridicously  expensive, as is the neulasta shot, and 30% of that would be a hefty bill.  Isn't there a max out of pocket amount with your policy? Before chemo started, I received a phone call from the hospital billing department telling me that I would owe approximately $10,000 out of pocket for chemotherapy- and did I want to speak to a social worker for help with finding financial assistance?  I was shocked.  Turned out, they were completely wrong- so check and double check directly with your insurance company.",
      "MessageIndex": 199,
      "PostDate": "17/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    }
  ]
}