{
  "AuthorID": "jcfree",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
  "Posts": [
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "Feb 10, 2016 01:08AM jcfree wrote: I had Taxotere/Herceptin/Perjeta chemo treatments from Dec. 2014 to March 2015. My hair is growing back, although slowly. It is curly which I have heard called chemo curls. My hair was always thick and straight. So far it seems to still be thick, just growing slow.",
      "MessageIndex": 109,
      "PostDate": "10/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761295",
      "Title": "Did anyone had her hair back after taxotere??? melania janet11"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "Jun 13, 2015 01:52PM jcfree wrote: I was diagnosed November 2014. Started neo-adjuvant chemo December 2014 of Taxotere/Herceptin/Perjeta. After three treatments, I had a PET scan and it showed my lymph nodes on my right side underarm that were positive were now clear, my tumor on my right side which was 5.3 cm had shrunk by 50%. My Onc said that I had exceptional response to the treatment. Had another PET and full body bone scan after my 6 rounds and am now NED. I have surgery scheduled for masectomy of right side for July 7. You may yet see a reduction of your tumor as you have four more to go. Everyone's chemo treatment is unique to their cancer situation and some will respond earlier and others will need the full number of treatments to see a reduction of tumor. Yet I see some who have the neo-adjuvant chemo, then have surgery then radiation or even more chemo treatments. I initially was disappointed too that I couldn't have surgery right away, just wanted it gone! But now I see how having chemo first helps reduce the tumor or tumors and also any lymph nodes that are positive can be cancer free from the chemo treatments.",
      "MessageIndex": 2,
      "PostDate": "13/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/832416",
      "Title": "Positive outcomes from chemo before surgery?! LillieRose art15"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "jcfree wrote: Had CT of chest and abdomen yesterday and the nurse said I would not get results for 5 to 7 days. Got home late afternoon and looked at my email and got message from hospital that my CT results have been posted online in my chart. So I checked and it said all was clear, no evidence of cancer. So now have been NED for 15 months. My Onc said last scan that H & P are doing what they are designed for. Wanted to post for people to see how treatments can work and hopefully do. DX-November 2014 Grade 2 Lobular & Ductal on right side. 5.3 cm tumor right side. 3-Bone mets to sternum, femur and hip, Stage IV. Neoadjuvant Chemo-Taxotere,Herceptin and Perjeta started Dec. 16, 2014. NED after chemo treatment 2015. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845099",
      "Title": "CT scan yesterday shows continued NED jcfree Holeinone"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "May 16, 2015 01:34AM jcfree wrote: Was diagnosed as Stage IV Nov. 2014. Found this site at that time and have visited daily since then. Just added Stage IV to my signature today. Took me a long time to come to terms with it and reading daily here of all the other IV women has helped a lot to alleviate many of my fears and have learned so much from this site. Still have not told my extended family of my Stage IV status yet. Only my DH and our sons know of it. At this time I feel it's the right thing, as my parents are elderly and not in good health, my siblings would freak out so best not to now. Got the go ahead for a masectomy last week from my Onc, he said the tumor board approved it after reviewing. He said my exceptional response to the chemo treatments, my PET and full body scan showed NED contributed to the change. Initially I was told because I was Stage IV that I would not get a masectomy, so was surprised they have given the green light to get it now. Have my apt. first of June with the BS to schedule it. Feel relieved to know I can get the surgery as I had two different cancers in one breast and a large tumor. Just want it gone.",
      "MessageIndex": 662,
      "PostDate": "16/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "Jun 8, 2015 02:56PM jcfree wrote: My situation is similar to bama351. Was diagnosed as Stage IV November 2014. Started neo-adjuvant chemo in December 2014, 6 rounds of Herceptin/Perjeta/Taxotere and finished March 31. Had PET and full body bone scan (had 3 small bones mets) and both scans showed NED. My tumor in the right breast was 5.3 cm and is now 2 cm, just dead tissue. Originally I was told that due to my Stage IV status I would not get a masectomy after chemo but would continue with Herceptin/Perjeta infusions every 3 weeks indefinately. Then when I saw him last month he said my case went in front of the tumor board and they said because I responded very well to the chemo treatments and was NED they strongly recommended I have the masectomy. My Onc said that I not only had a large tumor in the breast but several smaller ones also and that there is a chance of recurrence in the affected breast and it may not respond as well. The tumor board also stated that most of the cancer was localized in the breast with only 3 small bone mets which are now gone so for those two reasons they changed and approved the surgery. Met with the BS last week and have masectomy scheduled for July 7. I have not decided if I will have reconstruction or not. Will decide after the masectomy and consult with PS.",
      "MessageIndex": 9,
      "PostDate": "08/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832392",
      "Title": "Mastecomy/Lumpectomy no longer and option/priority - stage IV Freygea zarovka"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "Jul 2, 2015 04:39AM jcfree wrote: Happy Birthday Blessings to you! I think your attitude sure helped you this far. I try to have a positive attitude too, just taking one day at a time and count my blessings. My Onc never gave me a time table upon my Stage IV diagnosis last November, nor did I ask him for a prognosis. I was ready to do whatever I had to for treatment and was determined to give it my all. So far it has worked out well. Hope in three years I can be like you, still here and keeping on!",
      "MessageIndex": 24,
      "PostDate": "02/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833095",
      "Title": "I turned 45 yesterday kebab Tina2"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "Feb 25, 2016 05:22AM jcfree wrote: Was diagnosed with lobular & ductal cancers in right breast with 3 bone mets. Had 6 rounds of Taxotete, Herceptin & Perjeta with H & P every 3 weeks along with Anastrozole. PET scan after chemo showed NED with bones mets healed and lastest CT scan in December showed still NED. Good to see the many cases of remission after treatment.",
      "MessageIndex": 8,
      "PostDate": "25/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/841445",
      "Title": "Any er/pr/her+ with NED/stable if so how long and what treatment Dezymarie Dezymarie"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "Jan 18, 2016 06:22PM jcfree wrote: My three bone mets were found on the PET scan I had last year for ILC diagnosis. They showed up clearly on the scan my Onc said. After THP treatments the second PET scan showed that the bone mets were healed.",
      "MessageIndex": 15,
      "PostDate": "18/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/835401",
      "Title": "Would PET-CT always show ILC bone mets? ShetlandPony Moissy"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "Mar 19, 2016 02:27AM jcfree wrote: I was diagnosed November 2014 with Stage IV, three small bone mets with lobular tumor on right side. Had complete response to neo-adjuvant chemo, bone mets are healed. Have been NED since April 2015. Very inspiring reading all the responses in this thread.",
      "MessageIndex": 157,
      "PostDate": "19/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831838",
      "Title": "How long have you been Stage IV? goldie0827 dormouse"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "jcfree wrote: Had scans two weeks ago for brain MRI, CAT for chest and abdomen. Got my results last week and they are clear of disease. This makes it two years now of NED status. I am grateful for my Onc and the treatments of H&P every three weeks which he said is working very well for me. Just wanted to to give update as I like to see how others are doing in their treatments too. DX-November 2014 Grade 2 Lobular & Ductal on right side. 5.3 cm tumor right side. 3-Bone mets to sternum, femur and hip, Stage IV. Neoadjuvant Chemo-Taxotere,Herceptin and Perjeta started Dec. 16, 2014. NED after chemo treatment 2015. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/852920",
      "Title": "New scans show continued NED status.... jcfree zarovka"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "Jul 17, 2015 05:25PM jcfree wrote: I had a uni-masectomy on July 7, spent one night in the hospital. Had two drains, my BS took them out on July 13. I drove today for the first time since surgery. I am only taking one pain pill at night now to help sleep through the night. I am doing arm exercises several times a day as directed by my BS. Yes, it is still painful for sure, but getting better every day. Would you be doing the driving to your concert? That might be a lot for you if you have to drive yourself. If someone could drive you, you probably could do it. You would have to be sure to sit during the concert, as you are still recovering. I was sore just driving today running errands, I could feel pain just driving with my right arm, surgery side. I have been pretty sore all afternoon from the driving. That would be my concern for you is driving that far by yourself, could be a problem pain wise for you. Hope you can go, sounds like a fun time with your daughter.",
      "MessageIndex": 1,
      "PostDate": "17/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/833484",
      "Title": "Unilateral mastectomy recovery time mkinoly Noor46"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "Feb 20, 2017 08:13PM jcfree wrote: I found using a chill pillow really helps with keeping them at bay at night. Since using one every night, even in winter, helps so much. My Onc gave me a prescription for an antidepressant med which he said is very successful in stopping the hot flashes, I got it filled but have not taken it yet as the hot flashes have diminished some. Maybe this would be a good option for you to try since it sounds like they are affecting your quality of life.",
      "MessageIndex": 4,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/852913",
      "Title": "HOT FLASHES - Please help!! Cosmogirl Cosmogirl"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "Mar 11, 2015 04:35AM jcfree wrote: I get treatments at the Cleveland Clinic. I always get a private room with bathroom attached. Windows, TV, quiet and the nurses have been great. They always bring me a blanket, milk or juice, or anything you ask for. They have reading materials in the treatment rooms, and I can roam around with my IV pole if I want to. It is a pleasant experience. I live an hour away, so have driving time of two hours on road on treatment day but it is worth it to go there. Our local hospital has a cancer treatment center, but it is just one huge room with chairs along the wall with curtains around each chair, no TV's there. Compared to the Cleveland Clinic it was depressing I felt, so glad to go to the Clinic.",
      "MessageIndex": 12,
      "PostDate": "11/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829315",
      "Title": "Your Chemo Room - please describe Meme117 Mommato3"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "Dec 16, 2015 09:22PM jcfree wrote: 50sgirl andartist at heart, Thank you for the kind words. I absolutely am taking deep breaths and going forward to enjoy life in the moment. I did cry as soon as my doctor told me the good news, I looked over at my husband and he was crying too. Hubs told the doctor that he just made our day and a good ending to this hard year we've had. terrij152 definately bring this to your doctor's attention asap. I had three small bone mets which are gone now, just shows scar tissue on the scan my Onc said. My Onc did tell me that if I get more bone mets that he would treat them with radiation as a new line of treatment. Hopefully, if these are new mets that your treatment can be done without surgery.  ",
      "MessageIndex": 864,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830226",
      "Title": "Having a scan? Waiting on results? The waiting room is open! exbrnxgrl gramen"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "Dec 16, 2015 03:19AM jcfree wrote: Just had echocardiogram and CT scan yesterday. Last one was done 8 months ago. Doctor came in with the nurse and I initially thought, oh no it's bad news that's why they are both here. But the doctor had a smile and said, \"Your test results are excellent, no evidence of disease and heart function is normal.\" He said the Herceptin and Perjeta infusions are doing what they are supposed to do. I got very emotional, I was just expecting something not good. Having lost my mother and MIL within four months this year and another aunt, and going through chemo and masectomy, to hear my doctor give me some good news was overwhelming.",
      "MessageIndex": 860,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830226",
      "Title": "Having a scan? Waiting on results? The waiting room is open! exbrnxgrl gramen"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "Jun 30, 2015 11:55PM jcfree wrote: Bobcat86 I know how you feel, I believe it should be up to the patient and her doctor to make that decision. I am Stage IV from the start November 2014 with three bone mets and ILC tumor in right breast. Was told because of the Stage IV that surgery was no longer an option. Had pre-adjuvant chemo of 6 rounds of Herceptin/Perjeta/Taxotere. Had complete exceptional response to the chemo and PET and full body bone scan showed NED. All bone mets were gone as were positive nodes and the cancer in the breast. The Tumor Board recommended after reviewing my case that I can now have the masectomy and am scheduled next Tuesday for it. They changed their decision, very happy to get the surgery done. This is at the Cleveland Clinic. I have read of other Stage IV's who have gotten surgery after their treatment. Don't give up. Ask your Onc if it is a possibility that you could get surgery after treatment if it is successful. Plus get other opinions from other cancer centers.",
      "MessageIndex": 15,
      "PostDate": "30/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833059",
      "Title": "masectomy for stage iv breast cancer Bobcat86 Zillsnot4me"
    },
    {
      "AuthorID": "jcfree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209693/profile",
      "Content": "Jun 6, 2015 08:41PM jcfree wrote: I had a lady come up to me while I was waiting for my third chemo treatment a couple of months ago. She came over to me with some carnations and asked if she could give them to me. Then she asked if she could pray for me, so she prayed and then gave me a pink rubber bracelet that said \"Love Trumps Cancer.\" Then she left. She never announced her name or if she was doing this on behalf a any BC entity. It caught me off guard, but she was nice. I don't buy the BC pink stuff either, it just seems like it is superficial to me. Would rather see people spend the money they would on this pink stuff. and send it to accredited BC research where it is badly needed. Buying the the pink stuff just lines pocket IMO.",
      "MessageIndex": 43,
      "PostDate": "06/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832322",
      "Title": "Improving treatment for Metastatic BC? wiscgalsmile momallthetime"
    }
  ]
}