{
  "AuthorID": "Jcolby",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240622/profile",
  "Posts": [
    {
      "AuthorID": "Jcolby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240622/profile",
      "Content": "Jcolby wrote: After my lumpectomy on October 18, the medical oncologist \"suggested\" chemo, but I declined. The statistics show a better long term outcome with radiation and hormone therapy, so that was my choice. The radiation oncologist set me up for 19 treatments, and I finished 2 weeks ago. The radiation itself was very easy, and no side- effects appeared until after the 11th treatment. My armpit turned totally black, and my breast got very red with a bumpy texture. The black skin is gradually peeling away, revealing bright pink underneath. The fatigue seems to be easing up, but the pain is not diminishing as I'd hoped. The armpit and breast are still quite painful, and the breast itself has \"zingers\" that take my breath away. I'm sure hoping this isn't a long term thing. How long did your pain last? Dx 10/3/2016, DCIS/IDC, Left, 2cm, Stage IIA, Grade 3, 0/3 nodes, ER+/PR+, HER2- (IHC) Hormonal Therapy Arimidex (anastrozole), Femara (letrozole), Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Radiation Therapy Whole-breast: Breast Radiation Therapy 3DCRT: Breast, Lymph nodes, Chest wall Hormonal Therapy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851733",
      "Title": "When does the pain go away? Jcolby Variable"
    },
    {
      "AuthorID": "Jcolby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240622/profile",
      "Content": "Oct 20, 2016 06:49PM - edited Oct 20, 2016 07:22PM by Jcolby I had my lumpectomy and SNB two days ago. They had a difficult time putting in the locator wire because the tumor was so deep against the chest wall. But since I was already numbed up, the five injections of dye didn't hurt a bit. Surgery was over 3 hrs long, and they removed tissue equivalent to two golf balls in size. SNB was clear!! I'm recovering nicely. I see the oncologist next week, and unless the biopsy of the margins would reveal something, I believe I will only have radiation and meds.",
      "MessageIndex": 71,
      "PostDate": "20/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/848523",
      "Title": "October 2016 Surgeries javamama yogadedra"
    },
    {
      "AuthorID": "Jcolby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240622/profile",
      "Content": "Jcolby wrote: I had lumpectomy 3wks ago. Pain has not been too bad, I only take an occasional Tylenol, no opioid. But two nights ago, there was excruciating sudden pain in the breast. It literally took my breath away, and brought me to tears. Just before it happened, I had twisted a bit to reach something. I could feel a large knot in the breast afterwards, and the next morning it looked slightly bruised. The pain has lessened a bit, but is still worse than it was right after surgery. Any idea what this might be? I do have appointments with two oncologists on Monday, but not with the surgeon until after treatment. Thank you. Dx 10/3/2016, DCIS/IDC, Left, 2cm, Stage IIA, Grade 3, 0/3 nodes, ER+/PR+, HER2- (IHC) Hormonal Therapy Arimidex (anastrozole), Femara (letrozole), Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Radiation Therapy Whole-breast: Breast Radiation Therapy 3DCRT: Breast, Lymph nodes, Chest wall Hormonal Therapy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/849968",
      "Title": "Sudden pain after lumpectomy Jcolby Jcolby"
    },
    {
      "AuthorID": "Jcolby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240622/profile",
      "Content": "Nov 14, 2016 05:38PM Jcolby wrote: Saw two doctors today (oncologists) and both said the pain was from stitches that have snapped, and/or regenerating nerves that were cut during surgery. I'm relieved! ",
      "MessageIndex": 2,
      "PostDate": "14/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/849968",
      "Title": "Sudden pain after lumpectomy Jcolby Jcolby"
    }
  ]
}