{
  "AuthorID": "jctreehugge…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
  "Posts": [
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Oct 15, 2015 07:21AM jctreehugger wrote: I didn't have a second opinion at that stage, but I did get second and third opinions about adjuvant therapy. The doctors share information so you don't have to repeat tests. They will request copies of your mammograms and other tests.",
      "MessageIndex": 2,
      "PostDate": "15/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/835783",
      "Title": "2nd opinion? Bunnyhuggr Bunnyhuggr"
    },
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Sep 28, 2015 05:34PM jctreehugger wrote: I start radiation later this week if the simulation info is ready by then.",
      "MessageIndex": 453,
      "PostDate": "28/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Oct 31, 2015 05:44PM jctreehugger wrote: Georgie how fun that you're going to the OSU game. I am here in Beaver nation! I'll watch the first little bit, then I'm going out TOT with my 12-year old. She is Thor, which is fitting for her (long hair, tall - she's my height - and strong as an ox). I finished my 4th week yesterday woot! Next week is a short week for me, I'm taking a two day break to visit family. My nipple started hurting at the end of the 3rd week, so my RO recommended taping it, and it doesn't hurt anymore. I am having a little bit of itching but it's pretty mild. ",
      "MessageIndex": 1270,
      "PostDate": "31/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Nov 2, 2015 02:20AM jctreehugger wrote: Ltam, my RO recommended taping over my nipple during treatment to protect it. That has reduced any nipple pain I was having to almost none. You might ask about that.",
      "MessageIndex": 1287,
      "PostDate": "02/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Sep 28, 2015 06:00PM jctreehugger wrote: Thanks for the welcome queenmomcat! I would love some comments on my schedule. Am I crazy to think I can get my treatments at 415pm, pick up my kid at practice and head off to my zumba class at 530? This is my plan for keeping sane. I work full time and this way I works best with my schedule. I have never been a morning exercise person so the idea of working out in the a.m. as recommended on another thread scares me! I told my RO and she thought maybe I could do it.",
      "MessageIndex": 455,
      "PostDate": "28/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Oct 24, 2015 03:30PM jctreehugger wrote: I just finished my 3rd week and its going well so far, my RO says the SEs and tiredness hit you on the 4th week. I have one little itchy spot under my breast but the hydrocortisone worked. My RO suggested cutting a little piece of knit t-shirt and putting it between my bra and my under-boob area. I have 15 down and another 18 to go. I am working full time and running my kiddo around to all her sports every night. I did skip Zumba this a.m. because I wanted to sleep in, but I think that's because I had to pick my daughter and her friends up from the middle school dance! No running for me - it hurts a little to bounce so I am going to hold off on that for a while.",
      "MessageIndex": 1125,
      "PostDate": "24/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Oct 10, 2015 01:33AM jctreehugger wrote: I finished my first week today. The techs are sooo nice. I just try to lie there and think about what is going on, I ask a lot of questions about what is happening and they indulge me. I try to get in and out quickly because they are down to one machine and there are several other women waiting behind me usually.",
      "MessageIndex": 739,
      "PostDate": "10/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Oct 3, 2015 07:28PM jctreehugger wrote: Where can I find one of these magical cooling towels? My RO recommended aloe and the sulfa lotion. I am A very fair redhead that doesn't tan, I maroon, so I am expecting a lot of pink! I start rads monday. I had my dry run on Friday and it is kinda intimidating to be all alone in that room with all those machines. I was stunned to learn they treat 45 people per day at our radiation center. Wow.",
      "MessageIndex": 598,
      "PostDate": "03/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Nov 9, 2015 11:09PM jctreehugger wrote: Pjay, just wanted to second what Sloan said about Lymphedema. My RO sends all her patients to a Physical therapist specializing in Lymphedema as a precautionary step. I learned what to look for, and how to clear the lymph system myself. I went to my appointment just today! The PT definitely said a swollen breast could be a sign, and that you want to act quickly, so I would consider making an appointment.",
      "MessageIndex": 1449,
      "PostDate": "09/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Nov 22, 2015 10:53PM jctreehugger wrote: Rain, I think you are onto something about the esophagus. I did have heartburn, the generic equivalent of Prilosec definitely helped. But I wonder if that manifests not self in nausea for rsome folks?",
      "MessageIndex": 1741,
      "PostDate": "22/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Dec 17, 2015 01:16AM jctreehugger wrote:",
      "MessageIndex": 2079,
      "PostDate": "17/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Oct 6, 2015 02:00AM jctreehugger wrote: Thanks Pamela, I found the cooling towel at Target. Mine had Serena Williams on it, I decided I could use her help! 180 cGy down, another 5,760 to go.",
      "MessageIndex": 637,
      "PostDate": "06/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Oct 25, 2015 01:44PM jctreehugger wrote: Marijen I don't have any signs of lymphedema after 3 weeks. I had 7 nodes removed in my lumpectomy and my MO did refer me to a therapist to work on strategies to prevent lymphedema but my appointment isn't for a few weeks, I should probably reschedule for it earlier.",
      "MessageIndex": 1148,
      "PostDate": "25/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Nov 21, 2015 07:51PM - edited Nov 21, 2015 07:53PM by jctreehugger I finished 33/33 yesterday, woot! I worked full time and exercised all through treatment, I think staying busy keeps me sane, and staved off the tiredness. I never got any fatigue and my skin is just a little pink and itchy, They gave a big bottle of Garden of Eden aloe that I used the whole time, and eventually needed a prescription hydrocortisone cream to stave off the itching and rash. I was expecting the last 5 treatments, which were small field boosts, to be more intense, but I didn't notice anything different. My 12-yo daughter came to the last few weeks, she sat in the waiting room and drank all their hot chocolate, lol. All the techs were so nice and I loved talking to them and the other patients. Honestly I will miss them, is that weird? I found myself wearing all my shoes to entertain them, lol, what else are they going to look at? The whole experience was very sobering, I shared time with folks with several different kinds of cancers, really hard to watch some times. Lots of suffering with this cancer business. I was amazed by my doctor and the techs, grace under pressure.",
      "MessageIndex": 1715,
      "PostDate": "21/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "jctreehugge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221860/profile",
      "Content": "Oct 5, 2016 04:20AM jctreehugger wrote: I talked with my radiation oncologist and was able to attend my Dad's retirement party - I missed two rads treatments like you did and was near the end of the cycle. She was totally fine with it. It was wonderful for me to go, and great for my family to see me on the other side of the cancer treatments. Mental health is important!",
      "MessageIndex": 4,
      "PostDate": "05/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848389",
      "Title": "A trip during radiation - need thoughts pls ayr1016 jctreehugger"
    }
  ]
}