{
  "AuthorID": "jdoubow",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101397/profile",
  "Posts": [
    {
      "AuthorID": "jdoubow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101397/profile",
      "Content": "May 13, 2010 06:51PM jdoubow wrote: I had a bilateral mastectomy April 23.  I just removed the drain tubes 2-1/2 weeks later, but am relieved to be rid of them.  I would like to do reconstruction later this year. I did not have good results, found cancer in both breasts and in 9 of 9 lymph nodes on left and 5 of 5 on right.   Right now I do not plan to start chemo or radiation.  I also am anxious to visit a prosphetics store but was told to wait 6 weeks, so three more weeks to go.",
      "MessageIndex": 376,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "jdoubow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101397/profile",
      "Content": "May 29, 2010 07:00AM jdoubow wrote: Thanks HantaYo I do worry some about the pain pills as this is the common one people get addicted to.  This week I have skipped a couple of days and am feeling just about the same as if I took them.  I do feel I used them for a crutch, more for my mind than physical.   I really didn't sleep perfectly before the surgery and have never tried sleeping pills.  Apparently I can get by with the sleep I get.  I have never had a sleep test and bet I would fail miserably on the how many times a night I wake up. One reason I am ready to get out and back to work is that I do nap sometimes just because I read or watch TV and fall asleep.  I try not to, just so I can sleep better at night.  Also, since I have not done radiation or chemo I don't suffer from the side effect of being tired from this treatment.   I have the chest tightness and what feels like chafing under my arms from the cute description I saw about the \"dog ears\".  I have a couple of these.   My incisions which at the beginning were nice and deadened are now coming to life.  My surgeon indicated this was to be expected.  I wear soft sleeveless tshirt camisole things under my clothes, but was thinking for looks I would try to add some breasts.  I will just be flat for some time until I get more comfortable later. Have a good weekend.",
      "MessageIndex": 431,
      "PostDate": "29/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "jdoubow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101397/profile",
      "Content": "May 28, 2010 05:10PM jdoubow wrote: I had my surgery April 23 and plan to go back to work Tuesday June 2.  My concern since I have had no reconstruction type surgery is that I thought I might wear something but am finding that my sutures are really sore and I just can't stand much being against them all day.  So, I guess I will just do without.  I don't feel exhausted, but I am sure when I get back to real work days with getting up and getting around I will feel tired.  I do take a pain pill still and wonder how long others took pills.  Mine happens to be a 5mg hydrocodone and I usually take one each day even though it has been five weeks since surgery.   I almost find now I am about napped out or slept out as I don't seem to be able to sleep all night lately.   But in general I am just happy to be getting back in the world and moving forward with my life. Hope all of you enjoy your summer.",
      "MessageIndex": 429,
      "PostDate": "28/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "jdoubow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101397/profile",
      "Content": "May 14, 2010 06:53AM - edited May 14, 2010 06:57AM by jdoubow Hi rayofsun - I am in Oklahoma City.  I had a great surgeon I would definitely recommend in this area. Hi tory - Yes, getting the drain and tubes removed was such a relief and oddly I also didn't experience pain when they were removed, but they did sting when they were in. I set up a blog to write things down and let friends and family have a way to know what is going on since I was diagnosed.  It is good for me to write it down and handy for others. My sister died from breast cancer in 2008 and honestly, even though it hung in the air heavily, I never thought I would be diagnosed.  I will have a genetic test but I doubt it shows a gene defect.  I do have another sister and a daughter so this helps us all.  The other thing I had done back in 2005 or so was join the Sister Study.  The good thing was that this forced me to get some detailed history from my sister.  Sadly, this is handy now.  We have very similar diagnoses. It is amazing to see all the list of people who had this procedure just around April 2010. Thanks rayofsun, for starting this and thank you to all who have written their events and how things turned out.  I am enjoying reading all the posts so far.",
      "MessageIndex": 383,
      "PostDate": "14/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    }
  ]
}