{
  "AuthorID": "jdp1886",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253525/profile",
  "Posts": [
    {
      "AuthorID": "jdp1886",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253525/profile",
      "Content": "jdp1886 wrote: I am here posting for my wife. Around August of last year, there was a mass found in her breast. The doctor biopsied it, and it came back benign. A titanium marker was placed where the mass is. Two months later, a patch of my wife's hair fell out. Her hair continues to thin. She experienced low grade fevers for a month and a half straight. She gets white-splotchy rashes on her legs and sometimes on her stomach. She experiences night sweats. Reactive lymph nodes have swelled to decent size all over her body. The doctors have ruled out lupus, leukemia, lymphoma, sarcoidosis, rheumatoid arthritis, tuberculosis, and HIV. They are dumbfounded, but refuse to listen when I mention the clip. Perhaps it is rare, but it makes CHRONOLOGICAL sense. The doctors keep saying it's stress from the breast biopsy playing hell on her body, but wouldn't that stop by now? Anybody else experienced/heard of this kind of thing? We are baffled. My wife is obviously having trouble with it all. Although the fevers have subsided, she is still losing hair and experiencing the rest of the symptoms. Any comments would be appreciated. And I should mention that two weeks ago her white blood cell count spiked to 15.7. The doctor called her in the next morning for more blood work, and her count was normal again (around 7). What is going on? Titanium clip? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855809",
      "Title": "Titanium allergy? jdp1886 sas-schatzi"
    },
    {
      "AuthorID": "jdp1886",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253525/profile",
      "Content": "Jun 5, 2017 02:54PM - edited Jun 5, 2017 02:54PM by jdp1886 Thanks for the words offered so far. Yes, we are scheduling an appointment to have the mass removed soon. The only scary part of that is now my wife is scared that if the doctors are right and the original biopsy put her body under a lot of stress, thus causing all of these symptoms,what will the mass removal surgery do? The body is a strange instrument, indeed.",
      "MessageIndex": 3,
      "PostDate": "05/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855809",
      "Title": "Titanium allergy? jdp1886 sas-schatzi"
    }
  ]
}