{
  "AuthorID": "jduford",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94958/profile",
  "Posts": [
    {
      "AuthorID": "jduford",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94958/profile",
      "Content": "Oct 13, 2011 07:57AM jduford wrote: That was probably the hardest part for me... My kids at the time were 19, 16, 14.  We just sat them down and told them exactly what  was going to happen and we were honest about what we didn't know. I remember  it was very hard to physically say the words that I have cancer. One of my girls took it way harder than I initially thought because she was trying to hide her  emotions from me and be strong for me.  I guess I would encourage them to still need you as their mom and they don't have to be strong, they just have to be there for support and hugs.  What kind of surgery are you having?",
      "MessageIndex": 3,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/776402",
      "Title": "how do I tell my kids spunkyboobster Miller1353"
    },
    {
      "AuthorID": "jduford",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94958/profile",
      "Content": "Dec 27, 2009 04:12PM jduford wrote: HI Deen,  I have dark hair but I started to notice a   few scattered hairs about 3 weeks after treatment.  Then what I noticed were little bumps on my head, and I would scratch at them and  a little piece of skin would come off, it took me a while to realize that these were little hairs popping up, so of course I massaged my head several times a   day.  By 4 weeks I had  a five oclock shadow on my head, then week to week people could notice that my hair was getting thicker.I think at 6  weeks I took my hat off.  I did not look normal, but I was sick of my hat.  I had my last treatment on July 21st, and my hair is 1 3/4 long now.  I have dyed it several times because it came in really gray, and it is really curly. Hope this helps!  I know how you are feeling. Julie",
      "MessageIndex": 4125,
      "PostDate": "27/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jduford",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94958/profile",
      "Content": "Dec 29, 2009 01:28PM jduford wrote: I am actually a stage 2  but I chose the double mastectomy and have never looked back.  I have no worries  about reoccurrance  in the other breast cuz it is gone, and I had an amazing plastic surgery, so my new boobs are much more flattering in clothes than the old ones.  I have also had people who just had  a single mastectomy say they wish they would have done what I did so they would be balanced and have one less thing to worry about.  Good luck with your decision. Julie",
      "MessageIndex": 1406,
      "PostDate": "29/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "jduford",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94958/profile",
      "Content": "Dec 28, 2009 10:35PM jduford wrote: I am new to the Stage II  forum, but have really enjoyed reading what you have all written!  I just got back from my  6 months after treatment  check up.. now I'm just waiting for my blood tests to come back.  I am hearing a lot about vitamin D, does anyone know what  our vitamin D levels should be?",
      "MessageIndex": 203,
      "PostDate": "28/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "jduford",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94958/profile",
      "Content": "Dec 27, 2009 01:31PM jduford wrote: Hi, I have a very similar diagnosis and path as yours.  I was wondering how you are progressing, and if you had Chemo.  I am obviously starting this whole chat process late, but I was just searching form someone similar to my situation.  I am curious how you are doing after  chemo. Julie",
      "MessageIndex": 1915,
      "PostDate": "27/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    }
  ]
}