{
  "AuthorID": "jean2100",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289494/profile",
  "Posts": [
    {
      "AuthorID": "jean2100",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289494/profile",
      "Content": "jean2100 wrote: Hi there, I’m posting because I’m really worried about my mom at the moment & could use some feedback from people here! I should note that my cousin died of metastatic breast cancer earlier this year only 7 months after diagnosis. She underwent a double mastectomy and chemotherapy before learning that the cancer had metastasized. Her oncologist at a major breast cancer treatment center said that it was the fastest growing BC he had ever encountered - the whole thing was really devastating for everyone involved to say the least. Now I am concerned about my mom who is in her mid 60s & postmenopausal. Six months ago she found a lump and went to her pcp who confirmed it & then sent her for a mammogram (and maybe also an ultrasound - unsure about this) The radiologist thought it was a cyst & recommended that she follow up in 6 months. Six months later she thinks the lump has grown. She is sent for another mammogram which showed changes from her prior mammogram so she is then sent for an ultrasound. The ultrasound confirms that the area of concern had grown & also confirmed that she does not have a cyst but something more solid. I don’t know more than this as I’m hearing this second hand from my mother. She was then referred to a specialized surgeon for follow-up & we’re awaiting that appointment. My mother is unconcerned because apparently the lump is “only an inch wide” & “feels like it is more attached to the skin than the rest of the breast.” She seemed surprised when I asked if her doctor had sent her to the surgeon for a biopsy - she didn’t know. I refrained from asking more questions because I don’t see any need to worry her at this point. Is it likely that she was sent to the surgeon so the area could be biopsied? Is there any other reason to send her to a surgeon? Am I right in being concerned that she is post-menopausal with a growing solid mass in her breast? I know my cousin’s death has really multiplied my fears. I’d really appreciate an honest assessment of things here. I’d rather know now if some of the things I’ve mentioned sound concerning. It takes me awhile to process things & I’d like to prepare myself for possibly walking through a hard diagnosis with her. It is hard worrying if I am just being silly and overreacting. Does anyone have any thoughts on all o this here? Thank you! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871719",
      "Title": "Referred to surgeon after ultrasound jean2100 Mymomsgirl"
    },
    {
      "AuthorID": "jean2100",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289494/profile",
      "Content": "May 24, 2019 10:38PM jean2100 wrote: Thank you for your response! I’m unfortunately not able to go with her to the appointment as I live a long plane ride (or two) away. I wish I could be there. She tends to get flustered around medical things (understandably so) & I know it can be hard to keep track of details in those moments. Thank you for reminding me that localized cancer has a good prognosis. I just want her to be healthy & enjoy her well-deserved retirement. I think metastatic breast cancer is kind of lost amongst all the stories we commonly hear about breast cancer. I know people were really shocked that my cousin’s cancer had spread & I spent a lot of time behind the scenes trying to explain to family members that it wasn’t due to anything she did “wrong” regarding treatment. That her cancer was just really aggressive & had also changed hormone receptor status. I ope there will be more visibility for metastatic breast cancer in the years to come.",
      "MessageIndex": 2,
      "PostDate": "24/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871719",
      "Title": "Referred to surgeon after ultrasound jean2100 Mymomsgirl"
    }
  ]
}