{
  "AuthorID": "jeannemh",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86122/profile",
  "Posts": [
    {
      "AuthorID": "jeannemh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86122/profile",
      "Content": "Jul 7, 2009 03:48AM jeannemh wrote: Thanks for all the replies.  I guess I was just hopign I'd read lots of no-show lumps turning up to be nothing, and that doesn't seem to be the case, quite the opposite.  I'm not worried about the pain.. I just want it out of me.   And I stll have so much trouble gettig past the fact that it's in there and doesn't show up.. and there's no explanatin from my dr as to why really.  I made a pact to stay away from the internet, and to stop feeling for the lump deciding if it is getting bigger or smaller.. hard or soft.. movable or not.  I'm liviing now with nodules in my thryoid that have to be biopsied for the rest of my life.. so I just want this one out!!!! Anybody know how they do a biopsy if they can't see it on the mammogram or ultrasound? jeanne ",
      "MessageIndex": 11,
      "PostDate": "07/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736998",
      "Title": "Found Small Lump -Diagnostic Mamo and Ultrasound are Clear jeannemh lamomimax1"
    },
    {
      "AuthorID": "jeannemh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86122/profile",
      "Content": "Jul 8, 2009 03:32AM jeannemh wrote: Wow.. it sounds like a lump now matter what is bad if it doesn't show up on mammo and u/s.  I guess my gut has been telling me since i found this that it was bad.  And the only thing this has done has made me loose faith in the test i get every year to protect myself from breast cacner.  Seems it's not necessiry if you have ILC, IDC it doesn't show up.  What's the point.",
      "MessageIndex": 17,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736998",
      "Title": "Found Small Lump -Diagnostic Mamo and Ultrasound are Clear jeannemh lamomimax1"
    },
    {
      "AuthorID": "jeannemh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86122/profile",
      "Content": "Jul 8, 2009 04:59PM jeannemh wrote: I was wondering if lipomas - fatty tissues show up on mammos or ultrasounds?  After reading mostly everything it aappears that they would, yet when I asked my OB what this could be that didn't show up.. he said fatty tissue ?  I'm confused?",
      "MessageIndex": 18,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736998",
      "Title": "Found Small Lump -Diagnostic Mamo and Ultrasound are Clear jeannemh lamomimax1"
    },
    {
      "AuthorID": "jeannemh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86122/profile",
      "Content": "Jul 21, 2009 03:58PM jeannemh wrote: I wanted to get back on this board and post my experience from the last few weeks.  My lump was benign so I will start with that. then I just wanted to share my experience because although it was the worst four weeks of my life, there was a few things that I did to survive, that I thought I would pass on that would maybe help the waiting game for others. As I posted originally, found a small lump.on June 27th (weekend of course).  I called my OB, who I've been going to for fifteen years, so he saw me the same day.He couldn't find it until I pointed it out to him.  Sent me for a diagnostic mammogram and ultrasound and gave me the names of three breast surgeons.   I called and got mammogram and u/s scheduled for 7/6 (Monday) and the first surgeon was for 7/13, the other two names were like I can see you in two months. However I woke up the very next day and called the Imaging place and asked if they had any cancellations.. BINGO.. that same day 30 minutes later. So I go, I point to the lump, they do the mammo and u/s and nothing.  Not even a something that looks like nothing but nothing.  I ask what does that mean.  They can't really say for sure.. a few thoughts were given to me.  Fatty tissue.. breast tissue.. or something just hidden. So now I have my tests and I now have to wait two weeks for the surgeon.  So then to be proactive I made a total of four different appointments with four differen breast surgeons.  My second choice couldn't see me until 10/7.  I wrote and handwritten letter and faxed it to her, and for lack of a better word \"begged' to be able to have the appointment moved up.  They alled within an hour and I had a appointment for the next week. I wanted to make sure that if #1 gave me anything other then \"lets take it out and biopsy it\", that I was going to #2 and so on and so forth. It gave me a sense of empowerment or a little bit of control.   Then for the next two weeks, everyday at 10am and 2pm, I called each one of them to ask if they had any cancellations.  No luck, but it made the time go quicker, and again made me feel like I had a little bit of control. So I go to the first surgeon.  He took me into his office, we talked. Then he brought me to examining room and he went and looked at my films. Came back and did an exam.  Quite different than the normal OB exam. My daughter was my notetaker.  I went with questions and she wrote everything both he and I said and reminded me of any questions I hadn't asked.  Again just a little bit of control.   And guess what he could NOT find it.  had to point it out to him. He felt it, said it's benign.   Said he didn't think it was going to grow, but didn't think it would go away.   Said lets get it out. Said he can't say 100% it was benign, but would be astonished if it was anything else. That was Monday at around 1pm.  I got lucky, they had an opening for Wednesday for the excisional biopsy.  They immediately sent me downstairs for an EKG, and bloodwork, and I was told to call tommorw to get the time of my surgury for wednesday. Went home and called and cancelled all my other surgical appointments. Called tuesday.. my surgury was at 1.  They knocked me out completely did the biopsy.. I was home by 3:00pm.  It was excisional becuase they took the whole thing out. He told my daughter and my dad that we would have the results tuesday and that his opinion after removing it was that it was benign. So it's tuesday (today).  11am, nothing.  So I call and I talk to the 'general question' person and ask if she can find out if the results were in. I knew she couldn't give me the results becuase they had told me that on Monday, that I could call, but nobody other than the doctor would give me the results.    the call at 11, said she would talk to the Dr's nurse and somebody would call me back.  2:30, no phone call.  I called again, and talked to Joanne, my Dr's nurse.  He was in surgury and basically depending on when he was done, he may or may not come back to the office. So i said, the results could be there, but if Dr. C. doesn't come back I won't get the results today.  She said that may happen and she was sorry. I said Joanne, I can't take another day, it's been four weeks, I haven't slept, I haven't eaten.. So she said hang on let me see if the results are on his deks. She puts me on hold for like four minutes.  My heart is pounding out of my chest.  Then she comes back and says Jeanne can you hold, I need you to talk to this other Dr. that was there.  A few minutes later, this Dr. gets on the phone and sayd, it's benign fibrosytic something or other.. and was looking at my chart and said, it's all benign.  That it confirmed what my Dr. thought during the exam, and it's all good.  I.  I didn't hear much after 'benign'I had not cried thru this whole ordeal.  cried like a baby So I guess I wanted to post because when I was searching the web, adn totally freaking out since most of the cites are for survivors, there are very few follow up 'benign' stories. And I also wanted to share the few things I did to make it easier..  making multiple surgical appointments..  calling everyday for possible cancellations.. , sending a hand-written letter asking for an earlier appoint..  saying to the surgeon I want it out end of story, I don't care what anyone 'thinks' it is..  (of course worded more nicely to the surgeon).. and when they tell you the results will be there on a certain day, do not wait,Keep calling, becuase those results are there in that office somewhere.. and until you have a diagnosis, stay away from the internet as much as you can.. So almost 4 weeks to the day.. I have my benign results.  It blows my mind, that it takes women that long to find out the diagnosis of a lump. There has to be something we can do about that. I wish everyone on here all the best and am glad I found this board while I was going thru this horrible ordeal. sincerely, jeanne Jeanne",
      "MessageIndex": 25,
      "PostDate": "21/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736998",
      "Title": "Found Small Lump -Diagnostic Mamo and Ultrasound are Clear jeannemh lamomimax1"
    },
    {
      "AuthorID": "jeannemh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86122/profile",
      "Content": "Jul 6, 2009 11:36AM jeannemh wrote: MY appt is 7/13 so it's only a few days out.    I'm more worried about what happens at that first surgeons appt.. is it nothing more than a conversation.. or do they actually do something then?",
      "MessageIndex": 7,
      "PostDate": "06/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736998",
      "Title": "Found Small Lump -Diagnostic Mamo and Ultrasound are Clear jeannemh lamomimax1"
    },
    {
      "AuthorID": "jeannemh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86122/profile",
      "Content": "Jul 6, 2009 12:46PM jeannemh wrote: It's the unknown and the gut feeling!  I jsut went through this only a few months ago with a tumor in my thyroid.. i just am emotionally drained.  I guess i just can't get past the fact that these images that we rely on so much show nothing.    And i'm supposed to leave for a great business trip first week of august for 6 months... so this is now in jeapardy only beucae of the unknown and the lenght of time it takes for all these tests.  I have to wonder if my last name was famous would I have to wait like this!",
      "MessageIndex": 9,
      "PostDate": "06/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736998",
      "Title": "Found Small Lump -Diagnostic Mamo and Ultrasound are Clear jeannemh lamomimax1"
    },
    {
      "AuthorID": "jeannemh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86122/profile",
      "Content": "Jul 9, 2009 04:34AM jeannemh wrote: How big was the lump that didn't show?  Did they give you an explanation for it not showing? This is my big question.. and there is no answer anywhere.. it's just always unfound cancer.  Everything else seems to show up. I think I have to make a pact to stay away from the internet.  I will end up in the nut-house.  There is just no positive news andwhere. I guess I was hoping I would hear a few comments about benign biopsies after not seeing on mammo and ultrasound but I haven't read any after days an nights searching the web.  I feel I already know my diagnosis before I even have it. ",
      "MessageIndex": 20,
      "PostDate": "09/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736998",
      "Title": "Found Small Lump -Diagnostic Mamo and Ultrasound are Clear jeannemh lamomimax1"
    },
    {
      "AuthorID": "jeannemh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86122/profile",
      "Content": "jeannemh wrote: Last weekend I found a very small lump on my right breast.   It's like maybe the size of a pin head.. 2mm MAX.  It's sort of at 6:0clock under the areola nipple area .  I can't tell if it moves.. because it's so small.  I think it feels like it's real close to the surface.    I went to my OB immediately.  I think he also had trouble finding it in fact I had to point it out to him.  He then said \"i think i feel what you are feeling\".  I love my OB and trust him 100%.  So he said given my age 51, he will send me for a diagnostic mammogram, and an ultrasound to be followed up with a visit to a breast surgeon/specialist. I went and had the diagnostic mamo and the ultrasound the very next morning.  Got lucky was scheduled for almost 10 days away but i called in the morning for cancellation and they had one. Anywy the Mammo was completely clear.  They saw NOTHINg.  Not even enaything that the thougth was suspiciaous.. just NOTHING  So on i went to the ultrasound.  Again, absolutely nothing.   So as you know with a diagnositic you talk to the radiologist at that time, and she told me that she compared my filesm to three years and sees absolutely no difference.  There is nothing suspicious or anything.  Then said my breasts are mildly dense but easy to read so is confident in her findings since there has been no change comparing 2004,2005,2006,2007.  So she says \"i guess this is good news that we dont' see anything, but bad news that it would be nice to see something and say it's nothing.. then proceeded to say it's probably so small it cant be biopsied.  So I thought.. ok, what I go home with a lump and everyone tells me it's ok to do so. When my OB called with the results, I asked him what we could be feeling that is not showing up.. he said probably fatty tissue .. normal tissue that doesn't differentiate on the films.  But he had given me four names of specialists and wants me to see them to confirm.  Now I've already made up my mind, I\"m not letting it go at this.  I have a lump.  I am not going away until I know for sure exactly what it is or is not.  So what I did was I called three of the specialists.  And since the appts are very random.. I decided what the heck and made an appt with each one.  My first is 7/13 and when I go, I will not be satisfied until he agrees to remove it or MRI and biopsy or somethign along that line.  If he doesn't fully put my mind at ease and gain my trust, I will go on to #2, and then to #3 if need be. So what I'm wondering and my questions to everyone on this board are this: What could we be feeling that doesn't show up on a mammogram and ultrasound?  Searching the web just proves a scary nightmare and keeps me up at night because there is so much inforamtion mostly bad information and the bad stories.. nothing good.   So again, what do you guys on this board think It could be?  Has anyone had this before?  My sencond question is, any suggestions as to specific questions I should ask these surgeons to make sure I get all my answers and they dont' start intimating me and I stop asking? At this point I haven't slept in a week.. haven't eating.. even though my films are all negative.. that should be a good thing.  But then I thought.. if I had not done my on BSE (which most dont' say saves lives).. my dr. wouldn't have found it.. i would have gone to my regular mammogram in November.. they would have said you are fine go home.  Lump in tow. I hope you have some ideas and thoughts to share with me..  thank you. P.S.  I'm 51, healthy.. work out, eat good.. been in complete menopause since I was 44.(piece of cake)  I had one child at 27.  My mother died of lung cancer.. that's the only family history i really no. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736998",
      "Title": "Found Small Lump -Diagnostic Mamo and Ultrasound are Clear jeannemh lamomimax1"
    },
    {
      "AuthorID": "jeannemh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86122/profile",
      "Content": "Jul 6, 2009 04:07AM jeannemh wrote: Thank you for replying..  Anybody know what kind of lumps do not show up on ultrasound and mammogram?  Kind of scary thougtht that this is in me and if I hadn't found it.. my normal tests would have showed nothing?    When you go to the surgeon do they typically do the biopsy there?  I sure hope so.  I'm so upset also becasue I'm supposed to leave for a vacation on august 7th and travel for business for several months following that.  I no I can't go until all this is resolved one way or another.. and the way it seems, timeswise, I think I should be considering postphoning these trips...  Is it awful to say there is a family history in order for them to pursue the MRI?  I'm contemplating this.. my mother died of cancer.. both her parents.. my grandmothers sisters.. I just don't know what kind.. jeanne",
      "MessageIndex": 2,
      "PostDate": "06/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736998",
      "Title": "Found Small Lump -Diagnostic Mamo and Ultrasound are Clear jeannemh lamomimax1"
    },
    {
      "AuthorID": "jeannemh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86122/profile",
      "Content": "Jul 6, 2009 09:52AM jeannemh wrote: It's so discouraging.  they say a mammogram will find something small than the human hand.. but here I am, two human hands.. mine and my OB's and the mammogram sees nothing.. the ultrasound sees nothing.  Kind of makes me wonder what's the point.    This feels so close to the surface, I can't believe that even when putting my finger on the exact area to guide the images.. they don't pick up SOMETHING! I'm just finding most all posts from everywhere where it was missed on mammo and ultrasound.. most are bad.  I keep thinking I'm going to wake up and it's a bad dream. Can anyone offer me some thoughts on what I would expect at my visit to the surgeon?  Will he examine me.. will he do a biopsy .. can they remove it in their office.. or am I going to go in.. and just talk to him and then he schedules me for something a few weeks down the road? Thanks.",
      "MessageIndex": 5,
      "PostDate": "06/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736998",
      "Title": "Found Small Lump -Diagnostic Mamo and Ultrasound are Clear jeannemh lamomimax1"
    },
    {
      "AuthorID": "jeannemh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86122/profile",
      "Content": "Jul 9, 2009 08:23AM jeannemh wrote: thank you thank you thank you!  I know excactly what you said.. most that do get b9 don't post as these are breast cancer boards.  I have my first (of 4) surgeon appoints monday.  I will let you know what happens so you knwo what to expect on 9/24.  Until then I am turning my home pc off.. my laptop has been kidnapped by my daughter, and I can't get to these sites from work. So until then.. wishing everyone all good news.. and thanks for answering all my posts.",
      "MessageIndex": 22,
      "PostDate": "09/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736998",
      "Title": "Found Small Lump -Diagnostic Mamo and Ultrasound are Clear jeannemh lamomimax1"
    }
  ]
}