{
  "AuthorID": "Jeannie77",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77708/profile",
  "Posts": [
    {
      "AuthorID": "Jeannie77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77708/profile",
      "Content": "Jeannie77 wrote: Just back from the hospital and feeling strangely calm.  I asked for a copy of the diagnosis and it says the following: Site: (a) Left breast, lower inner lesion.  Sections show breast tissue with an invasive lobular carcinoma, histological grade 1 (Modified Scarf-Bloom-Richardson) based on poor tubule formation, mild nuclear pleomorphism and occasional mitoses. An in-situ carcinoma component is not identified. Receptor status is pending and a supplementary report will be issued. Diagnosis: Invasive lobular carcinoma. Site: (b) Left breast, lower outer lesion.  Sections show  breast tissue with an invasive lobular carcinoma, histological grade 1 (Modified Scarff-Bloom-Richardson) based on poor tubule formation, mild nuclear pleomorphism and occasional mitoses.  Focal lobular carcinoma in-situ and microcalcification is seen.  Receptor status is pending and a supplementary report will be issued. Diagnosis 1. Invasive lobularcarcinoma. 2. Lobular carcinoma in-situ. Whatever that all means? So - I have already made the decision to have a mastectomy (because I do not want to have to do this again) and Tram reconstruction.  I think my doctor was rather surprised I made this decision so quickly, but that's me.  The GOOD thing about it (positive thinking) is that I get to have a tummy tuck!  Anyway the op has been pencilled in and now all I have to do is give up smoking and get myself fit before the op.  Lets get on with it! Dx 1/14/2009, ILC, <1cm, Stage II, Grade 1, 4/9 nodes, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727310",
      "Title": "Diagnosed, decisions made - lets get on with it! Jeannie77 Jeannie77"
    },
    {
      "AuthorID": "Jeannie77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77708/profile",
      "Content": "Feb 18, 2009 10:12PM Jeannie77 wrote: Well now,  it seems all is not so straight forward as I thought.  I went into hospital last week so the plastic surgeon could tie off some blood vessels in my stomach ready for the big op.  At the same time the other surgeon decided he would take out some lymph nodes to check.  I have just heard today that the results are positive for the nodes and now it looks like my reconstruction may not be going ahead. I will no more when I meet with him on Monday.  I am just wondering how its suddenly got to this when both the areas diagnosed were so small!",
      "MessageIndex": 4,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727310",
      "Title": "Diagnosed, decisions made - lets get on with it! Jeannie77 Jeannie77"
    }
  ]
}