{
  "AuthorID": "jeanwash",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101648/profile",
  "Posts": [
    {
      "AuthorID": "jeanwash",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101648/profile",
      "Content": "Jun 1, 2010 08:08PM jeanwash wrote: Chey,  Sorry you are here with all of us.  I had a left breast mastectomy May 27th.  But I did have to go for an MRI on May 25th and ended up having a biopsy to see if the right breast was okay.  The MRI and biopsy were not as bad as I thought.  I was so scared I thought my heart would beat out of my chest and mess up the results.   I also did not know if I could stay still for 30 minutes... but I just meditated and it was all fine.    My right breast turned out to benign.  The Radiologist was very good to let me know that MRI's are VERY sensitive so I should not be overly concerned that the biopsy will come back cancer... it could just as likely be benign.   Please don't worry too much -- the MRI was really no big deal after all.   If they do find something then it is for the better that you learn about it sooner than later.    But mostly wishing you ALL benign result for here on out.  -Jean",
      "MessageIndex": 1,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753045",
      "Title": "MRI scares me cheyenna hlya"
    },
    {
      "AuthorID": "jeanwash",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101648/profile",
      "Content": "Sep 1, 2017 07:48PM jeanwash wrote: Farawaytoo, so sorry you ended up here with us. But I just want to let you know that the first part is the hardest. Once you get more info and plan of action down it gets much better. I had core biopsy on left breast (idc, dcis) and then MRI guided biopsy on right ( clear). So I ended up with uni mx and used prosthesis for 7 years until Diep reconstruction. So it is good to try to get as much information before any drastic decisions. I almost go a double mx but decided to keep the good breast and so so glad I did. Wishing you good news in all your procedures, tests and peace in your decisions",
      "MessageIndex": 6,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/858371",
      "Title": "IDC in 40 yo, have a date for lumpectomy/SNL biopsy FarAwayToo FarAwayToo"
    },
    {
      "AuthorID": "jeanwash",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101648/profile",
      "Content": "jeanwash wrote: I had biopsy day before yesterday.  Told I have IDC, 7 cm, Grade 2.  Bio-markers not available.   My surgeon is top breast surgeon in the area.  But since the radiologist called me with the pathology results I have not been able to communicate with the BS.   I finally got a call back from his nurse. I already communicated my wish for bilateral mastectomy and no reconstruction.  Doctor will be back Tuesday, but cannot see me until June.  After that he will schedule surgery 3 week in June.  Said it does not matter -- as long as surgery is within 3 months.     IS THIS NORMAL?   No one even knows how aggressive this cancer is.  OR if I should do chemo first ---  I am really panicked.   What if this spreads before surgery?    Is this a normal exchange between doctor and patient. Seems so non-chalant.   While I am going crazy with worry since I truly believe the biopsy itself can spread cancer.  I am reading too much and head spinning now.   Dx 5/6/2010, IDC, <1cm, Stage I, Grade 2, 0/9 nodes, ER+/PR+, HER2- Surgery 5/28/2010 Mastectomy: Left Hormonal Therapy 7/15/2010 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Surgery 7/27/2017 Reconstruction (left): DIEP flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/752347",
      "Title": "Dx yesterday and really in panic jeanwash jeanwash"
    },
    {
      "AuthorID": "jeanwash",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101648/profile",
      "Content": "Jun 4, 2010 08:40PM jeanwash wrote: I just wanted to provide an update here.  I had left mastectomy a week ago and just received the pathology report.   Much, much better than antcipated.   No remaining IDC was found at all (the 3mm at biopsy was the extent of the IDC).  DCIS was 1.1cm.     The breast surgeon said only tamoxifen is required-- no further treatment.   Hurray! Thank you all for the support you have provided.  You ladies rock! -Jean",
      "MessageIndex": 6,
      "PostDate": "04/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/752347",
      "Title": "Dx yesterday and really in panic jeanwash jeanwash"
    },
    {
      "AuthorID": "jeanwash",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101648/profile",
      "Content": "Aug 27, 2010 12:53AM jeanwash wrote: There is nothing more powerful than a mother's prayer and love for her kids.   I am happy for you and your family and I wish you many, many, many more milestones.  ",
      "MessageIndex": 2,
      "PostDate": "27/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/757273",
      "Title": "5 years out lexi4 stacys_mom"
    },
    {
      "AuthorID": "jeanwash",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101648/profile",
      "Content": "May 31, 2010 11:45AM jeanwash wrote: Well I now have 1 breast.  I had the mastectomy on my left breast on May 27th.   But ironically --I FEEL GREAT!!   I am so glad to have the cancer breast gone.  I sentinel node biospy was negative.  I will be getting the full pathology report in 4 or 5 days.   I am still in a bit of euphoria since this was not at all as stressful as I anticipated.  I have had zero pain from day of surgery until now (not one single bit... I am simply amazed!).  It is 4 days later and I am not on any pain killer and have no pain at all.   My arm is a little stiff but I have full range of motion with all the daily arm exercises I have been doing.   I do not find my body disgusting or weird with one breast -- even when I shower and look in the mirror.     After the first day of surgery I have been wearing a padded camosile so you can't tell from the outside that I have only one breast.   I have my drain in the pocket of the camosile so I just look normal and also feel normal.   I should be getting my drain out in a few days and can start wearing mastectomy bras.    I just want everyone to know that this is so doable.  I think life after mastectomy will be just fine.   But best of all I have been eating well and exercising since diagnosis 4 weeks ago and feel better than I ever have in a long time.   The stress I had when first diagnosed has rolled off me and I am now taking charge living well.  I will keep you all posted on the pathology report and my treatment plan.  Thank you for you well wishes through this all. ",
      "MessageIndex": 13,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/752312",
      "Title": "Biopy yesterday- today I am a cancer patient!! jeanwash msphil"
    },
    {
      "AuthorID": "jeanwash",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101648/profile",
      "Content": "May 26, 2010 11:33PM jeanwash wrote: After talking to 4 different breast surgeons and an additional MRI biopsy on the opposite breast (benign!!!)--- I will be having my mastectomy TOMORROW on the cancer breast.  I did not have the energy or focus to visit plastic surgeons -- so I will not have any reconstruction at this time.  I just cannot talk about a new breast when no on can tell me the precise nature of the cancer until after surgery.   I want to focus on treating the cancer first and then get around to reconstruction.   I have told my husband, kids and mother and sister and best friend.   But no one else knows at work or socially at all.  I just cannot bring myself to talk about it.  If I need chemo I am going to try to pull it off without telling anyone else. I don't care if they guess at it, but I just don't want cancer conversations to dominate my work and social life.  Is this odd?   Well wish me well on the mastectomy.  I am nervous, but feeling more in control now that I have a plan of action.  I have IDC, but mostly DCIS.  My cancer is 100% ER+ and 80%PRpositive and HER-.   Do you think I can get away with just getting rid of my ovaries and hormone treatment.  I am very nervous about chemo or radiation... but I so want to be here for my kids that I will do it all if it gets the cancer out.     I have also gone on a strict clean diet.  Nothing packaged--only fresh fruit, vegetables and organic chicken.  Only drink water with squeeze of lemon juice, nothing else.   I have also started fast walk 30-50mins per day.  I am so determined to beat this... just don't know if all of this helps.   If nothing else I feel better and sleeping a little more at night.",
      "MessageIndex": 9,
      "PostDate": "26/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/752312",
      "Title": "Biopy yesterday- today I am a cancer patient!! jeanwash msphil"
    },
    {
      "AuthorID": "jeanwash",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101648/profile",
      "Content": "jeanwash wrote: IDC and DCIS in left breast.  Grade II.  Microcalcification areas cover 7.5 cm.  Now what?  I am calling my breast surgeon tomorrow, but want to go straight to surgery for bi-lateral mastectomy as soon as possible.  Anyone get surgey within a week of dx.  They want me to take tests, MRI etc.  but I just want to go to surgery first. Dx 5/6/2010, IDC, <1cm, Stage I, Grade 2, 0/9 nodes, ER+/PR+, HER2- Surgery 5/28/2010 Mastectomy: Left Hormonal Therapy 7/15/2010 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Surgery 7/27/2017 Reconstruction (left): DIEP flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/752312",
      "Title": "Biopy yesterday- today I am a cancer patient!! jeanwash msphil"
    },
    {
      "AuthorID": "jeanwash",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101648/profile",
      "Content": "Jun 4, 2010 11:34PM jeanwash wrote: I had my post-op visit today (8 days after mastectomy).    The doctor shared the pathology report which seemed too good to be true.   They were unable to find any IDC in the breast at all-- so the assumption is the 3mm IDC removed at biopsy was the full extent of the IDC.   There was a 7.5 cm areas scattered across the breast with microcalification -- but turned out to be only 1.1 cm DCIS.  The rest was all benign microcalcifications.   Very, very wide margins with mastectomy.  Ended up removing 9 nodes -- all negative.     In fact, my doctor said no further treatment is warranted except tamoxifen to help protect my remaining breast.   Wow!  The doctors even went back and reviewed all my films and reports to see why they antcipated more than they eneded up seeing.   Whatever...  I am just so happy.    Maybe now I can start thinking of my reconstruction.  We still we follow up with medical oncologist to make sure he/she agrees with the breast surgeon.  I am forever grateful to all of you for providing support in the midst of my despair.   -Jean",
      "MessageIndex": 15,
      "PostDate": "04/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/752312",
      "Title": "Biopy yesterday- today I am a cancer patient!! jeanwash msphil"
    },
    {
      "AuthorID": "jeanwash",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101648/profile",
      "Content": "Jul 9, 2010 06:46PM jeanwash wrote: i had same thing.   read somewhere that it was the lymph channels tightening.  I gave myself a deep massage along the rope and there was like a click feeling and the rope dispersed like magic and my range of motion returned. It kept trying to come back so i did the massage every morning and night nd  eventually it just went away.  The massage can be very painful but only until it loosens.   i think doctors dont know about this because some dont even tell them..like myself.   I knew i would just be refered to therapy so i decided to do my own massage.   It really works... as welll as stretchingg against the pain of the rope feeling.   wish you all the best.  Jean",
      "MessageIndex": 26,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/753747",
      "Title": "rope like tendon? becky1 jeanwash"
    },
    {
      "AuthorID": "jeanwash",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101648/profile",
      "Content": "Sep 2, 2017 07:57PM - edited Sep 3, 2017 09:11AM by jeanwash I too was 7 years from uni mx no reconstruction. The prosthesis was fine for the most part with the one main exception being bathing suits. I finally was ready for reconstruction this year. I had completed 5 years of tamoxifen and additional 1.5 years of taking no medication. I am 5 weeks from Diep reconstruction and feeling great. I am so glad I kept my good breast because it was such an emotional boost to have an original and it helped anchor the prosthesis breast form. I will have a breast lift on good breast in a couple of months... but in a genie bra the Diep breast already pretty much matches my good breast. Thanks to my wonderful PS Dr. Alghoul for really beautiful handiwork. The idea of surgery had really scared me but in the end was way better than my fears. Living flat for so many years on one side was doable and I could have managed easily for many more. However, now having anew soft breast that matches my original is great. I know that I still will have to get mammograms on good breast but worth it for me since original diagnosis was veryearly stage.",
      "MessageIndex": 28,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/857476",
      "Title": "Uni or Bitateral Mastectomy if I'm not planning reconstruction justbeatgeno jeanwash"
    },
    {
      "AuthorID": "jeanwash",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101648/profile",
      "Content": "Sep 16, 2017 10:51AM jeanwash wrote:",
      "MessageIndex": 21,
      "PostDate": "16/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858290",
      "Title": "Nothing after Surgery??? GreenEyes81 Irony"
    }
  ]
}