{
  "AuthorID": "Jeansbeans",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
  "Posts": [
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Apr 4, 2009 04:16PM Jeansbeans wrote: Hi, Please DO NOT IGNORE any lumps , bumps or anything that gives you worry.  I would highly recommend a Breast MRI.  I had an MRI done and mammo on the same day. Mammo came back clean and MRI picked up  2 areas of IDC. So please Be PROACTIVE!!!  I am quite shocked that a mother would say the things that she did! Did you MOM have BC?  If she did how can she act that way? Think only of your health. Good Luck, Gentle Hugs, Jeanie",
      "MessageIndex": 10,
      "PostDate": "04/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/730848",
      "Title": "Help- Mom thinks I'm crazy? floridian floridian"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Aug 25, 2008 05:36PM Jeansbeans wrote: Hi Zoe. I too was diagnased with Invasive ductal carcinoma. My spots were picked up by Breast MRI. I had a mammo done the same day and that was clear.  I had 2 areas 1.2cm and .05cm.  no nodes were cancerous and I was a stage 1 grade1. I Do not need chemo or radiation, I have to take tamoxifen for 5 years. I feel I was very fortunate by catching it so early. I was told a mastectomy was the only way to go since there was 2 areas and the amount of tissue removed would be alot anyways. Because of my stromg family history{ I am now the 4th generation of women} I had a double mastectomy with tissue expanders placed, so now I am going through the reconstruction phase. I wish you luck and many prayers are for you. Please keep us posted with your  results.  Jeanie ",
      "MessageIndex": 4,
      "PostDate": "25/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/720083",
      "Title": "Recently diagnosed Zoë Jeansbeans"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "May 7, 2009 03:20PM Jeansbeans wrote: HI, I am just so sad for you and your daughter and husband, I cannot believe breast cancer can strike someone so young.  My prayers are going out to you. Have you considered calling the MAYO CLINIC or St. JUDES for a second opinion?  Please keep us posted. Gentle Hugs are sent your way! Jeanie ",
      "MessageIndex": 219,
      "PostDate": "07/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732491",
      "Title": "HELP! 10 year old with bc cjsocal Mary-Lou"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Jul 2, 2009 04:21AM Jeansbeans wrote: Hanna, HAPPY BELATED BIRTHDAY SWEETIE !!!!!!!!!!  Hope each day brings you closer to feeling stronger and healthier!  Loving Hugs and thoughts are sent your way for you and Your family. You are an inspiration to all of us!! Gentle Hugs, Jeanie",
      "MessageIndex": 368,
      "PostDate": "02/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732491",
      "Title": "HELP! 10 year old with bc cjsocal Mary-Lou"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Apr 10, 2011 06:52PM Jeansbeans wrote: Honey, Please realize that this is such a slow process. I an now celebrating my 3rd yr Anniversary. Bilat. Mast.  May 2008. Tissue Expanders for 10 Months.. OUCH!!!! Much pain and discomfort until you realize, It is this or NOTHING,{ meaning a prosthesies  }, Just take your fills really SLOW , No hurry. Your comfort level will be so much better if you do 30-50  fills at a time. Once your drain tubes are removed, everything will feel much better from then on as long as you go SLOW for your fills!!!  I wish you best of luck and send you many Hugs!!  Jeansbeans",
      "MessageIndex": 4,
      "PostDate": "10/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767313",
      "Title": "Much pain 4 days post-surgery - is that normal? Fearless_One Fearless_One"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Sep 21, 2008 02:28PM Jeansbeans wrote: Hi Skye, I am very concerned  for you. Have you considered a BREAST MRI?  My BC was picked up with a MRI. I also had a mammo done the same day, which came back clear!  My DR. told me the cancer would NOT show up on  a mammo for Years! So. Please. Talk to your Dr. about a MRI.  I also have very strong family history with BC, My Mother, My Grandmother, My Greatgrandmother, also 3 blood cousins who share same Grandmother!!  I am 54 amd had no problem with my decision with double mastectomy. I was fortunate my cancer was caught early, No nodes and have to take Tamoxifen for 5 yrs. I had to fight for 3 mo. to get Ins. Co. to pay for MRI. But. finally, after I called and spoke to a supervisor and explained my family history and the ages  we all were in our 50's, They finally approved the MRI. The rest is history!  So, Be your own advocate!  Fight for a MRI!  They are a more accurate way to diagnose Breast Cancer.  Good Luck to you and keep us posted on your results. Gentle Hugs to all. Jeanie  ",
      "MessageIndex": 4,
      "PostDate": "21/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/721527",
      "Title": "Just need to vent Cessairskye leaf"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Mar 18, 2009 04:53PM Jeansbeans wrote: Hi worried000, First of all, take a deep breath an relax.  You are so right to be proactive about your health!  I think you were smart for seeing different Dr's for a second opinion. NEVER let a Dr. tell you  that you are wasting their time.  If they tell you that, then it is time to find a new Dr.  Have you tried talking to a female GYN.?   Does Breast Cancer run in your family? Talk to your Dr. about a Breast MRI.  I know Ins. co. don't want to pay for MRI's unless you are high risk.  Do Let me know how you make out, Please don't worry yourself sick,  fatty lumps are so common in our breasts. Prayers are flying your way. Hugs, Jeanie",
      "MessageIndex": 1,
      "PostDate": "18/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/730960",
      "Title": "worried re breast lump worried000 worried000"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Sep 21, 2008 08:53PM - edited Sep 21, 2008 08:54PM by Jeansbeans Hi 1cathi, MY , you have had alot of tests and waiting!  Have you considered a Breast MRI?  Detects much more than mammo and ultra sound.  My BC was picked up with a MRI. I had mammo done same day that came back clear. [I am 54]  I also have a friend who 's story sounds much like yours. Her final decision after many years of biopsys and mammos was to have a double mastectomy before she actually got bc and then might need chemo. She was 60. It is a personal decision to make and you need a strong support group.  I laid on my stomach for my MRI guided biopsy, my boobs were in a little hole on the table  My head was down the whole time.  The radiologist numbed me up so it was not too bad.  You will do fine, but, ask your Dr if you don't understand the procedure.  I hope you keep us posted on your results.  Good luck to you, and gentle hugs. Jeanie",
      "MessageIndex": 27,
      "PostDate": "21/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/720614",
      "Title": "NOW I AM SCARED 1Cathi Jeansbeans"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Mar 18, 2009 07:35PM Jeansbeans wrote: HI BJ09, chekwa First of all You are both doing the right thing in being proactive with your health. I was dx with Invasive ductal carcinoma of the left breast in May 08.  I had a very strong risk do to family history, { My Mom, a 30 yr. survivor@ 86 yrs. old. My grandmother , and Great grandmother both dx in their early 50's}  So, because of my fear of getting BC I INSISTED on a breast MRI, Well, Guess what, I had a mammo and MRI on the same day, The mammo was clear, but the MRI showed 2 areas of IDC !  So I am so happy your Dr's are doing an MRI. You will be in my thoughts and prayers, I know the waiting can be stressful, Please let us know the results of your tests, I am sure everything will be just fine.  Hugs, Jeanie     ",
      "MessageIndex": 13,
      "PostDate": "18/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/730333",
      "Title": "worried with these symptoms.. chekwa LynnW"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Sep 11, 2008 08:11AM Jeansbeans wrote: Hi cp418, Tell your friend she will have to FIGHT, Fight, FIGHT for her MRI. Ins. Co. don't want to pay, But if you get persistant and call plus have Dr. write letter and call she may get results. Make sure they know the strong family history.  I am now the 4th generation with BC. MY mom, my Grandmother and Greatgrandmother!  I am 54 now, But at 53 I fought for a MRI because all of the women in my family who had BC were  in their early 50's. So, after 3 months and 2 denials, they finally approved an MRI. Good thing too!  I had a mammo and MRI done the same day.  MY mammo was clean and my MRI showed 2 areas of cancer.So,  in May I had double mast. with tissue expanders placed.  Because  the bc was caught so early, no nodes, I am blessed to not need Radiation or chemo, just tamoxifen for 5 yrs.  I also had the genetic testing done to see if I carry the gene, I DO NOT!  MY INs. paid for that test!  It cost about $3300. if you have to pay put of pocket. Then, If  there are children, they can have the testing done for around $ 330.00.  Be your own advocate and fight for a MRI!!  Talk to a supervisor or Medical director of your INS. Co. Don't take NO for an answer.  WE women need to push for MRI's. they detect the cancer so much earlier. Good Luck . Keep us posted. Jeanie",
      "MessageIndex": 3,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/720332",
      "Title": "Insurance coverage for MRI if family risk cp418 tykikibuds"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Apr 11, 2009 01:53AM Jeansbeans wrote: Wabiarts, I am sorry you have to go through this alone and sorry you had to join us on our journey, but know you can depend on us for help and advice.. How about family members?  Close friends to stay at least the 1st week.  I don't want to scare you, but I do want to prepare you.  I had Bilat mast with Tissue expanders expanded to 400cc's at time of surgery!  BIG mistake!!  I was in such pain from the tissue and pecroral muscle streching so fast I had to have some saline taken out, then I went VERY SLOW with fills. 30-50cc's every other week . My final fill was 600cc's for a 550cc implant, It took almost 6 months to do my fills. There is no hurry. Most TE are in for 8-10 months. Now, here is what I did to help me so I didn't have to put my hands over my head to put on a top.  I bought myself alot of strechy tops that I could step into and pull up. prefrably babydoll style , so your tubes won't show, not that you'll be going out too much, only to Dr's. Also, you won't beable to sit up from a laying position by yourself at first.  I had  my husband push me up until my muscles became stronger.  You'll need to sleep with tons of pillows. You won't be able to do simple tasks such as taking the top off a pill bottle. cutting up vegetables, lifting, and driving is hard at first, you'll need some one to drive you . My husband cleaned my tubes, but, I probably could manage myself if I had too.  The draines were cleaned 3 times a day, and you have to measure the fluid. No showers at first. I sat in a tub with a little water and took sponge baths.  Can you talk to your patient advocate at the hospital to arrange a nurse to stop in and give you a hand once or twice a day? Check out the BREAST RECONSTRUCTION forum and scroll down till you find \" CONTINUED TISSUE EXPANDER PAIN\" There you'll find many wonderful women going through what you will be experiencing.  You will NOT be alone!  Make sure you do the exercices they give you to help with your arms .  Walking your fingers up the wall.  Everyday will get better.  There is a picture forum you can visit so you can see what your expanders will look like . You have to Private message Timtam and ask permission to access the site, once she checks you out and approves, she'll tell you how to get in. It is a wonderful site with many wonderful ladies .Please keep us posted on how you are doing.  We are all here for you, Gentle hugs, Jeanie      ",
      "MessageIndex": 10,
      "PostDate": "11/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732214",
      "Title": "I LIVE ALONE - post bi lat mast help? wabiwoman Jeansbeans"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Apr 4, 2009 05:02PM Jeansbeans wrote: Hi Everyone, My daughters and son ages 32,31,29.  I am 4th generation with BC, My mom is now almost a 30 year BC survivor!! She was 57 when dx. my grandmother  died at 53 and my Great grandmother died at 57 of bc. Because of the strong family history I decided to have a Breast MRI done. It took my DR. and myself 3 months of phone calls and letters to Insurance Co., But they finally approved it.  Well. Good thing I did because I had a Mammogram done the same day as the MRI.  My mammo was clean, but the MRI showed 2 areas of IDC.My dh and I flew out to the Mayo Clinic. where I had bilat. mast. with tissue expanders. While there I had genetic testing done, I do not have the BRCA gene, but something is definatly going on that had not been discovered yet.  MY main concern was for my children!  I was told they should start mammos 10 yrs.prior to my DX I was 53 when dx, so that means They don't start till they are 43.  I  told my girls to see their Dr's for mammograms NOW!!!  And an MRI if Ins will pay.  They are as worried as I am .  The only thing we can do as mothers is to keep on top of things and educate our children . MRI's are not recommended unless their are 2 , 1st degree relatives with bc.  If I hadn't been persistant with having an MRI done, I would still be sitting home while cancer was spreading through me.  MY Dr told me it would take years for anything to show up on Mammo.  Gentle hugs to all you wonderful ladies!  Jeanie  ",
      "MessageIndex": 6,
      "PostDate": "04/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/731797",
      "Title": "What's in store for our young daughters? pinkshortcake Carolina59"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Apr 3, 2009 07:46PM Jeansbeans wrote: HI Everyone, What you are experiencing is very normal for just having your surgery,tissue expanders in. I was 8 weeks before I felt halfway normal.  Do SLOW with your fills , 30-50cc's everyother week, that is the key to being comfortable .My drains were in for 3 1/2 weeks . I thought it would never end!  I am now 2 months post exchange to 550cc's implants. Your day will come too. Have you gone to BREAST RECONSTRUCTION FORUM?  Go to CONTINUED TISSUE EXPANDER PAIN, There you will find so many wonderful ladies going through the same thing.There is also a thread for girls with their exchange dates calles \"EXCHANGE CITY\"  Take care and don't overdo.  Gentle Hugs, Jeanie",
      "MessageIndex": 32,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730777",
      "Title": "bil/mas with t/e, when will I feel comfortable again? jpixstix JanMarch"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "May 20, 2009 02:39AM Jeansbeans wrote: Geena, Praying for you on your upcoming surgery! Please keep us posted!  Gentle Hugs, Jeanie",
      "MessageIndex": 25,
      "PostDate": "20/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732214",
      "Title": "I LIVE ALONE - post bi lat mast help? wabiwoman Jeansbeans"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "May 7, 2009 09:25PM Jeansbeans wrote: Hi, Please let us know how you are handling everything? How are you feeling?  Just concerned!  Gentle hugs, Jeanie",
      "MessageIndex": 16,
      "PostDate": "07/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732214",
      "Title": "I LIVE ALONE - post bi lat mast help? wabiwoman Jeansbeans"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Jul 2, 2009 11:46AM Jeansbeans wrote: Hi Geena, I am a bit behind in my posts but I wanted to let you know I am glad it is over for you and sorry for your complications, Now you can consuntrat on healing and getting stronger.  You must have a GREAT brother to step in and help like that. Happy healing and Gentle Hugs, Jeanie",
      "MessageIndex": 34,
      "PostDate": "02/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732214",
      "Title": "I LIVE ALONE - post bi lat mast help? wabiwoman Jeansbeans"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Mar 18, 2009 07:13PM Jeansbeans wrote: Hi taraleec, Wow, I can see why you are confused!  Have you thought about a Breast MRI?  If you can't get a straight answer from your Drs. Be persistant. I hope all your tests come back clear. Keep us posted, sending hugs your way. Jeanie",
      "MessageIndex": 3,
      "PostDate": "18/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/730837",
      "Title": "Confused taraleec Jeansbeans"
    },
    {
      "AuthorID": "Jeansbeans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69067/profile",
      "Content": "Oct 12, 2008 11:10AM Jeansbeans wrote: Hi rrs. Not only am I a bc survivor, just dx in may, Bilat mast, with tissue expanders, But, I have also been a dental assistant for 35 yrs. Just to ease your mind,  When you walk into the op. and are seated, then the Dental Assistant should glove up. Everything has been presterilized, chair xray unit all drawers including the button she clicks when she walks out of the room to take an xray. She should never leave the room with her gloves on, except the xray. All intruments used are sterilized and are in a specially marked bag for each new patient.  If she is well trained, there should be no cross contamination.  Don't hesitate to ask her to put on new gloves if you feel it is in your best interest. Also , about the mitrovalve prolapse. The American Heart Assoc. had NEW guidlines now.  They do NOT recommend Premed with antibiotic for mvp or heart murmurs, Only if there are arificial valve replacement, and knee and hip replacement surgery.  Hope this bit of info helps.  Good Luck to you, and genrte hugs to all  Jeanie",
      "MessageIndex": 23,
      "PostDate": "12/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/718809",
      "Title": "Dentist visit - gloves - is it me? rrs Jeansbeans"
    }
  ]
}