{
  "AuthorID": "jeandavis",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153118/profile",
  "Posts": [
    {
      "AuthorID": "jeandavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153118/profile",
      "Content": "jeandavis wrote: My breast hurt a lot lately (both). My left is a lot bigger than my right and hurts more. I have swollen lymph nodes in my neck. I dont know if i have peau d'orange or are they just pores of my skin but they are only on my left breast. I do not have a rash but blotchiness on my left breast. Both breast are warm to touch. Last year i had a bruise near my armit and breast but it was literally almost on my breast you can say. The bruise till this very year has not disappeared. My right breast feels extremely hard. January 2012 and feb 2012 i had a burning stabbing pain in the breast and my nipple skin would peel off. My breast randomly have a full heavy feeling and have grown without me even gaining weight. Im 18 years old. My sister says there a possiblity that young girls can get it her friend/coworker has just lost her battle with IBC at the age 29 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/788428",
      "Title": "18 years old IBC symtoms jeandavis jeandavis"
    },
    {
      "AuthorID": "jeandavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153118/profile",
      "Content": "Jun 2, 2012 03:07AM jeandavis wrote: Rob i too live near the chicago land area",
      "MessageIndex": 5,
      "PostDate": "02/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/788428",
      "Title": "18 years old IBC symtoms jeandavis jeandavis"
    },
    {
      "AuthorID": "jeandavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153118/profile",
      "Content": "Jun 2, 2012 11:10AM jeandavis wrote: Orland Park",
      "MessageIndex": 7,
      "PostDate": "02/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/788428",
      "Title": "18 years old IBC symtoms jeandavis jeandavis"
    },
    {
      "AuthorID": "jeandavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153118/profile",
      "Content": "Jun 2, 2012 01:20AM jeandavis wrote: Im 18 years old and my sisters 29 year old friend had just lost her battle with IBC im thinking i should get my self checked seeing young girls can be diagnosed with IBC",
      "MessageIndex": 1,
      "PostDate": "02/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/788428",
      "Title": "18 years old IBC symtoms jeandavis jeandavis"
    },
    {
      "AuthorID": "jeandavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153118/profile",
      "Content": "Jun 2, 2012 01:51AM jeandavis wrote: How do i tell the difference between peau d'orange and pores of the skin (my chest is sorta hairy). My moms trying to tell me that its not blotchiness but acne instead and she believes my breast arent warm enough. right now my breast feel cool just like the rest of the body. Jan 2012 my nipples were burning and the skin was peeling and that was the last time that happened. Where on the neck am i suppose to have the swollen lymph nodes to know for sure? My grandmother had gone through breast cancer at the age 67 but fought it off early. Both sides of my mom and dads family have hormonal imbalance it runs it the family. My mom and dad both have thyroid problems. As a teenager my dad was diagnosed with hyperthroid and my mom was diagnosed with hypothyroidisim in her 30s. I went to the doc and they did a test on my ovaries and said i had a lot ovarian cysts. M sister has hirsutism. The only thing im scared of is i have numbness some times in my feet which i hear is a symtom of IBC is this true?",
      "MessageIndex": 3,
      "PostDate": "02/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/788428",
      "Title": "18 years old IBC symtoms jeandavis jeandavis"
    },
    {
      "AuthorID": "jeandavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153118/profile",
      "Content": "Jun 2, 2012 03:06AM jeandavis wrote: im longer with my parents medical plan becuase i turned 18",
      "MessageIndex": 4,
      "PostDate": "02/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/788428",
      "Title": "18 years old IBC symtoms jeandavis jeandavis"
    }
  ]
}