{
  "AuthorID": "JellyShoes",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
  "Posts": [
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 20, 2010 01:44PM JellyShoes wrote: About waiting for MRI results..... At the hospital where I had an MRI done (for my foot, not for anything breast related), my orthopedic surgeon said I would get results in a week and a half.  I went to the radiology department the day after my procedure and requested a copy of my images and report so I could get a second opinion. The report was already ready (1 day after the MRI) and they had images for me to take to my second opinion surgeon the next day. So you might be able to get the MRI report directly from the radiology department. (Of course, reading and understanding that report, and figuring out what it means for you is a different story. My orthopedic surgeon and the radiologist disagreed and discussed and the surgeon made the radiologist change something in the report.) I still liked getting the report in my hands as soon as possible. Just an idea...not sure it's a helpful idea....but 3 weeks of waiting is crazy-making for sure! Sue",
      "MessageIndex": 14,
      "PostDate": "20/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760265",
      "Title": "How are IBC symptoms different from an infection in the breast solasola leaf"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 20, 2010 04:11PM JellyShoes wrote: Oh, that explains at least part of the three weeks. I hope you can get answers faster than that. It's a long time to wait (as I'm sure I don't need to tell you!) Good luck! Sue",
      "MessageIndex": 16,
      "PostDate": "20/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760265",
      "Title": "How are IBC symptoms different from an infection in the breast solasola leaf"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 16, 2010 01:42AM JellyShoes wrote: I don't have an answer yet. I have a biopsy scheduled next week and will hear sometime near Thanksgiving. There's still a very strong chance that I'm fine, so I'm holding onto that hope as much as possible.  Hopefully you'll hear from other more knowledgeable folks later today about the rest of your questions!  Sue",
      "MessageIndex": 3,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760779",
      "Title": "second opinion-do i have to have another mammo for that? meme31 meme31"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 12, 2010 03:50PM JellyShoes wrote: ScarlettSue0222: (Great name by the way!) I'm still waiting to have my biopsy performed, so I'm not waiting for results exactly yet. But I am waiting. I have no idea if any of these ideas will be helpful to you, but they're what I'm trying. Things I've tried that seem to help: Things I haven't tried, but are on my list: Things I'm limiting:  So those are my lists. Maybe they'll spark some ideas in you that will fit you perfectly. I am sometimes stressed and sometimes upset. Sometimes I start thinking about what ifs. But for right now I keep trying to focus on the next few weeks until I'll have results, and trying not to worry or plan for the time after that. I hope that you get benign results and that you find peace during the time you're waiting. All my best, Sue",
      "MessageIndex": 3,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/760618",
      "Title": "1.3 cm lump in breast lymph node scarlettsue0222 JellyShoes"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 15, 2010 11:38PM JellyShoes wrote: I know a piece of an answer to your question, but definitely read what other more experienced posters will tell you as well.  After my mammogram came back BIRADS 4, with a recommendation for a biopsy, I decided I wanted to be seen at a regional hospital with a strong reputation in cancer diagnosis and treatment. I was able to get a referral from my primary care physician, collect my mammogram records from the hospital where I had the mammos done, and deliver them to the regional hospital for a second opinion. That second opinion involved the radiologists at that hospital reading the mammogram. They agreeds that I needed a biopsy, and I scheduled it at that hospital. So the part of your question that I'm answering is what I needed to do to get radiologists from a more renowned hospital to review my mammograms. I do have insurance, but with a high deductible, so I don't know the other pieces of the puzzle that you'll need to fit together. Hope this helps even a little, and I'm sure some one more knowledgeable will be along shortly to give you a better answer! Good luck! Sue",
      "MessageIndex": 1,
      "PostDate": "15/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760779",
      "Title": "second opinion-do i have to have another mammo for that? meme31 meme31"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 20, 2010 06:48PM JellyShoes wrote: I want to thank all of you so much for answering my questions thoroughly and for sharing some of your experiences. It really helps me to normalize my feelings and to feel more comfortable going into my biopsy on Tuesday. I'm a lot calmer now than I was when I asked my detailed questions. At first, when I learned that I was supposed to get a biopsy, I tended to be tearful. Now I'm in more of a cranky, irritable phase. So far I'm doing a pretty good job not unleashing my irritability on unsuspecting bystanders....so maybe that means I'm less likely to cry on Tuesday at the biopsy. I'm definitely better at controlling crankiness rather than tears. My husband will be driving me to Boston and waiting nearby during the biopsy. Then he'll drive me back home. We're definitely learning to be on each other's team medically speaking. He was nice enough to drive my mammo films down to Boston the day they were available for my second opinion, so he already knows the way. (Neither of us are good at waiting for results!!) I really can borrow Leaf's saying: I don't have to be brave. It is in my best interests, though, to show up. My plan Tuesday is that all I have to do is show up. Your advice and shared experiences really make me much more at ease about this whole process. Thank so you much for sharing. These forums are such a great resource. I did do a tiny bit of retail therapy....or preparation. I bought an inexpensive front-closing sports bra and a bag of peanut M&M's. (To me, the M&M's seem like the perfect thing to eat afterward in the car on the ride home.) If I had found little ice packs, I would have picked those up too, but I couldn't find anything tiny. Hopefully the hospital will have some for me. I remember when I got my wisdom teeth out, they gave me special tiny ice packs that were perfect for my cheeks. I hope to report back to you Tuesday night about what the biopsy was like for me, and then again when I get results. That might be as early as Wednesday if I'm really lucky, or Friday, or even Monday. I know they'll do everything possible to get me results as soon as they can. Thank you all for your sharing, encouragement and support.My fingers and toes are crossed for all of us who are having tests done this coming week. Sue",
      "MessageIndex": 12,
      "PostDate": "20/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760830",
      "Title": "Somewhat Silly Stereotactic Biopsy Questions JellyShoes JellyShoes"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 21, 2010 05:58PM JellyShoes wrote: Crescent5: Thanks so much for your info....especially the part about getting 2 done in the same day and it taking only an hour and a half. If I'm doing alright with it, that's what I'm going to shoot for too! It seems like just getting done and getting out of there would be easiest on me....rather than having a little stretch break in the middle.  Of course, if I need that break in the middle, that's OK too. Good advice on the waiting for the phone call piece of the puzzle. I'll definitely have breaks when I won't get called. Like they might call Wednesday, but won't call Thursday because it's Thanksgiving. They might call Friday, but won't call Saturday or Sunday because it's the weekend. Fortunately our phone doesn't ring all that often, so hopefully there won't be too many times when I jump to see who's calling! Thanks so much for all of the advice and support and details about what it's like. I really am feeling so much calmer knowing all of this. With thanks, Sue",
      "MessageIndex": 14,
      "PostDate": "21/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760830",
      "Title": "Somewhat Silly Stereotactic Biopsy Questions JellyShoes JellyShoes"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 22, 2010 06:52PM JellyShoes wrote: Tomorrow is my biopsy day. I'm doing pretty well today. I went for a long run this morning and then a yoga class late in the day. Those are both really calming activities.  Tomorrow we'll be up early to head to Boston. You'll probably get more updates from me than you want!  Today I noticed, as I was going through the notes from when I set up the appointment, that even though they said I might get results as early as Wednesday, I really should expect them Friday instead. It's weird how in my mind I was pretty much counting on boringly benign results on Wednesday. More tomorrow.....  And thank you all again for all of your support. It has helped so much! Sue",
      "MessageIndex": 20,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760830",
      "Title": "Somewhat Silly Stereotactic Biopsy Questions JellyShoes JellyShoes"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "JellyShoes wrote: One week from today I'll have a stereotactic biopsy for two clusters of microcalcifications. I feel like the appointments leading up to this point have prepared me pretty well for what will be happening to my breast in the procedure. Now I have questions about the rest of me!!! I know I'm supposed to lie still for a long time...but I'm trying to figure out how still. 1) Are you allowed to talk during the biopsy? If so, is it just in case of a problem, or do they ever try to keep you distracted by talking a lot? (For example, at my last gyn visit, we were talking about hiking in Glacier and grizzly bears for almost the whole appointment....definitely distracting!) 2) Sometimes to calm down I like to breathe deeply. Will that be OK or will that somehow count as moving around and mess things up? 3) It's possible that I might cry a bit during it. (I've cried in doctor's offices many times over things less difficult than this....even at the dentist sometimes.) If I do cry what will happen? Will I be lying there in a pool of tears? Can I wipe my eyes & nose? Will the technician who's in the room help if that happens? And hopefully a few tears can flow without that counting as moving around too much, right? Told you my questions were somewhat silly! But it will help me put my mind at ease if I know what to expect about these things. Thanks for any light you can shed on the subject. I appreciate these forums and all of you so much right now! Sue Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760830",
      "Title": "Somewhat Silly Stereotactic Biopsy Questions JellyShoes JellyShoes"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 12, 2010 07:30AM JellyShoes wrote: Hopefully the soreness will at least start to subside today. (I have no idea what it's like, so I don't know how long it's expected to last.) I see that you posted earlier in this thread that your results will be available Tuesday or Wednesday. I know with the rational side of my brain that it's good for everyone to get weekends off, but the way weekends off make waiting for results stretch out longer is difficult when you're waiting. I secretly hope you're doing something enjoyable and calming this weekend. (Of course, I'm not sure there's anything I find distracting, calming or enjoyable enough for circumstances like these....so no pressure.) Sending you all the peace, calm, and hope I can muster. Take care, Sue",
      "MessageIndex": 19,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760054",
      "Title": "I am so stressed out!!!! dmho Lawleigh"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 10, 2010 08:24PM - edited Nov 10, 2010 09:42PM by JellyShoes Good luck! I will be hoping for the best for you tomorrow.  Sue",
      "MessageIndex": 11,
      "PostDate": "10/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760054",
      "Title": "I am so stressed out!!!! dmho Lawleigh"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 11, 2010 12:11PM JellyShoes wrote: Checking back to see how you're doing...but you're probably still there.  Sending thoughts and prayers! Sue",
      "MessageIndex": 17,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760054",
      "Title": "I am so stressed out!!!! dmho Lawleigh"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 23, 2010 07:37PM JellyShoes wrote: Short version: I had my two stereotactic biopsies today. Through the combined effects of all of your info beforehand, and Xanax, I was very, very calm. No tears. No nervousness. And barely any discomfort. My mammograms leading up to this were more painful. Phew!!! 48 hours til I can resume normal activity - meanwhile I have restrictions on showering, submerging in water, strenuous exercise, lifting anything over 8 pounds, and taking Aleve or anything else that thins blood. Results expected in 3-5 business days.....solidly into next week. Longer book-length version: (Just in case some future person who is totally terrified of medical procedures happens across this topic some day.) I had been really nervous before this procedure, and have a slight medical phobia, so I wasn't sure how I'd react. The only time I felt really nervous today was when we first arrived at the hospital about half an hour early. It was so big and full of patients and people in scrubs. My little local hospital really keeps those things hidden. We ended up going outside for a walk and that helped settle me down. Then we headed to the imaging center to check in and wait. When I left my husband in the waiting room, I was taken back to a changing area for the usual johnny with ties in the front. Then from there into the stereotactic biopsy room. The intake person asked me a few questions, mostly making sure I was the right patient and that I hadn't taken any blood-thinning drugs including aspirin and Aleve in the days leading up to the biopsy. She left and a technician who stayed with me the rest of the time came into the room and introduced herself. She had me go up two steps to lie on the table. I took off my shoes thinking that would be more comfortable. I said, \"Oh will my head be on that pillow.\" She said, \"No, that pillow is kind of false advertising. You won't be using it.\" The table is slightly padded (maybe 1/2 an inch of firm foam). And, of course, to make it all nice it's sort of a mottled pink color. The hole in the table is pretty much in the middle of the table and is about 9 inches in diameter. She told me to lie with my right arm next to my side. The area around the hole in the table had some folded up sheets for a little more padding. All the people who said your neck and shoulder get uncomfortable were right. Somehow the way the table is shaped - it is curved, but not in a way that makes it comfortable for you - makes it so there's a lot of weight on your face, cheek and neck. It wasn't ridiculously bad, but seems like they could do better with that. I also paid attention to how much pressure was on my ribs around that hole. In certain positions I could feel a lot of pressure with the edge of the hole against my ribs, but I was able to find a way to make that comfortable. I ended up facing the wall because that was more comfortable for my neck. There was a picture at about face level down near my feet. But about 3 feet in front of me there was grey wall and a fuse box. The interior decorator in me could have done something a little better with that room! I had two clusters of microcalcifications they wanted to biopsy. The first was the more difficult, very near my chest wall. Almost immediately after I was on the table, a doctor came in and introduced herself. She was with me the rest of the time too. She positioned my breast, took images to see how the calcifications were positioned. They ended up repositioning and taking images 3 times until they got things set up the way they wanted. The compression was really gentle compared to the mammograms I had two weeks ago that started this whole process. So that was nice. After I was positioned, they cleaned my skin, then injected anesthetic. That wasn't bad. I felt the needle start and just breathed maybe 2 or 3 breaths and it was done. They told me I shouldn't feel anything but tugging or pressure after that. If I did feel anything I should tell them. There is a fair amount of noise in the room. There's some kind of loud air-circulation system going. Plus the people performing the procedure are saying things about needles and where they are in the procedure and consulting on how they're going to take the sample (like what angle they'll go in with, etc). When it was time for the popping noise, the tech said \"I'm going to put my hand on your right shoulder. You'll hear a pop. It's important that you don't move.\" That went fine. Then the radiologist came in and introduced himself. I had my head turned to the wall and it's pretty hard to talk with your face on its side against the table, so I said hi, but that's all. He said \"We're going to take samples now.\" I heard 6 sounds, maybe like a teeny tiny vacuum sound. I didn't feel anything. The tech said, \"I'm going to leave the room and run down the hall to X-ray the samples to make sure we have what we're looking for.\" She was gone for a minute or two. Then they positioned the marker, which is the size of the tip of a ballpoint pen. The radiologist left. The other doctor cleaned the wound, which stung a little (but just a little.....I'm a pain wimp and it wasn't bad at all.) Then she applied pressure. That hurt and I said so. She eased up a little but said she was applying pressure to reduce any bruising. I told her it was worth it in that case, but that I wanted to tell her it hurt. So that was the end of the first biopsy. It was about 45 minutes from when I left the waiting room until that was done. They told me I could get up and stretch, but I said if it meant I could go home earlier, I'd rather just keep going. I did cover my left shoulder up a little more with the blanket and kind of curled the blanket around my left hand. (I secretly liked to move my left hand just a tiny bit to prove to myself that I could. The anarchist in me had trouble with the \"lie totally still for an hour\" part of the procedure.) They said, \"Absolutely, let's keep going.\" When the radiologist came back, he asked, \"How are you doing Ms. JellyShoes?\" I said, \"Um, I'll be doing better when I can go home!\" The second sample was easier all around. They got the position correct on the first try. They repeated everything, cleaning, injection, etc. This time I heard 9 of those suction sounds. When the tech came back after X-raying them, she said \"7 out of 9\". I think that must mean something about what those samples looked like....maybe 7 contained calcifications, or 7 were good. This time the cleaning up afterward barely hurt and when she applied pressure to the wound it didn't hurt. The second one went faster than the first. It was done in probably half an hour. After a few minutes they had me turn on my side (and I finally got to use the pillow!!!) so they could apply steri-strips and bandages. They asked me how I was doing and I told them it really wasn't anywhere near as bad as I expected. I told them I'm super wimpy about medical things and they said \"Oh no, you're not a wimp. Believe me, we see people, cry, jump, scream, yell. You did great with it.\" I really did do great with it, at least while I was there, but I reserve the right to be super wimpy medically any time I need to be!!! My medical freaking out tends to happen when I least expect it, so since I expected the worst today I was very pleasantly surprised. They gave me instructions about how to take care of the two wounds, when I could resume exercise, and when to expect results. Luckily they gave me a lot of that in writing too because I tend to erase all of those instructions way too early from my brain. I asked them when I could start running again, and they said \"After 48 hours, but wear a really good bra.\" When she said that she looked at me sort of funny, and now that the lidocaine has worn off, I kind of understand. I don't know that I'll be in the mood to bounce around that much in just 48 hours. But it's good to know that I can if I want to. The tech took me to another room for a mammogram to show the position of the newly inserted markers. These mammograms were so much less painful than the mammos that started this process. I said that to her, and she said that mammos are less painful if the tech uses the foot pedal at first, and does the final adjustments of the machine by hand. I'll have to pay attention to that next time, esp if I have a painful one ever again. I could see that all the calcifications in the areas of concern were gone. I still have some single scattered calcifications that she could find to show me, but not many and not the type that concerns radiologists. I got a little ripped off in the ice pack department. They gave me two of those single use packs and they barely worked. They were warm by the time I got home. So now I'm using the Ziploc bag of ice technique. Oh well! The whole thing took 1:40 including changing, the mammogram at the end and everything. I did eat my peanut M&M's in the car ride home. So good!!! (OK, to be honest, I had 4 M&M's just before I changed at the start of the procedure.) Now that the lidocaine has worn off, it's weird but the one biopsy area really hurts. The other one is no big deal at all. I don't think I can even feel it. I don't know if it's because of the position - one is at the top of my breast and wasn't too deep, the other painful one went from the bottom and had to go in deep. I see no sign of bruising and I'm just glad this phase of things is over. Going into today I was really hoping I'd get results tomorrow. Now I'm sort of OK with recuperating a little from the stress of this and then getting results (please, please, please let them be boringly benign!) Thank you all for all of your help and support! I really, really appreciate it!!! If any of you read this far, I'm guessing that it's because you have one of these stereotactic biopsies in your future. Believe me, if I can do it, you can. It really isn't as weird, scary or painful as it seems like it would be. And good luck to you too!!!  Sue",
      "MessageIndex": 24,
      "PostDate": "23/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760830",
      "Title": "Somewhat Silly Stereotactic Biopsy Questions JellyShoes JellyShoes"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 24, 2010 06:31PM JellyShoes wrote: Wahoo.....just got excellent news!!! Boringly benign!!! Even though yesterday everyone I spoke with at the biopsy said \"3-5 business days, so well into next week for results\", just before the close of business today I got the happy phone call. Both sets of calcifications were just benign calcium. I am so grateful and relieved!! I really appreciate all of the information and support I've received from so many of you here on the forums. You've been so helpful to me during this stressful time. Thank you all so much!! I will make a donation to help keep the forums available. I'm also going to tell my friend who's going through chemo right now about these forums. (I didn't want to tell her I was going through any sort of scare because I was so emotionally all over the place that I didn't want to add my stress to hers.) Hopefully my breasts will have many uneventful years now, but if they don't, it's good to know that you guys are here for me! I will check back in to see how you're doing. I've learned so much here in the last few weeks. I wish all of you the best possible outcomes. Thank you for everything! Very, very gratefully, Sue",
      "MessageIndex": 28,
      "PostDate": "24/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760830",
      "Title": "Somewhat Silly Stereotactic Biopsy Questions JellyShoes JellyShoes"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "JellyShoes wrote: One week from today I'll have a stereotactic biopsy for two clusters of microcalcifications. I feel like the appointments leading up to this point have prepared me pretty well for what will be happening to my breast in the procedure. Now I have questions about the rest of me!!! I know I'm supposed to lie still for a long time...but I'm trying to figure out how still. 1) Are you allowed to talk during the biopsy? If so, is it just in case of a problem, or do they ever try to keep you distracted by talking a lot? (For example, at my last gyn visit, we were talking about hiking in Glacier and grizzly bears for almost the whole appointment....definitely distracting!) 2) Sometimes to calm down I like to breathe deeply. Will that be OK or will that somehow count as moving around and mess things up? 3) It's possible that I might cry a bit during it. (I've cried in doctor's offices many times over things less difficult than this....even at the dentist sometimes.) If I do cry what will happen? Will I be lying there in a pool of tears? Can I wipe my eyes & nose? Will the technician who's in the room help if that happens? And hopefully a few tears can flow without that counting as moving around too much, right? Told you my questions were somewhat silly! But it will help me put my mind at ease if I know what to expect about these things. Thanks for any light you can shed on the subject. I appreciate these forums and all of you so much right now! Sue Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760830",
      "Title": "Somewhat Silly Stereotactic Biopsy Questions JellyShoes JellyShoes"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Dec 7, 2010 10:14AM JellyShoes wrote: Kyra, Glad that all my words could help some one! (I know I like to know what to expect too.) Really, I am the biggest medical wimp out there, so if I can do it, you can too.  My fingers are crossed that your procedure tomorrow goes well and that you get boringly benign results as soon as possible! Ice is your friend if it hurts afterward. Keep us posted! Sending good thoughts your way.  Sue",
      "MessageIndex": 42,
      "PostDate": "07/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760830",
      "Title": "Somewhat Silly Stereotactic Biopsy Questions JellyShoes JellyShoes"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 23, 2010 01:26PM JellyShoes wrote: Thanks for checking on me. I just got back home from my biopsies. Not nearly as hard as I expected. I did great with it! Thanks so much for all of your info and support!!! I'm kind of de-compressing right now....but I will update with a few more details so that hopefully this topic will be helpful for other medical wimps who may find it in the future. Now for some quality time with my ice pack!! Sue",
      "MessageIndex": 22,
      "PostDate": "23/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760830",
      "Title": "Somewhat Silly Stereotactic Biopsy Questions JellyShoes JellyShoes"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 16, 2010 08:37PM - edited Nov 16, 2010 08:40PM by JellyShoes Thank you all so much for your reassurance and for answers to my questions. Unfortunately, I still have a bit of a medical phobia. I'm much better at medical things than I used to be. At its worst, I even had trouble taking my dog to the vet. Now I can get through most of the medical things I've dealt with, perhaps without the grace, dignity and aplomb (or just dry eyes) that I might like. But I don't have the same crippling anxiety as I did a few years ago. Fortunately, my dentist of all people, prescribes enough Xanax for me that I can use it for whatever random medical things pop up, in addition to my dentist appointments. I will definitely be helped a bit by that medication, but I find that it mostly puts me in a mood that can be best described as \"I don't give a s***\", rather than actual calm. It doesn't stop me from crying, but usually I'll kind of quietly cry rather than having a full blown major sniffling, snorting, sobbing cry. Don't I sound like a fun patient??? I pretty carefully screen my doctors, and if they're uncomfortable with emotional people, they're not my doctors for long. Paradoxically, I cry less around doctors who are matter of fact, and unfazed by expressions of emotion. I burst into tears when the radiologist told me he recommended a biopsy. But when I met with the breast surgeon for more of an explanation, we were laughing together about the radiologist's panicked reaction. You know how a dog wants to rest its head in the lap of a guest who doesn't like dogs? My tears tend to burst out at people who are least comfortable with them. I don't like that about myself, and I'm working on being better about that. Fortunately, I've already cried on the phone with the radiology technician who will be in the room with me during the biopsy. She's been absolutely wonderful for me to work with so far, so I feel a lot calmer having talked to her a few times. Depending on how I feel that day, I'll decide how to handle warning her about the possibility of tears. She already remembers me and I'm sure remembers hearing a muffled, crying voice the first time I talked to her. (I had decided to switch hospitals, and was having difficulty reaching the right person at the recommended hospital, so I was pretty tearful by the time my call got passed around through various departments.) I'm glad you guys told me that the table might be just plain metal. I was picturing something a little more comfortable. (The brochure the hospital gave me had drawings in pastel colors making it look like you could practically take a nap on that table. The drawing looked a lot like a massage table actually.) I'm also glad you told me that my arms might be in various positions. Good to know....somehow knowing more details about what it will be like makes it seem less scary. I'm not super worried about lying on my stomach....I sleep on my stomach. Plus, being raised up high seems kind of cool too.....like a cheetah hanging out in a tree or something. Not as vulnerable a posture as some others. We'll see how long that cheetah lounging in a tree image lasts! I'm super glad that it's OK to talk. I'm often told that I can talk to anyone about any subject for any length of time. Not sure I'll chat during this procedure, but good to know that it's an option. I'm having two areas biopsied, so I'm booked into that room for 2 hours. I do get to get off the table and walk around a bit between procedures. That would be a lot of chatting even for me!! (But see how long this post is? Doesn't it seem like I could chat for 2 hours straight?) Good to hear that there are differences in how much noise there might be. I was so glad that someone warned me before my foot MRI 5 years ago that it would be noisy. The noise would have freaked me out if I hadn't known ahead of time. Good tips on the pain management, ice packs, and bringing a small pillow. I'll definitely do all of those things! Thank you all for sharing so much of yourselves, your thoughts and experiences! I really appreciate the time that you've taken in responding to my questions and I feel more prepared for whatever next Tuesday brings. I will certainly keep you posted on what happens. I hope to have good results to report sometime next week. Know that I wish the very best for all of you. Gratefully, Sue",
      "MessageIndex": 6,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760830",
      "Title": "Somewhat Silly Stereotactic Biopsy Questions JellyShoes JellyShoes"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Dec 1, 2010 08:20PM JellyShoes wrote: Just popping in for a minute a week after my B9 results came back. (I did celebrate, but I also felt like a total slug....so tired and frequently napping for the first few days after I got my results. Not sure whether to blame that on Thanksgiving or on the lack of stress chemicals in my body!!) Thanks so much (again) for all of your support and for cheering me on in this thread.  Also, Jean318....so glad you also got good news!!!! I think I've been celebrating FAT with you these last few days!!! All my best, Sue",
      "MessageIndex": 39,
      "PostDate": "01/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760830",
      "Title": "Somewhat Silly Stereotactic Biopsy Questions JellyShoes JellyShoes"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Aug 20, 2015 05:03PM JellyShoes wrote: I joined this forum 5 years ago when I had a biopsy that came back benign.(I had a lot of questions beforehand because I was super nervous.) I was diagnosed in May and my surgery was in June of this year. I started radiation this week. My surgery had clean margins, and no lymph node involvement. My medical team is very confident and hopeful that I'll be fine soon, and for many, many years to come. So I'm well enough, but still in treatment.....not that many months ahead of you.",
      "MessageIndex": 9,
      "PostDate": "20/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/834421",
      "Title": "Mass Measurement- HELP 98765 JellyShoes"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Aug 20, 2015 04:39PM JellyShoes wrote: Stage 1 goes all the way up to 2 cm. I got that staging info after my surgery in my surgical pathology report. My experience was that during the ultrasound the largest dimension of my suspicious area was 7 mm. They did an ultrasound guided biopsy, and told me that it was \"very small, very early\". The pathology report after my surgery had measurements of all 3 dimensions, and the largest measurement was 1.1 cm. My cancer is invasive tubulolobular, so that can be tricky to detect and can spread in little lines of cells. It wasn't visible on standard mammography at all, only on a 3D mammogram.  Hope this helps and doesn't just make things more confusing. I'm sorry you're going through this! ",
      "MessageIndex": 7,
      "PostDate": "20/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/834421",
      "Title": "Mass Measurement- HELP 98765 JellyShoes"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Sep 3, 2015 01:13AM JellyShoes wrote: At both of the practices that I visited for rads, the machine actually automatically turns off if your breath isn't in the right position. The only time I've messed up so far (13/30) is one time when the techs were making me laugh. I laughed, the machine turned off, and I just had to inhale again after the giggles subsided. The laughing appointment was last week. This week I'm definitely more in touch with being angry and cranky. Unfortunately.",
      "MessageIndex": 57,
      "PostDate": "03/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 20, 2010 06:19PM JellyShoes wrote: Well, if you can't post here about gunk soaking through your clothes, where can you post? (I'm guilty of posting giant amounts and so far all I've had done are some images....)  Wish I had experience that would help you....I do think it's smart for you to go to the doctor next week if it's not better. Just for your piece of mind, and for any tips that will help you get back to normal as soon as you can. Sue",
      "MessageIndex": 5,
      "PostDate": "20/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760927",
      "Title": "leaking from incision site heyjude62 Lisa1962"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 22, 2010 09:47AM - edited Nov 22, 2010 10:00AM by JellyShoes So sorry that you're going through this right now. Hopefully it is boringly benign and you'll get that answer fairly quickly. I noticed that you expressed some concern that the recommendation in your radiologist's report to do a biopsy will get blown off. I wanted to share a little of my experience that might ease your mind in that regard. For me, after a routine mammogram, I was called back for additional images. The radiologist recommended a biopsy and my mammogram report was also BIRADS 4. I decided to send my films to a hospital that does more of this type of work for a second opinion. When I contacted that second opinion hospital, they said that they often disagree with smaller local hospitals about needing to do biopsies, and that they might come back and recommend against it. During the wait for the second opinion, I had an appointment with the breast surgeon at the first hospital. I told her that I was secretly hoping that the other hospital would recommend against a biopsy. The breast surgeon said that once a biopsy is recommended, most doctors won't recommend against it in part because of malpractice.  Sure enough, my second opinion hospital wanted to biopsy two areas instead of the one area that my original hospital wanted to sample. Whatever else the breast surgeon you're meeting with next week says, I'm sure that they'll be at least leaning toward a biopsy, and if they're not, I'm confident you could find a breast surgeon who would recommend a biopsy pretty easily. At my appointment with the breast surgeon, she went over my films, showed me the areas of concern, and talked about the most likely findings and small treatment overviews....all to reassure me that it was early, most likely benign and if treatment was necessary, it would most likely not be anything too difficult. Surprisingly, I found that appointment really helpful and calming. (Not that I am actually calm by any means, but the appointment did help....having specific information from some one with expertise about my health was really helpful.) Sorry that you had to get called back on your birthday, and that you're dealing with this now. The waiting is really hard. I hope you get boringly benign results soon.  My college statistics professor would be shocked at how much comfort I'm trying to take right now in that 80% benign figure. Hopefully you can find some comfort there as well.  Best of luck to you and keep us posted!! Sue",
      "MessageIndex": 5,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761045",
      "Title": "I know the stats but still worried..... rn4babies rn4babies"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 22, 2010 06:35PM JellyShoes wrote: RosieS: Great news about your biopsy being benign!!! Yay!! Big sigh of relief!  rn4babies: Still sending you wishes for the best possible result for you. We're waiting with you and hoping that your appointment with your surgeon next week provides some answers. Sue",
      "MessageIndex": 8,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761045",
      "Title": "I know the stats but still worried..... rn4babies rn4babies"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 19, 2010 06:09AM JellyShoes wrote: Sorry that you've got a diagnosis....or the beginning of a diagnosis if it's still subject to change. It is a big surprise to me how much waiting is involved in this whole process. I always thought that since they can call you the same day as a mammogram if they need more views, that everything else would be equally speedy. Not so much, as we're finding out, eh? I hope your next steps get scheduled soon so you can know better what to expect. I'm glad you started  a topic so we can keep in touch with you as your medical team helps you sort through all of this. Take care and keep us posted! I'm hoping and praying for the best for you!! Sue",
      "MessageIndex": 2,
      "PostDate": "19/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/760885",
      "Title": "I have a possible diagnose dmho marie5890"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Dec 2, 2010 11:54AM JellyShoes wrote: Thinking of you this week as you head toward surgery. I'll be hoping for the best possible outcome for you. Take good care, Sue",
      "MessageIndex": 13,
      "PostDate": "02/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/760885",
      "Title": "I have a possible diagnose dmho marie5890"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 23, 2010 06:03PM JellyShoes wrote: Good luck with your callback tomorrow!!! Statistics I've seen are that 6 out of 7 callbacks result in no further action being needed. So they want to get some clearer or closer views of something, but for 6 out of 7 people called back, they won't recommend a biopsy. And even if they do recommend a biopsy, 80% of biopsies are benign. Odds are still very much in your favor! I know, taking comfort in statistics isn't always easy....but there's a really good chance that tomorrow they'll tell you by the end of your session of extra images that you're in the clear and don't need to come back until your next screening mammogram. I hope that's how it works out for you!! Let us know how things go tomorrow!! I will be fervently hoping that you're in the majority of women who are given the \"all clear\" after some additional images!! I think most imaging centers tell you that same day if they recommend further action or if you're good to go. Take care and good luck tomorrow!  Sue",
      "MessageIndex": 7,
      "PostDate": "23/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761086",
      "Title": "Called back 50% of the time- help! flmnfem Lisa1962"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 10, 2010 08:14PM JellyShoes wrote: That's such great news!!! Yay!  Thanks for sharing all of these details too. One radiologist recommended that I get a stereotactic biopsy also, so it's really informative to read what the experience was like for you.   So glad your results came back B9!!",
      "MessageIndex": 16,
      "PostDate": "10/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760246",
      "Title": "Stereotactic biopsy...so nervous! lford91 lford91"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Dec 8, 2010 01:41AM JellyShoes wrote: Hope you're healing well from surgery and that you get the best possible results. A week of waiting is a long time (as I'm sure you don't need me to remind you!) Sue",
      "MessageIndex": 21,
      "PostDate": "08/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/760885",
      "Title": "I have a possible diagnose dmho marie5890"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Dec 17, 2010 08:32AM JellyShoes wrote: Sorry that you're going through another surgery. I think anyone would feel scared because the whole process is so emotional. I love that quote \"You don't have to be brave, but it's in your interest to show up.\"  I will be sending you calming thoughts tomorrow and I'm hoping for the best possible results for you.   For what it's worth, anti-anxiety meds help me some, but they're definitely not magic for me.  Take care!!  Sue",
      "MessageIndex": 35,
      "PostDate": "17/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/760885",
      "Title": "I have a possible diagnose dmho marie5890"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "JellyShoes wrote: Hi! I will be starting radiation therapy in August. I really, really object to having permanent visible reminders of my breast cancer treatment. I am still hoping to get tattoos done with invisible ink rather than the standard blue or black ink. (Yes, I do have great faith that my lumpectomy and SNB scars will fade and be tiny in time.....and that requires faith at the moment for sure!!) Does anyone know of any practice in the northeastern US where they offer invisible ink as an option? I met with a radiation oncologist today, and although he was sympathetic to how I felt, he did not believe he could get this type of ink adopted by his practice/hospital in time for my tattoos in early August. If you know of anywhere that offers this option, especially Boston or north into NH, that would be a huge help to me!! Thanks so much for all of your help, past, present and future!! This forum is really important to me, even though this is my first post in years. I've been pretty overwhelmed so far since my diagnosis in May, but I'm glad surgery is behind me at least!! I hope that we all find strength, peace and healing!! All of my best, Sue Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/833378",
      "Title": "Invisible Localization Tattoos.....esp in Northeastern US JellyShoes inks"
    },
    {
      "AuthorID": "JellyShoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112770/profile",
      "Content": "Nov 24, 2010 11:01AM JellyShoes wrote: Jay, Glad my words.....and statistics.....could help a bit. You're in my thoughts today...and I'm totally rooting for you to get an \"all clear\" from the radiologist.  Let us know how it goes! Sue",
      "MessageIndex": 9,
      "PostDate": "24/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761086",
      "Title": "Called back 50% of the time- help! flmnfem Lisa1962"
    }
  ]
}