{
  "AuthorID": "Jelson",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
  "Posts": [
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Apr 8, 2016 08:09PM Jelson wrote: framer- what you are going through right now is, most will agree, the worst. NOT KNOWING is the worst. For me too - it is the ribs that hurt the worst after a mammo. I am 65 and have been \"with\" but not married the whole time to my husband since 1968! Mine doesn't get agitated and worried about unknown stuff, so I guess I can be grateful for that.. If you have cleaned everything, how about cooking something interesting?",
      "MessageIndex": 16,
      "PostDate": "08/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/842712",
      "Title": "very stupid question from 66 year old female framer"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Nov 10, 2013 08:19PM Jelson wrote: I am assuming, like me, you are post menopause? although I am still on tamoxifen - will be done Aug 2014 - I am scheduled for a hysteroscopy and d&c due to spotting and based on a transvaginal ultrasound - thickening of the uterine lining and a polyp. The diagnostic radiologist told me that the tamoxifen can cause thickening of the uterine lining and spotting but that a few months after stopping tamoxifen - the lining should shrink - quite a bit if post- menopausal. I would think that for you, four years after stopping tamoxifen - tamoxifen is not causing your spotting - but, even if it were the tamoxifen - you need to get this checked out. There are many possible reasons (non-cancer) reasons for spotting - you just need to get it checked. Good luck",
      "MessageIndex": 1,
      "PostDate": "10/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814317",
      "Title": "Anyone who is post tamoxifen -4 yrs heartbroken08 pupmom"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Apr 28, 2010 08:16PM Jelson wrote: If your diagnosis is DCIS- Ductal Cancer In SITU, your stage will be 0, You will find out from the pathology report what grade (1-3) with 3 indicating the cells are more abnormal, you will get an estimate of the area of DCIS, and perhaps what type of DCIS, and how large are the margins of DCIS-free tissue surrounding the lump which was removed.  you will also find out whether the DCIS is ER and/or PR receptive (+). You wil meet with the surgeon and get recommendations on a treatment plan which include combinations of watchful waiting, additional surgery to achieve larger margins, radiation, tamoxifen and/or mastectomy. It is strongly advised that you get a second opinion of your pathology slides and of your treatment plan. Certainly, come visit us on the DCIS board now or when/if you are diagnosed. There are many women who will help you - from those who are years from diagnosis/treatment to those just a few steps ahead of you. A poster named BEESIE has many easy to understand and informatiive posts. There are Young women who probably share many of your age- specific issues and concerns. In addition to the information in the reference section of BCO, there are other websites with info on DCIS. here is one I like:- www.dcis.info/dcis.html Hopefully all will be found benign,in any event, the very best of luck to you on your excisional biopsy tomorrow.  Julie E",
      "MessageIndex": 6,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/751966",
      "Title": "i need HELP!!!! jodi4lsu TheBrightSide"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Aug 13, 2015 11:54AM Jelson wrote: pardon me if the resources you mention in your initial post already cover this, but if not, here is an article that explains the relationship between dragon boating and post-breast cancer treatment exercise. http://ldihealtheconomist.com/he000025.shtml I had the pleasure to participate in the 2010 International Dragon Boat Festival for Breast Cancer Survivors held in Peterborough, ON, Canada and I believe there are have been 2 international festivals since then. Dragon Boat paddling is recognized around the world as an excellent upper body(it is actually a whole body )exercise for breast cancer survivors.",
      "MessageIndex": 8,
      "PostDate": "13/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/834185",
      "Title": "Can you suggest resources about exercise and lymphedema? carol57 carol57"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Mar 15, 2011 06:24AM Jelson wrote: Konakat - I have always associated humor with intelligence - you have brain power and personality to spare. All the best! Julie E ",
      "MessageIndex": 95,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766178",
      "Title": "Zappity Do Da - My WBR konakat konakat"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Aug 14, 2015 02:16PM Jelson wrote: brilliant to wear a fitbit while kayaking - will have to try that. Kudos to you to kayak with lymphedema. it is heartening to know that if I do get it, I will still be able to kayak. I go out several times a week between March and November, paddling an average of 12 miles in a 5-6 hour outing. Mostly on the Hudson River - taking advantage of the tide! I help spot bald eagles for my husband who takes photographs of birds, plants, tugs/barges, beavers etc from his kayak. The baby eagles are practicing flying now, so alot of my time recently has been spent bobbing around!! I tried googling kayaking breast cancer in different ways to see if there have been studies on the impact of kayaking on lymphedema or breast cancer survivor wellness, but I haven't come up with anything yet. I wonder whether dragon boating, in which you paddle a single bladed paddle, using both left and right arms/shoulders but differently - has been considered more amenable to breast cancer survivors because it gives a left or right side option. allowing the paddler to sit on the side which provides the most comfort and least strain to the side which with they might be having trouble/pain..",
      "MessageIndex": 12,
      "PostDate": "14/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/834185",
      "Title": "Can you suggest resources about exercise and lymphedema? carol57 carol57"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Oct 29, 2015 06:08AM Jelson wrote: terrymay - so sorry for all you are going through. Please tell your HMO and doctors about your very legitimate concerns, they should be able to link you to organizations in your area which can provide support/actual assistance to you. On your own, you can check with the American Cancer Society in your area, you can check via the internet for any breast cancer specific organizations.",
      "MessageIndex": 6,
      "PostDate": "29/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/836234",
      "Title": "On my own, just diagnosed. Husband died of cancer 18 months ago. terrymay Lily55"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Feb 9, 2011 06:02AM Jelson wrote: Not quite as long a run as those above, but there is an obituary in our local paper today for a woman who survived Breast Cancer thirty years. Lets double that!! Julie E",
      "MessageIndex": 4,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764638",
      "Title": "Read This! lukejessesmom Lowrider54"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Oct 10, 2014 03:23AM Jelson wrote: I only shared with my husband before core biopsy and diagnosis. There was a gap of several weeks before lumpectomy and I waited til the weekend before to tell my children. Told rest of family after lumpectomy.  I think what I succeeded in limiting was the well meant, but unwanted (crazy-making) advice on treatment choices and many questions for which I did not yet have answers. As said before, there is no right/wrong way, only your way.  Julie E",
      "MessageIndex": 20,
      "PostDate": "10/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/825195",
      "Title": "When diagnosed- did you share with family & friends? MamaM whatnow"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jul 18, 2010 11:19PM Jelson wrote: I second Leah's suggestion to get her into a dermatologist ASAP. Have your daughter give a description of the area of concern - size, color(s), length of time, growth when she makes the appt. Maybe you need to sit next to her when she makes the call or she could call, get the receptionist on the line and give you permission to do the talking, handing you the phone. I too have no experience with Melanoma but it sounds like you have considered the layperson's warning signs and you need no excuse to hustle that girl into the doctor. Hopefully it isn't Melanoma. Julie E ",
      "MessageIndex": 2,
      "PostDate": "18/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/755532",
      "Title": "melanoma on the breast elleith elleith"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jelson wrote: http://www.bbc.com/newsbeat/26538938 Dx 4/17/2009, DCIS, <1cm, Stage 0, Grade 3, 0/0 nodes, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/819039",
      "Title": "Angelina Jolie to have additional cancer preventing surgery Jelson Shellshine"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "May 13, 2011 01:59PM Jelson wrote: Here is a url for info on the Gail Model. http://www.cancer.gov/bcrisktool/breast-cancer-risk.aspx I am due for my 3rd MRI in a few weeks. For a breast MRI, you are on your stomach - tell the technicians if you need more/less padding in a particular place - their goal is to have you stay still. - I don't get a claustrophobic feeling - maybe because the room is bright and I am on my stomach - a position I don't associate with being buried alive - an idea I hope I am not introducing to you, I mention because it is often the complaint about MRIs.  I focus on the weird sounds and I try to count the seconds, like however many make up 20 minutes. Last year the procedure was done before my counting was done - so much for 1 mississippi, 2 mississippi........ You don't sound pathetic at all, many people share your fears. I didn't know about the iv before my first MRI, maybe I would have freaked too if I had the time to think about it!  Hold this thought: You are very lucky to be given the opportunity to have an MRI which will hopefully identify what you have been watching for more than a year.   Julie E",
      "MessageIndex": 8,
      "PostDate": "13/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/768932",
      "Title": "mri for birads 3? Lellis Lellis"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Dec 12, 2018 12:12PM Jelson wrote: No lymph node removal for DCIS with lumpectomy is the norm - when a mastectomy is performed for DCIS a sentinal node biopsy might be done because if warranted, it won't be possible to do after the mastectomy. Why not check out the DCIS specific thread while you are waiting for surgery!! jelson",
      "MessageIndex": 5,
      "PostDate": "12/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868811",
      "Title": "no lymph node removal for early DCIS?? yogamom2 Jelson"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Dec 12, 2018 04:43PM Jelson wrote: you should also check the main section of BCO, there is a lot on standards of care for all types of BC including DCiS. I didn't know about BCO until after surgery - I would have had a better idea of what was going on!!!",
      "MessageIndex": 7,
      "PostDate": "12/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868811",
      "Title": "no lymph node removal for early DCIS?? yogamom2 Jelson"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Nov 22, 2009 05:57PM Jelson wrote: Miriam, I have been following your saga de groin and groaned when I saw your subject header. I think that focusing on each tree instead of the whole f**ckin forest is a valid form of sanity preservation.  Now, forget about kicking it to the curb, you are going to kick this thing off the continental shelf.   Hope Tuesday goes well. Julie E",
      "MessageIndex": 3,
      "PostDate": "22/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/744315",
      "Title": "Horrible News re Swollen Groin Node mshalto mshalto"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jun 7, 2011 05:14PM Jelson wrote: OK Otter, I bow to your superior wisdom and that of most of the others on this thread,  in the how to honor Konakat department - chocolate EVERY DAY for me.  What ever it takes, really. Julie E",
      "MessageIndex": 414,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jun 12, 2011 07:57AM Jelson wrote: Judie, I think you did something good for KK's sister, not just us, you gave her the opportunity to share her frustration about not doing more for her sister. We feel the same way, and understand how painful it must be for her to stand back and respect Elizabeth's wishes. Julie E",
      "MessageIndex": 610,
      "PostDate": "12/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jun 7, 2011 06:23AM Jelson wrote: 103 until we hear from Konakat, no chocolate for me. Julie E",
      "MessageIndex": 386,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "May 25, 2011 01:58PM Jelson wrote: don't read further if you are easily shocked.....this has me so upset that I dredged up something we used to say when I was in high school -  THIS SUCKS A THOUSAND DOGGY DICKIES You aren't out of options yet Elizabeth.  Love and Hugs Julie E",
      "MessageIndex": 73,
      "PostDate": "25/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Mar 22, 2010 04:38PM Jelson wrote: Elizabeth I am a book-loving lurker Konokat fan, so this is the first time I am posting on this Board. I wanted to recommend The Sweetness at the Bottom of the Pie by Alan Bradley (a Canadian writer!!!). The smart and funny eleven-year old protagonist, Flavia De Luce reminds me of you. The setting is an estate in rural England-1950 - not where I would have thought I would have wanted to spend time - but it was the type of book, that I didn't want to end.  Another recent one is The War Against Miss Winter - a down on her luck actress in NYC - 1943 who takes a part time job at a detective agency - she is feisty, mouthy and a lot of fun.....also like you. wishing the best to you, Julie E",
      "MessageIndex": 645,
      "PostDate": "22/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Feb 1, 2015 02:47PM Jelson wrote: I am a so sorry that you are going through this. It sounds confusing and hard to sort through. You say you don't want another MRI because the radiologist will insist on mammography and ultrasound too. your doctor doesn't advise an excisional biopsy because something might be missed. I am not reading what your doctor is actually recommending though, depending on the findings of all of these tests you don't want. More watchful waiting? a lumpectomy or mastectomy if areas of concern are found with these tests? it sounds like something has changed in there. you say you don't want to go through all of this and you mention mastectomy and that you might want to go to a breast surgeon. what type of doctor are you consulting with now? maybe indeed you should see a breast surgeon and lay out all of your medical records and frankly discuss your options with/without new mris etc.",
      "MessageIndex": 1,
      "PostDate": "01/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828064",
      "Title": "Lost as to what to do Tracker1 alicki"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Mar 23, 2010 08:13PM Jelson wrote: 3monstmama great post, you were really paying attention, how did you take notes while hanging onto the stirrups? you couldn't have given dictation with a tube in your mouth???   everything you posted, from the ACE and green tea, to the what lotions - it really seems as if your team of ZAPPERS are up on the latest research. I bet after spending time with them over the course of your treatment, you will want to take them with you and hubby to the topless beach. Jelson",
      "MessageIndex": 1,
      "PostDate": "23/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/750199",
      "Title": "Introduction to Zapland or My First Real Rads 3monstmama 3monstmama"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Dec 26, 2010 05:34AM Jelson wrote: I guess I am slow or thick-skinned, I remember driving over a bridge one night before christmas several years ago listening to NPR on which there was someone reading an essay about gifts. One of the funny gifts I chuckled over was bath salts for someone who didn't have a bathtub. I laughed but began to think about the gift I had gotten the year before from my DH, good grief, a dozen bath cubes and we don't have a bathtub either!! I shrieked and almost drove off the bridge. When we were trying to get pregnant he emptied our kitty litter box and began to hate our cats. He ultimately banished them from the house 6 months of the year and was just mean about them. Anyway, they eventually died off (respectable ages). Well, what starts popping up as the theme for my Christmas presents? CATS: Cat socks, Cat this, Cat that. Finally a victoriana type pin which was an open cat's mouth framing a mouse. I said ENOUGH, I love living cats, not cat stuff.",
      "MessageIndex": 13,
      "PostDate": "26/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762430",
      "Title": "Your funniest/strangest holiday gift? EnglishMajor KarmaKittie"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "May 18, 2011 05:26PM Jelson wrote: http://www.shop3m.com/70200763947.html above is info about it. and here is a blog from 2008 by a husband whose wife used it instead of what the doctor recommended. http://coopergordon.blogspot.com/2008/06/experience-with-cavilon.html he explains how it differs from the normal moisturizers recommended by the NHS. He talks about their experience and suggestions for how to apply, he suggests the cream instead - which is also featured on the 3m website above. I was reassured when I read the blog, he has a hot link to a study comparing cavilon to a product normally suggested for bc radiation - in australia. if you google cavilon radiation - the study comes up as well. Don't be put off by the fact that this \"cavilon\" family of products seem to have orignally been intended for colostomy bag users and to protect skin from incontinence - hey, it sounds like it works and does not interfere with radiation.  This is kind of exciting - something new!! . If you check through the radiation discussion board, you will find that many products have been recommended. I know the radiology practice where I got my radiation recommended dove soap for sensitive skin and pure aloe vera gel - mainly because these worked and were cheap.  This cavilon might work better but be more expensive.  I certainly hope you breeze through your radiation! Julie E  ",
      "MessageIndex": 3,
      "PostDate": "18/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769136",
      "Title": "Cavilon instead of lotions Lee64 Lee64"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Mar 8, 2016 06:05PM Jelson wrote: I had it - perhaps 3 years after treatment - I called the radiation oncologist who had treated me and was still following me, he saw me and diagnosed it immediately. Might you try the radiation oncologist who treated you?",
      "MessageIndex": 5,
      "PostDate": "08/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/842025",
      "Title": "Radiation recall after 4 1/2 years? Worried about IBC. rn4babies KBeee"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Nov 24, 2015 07:35AM Jelson wrote: I had whole breast radiation, 36 treatments including 6? boosts? I slathered myself with aloe vera in the changing room and during the day and calendula before I slept. 34DD, now 36DDD my bc breast has stayed larger than my unaffected breast. Also felt the regular no-wire bras were itchy and uncomfortable, during treatment I wore a heavy duty sports compression bra - which enabled me to continue kayaking during treatment - the girls stayed in place and chafing was minimal. I had redness and dark discoloration and some irritation towards the end and the week after radiation stopped but that resolved.",
      "MessageIndex": 1,
      "PostDate": "24/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836994",
      "Title": "Any Women Who Had No Problems During Radiation? ChiSandy Grammy4"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jan 17, 2015 09:23AM Jelson wrote: Although there were cancers in my family, most of my relatives had died from lung cancer or heart issues, so those were what I was concerned about and a diagnosis of breast cancer was simply not on my radar either. Perhaps the surgeon is concerned that because you are so very optimistic that the findings are going to be benign, that if indeed, a malignancy is found, you will find it especially difficult to absorb and to be able to cope. So even though he was a bit abrupt, he has planted a seed in your mind, that you might indeed have BC. The fact that you are learning more about BC, wrapping your head around the possibility, is probably the reaction he was hoping for. When I was told by my surgeon, post biopsy, that I had DCIS - and she explained how the cells were not capable of breaking through the duct wall. I said, oh, they are too stupid - she responded, this is not a joke. this is serious. I felt a bit huffy, I can tell you!!! and then a friend of mine, when I tried to minimize my diagnosis, said quite harshly to me, this is serious, I have friends who died from BC - well that got me very angry. But both the surgeon's comments, and my friend's comments nudged me to accept that this was my new reality and were the impetus for my seeking and finding BCO. I sincerely hope that your findings are benign and that BC is not your new reality, and that you can laugh in that surgeon's face. But if it is BC, you may not be as blindsided by the diagnosis as you would have been if the surgeon hadn't said what he said.",
      "MessageIndex": 3,
      "PostDate": "17/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827662",
      "Title": "What the surgeon told me on my first visit surprisedat65 farmerjo"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jan 17, 2015 11:27AM Jelson wrote: I just found this on Cancernetwork - 7 tips for a successful first oncology visit - from the perspective of the oncologist!! no surprises, but reassuring that many of the suggestions made here - are hoped for by the oncologist - bringing someone with you, asking questions etc. http://www.cancernetwork.com/blog/7-tips-successfu...",
      "MessageIndex": 5,
      "PostDate": "17/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/825957",
      "Title": "What Do I Expect from Ist Oncology Visit? MaggieCat labelle"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Feb 23, 2016 03:01PM Jelson wrote: InStitches - is part of the reason that there are more slides from the excisional biopsy because they had more material to work with? I may be mucking up the waters here but when second opinions are requested to be sent to other hospitals - I assumed that new slices of the tissue sample are sent, not the same exact slides which were reviewed initially. In any event, I hope you get answers about the areas of concern in your right breast ASAP",
      "MessageIndex": 1,
      "PostDate": "23/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/841572",
      "Title": "Pathology dilemma InStitches InStitches"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "May 14, 2010 10:31AM Jelson wrote: skyelee - I am sorry that your internist frightened you, it sounds like she is frightened for you - but remember she is an internist, not a breast cancer specialist. Eventhough you can't take someone with you, can someone be on speaker phone from the surgeon's office or perhaps could you record what the doctor says? and if those alternatives aren't practical for you, ask for a report of your visit with the surgeon, because much, if not all of the pertinent information discussed should be on the report of the visit.AND check with your internist/radiologist to make sure that the surgeon has been sent your mammograms and ultrasounds - you may have to actually pick them up and bring them to the appt yourself. I scrolled around in the Symptoms and Diagnosis section of BCO and found a page with information on exactly where you are - early diagnosis stage www.breastcancer.org/symptoms/...  It will help you make a list of questions to ask, I bet someone else with respond to your posting with an actual list, I just wanted to make sure you didn't feel like you were left hanging by us, even for a few minutes! Good luck, hopefully your results will be benign - keep us posted. Julie E",
      "MessageIndex": 2,
      "PostDate": "14/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752634",
      "Title": "Seeing surgeon today because of \"bad\" mammogram and ultrasound skyelee skyelee"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jan 16, 2016 06:46PM Jelson wrote: I would hope for the best, assume benign and really try to get the new job. you are going to have to figure out health coverage regardless of your bc status. it sounds like you have thought through your reasons for wanting a different job. it also sounds like your current employer would not be at all supportive while you were going through treatment.good luck",
      "MessageIndex": 2,
      "PostDate": "16/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/840259",
      "Title": "New job yes or no Scared462016 Kicks"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "May 16, 2010 09:52PM Jelson wrote:  Skyelee, How fortunate that you got to speak in person with your husband's cousin and that she was helpful and reassuring. I will be thinking about you all day tomorrow, hoping the biopsy goes well. Also, Wishing for benign results for you. Please keep us posted. Julie E",
      "MessageIndex": 5,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752634",
      "Title": "Seeing surgeon today because of \"bad\" mammogram and ultrasound skyelee skyelee"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Oct 14, 2014 12:08PM Jelson wrote: even though I had a lumpectomy and radiation only! with no snb, I have avoided needles and bp cuff on bc side. when I began allergy shots! 9 in one arm every week! yikes - but worth doing whatever I can to avoid lymphedema.",
      "MessageIndex": 22,
      "PostDate": "14/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/825038",
      "Title": "No needles, blood pressure readings after single node biopsy? mawhinney Lilith08"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Feb 2, 2010 04:11AM Jelson wrote: My friend's daughter just had breast augmentation, her smaller breast was congenital, not due to medical treatment. She was initially denied by insurance, but prevailed twice (she got approval and then was nolonger eligible for one insurance for other reasons and then had to get approval from her new insurer. You will need documentation from an orthopedist to support the contention that the augmentation to address the imbalance is medically necessary to stop damage being done to your spine and ongoing pain. Good luck Julie E",
      "MessageIndex": 8,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/747628",
      "Title": "Grew up with major imbalance - childhood cancer ensignabby Jelson"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Dec 19, 2010 02:42AM Jelson wrote: DHMO- So sorry you are in pain, but that is what the medication is for, don't wait, keep yourself medicated. Here is hoping that the margins are good and clear this time!  Good luck with this. Julie E",
      "MessageIndex": 38,
      "PostDate": "19/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/760885",
      "Title": "I have a possible diagnose dmho marie5890"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jan 27, 2015 07:41PM Jelson wrote: talk about protective, I told my 20+ year olds when I had my diagnosis and a treatment plan in place. For younger children, I would agree that the unknown is most frightening, for you to to be able to explain that mom has cancer and at the same time, explain the plan to beat it would give them a sense that you are in charge and not helpless and that their world is not spinning out of control. good luck to you!",
      "MessageIndex": 2,
      "PostDate": "27/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827940",
      "Title": "Telling kids ages 9 and 11? Trvler Trvler"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jun 20, 2014 01:27PM Jelson wrote: I just read your thread for the first time, sheesh, you have been through alot, but in my opinion,  the saddest stories here are of the missed/delayed diagnoses. As the breast surgeon said, the box is open and even she now feels she has to see what is there. While in all probability this last area of concern will turn out to be nothing, if indeed there is something there - you will have caught it.  If it is all all right - as you have every reason to assume, you will have quite the story to tell about your two months from hell.  so sorry you have been going through this - hope it is the first and last time.",
      "MessageIndex": 11,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/821398",
      "Title": "Just when I think I'm good to go.... Suesinstitches Suesinstitches"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "May 14, 2011 07:19PM - edited May 14, 2011 07:19PM by Jelson wabi-sabi- of course you had to tell your son. Thank heavens he told you of his concern, just imagine him worrying by himself for weeks. And then of course your other son. I agree that you can hold off telling your daughters until you have a diagnosis. Their being away from home gives you the luxury of sparing them during this period of uncertainty - esp since there is still a good chance that the results will be benign. If it comes to having to tell you daughter in England that you have BC, can you email your daughter in England and tell her that you are having some health issues that you would like to talk with her about via skype (that is where you can see each other?)  and there you will be, looking as lovely and vital as ever - which will make her feel better - I am sure. I told my husband the results of the core biopsy. I didn't have my lumpectomy for several weeks (visitors!) and told my two children, one of whom was living at home and the other nearby - and ages- 20 and 23 at the time - the day before I was to have the lumpectomy - Mother's Day - unfortunately. I told them because they would be around and would notice if I was acting in any way differently.My daughter insisted on coming with her dad and me to the hospital.  I didn't tell anyone else until I actually got the definitive diagnosis after the lumpectomy. My reasoning was - all it would do was upset them with just enough information to drive them and me batshit. I wouldn't have been able to answer their questions, and their comments would not have been reassuring - since they wouldn't have had any factual basis.  Hoping it is benign!! Julie E",
      "MessageIndex": 7,
      "PostDate": "14/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768945",
      "Title": "talking to family & friends Wabi-sabi Wabi-sabi"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Dec 19, 2011 06:07PM Jelson wrote: I agree with Flash.  and IORT and brachytherapy are not the same thing as you know. If not apples and oranges, then clementines and mineolas. The persons to whom you should look for reassurance are your surgeon and radiology oncologist. Otherwise - full steam ahead and I am sure all will go well tomorrow and you will be feeling fine for the holildays. Julie E",
      "MessageIndex": 3,
      "PostDate": "19/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779761",
      "Title": "Did I make wrong decision re IORT? LWA LWA"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jan 5, 2011 05:35PM Jelson wrote: glad to be the first to say Good For You, too bad you had to fight to be treated properly. I would say, another glass of wine is in order for you today! and yes, I hope that you are ultimately given the all clear - but that you will feel confident about it this time.  Julie E",
      "MessageIndex": 1,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/762967",
      "Title": "Got what I wanted...but had to fight!! SarahsMom msippiqueen"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Nov 23, 2013 07:52AM Jelson wrote: just saw this, about 2 years after surgery/rads my breast grew bright red and hurt - I went to the radiation oncologist who said it was a reaction to radiation - I think he prescribed Aleve!!! and it cleared up. good luck to you Candie1971 - hope yours is nothing to worry about and resolves quickly, too",
      "MessageIndex": 3,
      "PostDate": "23/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/814826",
      "Title": "CAN SOmeTHING BE WRONG???? candie1971 Jelson"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Mar 4, 2016 08:58AM Jelson wrote: Faye33 - I am sorry that you have been treated this way and I support your responses- your letter and your resolve to change doctors. I am 7 years out from DCIS and still see my actual RO and MO once a year. My MO - despite the fact that I haven't been on Tamoxifen for 2 years. My annual exam with the MO often gets rescheduled - this time I was given the alternative to see the nurse practitioner which I declined - having the luxury to wait 5 weeks til the doctor would be available. That office has never pulled a switch at the actual visit. I do see the nurse practitioner at my gyno/onc visits. The doctor who performed my hysterectomy left the practice, I was switched to another doctor at my first 3 mo check up where it was made clear to me that I had an excellent prognosis (easier to say with endometrial cancer caught very early than with bc) so being examined every six months by the same nurse practitioner in this instance is totally fine with me. You, HOWEVER, deserve to see the DOCTOR especially after a recurrence of bc AND being in active treatment.",
      "MessageIndex": 26,
      "PostDate": "04/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/792748",
      "Title": "\"Dumped\" by my oncologist after 3 years Lindissima LRM216"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jul 7, 2014 09:31PM - edited Jul 7, 2014 09:33PM by Jelson it all sounds like their concern about you having to deal with even the suspicion of breast cancer at your age caused the technicians/staff to act in an emotional and unprofessional manner. The doctor might have picked up on this and the technician's abruptness might have been a result of having been rebuked by the doctor for such innappropriate behavior. In any event, whatever the results are and it sounds like they are benign, it is always a good idea to get copies of your mammograms and ultrasounds in addition to the doctor's report. You can always then get a second opinion. All good wishes for you in your appt with your doctor next week.",
      "MessageIndex": 7,
      "PostDate": "07/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822447",
      "Title": "27, Extensive Family History of Breast Cancer, Found Lump aleo90 farmerlucy"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jun 25, 2015 09:12AM Jelson wrote: Zoritsa - of course it depends on what you are comfortable with, but NOW is the time to either bring someone with you - or bring a some type of recording device - as you are learning more about your diagnosis and treatment options. Of course you don't need someone with you on all of your doctor appts, but I found it most helpful in the early stages when you don't have all the info yet. The person with you can actually write down info from the discussion. good luck with all of your appts. ",
      "MessageIndex": 1,
      "PostDate": "25/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832896",
      "Title": "Bringing someone to appointments Zoritsa Kicks"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Aug 4, 2013 08:02PM Jelson wrote: No Colleen 2, I don't think you are interpreting the lack of response accurately. I think the problem is not many ( of the literally thousands of women on this website who have been diagnosed with BC) have had your experience. Your first responder mentioned scar tissue possibly being the problem and you have had biopsies which may have left scar tissue. That is a reasonable cause for the hardness - hold on to that thought. Hoping your results are benign! Julie E",
      "MessageIndex": 6,
      "PostDate": "04/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/808617",
      "Title": "Post wire-insertion - Should I be worried? Colleen_2 Colleen_2"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Sep 8, 2015 11:53AM Jelson wrote: your doctor should be advocating for you with the insurance co to get your mri bill paid since she/he ordered the test. Perhaps informing her of this gene mutation might provide further evidence that the Mri was medically necessary and that future diagnostic tests will be necessary. Why don't you ask what tests she will perform the 3 month/6 month check up. maybe not as expensive as the first round? also, does your insurance have an annual deductible? you might be close to meeting it this year - if you dawdle, you might have to start at $0 again and incur more out of pocket expenses next year. Please take care of yourself. A month after my annual mammo I had an odd feeling in my breast which amazingly enough, my primary felt. he sent me for an ultra sound - enlarged milk duct - gave me the choice of another ultrasound in 3 months or referral to a breast surgeon - I dawdled a few weeks - chose the BS, who looked at the mammos said it was nothing - but suggested another ultrasound in 3 months - at that ultrasound the duct had become blocked by debris - because I already was a patient of that BS, I quickly got a biopsy which was found to be DCIS , grade 3 and I proceeded to have a lumpectomy. My take away from this was it might have gotten picked up in my next year's mammo, but maybe not. I am thankful that it was caught early. If you have something, which I hope you don't, I hope it is caught early too.",
      "MessageIndex": 2,
      "PostDate": "08/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/834833",
      "Title": "How long would you wait? Chanty Chanty"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Apr 2, 2016 09:43AM Jelson wrote: ovoid just means egg-shaped, it could very well be benign. here is an article which while it gives no answers, gives some possibilities www.medscape.com/viewarticle/7... You are right that unlike your case, there is a specific place to biopsy in your friend's breast and neither of you will know anything until the biopsy results. I am glad that you are recovering well. you are a good friend.",
      "MessageIndex": 2,
      "PostDate": "02/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/842715",
      "Title": "Friend with ovoid nodule... Getting ready for Bx Cathy_pa Cathy_pa"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Aug 25, 2011 06:52AM Jelson wrote: go get the surgical and pathology reports and any scans and reports of scans yourself. You do not need to wait for the doctor to return from vacation or some team meeting. re necrosis. Many women with DCIS have necrotic cells - which have not escaped the duct - ie not invasive! please take comfort in that. Julie E",
      "MessageIndex": 4,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/773633",
      "Title": "so upset and frustrated belleeast belleeast"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jan 19, 2011 09:47AM Jelson wrote: Thank you so much ladies, I have shared the thread with my friend and she has expressed much relief. You have given alot of information on what to expect and practical suggestions  for recovery. She will be having nodes removed, I didn't get the impression that the surgeon was going to remove only the sentinal node. Julie E",
      "MessageIndex": 8,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763559",
      "Title": "Prep and after unilateral mastectomy Jelson terry54"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "May 28, 2013 08:07PM Jelson wrote: just wanted to share a posting on lymphedimvas which I found on my favorite website, boingboing.net  - a kind of geeky current events, maker, science fiction, what have you website. http://boingboing.net/2013/05/28/r-stevens-of-diesel-sweetie.html#more-232740",
      "MessageIndex": 782,
      "PostDate": "28/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Mar 6, 2017 04:44PM Jelson wrote: no reason to freak out or tell anyone - which would amplify the freak. glad you are pursuing this. many many benign causes possible. keep us posted.",
      "MessageIndex": 1,
      "PostDate": "06/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853236",
      "Title": "Sure it's nothing buuut... katt88 katt88"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Mar 19, 2013 09:45PM Jelson wrote:  I would hesitate to even guess. all we can say here is statistically speaking it is probably not breast cancer. However, you are in pain and whatever it is needs to be checked by a physician, both to get you on the road to ending your discomfort and hopefully gaining you some peace of mind. You have a legitimate reason to go to the doctor. Please do so. Julie E",
      "MessageIndex": 3,
      "PostDate": "19/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/802064",
      "Title": "ge to get breast cancer Peoplelover Peoplelover"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jul 18, 2013 11:11AM Jelson wrote: so sorry about your loss and your recent diagnosis - but I want to address your concern about being a burden to your daughter. the fact that you are now nearby is a blessing TO HER. although you moved on the assumption that you and your husband would be healthy and independent for many years - I am sure that your daughter was looking down the road to when you and your husband would need her support. sure it happened sooner than expected. but caring for/looking out for a relative long distance is a major strain. You have made it much easier for her, your proximity is your gift. Now kick cancer's butt! Julie E",
      "MessageIndex": 6,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/807919",
      "Title": "Hubby died of cancer 3 mo. ago, now I have breast cancer. Evelou40 bevin"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "May 3, 2015 09:40PM Jelson wrote: if it is, the gene mutation hasn't been discovered yet. there does seem to be a correlation between breast cancer and melanoma but it could be due to greater diligence regarding screening for skin cancer among women who have had breast cancer . In any event do get that spot checked and good luck with that and your breast test results.",
      "MessageIndex": 4,
      "PostDate": "03/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830996",
      "Title": "Breast Cancer and Melanoma Genetic? JenniferCanada JenniferCanada"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Sep 29, 2009 08:17AM Jelson wrote: I am keeping watch. I am part of Heidi's vigil.",
      "MessageIndex": 718,
      "PostDate": "29/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Sep 8, 2015 02:25PM Jelson wrote: glad you are acting on this!! I wish you much luck!",
      "MessageIndex": 4,
      "PostDate": "08/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/834833",
      "Title": "How long would you wait? Chanty Chanty"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Nov 11, 2009 03:40PM Jelson wrote:  Jenny, After having successfully argued for the test, I had blood drawn at my medical oncologist's office. I was told it would take three weeks, I got a call from the doctor in less than two weeks and he said the results showed I was an extensive metabolizer. I have asked his office for the lab results in writing and when I get them, I will report back to you where the lab work was actually done. Like, too good to be true.... Did you arrange for the test yourself or through your doctor? was it the blood test or the cheek swab? If it is almost four weeks, maybe you should start following up. Hope you are found to be an extensive metabolizer too! Julie E Julie E",
      "MessageIndex": 1,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/743694",
      "Title": "cyp2D6 testing jennytwist san4850"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jelson wrote: I am researching at the request of a friend who is having a single mastectomy without reconstruction on Friday. I sent her the threads from this board on preparation and what to expect and it is has totally freaked her out. I am just hoping that having surgery on only one side is much less immobilizing than surgery on both sides. Would it be safe for me to tell her that most of the advice is for double mastectomy which causes more than twice the discombobulation than a single? Or would I be totally off base? Any suggestions would be appreciated! Julie E Dx 4/17/2009, DCIS, <1cm, Stage 0, Grade 3, 0/0 nodes, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763559",
      "Title": "Prep and after unilateral mastectomy Jelson terry54"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Sep 1, 2018 04:21PM Jelson wrote: so sorry you had this experience, but happy for the outcome and lessons learned. Also grateful that you shared it. Have you considered informing your original doctor of the mistake made by this radiologist practicing outside of his field of expertise?",
      "MessageIndex": 1,
      "PostDate": "01/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866954",
      "Title": "I learned an important lesson with this scare madalaine CindyNY"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Nov 7, 2009 09:22PM Jelson wrote: Hi Weezee, this is the first of your posts that I have seen, I reviewed your older ones but I don't know how other posters responded, so pardon me if I go over old ground. In addition to the discussion boards, this site has a wealth of information about protocols for diagnosing and treating breast cancer. For example, I wondered whether your sister had an oncotype test done? I found info about it here: www.breastcancer.org/symptoms/...  The results are an actual number score which gives the doctor and patient a good idea about whether the patient will actually benefit from chemo. Also, there is information on the hormone therapy which will benefit your sister if her cancer is estrogen+. The different types of hormone therapy are explained on this site here: http://www.breastcancer.org/treatment/hormonal/ Although I am post menopause, because I have been diagnosed with Ductal Cancer In Situ, I am taking Tamoxifen which is actually what most of the premenopausal women take. I have been taking it since September and have not felt any ill-effects. Tamoxifen was the first of the anti-estrogen drugs and originally it was recommended for all women who had estrogen + breast cancer. There are now new drugs which are options for women who are post-menopause whether surgically, chemically or just by plain old age! I consider myself fortunate, if I am to have cancer,then I am glad that it is estrogen + because then I can benefit from hormone therapy!!  If you have not already done so, I would also suggest you check out the Older Women's forum which you will find if you scroll down the discussion board.  This is a terrible blow to your sister who has been dealing with so many issues, how lucky she is to have you, now you take care of yourself!  Julie E",
      "MessageIndex": 1,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/743458",
      "Title": "hormone therapy weezee mawhinney"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Nov 17, 2009 08:58AM Jelson wrote:  Dear Liz, http://community.breastcancer.org/forum/34/topic/729220 under get together there is a thread looking for people from the albany area, the originator of the thread is Bethie1 perhaps you could pm her, she was last active on the boards at the end of october. I joined www.Hopeinthboat.org a dragon boat team for breast cancer survivors in the Albany area soon after my diagnosis. At least one member is on the board of CRAAB a capital district breast cancer support organization through which you might get connected to others. Here is the their website http://www.craab.org/ If my neighbor hadn't been diagnosed a month before me and hadn't been visiting in Burlington Vt, on the day of a dragon boat festival in which Hope in the Boat competed, I never would have heard about the team or subsequently CRAAB, through a member of the team. My neighbor linked up through a yoga instructor with another woman who had recently been diagnosed . Since I assume you are looking to share experiences with survivors at a similar stage to yours, I wouldn't presume to suggest our getting together for lunch, but if you are interested, I am available and love to lunch! Julie E I",
      "MessageIndex": 11,
      "PostDate": "17/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743611",
      "Title": "Is there anyone from upstate new york area? ead Jelson"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jul 31, 2016 11:41AM Jelson wrote: my history was a lump which on ultrasound turned out to be a dilated duct which several months later upon follow-up ultrasound appeared clogged with cells at which time a biopsy was performed and revealed DCIS. I think what is positive about your experience is that you have seen no change over time. from my uneducated perspective - the issue is what is causing the duct to dilate? benign debris or rapidly growing dcis cells - which in my case caused the subsequent ultrasound to appear different. - the needle biopsy is the gold standard - I hope your results are benign - but I think you are doing what you need to do, and if bc is found you are catching it VERY early.",
      "MessageIndex": 7,
      "PostDate": "31/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/831605",
      "Title": "Debris filled duct Kellie76 Kellie76"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Nov 28, 2009 05:15PM Jelson wrote: anal doc butt doc, anal-y-cyst? Miriam, ...probably like you, Farah Fawcett is the first time I ever heard of anal cancer. Will check with Dr.Google. Now, If it comes to a colostomy - I know several people who have lived with them for years, so I can help out AT THAT END. Julie E  ",
      "MessageIndex": 3,
      "PostDate": "28/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/744537",
      "Title": "Me, My Groin Lump, and Farrah Fawcett mshalto awb"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Jan 16, 2015 04:04PM Jelson wrote: don't you fee silly. feel relieved, as we are for you and as I am sure that technician was as well.",
      "MessageIndex": 13,
      "PostDate": "16/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827590",
      "Title": "Very concerned and not sure what I need to do Candicesmith86 Candicesmith86"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Aug 7, 2013 02:05PM Jelson wrote: Lolasimply- I am assuming that your regular doctor did a routine breast exam? and found something and instead of alarming you,  since you were approaching routine screening age, strongly suggested you book that first mammogram. As a result, gave you a month relatively worry-free - a gift. Hoping that whatever it is lurking in your breast is benign - but in any event - keep writing!!!! you have a very engaging way of expressing yourself.",
      "MessageIndex": 10,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808938",
      "Title": "my cancer scare story.. long but i needed to get it out. sorry. lolasimply ericka5"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Sep 8, 2009 09:54AM Jelson wrote: Dear Cupid, I can imagine how you feel, like if it wasn't cancer, why did I have to go through all that, pay for and be left damaged? Those are valid questions and you have a right to be sad and confused, but as newday 1976 advises, you can move forward and accomplish what you set your mind to do. Eventhough you didn't have cancer, there are postings on this website that might be of reassurance to you. I checked under Support and Community Connections and there is a discussion board for Young Women -  under age forty and I found a thread discussing childbirth after breast cancer and breast feeding - and I bet there are other threads having to do with breast feeding on that discussion board. When you are pregnant, inform your OB/GYN about your breast surgery and what you were told.  You communicate in English very well. Good luck to you! Julie E",
      "MessageIndex": 5,
      "PostDate": "08/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/740030",
      "Title": "waited for biospy and got result today (papilloma) cupid104 Eagle713"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Mar 6, 2013 04:40PM Jelson wrote: Hi, I too researched it and chose not to ask for it, before being told I wasn't even a candidate due to my tumor having been too close to the skin surface. Here is a lengthy discussion thread from the DCIS board  community.breastcancer.org/for...  for me, 7 weeks of radiation were doable, the facility was close by, went in the morning and kayaked in the afternoon! If you lived far from the radiation facility or had problems with scheduling, the convenience of one week seems to be the primary, if not only reason to choose brachytherapy. Problems with outcomes seem to be related to radiologists not following the protocols regarding to which candidates it should be offered. I would question why the radiologist thinks it is the best alternative - outcome-wise for you in particular. Good luck whatever you decide.",
      "MessageIndex": 2,
      "PostDate": "06/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/801462",
      "Title": "brachytherapy? Anyone having or have had this method? Lorial1962 Cowgirl13"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Dec 10, 2015 03:12PM Jelson wrote: blakedots - I am sorry you had to go through this scary painful experience - but I am glad you acted on your instincts to pursue this and glad that it was found to be benign.",
      "MessageIndex": 3,
      "PostDate": "10/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/837372",
      "Title": "Cyst Aspiration Turned Into Needle Core Biopsy blaketots blaketots"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Oct 22, 2014 11:28AM Jelson wrote: I think excisional biopsies used to be more common and that the preference now is for needle/core biopsies instead. However, in your case ( you are special!) it sounds like twol physicians have agreed that the excisional biopsy is better.  As mentioned by Blessings2011, the alternative to an initial excisional biopsy (with general or local anesthesia!!) might end up being multiple little biopsies.  good luck with your procedure and I hope the results are benign.",
      "MessageIndex": 3,
      "PostDate": "22/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825640",
      "Title": "Express lane from mammo to excision. Anyone btdt? starcloaked starcloaked"
    },
    {
      "AuthorID": "Jelson",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83580/profile",
      "Content": "Oct 22, 2014 01:37PM Jelson wrote: I agree with Wrenn, about not telling them since you don't have answers to the questions. However, being weirdly secretive might make them even more upset. I would delay saying anything until you have to, if they find/hear something - you answer their questions, if not, the day before the biopsy, you could say you are going in for testing because there was something that needed to be looked at more closely - or something like that?",
      "MessageIndex": 6,
      "PostDate": "22/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825640",
      "Title": "Express lane from mammo to excision. Anyone btdt? starcloaked starcloaked"
    }
  ]
}