{
  "AuthorID": "Jen2Mom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283287/profile",
  "Posts": [
    {
      "AuthorID": "Jen2Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283287/profile",
      "Content": "Jan 20, 2019 08:36PM Jen2Mom wrote: First session of 30 tomorrow. A bit nervous but at least I'm off from school tomorrow and it's a short week this week (I'm a teacher). Ready to get this part behind me!",
      "MessageIndex": 167,
      "PostDate": "20/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Jen2Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283287/profile",
      "Content": "Jan 21, 2019 07:36PM Jen2Mom wrote: My session went well although I was nervous I wouldn't get to start today. I was called in early for a 2nd CT to confirm everything bc I had my expanders expanded one more time before RADs. I swear the RO said it wouldn't change my measurements he was just more concerned with the skin and my PS said that one more a week before would be fine. After the CT, results showed no changes so I was good to go. I can already tell my armpit will probably be a problem area, I'm paying special attention to it!",
      "MessageIndex": 179,
      "PostDate": "21/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Jen2Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283287/profile",
      "Content": "Jan 24, 2019 08:14AM Jen2Mom wrote: Has anyone experienced mouth sores during radiation? I've only had 3 treatments but today I woke up with the corners of my mouth red and painful, almost like cold sores...I've never had issues with cold sores before...is this a related side effect or have I picked up something new?",
      "MessageIndex": 210,
      "PostDate": "24/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Jen2Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283287/profile",
      "Content": "Jan 11, 2019 10:10AM - edited Jan 11, 2019 10:11AM by Jen2Mom Hello all! I went today for my CT scan and tattoos. Will go for my simulation next week. I have to say that today was very emotional for me. Even though I have had a double mastecomy and going through a recontruction, I guess I haven't really seen the mastectomy as a cancer treatment but more as a surgery but today it hit me hard that this really is a cancer treatment...I have/had (what is the correct tense?) cancer. I also returned back to work this week (I am a teacher and I've been off since before Thanksgiving), so I think the emotions plus the exhaustion just hit me hard today...so here's to so laser beams and cancer free ladies!",
      "MessageIndex": 72,
      "PostDate": "11/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Jen2Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283287/profile",
      "Content": "Jan 25, 2019 05:12PM Jen2Mom wrote: Finished up week one and celebrated with Starbucks. Does anyone else treat yourself when you finish each week? I def seem more tired this week and I'm ready for bed by 830 each night but I keep thinking it's too early for RADS fatigue after just one week? OTMom: I'm so sorry you are feeling the exhaustion but I'm so glad you listened to your body and took time to rest today Misha: I'm sure your kiddos miss you and can't wait to have you back. I was gone Thanksgiving till after Christmas and everytime I'm out for an appt the next day my students say \" you're back\" like they expect me to be gone forever again",
      "MessageIndex": 226,
      "PostDate": "25/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Jen2Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283287/profile",
      "Content": "Jen2Mom wrote: Now that my life has settled down, I have my surgery, radiation behind me and 1 month of tamoxifen on board, its time for a checkin at the MO tomorrow and I have no idea what to ask...my mammaprint results came in \"fabulous\" so I feel like whenever I mention \"is there cancer floating around in my body and spreading\" I get brushed off because of my mammaprint results and HER-. I am going to ask about a bone scan, I never had one and hear lots get them especaially if you are on hormone therapy...but what else should I ask for? What blood tests and scans should I be looking for her to perform? Dx 9/28/2018, IDC, Right, <1cm, Stage IB, Grade 1, 1/12 nodes, ER+/PR+, HER2- (FISH) Surgery 11/15/2018 Lymph node removal: Right, Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Radiation Therapy 1/20/2019 Whole-breast: Breast, Lymph nodes, Chest wall Hormonal Therapy 3/10/2019 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/870790",
      "Title": "What to ask at your 3 month follow-up? Jen2Mom gb2115"
    },
    {
      "AuthorID": "Jen2Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283287/profile",
      "Content": "Dec 11, 2018 07:20AM Jen2Mom wrote: Hello all and I'm glad to find this forum. I had a dmx with TE on Nov 16. Seem to be healing well but I am so tired! Anyone have any idea when this post surgery fatigue will get better? I met with the oncologist last week and she ordered onoxtype and Mammaprint, I'm er/pr positive and Her- so I know tamoxifen is in my future but she is leaning towards no chemo unless the tests show otherwise. My tumor ended up being grade 1 (it was grade 2 at biopsy???) and 7mm but I did have a pesky lymph node that was positive. I'm glad no chemo, but the lymph node scares me! When I asked about stage, she said 1b, but I thought the lymph node put you in stage 2???",
      "MessageIndex": 322,
      "PostDate": "11/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "Jen2Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283287/profile",
      "Content": "Dec 11, 2018 03:29PM Jen2Mom wrote: How long did it take you to get your onxyotype results back?",
      "MessageIndex": 324,
      "PostDate": "11/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    }
  ]
}