{
  "AuthorID": "Jen44",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
  "Posts": [
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 8, 2008 07:33AM Jen44 wrote: Hi Caithi and museumlover, Are either of you near where the fires are?  The reason I ask is that many people I know that have never had problems with their noses or sinuses have been having trouble because of the smoke in the air drying out the membranes.  It is the same thing that can happen during the winter time because of using heaters.  My son and I have always had trouble with nose bleeds and have had to have our noses cauterized because of them.  You may want to try getting some saline solution to put in your nose at least once a day.  This will help moisten the membranes and should help with the nose bleeds.  I have had this problem since I was a child so I don't think it is cancer related.  That being said I would still mention it to your doctors just so they know what is going on.  Hope this helps. Keep laughing, Jenny",
      "MessageIndex": 5,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/708622",
      "Title": "Blood in nose? Caithi Caithi"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 24, 2008 10:08AM Jen44 wrote: Hi Bettysgirl and Delena, I am so sorry that you both have had to join our group but glad that you found us.  Unfortunately the hiding thing is not an uncommon thing, as I am sure you will see as you read different stories.  I was having ultrasound's done every year watching a cyst when my was found on the right side.  Went through two lumpectomies and had left side ultra sounded twice to make sure there was no cancer.  Oncologist decided to have MRI done before starting chemo.  Found out there was cancer on the left side that couldn't be seen with mamo or ultrasound.  Had double mastectomy and when path came back found out there had been another tumor in the right breast that hadn't shown up anywhere.  So as you can see we can do everything that we are suppose to do and this thing can still be hiding.  I am so thankful that my oncologist ordered the MRI.  I truly believe she saved my life.  The left side also had 5 nodes positive!  Just know that we are all here for you and will walk this road with you for as long as you want us to.  Delena- trust me when I say you are not the only person on these boards that has felt like doing nothing but cry.  Just know that you are now alone in this and you will make it through.  Keep laughing, Jenny",
      "MessageIndex": 4,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/709603",
      "Title": "newbie here bettysgirl Dee42"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jan 17, 2008 04:16AM Jen44 wrote: Linda that is such great news!  What a great start to a new and wonderful year. God bless, Jenny",
      "MessageIndex": 8,
      "PostDate": "17/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698663",
      "Title": "Scan Results In kenzie57 LoriFL"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 29, 2008 03:55PM Jen44 wrote: Hi Deb, I also had 6 rounds of TAC, my last one was March 3rd.  I was 44 at time of chemo.  I had the same meds given to me as the other ladies, but my experience was somewhat different. I also had a Nulesta shot the day after my treatment to help with my white blood counts.   My third and fifth treatments were my worst for some reason.  I did have some dizziness with my first treatment that I didn't have with the others that my oncologist thought was a result of my body adjusting.  I had problems with muscle cramps with treatments 3 through 6, but it wasn't anything I couldn't stand.  I found that if I was able to make myself go for walks it helped, it didn't take it completely away but it did help.  I know that many woman have trouble with mouth sores but I was very blessed and never had them.  I used the Biotin toothpaste the whole time I was on chemo as a preventative and it must have helped because I have always had trouble with mouth sores but I didn't have any during treatment.  The lack of taste buds during treatment is what I hated the most.  I found that I couldn't stomach water for about a week after treatment so I lived on lemonade and iced tea.  I know that TAC is a much harsher treatment, but it is truly nothing to be afraid of.  There is the potential of side effects no matter which treatment you have.  The up side is there is so many different medications these days to help us with those side effects.  The other good thing about TAC is it doesn't last as long as doing the AC and then the T.  TAC is usually either 4 or 6 treatments whereas the other is usually 8 treatments.  I wish you luck in your decision.  Like Kati said, no chemo is fun - but I don't think it's as scary as we make it out to be in our minds. Keep laughing, Jenny",
      "MessageIndex": 5,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/714642",
      "Title": "TAC treatment??? Help! Passenger59 BikerChick"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 30, 2008 05:12AM Jen44 wrote: Hi prayinghands, Being scared is perfectly normal at this stage of the game.  We have all been there, but as Jule said over 80% of these things turn out to be benign.  I want to tell you to try and relax because at this point you are still cancer free, but I know from experience that is easier said than done.  I will be praying that everything comes back negative.  Be good to yourself and let us know how things turn out. Keep laughing, Jenny",
      "MessageIndex": 4,
      "PostDate": "30/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/714659",
      "Title": "newbie prayinghands lvtwoqlt"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Dec 6, 2007 12:12PM - edited Dec 6, 2007 12:12PM by Jen44 I am a bilateral as well - 2cm and 4mm IDC on right and 1.8cm IDC on left. ",
      "MessageIndex": 30,
      "PostDate": "06/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/696282",
      "Title": "Are most BC's in the right or left? gscott geebung"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jan 17, 2008 04:27PM Jen44 wrote: Hi ckay, First off I am sorry that you had to join our little group, but glad that you found us.  You will find a lot of support here. I don't understand why they are suggesting a mastectomy for you.  I would agree that I would think a lumpectomy with radiation would be the road they would be leading you done.  I originally had a 2.5 cm mass (IDC) and 3 lymph nodes positive an lumpectomy is what was suggested.  I was still getting chemo because of the nodes being positive, but the lumpectomy was presented as the best surgery.  Have you asked your doctors why they feel that is your best bet for recurrence?  All the research that I have done wouldn't seem to support that.  I know I am not a doctor, but it just seems odd to me.  Ultimately you have to do what you feel comfortable with, but as long as you are comfortable with the lumpectomy route that is what I would do. Keep laughing, Jenny",
      "MessageIndex": 1,
      "PostDate": "17/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698724",
      "Title": "what is best type of surgery? ckay ckay"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Aug 21, 2008 03:15AM Jen44 wrote:  Oh Deb,  That is such great news!!!  I will continue to pray the counts keep going down and the eyes keep looking up and seeing single! Lots of hugs, Jenny",
      "MessageIndex": 218,
      "PostDate": "21/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719376",
      "Title": "OK...the docs have a plan. AlaskaDeb LuAnnH"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Aug 22, 2008 02:35PM Jen44 wrote:  That's right Deb,  slow and steady wins the race and you are going to win this one!",
      "MessageIndex": 242,
      "PostDate": "22/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719376",
      "Title": "OK...the docs have a plan. AlaskaDeb LuAnnH"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 8, 2008 12:30PM Jen44 wrote: Hi kiwi72, I wish I had the answer for you but sadly I don't anyone will be able to.  This is definitely one that you will have to decide for yourself.  I can tell you what I think I would do if I were in your spot, but no one really knows for sure unless they are in the same spot.  I will be praying that God will show you what is best and that with all that is going on that you will be able to hear him.  I also wish I knew how this will affect the baby, but you are right when you there isn't a lot of things out there about this.  About the closest situation I know of is my friend that has Lupus.  She had been on steroids for about two years when she found out she was pregnant, they didn't think she could get pregnant.  There was a lot of concern about how the steroids would affect the baby, short and long term.  Well the baby was born very healthy.  She is now almost 11 years old and she had no more health issues than any other child her age.  I wish you the best and I will keep praying for you and your baby. Keep laughing, Jenny",
      "MessageIndex": 2,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/708710",
      "Title": "chemo while pregnant??? kiwi72 DoreenF"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 9, 2008 08:53PM Jen44 wrote: Hey kiwi72, To send a PM to someone go to your home page and press on the black Private Message box.  You just need to now the screen name of the person you want to send it to.  It is very much like sending an email. Keep laughing, Jenny",
      "MessageIndex": 14,
      "PostDate": "09/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/708710",
      "Title": "chemo while pregnant??? kiwi72 DoreenF"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 4, 2008 10:11AM Jen44 wrote: Hi bluewillow, I have no way of knowing if it is a blood clot so contacting your doctor about it is the best idea.  That being said I also have trouble with leg pains since chemo, I finished in March 08.  It was worse during chemo, but I still have problems when I have done a lot of walking or bike riding.  There have been some days that my legs hurt so bad that my kids laugh and say I look like a little old lady when I am walking.  My doctor said that the chemo can be hard on the muscles and it will just take time for everything to get back to normal, sometimes as long as a year.  I had six rounds of TAC.  I don't know if that makes a difference, but I do know that chemo in general is hard on our bodies and it just takes time for our bodies to recoop.  I hope this helps relieve your mind in some way.  I would still contact your doctor, but I would jump to the conclusion that it is a blood clot.  Let us know what you find out. Keep laughing, Jenny",
      "MessageIndex": 2,
      "PostDate": "04/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708517",
      "Title": "Signs of DVT? Help-- scared! bluewillow bluewillow"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jan 8, 2008 05:22AM Jen44 wrote: Hummer, It sounds like you have a wonderful family.  That will help with this in ways that you never knew.  I am so sorry that you are having to deal with this.  I think you will find that many of us did the right things only to still be hit with this.  I was going to have a check up for a cyst that we had been watching only to discover that the cyst was gone but I now had cancer.  I had an ultra sound the year before and it never showed up.  After having two surgeries and moving onto chemo I had an MRI.  Come to find out I had cancer in the other breast as well that never showed up on ultrasound.  Had double mastectomy and a third tumor was discovered in the original breast that never showed up even on the MRI.  Needless to say cancer can be very sneaky.  We can do all the right things and it just doesn't matter.  Other people can do all the wrong things and never get it.  Who knows why things happen the way they do.  We just have to try and see the blessings we have in spite of it, like our families.  God is good, even though I know some question that when they get diagnosed.  I am glad that you have a good family to draw strength from as well as the wonderful people on this site.  If you let them they will be a great source of strength for you through this new journey of yours. Keep laughing, Jenny",
      "MessageIndex": 8,
      "PostDate": "08/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698053",
      "Title": "Just diagnosed hummer Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jan 8, 2008 05:13PM Jen44 wrote: Hi K, TAC is Taxotere, Adriamycin, and Cyclophosphamide.  All three drugs are given on the same day for 4 or 6 treatments.  The treatments are every 21 days.  They are the same drugs that most everyone else is getting as two sets of 4 treatments, just all three at once.  I just had my third of six last week.  I hope that helps.  Let me know if you have any other questions. Keep laughing, Jenny",
      "MessageIndex": 10,
      "PostDate": "08/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698053",
      "Title": "Just diagnosed hummer Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jan 9, 2008 05:07AM - edited Jan 9, 2008 05:08AM by Jen44 Hey Hummer - Just a little something to help the laughter: A preacher was hunting deer in the forest when he tripped over a rock. He fell to the ground and dropped his rifle. When he looked up, he stared into the face of a grizzly bear. Panic stricken, the preacher turned and ran off leaving his rifle behind. He ran as fast as he could and then climbed up into a tree to escape the bear. In the tree he prayed, \"Dear Lord, please let this be a Christian bear.\" Then he looked down at the bear and sure enough, the bear was praying, \"Dear Lord, please bless this food I am about to eat to the nourisment of my body.\" Keep laughing Jenny",
      "MessageIndex": 17,
      "PostDate": "09/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698053",
      "Title": "Just diagnosed hummer Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jan 8, 2008 05:13AM Jen44 wrote: Hey Angie, I am sorry that you had to join our group this way, but I am glad you found us.  There are some wonderful people on this site and I think you will find them very helpful.  I also have a 14yr old daughter, aren't they the best.  My son is 10 yrs. old and the love of my life.  I can't believe you have 4, that is wonderful.  I wanted at least 3, but my body had other ideas.  I have already been through 3 TAC treatments, only 3 more to go.  Each treatment has been a little different as far as side effects.  I guess that has been the hardest part for me, not being able to plan because you never know what is going to happen.  The take things one day at a time really does play a big part in this journey we are on.  Just do your best to keep your sense of humor and that will help more than you know.  I will be praying for you on Thursday. Keep laughing, Jenny",
      "MessageIndex": 7,
      "PostDate": "08/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698053",
      "Title": "Just diagnosed hummer Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jan 9, 2008 04:11AM Jen44 wrote: Hi Hummer, I am so proud of you.  It is wonderful that you realized that you don't have to put up with an indifferent surgeon.  There are many wonderful surgeons out there that do have compassion and right now that is what you need.  I don't care how good a surgeon may think they are, but if they don't treat their patients like human beings then they are not worth going to.  I am so glad that you have already had someone recommend a new surgeon to you.  I was blessed that I had a very compassionate surgeon.  I think it will make a world of difference in how you feel about things.  As far as the sleep thing I found that Tylenol PM worked great.  It is also something you can take while on chemo and it won't interfere with treatment.  Another thing that has helped is drinking a hot cup of night time tea.  The one that I use is Bigelow \"Sweet Dreams\" herb tea.  It has a blend of chamomile and mint.  A couple of Tylenol PM and a cup of tea and I always sleep much better.  Don't forget that a soak in a warm bath is always a good relaxer too.  Just try not to be too hard on yourself.  This is a sucky time and it will take some adjustment.  I think we as women think we are suppose to be able to handle everything with ease and when something like this happens it really throws us for a loop.  Just because we have to readjust at times doesn't mean we aren't still strong woman.  It just means we are human.  Allow yourself to be human! I hope you have a great rest of your week.  Let us know how it goes with the new doctor.  As far as the old doctor.  If you are up to it I would let them know why I was leaving.  Sadly some doctors do care and just don't realize how they are coming across.  If you let them know maybe that will help the next poor person that has to encounter them and doesn't have you strength to find someone new.  I also wanted to let you know about a website that you can go to and create your own web page to help with keeping friends and family informed with whats going on.  Having to go over things time and time again can get to be a bit much.  With the free website you can type in what is going on and they can just check there so you don't have to keep repeating yourself about the same things.  The site is www.caringbridge.org  It is completely free.  Keep laughing, Jenny",
      "MessageIndex": 15,
      "PostDate": "09/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698053",
      "Title": "Just diagnosed hummer Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jan 9, 2008 04:19AM Jen44 wrote: Hey Angie, I felt the same way about my hair.  I went first with a really short hair cut, my hair use to be past my shoulders.  My hair started falling out in lumps around day 15 after my first treatment.  It was fine that morning and then by that night it was coming out in handfuls.  I shaved it that same night.  So unless you want to shave it right away you still have a couple more weeks with your hair.  The funny thing is I was so stressed about loosing my hair, but once it was gone it was no big deal.  It is strange how we work ourselves up about things only to discover it usually isn't half as bad as we thought it would be.  You should check into the Feel Good workshop PCI offers.  If Sandy hasn't already told you about it ask your chemo nurse tomorrow and she can get you a schedule of when they meet.  It was a lot of fun.  I think you would like it.  I don't know if you saw, but I sent you a private email.  It should be in your in-box on your home page.  Hope to hear from you soon. Keep laughing, Jenny",
      "MessageIndex": 16,
      "PostDate": "09/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698053",
      "Title": "Just diagnosed hummer Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 6, 2008 12:27PM Jen44 wrote: Hey Angie, Glad I could help.  Watching funny movies has been a big part of my healing.  I truly believe that laughter is the best medicine.  I am glad to hear that you are a believer in that as well.  I found that it was also a good way for my whole family to be together and enjoy one another without having to think about the big \"C\" for awhile.  Having a positive attitude will also go along way.  Just be good to yourself and remember that it is okay to be down sometimes.  Just try not to let the down moments out weigh the positive moments.  Take care and I hope to talk to you soon. Keep laughing, Jenny",
      "MessageIndex": 3,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/708583",
      "Title": "Waiting for Treatment Plan 33rabk sierra-noel"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Dec 11, 2007 01:33AM Jen44 wrote: Hey Anita, I had a similar incident tonight at my son's play at school.  Unfortunately mine didn't come from an incident 4 year old, but from my well intentioned father.  A friend gave me a wig to try before I decided if I wanted to purchase it.  I wore it to the play tonight and in the middle of the auditorium my father promptly states \"Wow, your hair sure has grown in an awful lot since this afternoon\".  Needless to say everyone three rows up and back turn to see who he was talking about.  I had to laugh and say thanks dad, so much for keeping on a low key.  What are you going to do?  You have to just love and laugh. Keep laughing, Jenny",
      "MessageIndex": 12,
      "PostDate": "11/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/695480",
      "Title": "Boy was my face Red! yellowrose Mary-Lou"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 6, 2008 09:47AM Jen44 wrote: Hi rabk, First off I am so sorry that you are having to go through all of this.  I also had quit a few surgeries because of unclear margins and then finding cancer in the other breast.  I have to agree with you that the waiting is the worst.  Truthfully though the waiting right now is necessary to give your body time to heal some before starting chemo.  The chemicals can be very hard on your body so it is better for it to heal some before they are bombarded.  When are you scheduled to talk to an onconlogist?  Try not to think that your life has a time limit now.  The progress that has been made the last few years has really improved the length and the quality of our lives.  Everyone is on a time table of sorts.  I mean we could get hit by a car tomorrow.  Having cancer doesn't mean that we can't still live a long and rewarding life.  It just means we have to go through some crap in order to have that wonderful life, but doesn't everyone have crap to go through in one form or another.  I also have two children and I know that what we are having to make them deal with sucks, but I also pray that them having to go through something like this at such a young age will help them to be more compassionate people when they are older.  It sounds like you have a good support system and that is half the battle right there.  Just try and be good to yourself and remember that you are allowing your body some healing time before going through more treatment.  I have already been through 6 rounds of TAC and 28 rad treatments, finished May 22, 2008.  If you ever want to talk feel free to PM me.  I will keep you in my prayers.  Take care and remember that this is just the process we have to go through so we can be at our children's weddings and play with our grandkids. Keep laughing, Jenny",
      "MessageIndex": 1,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/708583",
      "Title": "Waiting for Treatment Plan 33rabk sierra-noel"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jen44 wrote: Hi everyone, I just thought I would put a bug in the ears of people with long hair that will be starting chemo.  There is an organization called Locks of Love that uses donated hair to make wigs for children that are bald.  I thought it might be something people would be interested in so they can turn a sucky situation into a positive one.  I know that most of us end up shaving our heads once it starts to fall out.  I thought if you were planning on doing this you might want to cut it short before shaving and then donating the cut hair to Locks of Love.  If you think you would be interested in doing this you can go to www.locksoflove.com to get the information on how you can donate your hair.  Just trying to find ways to help to make this crap a little more bearable. Keep laughing, Jenny Bilateral cancer(3 tumors) & bilateral mastectomy Dx 9/5/2007, IDC, 4cm, Stage IIIA, Grade 3, 8/29 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708687",
      "Title": "Locks of Love Jen44 VirginiaNJ"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 8, 2008 01:33PM Jen44 wrote: Hi rockthebald, Thanks for the article and I agree it would be nice if we had more social acceptance of baldness, but who are we kidding that is not going to happen over night.  I did go bald the entire time and saw how kids and adults looked at me when I took my son to school and picked him up or went to the store.  You as an adult can process and handle that sort of thing, but picture an 8 or 10 year old that is already having to deal with a live altering illness having to deal with it.  Sadly the problem isn't with the organization but with the people that aren't bothering to follow the guidelines of what is needed.  We have responsible women here that is why I thought this would be a good place to post.  My best friend when I was growing up had to go through chemo when she was eight years old because of stomach cancer.  I remember to this day how the kids treated her at school and at church.  Because of all her treatment she was bald for about two years when her hair came back in it was so thin she looked like an old man.  She lived with her grandparents so there was no way they could afford a wig for her, not that such thing was available for children at that time.  I know that if an organization like this had existed then it would have made a world of difference in how she felt.  I have to say she was one of the bravest people I have ever known.  She never let what the other kids said stop her, but I remember spending the night and listening to her cry because of how she looked and how she was treated.  Even adults looked and treated her funny.  It would be nice to say that as a society we had grown since then but the reality is, not so much.  As I stated before the problem with the process is people need to be more responsible and send in the hair per Locks of Loves guidelines.  I know first hand how much this program can help!  Sadly there are many children out there that need this and I just thought that the wonderful ladies here might like to help.  I know that the woman here would take the time to read the guidelines and follow them so that the hair would be able to be used and help some of the so deserving children out there.  We as adults can make the choice to go bald or cover up.  I just think these kids should have that choice as well! Keep laughing, Jenny",
      "MessageIndex": 2,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708687",
      "Title": "Locks of Love Jen44 VirginiaNJ"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 8, 2008 05:49PM Jen44 wrote: Hey rockthebald, It is funny that you should say that.  I had a woman that was in treatment with me that kept wanting to call me Sharon as well.  I wonder if you have the same friend NarberthMom, I think that is so great that your salon does that.  It would be great if more would. Keep laughing, Jenny",
      "MessageIndex": 6,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708687",
      "Title": "Locks of Love Jen44 VirginiaNJ"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Nov 13, 2007 07:28PM Jen44 wrote: Hey Roxy, I agree with caaclark I would definitely try and find a new oncologist.  The last thing you need is for the people that are treating you to be gloom and doom.  I can't even understand why they are.  My dx is much worse than yours and my oncologist is always saying that we are going to beat this, and I completely agree.  I had cancer present in both breasts at almost the same time.  Had 2cm mass in left with 5 nodes positive and 2.5 cm mass as well as 4mm mass in right with 3 nodes positive.  I am 44 with 2 children as well.  We both have way to much to live for not to be around for a long time.  Now is the time to have positive people on your side and if they can't be positive it is time to cut them loose!!!   Just remember that this is NOT a death sentence.  There are women on this sight that make our dx look like a cake walk and they are still kicking.  I really hope you consider changing doctors.  There are some really good ones out there and you deserve to be seeing them. Jenny",
      "MessageIndex": 2,
      "PostDate": "13/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/695384",
      "Title": "Back again roxy42 wallan"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Nov 14, 2007 06:13AM Jen44 wrote: Hey Roxy, Since you can't change you may want to say something to your doctors.  They are humans and may not even realize that they are putting out the gloom and doom vibe.  I think at your next visit you may want to say \"Hey, I plan on living a long life.  I have a lot to live for and it would be nice if my doctors were on board with that decision.  I know this is going to be a long journey, but it is one I plan on living through\".  It is just a thought.  I know there are many people out there that get so caught up in what they are doing that they don't always realize how their attitude can affect people.  You would think that doctors would be conscious of that, but even doctors have to reminded of things.  Just because they are doctors doesn't mean they don't make mistakes in how they act.  You will have to do what feels comfortable to you, but just remember, if they are acting like this with you they are probably doing it with other patients.  Maybe God brought you to them to be there wake up call in how they are making woman feel.  Just a thought. Good luck and keep us posted on how things are going. Jenny",
      "MessageIndex": 5,
      "PostDate": "14/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/695384",
      "Title": "Back again roxy42 wallan"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 30, 2008 05:09PM Jen44 wrote: Hey Carly68, Sadly there are no set rules when it comes to the side effects of chemo.  Different people have different side effects and it affects people at different times.  There really is no way to say what you will experience or when it will happen.  About the best we can do is tell you our experiences to give you an idea of what could happen.  I had a TAC so my side effects may not be the same as your either.  Sorry that I wasn't much help.  Good luck with your treatment and hopefully there will be some other ladies along that have had what you are going to have to help you more.  Talk care and just remember to be good to yourself. Keep laughing, Jenny",
      "MessageIndex": 1,
      "PostDate": "30/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/718796",
      "Title": "Side Effects?? Carly68 irishdreama"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jan 8, 2008 08:05AM Jen44 wrote: Angie, I have found that being honest with kids through this is the best idea.  I wouldn't go into detail about everything, but I would let them know that some things may change about you.  I have told the children in my life, which range in age from 4 yrs. to 14 yrs. that my body is going to be going through some chances while it gets rid of the cancer.  I have explained to them that there will be days that I don't feel all that great, but that is okay because once all this is over with I will be with you for a long time.  I think the most important thing is to stay positive when you talk with them.  If they need to ask questions, let them.  This is going to be a difficult road and it is okay for them to know that.  To be honest all the kids handled me being bald way better than the adults did.  I think as adults we forget how great kids are and how capable they are of handling things.  Let them know that you are going through treatment so that the cancer can be gotten rid of and you can be around to teach for many, many years.  The main thing they will want to know is that you are going to be okay, and you are.  The scary stuff is just a side effect of getting better, which will also happen. By the way, where do you teach?  I am curious because I also live in Hampton.  My son is in 5th grade and goes to Mary Peake.  Are you going to the Riverside Cancer Center for treatment?  That is where I go. Good luck and if you want to private email to talk feel free to. Keep laughing, Jenny",
      "MessageIndex": 1,
      "PostDate": "08/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698125",
      "Title": "telling my class Angie WendyK"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 7, 2008 11:29PM Jen44 wrote: Anytime flowerchild.  I know how difficult it can be to talk to family and friends.  They always mean well but at the same time usually only provide most anxiety.  If you ever want to talk some more feel free to PM me.  Take care and I hope you are able to come to a decision soon, if for no other reason than your peace of mind. Keep laughing, Jenny",
      "MessageIndex": 3,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708679",
      "Title": "can MRI miss lump?? flowerchild Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 4, 2008 01:05PM Jen44 wrote: Hi LittleFlower, Sorry that you are in this boat too, but glad that we are paddling together.  I am also BRCA negative.  I am also the first in my family on either side to have breast cancer.  I have discovered that being bilateral has had its benefits.  My oncologist hasn't had much difficulty ordering the tests she wants for me like she does with her other patients.  The insurance company doesn't seem to know what is okay and what isn't in my case so that has at least worked to my benefit.  I have also learned from research that we now seem to have about the same prognosis as unilateral which is a little comforting I guess.  Well as comforted as we can be with this monster among us.  It is good to hear that you are doing well.  What type of treatment did you go through?  I had 6 TAC treatments and then 28 rads.  Have you had reconstruction?  I am still thinking about it.  I found out the recently from my PS that my only option will be latissimus dorsi flap.  I was a little disappointed at first that I wouldn't be able to have the Free Tram or DIEP at first until I did more research.  The idea of having a 10 + hour surgery scares me a lot.  I have always had a difficult time waking up after surgery so staying under that long really doesn't appeal to me any way.  I will have me second meeting with my PS on July 9th to discuss things further.  Take care and thanks for taking the time to respond. Keep laughing, Jenny",
      "MessageIndex": 4,
      "PostDate": "04/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/708473",
      "Title": "Bilateral Breast Cancer Jen44 Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 5, 2008 10:30PM Jen44 wrote: Hey LittleFlower, No I am here in the states.  I live in VA.  I know what you mean about the surgery thing.  I had two lumpectomies, double mass, ovaries removed, and of course port removed within the last nine months.  I have been debating with whether or not I want any more surgeries either.  On the one hand I think I would like to wait so my body can rest a little and then on the other hand I think I want to just get it all over with so once I completely heal I don't have to think about it as much.  I still am not sure what I will do at this point.  I know my kids would be very happy if I choose not to do it at all.  The surgeries where very hard on them because I have a difficult time waking up afterwards.  Are you on any meds right now?  My doctor hasn't started me on anything yet.  It seems like everyone else on the boards goes on some type of meds right after they finish treatment.  Was that the case with you?   Keep laughing, Jenny",
      "MessageIndex": 6,
      "PostDate": "05/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/708473",
      "Title": "Bilateral Breast Cancer Jen44 Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 24, 2008 06:02AM Jen44 wrote: Hey LuAnn, How about the Venezuelian since Venezuelia is north of Brazil? Keep laughing, Jenny",
      "MessageIndex": 2,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709551",
      "Title": "What is exotic for BALD? LuAnnH LuAnnH"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 31, 2008 02:46AM Jen44 wrote: Just thought I would share a hug with everyone.  I figured we could all use one because of what these idots keep doing to our boards. Keep laughing, Jenny ",
      "MessageIndex": 370,
      "PostDate": "31/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702338",
      "Title": "Ladies Please Help Me,I feel Like it's crunch time.. zarowny9 Trevorrolph"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Nov 11, 2007 06:37PM Jen44 wrote: First thing to do is take a deep breath.  I know finding something in your breast that shouldn't be there is very scary.  The likelihood of it being cancer is very, very low.  It is probably a cyst, I have been getting them in my breast since I was 13yrs. old.  Even though I am sure it is probably nothing to worry about it should still be checked.  Anytime you find something unusual about your body you should get it checked.  I know that it may seem that not knowing is better, but deep down you know that is not true.  Wouldn't it be better to get it checked so that you can find out that it is nothing to worry about.  If you don't get it checked you will never be able to move past this.  Please go to the doctor and let us know how everything turns out.  Remember that you are young and the odds are so in your favor that cancer is not your problem.  Take care and I will be praying for you. Jenny",
      "MessageIndex": 1,
      "PostDate": "11/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/695283",
      "Title": "carly-breast cancer Carly92 Beesie"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Aug 30, 2008 08:32AM Jen44 wrote:  Deb, I will continue to pray that God's angels will be with you and comforting you.  I am also praying that God will be guiding your surgeon's hand and that it will be a totally uneventful surgery.  Know that all your sisters here will be with you in thought and prayer. Gentle Hugs, Jenny",
      "MessageIndex": 36,
      "PostDate": "30/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720346",
      "Title": "Dear Lord, I just scheduled brain surgery AlaskaDeb heymoose"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jan 7, 2008 08:58AM - edited Jan 7, 2008 08:58AM by Jen44 I had a wonderful Christmas.  My 14 yr. old daughter got me a CD player, because mine had died, and an Eeyore purse, I love Eeyore.  My 10 yr. old son got me an electric shaver and a brush set.  When I opened it my husband quickly stated, \"It was all his idea.  He bought with his own money.\"  I smiled at my son, since I currently have no hair I wasn't sure what he was thinking.  My son quickly put his arms around me and stated, \" I know you don't have hair right now, but it will come back and I wanted you to have these things so you can remember that.\"  I almost started to cry.  Out of the mouths of babes.  Needless to say, I think my kids are the greatest! Keep laughing, Jenny",
      "MessageIndex": 10,
      "PostDate": "07/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698026",
      "Title": "What did you get for Christmas? luckywife dash"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Nov 8, 2007 06:03AM - edited Nov 8, 2007 06:04AM by Jen44 That is so great to hear.  I am also a stage 3 sister.  Cancer in both breasts, three postitive lymph nodes in right and five in left.  Had dbl mascetomy on Halloween and starting chemo soon.  It is so good to hear about someone coming out the other end of what I am about to start and everything being clear.  Go have a great time for all of us and thanks for the update.  I REALLY needed to hear it this morning, the fear monsters are stirring. Jenny",
      "MessageIndex": 4,
      "PostDate": "08/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/695098",
      "Title": "CT scan \"normal\" mandyjayne Hattie"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 4, 2008 11:19AM Jen44 wrote: Thanks Nichola, Not that I wish the bilateral thing on anyone, but it is good to know I am not alone.  I was unlucky with the bilateral thing, but I was blessed that my oncologist had the for-site to do the MRI so the other tumors where found before I started treatment.  As bad as it is it could have been so much worse.  Thanks for taking the time to answer. Keep laughing, Jenny",
      "MessageIndex": 2,
      "PostDate": "04/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/708473",
      "Title": "Bilateral Breast Cancer Jen44 Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Aug 30, 2008 06:09PM Jen44 wrote: Hi Joni, One of the signs of lymphedema is definitely pain.  Do you have any signs of swelling or puckering of the skin?  These are also signs.  If the massaging worked before helped I would start doing that again.  It definitely couldn't hurt.  I massage both of my arms every morning after my shower as a preventative measure.  When I notice any swelling I put on my sleeve immediately and do the massaging twice a day.  The way I see it the massages can only help.  Hope things get better soon. Keep laughing, Jenny",
      "MessageIndex": 1,
      "PostDate": "30/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/720378",
      "Title": "Is this Lymphedema? JoniB Keryl"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 1, 2008 08:36PM Jen44 wrote: Hey grammyof3,  First off I am sorry that you have to be going through this crap.  That being said you have found a good place to be.  I was wondering if you have had a MRI?  The reason I ask is when the lump was found in my right breast the left had a mammo and 3 ultra sounds and nothing showed up.  Thankfully my oncologist decided to have an MRI done before starting treatment.  Turns out that I also had a tumor on that side.  When all was said and done the right side had a 2 cm tumor with 3 positive nodes and the left had a 1.7 cm tumor with FIVE positive nodes.  If we had just trusted the mammos and ultra sounds I don't think I would have been her to finish raising my kids.  I am certainly not telling you to scare you I am just telling you this because I don't think I would just trust the ultra sound because it isn't showing anything.  I think finding a new surgeon was the best thing.  I know it sucks to have to wait but having people that give a crap makes a big difference when you are having to deal with all this.  I will be praying the you will have your appointment next time and all goes well.  Make sure to come back and let us know how you are doing.  Keep laughing, Jenny",
      "MessageIndex": 2,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708372",
      "Title": "Upset and need input grammyof3 Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 1, 2008 08:48PM Jen44 wrote: Don't ever be sorry about keeping the humor.  Humor is one of the things that has gotten me through this last 10 months.  Has it only been 10 months?  It feels like 10 years.  Anyway, I am a big believer in the healing power of laughter.   Keep laughing, Jenny",
      "MessageIndex": 4,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708372",
      "Title": "Upset and need input grammyof3 Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Aug 1, 2008 09:10PM Jen44 wrote: Hi Jule, I just saw this post.  I did have the bloating the whole time I was doing chemo.  I also did TAC, 6 rounds.  My kids and I would laugh that my pregnant belly was back.  The good news is it stopped once the chemo stopped.  I talked to my chemo nurse about it and she wasn't really sure why it was happening.  I did have the weird neck thing and the chocking problem but thankfully never had to have the Heimlich.  It basically felt like things were going done the wrong pipe.  It would even happen sometimes when I wasn't eating just with my saliva.  It was very strange.   I also had problems with the muscles in my legs as well as just basically feeling out of sorts most of the time.  Again the good news is after chemo stopped the things I had been experiencing went away.  It did take a few months for some of it, but it did go away.  You are probably like me and just have all the weird stuff that can go with chemo.  I would mention it to your doctor, but it is probably nothing to worry about.  Just be careful with the chocking thing.  I hope this helps.  Feel free to PM me if you want to talk more. Keep laughing, Jenny",
      "MessageIndex": 2,
      "PostDate": "01/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/718875",
      "Title": "Odd side effects? Jule Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jen44 wrote: I was just wondering if anyone out there was diagnosed with bilateral breast cancer.  I was diagnosed Sept. 5, 2007 in my right breast.  After two lumpectomies I had an MRI before starting chemo and the tumor in the left breast was found.  The right breast was 2cm with 3 positive nodes and the left was 1.7cm with 5 positive nodes.  The doctors believe that the cancer started in both breasts about the same time.  Once having both breasts removed we discovered that there was also a third tumor, 4mm, in my right breast.  I have recently found out that this is not all that common.  I was so busy going through treatment and such that I never really gave it much thought.  My oncologist told me last time I saw her that she only had two other patients that had bilateral breast cancer and that I was the only one with the third tumor.  I guess I would just like to hear from some other ladies that also were diagnosed with bilateral breast cancer and find out how you are doing.  Thankfully all my scans have come back clear and there is no sign of cancer anywhere else.  I am just hoping that there are some of you a few more years out and still clear of this crap.  Hugs,  Jenny Bilateral cancer(3 tumors) & bilateral mastectomy Dx 9/5/2007, IDC, 4cm, Stage IIIA, Grade 3, 8/29 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/708473",
      "Title": "Bilateral Breast Cancer Jen44 Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 7, 2008 10:32PM Jen44 wrote: Hi flowerchild, I am so sorry that you are having to go through this.  I wish I could say that the three tests that you had would always show the cancer but sadly I can't.  I did have cancer in my left breast that only showed up on an MRI but once both breasts were removed I found out that I had cancer in my right breast that hadn't shown up anywhere.  I am not saying that yours is cancer but I think it might be a good idea to get it biopsied.  I know that you hate that idea, but if you are honest with yourself are you ever going to be completely comfortable again if you don't get it checked?  I know it is a big decision, but I guess what you really have to ask yourself is which decision will you be able to live with.  I will be praying for you.  I hope this helped and didn't make things worse for you.  Just try to remember that these things are usually benign, but if it were me I would still need to know for sure.  Best of luck. Keep laughing, Jenny",
      "MessageIndex": 1,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708679",
      "Title": "can MRI miss lump?? flowerchild Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Aug 21, 2008 06:01AM Jen44 wrote: Hi sha4Him44, I am sorry that you had to join us here but glad that you found us.  I wish I had your answer.  I did have reconstruction with drains, but not expanders.  For me I had the drains out in a week and was okay to be left alone because I didn't have to take pain pills anymore and was moving around pretty well.  I don't know if it is different when you have expanders.  I am sure someone with that experience will be along soon with some wisdom.  I just wanted to welcome you to the group.  Good luck with your surgery and I hope you have a great time on your trip. Keep laughing, Jenny",
      "MessageIndex": 1,
      "PostDate": "21/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719830",
      "Title": "September 18th Surgery Vacation?? sha4Him44 Jen44"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 1, 2008 04:58AM Jen44 wrote: Hi Vega, I would consider going to another doctor.  When I was younger I kept having terrible pains and went to many doctors that couldn't find anything.  After a few years I finally found a doctor that checked things out completely and found my problem.  I wouldn't just accept the doctor brushing it off.  Many times they get so caught up in thinking people are all the same that they sometimes forget that we don't always react in the same way to things.  If you know of another doctor that you could see I would certainly get a second opinion and not just accept your doctors less than supportive attitude.  Just my two cents. Keep laughing, Jenny",
      "MessageIndex": 2,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708333",
      "Title": "Good news, but frustrated. vega swimangel72"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 8, 2008 06:14AM - edited Jul 8, 2008 01:39PM by Jen44 Dear Denise, This sucks!!!  Know that we are here for you in anyway that you need us.  We will be sending up prayers and good thoughts that things will turn around and this treatment will knock this cancer on it's A*S.  Know that your sisters have their loving arms around you and that even though we can't be with you in body we are with you in spirit. HUGE HUGS, Jenny ",
      "MessageIndex": 4,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708649",
      "Title": "Off to Chemo Land denise1962 CalGal"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Feb 5, 2008 12:37PM Jen44 wrote: I had a bi-lat without recon and it took 2 1/2 hours.  I had skin sparring surgery so I am not sure if that added to the time or not.  I stayed in the hospital overnight.  I had two drains which only stayed in for 6 days.  I was very blessed that I recovered fairly quickly.  I only had to take pain meds for about 4 days and then went to Tylenol.  Keep laughing, Jenny",
      "MessageIndex": 3,
      "PostDate": "05/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/699777",
      "Title": "Mastectomy - how long? mollyr AnnNYC"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 6, 2008 01:16PM Jen44 wrote: Hi Toni, I had my bilat on Halloween last year and I had everything you are experiencing.  I am sorry that you are having to deal with it, but I can tell you it does get better.  Unfortunately for the burning and stabbing feeling there wasn't really anything that I could do for it.  The burning feeling left after a couple of weeks.  The stabbing feeling came and went for months, but it did get less and less.  When it happened I would just remind myself that it was a sign that my nerves were regenerating.  The other option is no feeling later on down the line, so as much as the stabbing feeling sucks it is a good sign.  As for the swelling my doctor sent me to a lymphodema specialest who showed me exercises and massages to do to help with it.  When you go for you appointment you may want to ask about it.  Thankfully I don't have any swelling at the moment, but it was in my left arm and in my trunk area.  I still do the things the specialist showed me in order to keep it under control.  My thoughts and prayers are with you and I hope you have some relieve soon, trust me it will come. Keep laughing, Jenny",
      "MessageIndex": 3,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708574",
      "Title": "After surgery Help Please kinde5069 kinde5069"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 7, 2008 03:54AM Jen44 wrote: Hi Meggy, I am sorry that you are going through this.  I didn't have swelling in my back but I did have it in my chest, under my arms, and in the upper part of my arms.  It started about 3 weeks after my bilat.  The good news is it did go away.  My oncologist actually said that the swelling in my chest was more from the surgery and not LD.  I did see a LD specialist and she agreed.  She did show me some exercises and massages to do to help with swelling.  She also ordered my sleeves to have on hand for my arms.  My surgery was Oct. 31, 2007.  The last time I had any swelling in my chest was around March.  I have had some slight swelling in my arms from time to time but I put on my sleeve for a couple of days and it goes away.  I would suggest talking to your doctor tomorrow about it.  I hope this helps.  Keep laughing, Jenny",
      "MessageIndex": 1,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/708608",
      "Title": "HELP! Sudden lymphedema in my BACK Meggy Meggy"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 30, 2008 01:16PM Jen44 wrote: Just thought I would share a hug with everyone.  I figured we could all use one because of what these idots keep doing to our boards. Keep laughing, Jenny ",
      "MessageIndex": 24,
      "PostDate": "30/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/595439",
      "Title": "Gathering Encouraging Stories omlivewbc Janice54"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Nov 8, 2007 06:22AM Jen44 wrote: If you have a question about something going on in your body it is ALWAYS a good idea to get it checked.  We know our bodies better than the doctors and sometimes we have to push for them to hear us.  If you suspect something is going on I would get it checked if for no other reason than peace of mind.  Most of the time these things are nothing, but don't just assume that.  Get it checked!  Good luck and let us know how it goes.  I am sure you are fine, but get it checked! Jenny",
      "MessageIndex": 1,
      "PostDate": "08/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/695112",
      "Title": "found a lump amaya cp418"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 5, 2008 08:09PM Jen44 wrote: Lumi that is the best news I have heard today.  I am so happy for you.  I can't speak for everyone, but I would be happy to still keep hearing from you.  Once you start on these boards you sort of become a part of a family and I don't think it would be right to kick a family member out because they got good news.  I mean I am now NED but I still stay on the boards.  You may not have cancer to worry about, thank GOD, but you still understand the fear that comes with thinking you do.  Thanks for letting us know.  Great news is always something we want to hear about especially in light of what has happened here the last couple of days.  Take care and I hope to continue to see your wonderful smile. Keep laughing, Jenny",
      "MessageIndex": 2,
      "PostDate": "05/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708571",
      "Title": "Good news - update on my mom's story LumiPojo mimi1030"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 7, 2008 07:08AM Jen44 wrote: Stephanie count me in on the prayers going up for you.  Hugs, Jenny",
      "MessageIndex": 85,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708563",
      "Title": "Can't Walk.... Headed to ER TripleNeg booklady"
    },
    {
      "AuthorID": "Jen44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58424/profile",
      "Content": "Jul 29, 2008 07:17PM Jen44 wrote: ",
      "MessageIndex": 17,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709839",
      "Title": "Still NED!!! Analemma Barb-FightingBC"
    }
  ]
}