{
  "AuthorID": "Jen987",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
  "Posts": [
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Mar 20, 2013 04:35PM Jen987 wrote: I am starting chemo April 1st. I get my port March 25th. I am ready to get this show on the road. Best wishes to all that will be taking this journey.",
      "MessageIndex": 1,
      "PostDate": "20/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802048",
      "Title": "Starting Taxotere/Cytoxan April 2013 indenial MsPharoah"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Mar 22, 2013 01:23AM Jen987 wrote: I start chemo April 1st also. I wish everyone well.",
      "MessageIndex": 5,
      "PostDate": "22/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 6, 2013 08:42AM Jen987 wrote: Did anyone get the license plate number of the Mac truck who ran me over, then backed up and ran me over again? Haha. So I guess I'm feeling the effects of the Neulasta injection despite taking Claritin. I can't imagine what it would feel like if I didn't take it. And I have an awful headache too. My scalp is sore/itchy and I still have a strange feeling in my mouth. Thankfully no mouth sores yet. How's my other ladies doing after getting the Neulasta injection?",
      "MessageIndex": 109,
      "PostDate": "06/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 12, 2013 09:11PM Jen987 wrote: My sister in-law sends me words of inspiration everyday and I thought I'd share today's with you all. Grant me the strength to win this battle, courage for the journey & wisdom to recognize hope in each day’s triumphs.",
      "MessageIndex": 233,
      "PostDate": "12/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 22, 2013 06:51AM - edited Apr 22, 2013 06:52AM by Jen987 I'm going this afternoon for chemo 2 also. I'll be thinking of all my other chemo buddies having their treatments today.",
      "MessageIndex": 485,
      "PostDate": "22/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 3, 2013 06:37PM - edited May 3, 2013 06:49PM by Jen987 Irene and Allie sorry to hear you ladies feel like crap. I totally understand as I ended up in E.R. twice, one week after my first chemo treatment. I was really nervous to get my second treatment last Monday. Now I'm almost 2 weeks post treatment and I feel great and didn't miss a day of work this time around. It was a breeze with minimal side effects. So I hope yours goes better next time too. Stay strong. ETA: I didn't want to get the Neulasta shot this time as I think that's what caused all my pain (killer migraine) first time.",
      "MessageIndex": 724,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 22, 2013 09:53PM Jen987 wrote: My week got worse. While on my way to work someone rear ended me at a stop light. Luckily I only got minor whiplash and my lower back is a little soar. The police came, took our info and called an ambulance for me. Not what I wanted but I guess they had too since I felt achy and my head was pounding. Once they left I was on my merry way to work in tears. Who knows where they came from. Stopped at Krogers on my way home where I was asked by a nice lady if I wanted a sample of some shampoo they were promoting. I kindly said no thank you and laughed to myself, good grief I'm bald and haven't used shampoo in a month. Made the mistake of weighing myself and I've gained 5 pounds, thank you steroids. I'm surprised my husband isn't running for the hills screaming. Hell, I don't even want to see myself naked. Needless to say a big glass of wine is calling my name tonight.",
      "MessageIndex": 1035,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jun 2, 2013 08:49PM - edited Jun 2, 2013 09:50PM by Jen987 Anne- So sorry to hear about your rollercoaster. I had the same thing happen to me (headache, minus the fever) after my first infusion with the exact same tests. Ended up in the E.R. again 2 days later with a spinal fluid leak that had to be repaired. So I feel your pain. I started to feel better after 4 days. I told my husband I'm not going back to the E.R. no matter what. I was so nervous for my second infusion. I did change from getting the Neulasta shot to giving myself Neupogen instead and didn't have the killer headache or bone pain. And ironically I now have a sore in my lady parts too. What the heck is that all about? Hope you feel better soon.",
      "MessageIndex": 1177,
      "PostDate": "02/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jun 3, 2013 12:16PM Jen987 wrote: Katie, just wanted to say Hi and I will be thinking of you as we both get our last treatment today. I thought this day would never come. I hope we have minimal side effects this round. Take care.",
      "MessageIndex": 1181,
      "PostDate": "03/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 2, 2013 10:00PM Jen987 wrote: I had my simulation today and I start rads on Monday. 35 treatments, 28 regular and 7 boosts. Basically they position you on the table and do all kinds of measurements and do a trial run. It was very easy. I was there there a total 20 minutes. Yesterday was 4 weeks pfc and I'm still doing great. Although I hate to report that my eyebrows are very thin and I have a few empty spots on my lower lashes. Top lashes may have thinned out a bit too but I am blessed with thick long lashes so it's not noticeable. Just when I started feeling good I'm starting to look sick. Ugh. Hair on my head may be growing too because my white scalp isn't showing as much. I didn't shave my head with a razor so I've always had a little fuzz. I have been taking vitamin E for the hot flashes and I think it's helping. I'm not soaking wet in the middle of the night as much as before. I also started taking Biotin so as my hair grows in it will be stronger. Have a great 4th of July and stay strong.",
      "MessageIndex": 1394,
      "PostDate": "02/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 21, 2013 07:11PM Jen987 wrote: Hello my fellow April chemo gals.  Congratulations to those finishing up and those who are still braving chemo, hang in there.  I will be 7 weeks PFC tomorrow and the hair on my head is growing in fast.  I have had to shave my legs and underarms too.  UGH.  Thought I'd be able to get through summer not shaving.  Made it through my second week of radiation, 5 more weeks to go.  Only mild redness and alittle tenderness on the lumpectomy scar.  As some have said radiation is a breeze compared to chemo.  I love my rad team.  They are so nice and compassionate.  My thoughts are with each and every one of you as you go through your chemo and surgeries.  Keep up the fight.",
      "MessageIndex": 1469,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Sep 6, 2013 02:57AM Jen987 wrote: I met with a new MO today and I really like her.  She spent so much time with me.  Unlike my old MO who would see me for maybe 3-5 minutes and I'm not kidding.  She sent my prescription for Tamoxifen over to the pharmacy but I haven't picked it up yet.  I'll be starting it on Saturday.  Hoping for minimal SE's.  She told me I could get my port out so I'll be calling my surgeon tomorrow to schedule an appointment.  I am 2 weeks post final radiation and my skin looks great.  Almost back to normal just alittle tan still.  Fatigue is still an issue though.   I usually am very active so this is very frustrating.  MO says this is normal.  It will take a while to get your body back to normal after having chemo and radiation.  My hair is growing in nicely.  As well as my eyelashes and eyebrows.  My family thinks I look good enough to go \"topless\" but I'm not sure yet.  I did dye it last weekend.  I couldn't stand the grey.  I feel more comfortable going \"topless\" in the house even if guests are here.  Take care everyone.  We are in the homestretch.",
      "MessageIndex": 1598,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Sep 21, 2013 05:14PM Jen987 wrote: So I ventured out to dinner without a hat for the first time.  It wasn't as bad as I thought it would be.  My kids didn't even notice until we got back in the car.  They are so used to me wearing nothing on my head in the house.  I had my follow up mammogram last week.  She took alot of films then I was asked to come back in for more, before I left.  Ugh.  Eventually I was told I was good to go.  Then in the mail I receive a letter that reads:Your recent mammogram examination showed an area that we believe is probably benign.  However, a six month screening is recommended.  The area of concern should never be ignored despite a normal mammogram.  REALLY, you're gonna send that kind of a letter to someone who just underwent treatment for cancer.  I wasn't freaked out but I did call the nurse and she said thats kind of a standard thing because now that I've had a lumpectomy and radiation the breast looks different than the last mammogram.  This is my new normal.  I told her that they needed to reword the letter because someone who isn't as calm as me could really worry.  haha Tamoxifen has been an experience.  I have had sleepless nights, body aches, fatigue and plan just not feeling great.  I hope the SE's subside as my body gets used to the drug. I have been trying to get a hold of the girl who schedules the appointments for my port removal and she's not returning my calls.  I'll try again on Monday.  I want it out. I hope all are healing and starting to feel alittle more normal.  Enjoy your weekend.",
      "MessageIndex": 1616,
      "PostDate": "21/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Mar 27, 2013 12:39AM Jen987 wrote: I had my port put in yesterday. It's still sore and just uncomfortable. I got some good news, I'm BRCA negative. I feel a little better knowing I won't be passing that gene down to my daughter.",
      "MessageIndex": 39,
      "PostDate": "27/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Mar 27, 2013 02:39AM Jen987 wrote: Welcome Jenny. We'll be thinking of you on Thursday.",
      "MessageIndex": 41,
      "PostDate": "27/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 12, 2013 09:21PM Jen987 wrote: Tricia81: You are in my thoughts.",
      "MessageIndex": 235,
      "PostDate": "12/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 13, 2013 07:10PM Jen987 wrote: Indenial: Yes I agree. I told people I just felt \"off\". It was hard to describe it.",
      "MessageIndex": 253,
      "PostDate": "13/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 29, 2013 12:31AM Jen987 wrote: Hate to tell you Gardengirl but that's what mine felt like before my hair started shedding. Right on schedule according to everyone else. Once I buzzed it down it felt so much better though.",
      "MessageIndex": 643,
      "PostDate": "29/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 1, 2013 08:09PM Jen987 wrote: Welcome home Tricia81. Take it easy and be kind to yourself.",
      "MessageIndex": 690,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 2, 2013 11:58PM Jen987 wrote: Anne I had my blood work done on Monday, my count was 2.0 and the nurse said she'd like it to be at least 2.5. I didn't get the shot because it was horrific last time and I didn't want it unless I really needed it. She let me go home without the injection and said just to watch for a fever. I feel great also. I go back this Monday for another blood draw. I hope my WBC has risen.",
      "MessageIndex": 711,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 8, 2013 07:53PM Jen987 wrote: I went to get my labs done on Monday and my WBC went down from 2.0 to 1.6. Weird as I feel better now than even before chemo. So unfortunately they gave they me my first dose of Neupogen. I am to continue giving myself 3 more doses, today, Friday and Sunday. Just finished injecting myself. It wasn't too bad at all. I didn't do well on Neulasta so we're going to try this instead. The pain yesterday wasn't nearly as bad as the Neulasta. Probably because you only get a small dose each time. My 3rd chemo is Monday so I hope my counts go up by then so I don't have to postpone it. Hope everyone is doing well and taking care of themselves. Stay strong.",
      "MessageIndex": 827,
      "PostDate": "08/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 20, 2013 06:51PM Jen987 wrote: Rosina - Yes I feel winded too.  I normally can workout for 2 hours at the gym and now just doing yard work yesterday had me exhausted.  This round of chemo (3rd) has me more tired in general too.  I just keep telling myself only 1 more to go.  Altough I've heard that radiation can do a number on you too as far as fatigue goes.  Oh the joys of having cancer, NOT!",
      "MessageIndex": 995,
      "PostDate": "20/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 23, 2013 05:44PM Jen987 wrote: 6cats - Just curious if you are taking Zofran? I had a migraine headache after chemo #1 that landed me in the E.R. twice. My MO said that Zofran can cause headaches so I didn't take it after round #2 or #3. I didn't get a headache. I also changed to Neupogen instead of Neulasta in case that could've been the problem too. I used Compazine for nausea instead which I only used maybe 4 total.",
      "MessageIndex": 1046,
      "PostDate": "23/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 31, 2013 12:23AM Jen987 wrote: Kerri, you'll do great. The first infusion is usually uneventful. I think everyone gets nervous of the unknown. I brought my husband the first time but have gone by myself since. He was so bored and fell asleep anyways. Haha. Days 3-4 might be when you feel your worst. Chemo isn't fun but doable. You can do it. We are all sister warriors. Check back in here so we can see how you're doing.",
      "MessageIndex": 1148,
      "PostDate": "31/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jun 3, 2013 04:54PM Jen987 wrote: I don't think my place has a bell either but if it did I'd ring it loudly. I envy everyone else who have great relationships with their nurses and fellow chemo patients. No one really talks to anyone where I go. Most are elderly ladies, I feel like a baby there. Heck one lady getting an infusion brought her daughter with her, the daughter used a walker. The poor woman was probably in her late 80's or early 90's. So sad that she was having to go through that.",
      "MessageIndex": 1184,
      "PostDate": "03/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 18, 2013 09:25PM Jen987 wrote: SHIPSGIRL - How funny. You can totally blame it on chemo brain. I'm 6 weeks PFC, wonder how long I can use that as an excuse? LOL",
      "MessageIndex": 1458,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 25, 2013 04:36AM - edited Jul 25, 2013 04:42AM by Jen987 It's interesting how each MO is different in what you can and cannot take. My MO isn't very attentive or caring either Katie. She spends literally 3 minutes with you. And that's after waiting almost 2 hours in the waiting room. I haven't liked her from day one but I just wanted to get treatment going and sucked it up. I actually told my husband the other day after an appointment with her that if my cancer came back I would not have her treat me again. I seriously would like to find a new oncologist. I am only taking 1 Biotin tablet daily (2500 mcg). Should I be taking more Katie? I started taking it about a month after my last chemo. I'm sure you can start it earlier though.",
      "MessageIndex": 1489,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 1, 2013 06:24PM Jen987 wrote: Welcome Tangles. I'm a little more than halfway done 19/35 and so far my skin is only slightly pink/tan and tender somewhat. Nothing I can't handle. It's definitely a walk in the park compared to chemo. My motto is \"lube the boob\". And stay hydrated.",
      "MessageIndex": 1204,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 17, 2013 07:58AM Jen987 wrote: Teachers1 - Don't be scared. Everyone reacts differently to Rads. Some people make it through with little to no problems. Check out this link. http://community.breastcancer.org/forum/70/topic/806495?page=4#idx_91",
      "MessageIndex": 1334,
      "PostDate": "17/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 22, 2013 12:38PM Jen987 wrote: Woo Hoo LeeLeeLynn!",
      "MessageIndex": 1086,
      "PostDate": "22/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 30, 2013 01:59AM Jen987 wrote: Heidi - I had a few days of nausea in the morning at the beginning too but haven't had any in a week or so.  I hope it subsides for you too.  I hate that feeling.  Katie - Sorry to hear about your skin issues.  Hope it works too. Stay strong ladies!",
      "MessageIndex": 1194,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 2, 2013 07:15PM Jen987 wrote: Slv58 - hope your 2 day break from Rads is soothing too.",
      "MessageIndex": 1217,
      "PostDate": "02/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 13, 2013 01:17PM Jen987 wrote: Congratulations Paula!",
      "MessageIndex": 1297,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 16, 2013 03:59PM Jen987 wrote: GoWithTheFlo - Good to hear you're on the mend. I just finished 30/35 today and my skin just recently started peeling. These last 7 are boosts so I hope the worst is over. Everyone enjoy your weekend.",
      "MessageIndex": 1325,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 17, 2013 03:19PM Jen987 wrote: LW0919 - Yes it looks like freckles. It has since peeled so now it's just light pink. Kind of raw looking but not really painful. My breast, chest and underarm have all kinds of colors going on. Good grief I'm a hot mess. 30/35",
      "MessageIndex": 1340,
      "PostDate": "17/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 22, 2013 11:39PM Jen987 wrote: MsPharoah - I agree about working. My mom couldn't understand why I wanted to continue working being my job is all physical. I have a residential cleaning business. But I felt better keeping my life as normal as possible. Don't get me wrong there were days during chemo that I dragged myself to work but I got through it. And going back to the gym a few days a week like I said kept my fatigue at bay. I wore a bra everyday. An underwire no less. From what I hear that's frowned upon. But my RO never said I couldn't. Best of luck to you.",
      "MessageIndex": 1385,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Mar 23, 2013 10:42PM Jen987 wrote: I cut my hair really short today so when it falls out it won't be so traumatizing. It took 6 minutes to style it. So far I like it. I go get my port put in on Monday. Another battle wound. Katie: How was chemo class? I haven't gone yet.",
      "MessageIndex": 9,
      "PostDate": "23/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 1, 2013 04:19PM Jen987 wrote: Hi ladies. I'm at the chemo bar having my first cocktail. Cheers to everyone else that's receiving their treatments today. Hope all goes well with everyone.",
      "MessageIndex": 64,
      "PostDate": "01/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 4, 2013 08:49PM Jen987 wrote: Day 4 after 1st treatment. I got my Neulasta injection yesterday and started on the Claritin the day before and will continue for a few days. I woke up feeling just a little achy but ibuprofen helped. I cleaned my house and went for a 2 mile walk with my son today. I figure I better exercise when I feel good. As the day progresses I am losing my taste buds. It feels very strange. Hope everyone else is hanging in there.",
      "MessageIndex": 83,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 9, 2013 11:07PM Jen987 wrote: So I ended up in the E.R. at 3:30 am Monday due to a horrific headache for 3 days. I couldn't keep anything down and I was severely dehydrated. They did a CT scan on my head that came out negative. My white blood cell count was elevated more than double what it should be so they did a chest xray thinking an infection. But that came back negative as well. So they thought maybe meningitis and I had a lumbar puncture. Guess what negative too. So after 11 hours and few different pain killers later I was sent home with no answers. My oncologist thought maybe the Zofran was causing my headaches so she had me stop them on Sunday but it didn't help. Now I'm thinking it may have been the steroids. Who knows. So here I lay with a stiff neck and sore back from lumbar puncture. I sure hope my second treatment doesn't end this way too.",
      "MessageIndex": 170,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 18, 2013 01:54PM Jen987 wrote: Ffranny: go to the top of the page and click on my profile. Then click on the tab you want to add information too. Be sure to click on public not private if you want everyone too see your diagnosis and treatment.",
      "MessageIndex": 397,
      "PostDate": "18/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 22, 2013 10:51PM Jen987 wrote: Erinm216: I'll be thinking of you tomorrow. Listen to your body and rest if you need to. Also stay ahead of the nausea and take your meds. Only problem with that is constipation. Take colace and eat prunes if you can. And drink lots of water. You can do it.",
      "MessageIndex": 503,
      "PostDate": "22/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 23, 2013 01:46PM Jen987 wrote: Pattysmiles: If you are receiving the Neulasta injection after your infusion you should take Claritin 24 hour not Claritin D, the day before you get the shot and a few days after.",
      "MessageIndex": 524,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 24, 2013 11:44AM Jen987 wrote: Kirklandgal: My hair is the same way. I only buzzed my hair down to a number 2 on the shears, I haven't actually shaved it. The top is almost gone but the sides and back are still there. Weird isn't it? I'm not sure if it will all fall out eventually.",
      "MessageIndex": 536,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 25, 2013 05:13PM Jen987 wrote: Hello ladies. Day 4 of my 2nd chemo treatment and so far so good. Just tired. Hoping I don't crash and burn like last time and end up in the E.R. two times. I am not getting the Neulasta shot automatically this time. We are waiting until Monday to see how my counts are. My oncologist thought maybe that was the cause of all my head pain. If I do need a wbc boost she wants to give me Neupogen instead. Welcome all newbies. It's not as bad as you imagine. We can do this. It may not be fun but it's doable.",
      "MessageIndex": 580,
      "PostDate": "25/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 28, 2013 02:41PM Jen987 wrote: Schoenme: I was told the anti nausea medicine they give you through IV lasts for a couple days so I didn't take any pills until day 3. I did get a little chilled my first infusion so if you want bring a blanket you could although some chemo rooms have some for you to use. My second infusion I got flushed/warm during the steroid push. So you never know. Drink lots of water. I sucked on lemon drop candies to avoid mouth sores and so far I haven't had any. I've also heard chewing on ice chips works if you are getting Taxotere. I brought magazines and my Kindle Fire to keep me occupied. It won't be as bad as you think. I'll be thinking about you tomorrow.",
      "MessageIndex": 637,
      "PostDate": "28/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 1, 2013 12:29PM Jen987 wrote: Rosina0015 - I go without a headcover at home most of the time. Scarfs and hats start to itch and I just can't take it anymore. I apologize to my family when I whip them off as soon as I get in the house. Wish I had the courage to go out in public bald. It's bad enough the sympathy looks I get with a hat on. Well, I've made it through this TX without getting the Neulasta shot even though my blood work on Monday showed low WBC. I feel good so if I can make it the rest of the week without running a fever I should be good. I haven't had a killer migraine this time around so I really think my body didn't like the Neulasta injection. The only side effect I noticed that has increased is fatigue early on. And of course my taste buds are gone again. I just keep telling myself half done, you can do it. We all can do it. Women Warriors unite.",
      "MessageIndex": 684,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 8, 2013 08:15PM Jen987 wrote: Thought you ladies might like this saying. Wouldn't it be nice if life were like a DVD...And you could fast-forward through crummy times!",
      "MessageIndex": 828,
      "PostDate": "08/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 12, 2013 02:03PM Jen987 wrote: HAPPY MOTHERS DAY",
      "MessageIndex": 890,
      "PostDate": "12/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 14, 2013 04:52AM Jen987 wrote: Speedy4, I have fuzz, although I didn't shave all the way down to my scalp. And only the gray hairs are growing. What the heck, really?",
      "MessageIndex": 918,
      "PostDate": "14/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 16, 2013 09:39PM Jen987 wrote: BeHereNow, sorry you don't feel good. Hope the nap did you well. I felt like a truck ran me over after the first round of chemo. It was awful. Take care of yourself.",
      "MessageIndex": 957,
      "PostDate": "16/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 22, 2013 09:43PM Jen987 wrote: Oh ladies this cancer sucks in so many ways. I just want to scream. I'm so thankful that we have this place because unless you've been through it it's hard to relate. My best friend had breast cancer 4 years ago at the age of forty. It was a very rough road for her. But I am thankful I have someone to talk to who has walked in my shoes and understands completely. We will get through this bump in the road although it won't be easy.",
      "MessageIndex": 1034,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 30, 2013 03:18AM Jen987 wrote: Pugmom - I believe they call them \"Taxotears\". Seems it's a SE from Taxotere. I had them for a few days but they have subsided. I've heard eyelashes and eyebrows fall out after chemo is finished. My last treatment is Monday and I can't wait to get it over with. #3 kicked my butt.",
      "MessageIndex": 1133,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 31, 2013 09:25PM Jen987 wrote: Kerri, Claritin 24 hour. Take it the day of your shot (tomorrow) and 5-7 days after. I even started it the day before just to have it my system. Then got a prescription for Ibuprofen 800 mg to help with the bone pain too. Good luck and I hope you have a great weekend without many side effects.",
      "MessageIndex": 1160,
      "PostDate": "31/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jun 7, 2013 12:53PM Jen987 wrote: Anne11595 - I'm so sorry to hear that. I hope they can figure out what it is so you can feel better soon. Hugs to you.",
      "MessageIndex": 1236,
      "PostDate": "07/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jun 17, 2013 09:14PM - edited Jun 17, 2013 09:15PM by Jen987 Well today is 2 weeks post final chemo and I feel great.  The SE's from this last round have been nothing compared to round #3.  Only complaints I had was loss of taste buds for a few days where everything tasted like crap and severe hot flashes.  The fatigued kicked my butt last round but this time I'm fine.  I even went to the gym this morning and felt great although I couldn't do as much cardio as usual but I know I'll have to work up to that.  So hang in there ladies, there is light at the end of the tunnel.  I just got back from getting blood work done and it looks good so no more Neupogen injections.  YAY!  I go for my first consultation with RO tomorrow. I'll report back on how that went.  I've heard that once you go through chemo, radiation is a walk in the park, we'll see. ",
      "MessageIndex": 1330,
      "PostDate": "17/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jun 18, 2013 11:46PM Jen987 wrote: I saw my RO today. Great experience. All the staff was so nice and they gave me a tour of the facility. I will be having my CT planning next week Tuesday. Rads will probably start early July. He said they like to wait a month after chemo ends so your body can recover. Looks like I'll have 33 treatments. Getting anxious to start this. That much closer to being done with all this cancer sh*#.",
      "MessageIndex": 1339,
      "PostDate": "18/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 1, 2013 03:27AM - edited Aug 1, 2013 03:27AM by Jen987 Yay Anne11595. Good news for sure. That much closer to being done.",
      "MessageIndex": 1521,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 1, 2013 09:49PM Jen987 wrote: Oh Heather, hang in there. Wish I could give you a big hug (gently). I know this year has been rough. I've already asked for a redo. LOL",
      "MessageIndex": 1523,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 9, 2013 09:20PM Jen987 wrote: Great to hear updates from everyone.  So I've had 25 of 35 rads and this past week my skin is really \"angry\".  Very red and somewhat painful.  Nothing I can't handle though.  I did feel fatigued last week but my energy seems to be getting better.  My hair is growing in quickly but I've lost almost all my eyelashes.  My husband thinks I should go outside without a hat now.  I'm not sure I'm ready for that. Although I was excited the other day when I had to use shampoo.  Silly I know. I am considering finding a new MO so I'm not sure when I'll be starting Tamoxifen.  Not looking forward to those SE's.  I wish everyone well and enjoy the rest of your summer best you can.",
      "MessageIndex": 1532,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Sep 19, 2013 09:29PM Jen987 wrote: Woo Hoo Anne.  Now onto healing from all that chemo.  Take it easy on yourself.",
      "MessageIndex": 1614,
      "PostDate": "19/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Sep 22, 2013 06:26PM Jen987 wrote: Just had to share what the cashier at Walgreens said: \"I love your haircut\" I didn't have the heart to tell her why my hair was so short and just said thank you. So if any of you are nervous about going \"topless\" just do it. You'll feel liberated and less like a cancer patient.",
      "MessageIndex": 1619,
      "PostDate": "22/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jan 16, 2014 07:55PM Jen987 wrote: Happy New Year.  It's time for a check in to see how everyone is doing. Well today marks 1 year since my first doctors appointment after I found my lump.  I am feeling pretty good.  I don't think I'm completely back to normal but getting stronger every day.  I am 7 months PFC and it's been 4 1/2 months since my last RAD treatment.  My hair is growing great.  It's about down to my ears on the sides but it doesn't look as long in the back because it is so curly.  It's finally long enough to get a small round brush around it so I can blow dry it some and I bought a micro mini straightener to help tame the curls.  I can't complain though, I have hair.  My skin has a slight tan on it from RADS and I can still feel twinges once in awhile from the skin regenerating.  It did take a while to get my energy back though.  Chemo and RADS kicked my ass and I didn't really feel it until active treatment was actually done.  The hot flashes are obnoxious and only made worse since starting Tamoxifen.  I haven't slept a full night since I can't remember.  My MO prescribed Gabapentin but I had to stop taking it after 3 weeks cause it made my anxiety/depression go through the roof.  I'm not sure if I'm going to pursue something else or not.  I've also had a lot of joint pain.  Anyone else?  I quit working right before the holidays.   I owned my own cleaning company for 7 years and I just wasn't happy doing that anymore and physically was wiped out.  I just needed a break, so I'll be on the hunt for a new career soon. I hope you all had great holidays and are mending well.   ",
      "MessageIndex": 1651,
      "PostDate": "16/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 2, 2013 10:29PM Jen987 wrote: Day 1 after first treatment and I feel great. Couldn't sleep much last night so got up early and went the gym to work out. Other than feeling a little flushed I'm not experiencing any other SE. I am doing the salt water/baking soda mouth rinse to stay ahead of the mouth sores. And taking stool softeners and eating prunes to avoid constipation. I haven't had any nausea but am taking my meds anyways rather than waiting for it to hit. I go for my Neulasta shot tomorrow and am starting Claritin today. Wishing all my other chemo partners well.",
      "MessageIndex": 73,
      "PostDate": "02/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 13, 2013 07:37PM Jen987 wrote: Welcome Gardengirl33. We will all get through this together.",
      "MessageIndex": 255,
      "PostDate": "13/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 14, 2013 02:34PM Jen987 wrote: Katie, my hair is shedding too. Seems to be right on schedule. I cut it short a couple weeks ago so it's not too traumatic. Looks like hats will be my new fashion accessory. Hugs.",
      "MessageIndex": 272,
      "PostDate": "14/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 15, 2013 02:00AM Jen987 wrote: Vent away. That's what we're all here for. We get it. Stay strong, we will get through this.",
      "MessageIndex": 293,
      "PostDate": "15/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 21, 2013 02:47PM Jen987 wrote: PamelaKay, are you rinsing with baking soda, salt and warm water? I did this for a few days after my first infusion and didn't get any sores. I've heard it also helps with mouth sores you already have too. I also used Biotene. Hope you feel better soon.",
      "MessageIndex": 468,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 27, 2013 01:35AM Jen987 wrote: Gardengirl3: I only buzzed my down to like a number 2. I haven't totally shaved it. Some find it painful to have a little stubble, I have not. Hats and scarfs make me itch after a while so I take them off at home and I feel more comfortable with some hair. Everybody is different. I'm actually enjoying having no hair. So much faster getting ready. Gotta look on the bright side of a dark situation.",
      "MessageIndex": 619,
      "PostDate": "27/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 28, 2013 09:51PM - edited Apr 28, 2013 09:52PM by Jen987 6cats: Not to scare you but I ended up in the E.R. twice after my first round with a killer headache. I was throwing up for days and almost crying because it hurt so bad. My MO thought maybe it was the Neulasta injection causing all the pain so this round I didn't automatically get the shot. My second infusion was Monday and I feel ok. I am going on Monday for bloodwork and I hope my counts are up so I don't have to have the injection. Did you take Claritin? If it gets unbearable call your MO so they can call in a pain prescription for you. Don't suffer. Also stay well hydrated.",
      "MessageIndex": 641,
      "PostDate": "28/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 2, 2013 08:24PM Jen987 wrote: Thanks Virginia",
      "MessageIndex": 708,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 10, 2013 01:49PM - edited May 10, 2013 01:49PM by Jen987 For those of you suffering from extreme pain from the Neulasta shot talk with your MO about getting Neupogen instead. I will be giving myself my 3rd injection today and so far the pain is nothing compared to Neulasta. It's given over a few injections instead of getting blasted all at once with the Nuelasta.",
      "MessageIndex": 859,
      "PostDate": "10/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 12, 2013 02:01PM Jen987 wrote: I thought I was starting my period a week or so but I just spotted (brown) for less than a day and that was it. I hope it's chemopause. Such weird things happen to us on chemo.",
      "MessageIndex": 889,
      "PostDate": "12/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 17, 2013 04:53PM - edited May 17, 2013 04:54PM by Jen987 Pattysmiles, my scalp started hurting right before the shedding process started. The clumps started coming out on day 14 right on schedule. I had my husband buzz it down to a #2. It felt so much better.",
      "MessageIndex": 976,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 22, 2013 03:02AM Jen987 wrote: So far this week sucks. Had my blood work done yesterday and my counts were so low that I have to inject myself daily with Neupogen until Sunday. At least doing it every other day I had a good day in between without pain. And was put on an antibiotic as a precautionary measure. Saw my MO too who had me schedule an appointment with a RO. Geez I just want to get through chemo before worrying about radiation. Today I had to take my son (21 yrs old) to have surgery on his elbow which was broken by someone beating him with a crowbar. His house was broken into last Monday and him and his roommate were held by gunpoint. What a nightmare. While he was in surgery I had to have a pilar cyst removed from my head and a suspicious mole biopsied. Then back to the hospital to pick him up. So now my head hurts on top of my body feeling like crap from the injections. I'm starting to get crabby which isn't like me. Oh well this too soon shall pass. Sorry for venting.",
      "MessageIndex": 1012,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 23, 2013 07:40PM Jen987 wrote: Now it looks like my eyebrows and eyelashes are thinning. Ugh. Those were the two things that didn't make me look like a chemo patient. I have been noticing I look more and more tired lately. Anyone else notice any thinning yet? I've heard that we'll probably completely lose them after chemo ends. Oh goody.",
      "MessageIndex": 1049,
      "PostDate": "23/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jun 4, 2013 01:42PM Jen987 wrote: Kerri - Vent away. That's what we're here for. We all understand. No one else really gets it unless they walk in your shoes and we're walking right besides you. It's a rough road but you'll get through it. Just keep reminding yourself why you're doing it and it's not forever. 2013 has really sucked but I figure by August I will have my somewhat normal life back. And hopefully cancer won't consume my daily thoughts anymore. Positive thoughts and please take care of yourself and let those around you take care of you. We have to remember this is really hard for them too. It makes them feel better to help out. Stay strong. You can do this. Jen",
      "MessageIndex": 1195,
      "PostDate": "04/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jun 5, 2013 07:56PM Jen987 wrote: That's awesome news Virginia. I was relieved to find out I was negative too.",
      "MessageIndex": 1206,
      "PostDate": "05/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jun 6, 2013 02:35AM Jen987 wrote: Is anyone else experiencing hot flashes? My pillow was soaking wet the other night. It's even happening during the day. I'm assuming it's \"chemopause\".",
      "MessageIndex": 1212,
      "PostDate": "06/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 24, 2013 11:10PM Jen987 wrote: I wanted to let you know that anyone who is having issues with hot flashes and night sweats that Vitamin E is helping.  My MO suggested I start taking it and within a week I was getting relief.  Also I think the Biotin is helping too.  I know it doesn't help the hair grow but the hair that has grown in is thick.  I have been taking pictures every week and in 2 weeks I went from almost bald to where you can't see my scalp anymore.   Just thought I'd pass that along. ",
      "MessageIndex": 1483,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Oct 15, 2013 04:18AM - edited Oct 15, 2013 10:24PM by Jen987 Well I'm 4 months PFC and starting to feel \"normal\" again. Hair is growing in nicely but very curly. Not really liking it too much but it's better than the alternative. Eyelashes and eyebrows have all returned. I finished RADS at the end of August with not too much skin damage. The fatigue was rough though. I've been on Tamoxifen for 5 weeks now and have been able to tolerate it with minimal side effects. I got my port removed Friday. Still a little sore but glad to get rid of it and it's reminder of chemo. Now if I could only lose the 10 lbs. I put on since diagnosis things would be great.",
      "MessageIndex": 1632,
      "PostDate": "15/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 12, 2013 02:22PM Jen987 wrote: Just finished my first week of Rads. 6 more to go. So far so good. Only a little red and today it's itching a bit. I can do this! Hope everyone has a great weekend. 5/35 done",
      "MessageIndex": 912,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 20, 2013 07:54PM Jen987 wrote: YAY Tangles. It goes by fast. Hope your skin is holding out. 32/35",
      "MessageIndex": 1353,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Sep 12, 2013 11:24AM Jen987 wrote: Tangles - Congratulations!   I had 2 areas where my skin peeled off and the rest was red like a bad sunburn, but my skin looked great after 1 week of finishing rads.  I continue to lube up as usual.  Now 2 weeks out its almost looking normal. ",
      "MessageIndex": 1501,
      "PostDate": "12/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 3, 2013 09:39PM Jen987 wrote: LW0919, big hugs to you too.",
      "MessageIndex": 764,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 26, 2013 07:51PM Jen987 wrote: Congratulations to everyone finishing up this week.  Celebrate to the fullest.  I finished #15 today.  My skin is holding up well.  Only slightly pink and alittle tender around my lumpectomy scar.  The fatigue started a couple days ago though.   Everyone enjoy your 2 days off and have a great weekend. 15/35",
      "MessageIndex": 1173,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 4, 2013 08:55AM - edited Aug 4, 2013 08:57AM by Jen987 Katie, I've read that mixing in hydrocortisone helps the itching.  My rad tech. told me to use Desitin because my skin now has a rash although mine isn't bothering me much.  I've just been using Eucerin during the day and Aquaphor at night. ",
      "MessageIndex": 1227,
      "PostDate": "04/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 12, 2013 05:44PM Jen987 wrote: So my skin is now breaking down and my nipple is so red and itchy I want to cut it off and throw it across the room. LOL My RO gave me a prescription creme that seems to be relieving the itching at least. But under my breast and by the SNB scar it's peeling. I'm glad that next week Friday is my last day. Hugs to everyone else with skin issues. 26/35",
      "MessageIndex": 1294,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 23, 2013 04:22PM Jen987 wrote: I'm done.  Today was my last day.  I loved my rad techs so it was sad to say good bye.  I brought them a basket of treats and a nice card to let them know how much I appreciated their kindness and compassion.  They really liked it.  The girls were so much nicer than the crabby chemo nurses I had.  In fact I disliked my whole MO office that I have an appointment with a new MO in a couple weeks.  I have to say rads were not as bad as I thought they'd be.  My skin didn't start peeling until week 4 or so.  My advice is hydrate and lube as much as possible.  I am glad to put this phase of treatment behind me.  Now onto Tamoxifen.  35/35",
      "MessageIndex": 1391,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 27, 2013 02:25PM Jen987 wrote: Congratulations Beachbound!",
      "MessageIndex": 1419,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 12, 2013 06:39PM Jen987 wrote: Well I crashed and burned again and made my second visit to the E.R. this week on Wednesday. I had an excruciating headache again after having the spinal tap and they told me to come back in. Finally after 5 hours they performed a blood patch to close up the spinal fluid that was leaking. Today I actually feel a little better after laying flat for the past few days. Now I'll have 1 good week before my next infusion and hope that nothing like this happens again. We have to figure out which medication gave me the horrible headache. Hope you all are hanging on and having minimal side effects. Rest and take care of yourselves.",
      "MessageIndex": 225,
      "PostDate": "12/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 12, 2013 09:20PM Jen987 wrote: Did all of you that received the Neulesta injection have labs drawn first to see if you even needed the shot? I did not, they just gave it to me two days after my first infusion. I'm starting to think maybe I didn't need it because when I was in the E.R. my WBC was elevated twice what it should have been. Maybe that's why my headache was so severe.",
      "MessageIndex": 234,
      "PostDate": "12/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 16, 2013 12:19PM Jen987 wrote: Hushkat: I'm right there with you on hair loss. Yesterday it was coming out in clumps in the shower. My scalp itches like crazy. Trying to make the decision on when to buzz it.",
      "MessageIndex": 342,
      "PostDate": "16/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 16, 2013 04:40PM Jen987 wrote: Great news Tricia81. Stay strong. All this really stinks but it'll all be over soon enough and we'll be stronger because of it.",
      "MessageIndex": 347,
      "PostDate": "16/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 19, 2013 03:21AM Jen987 wrote: I had my husband buzz my hair tonight. I am now rocking a G.I. Jane hair cut. Maybe G.I. Joe (a.k.a.Channing Tatum) will notice me now. He's so cute.",
      "MessageIndex": 411,
      "PostDate": "19/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 2, 2013 06:32PM Jen987 wrote: Really? Started my period. WTH I've had 2 rounds of chemo and a uterine ablation last year. This beast is never gonna stay away. I was so hoping that I'd be thrown into chemopause. Ugh I guess not. Has anyone heard that you shouldn't use tampons while going through chemo? My MO never mentioned anything to me.",
      "MessageIndex": 705,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 4, 2013 03:09AM - edited May 4, 2013 03:13AM by Jen987 Indenial, if I lived near you I would so come over and give you a big hug and make dinner for you and your family.",
      "MessageIndex": 733,
      "PostDate": "04/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 17, 2013 02:20AM Jen987 wrote: So I left the house this morning without a hat on, nothing, nada. Didn't realize it until I got to my car and saw myself in the window. Yikes. Had to run back inside and grab a hat and pray no one saw me. I sometimes don't wear anything on my head when I'm home. Guess I kind of forgot. LOL",
      "MessageIndex": 960,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "May 24, 2013 10:13PM Jen987 wrote: Heather - I have been out of breath, fatigued and feeling just crappy since my third infusion last Monday and I'm not getting the \"red devil\". I think it's what they say are cumulative SE's. Ironic that a few of us are feeling that way this week. This has been hard on me. I'm not used to having to rest in between doing chores around the house. Geez, I use to work out 3 days a week for 2 hours. Now I'm lucky to go for a walk around my subdivision. I hate cancer and all things associated with it too. Can't wait to put this behind me. Hope we all can enjoy our holiday weekend.",
      "MessageIndex": 1076,
      "PostDate": "24/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jun 4, 2013 09:06PM Jen987 wrote: Congratulations Pugmom5. Doesn't it feel great to be done with another part of the journey? I hope this round is gentle on you. I know #3 was rough for me as far as fatigue. Today I feel great.",
      "MessageIndex": 1200,
      "PostDate": "04/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jun 26, 2013 12:40AM Jen987 wrote: I went for my CT mapping for radiation. It wasn't that bad. For those interested this is how it went. You'll change into a gown and then be brought into a room where the CT machine is. Unfortunately I had to remove my hat because you'll probably not be wearing the same head covering every time since they make a mold for you to lay in during each treatment. I didn't really mind because frankly I'm sick of wearing hats everyday, especially in this heat. You lay down on a hard table with a \"bean bag\" type pillow under your shoulders and head area with your arm up. My feet were rubber banded together so that you don't cross your feet. After positioning me the way she wanted she then inflated the bag and then sucked all the air out of it and it molded right to me. Next she took some measurements and put some tape on me. Then she left the room and CT began. After coming back in she took some pictures of my position so that it will be exactly the same every time. Not the most pleasant thing since you are exposed but at this point I've flashed my boobs so much I almost don't even care anymore. LOL I was then given 3 tattoos. One on each side like by your love handles and one in my cleavage. Barely noticeable and only stung for a second. All said and done was maybe 45 minutes. I go back next Tuesday to go over the exact planning then start Rads the following week. Met with my MO yesterday and was told I won't start Tamoxifen until Rads are done. I asked her about the hot flashes I've had and she said taking vitamin E can help. Especially since they probably will get worse once on Tamoxifen. I'm gonna start taking that tonight. I'll report back if that helps since I know others have the same issue. I hope everyone is handling their last rounds of chemo with minimal side effects. You're in the home stretch.",
      "MessageIndex": 1365,
      "PostDate": "26/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 23, 2013 01:45PM Jen987 wrote: Katie - PFC is post final chemo",
      "MessageIndex": 1474,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Apr 1, 2014 04:12PM - edited Apr 28, 2014 01:55AM by Jen987    Here's a recent picture of my hair growth. I hope all of my other fellow April chemo gals check in.  Thinking about you all. ",
      "MessageIndex": 1658,
      "PostDate": "01/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 3, 2013 09:05PM - edited Jul 3, 2013 09:08PM by Jen987 I'm coming here from the April chemo board as I start rads on Monday. Looks like I'll be doing 35 total, 28 regular and 7 boosts. Can't wait to get this going so it's that much closer to being done with all this. What a crappy year we've all had. I told my husband I want a do over of 2013. LOL.",
      "MessageIndex": 758,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 3, 2013 09:35PM Jen987 wrote: GWTF that's terrible. So sorry to hear that. I found my lump in January and had my first doctors visit January 16th on my son's 21st birthday. It's been downhill from there. Cancer just sucks doesn't it.",
      "MessageIndex": 762,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 12, 2013 06:21PM Jen987 wrote: Happy dance for you Corky!",
      "MessageIndex": 924,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 28, 2013 05:13PM - edited Jul 28, 2013 05:14PM by Jen987 CassDugan - Go to the top of the page and click on My Profile. Click on the tabs you want to add information to and make sure to set it public if you want it displayed.",
      "MessageIndex": 1184,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Jul 29, 2013 11:56PM Jen987 wrote: Welcome Goldie.  My RO said to use Eucerin and his nurse said use Aquaphor at night since it's so greasy.  I've had 16/35 and so far my skin is just barely pink.  So that combo is working for me.  Every doctor is different and every persons skin reacts differently.  Good luck.",
      "MessageIndex": 1191,
      "PostDate": "29/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Aug 22, 2013 08:23PM - edited Aug 22, 2013 08:24PM by Jen987 Hi MsPharoah.  I'm from the April chemo group.  I have my last treatment tomorrow, 35 total, and my skin held up pretty good.  It did get very tan and peeled in a few areas.  And I had a few days where my nipple was very red and itchy but compared to chemo it was a breeze.  Like you said stay hydrated and lube up as much as possible.  My RO suggested Eucerin during the day and Aquaphor at night.  I also was able to work out more since I was feeling better after chemo ended and that helped with the fatigue as strange as that may sound. 34/35",
      "MessageIndex": 1382,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Sep 16, 2013 11:35AM Jen987 wrote: Patricia - I'm more fatigued now that all my treatments are done.  I finished August 23rd.  I started Tamoxifen a week ago Saturday and have felt like crap these past few days.  Exhausted and my joints ache.  It's gonna be a long 5 years....",
      "MessageIndex": 1520,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Sep 16, 2013 11:52AM Jen987 wrote: JDB53 - I felt good after chemo ended 6-3-13.  It seems to be going downhill since rads ended.  It could very well be cumulative.  Or the fact that I've finally finished treatments and I've \"slowed\" down mentally/emotionally to really feel the effects.  Who knows, this cancer stuff sucks.",
      "MessageIndex": 1522,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "Jen987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172082/profile",
      "Content": "Oct 4, 2013 02:14PM Jen987 wrote: YAY Shipsgirl. Congratulations!",
      "MessageIndex": 1561,
      "PostDate": "04/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    }
  ]
}