{
  "AuthorID": "jenchrisrob…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60292/profile",
  "Posts": [
    {
      "AuthorID": "jenchrisrob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60292/profile",
      "Content": "jenchrisrob wrote: Does anyone out there know what this means. I recently had a lymph node disection. I'm sure most of you know what that is. After having a bi-lat and a sentinel node done during the bi-lat. The initial test on the sentinel can back negative but the extended came back positive. So they went in and got more. My surgeon said she removed a very large chunk of tissue just to make sure she got it all. Well when the report came back it said there were no nodes found. Has anyone else had this happen and should I be concerned that my surgeon may have missed something?  My surgeon said that sometimes after surgery the body can destroy or breakdown reaming tissue around a surgery sight. She said I may have had some remaining nodes after my initial surgery but the body may have broken them down so there were none left. Does this make since to anyone? Please help? Jen Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696482",
      "Title": "No Nodes Found? jenchrisrob Binney4"
    },
    {
      "AuthorID": "jenchrisrob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60292/profile",
      "Content": "Dec 6, 2007 10:27PM jenchrisrob wrote: Thanks for the advise, I talked to my onc today. He said there is no need to be concerned and that I probably didnt have any nodes left in their to remove.  He was happy with the results and I should be also. They didn't find any nodes but they didn't find any more cancer either. My next step is radiation and herceptin.",
      "MessageIndex": 3,
      "PostDate": "06/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696482",
      "Title": "No Nodes Found? jenchrisrob Binney4"
    }
  ]
}