{
  "AuthorID": "Jenga60",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211934/profile",
  "Posts": [
    {
      "AuthorID": "Jenga60",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211934/profile",
      "Content": "Jenga60 wrote: for those that went the lumpectomy + radiation treatment, between the surgery and radiation, did you go back to work? If so, how did you cope. Working and waiting for the pathology report and knowing you would be heading into rad treatment and depending on results of report still may require more surgery. I'm trying to make the decision lumpectomy vs mastectomy. Dx 2/2015, DCIS, Grade 3 Dx 2/2/2015, IDC, Left, 2cm, Grade 2 Surgery 3/22/2015 Mastectomy: Left Dx 4/22/2015, IDC, Left, 4cm, Stage IIIA, Grade 3, 8/22 nodes, ER+/PR+, HER2+ (IHC) Chemotherapy 5/19/2015 FAC Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/828916",
      "Title": "Lumpectomy + radiation- going back to work in between? Jenga60 ruthbru"
    },
    {
      "AuthorID": "Jenga60",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211934/profile",
      "Content": "Jun 15, 2015 01:54PM Jenga60 wrote: well I'm on day 6 since my 2nd round of chemo. I felt better the first couple of days but I'm very weak now. Last time by day 5 I was my old self and could do anything. No so this time,.... realizing how much this is going to impact my life and my daughters (22 months).",
      "MessageIndex": 928,
      "PostDate": "15/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "Jenga60",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211934/profile",
      "Content": "Jun 9, 2015 05:15PM Jenga60 wrote: about to head for 2nd chemo of 6 tomorrow... Nervous but trying to stay positive. The sooner I get round 2 the closer I am to round 6. Not looking forward to being sick again... And from what I'm hearing. Each round is a little worse. ",
      "MessageIndex": 923,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "Jenga60",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211934/profile",
      "Content": "Jenga60 wrote: I had a biopsy 2 weeks ago and got results back, it's cancer with some precancerous cells around it. They believe it is 2cm long but feel it is growing. My Breast is very dense with other areas that could be just milk drying up from finishing Breast feeding a few months ago or could be unknown all over my Breast. My decision is to figure out if I should go with a Lumpsectony or mastectomy? How to decide. If I go with lumpectomy there would be radiation afterwards. Has anyone else had to make this decision, if so what factors did you take into consideration. I'm not looking for you to decide for me but just what things were in your pro/con list for each. So far; Mastectomy Pro It should be over. ( this is Huge!!) No more guessing. I have a daughter I want to be around for. Con Loss of whole Breast. How much will I morn it? What are the costs for a prosthesis? Will I regret it, if I find out after it was minimal and could have gone with a lumpectomy It's a long time to be out of commission Lumpectomy Pro Smaller procedure Potentially that this is all I need Cons Radiation- this terrifies me... Who has been through this and what can I expect. Higher risk that it isn't gone. Potential to still have to go for surgery again and potential that St some point I would have to go for a mastectomy anyways. Thanks for any info you can provide Dx 2/2015, DCIS, Grade 3 Dx 2/2/2015, IDC, Left, 2cm, Grade 2 Surgery 3/22/2015 Mastectomy: Left Dx 4/22/2015, IDC, Left, 4cm, Stage IIIA, Grade 3, 8/22 nodes, ER+/PR+, HER2+ (IHC) Chemotherapy 5/19/2015 FAC Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/828913",
      "Title": "It's cancer- where to start Jenga60 gypsyjo"
    },
    {
      "AuthorID": "Jenga60",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211934/profile",
      "Content": "Feb 27, 2015 04:45PM Jenga60 wrote: I felt like I was missing info, that my Dr went over but didn't remember, so I got a copy of the report and added the diagnosis to my profile.",
      "MessageIndex": 6,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/828913",
      "Title": "It's cancer- where to start Jenga60 gypsyjo"
    },
    {
      "AuthorID": "Jenga60",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211934/profile",
      "Content": "Apr 18, 2015 05:01PM Jenga60 wrote: I just recently had a BMX (3.5 weeks ago) and I am a runner. There is a very positive runners group in here. One person suggested getting a bean-a-boob which is designed specifically for running and swimming.",
      "MessageIndex": 1,
      "PostDate": "18/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830428",
      "Title": "Large breasts -- swimming and running after mastectomy? QueenAzaz Jenga60"
    },
    {
      "AuthorID": "Jenga60",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211934/profile",
      "Content": "Apr 18, 2015 05:03PM Jenga60 wrote: https://community.breastcancer.org/forum/58/topic/...  Here is the link to the running grouo",
      "MessageIndex": 2,
      "PostDate": "18/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830428",
      "Title": "Large breasts -- swimming and running after mastectomy? QueenAzaz Jenga60"
    },
    {
      "AuthorID": "Jenga60",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211934/profile",
      "Content": "Apr 19, 2015 01:56AM Jenga60 wrote: hello Florida, I'm in a similar boat too! Getting all my results back on Wed at 2:45. Up until right now, I've been avoiding even thinking about it. Then tonight it really hit me hard. I'm terrified, and I've just got to put in the hours in between now on Wednesday. How? Hugs for all of us.",
      "MessageIndex": 14,
      "PostDate": "19/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/829210",
      "Title": "Soooo nervous waiting for results next week florida2015 Jenga60"
    }
  ]
}