{
  "AuthorID": "jenilo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110948/profile",
  "Posts": [
    {
      "AuthorID": "jenilo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110948/profile",
      "Content": "Dec 9, 2010 04:44AM jenilo wrote: This is my second time on chemo and was told the stuff Im on may stop my hair growing back all together so i was really worried. Anyway by the 6th week after my last chemo my leg hair started to grow . Im 9 weeks in and my whole head has about 1/2 inch of hair growing very quickly. My eyelashes and eyebrows are all growing really quickly also. Once it starts you will see a difference every week, but be patient it took me 4 months last time until I could go out without my wig. Im looking to feb next year to going without my horrible wig again. I finished chemo begining of October. Hope this helps. Oh and to help growth eat really well, veg and stuff lots of iron intake and vit D .  ",
      "MessageIndex": 6845,
      "PostDate": "09/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jenilo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110948/profile",
      "Content": "Nov 11, 2010 04:54PM jenilo wrote: Thanks for the encouragement, any ideas are extremely welcome, will definetly try the alternative medicine route, and will suggest a trial to my doctor on my next appointmnt, the zometa started of as a trail 5yrs ago and its stood me well , many thanks.",
      "MessageIndex": 2,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760609",
      "Title": "Now triple neg just chemo , need help jenilo jenilo"
    },
    {
      "AuthorID": "jenilo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110948/profile",
      "Content": "Nov 11, 2010 05:29PM jenilo wrote: thanks for that, I am actually 2%progestorone and 0% estrogen and I did 5yrs on tamoxifen, My doctor has more or less said there is nothing available for me since i was diagnosed stade 4 as i am so near the triple neg mark. Was quite shocked when i walked out as im still slight hormone receptive,and was expecting at least something to try. Will have to push harder .",
      "MessageIndex": 4,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760609",
      "Title": "Now triple neg just chemo , need help jenilo jenilo"
    },
    {
      "AuthorID": "jenilo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110948/profile",
      "Content": "Jan 18, 2011 08:50AM jenilo wrote: 35 yrs young 1st diagnosed was 36yrs a week later , 40yrs stage 4 turned 41 a week later. It all happened dead on 5yrs to the day of first diagnosis, weird or what .....",
      "MessageIndex": 594,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "jenilo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110948/profile",
      "Content": "jenilo wrote: Yesterday I was told that my liver was clear, bones are good  and reparing, my lungs which was my original diagnosis were nearly clear apart from a few cells in the lining in the bottom of  my ribs. My doctor is very happy with me and told me to go on holiday and will see me in two months time. Previously I was told that I would be on some hormonal tablets after my chemo. I have now been told that Im triple neg and there is nothing to take apart from chemo every time I hav a relapse. Im on regular zometa every month for my bones but thats as a preventor, and thats it. I feel like im a ticking time bomb waiting to go off again, Surely there must be something to help with triple neg lung mets. Thought i had got at least 5 yrs left in me but im just sat waititng for it to come back and dont feel like i can make plans and resume the life i once had, Enjoy yourself its later than you think :) Dx 6/12/2010, <1cm, Stage IV, Grade 3, 3/40 nodes, mets, ER-/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760609",
      "Title": "Now triple neg just chemo , need help jenilo jenilo"
    },
    {
      "AuthorID": "jenilo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110948/profile",
      "Content": "Nov 11, 2010 11:18PM jenilo wrote: Well I for one didnt get cancer from eating rubbish, Im a personal Trainer and its my job to know about food nutritien and exercise. Ive trained at the gym four days a week since the age of 18 and  have stayed a regular healthy size 8 .My only vice is red wine , but hey isnt it suppose to have anti-oxidants in it which are good for you. Ive even cut that down to just one night a week and its only a few glasses at that I dont eat five of my daily required fruit and veg I bet I have at least 10 to 15 and the cancer still keeps coming back. Im in to minds to  just jack  it all in, eat lots of rubbish food , drink lots of beer stop exercising and have a damn good time, Ive streamlined my life to the point of being soooo boring , all people say to me is your still here and fighting because your looking after yourself ,eating  well ,exercise and stay possitive , if I hadnt of done who knows what would of happened to me. The jury is out on this and always will be , my only piece of advice is enjoy everyday you wake up, its later than you think.  ",
      "MessageIndex": 6,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760633",
      "Title": "Do we need to change our life style? Suebus tooyoungtohavebc"
    }
  ]
}