{
  "AuthorID": "JennD",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256548/profile",
  "Posts": [
    {
      "AuthorID": "JennD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256548/profile",
      "Content": "Jul 26, 2017 01:16AM JennD wrote: Bessie I'm in BC and am HER2-. My IDC tumor was .45 but they are trying to get it remeasured because if it is actually .5 then it is covered. Its also covered if you are 40 or younger but I'm 44. Chemo feels like overkill for such a small tumor but if the oncotype testcame back that I have a high risk of recurrence wouldn't it be the best option?",
      "MessageIndex": 10,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857327",
      "Title": "Oncotype Test Not Covered... worth it to pay out of pocket? JennD Traveltext"
    },
    {
      "AuthorID": "JennD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256548/profile",
      "Content": "JennD wrote: Hello, I was diagnosed through a lumpectomy with IDC May 30th and had a subsequent surgery on June 6th because the margin was too close and also to remove lymph nodes. My tumor was smaller than 1cm, grade 2 and no lymph node involvement. During my first visit with my MO she was on the fence about chemo and wanted to do the oncotype test but because I am 44 and my tumor was .5 mm to small she was unable to get it approved through the cancer agency. We are currently looking into whether or not our insurance provider will cover it but I was told today that we didn't have time to wait for the results and I needed to start some treatment right away. I don't think I want to do chemo unless it's absolutely necessary. I also have spotting every few months so want that sorted out too. The MO is willing to wait for that but was insistent that I start something in the next two weeks. When I spoke with the RO he didn't feel it was a rush unless I did chemo. I'm wondering about the chances of the rib and lung being impacted by rads. Does anyone know where I find this out? Obviously I'm spinning here so sorry for being all over the place. Surgery 5/23/2017 Lumpectomy: Right; Lymph node removal: Sentinel Dx 5/30/2017, DCIS, Right, 1cm, Stage 0 Dx 5/30/2017, IDC, Right, <1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+, HER2- Radiation Therapy 9/12/2017 Whole-breast: Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/857310",
      "Title": "Diagnosed with IDC and struggling with options JennD debiann"
    },
    {
      "AuthorID": "JennD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256548/profile",
      "Content": "Jul 25, 2017 11:55AM - edited Jul 25, 2017 02:28PM by JennD notverybrave.. thank you for your perspective! I would definitely be relieved if I heard I didn't have to have chemo. So I guess I should wait for the tests. Calling our provider today. Michele, I'm definitely focusing on the positive but need to get through the decisions and am a bit overwhelmed with all the info they are throwing at me. I notice you had your ovaries removed. I have been considering this because of my spotting. Were you menopausal before? If not, how did you feel after in relation to menopause. Thank you for your thoughts Sorry! I just realized my whole question did not post originally.   ",
      "MessageIndex": 4,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/857310",
      "Title": "Diagnosed with IDC and struggling with options JennD debiann"
    },
    {
      "AuthorID": "JennD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256548/profile",
      "Content": "Jul 25, 2017 10:27PM JennD wrote: Thank you everyone for your responses! I'm in Canada so the cancer agency has very strict criteria for paying for it and my insurance plan doesn't cover it. We have sent an email to see what the cash out of pocket cost will be and I will check into the mammaprint. My MO didn't mention that when I asked about paying for tests out of pocket.",
      "MessageIndex": 6,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857327",
      "Title": "Oncotype Test Not Covered... worth it to pay out of pocket? JennD Traveltext"
    },
    {
      "AuthorID": "JennD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256548/profile",
      "Content": "Aug 3, 2017 01:21PM JennD wrote: Hello, There has been so much useful information to go through and I needed some time to process everything. Meanwhile I received a verbal review of my pathology and it was a bit of a surprise to me. It appears that my original pathology was slightly incorrect and my IDC tumor which was originally measured at .45 cm is actually .6cm. This will allow the test to be paid for but does raise some other questions about my original report. For example, the tumor size wasn't measured correctly according to a review by the cancer agency, and I have concerns about the clean margin reported because I was re-excised and found to have more DCIS. I also found out that my original MO, whom I have asked to be switched from, did not order the pathology review until just over a week ago when I was told it was ordered close to a month ago. Feeling really anxious about trusting anything at this point. This means that my window for having chemo is closing and I still haven't gotten the oncotype test. But given everything that I have read in this thread, it appears that the test won't be a huge benefit to helping me make that decision anyway. Sadly, my appointment for a second opinion isn't until Sept. 5th. But with or without the second opinion I am feeling like I should be starting some kind of treatment soon. I spoke with the RO and he will be starting the mapping for radiation the week after next, then I start RADs the second week of Sept. Radiation wasn't my first choice because I have lung cancer in my family but the waitlist for mastectomy with immediate reconstruction is insane here. So I will continue to pursue that while I start my treatment because I don't know what else to do. I'm anxious about starting tamoxifen because I don't tolerate meds well usually and I have had to be scheduled for a hysterectomy in January due to spotting every other month. I keep thinking that if I think positive, I won't have any issues with the meds but thinking positive is difficult some days. I realize my prognosis is good but all the issues with the first MO pushing me to make decisions without the information she told me would be helpful to me in making the decision has really raised my anxiety. Now the changes to the pathology have me upset again. Sorry for the long post but I needed to get it all out... ",
      "MessageIndex": 41,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857327",
      "Title": "Oncotype Test Not Covered... worth it to pay out of pocket? JennD Traveltext"
    },
    {
      "AuthorID": "JennD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256548/profile",
      "Content": "Jul 26, 2017 11:20PM JennD wrote: Beesie and BarredOwl, wow. Thank you for all the useful information. Beesie, to answer your question. My MO stated that I am in the middle ground because I am close to 40, grade 2 and according to her at a 20% risk of recurrence which I am sure is before radiation although I can't remember if she told me what the risk is after radiation. She has never mentioned Adjuvant online but I will ask when I go back. The factors she stated to me don't feel like a convincing argument for me. I realize I am now in a time crunch because through her attempt to get the test paid for she neglected to follow up with pathology in a timely manner, therefore a test that should have taken 2 weeks still hasn't come back after a month. I am asking for a second opinion or at least someone who can more clearly communicate with me and as well I am bringing someone I know will ask all the right questions. My husband has been trying but he is generally the kind of person to do whatever the Dr says without questioning which does not work for me. I will also wade through the information you have all provided and see what else I can find. Thank you for all the replies, it is really helping my anxiety knowing I have somewhere to reach out.",
      "MessageIndex": 22,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857327",
      "Title": "Oncotype Test Not Covered... worth it to pay out of pocket? JennD Traveltext"
    },
    {
      "AuthorID": "JennD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256548/profile",
      "Content": "JennD wrote: I was diagnosed May 30 and met with MO mid June. She has been trying to get the oncotype test approved to decide on treatment but when I met with her yesterday it still had not been approved. She would like me to decide about chemo without it and I am leaning towards not doing it. I feel like the oncotype test would be a bigness benefit but at $4k I'd like to know others thoughts before we go ahead and charges it Surgery 5/23/2017 Lumpectomy: Right; Lymph node removal: Sentinel Dx 5/30/2017, DCIS, Right, 1cm, Stage 0 Dx 5/30/2017, IDC, Right, <1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+, HER2- Radiation Therapy 9/12/2017 Whole-breast: Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857327",
      "Title": "Oncotype Test Not Covered... worth it to pay out of pocket? JennD Traveltext"
    },
    {
      "AuthorID": "JennD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256548/profile",
      "Content": "Jul 29, 2017 02:21PM JennD wrote: bosumblues, I am in BC in Canada and yes it is because of the size. No it doesn't make sense that treatment is paid but finding out if it's necessary isn't. I contacted Genomic health and they are willing to do it at a slightly reduced rate of $3340. I will be finding out on Monday if the path review came back larger and the test will be paid for by my medical",
      "MessageIndex": 28,
      "PostDate": "29/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857327",
      "Title": "Oncotype Test Not Covered... worth it to pay out of pocket? JennD Traveltext"
    },
    {
      "AuthorID": "JennD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256548/profile",
      "Content": "JennD wrote: I was diagnosed May 30 and met with MO mid June. She has been trying to get the oncotype test approved to decide on treatment but when I met with her yesterday it still had not been approved. She would like me to decide about chemo without it and I am leaning towards not doing it. I feel like the oncotype test would be a bigness benefit but at $4k I'd like to know others thoughts before we go ahead and charges it Surgery 5/23/2017 Lumpectomy: Right; Lymph node removal: Sentinel Dx 5/30/2017, DCIS, Right, 1cm, Stage 0 Dx 5/30/2017, IDC, Right, <1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+, HER2- Radiation Therapy 9/12/2017 Whole-breast: Breast Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857327",
      "Title": "Oncotype Test Not Covered... worth it to pay out of pocket? JennD Traveltext"
    }
  ]
}