{
  "AuthorID": "Jenniferx",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
  "Posts": [
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Nov 18, 2017 06:12PM Jenniferx wrote: @Spinnerpom Thank you so much for your informative post. Having just finished 25 (Tomo) radiation sessions, this helps a great deal in understanding my skin reactions and clears up some misconceptions.",
      "MessageIndex": 590,
      "PostDate": "18/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Dec 1, 2017 10:03AM Jenniferx wrote: @ PauletteK... Hang in there. I know how frustrating it is waiting for your hair to grow in. Despite it's \"superficial\" aspect, it's got to be one of the hardest tests of my patience in this whole ordeal! Superficial maybe, but certainly a big part of who we are as women! @ MamaOz I think that will look fabulous on you! I look forward to seeing the result if you feel like sharing. :)",
      "MessageIndex": 25993,
      "PostDate": "01/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Dec 6, 2017 10:35AM Jenniferx wrote: Your hair looks fantastic Twills! I know what you mean about the changes. I've never bought so much hair product in my life. Every week, I'm looking for something different to keep up with my latest \"style\". Currently looking for something to flatten it out a bit... it sticks up and looks so fuzzy! ",
      "MessageIndex": 26018,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Feb 18, 2018 02:37PM Jenniferx wrote: Wow. Gorgeous @  Mama1416. I agree about the brows! They are fantastic! I was the opposite... Had long straight dark hair prior to chemo. Now 7 months post chemo, I have (short, of course), very curly hair! I dyed it blonde since I had so much grey coming in.... (Sorry about the HUGE photos... not sure how to make them smaller! )  ",
      "MessageIndex": 26202,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Nov 18, 2017 01:00PM Jenniferx wrote: I finished chemo on 28/06/17. No hair left at that point (other than a few leftover sprouts)... Eyebrows and eyelashes finally fell out once chemo was done but grew back fairly quickly. I also used Latisse on my lashes and brows. I was getting pretty impatient waiting for my hair to grow back. I mixed a brew of pure Jojoba, Rosemary, Castor and Argan oils and applied them to my scalp every evening before bed for about 3 months. Finally started seeing some slow growth around 6 weeks post chemo. I have no way of knowing if it helped or not but my hair has grown back evenly, thick (like before) and wavy (hair was previously straight). I took pictures to track my progress and will try to figure a way to post them if anyone is interested.",
      "MessageIndex": 25919,
      "PostDate": "18/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Nov 28, 2017 02:48PM Jenniferx wrote: Thanks all. @Binniebin, my hair could not have been MORE different! It was long, darker, straight and thick. But I’ll take what I can get...",
      "MessageIndex": 25965,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Nov 28, 2017 08:52AM Jenniferx wrote: Here are my pics. I found it really inspiring and helpful to see others' posts with pics of hair growth when I was bald, so I hope this helps for those who feel like it's taking forever. Hair is such a part of our identity as women! I finished chemo on June 28th and immediately started taking biotin and using a hair tonic I made with Jojoba, Rosemary, Castor and Argan oils. I would just rub it all over my scalp every night before bed. It took 5 weeks before I saw ANY kind of growth at all but then my hair started to grow in pretty thick and even (and unfortunately, grey...). Still not growing fast enough for me! I was finally able to colour it last week (the final photo). I also started taking Tamoxifen about 6 weeks post chemo so I've been on it for over 3 months now and have yet to notice any hair thinning. ",
      "MessageIndex": 25954,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Jan 1, 2018 09:08AM Jenniferx wrote: @ lohoff Both you and your hair look beautiful and healthy! Just lovely!",
      "MessageIndex": 26079,
      "PostDate": "01/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Nov 20, 2017 01:33AM Jenniferx wrote: I started the Latisse as soon as I finished chemo. I've used it previously and have never had any iris pigmentation problems at all. I too had a very slight darkening around the eyeliner area as others have mentioned. This product works very well!",
      "MessageIndex": 25924,
      "PostDate": "20/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Nov 28, 2017 08:16PM Jenniferx wrote: Thanks everyone! I love seeing everyone's progress pics. I too live in Canada and pay out of pocket for Latisse but it does work. Doctors will not prescribe it for \"cosmetic purposes\". I am lucky enough to live close to the US border however and order it from a US site (which is much cheaper than up here!) Speaking of hair growth, has anyone experienced fine facial hair growth?? I've noticed a very thin and fine growth of very fair hair growth all over my face!! Not quite sasquatch worthy but bothersome, nonetheless!  ",
      "MessageIndex": 25970,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Nov 28, 2017 08:57PM Jenniferx wrote: Lovepugs77, I know! I'm hoping the facial hair will perhaps fall out or diminish over time? I too am afraid to do anything about it either so I guess I'll wait it out.",
      "MessageIndex": 25973,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Nov 30, 2017 06:34AM Jenniferx wrote: Haha no... those are extensions. ;) I used Latisse right after finishing chemo for about 2-3 months and my natural lashes and brows did grow in very well but I decided to treat myself with extensions for a while. I am however using Latisse again so I can \"go natural\" again. It does work very well. Thanks all for the tips on facial \"fuzz\"... I think I'm going to try to exfoliate a few times first. I just can't imagine shaving!! I'm so scared of getting stubble/regrowth on my face... yikes. @ MamaOz... Your hair looks gorgeous. Your curls are beautiful. I know the feeling of wanting to colour it though... I did the same thing last week and sent a pic to my hair stylist asking her if it was long enough to colour. Thankfully it was! I was on the fence whether to go light or dark, as highlights were not yet an option. I chose light and since I have so much grey, I thought it would look more deliberate with dark(ish) roots growing in on light hair (than salt and a little pepper hair growing in on dark hair!) My roots haven't started to grow out yet but in the next couple of weeks I'll get an idea of how it looks against the light (dyed) hair colour. I'll keep you posted. @ lovepugs77...Your hair is growing in beautifully and looks really healthy. Best of luck to you! I actually liked taking the pics and although everyone is different, at around the stage you're at now it was growing so fast I could see a difference every couple of days! Would love to see more pics soon if you're up to sharing. Hugs.",
      "MessageIndex": 25989,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Dec 6, 2017 12:48PM Jenniferx wrote: Oh a mini flat iron... great idea! I'll try that. I've always had long, straight hair so I didn't think of that. It might help tame the new curls and fuzz. Thanks for the tip. :) ",
      "MessageIndex": 26021,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Oct 28, 2017 10:40AM - edited Oct 28, 2017 10:45AM by Jenniferx I too started Tomo radiation (X25) on October 10th. Diagnosed stage 3 in January 2017, right mastectomy w/tissue expander and sentinel lymph node dissection in Feb, chemotherapy March-June, axillary lymph node dissection in July... Reconstruction will be post radiation. Half way through radiation, feeling some fatigue, skin sensitivity and occasional dizziness. Using Cavilon spray 2 X week for skin. Thankful for 2 days off on the weekends! Happy that my hair is growing back pretty well post chemo.... Except that it's all grey....",
      "MessageIndex": 167,
      "PostDate": "28/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Oct 30, 2017 08:26AM Jenniferx wrote: @DodgersGirl Have you tried the Cavilon spray? It's Monday again... #14 out of 25 today... Getting there.",
      "MessageIndex": 174,
      "PostDate": "30/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Nov 21, 2017 07:10AM Jenniferx wrote: Finished radiation (25X) almost a week ago and now it's really starting to hurt. Super happy it's over but holy crap... the breast/chest area is itchy and \"sunburned\" (that I can handle) but my armpit around the lymph node removal scar is really tight, sore and uncomfortable. Sharp pains too! My RO did say the worst was going to be in the two weeks post-radiation.... Hopefully this time next week, it will start to heal. Think I will try Calendula, green tea compresses or pure aloe gel as some have suggested. Unlike most others, I started Tamoxifen two months prior to beginning rads. Going on four months now with (thankfully so far) no side effects other than hot flashes. Good luck to everyone still in treatment and Happy Thanksgiving to my American friends. Enjoy your radiation break!",
      "MessageIndex": 339,
      "PostDate": "21/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "Jenniferx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247295/profile",
      "Content": "Oct 29, 2017 12:10PM Jenniferx wrote: Hey! Yes, it's a relief not to have to fit in the Rads appointment for two days... I am feeling a little stinging and tightness around the underarm and breast but haven't really noticed any colour changes... You?",
      "MessageIndex": 172,
      "PostDate": "29/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    }
  ]
}