{
  "AuthorID": "jennielaine…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145540/profile",
  "Posts": [
    {
      "AuthorID": "jennielaine",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145540/profile",
      "Content": "jennielaine wrote: Hi, I have been a member for awhile, but don't post too often. So, here my story...........my mother had breast cancer at age 47..........and she passed away from it at age 51. I started my screening mammograms at age 38 and right off the bat.......it was abnormal (clusters of microcalcifications in both breasts, but the left one had different shapes and sizes).......so I underwent bilateral stereotactic core biopsies..........final diagnosis was benign fibrocystic changes. I started high risk breast screening in 2017 at age 53 at the urging of my GYN. I had a breast MRI in June 2017..........everything's fine. Had my screening mammogram in Dec 2017.........they found architectural distortion in my right breast, breast US couldn't correlate, so it was recommended that I have a stereotactic core biopsy of my right central breast done in January 2018................findings were stromal fibrosis with loosely grouped microcalcifications..........benign. Went for my breast MRI a week ago and they found a 3 mm focus in the same area they biopsied in January 2018. They recommended a MRI guided core biopsy which is scheduled 2 weeks from now. The radiologist who called with my MRI results basically said it was worrying because it was in the same location of my biopsy in January AND that this 3mm focus WASN'T on my MRI last year. My question I guess........is.......how often is stromal fibrosis diagnosed as benign when really something else is going on like a very small cancer or an area of DCIS................has anyone else experienced a similar scenario as mine?? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865622",
      "Title": "2nd biopsy in 6 months jennielaine MelissaDallas"
    },
    {
      "AuthorID": "jennielaine…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145540/profile",
      "Content": "Jul 24, 2018 06:43PM - edited Jul 24, 2018 07:49PM by jennielaine Well, NOT that anyone REALLY replied to this.......but I am going to tell the story of what happened to me last Thursday just because it is therapeutic, not because anyone really replies. I had a 2 hour wait for my MRI guided biopsy because they were having some kind of problems with the patient before me. They were all very apologetic and kind about it, but the waiting was driving me CRAZY!!!! Finally, they bring back to the MRI area and start my IV for the contrast. As I am waiting for the next thing to happen, the patient before me gets wheeled in, curtain drawn, but I could hear the nurse saying she got to put a lot of pressure on the breast because it won't stop bleeding. Then the nurse told her the biopsy site might start bleeding again after she gets her post-procedure mammogram. Uh-oh.......alarm bells going off in my head. So finally, they get me positioned in the MRI and start taking the pictures. They inject the contrast and take some more pictures. So I was in the MRI about maybe 15 minutes when the tech tells me that they will be pulling me out soon and the doctors are going to talk to me. So the young intern tells me that they couldn't find the area that lit up 3 weeks ago, and that it sometimes happens, and they're sorry about the long wait. She told me I need to come back in 6 months for another MRI breast scan of my right breast and if they find the lesion again, they will have to schedule another MRI guided biopsy. Well, as farmerlucy told me, I am getting off this every 6 months merry go round. I am scheduled to have my normal mammogram in December, but I AM NOT going back for that MRI scan. I am religious about getting mammograms so I'm sure IF this “lesion\" is real and IF it grows, it WILL get picked up on the mammogram. The stress of going back every 6 months and having them find some kind lesion or dust on their machine that makes them think it a lesion...........having biopsies every 6 months...........it's just TOO much!!!",
      "MessageIndex": 2,
      "PostDate": "24/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865622",
      "Title": "2nd biopsy in 6 months jennielaine MelissaDallas"
    }
  ]
}