{
  "AuthorID": "JennL",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
  "Posts": [
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "JennL wrote: I am a 37 year old mother of 3 girls and had 2 lumps in left breast (they had been there a while)  Finally went to gyn and she sent me to get mamo and ultrasound.  The radiologist group gave me a birads 4 and told me to see a BS for biopsy.  The BS could not open ultrasound disc to see anything so did MRI Nov. 26th, the results were a possible fibroadenoma but needed an excisional biopsy to be sure (I have implants so core needle would not be a good idea).  Had biopsy done on Dec. 22nd and am waiting for results.  BS told my husband it didn't look concerning and if it was anything it would be microscopic.  She didn't talk to me after surgery.  The waiting is driving me crazy!!!!  I'm sure that it is most likely B9 but I just need to hear it.  Does pathology take longer if it is B9 or Malignant?  I would appreciate any insight on this:)  Thanks Dx 12/27/2011, IDC, 1cm, Stage IB, Grade 2, 1/6 nodes, ER+/PR+, HER2- Surgery 1/30/2012 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right Chemotherapy 3/19/2012 AC + T (Taxol) Hormonal Therapy 8/25/2012 Surgery 12/13/2012 Reconstruction (left); Reconstruction (right) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780073",
      "Title": "waiting for pathology JennL bdavis"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Dec 27, 2011 01:06PM JennL wrote: Thank you both for your insight, and I know you are both right about the Holidays delaying things, I should be patient and keep busy.  The waiting is making me nuts and sick to my stomach, I've had an uneasy feeling since the 1st. radiology report came back, probably because they scared me.  I just want to hear the words B9 and move on!  ",
      "MessageIndex": 3,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780073",
      "Title": "waiting for pathology JennL bdavis"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Dec 27, 2011 07:23PM JennL wrote: Thank you for all your support:)  The BS called today and said pathology found 2 small cancers, it is IDC, thats all I know, I have to go see her tomorrow to talk about the next step.  Good luck to all of you who are waiting for results, I wish each of you a B9 outcome!!!  ",
      "MessageIndex": 8,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780073",
      "Title": "waiting for pathology JennL bdavis"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Dec 27, 2011 09:45PM JennL wrote: Thank you Betsy:)  The surgery I had was an excisional biopsy but I think they took both lumps with some surrounding area out, but I will ask that question.  I guess I have lots of questions for Dr. McDermott tomorrow.  I heard she worked with Dr. Mcmanus, he was not taking new patients so I chose her, my gyn recommended her as well as plastic surgeons office.  I will call you tomorrow, it is will be nice to talk to someone who has gone through this so thank you.",
      "MessageIndex": 14,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780073",
      "Title": "waiting for pathology JennL bdavis"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Dec 27, 2011 08:51PM JennL wrote: Hi bdavis, She didn't say much except that there is 2 small cancers and she said they were IDC when I asked what kind it was.  I will see her tomorrow and she will go over the pathology report with me, I'm hoping that will give some type of answers.  She also said she wants to do genetic testing on me but I didn't ask why, I guess I was in shock from the call.  I should probably write down some questions, if you have any you think I should ask I would appreciate the advice.   I will make sure I ask if they are in the same quandrant, does it matter if they are or are not?  Thanks",
      "MessageIndex": 10,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780073",
      "Title": "waiting for pathology JennL bdavis"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Dec 27, 2011 09:21PM JennL wrote: Betsy, I'm seeing Dr. McDermott, I'm going to try to get an appointment with Dr. Borgen (he is in brooklyn and used to be head of breast cancer dept. in sloan kettering)  my brother knows someone who's wife had an aggressive form of BC twice and this guy got her better both times.  I already had surgery to remove both lumps so I will ask the questions you listed tomorrow.  I'm so overwhelmed!!!  Do breast surgeons usually tell you to go to an oncologist?  Either way I want to see the best person I can.  ",
      "MessageIndex": 12,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780073",
      "Title": "waiting for pathology JennL bdavis"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Dec 27, 2011 10:03PM JennL wrote: I'll call you thanks.  My plastic surgeon is Dr. Nini in NB and I love him, so I would use him again if need be:)",
      "MessageIndex": 17,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780073",
      "Title": "waiting for pathology JennL bdavis"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Feb 23, 2012 08:42AM JennL wrote:",
      "MessageIndex": 41,
      "PostDate": "23/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782635",
      "Title": "scared!!! sandik marie5890"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Jan 19, 2012 07:13AM JennL wrote: Gail, good luck tomorrow I am wishing B9 for you!!! ",
      "MessageIndex": 13,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/781200",
      "Title": "so scared gail_p-m gail_p-m"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Mar 15, 2012 09:09PM JennL wrote: Hi Muscles, I went to Wig Illusions in Manalapan on Route 9.  The owner Lucy is so nice and very knowledgable!!  It's probably about 45 minutes from you.  Good luck.  ",
      "MessageIndex": 1,
      "PostDate": "15/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784171",
      "Title": "Good Wig store in Central New Jersey? Muscles Muscles"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Jan 28, 2012 03:28PM JennL wrote: Hi Denise,  I'm sorry you have to go through this awful waiting period especially when your sister is going through treatments:(  Chrissy is right you do have a lot on your plate right now.  A friend of mine had a very suspicious lump that was spiculated (she also has BC in her family) and the Docs were thinking it was BC but after biopsy it was B9!!!!  You never know so I am wishing B9 for you.   You are a wonderful sister to be taking of yours, can she come to you and finish her treatment there, this way she has everyone you have on her side?  Best of luck to the both of you!! ",
      "MessageIndex": 4,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/781751",
      "Title": "Upcoming biopsy dreniger marlenet"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Jan 29, 2012 07:26PM JennL wrote: Denise, Talking it out always helped me stay calm so please talk away!!!!  I am very new to this site myself so I can't offer much but an ear, kind words and prayer.  I'm having BMX with imediate reconstruction on Tuesday 1/31 and was dx 12/27 so like I said I am a newbie.  But what I can say is this site and the women here really helped ease my fears and helped with my questions.  You sound very strong and level headed so no matter what the outcome (wishing, hoping praying for B9) you will get through it!!!!  Best of luck to you and your sister, please keep us posted:)",
      "MessageIndex": 9,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/781751",
      "Title": "Upcoming biopsy dreniger marlenet"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Jan 26, 2012 04:44PM JennL wrote: Emerald I'm so sorry you are not feeling well and that you had to go through that pain:(  Hopefully it all comes back B9 so you can forget it ever happened (if thats possible)!!  Good luck please keep us informed.",
      "MessageIndex": 32,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/781217",
      "Title": "Can doctors really see cancer on mammograms and ultrasound? Emerald097 dogeyed"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Jan 27, 2012 04:54PM JennL wrote: Emerald - I'm so glad it came back good for you!!!!  ",
      "MessageIndex": 42,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/781217",
      "Title": "Can doctors really see cancer on mammograms and ultrasound? Emerald097 dogeyed"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Jan 20, 2012 11:30AM JennL wrote: Emerald, I am wishing B9 for you:)  Like others have said BIRADS 4 is often B9 and it is good they are checking it out.  This site is such a wealth of information and has such supportive members!!  The waiting is the hardest part but talking it out with people on here really helps because they have been through the same or similar things.  Also, when you get your biopsy do they give you results that day or do you wait, I would ask, it helps to know how long they think it will take.  Good luck and please keep us posted:)",
      "MessageIndex": 25,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/781217",
      "Title": "Can doctors really see cancer on mammograms and ultrasound? Emerald097 dogeyed"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Jan 26, 2012 08:44AM JennL wrote: Sonant - Good luck to you tomorrow, you are in my prayers for a quick and easy recovery!!!  ",
      "MessageIndex": 21,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781123",
      "Title": "Need to your advice, love and support. Sonant Sonant"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Feb 14, 2012 03:29PM JennL wrote: Hi Sonant, I was so happy when I had drains removed, it felt so much better.  Sorry they couldn't fill you that stinks:(  I hope the spasms stop.  I didn't have the TE's, they were able to use the implants I already had before surgery and when I heal they will exchange for new ones under the muscle (partially), so not sure about spasms but my skin did feel tingly especially on the side must be nerves coming back.  I saw my PS's nurse a week from surgery and the BS's nurse practitioner had my results and gave me a quick all looks good but I had to wait till today (2weeks after surgery) to go over with BS.  They do more than 1 test on nodes so I guess he was waiting for it all.  I had 6 nodes removed he said it was all clustered by sentinel or they were all sentinel (I forget) they all came back clear except 1 the first node had micromets but it still is considered a negative node. So now just waiting for oncotype dx test to see if I will need chemo, thats the deciding factor in my case.  Waiting stinks:(  Hoping for low score!!!!!  Hoping your report comes back all good and no nodes positive!!  Good luck",
      "MessageIndex": 30,
      "PostDate": "14/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781123",
      "Title": "Need to your advice, love and support. Sonant Sonant"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Apr 22, 2012 12:41PM JennL wrote: Hi Sonant, I finished my third AC treatment on the 17th, one more to go then on to Taxol also.  The second treatment was better then the 1st but the third really kicked my A$$!.  Starting to get some energy back today.  Usually 1 week after treatment (so following Tues., Wed.)  I start feeling really good and have about 6 days of feeling good!!  Hoping Taxol is better.  What is the name of the skin care products you are using?  I would love to get some:)  Feel good!",
      "MessageIndex": 52,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781123",
      "Title": "Need to your advice, love and support. Sonant Sonant"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Mar 22, 2012 09:54AM JennL wrote: Hi Sonant, my first chemo was on Tuesday March 20th, today is day 3 for me and feeling ok, just tired and a little off.  Like I'm recovering from a crappy cold.  Hopefully gets better from here but not as bad as expected (knock on wood).  Hope your second treatment goes better then the first:-) Good luck, how many treatments are you doing and what kind?  By the way I didn't do the port did you?  ",
      "MessageIndex": 48,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781123",
      "Title": "Need to your advice, love and support. Sonant Sonant"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Feb 11, 2012 12:41PM JennL wrote: Renae, You crack me up with your term \"Cancer Party\"  Everytime I'm feeling scared or down about this whole crap storm I always make a little joke at my cancer's expense, what can I say laughing is good medicine and since I'm an upbeat kinda girl I like to laugh:)  I never new Tamoxifen had a possibility of not working, I'll definatly have to ask that question and I'll PM you my email address for that list of questions Thank You for sharing that would be so helpful!  I will google the website also.  My hubby also bought me a good book, Beating Cancer With Nutrition by Patrick Quillin, PHD, RD, CNS.  It is very interesting and has some recipes in it.  Thanks again. Jenn",
      "MessageIndex": 48,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Jan 17, 2012 07:33PM JennL wrote: Hi Sonant, I am also heading for surgery January 31st.  I have IDC in left breast but am doing BMX because I am 37 with 3 young daughters and do NOT want to go through this again.  I have implants already which will need to come out and I will get the TE's put in.  BS said since I have very little breast tissue and mostly implant it would be a good option for me (the BMX)  I'm hoping that the end result will be similar to what I have already but as long as I'm cancer free I will deal with that later:)  I also don't know about chemo yet BS said it's 50/50, I guess it depends on what they find in surgery but I will definately be on tamoxafin.  Good luck with your surgery!! I'll keep you in my prayers.  Joan, posts like yours that you are doing so well so soon after is what keeps me from freaking out, so many women like you on this site are my inspiration to keep being positive!  Thank you and I hope your recovery continues to go smoothly!",
      "MessageIndex": 6,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781123",
      "Title": "Need to your advice, love and support. Sonant Sonant"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Jan 17, 2012 08:22PM JennL wrote: Hey Joan, I'm not seeing Dr. McDermott anymore, I chose to use Dr. Borgen for my upcoming BMX and anything in the future, his bedside manner is amazing.  I am also using the plastic surgeon he works with Dr. Gayle (also wonderful bedside manner), they are both in Brooklyn.  I will be looking for MO close to home so please let me know how you feel about Dr. Fein, I heard good things. Did they tell you when they start filling up the TE's and do you know how much they would fill you during surgery?  I don't want to wake up with nothing:(  ",
      "MessageIndex": 8,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781123",
      "Title": "Need to your advice, love and support. Sonant Sonant"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Feb 4, 2012 02:22PM JennL wrote:",
      "MessageIndex": 26,
      "PostDate": "04/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781123",
      "Title": "Need to your advice, love and support. Sonant Sonant"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Mar 5, 2012 10:10PM JennL wrote: Hi Sonant I saw 2 oncologists and they both recommend either AC-T (looks like that is what you are going to get the T would be Taxol) or TC. The doc I am going to use is leaning toward the AC-T over the TC. My gut is telling me to do the AC-T what did your doc say did he give any other choices? I would be doing the AC part every other week for 4 cycles and the taxol every week for 12 weeks. The TC would be every 3 weeks for 4 cycles. I want to give it all I got so the stronger AC-T seems like my way to go now I just need to decide.",
      "MessageIndex": 41,
      "PostDate": "05/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781123",
      "Title": "Need to your advice, love and support. Sonant Sonant"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Feb 25, 2012 11:34AM JennL wrote: Hi ladies, just an update on me.  I got my oncotype score back it is 21 (14% recurrence rate) so I'll be getting chemo.  BS said it will probably be CMF chemo but I need to meet with oncologist.  Hope everyone is recovering well!!  ",
      "MessageIndex": 39,
      "PostDate": "25/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781123",
      "Title": "Need to your advice, love and support. Sonant Sonant"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Jan 19, 2012 09:13AM JennL wrote: Thanks Joan, keep me updated on your progress with treatment, hope it goes smoothly:) Sonant, thank you so much for praying for me and others in our boat I appreciate it:)  I will be doing the same for all of us also!  Keeping positive really helps me and this site is so helpful.  Please keep me posted on your surgery and good luck we will be better in no time! ",
      "MessageIndex": 12,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781123",
      "Title": "Need to your advice, love and support. Sonant Sonant"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Mar 1, 2012 08:38AM JennL wrote: Hi ladies, saw oncologist yesterday and really liked her, she said CMF was not for me wouldn't really do much but recommended TC or AC-T (she prefers I do AC-T).  They are both stronger then I expected but now I feel like if I'm going to do it and get SE's why not give my all and do what would lower my recurrence the most.  I still have to see another oncologist on Monday and see what she says.  If they are the same then I know what I will do if they say different things (if the other does say CMF is fine and TC and AC-T is to strong) I don't know what I'll do!!!  These decisions are hard!  Any advice out there?  Thanks for listening.",
      "MessageIndex": 786,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Mar 3, 2012 10:53AM JennL wrote: Hi Ladies, did anyone here do TC chemo or AC-T chemo?  I am Stage 1 grade 2 have micromets in node (said it was still negative), lymphascular invasion and am 37 years old.  Tumor was 1.9cm.  Just curious what oncologists recommended for you guys.  Thanks",
      "MessageIndex": 11761,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Feb 25, 2012 11:32AM JennL wrote: Hi ladies, I just found out I'm going to be needing chemo:-(  I'm 37 years old, had a BLM Jan. 31st with reconstruction and my oncotype test score was 21 (14% chance of recurrence)  My BS said I would probably get CMF (I have to meet with 2 oncologist he recommended and choose one).  I'm hoping to see the oncologists next week or the week after.  I love this list, once I know when I'll be starting I'll start gathering things together.  Has any done CMF chemo, everything I read says TC or AC.  Just curious.  Thanks",
      "MessageIndex": 784,
      "PostDate": "25/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Mar 11, 2012 10:53PM JennL wrote: chose AC-T, starting March 20th.",
      "MessageIndex": 793,
      "PostDate": "11/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Feb 11, 2012 08:08AM JennL wrote: Renae, thank you for your take on your decisions:)  I completely respect your decision and agree with you!  That stupid LVI is really what scares me also because they have no way of knowing if one of those sneaky little cells have taken a ride on the vascular train and what if the tamoxifin doesn't starve them all off!!!  Like I said I don't want to do this again and my girls are still so young so I need to be around healthy and not sick!!!  I really don't want to have to do chemo (it scares me) but I do want to make sure that I am doing everything I can not to get sick down the road.  I guess I just need to be patient and wait for Tuesday to come and talk to my BS and really go over the report and hear his thoughts and how much weight he is putting on the oncotype test.  I will also ask him if the tumor is considered bigger since it is really 1 tumor not 2.  I'm hoping your neuro testing turns out well and you can go ahead with no side effects or at least very little!!  Also, my husband bought me a vitamix (its a holy crap blender) and I love it!!  It makes everything.  I have a smoothie every morning with kale or spinach, banana, and another fruit apple, pear, mango, etc.  It blends it so smooth not one chunk and you can't even tast the greens only fruit.  I fiqure it  will help me heal to if I get all the vitamins and protein I need and what better way than a yummy shake:)  You can look it up on line (www.vitamix.com)  It is a little pricey but I really love it, I'm making soup in it tonight, it is supposed to actually get hot!!  Thanks again!!  Jenn",
      "MessageIndex": 44,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Jan 24, 2012 03:56PM JennL wrote: Truely inspiring, Thank you!!!!!!!! ",
      "MessageIndex": 44,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/773420",
      "Title": "29-ish Months Post-Diagnosis: You Will Get Through This! Kaidog MNSusan"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Feb 10, 2012 06:01AM JennL wrote: Hi Renae, I have very similiar stats to you and have LVI.  I just had a BMX on Jan. 31st and the preliminary path report was great nodes are negative and no more cancer was found!!  Before the BMX I had an excisional biopsy and they took out the tumor which they didn't expect to be cancer so didn't get clear margins but now everything is gone.  They originally thought it was 2 tumors one was 1.8cm the other 1.4cm but when the report came back the ER/PR levels were identical and the BS said that only happens when it is 1 tumor not 2 (it was shaped like a dumbell).  I to am concerned about the LVI and the BS said that is the one thing on my original path report he didn't like (this was before BMX).  I am waiting on oncotype dx test score and waiting is the worst!!!  Like you I am not sure what to do if my score comes back intermediate.  BS did say that because of my age (37) he would lean toward chemo if that happens.  I still have not gone over new path report with him from BMX so hoping to see him Tuesday and maybe get some answers.  You are right about the gray area though it is all confusing:)  Any advice on making decisions I would truly appreciate.  I have 3 daughters (10, almost 8 & 6) so I just want to make sure I don't have to do this again!!!  Thanks so much for listening and good luck with your chemo:)",
      "MessageIndex": 36,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Mar 5, 2012 09:54PM JennL wrote: Well it's either AC-T or TC both oncologists agree now I just have to choose!! What to do, pick your poison has a new meaning to me now:-). Any suggestions?",
      "MessageIndex": 790,
      "PostDate": "05/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Feb 12, 2012 05:58AM JennL wrote: Renae, I watched the you tube video transend and yes I cried!!!  I will have to get her book, thank you.  So funny you wrote a song about Lil Bastard, I bet I would LMAO if I heard it.  I checked out your blog and love it!!  You are an inspiration:)  The Christmas blog had me chocked up, I to love christmas and love the traditions I have since I was a kid.  Passing them on to my girls is one of my favorite things.  I had a mamo, ultrasound then 2 weeks later MRI right before Thanksgiving.  Finally had excisional biopsy Dec. 22.  First BS (I left her to go to the most amazing BS after I knew it was cancer) said looks like fibrodenoma she kept saying I was young and it is probably benign.  Dec. 27th she called me sounding very humbled to say it was cancer!!  But I refused from the beginning to let any of this ruin my favorite holiday!!  Also like you in Dancing in the Rain, I should have trusted my gut, I knew even though the first BS said it's probably nothing I knew that it was something!!  Now I have the most amazing team at the Breast Cancer Center I go to but until I get every single report back I can't trust that I'm in the clear or think I won't need chemo!  I'm hoping the oncotype test comes back ASAP, waiting is the worst part, I just want to know whats next and move on.  So here is to kicking cancer \"Lil Bastard\" LOL in its cell dividing ass!!!  Sorry for ranting on and on I'm in a mood today. Well off to get myself in a better mood, thanks for listening:) Oh when will you be starting your chemo?",
      "MessageIndex": 61,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Feb 12, 2012 08:11PM JennL wrote:",
      "MessageIndex": 75,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "JennL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139631/profile",
      "Content": "Mar 7, 2012 01:38PM JennL wrote:",
      "MessageIndex": 17,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/783492",
      "Title": "Another scared new person dlb66 jen70"
    }
  ]
}