{
  "AuthorID": "JennieWren1…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189181/profile",
  "Posts": [
    {
      "AuthorID": "JennieWren1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189181/profile",
      "Content": "Jan 7, 2014 06:47AM JennieWren1 wrote: morning :) I know the feeling. My surgery was back in August. The last week or so leading up to it, I started to get apprehensive. The Saturday prior to surgery I made into \"my special day\" - horse riding, followed by a nice massage, nice lunch & playing in a lovely jewelry shop here.  One thing my mother said was \"make sure you share this with your husband, don't try to deal with it alone\".  After reflection, I realised this was a wise comment.  I'm a \"coper\" & tend not to share concerns etc. He's going through this as well, & I sometimes wonder if it isn't harder for the close family - they're not experiencing the direct effects, but want to do all they can to help & support, but don't always know what is right. Be sure to tell him what you are feeling, what comments are unwelcome & what will help you. He's not psychic, he can't read your mind. He loves you to bits & it's probably tearing him up watching you go through this.  Read up as much as possible beforehand. I'm glad you've found your way here. I've found the posts by all these brave women & men to be extremely helpful. As the saying goes, knowledge is power, & the more power you have, the stronger you will be to see this through to the sunny end of the tunnel. Best of luck. I'm not a praying person, but I'll be thinking of you & wishing you all the very best. My favourite thought has become \"it may suck, but this too shall pass\" :)",
      "MessageIndex": 14,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/816358",
      "Title": "Mastectomy with reconstruction coming up....VERY NERVOUS 1MindyydniM1 Skiergirl"
    },
    {
      "AuthorID": "JennieWren1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189181/profile",
      "Content": "Feb 10, 2014 08:36AM JennieWren1 wrote: Fun feeling?  \"I've just washed my hair & can't do a thing with it\", all 2mm of fuzz ;) I'm just over 2 months from my last chemo. The oncologist said to expect this to take a good 6 months.  My eyebrows, which had stayed the course, have disappeared over the last fortnight, just as all my other hair has started reappearing. My legs already look like I haven't waxed all winter :(. Murphy's Law coming into action there!",
      "MessageIndex": 19978,
      "PostDate": "10/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "JennieWren1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189181/profile",
      "Content": "Jan 13, 2014 10:34PM JennieWren1 wrote: donnabelle, Your short look is fabby! Really accentuates your pretty eyes :). Very \"Jamie Lee Curtis\" ;) I'm 6 weeks PFC today, & am developing a very slight 5 o'clock shadow on top. I had been hoping for brunette as a nice change from mousy brown, but am reliably informed what is appearing is more white/grey.",
      "MessageIndex": 19888,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "JennieWren1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189181/profile",
      "Content": "Jan 6, 2014 04:02PM - edited Jan 6, 2014 04:04PM by JennieWren1 Tettel, I was diagnosed back in the summer in my left breast & was given all the options -  Lumpectomy, followed by radiation & chemo Or Mastectomy, followed by chemo. I decided I didn't want to spend the rest of my life (or until the next lump was found) wondering & worrying, so opted for a mastectomy. I was given 3 options with that -  No reconstruction Or An implant  Or DEIP flap reconstruction The DF reconstruction was the longest recovery, but had the best chance of long term success, so my husband & I decided on that route. In the days leading up to the surgery, I was having doubts, & asked my husband if I was taking too drastic of a route. His response made me laugh out loud. \"If I had testicular cancer, & they recommended removal, I'd have it chopped off right away\"!  I hope he never has to live up to his words ;) The surgery was 10 hours, apparently. The pain killing meds were extremely effective, I'm very glad to say! The discomfort from the scar tissue & damaged nerves is there, but does not impinge on my every day life. With a bra on, you can't tell the difference. Due to my job, it was recommended I take 2 full months off work. I was glad of that, but was doing fine after 6 weeks. Then I had to start chemo.  There have been times when I look at the scars in the mirror, & think about what my body looked & felt like the weeks before surgery. I'm no model, but I find the change quite drastic, especially as I couldn't see or feel anything wrong with my breast. I just had to trust all these specialists who told me there was something very wrong going on in there. It doesn't change my decision. It would be nice to have my old self back, but given the choice between having my old self, or having a future, there's no doubt in my mind I took the right decision.",
      "MessageIndex": 5,
      "PostDate": "06/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/816529",
      "Title": "2014 Making the Decision on Type of Surgery Tettel bdavis"
    }
  ]
}