{
  "AuthorID": "jennyg1975",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165604/profile",
  "Posts": [
    {
      "AuthorID": "jennyg1975",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165604/profile",
      "Content": "Nov 13, 2013 05:44AM jennyg1975 wrote: I’m much more of a lurker, but I read part of the GMA interview online, so I thought I’d share what I read.  She mentioned that at this point she didn’t know what stage she was – specifically, she said that she didn’t know if it had spread or if she would need chemo.  I feel for her because I was in that same boat when I was diagnosed last year, shortly after my 37th birthday.  While my biopsy results said it was DCIS, my MRI showed three other areas of enhancement in different quadrants of the same breast and one of my nodes lit up.  This changed my initial treatment plan from lump + rads+ tamox to having a bilateral mastectomy (I was trying to have a baby and I would have been put on tamox if I kept either breast regardless of stage, which would have made having a baby impossible until I was about 40), but the doctors told me that they wouldn’t know until my full path results came back if I was stage 0, 1 or 2.  I was happy to learn that my node lit up due to the trauma of the biopsy rather than cancer and that all areas showed DCIS.  Frankly I don’t regret my aggressive surgical decision at all because they found ADH in the “clean” side, I was able to forgo tamox and I’m currently 6.5 months pregnant (what a difference a year makes!)  In all honesty, she may not know what stage she is and there may be other reasons for her wanting to treat this with aggressive surgery.  I admire her for coming out with her news before she knows specifically what she is dealing with. I found incredibly difficult to tell my coworkers in my small company about my cancer and I couldn’t imagine what it would be like to have all of my personal health details out in the public. ",
      "MessageIndex": 8,
      "PostDate": "13/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814442",
      "Title": "Amy Robach voraciousreader voraciousreader"
    },
    {
      "AuthorID": "jennyg1975",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165604/profile",
      "Content": "Nov 13, 2013 06:03AM jennyg1975 wrote: Thanks for the congrats, Bobogirl!",
      "MessageIndex": 10,
      "PostDate": "13/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814442",
      "Title": "Amy Robach voraciousreader voraciousreader"
    },
    {
      "AuthorID": "jennyg1975",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165604/profile",
      "Content": "Mar 18, 2013 08:40PM jennyg1975 wrote: I'm so sorry you are going through this now. I just wanted to let you know that it is possible to have your nodes react to a biopsy, because mine did. I had a core needle biopsy, which diagnosed me with DCIS. When I went for my presurgical MRI, one of my nodes showed enhancement and became swollen. My breast surgeon, GP and oncologist said it could very well be because of the biopsy, and it turned out to be true. Moira is right-this is the worst part. Her post provides excellent advice. I wish you all the best.",
      "MessageIndex": 3,
      "PostDate": "18/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/801984",
      "Title": "I'm confused and frustrated with the \"hurry up and wait\" sammysbrenda mawhinney"
    }
  ]
}