{
  "AuthorID": "Jenn613",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199162/profile",
  "Posts": [{
    "AuthorID": "Jenn613",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199162/profile",
    "Content": "Apr 15, 2014 08:41AM Jenn613 wrote: China is indeed a third world county and we don't know the true statistic of breast cancer there, however Japan is very well developed industrialized nation and does have a good health care system but yet just like China, Japan has a very low statistic rate for developing breast cancer.  My son developed Ulcerative Colitis at the age of 2.  Doctors were astounded that someone so young could develope UC.  Our pediatric gastroenterologist said in all of his 20+ years he was the youngest child he has diagnoised with UC.  For those that do not know what Ulcerative Colistic is, it is an auto immune disease that attacks the large colon.  Basically you bleed internally in your colon.  We used to change about 6-8 bloody diapers a day with our son.  He was only 19 lbs at the age of 2 1/2.  Not a bit of fat on his bones.  He did not grow much nor could he gain any weight, therefore the doctors told us to feed him more dairy.  This only exacerbated his symptoms.  Soon he developed large hives all over his body.  As a test we stopped giving him dairy and sure enough his hives went away.  To confirm our suspicions we put him back on dairy and sure enough the hives returned.  Later we told the GI of our findings and he just blew it off as minor.  We quit seeing him and stopped all dairy and within 6 months his symptom improved.  A year later he was symptom free.  It has now been four years since he has had blood in his stool.  He is healed to what doctor say is a life long incurable disease.  As tid bit, 50% of those who are diagnoised with UC for more than 10 years develope colon cancer.  Many people are lactose intolerance.  This intolerance is do to the milk \"sugar\", however this is not what causes the major problem in people.  It is the protein called \"Casein\" found in milk.  Some people, like my son has an allergery (not intolerance) to this milk protein.  There are over a dozen protein in milk such as \"whey\" protein.  The problem with milk protein is the large composition or makeup which is unlike other food items.  These proteins (especially casein) looks foreign or in many cases, poison to the human body which leads to many problems.  These proteins are made for a large animal (cow) to digest who will one day weigh over 1000 lbs.  Human are not made to digest this large and harsh substance on a daily basis.  It will cause inflammation throughout the body.  No telling what Growth Hormones (rBST) in Milk is additionally causing.  I wouldn't be surprised if one day we do find proof that milk contributes to many types of cancer!",
    "MessageIndex": 109,
    "PostDate": "15/04/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764313",
    "Title": "Why don't Chinese women get breast cancer? MCTHO"
  }]
}