{
  "AuthorID": "jenn46",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
  "Posts": [
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Feb 17, 2009 05:39PM jenn46 wrote: Otter, your hair looks gorgeous!  There is hope!  I am 9 weeks post chemo and an so anxious for my hair to grow so seeing yours definitely gives me hope! Thanks for sharing! Jen",
      "MessageIndex": 1263,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Sep 23, 2008 12:36PM jenn46 wrote: Good morning everyone! Suzywillkickthis:  The reconstruction wasn't as bad as I thought it was going to be, although the first few weeks were REALLY tough and I kept asking myself \"why did I do this to myself??\".  But I really did start to feel better each day and now I am 8 weeks post-op today and feel great!  My new foob looks good and still have some open wounds but they should be healed in the next couple of weeks.  I did have a few complications (developed blood clots in leg & lungs 2 weeks post-op and infection above new breast) but other than that I am very happy with the results.  Plus I got a tummy tuck to boot!  Massachusetts is beautiful this time of year, especially when the trees have all changed colors!  I guess it makes up for the long and cold winters! Kim:  I'm extremely curious about how the chemo will make me feel.  I was up all night last night thinking about it!!  But check out the TC board, there is so much information from women that have had the same treatment that we will be getting.  I'm on that one all the time too!   How old is your Kristen?  I see that you have a 14 year old...how is she??  I only ask because my 14 year old is becoming a handful!  She is a great kid, but doesn't know when to keep her mouth shut!! :) Peeps: Thanks so much for the info!  I am especially nervous about the Neulesta shots because of the bone pain, so thanks for the advice re: claritin!  I'm not usually such a baby with pain, but since the blood clots I am no longer allowed to take Mortin (I lived on Motrin!!) because I am on blood thinners.  I have to give myself Lovenox injections in my stomach 2x per day, so am only allowed to take tylenol which does nothing!!  Were abouts in Mass do you live?  I'm on the South Shore.. Kimmysue:  I had IDC, with 2 tumors in my right breast which is why they did the mastectomy.  They were going to do a lumpectomy until they sent me for an MRI and found the second tumor hiding behind my nipple.  It was so small (6 mm) that they said that a mammogram would not have picked it up for quite a while, so thank goodness for the MRI! Good luck this Friday Keryl!  We had our surgeries on the same day! Have a great day everyone! Jen",
      "MessageIndex": 14,
      "PostDate": "23/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Sep 26, 2008 07:12AM jenn46 wrote: Good morning everyone! Bourscheid:  I'm glad they were able reschedule your PET scan so now you can start chemo on time! Peeps:  I'm glad you are feeling better and I hope you can get some much needed sleep!  That is crazy about the wig store!  I'm going to Weymouth today to get fitted for my wig, I'll have to ask her if she would have to wait too.  My onco told me that my hair will \"thin\"?  I asked him about it and he said to plan on it all falling out, but it may just thin.  I have very thick hair, so I don't know if that makes a difference?  I'm planning on it all falling out anyway so if it doesn't I will be happily surprised!  I'm glad that you are getting your taste buds back too! Have a great day everyone! Jen",
      "MessageIndex": 40,
      "PostDate": "26/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Oct 9, 2008 07:45AM jenn46 wrote: Good morning everyone, Sorry I haven't been on much but since returning to work on Monday I've been so busy with work & the kids!  I had my port placed on Friday and it wasn't bad, pretty sore until today.  I'm off to my 1st tx this morning and am very anxious, but glad that it is finally starting.  I took my 2 doses of decadron last night and was very pleasantly surprised that I slept through the night and don't really feel different this morning.  I thought I would be up all night \"jacked up on steroids\"! threegirlsmom...CONGRATULATIONS on you daughter being picked home coming queen!!!  That's awesome! Good luck today with your 1st tx too!  We will get through this! Prayinghands....good luck to you also!  How was returning to work?  The 1st day was weird, but after that it felt like I never left and was so glad to be back at work so I could keep my mind of things.  I am so fortunate to have such great friends at work, they really keep my going!  Stay strong and we can compare notes later! Peeps.....Good luck today with your 2nd tx!  Hope all goes well! Lori & TNT....I'm glad you are doing well! Welcome to all the new ladies, so sorry that you had to join us under these circumstances!  My VNA nurse should be here soon to do my dressing changes so I've gotta run.  DH and & have to be there at 10:30 today so I will check in later.  Here's hoping for no SE's!  Good luck everyone, and good luck tomorrow Fammy5! Jen",
      "MessageIndex": 127,
      "PostDate": "09/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Oct 3, 2008 07:21AM jenn46 wrote: Good morning everyone,  prayinghands...I usually do the same thing!  I always think of things that I wished I had asked after I leave.  I'm glad you are feeling better.  Lori....What an incredible outpouring from your school.  That must have been awesome!  Stay positive, you will beat this! Peeps...I'm sorry your throat is giving you trouble.  If it is the thrush maybe they can just have to try diflucan?  I love being able to just take one pill and be done with it!  I hope it clears up soon. Welcome karenbarrows and ellzig!  I am having my port placed today and am a little nervous.  I'll be glad when it is done. Enjoy the day! Jen",
      "MessageIndex": 85,
      "PostDate": "03/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Sep 22, 2008 06:18PM jenn46 wrote: Hi everyone, I will be starting chemo on 10/9 also.  My treatment will be 4 treatments of TC every 3 weeks.  I am 46 and live in Massachusetts, have 2 beautiful daughers, Kristen (14) and Kara (10) and a wonderful husband.  I had a R mastectomy on 7/29 with immediate reconstruction (pedicle tram flap) and am out of work still recovering from that.  I too am dreading loosing my hair, I don't think it has even really hit me yet.  Have an appt for a wig fitting later this week.  We can do this ladies! Jen ",
      "MessageIndex": 6,
      "PostDate": "22/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Sep 30, 2008 03:14PM jenn46 wrote: Hi everyone, ilovemykids.....I know what you mean, I feel the same exact way.  I just want to go back to the way it was before BC, but then I realize that I have a greater appreciation for things now than I did before.  My husband and I were always close, but I think this has brought us closer and I think he appreciates me more now.  And my daughters have been such a big help these fast few months, something they wouldn't have done before.  We will get through this, I know it! Suzywillkickthis...congratulations on getting started!  I hope the SE stay away! Hopefullady...thanks for stopping by!  I will check out the Sept. 08 board! prayinghands...I like what your onco said..mine keeps saying that this is just a speed bump and once we get over it we will be fine.  I think we are on the same schedule, I begin next week too, 10/9 and have to go back to work that week also after being out from surgery for 9 weeks.  Enjoy the afternoon everyone, Jen",
      "MessageIndex": 73,
      "PostDate": "30/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Oct 1, 2008 07:49AM jenn46 wrote: Good morning everyone,  prayinghands...I know what you mean!  I work in a hospital but am far enough away from the patients that it shouldn't be a problem.  But I do still have to go into public areas like the dining room, and I'm a germaphobe to begin with.  I forgot about the flu shots!  Did your onco recommend you getting one?  Mine told me that I would definitely have to get one. OregonPenny...I'm sorry that your port is so painful.  I am going to have mine inserted this Friday.  The surgeon told me that it would be \"a little sore\" for the first day but then after that I wouldn't even know it was there.  Maybe you should give them a call to see if it is normal for it to be still painful.  I agree with you on being more afraid of the chemo than the mastectomy.  I feel the same way!  I'm petrified of how it will affect me.  But after reading all of the posts on the site and the other sites from these wonderful women I know we will get through it! threegirlsmom....You are so right about feeling blessed!  I definitely have a greater appreciation of things now.  I was watching Oprah yesterday and they had Christina Applegate & Susan G. Komen's sister.  They were talking about how this has been a blessing for them and all the survivors in the audience agreed.  And the other day on the Bonnie Hunt show Melissa Ethridge said the same thing.  Today on Ellen the entire audience (300 people) is made up of BC survivors and their families.  I know....I'm watching way too much TV, I need to go back to work! Suzywillkickthis....I'm sorry you were feeling so miserable!  Can your onco give you something else for the nausea/vomiting?  I think that is one of my biggest fears...I hate to get sick!  I'm glad you are feeling better today and hope it continues!  Bourscheid & Fammy5..good luck tomorrow! TNT..good luck on Friday! Enjoy the day everyone and Happy October 1st! Jen",
      "MessageIndex": 78,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Oct 11, 2008 10:21AM jenn46 wrote: Good morning everyone, Glad to hear that everyone is doing well!  My 1st tx went OK, had an issue with my port and they were not able to access it.  They said it was because it was still swollen & the surgeon planted it pretty deep.  Next time I will try the emla cream and they will use a longer needle (oh what fun!).  Then when they started the Taxotere I had an allergic reaction even after all of the decadron & benadryl.  It was pretty scary!  I was on my way out of the bathroom and couldn't walk because of the pain in my legs, back & chest!  They stopped the taxotere, gave me some saline & tagament and it went away.  Then they started it up again slowly and all went well.  Felt good yesterday and went to work but left early for my neulasta shot.  I feel pretty lousy today!  Feel like I was run over by a truck!  Terrible sore throat, hurts to swallow and my glands are so swollen it hurts to even touch my neck!  Has anyone else felt this?  I just hope I'm not getting a cold on top of all this! Peeps....I'm glad you had a nice time in NY!  It is so good to get away sometimes.  And that was so nice of your friend to go with you to your tx! Gotta run, the vna nurse is here.  Have a great day everyone!! Jen",
      "MessageIndex": 150,
      "PostDate": "11/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Sep 25, 2008 08:24AM jenn46 wrote: Good morning everyone! Keryl:  Good luck tomorrow!  I'll be thinking of you! Bourscheid:  I'm so sorry that you were unable to have your PET scan yesterday!  And I'm sorry that you were unable to see your son and now your chemo will be delay!  I'm sure like all of us that you just want this to be over. prayinghands:  What an incredible story about your Mother!  I'm so sorry that she now has Alzheimer's.  It is such a terrible disease.  My mother had it also - she was diagnosed when she was 63 years old.  I'm so sorry that you are both going through this. Fammy:  I know exactly how you feel!  I will be feeling that way as Oct. 9th gets closer!  But I know in my heart that we will all get through this! Peeps:  How are you feeling today?  I hope you are feeling better. Duke2001:  I hope all went well with your port placement yesterday. Welcome Penny, golfgirl & Wyndy!  Sorry we had to meet this way but there is definitely strength in numbers. Hi Suzy & Kim!  Hope all is well and I hope I didn't forget anyone! Have a great day! Jen",
      "MessageIndex": 37,
      "PostDate": "25/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Sep 24, 2008 04:12PM jenn46 wrote: Peeps:  I live in Marshfield, so not too far from you!  I'm sorry that you had such a tough time!  I hope you are feeling better now.  Ending up in the hospital is certainly not a fun thing. I am having my port inserted next Friday, 10/3 to begin chemo on 10/9.  It's funny, but now that things are starting to move along I am getting really nervous.  I have been so consumed with everything that went with the surgery, recovery, & all the complications that I didn't mind putting off the chemo.  I guess the only reason that I really wanted to get it started is so that I would be that much closer to the chemo being over.  And then I feel guilty because I really shouldn't be complaining since I only have to have 4 tx then 5 years of tamoxafin and do not have to have radiation or herceptin, so I do feel that I am one of the lucky ones.  I just hate the unknown and wondering how my body will react to the chemo.  Don't you just wish that you could just fast forward to next year?  But I do know that we will all get through this! Thanks and enjoy the evening! Jen",
      "MessageIndex": 33,
      "PostDate": "24/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Oct 11, 2008 04:01PM jenn46 wrote: Hi Pageroo! I just had my 1st tx last Friday and I am nervously waiting for the hair to begin to fall out too!  I can take the other lousy side effects, but the hair thing really freaks me out!  I have ordered my wig and will go have it cut to look similar to my natural hair in the next couple weeks.  I just really hate the thought of losing it, but it is inevitable.  My daughters (10 & 14) are really nervous about me losing my hair but I told them that they will probably never see me without the wig so not to worry.  I think they are nervous about their friends seeing me bald. TNT...I like your idea of a wig from walgreens!  That would look awesome!  Thanks! Jen",
      "MessageIndex": 153,
      "PostDate": "11/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Feb 2, 2009 06:50AM jenn46 wrote: Hi mrschilicook,  I finished my 4 rounds of TC on December 11th too!  I was diagnosed in May 08, had a unilateral mastectomy with TRAM flap reconstruction in July 08 and began chemo in October.  I had a couple complications after the surgery (developed blood clots in leg and lungs 2 weeks post op - am now on lovenox injections 2x/day until March and will then be switched to coumadin...it was discovered that I have an antibody in my blood that makes me suseptible to clots so I will be on them indefinitely - then I developed an area of necrosis in my upper chest on the tram side that had to be lanced and packed for 3 months), but other than that I am doing great!  I did not have to have radiation so was about to begin 5 years of Tamoxafen but since I am at risk of blood clots I can not take it since that is a side effect.  Instead I will be taking Arimidex but since I am not menopausal (other than chemopause) I had to have my ovaries and tubes removed last Monday.  I am not looking forward to taking the drug as many have said that they have experienced terrible joint pain.  But I will since I don't want the BC to ever come back!   I do have another surgery scheduled for the end of March so that my plastic surgeon can fix some of the areas that did not heal correctly - but once that is done I am looking forward to getting on with my life!!!  I know that 2009 will be a much better year for us and I feel that having a positive attitude is definitely key! For all of us that have finished chemo, CONGRATULATIONS!!  To those that have not, there is light at the end of the tunnel and you will get your life back! Jen",
      "MessageIndex": 1,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/728357",
      "Title": "ENDING Chemo mrschilicook Titan"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Apr 9, 2009 09:31AM jenn46 wrote: I agree with YUMMY....I had my TRAM on 7/29/08 and felt the pulling for quite a while, but it definitely gets better.  I am 1 week out from my TRAM revision and feel good - definite nothing like the 1st time.  Before I went in for the revision I was feeling like my old self again, so you will get there.  A month after my TRAM I felt like I had made the biggest mistake in my life by having the surgery. I couldn't take the pain!  But each day got better and better and now I'm so glad that I did.  My foob looks just like my \"good\" one!  Hang in there ladies!  I know it seems like you will never feel the same again, but there is light at the end of the journey! You are both in my prayers! Jen",
      "MessageIndex": 3,
      "PostDate": "09/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731987",
      "Title": "Help I need Advice on Tram Flap Pain Shanagirl jenn46"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Apr 9, 2009 03:39PM jenn46 wrote: Hi Bonnie,  I have a condition that makes me predisposed to clots also (Lupus Anticoagulant antibody in my blood) and found this out 2 weeks post-op from my R sided mastectomy with immediate TRAM Flap surgery.  I developed a blood clot in my leg and pulmonary embolisms in my lungs and spent a week in the hospital and have been on Lovenox (2x daily injections) for the past 8 months.  I have had surgery during that time to remove my ovaries and am 1 week post op from my TRAM revision.  I know what my mean about being concerned, but thankfully I haven't had any complictions with the clots since the 1st one.  Thank God!  I'm sure they will take the necessary precautions to prevent you from clotting after the surgery - I was given heperin injections while in the hospital and have been back on my lovenox since then. Good luck with your surgery!  I hope everything went well!!  You are in my thoughts! Jen",
      "MessageIndex": 2,
      "PostDate": "09/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732037",
      "Title": "Bilateral Mastectomy April 9...blood clot issues... pokadot sorchaj"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "jenn46 wrote: I had a TRAM revision on 4/1 and had my 2 drains removed last week (tuesday).  I have a lot of fluid in the right side of my abdomen (the TRAM side) - you can actually see it sloshing around when I push on it.  My question is has this ever happened to anyone else?  And if so, did it resolve on it's own or did you have to have the drains put back in??  I'm scared to death about having to have it put back in!  I've had enough sticking and poking! I feel great besides that!  No pain at all anymore and have been up and around as usual.  Just freaking out about the possibility of having to have a drain put back in! Thx, Jen Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732745",
      "Title": "Anyone had to have drain tubes put back in? jenn46 gmp300"
    },
    {
      "AuthorID": "jenn46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72500/profile",
      "Content": "Apr 19, 2009 03:16PM jenn46 wrote: Hi Loni, Thanks for the info!  I'd much rather them drain it with an needle than have the drain put back in.  I'm not wearing a binder around the incision, didn't with the first TRAM procedure either.  PS never mentioned it and thankfully with this second surgery he didn't have to reopen the scar as deep as before.  He said he just went under the skin instead of having to cut through the peritenium (?sp).  Thankfully it's not painful so I guess I'll just watch it. Good luck with your TRAM!  I had the hardness in my abdomen with the first surgery too, it did finally soften a little (1st one was on 7/29), although it did take a while. Thanks again! Jen",
      "MessageIndex": 2,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732745",
      "Title": "Anyone had to have drain tubes put back in? jenn46 gmp300"
    }
  ]
}