{
  "AuthorID": "Jennibean",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75705/profile",
  "Posts": [
    {
      "AuthorID": "Jennibean",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75705/profile",
      "Content": "Dec 3, 2008 05:03PM Jennibean wrote: Thank you Jasminn and Wendy for your responses. Sorry Jasminn that you are having to go through this too. Wendy I am glad you made it through! I will definitely look into these options. I have good days and bad but I know God is faithful and will provide everything I need during this trying time.  God Bless You!!! :) ",
      "MessageIndex": 3,
      "PostDate": "03/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/725315",
      "Title": "having bilateral mastectomy in a few days Jennibean Peonyrose"
    },
    {
      "AuthorID": "Jennibean",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75705/profile",
      "Content": "Jennibean wrote: Hello everyone, I was diagnosed with invasive lobular carcinoma in my right breast. I am only 33 years old and have no health insurance. I have applied for patient assistance through the local hospital and was denied the first time, then I received a call that they will pay for my mastectomy surgery only for now, which was wonderful news.  I am having a bilateral mastectomy this Friday, December 5th and am getting anxious about it. I am a Christian so my faith has helped me a lot in dealing with this, and I am still trusting in God for everything.  However, I am having trouble sleeping this week and just thinking about everything we have to take care of financially due to the expense of the treatments.  I applied for Medicaid but was denied because I have no children and am not pregnant, etc. and I cannot get SSI because I am not considered disabled.  Does anyone know of any other financial assistance out there? I have been looking all over the internet and have found a few things such as cancercare and am waiting to here from them. Jen K. (Jennibean) Dx 11/13/2008, ILC, 6cm+, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/725315",
      "Title": "having bilateral mastectomy in a few days Jennibean Peonyrose"
    }
  ]
}