{
  "AuthorID": "Jennmommi",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254681/profile",
  "Posts": [
    {
      "AuthorID": "Jennmommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254681/profile",
      "Content": "Jul 19, 2017 02:44PM Jennmommi wrote: Thanks, this is helpful. ",
      "MessageIndex": 4,
      "PostDate": "19/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857080",
      "Title": "Scared and alone Jennmommi nikmar"
    },
    {
      "AuthorID": "Jennmommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254681/profile",
      "Content": "Aug 9, 2017 08:38AM Jennmommi wrote: So here is an update. I went in for the diagnostic mammogram yesterday and they decided to do a second ultrasound because mammogram was inconclusive. The Dr still saw the area of concern on the ultrasound and still couldn't find anything abnormal about the enlarged lymph node on the ultrasound. BIRAD was a 5. He did a core needle biopsy in three places, and a second mammogram after the biopsy to check placement of the titanium marker. I am terrified. My husband seems to have come around though and was pretty supportive yesterday and today. Now I just wait for pathology and hope for b9 findings.",
      "MessageIndex": 12,
      "PostDate": "09/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857080",
      "Title": "Scared and alone Jennmommi nikmar"
    },
    {
      "AuthorID": "Jennmommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254681/profile",
      "Content": "Aug 14, 2017 01:31PM Jennmommi wrote: I finally got my results today. It is a complex fibroadenoma, which is benign. They want to watch it, see if it grows, and have me do a mammogram in a year unless I notice changes or have any issues before a year is up. I am still very sore from the biopsy and have a bloody discharge, so I hope that those will resolve soon. ",
      "MessageIndex": 14,
      "PostDate": "14/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857080",
      "Title": "Scared and alone Jennmommi nikmar"
    },
    {
      "AuthorID": "Jennmommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254681/profile",
      "Content": "Jennmommi wrote: This is simply the most scared I have been. I am married and have 3 kids but I am married to a man in love with his work and himself and who is lacking empathy. For the most part, we are good, but anything that involves needing support or empathy, I pretty much have to find those elsewhere. I am used to it by now, but nothing has ever been like this. I had tumors removed from my colon, and both ovaries but they were all benign and I pretty much just relied on my best friend and sister who lived in town to get through those scares. Also, those happened super fast like within a week of finding them and having a CT scan I was schedules for surgery. There was really not a long wait time to get worked up or dwell on possibilities. This time is different. My sister moved back to our hometown 5 hours away from where I live, and my best friend moved across the country. I have no one close to me to vent to, talk to or get help /support from. This time nothing seems to be moving fast. It is as if no one but me thinks this is important enough to find out what it is and get a diagnosis. I don't know how long it has been there before I found it 6 weeks ago, My Dr told me when I was 19 yrs old that I had fibrocystic breasts and that they would feel lumpy and I would probably not notice anything so I just didn't bother with self exams and relied on my annual wellness visits to find anything for the most part. I actually found the lymph node by accident because I noticed it was sticking out of my armpit area and looked strange compared to what it normally looked lik, so I found the lump in the armpit and proceed to do a self exam. I have a swollen lymph node in my right armpit and lump in my right breast. Nothing is painful, not even the lymph node. When I found it during my self exam, I immediately called and made an appointment at my GYN for my annual wellness visit and mentioned it to them when making the appointment but the earliest they could see me was 4 weeks away. So I waited, no change in the lump or lymph node that I could tell in those 4 weeks, but I did find a second lump near the first one. He was concerned so referred me to the Breast Health Center to have an ultrasound. They couldn't get me in for almost 2 weeks. So It has been 6 weeks since I found the lump and I went for my ultrasound yesterday. So he was and I quote, \"Very concerned\" about what he was seeing on the ultrasound. He took several pictures and it took 2 hours (not sure if that is normal for a breast ultrasound but it seemed like a long time). He wanted me to come in for a diagnostic mammogram and possible (depending on the mammogram results) needle biopsies of the node and lump(s). But when I went to the window to check out and schedule the diagnostic mammogram they scheduled it 4 weeks away. I am already diagnosed with Anxiety and Depression, and this has made it worse. My husband and I are arguing, I am crying at work, I have no support in this at all and I don't even know what or who to ask questions about it. Is this time frame typical? Am I overreacting? Should I be insisting on a closer appointment time? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857080",
      "Title": "Scared and alone Jennmommi nikmar"
    }
  ]
}