{
  "AuthorID": "Jennifer522…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260061/profile",
  "Posts": [
    {
      "AuthorID": "Jennifer522…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260061/profile",
      "Content": "Jun 4, 2018 12:00PM Jennifer522 wrote: Does not apply to triple negative, chemo is our bread and butter. Also her+ as mentioned above. And also article said it’sfor women over 50.",
      "MessageIndex": 16,
      "PostDate": "04/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/865005",
      "Title": "Up to 70% of early stage does not need chemotherapy secondchancetoo Gracejoy"
    },
    {
      "AuthorID": "Jennifer522…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260061/profile",
      "Content": "Jan 31, 2018 10:04AM Jennifer522 wrote: I too thought the storage was on the bags, not the saline itself. My pre-meds have been pushed since I believe #3 chemo in early November. I find them harder on me. I get woozy or feel weird with them. The feeling does not last long. I have a port though, so it may be different if you do not. I am surprised too that the bag storage has not made the news. Or other companies have not stepped up their production enough to cover the storage. With the flu epidemic, I am sure the shortage is getting worse.",
      "MessageIndex": 4,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/862066",
      "Title": "Saline shortage during cmf chemo Bjbj Spookiesmom"
    },
    {
      "AuthorID": "Jennifer522…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260061/profile",
      "Content": "Sep 21, 2017 11:09PM Jennifer522 wrote: Thank you for posting! I was just diagnosed today (I am 45). I know it's going to be a long process but I have a 5 year old daughter to live and fight for",
      "MessageIndex": 9,
      "PostDate": "21/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/856831",
      "Title": "10 year survivor of TN cancer Mary95 EastcoastTS"
    },
    {
      "AuthorID": "Jennifer522…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260061/profile",
      "Content": "Apr 5, 2018 09:20AM Jennifer522 wrote: Are you getting any PS with the masectomy (expanders put in)? Since I am the PS is considered the lead surgeon My surgery is 4/10 and I have appt with PS 4/13 and 4/18 and BS 4/20. Glad lots of appts, that they just don't send you home and see you in 2 weeks. I assume dressing changes and drain management will the addressed at those appts.",
      "MessageIndex": 5,
      "PostDate": "05/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/863744",
      "Title": "How long should drains stay in? LizzyG32 Jennifer522"
    },
    {
      "AuthorID": "Jennifer522…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260061/profile",
      "Content": "Jan 26, 2018 08:13AM Jennifer522 wrote: I am noticing white hairs coming up on my head. The feathers or baby chick look, I have read about. They are just stubble right now but I can see and feel them. Thanks for mentioning Wunderbrow, I just ordered some from Amazon. I was looking at something for my lashes and I have heard about Lash Boost by Rodan and Fields but $150. Umm, no. I only have a few bottom lashes, pretty sparse on top but mascara helps on top only. Last chemo is March 20th and hoping by the first week of June I can go capless/wiggless.",
      "MessageIndex": 26132,
      "PostDate": "26/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jennifer522…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260061/profile",
      "Content": "Mar 31, 2018 11:43PM Jennifer522 wrote: When did your eyebrows start growing back? Mine started to thin around the beginning of the year and I have been completely eyebrowless since February. Finished chemo about 2 weeks ago",
      "MessageIndex": 26242,
      "PostDate": "31/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jennifer522…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260061/profile",
      "Content": "Jan 31, 2018 12:41PM Jennifer522 wrote: I am getting taxol every 3 weeks, 6 times. #4 is next week. I have been getting fuzz growing on my head after being smooth Mr. Clean bald. My eyelashes are pretty much gone on the bottom, 3 or so hairs left. But I can see short little ones growing. My eyebrows are thinned in the inner section and only a few hairs hanging on in the outer section. Today I noticed growing hairs in the inner section, looks like hairs a few days after shaving. I am guessing all these \"re-growth\" hairs will fall out again before I truely start to grow some head hair, eyelashes and eyebrows back post chemo",
      "MessageIndex": 26162,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jennifer522…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260061/profile",
      "Content": "Sep 30, 2018 12:34AM Jennifer522 wrote: Hi Rhonda. I am also in Greenville being treated at GHS. My type of cancer, chemo is a must since it’s not hormonal. Some women will travel to Dana Farber in Boston, MD Anderson in Houston or Sloan in NYC. Have you thought of getting a second opinion at GHS or Bon Secour. Or if your willing to travel to Duke. I didn’t get a second but I had to get into chemo right away and my treatment is on line with what other centers are doing.",
      "MessageIndex": 2,
      "PostDate": "30/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867501",
      "Title": "Greenville SC rhondawoman Jennifer522"
    },
    {
      "AuthorID": "Jennifer522…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260061/profile",
      "Content": "Dec 28, 2017 09:37AM Jennifer522 wrote: For beanies I have found they are good quality. I was gifted a few. I bought a few off Amazon and they are not as nice. ",
      "MessageIndex": 1,
      "PostDate": "28/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/861151",
      "Title": "Headcovers Unlimited LBoyMom Abjdsd2"
    }
  ]
}