{
  "AuthorID": "JeopardyLG",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269418/profile",
  "Posts": [
    {
      "AuthorID": "JeopardyLG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269418/profile",
      "Content": "Feb 26, 2018 11:00AM JeopardyLG wrote: Thank you ladies. I went to the doc and he said everything was normal because my bone marrow is trying to grow new white blood cells and making my bones hurt everywhere. I'm finally sleeping a little better but my sleep cycles are completely off. My husband is still suffering from the flu so it's been a rough week. Thank you so much for your support.",
      "MessageIndex": 3,
      "PostDate": "26/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/862711",
      "Title": "Is Neulasta, Tamiflu, or just chemo causing me to feel terrible? JeopardyLG JeopardyLG"
    },
    {
      "AuthorID": "JeopardyLG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269418/profile",
      "Content": "Mar 13, 2018 10:03AM - edited Mar 13, 2018 10:04AM by JeopardyLG **************Update****************************** This is Jeopardy LG's daughter here... she is so so so sick after her 2nd round of chemo. She hurts everywhere and cannot move. Hasn't gotten out of bed in 5 days. Every motion, every sound makes her nauseated. She is barely taking in any liquids or food at all. My dad is taking care of her 24/7 and can't even cook food for himself because the smell of food makes Mom sick. He's almost ready to hospitalize her just to get an IV of fluid in her. She tried to prepare better for this chemo by taking Claritin ahead of time. Worked for a couple days after then she got sick again. Is this normal???? Anyone else have it this bad? Maybe it's her IBS in combo with the chemo/Neulasta? ANY help or thoughts would be much appreciated. Thank you ladies!!!!",
      "MessageIndex": 4,
      "PostDate": "13/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/862711",
      "Title": "Is Neulasta, Tamiflu, or just chemo causing me to feel terrible? JeopardyLG JeopardyLG"
    },
    {
      "AuthorID": "JeopardyLG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269418/profile",
      "Content": "Mar 13, 2018 11:01AM JeopardyLG wrote: Thank you Nancy! I'll check on all you mentioned",
      "MessageIndex": 6,
      "PostDate": "13/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/862711",
      "Title": "Is Neulasta, Tamiflu, or just chemo causing me to feel terrible? JeopardyLG JeopardyLG"
    },
    {
      "AuthorID": "JeopardyLG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269418/profile",
      "Content": "JeopardyLG wrote: Feb 21, 2018 Hi - I received my first round of chemo last Tuesday (so it's been a week). On Wednesday I felt completely fine (my husband was diagnosed with the flu on Wednesday of last week so my oncologist put me on Tamiflu, and he is of course is too) and Thursday started to feel really bad. Friday through now I have felt absolutely terrible. I have never felt so terrible in my life. I can't eat, I can't sleep, I feel sick at my stomach all the time, and the pain is everywhere all the time. This is torture. Anyone else out there had to have all three of those meds (chemo, Neulasta, and Tamiflu) in their system at once? I also have IBS and take a daily probiotic. Just wondering what the problem is and if every round of chemo will be like this and for how long. Thanks in advance. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/862711",
      "Title": "Is Neulasta, Tamiflu, or just chemo causing me to feel terrible? JeopardyLG JeopardyLG"
    },
    {
      "AuthorID": "JeopardyLG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269418/profile",
      "Content": "Mar 14, 2018 09:21AM JeopardyLG wrote: Thank you everyone! My dad took her to the doc yesterday and they changed some of her medication. I will pass on the info about doing the shots though. That might be a good alternative",
      "MessageIndex": 10,
      "PostDate": "14/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/862711",
      "Title": "Is Neulasta, Tamiflu, or just chemo causing me to feel terrible? JeopardyLG JeopardyLG"
    }
  ]
}