{
  "AuthorID": "Jerseylicio…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134039/profile",
  "Posts": [
    {
      "AuthorID": "Jerseylicio…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134039/profile",
      "Content": "Aug 23, 2011 09:22PM Jerseylicious wrote: SummerGirl, I am right there with you!! I am due to start my chemo in September, and I am so so stressed about the hair thing! I don't think it makes us vain at all, I think just from reading these message boards, most of us feel the same way:) Anyway, I've been wig shopping and actually bought one, but now i don't even know if I really like it and I definitely don't know if I will ever feel comfortable wearing it! I'm fine with hats and scarves at home but I teach Kdg. and I really have to wear a wig to work. The problem is, there is so much selection in the stores and on websites! I've pretty much ruled out human hair i think, but is that a mistake? Can anyone offer pointers on what makes a wig LOOK more realistic? I just feel like once I have that settled, I will be able to stop stressing about it and I will be able to concentrate on getting better. Thanks!",
      "MessageIndex": 10975,
      "PostDate": "23/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jerseylicio…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134039/profile",
      "Content": "Sep 15, 2011 06:41PM Jerseylicious wrote: OK, first of all...you certainly do NOT seem like you are so big that they can't do reconstruction! 250? at 5'7\"??? Cut me a break! That just pisses me off.  But that's not what you need to hear right now.  You are only a couple weeks out from diagnosis and I will say that as time goes on it becomes more \"acceptable\".  Where chemo was once totally and completely unacceptable to me, after a few weeks and some research and soul searching, it slowly slowly became \"acceptable\". and now I start tomoro. And you will do the same thing too...whatever your treatment turns out to be, youcan and WILL do it.  Really. It is so normal to be mad even furious when you first find out.  Then with every treatment option it really IS like they/or the treatment is taking every bit of your beauty, or femininity away from you. At one point I even said to my oncologist...\" What do you people just want to make us as ugly as freaking possible?!\"  But you do come to terms with it, and I have had the good fortune to know a couple of women who have been through it and are out the other side and man, they are not only beautiful again, but they have total mojo!  Because this shit makes us stronger. I really believe that.  So take care Michelle, you are not alone.  Everything you feel is what all of us have felt to one extent or another.  Take advantage of all you can from your cancer center....things like \"Look Good, Feel Better\" and counseling, nutritionists....and just think...when you are done and you get new boobs and a tummytuck...you will be SMOKIN HOT girl!",
      "MessageIndex": 4,
      "PostDate": "15/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/774949",
      "Title": "And it keeps getting worse... Michele_T lhasamom"
    }
  ]
}