{
  "AuthorID": "jerzeygirl1…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252424/profile",
  "Posts": [
    {
      "AuthorID": "jerzeygirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252424/profile",
      "Content": "May 18, 2017 05:48AM jerzeygirl17 wrote: hello! I am 8 weeks out post op and have expanders. I read and stocked up on everything however this is what was most helpful:  wedge pillow to recline in bed - it will be very hard and uncomfortable laying flat for few days. satin button pajamas helped me slide in and out of bed. You will need some help or need to learn how to get up from the bed without straining your chest wall. button down shirts for drains and easy access - you will limited mobility with arms overhead no deodorant allowed for month or so no shaving - def shave or wax underarms before surgery! wash hair, get it done while you are at it since you can't shower for awhile. Only sponge baths.  dry shampoo lots of alcohol wipes - to clean and wipe arm pits as well use for drains. rubber gloves - for drains. you want to minimize infection so when you are doing drains - hands to be clean, rubber gloves and wipe the drain tip with alcohol wipes - most def is you have someone helping you always had snacks near by since the meds made me bit nauseous baby/body wipes to wipe your body down cozy easy slip on pants hand sanitizer and hand lotion bedside I purchased a neoprene drain holder for shower however I never used in shower since I wasn't given permission to shower with my drains but I did use the holder around the house when I didn't want the drains dangling from my shirt water - stay hydrated and vitamin C helps with healing seatbelt velcro buddy is helpful for when you are in a car - driving or being chauffeured keep items you use daily on counter so you don't reach get up and walk around as much as you can. it helps with circulation ( think blood clots) and moving (slowly) excalerates healing. I read a lot about the surgery and spoke to many women. I was very nervous for the obvious reasons. However, it wasn't as bad as thought. I had a great support system and my drains came out within 6 days. No infections. Drugs were helpful the first few days! However, the tissue expanders were extremely uncomfortable for days. Each time you get filled too, the pressure returns. I had a hard time catching my breath and talking the first few days. It feels like a large elephant on your chest but each day it gets better and you will get relief between expansions I am 8 weeks in and have a lot of relief now. I still can't sleep on my stomach and side sleeping can be frustrating at times but def a lot better. I feel like I have a bra on 24/7 - which I do - an internal bra  Don't buy bras....you won't need them or be using them. Wear button down loose shirts. I have tried wearing some soft bralets recently however they have been so tight but I can't feel it since I lost sensation. My doctor doesn't recommend bras especially post op.  Hope this helps. Good luck to you. Sending you healing light  ",
      "MessageIndex": 184,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "jerzeygirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252424/profile",
      "Content": "May 18, 2017 05:50AM - edited May 18, 2017 09:00PM by Moderators",
      "MessageIndex": 185,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "jerzeygirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268079/profile",
      "Content": "Feb 1, 2018 11:03PM jerzeygirl1970 wrote: Thank you so much for the information CindyNY. I pray that's it in my case. I was just floored when she said my left breast. It didn't register at first then it hit me the left breast is the reason for the mammogram. I never thought I would be in this position waiting on pins and needles but here I am and we will deal with it if there is an it or celebrate if it's not.",
      "MessageIndex": 4,
      "PostDate": "01/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862180",
      "Title": "It all started with itching jerzeygirl1970 jerzeygirl1970"
    },
    {
      "AuthorID": "jerzeygirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268079/profile",
      "Content": "Feb 1, 2018 10:46PM jerzeygirl1970 wrote: Thank You Kbee, I never associated small breasts with dense tissue. Probably because when I lay down they practically disappear, and when I think dense I think bulk. If that makes any sense. Thank you so much for your input. You are a true survivor and I'm honored to have your input.",
      "MessageIndex": 2,
      "PostDate": "01/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862180",
      "Title": "It all started with itching jerzeygirl1970 jerzeygirl1970"
    }
  ]
}