{
  "AuthorID": "jess15rae",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132659/profile",
  "Posts": [
    {
      "AuthorID": "jess15rae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132659/profile",
      "Content": "Jul 20, 2011 03:28AM jess15rae wrote: Lavendar I can totally relate I'm 28, with a grandmother and aunt who both had masectomys in their 40's. I was told the same thing by my regular doctor, that it was unlikely that it was cancer, however after having a ultrasound and mammogram a biopsey was reccomended.  At my consultation with the surgeon he suggested that I have a lumpectomy instead of the biopsey, my sugery is scheduled for next wed. I am so nervous, I have been having terrible anxiety since I saw the surgeon. Know that you are not alone in your nervousness...I hope your ultrasound went  well for you",
      "MessageIndex": 16,
      "PostDate": "20/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771660",
      "Title": "Breast lump @ 27, strong family history Lavender250 del4"
    },
    {
      "AuthorID": "jess15rae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132659/profile",
      "Content": "jess15rae wrote: Found a lump in my breast in Dec. and had a mammo and ultrasound done,  went back last month to have the lump rechecked and they said it had changed in a size and shaped. So they sent me to a surgeon, who wants to removed the whole lump. My surgery is a week from today, but I just can't sleep...so worried about what they might find. Im only 28, my husband is in the military and away from home right now, I also have a 18 month old daughter. I have got to find away to calm down so I can get some sleep! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771884",
      "Title": "So nervous I can't sleep! jess15rae justjudie"
    },
    {
      "AuthorID": "jess15rae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132659/profile",
      "Content": "Jul 21, 2011 11:18PM jess15rae wrote: Ladies thank you so much for your kind words. It is so comforting to know that I am not going through this alone. I did get a prescription for Ativan, and am thinking about taking it tonight so I can get some sleep. So hard going through this without the emotional support of my husband, but I  am trying to stay strong for myself and daughter. I definitely think the worst part is not knowing for sure and waiting now for surgery and to find out. Jen-I wish you luck with your surgery on Wed. and will be thinking of you. Sub- Sending prayers and strength your way!",
      "MessageIndex": 6,
      "PostDate": "21/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771884",
      "Title": "So nervous I can't sleep! jess15rae justjudie"
    },
    {
      "AuthorID": "jess15rae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132659/profile",
      "Content": "Aug 8, 2011 09:12PM jess15rae wrote: Test results back today and the lump they removed is benign! I was told I have a fibrocystic breast condition. So glad to hear these positive results. Thank you all so much for your support and prayers. I am taking this as a wake up call from God to live each day to the fullest, because you never know what tomorrow may bring.",
      "MessageIndex": 9,
      "PostDate": "08/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771884",
      "Title": "So nervous I can't sleep! jess15rae justjudie"
    }
  ]
}