{
  "AuthorID": "jessica749",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
  "Posts": [
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jul 7, 2012 07:42PM jessica749 wrote: MeggM, more power to you! I must say, I think you are very brave and doing the right thing! While medicine has made such strides, we know really very very little, about cancer, genes, how it all works. Your family history is worrisome as you say, discovered gene or no discovered gene (at this point in our knowledge).  If you go to very experienced surgeons at major medical centers, it seems there's little downside to the prophylactic action. gamegirl and 2friedeggs: your stories are frightening but not surprising: I just was talking with a group of bc \"sisters\" IRT and three of us had stories of \"missed\" cancers...not because we weren't being 'watched' or screened, but because of the limits of medicine's technical ability. And yes, if this is bc, which supposedly is one of the easily screened for cancers, imagine ovarian!! All I needed was one pelvic ultrasound at Sloan Kettering to convince me I could never go through it again, let alone every 6 months as they were recommending. Don't get me wrong, I felt the radiologist (who came out and had a look herself after viewing the images she received) did a great job, I was very impressed: it was  much, much more thorough than two others I had done in the last decade (pre bc but under  anxiety attacks) by so called gynecological cancer experts. But yes, because  I know the ability of an ultrasound to pick up an early ovarian cancer is much more limited than a breast mammogram, and I too have my missed bc mammogram story...I just couldn't go through that again, same reason I did the double bmx when cancer was supposedly only in one breast (but no mammogram found it, not palpable)...luckily I was still in stage 1 when it was caught anyway. So yes, very much share your mindset of needing a little bit of peace of mind on the other fronts as we all remain concerned re our IDC.  Good luck to everyone!",
      "MessageIndex": 15,
      "PostDate": "07/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/787411",
      "Title": "Prophylactic hysterectomy/oopherectomy jessica749 howhm02l"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jan 8, 2013 05:28AM jessica749 wrote: A freind of mine saw Dr Schnabel years ago, when she was with Columbia Presbyterian, for a benign condition. As you know, Dr Schnabel is top ranked.  If you have an appt with her, great.  She has years of experience, a reputation which proceeds her, and I should think that she would advise you well.   Personally, I am partial to MSKCC and cannot recommend Dr. Van Zee enough. But if you need bc to get in, so be it.   Also, I was in the MSKCC surveillance program. Dr. Debra Mangino runs it. She, along with Dr VZ, saved my life.  If you can get in it, and I'm not quite sure how it works from the outside, by all means do go.  I think you have to be a high risk for bc though. For example, you need a condition such as BRCA, or ADH, or something. Read about it, they list the conditions pretty clearly. I'm not sure that having a fibroadenoma gets you in or qualifies you as a high risk person.  You do not say (unless I missed it) why you are at 'extremely high' risk.  ",
      "MessageIndex": 8,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/798382",
      "Title": "MSK's Special Surveillance Breast Program? lpost3698 lpost3698"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jan 9, 2013 06:00AM jessica749 wrote: Yes, it's short/the website.  I don't know if you can get in with those things that you list above, but it does say (the website) something about first degree relative.   With regard to what it entails, I think  that Dr Mangino is patient specific in her recommendations. If you are interested to learn more about it in terms of whether your situation merits it,  why not just call her office and ask! And remember, if for whatever reason they say the program is not for you, you should follow your instinct and do the kind of monitoring / surveillance that you feel is merited.  Good luck.",
      "MessageIndex": 10,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/798382",
      "Title": "MSK's Special Surveillance Breast Program? lpost3698 lpost3698"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jun 10, 2012 08:20PM jessica749 wrote: Lucia83, AWB, Jomama2, and Vetmom: Thanks very much for sharing your experience with me.  I'll plan on having family stay the first 4 days, then make provisionial babysitting/housecleaning arrangements over the next 10 days.... I wonder if I will be switched off of tamoxifen pretty quickly- and Vetmom looking at your post it appears that's very likely - switched to an aromatase inhibitor.  I am very comfortable with the idea of taking Tamo for another year so that I can get the minimal 2 yr benefit from taking it (though they say 5 yrs is optimal).   Seems like a waste to have taken it for a year....do you know if it's possible if my oncologist would allow me to continue on Tamoxifen for another year, then switch me to arrimidex?  AFter all, didn't tons and tons of postmenopuasal women up until just about 10 yrs ago take tamoxifen as  Aromatase inhibitors are fairly new.  Just trying to anticipate what the oncologist would say is wrong with doing that... Thanks.",
      "MessageIndex": 7,
      "PostDate": "10/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/787411",
      "Title": "Prophylactic hysterectomy/oopherectomy jessica749 howhm02l"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "jessica749 wrote: Hi, I'll be getting a prophylactic hysterectomy/oopherectomy in a couple of months. The plan is to go laproscopically.   How long will I be bed-ridden for? I ask because I am a single mom. My children will be in camp full time during the period, but I wonder if /for how long I may need to pay for an aide.  The first 3 days? The first week? Two weeks?   I expect that I won't be able to do much, no heavy lifting, over exertion, etc., and that's fine, but wonder if I can cope around the house myself/showering, cooking, very light housework after the first few days...my kids will get picked up by bus for camp, so it' s not like I need to drive them anywhere.  I can microwave frozen dinners for a week, etc.  Very much appreciate advice on what I might handle. Thanks. Dx 1/17/2010, IDC, <1cm, Stage I, Grade 3, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/787411",
      "Title": "Prophylactic hysterectomy/oopherectomy jessica749 howhm02l"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jun 11, 2012 06:55PM jessica749 wrote: Continued good luck on your smooth recovery, Gamegirl. And congrats carpediem to your good recovery. Hope to follow in your paths, and I know that the peace of mind I gain will be great. Gamegirl, you have a photo up that looks so young and no mention of fibroids. Can I ask why a hyster/oopher. was recommended? Was it a genetic mutation?",
      "MessageIndex": 11,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/787411",
      "Title": "Prophylactic hysterectomy/oopherectomy jessica749 howhm02l"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jun 10, 2012 08:14PM jessica749 wrote: Re hystersisters:  hanks but I find that hystersisters website incredibly busy and difficult to navigate. It sounds pathetic I know but I cannot find my way to simple information there, beyond an initial posting. So that's kind of a dead end for me but so glad it's helpful apparently to so many others!",
      "MessageIndex": 6,
      "PostDate": "10/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/787411",
      "Title": "Prophylactic hysterectomy/oopherectomy jessica749 howhm02l"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Aug 19, 2013 04:26AM jessica749 wrote: I agree w curveball that you must make the choice based upon which route, at the end of the day, you think you will least regret. I opted for bmx based on numerous risk factors (ADH, family history) in addition to an IDC (+DCIS) in excess of 2 cm, none of which was palpable or visible on mammogram. I also had been thru lumpectomy in the past for ADH. By the time of my diagnosis, I felt \"done\". I was so relieved that there was an option to put an end to all the drama over margins and screening and breast biopsies. I never wanted to experience any of it again, was in my 40s and didn't care about my breasts. When my surgeon wanted me to get a pre-surgery mammogram, I was bummed. As I walked out of the elevator to the screening facility, I was depressed and anxious and angry to have to be back there and go thru a mammogram again. I never wanted another mammogram, ever. I just was done, as I said. I knew, no matter what I felt about losing my breasts and having reconstruction, I would be filled with greater regret everyday if I kept them. Not having to do radiation was a huge giant bonus. But I admit it didn't factor in as much as a second bc or local recurrence concerns did. Another perhaps smaller factor I considered in addition to those posted above is - if lumpectomy, ask your surgeon how often they need to do a follow up surgery for clean margins. At Sloan I think they cite 20% as the number of cases where margins aren't clear and they need to go back in.",
      "MessageIndex": 37,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/808846",
      "Title": "How did you decide on lumpectomy or mastectomy/ livingwithit IrishDancingMom"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Nov 13, 2013 04:02PM jessica749 wrote: TG 1969: just from what i read, not knowing any particulars, I think it's likely the onc's at Sloan and Cleveland made the recommendation they did based on the fact that it was E+. Hormonal therapy is known to be the single greatest / most effective treatment for E+ bc. It is not a treatment for triple negative, of course. the treatment for triple neg as you know is seen to be chemo, and chemo is very effective against it in many many cases. I understand your fear of chemo, anyone rational would be. But please, please, find yourself a support group of people who have been thru what you are going thru and please please be open to the treatments your onc suggests. Go for a second opinion if you are unsure...",
      "MessageIndex": 47,
      "PostDate": "13/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/763394",
      "Title": "Oncotype DX test score at 18 - chemo or not? julie775 Bamagirl2016"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jul 13, 2014 01:54PM jessica749 wrote: I think one needs to be wary of stats and  query the source of any stats from you doctor. So many studies include populations that are NOT like your bc profile, and therefore the stats are just an  extrapolation based on population groups who may, or may not, resemble you/the patient. THis is where informed opinion/informed  JUDGMENT (excuse all caps)  comes in. I just need to emphasize that it's a judgment call. The stats can only guide so far. You must know what is the population studied, from which the stats being quoted, are culled. You must have the ability to know the limits of the study and how far it may / may not apply in a patient's particular case. For example, my MO has routinely rattled of stats to me re particular questions I've had re treatment. At the same time, my MO has said that the stats are based on people whose bc is more advanced than mine. So, the question remains, as my MO will always say, whether there would be the same effect/response etc on \"MY\" bc.  One can PERHAPS reasonably extrapolate \"yes\".  This is where the informed judgment comes in, with regard to what the stats are, the population they are based on/c ulled from, the nature and limits of the particular study. To original poster, MomtoIrishQ…, your bc tagline says P negative, and it also says invasive lobular.  80% of bc as you know is IDC vs ILC.  And hormonal bc usually means (I think) P positive as well as E+  So just beware of the 'internets' in my opinion (which includes these boards, and you might think my opinion!) which may cite stats but they may be based on large populations whose bc profile is quite different from yours.  And  this is why I urge you to seek and spend $ for highly credible second opinion. Okay, I'll try and shut up now. Good luck.",
      "MessageIndex": 12,
      "PostDate": "13/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/822733",
      "Title": "What happens if I drop out of chemo? MomtoIrishQuads MomtoIrishQuads"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "May 28, 2013 06:05PM jessica749 wrote: more likely just confused reporting! (re brca 1 vs 2). Who knows.",
      "MessageIndex": 114,
      "PostDate": "28/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/804660",
      "Title": "Angelina Jolie's prophylactic surgery JoanQuilts SusansGarden"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Oct 21, 2013 04:42PM jessica749 wrote: Phyldon6: Why don't you yourself consult with ROs at Sloan, and/or if you are in NJ far from NYC, find an expert RO at Fox Chase or Johns Hopkins (not far-can make the trip in a day). Not sure what your doc means re \"consulted \" with Sloan and Anderson! Sounds weird. What: he gets a patient, then calls those places to speak to someone he knows about what to do? Of course not. Get your information yourself from a second opinion that you can value if you are not comfortable with what this RO is saying. You certainly deserve the courtesy of further explanation re: why the recommendation is being made nonetheless even if your concerns are valid.",
      "MessageIndex": 9,
      "PostDate": "21/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/811782",
      "Title": "Had recurrence and Dr wants to do radiation AGAIN!?!? Run4Us Run4Us"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "May 28, 2013 06:17PM jessica749 wrote: Wow, it's interesting to read the backlash against AJ. She could have just kept quiet about it. I guess some posters would have preferred that she did. I for one am glad she came out with it. Clearly, lots of others argree with me.   Of course, people are still amazingly ignorant, the media coverage leaves alot to be desired, people far and wide still don't understand, don't get it-okay, so it's far from a sea change effect - but at least there is a little more awareness among some.",
      "MessageIndex": 115,
      "PostDate": "28/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/804660",
      "Title": "Angelina Jolie's prophylactic surgery JoanQuilts SusansGarden"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jul 23, 2013 10:21AM jessica749 wrote: Also, i want to make the point the breast density rating is of course a subjective rating.  re my own personal experience:  My breast density was rated \"3\" hetergenous yet, an abnormal mass measuring well over 2 cm. was found by MRI.  It was invisible, literally, on the mammogram. Post surgery a smaller part of this measured as invasive cancer. So, hetergenous I have learned is considered \"dense\". Dense means that mammograms aren't good enough.  If you are at least a \"3\" you need something more in addition to mammgram, at least an ultrasound.",
      "MessageIndex": 9,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/807948",
      "Title": "Breast density alrz1980 farmerlucy"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Dec 10, 2013 03:51PM jessica749 wrote: Anyway, it doesn't really matter. Lots of well known people with BC choose a variety of places/institutions and doctors here in NY. I could be wrong, but I think Cynthia Nixon was at St Lukes/Roosevelt and Robin Roberts originally at Lenox Hill. As I said, I could be totally wrong but I think something I read about each of these women after the fact mentioned their surgeon/place of surgery. Who knows if 'all' their treatment was at the same one place. If you have a serious health issue, being in NYC and having financial resources- along with great health insurance- gives anyone several good choices!",
      "MessageIndex": 23,
      "PostDate": "10/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814442",
      "Title": "Amy Robach voraciousreader voraciousreader"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jul 23, 2013 10:12AM jessica749 wrote: But Maylen said she is \"high risk\" along with the other descriptive factors, so perhaps her doctor's recommendation for MRI is very much in keeping with recommended care standard.   Maylen, my Q to you is this: why are you 'monitoring\" two lumps? Why not just remove them?",
      "MessageIndex": 8,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/807948",
      "Title": "Breast density alrz1980 farmerlucy"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Nov 14, 2013 07:02PM jessica749 wrote: I thought this post on Dr Susan Love blog was interesting re the Robach diagnosis http://blog.dslrf.org/?p=1811 Alpineartist: Re ??? on 'putting off' mammogram when recommendation is for 40…I think the recommendation is (or was at least in my day 10 yrs ago) to get a 'baseline' btwn 35-40 and then get annuals beginning at 40…I think I had my first at 37 or something, \"baseline\", then waited tip 40 for annuals. Have no idea but perhaps that's what she meant re \"putting off\"…? Also, many are commenting that she 'rushed' into a decision somehow. Just because she only announced this news to the world days before her surgery doesn't mean it was rushed at all. She could have known about - in fact it's kind of likely - she knew about the cancer for several weeks now. It was only announced the other day because she was leaving ABC News for undisclosed amount of time for surgery and as yet to be confirmed/ determined treatment. I'm sure there was no 'rush' and she made her decision with all the deliberateness she needed. It took me just under 3 weeks from diagnosis to bilateral surgery. And two weeks of that was just waiting for the OR appt. I knew pretty soon after diagnosis exactly what I wanted/needed. Was quite deliberate and thoughtful as to the reasons. Have never regretted it or looked back. Why the judgment on Ms Robach as anything less? I do agree though that the line about \"mammogram saving my life' is annoying, particularly because as Dr Love says one really has no idea if that is the case. It's kind of misinformation in the absence of any other information. If only she left out the touting of the mammogram (reminiscent of Andrea Mitchell). In any event, I believe today was Amy Robach's surgery. Hope it went well and the results of testing are all as positive as can be for her.",
      "MessageIndex": 13,
      "PostDate": "14/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814442",
      "Title": "Amy Robach voraciousreader voraciousreader"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Dec 10, 2013 03:47PM jessica749 wrote: Really? Who is her oncologist,supposedly? Assume NYU, something made me think she went to NYU for treatment - something mentioned in something I read perhaps? Not sure. Could be wrong.",
      "MessageIndex": 22,
      "PostDate": "10/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814442",
      "Title": "Amy Robach voraciousreader voraciousreader"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jul 22, 2013 09:28PM jessica749 wrote: Hi alrz1980. Good for you being so proactive and seeking knowledge PRE cancer. More power to you ! Wish I had been like you! LIke 2timer I discovered the areyoudense.org site too late: after I was also dealing with the fall out from cancer discovered easily via MRI and sono but invisible to mammogram.   Totally agree with farmerlucyd... I don't think your density is abnormal in any way. I also don't know if the supposed inc risk for dense breasts inc your risk now but it absolutely does impact the risk of the mammogram reading being incorrect.  Mammograms really are not that good at reading very dense breasts of a 33 yo, or a 43 yo, or anyone premenopausal, for the most part. So be sure to get ultrasounds. Maybe every year? There is no radiation. ONly risk is taht you may endure unnecessary biopsies/worries. But coupled with the baseline mammogram you obtained, why not?  I say 'why not' because you seem very concerned about this, so as long as you are aware of ultrasoundlimitations...",
      "MessageIndex": 4,
      "PostDate": "22/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/807948",
      "Title": "Breast density alrz1980 farmerlucy"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jul 23, 2013 10:35AM jessica749 wrote: Beesie, good, we are in agreement. I know, I overreact totally based on my own personal experience. Many of us do!!! My bmx was an 'overreaction'. I told my surgeon very rationally I knew I was 'overreacting\" to the diagnosis but that it was very thought through, on my part, and a decision which (albeit extreme) was right for me.  (I also had ADH, so always was going to be someone who would need 2x a year imaging at least-mammo plus u.s. or mri- and knew I didn't want to deal with it and the ongoing anxiety, time, expense, around it at this point in my life - clearly not a decision as easily/quickly made had I been younger than 47, etc.).",
      "MessageIndex": 13,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/807948",
      "Title": "Breast density alrz1980 farmerlucy"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Aug 13, 2013 08:02PM jessica749 wrote: Hi everybody. I was so full of my own experience when I was posting. And reflecting on anonymous sisters' and their posts/thoughts/experiences.  Amongst it all, I almost totally forgot about my real live flesh and blood sister, who has \"4\" density breasts, post-menopause.  She only knows this because of my experience: I told her a couple of years back, after my missed cancer, to find out her density rating info from her doctor. So, in response to my prodding, she asked and she was told: it was a 4.  She couldn't believe it, and neither could her not so good gynecologist, who was as surprised as my sister (incredible, right? We both live in major cities, with doctors affiliated with major hospitals, etc.)  So THEN, and only then, did her gynecologist send her for breast ultrasounds, too. I've been thinking about it a bit over the last couple of years, and we've discussed that maybe she should step it up to MRIs.  This thread reminded me.  I emailed her a couple of weeks back, and she said she'd look into it. Today I phoned and basically yelled at her (lovingly!).  Upshot: she just emailed that she is booked for MRI next week and insurance is covering due to \"family history\".  (me, and maternal grandmother pre-menopause;  our mother post menopause/age 70).  I as her sister am so relieved she is doing the MRI screening with her family history/age/density.   Thanks everybody at breastcancer.org for educating/ discussing / provoking thought / reminding me, so someone like my sister who never visits here can still get the benefit of collective, potentially life saving, wisdom.",
      "MessageIndex": 22,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/807948",
      "Title": "Breast density alrz1980 farmerlucy"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jul 23, 2013 10:29AM jessica749 wrote: I had BMX too after my 'nightmare'.  I was not about to deal with the uncertainty and hair splitting that goes with the territory  upon which our life can sometimes hang in the balance (which imaging test has best accuracy according to which study; which population percentage wise benefits in the cost/benefit macro analysis; which doctor you go to who recommends / tells you what information that helps you make a good/bad decision; what job prospect you have and the insurance company that goes with it, or god forbid unemployement and no good insurance options...).  Whew. Not happy to not have my real breasts. Feel deformed. But I would make the same decision again, and again, and again. No regrets.",
      "MessageIndex": 12,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/807948",
      "Title": "Breast density alrz1980 farmerlucy"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jul 23, 2013 05:20PM jessica749 wrote: My reading and experience is that you can never know if there is \"definite cancer\" until the entire lump is removed and pathologically examined. If you want, you could ask your doctor if this is so.   RE an MRI: I think she may sbe suggesting this because she may want additional imaging to be sure of what the other information gathering tools (all by necessity limited to varying degrees) are saying (benign).  You can ask her if this is true too.",
      "MessageIndex": 16,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/807948",
      "Title": "Breast density alrz1980 farmerlucy"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Nov 14, 2013 07:22PM jessica749 wrote: Pamala: please don't make the mistake of thinking that because people are 'celebrities' they see the best doctors. I don't mean to publicly slam anyone, but let's just say that some, or at least one, celeb's bc docs that have been in the news are not impressive to me at all. No doubt they've impressed some rich celebs, but there you are. Now. generally speaking rich and powerful people DO see md's who are among the best doctors. But not nec. Hollywood celebs…! On a personal note my entire extended family has been less than impressed with our own personal experience situations involving cedars sinai. Look, it's a famous place, filled with celebs…but is that the best hospital in the LA area? Hardly. Just sayin'. Just my two cents, Manhattan best doctor snob that I am!!!! ;o) Clearly, many rich people with ability to make many more choices in life disagree with me…but please please, don't assume a rich celeb's choices are 'better' because their doctor is necessarily 'better'. What a celeb might be concerned with more than you is a certain cosmetic thing. They may have different real considerations. And obviously, in Angelina Jolie's case, she had a genetic mutation. If you don't have the BRCA gene, then that's that. Angelina got her BMX because of that, and it was a very sound decision. Ms.Robach: we have no idea. There are many, many possibilities that could have led to her decision, but it's useless to speculate about them. One of which could be that she doesn't care about the stats on survival: it may be that the only thing she's thinking is that she never, ever wants to go through a mammogram and breast cancer surgery again insofar as she can control it. Even if her statistical odds of local recurrence or new bc are very low: they are real, they are there, and she might want to assert as much control over the situation as possible. She is young, her life is threatened, she has two small kids, this is entirely reasonable to me. I don't understand why this perfectly understandable reasoning is so discounted by so many. Overall survival is one thing. I understood perfectly well that my overall survival re the bc I was diagnosed with would not be affected in any way by my decision to do a BMX. It was other reasons. There are valid reasons women have BMX w/o BRCA and without 'needing' to. It doesn't mean we don't understand overall survival stats, or that we are rushed or ill informed or operating out of fear, in the most insulting way that is meant. Because of course there are a lot of things we do, and don't do, out of fear, and that's good!",
      "MessageIndex": 14,
      "PostDate": "14/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814442",
      "Title": "Amy Robach voraciousreader voraciousreader"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "May 25, 2015 10:43AM jessica749 wrote: Hi, sorry for your diagnosis and worrying over a long weekend. Not sure what your location/insurance is but rather than a \"general' surgeon I would try and find a breast surgeon at a NCI cancer care center if possible (would have breast specialities) see here http://www.cancer.gov/research/nci-role/cancer-cen... It is possible to have dcis and idc, not unusual. I had that. Think of it as maybe all once dcis, but some of it has broken out of ducts and become invasive…. ",
      "MessageIndex": 2,
      "PostDate": "25/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/831927",
      "Title": "Just diagnosed questions... gooseberry LindaKinNC"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "May 26, 2015 06:47AM jessica749 wrote: Gooseberry, you ask a valid question not obvious on surface but Cleveland Clinic IS an NCI - designated CC center --- it is part of Case CCC. See the description in depth for Case CCC (from the NCI link) -  \" The Case Comprehensive Cancer Center (Case CCC) at Case Western Reserve University was both founded and became an NCI-designated cancer center in 1987. It was recognized as an NCI-designated comprehensive cancer center 11 years later. In 2004, the institutional and membership base from the founding partnership between Case Western Reserve and Ireland Cancer Center of University Hospitals (UH) expanded to include the Cleveland Clinic. Cancer research and care at these three institutions are now unified under the leadership of the Case CCC. In addition, the freestanding cancer hospital at UH, the Jane and Lee Seidman Cancer Center, open in Spring 2011.\"",
      "MessageIndex": 9,
      "PostDate": "26/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/831927",
      "Title": "Just diagnosed questions... gooseberry LindaKinNC"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "May 26, 2015 06:59AM jessica749 wrote: I would absolutely definitely WAIT the extra couple of weeks. You can keep calling to see if there are any cancellations. Be a kind squeaky wheel who just explains nicely the anxiety and the desire to come in earlier should the occasion suddenly present, and if they don't mind you don't mind calling to check in every couple of days…. I don't know, it worked for me getting in much earlier than the initial weeks I was told it would be before my appt…I know I was lucky yes but also if I hadn't called AGAIN, the opportunity wouldn't have presented itself. That said, waiting 2-3 weeks won't matter as someone above said. What could matter for the rest of your life is sub-par care. There is so so so much that is unknown, and what is known is limited. Carefully choosing the institution, and the people within it who will be your primary care providers (assuming you have some choices here in terms of resources/financial/insurance and locations) is one of the few things you can do to ensure the best outcome for yourself. Is there a way to further research the providers at CC you might meet with? Is it an oncologist first, or a breast surgeon? Find out who they all are, focus in on the ones you might trust most. If you have the time and inclination that is. It's a way to channel anxiety positively an have 'control'. At least what I am telling you is what works for me/ my modus operandi! ;o)  ",
      "MessageIndex": 10,
      "PostDate": "26/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/831927",
      "Title": "Just diagnosed questions... gooseberry LindaKinNC"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jul 13, 2014 11:32AM jessica749 wrote: Sounds like your MO is being very very honest with you: that is, who knows if it will help or not, but personally I prefer a doc who gives me the highlights of what the data as of today shows, and their opinion of what I should do.  I mean, heck, to me that's what a professional is for - their guidance and judgment (especially MO) not simply \"skill\". That said, kudos to your CA doc for giving you what you seek- informed opinion on the specifics of your case.  I don't know much but from reading the \"internets\" etc invasive lobular can be tricky as can E+P-....but then, what do I know ? I don't  have anywhere near the credentials of either of your MOs to weigh in with an informed opinion on your personal, individual case.  I would urge you to seek formal second opinion at top ranked cancer center - make the trip, pay the money, overnight etc, and have them review your particulars. With highly hormonal bc I doubt anyone would say you \"need\" chemo the way triple n does, but really it seems to me what you want to know is if - in your case - it would be a recommended course.  If you proceed you can with the highly ranked second opinion behind you, or, if they don't recommend it, you can stop and not second guess. ",
      "MessageIndex": 8,
      "PostDate": "13/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/822733",
      "Title": "What happens if I drop out of chemo? MomtoIrishQuads MomtoIrishQuads"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "May 6, 2014 05:35PM jessica749 wrote: No, is the short answer. Most women who have had bc do not as a rule get their ovaries checked.  I know this because I wanted my ovaries checked. In fact, even before bc I wanted my ovaries checked. And, as my former gynecologist told me, it's not part of the guidelines.  (whatever is the gynecological professional org., it's not part of the 'guidelines' of standard treatment to check ovaries for otherwise normal people of those who've had bc without any other indicators….). I dumped my former pre-bc gynecologist over this. (Their refusal to screen me for uterine cancer l -et alone ovarian- beyond pap smear.) You should be tested for BRCA because you had bc.  I think medicaid would pay for this if you are youngish. Certainly you can make the argument, and please do in writing to them. If you were positive for BRCA 1 or 2, then you'd get your ovaries checked regularly and indeed it would be recommended that you remove them after child bearing years/circa by age 45.  But without any other risk factor no, you won't be screened for ovarian as a matter of course.",
      "MessageIndex": 1,
      "PostDate": "06/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/820843",
      "Title": "question about ovaries in relation to breast cancer scary scary"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Dec 28, 2012 04:07PM jessica749 wrote: You are trying to answer a question that the smartest researchers/doctors/scientists in the world still cannot answer. Why do some women develop bc, and others, don't?  The answer is they/we have no idea. We do know that certain factors increase risk (genes, alcohol, overweight, etc.) and other factors decrease risk (regular exercise) but it doesn't mean anything more than that. Factors that can increase or decrease risk. They don't guarantee you are free from it or that you will get it. So while I go back over the past sometimes too, I remind you it's a negative no-win thing to do.  You got bc because you were unlucky. There really is nothing to fathom beyond that. Go forward from here.  Keep up/continue your healthy lifestyle as it will help you during treatment and recovery, and will help lessen your risk of recurrence in the future.",
      "MessageIndex": 1,
      "PostDate": "28/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/798119",
      "Title": "What changes have you made after dx? Speedy4 msphil"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Aug 19, 2013 10:33AM jessica749 wrote: Okay, I get it (re 'intuition').  Interesting how tough cutting breast tissue could be! I only heard of scar tissue being difficult to cut through because of course it literally hardens.... Were your great aunts, who were sisters you say, the only sisters of your paternal grandfather? And if they were the only sisters of your paternal grandfather, does your father have any sisters?  Just trying to get a sense of how many women there actually are on that side of the family for context within which to judge the history.",
      "MessageIndex": 18,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/808906",
      "Title": "Diagnosed with Atypical Ductal Hyperplasia....question Momcat1962 Momcat1962"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Aug 18, 2013 11:07AM jessica749 wrote: Hi momcat. What does your surgeon mean by she had a \"tough time\" during surgery? I didn't know density affects difficulty in the operating room. Forgive me, I may be misunderstanding this out of much needed context but in my opinion, if my doctor told me to go on \"intuition\" - I'd like clearer guidance if my doctor ever told me that-and I would certainly seek clearer guidance. The science might be unclear, and my doctors might not be able to know things with certainty or guarantees, but I absolutely look for guidance/confident judgment. I couldn't handle them telling me to go on intuition. Also, I agree with you re diagnostic mammogram. If your breasts are very dense, and if nothing showed before, I'm not sure what could give you and your doc any confidence that anything will show next time! \"Diagnostic\" or not... While I posted elsewhere about how I myself have never sought 2nd opinions, this is a case where I would! Also re ADH- I had such a diagnosis after palpable lump discovered on exam some yrs back. BS offered T, I didn't take it as risk seemed too great. BS had me screened via mammogram every 6 months. Unbeknownst to all my \"experts\" I put blind trust in, and prior to breast density laws enacted in NY which now ensure patients are informed unlike I was, bc grew inside undetected. I had no knowledge of the density issue. Purely by LUCK I got to another expert who told me to get an MRI where my bc was discovered. And it was pure luck. Good for me to remember that - how absolutely lucky I was.... Once i was diagnosed, I decided to get a bmx. I'm not sure if it took me 24 hours or the weekend to decide, but once I decided, there was no going back. It was a decision i have not regretted. I wasn't interested in a lifetime of screening apps -annual mammograms and ultrasounds and MRIs, the biopsies and false alarms that might then accompany, and the elevated risk, btwn bc, ADH, family history, etc , that I'd carry. I also realized how it was by pure luck my bc was discovered at what i hope was an early, curable, stage, and that I may not be so \"lucky\" the next time. (Hoping that I truly did escape it this time- final chapter not yet written!). To me, I weighed solid medical considerations going forward, the screenings, the costs (emotional), the limits, my higher risks of which ADH was now one of several. Of course, your situation is different. I would at least seek second opinions from the most expert people you can manage. And I would absolutely get u/s in addition to mammogram. You express concern that screening didn't show your ADH but that's not so alarming as ADH is a benign condition, and in a sense it doesn't really matter that the condition never showed. Your concern is that screening show when there is cancer or if luckier a pre cancer DCIS. So far, so good, on that front.",
      "MessageIndex": 14,
      "PostDate": "18/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/808906",
      "Title": "Diagnosed with Atypical Ductal Hyperplasia....question Momcat1962 Momcat1962"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Aug 19, 2013 10:41AM jessica749 wrote: PS Re your grandmothers-of course you know to get colonoscopies starting at age 40.   The CW is to start at age 50 but with two second degree relatives you are at an increasted family risk.  How often, I suppose you could talk to the GE. I think the CW is every 10, but again, you have increased family risk, not nec high risk.  ",
      "MessageIndex": 19,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/808906",
      "Title": "Diagnosed with Atypical Ductal Hyperplasia....question Momcat1962 Momcat1962"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "May 22, 2015 04:50PM jessica749 wrote: Probably didn't give you a real answer because no one really knows…!",
      "MessageIndex": 150,
      "PostDate": "22/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Mar 1, 2011 09:57PM jessica749 wrote: Kittymamma, I am so sorry to find myself here agreeing with you. I live near a major national cancer center, where I have had mammograms done annually from age 40 on (beginning with baseline at 37).  Many cancers run in my family and I fear all of them, but certainly where breast cancer was concerned, I thought I was in a position to 'catch' whatever would be there.  Imagine my shock then, when, by a stroke of luck and accident, I got a \"baseline\" breast MRI at said cancer center, and an atypical mass of more than 2 cm was identified and biposied as malignant. I was entering surgery a Stage 2 when I had had about 4 mammograms at said cancer center in the last 3 yrs, none of which showed anything (the 4th taken just before surgery, confirming that according to mammography, \"nothing\" was there but the biposy, ultrasound, and MRI disagreed).  Mammographically \"occult\" is what I was told I was. When I  asked the radioligist why, if I my breasts were dense, no one ever told me to use another screening modality, she told me I actually wasn't \"that\" dense, i.e. rated 4 dense, but rather  I was merely a 3 on scale of 4 (1-fat 2- fibroglandular or something, and 3 - hetergenous, 4 - dense). Okay, everyone, I'm here to tell you thaf ic you are rated 3, like I was, you are dense enough for 2.2 cm not to show.  When I then asked the BS why the medical community urges mammograms/clinical exams and meanwhile I wasn't the first she's seen for whom there's a large mass not palpable, and not visible on the mammogram. She replied that there is such a substantail number of women who do not get mammograms, for whom mammograms would be effective.  My personal opinion is that the medical establishment for lack of a better word does not want to undermine their own massive public health campaign to get more women in for mammograms. I don't see why honestly informing women with dense breasts about the need for additional screening tools would undermine: why it can't be more informed. I wish it were for me, and I'm certainly doing my bit to inform my friends, family, etc.",
      "MessageIndex": 11,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765195",
      "Title": "mammos cannot see through dense breast Towny FireKracker"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Mar 11, 2015 11:43AM jessica749 wrote: scvmom65 --- no one can go down to 0% risk~~~!!!! We are human after all. eVeryone, including the most healthy, least susceptible (whatever that is) has SOME risk. I once asked my onc \"when does…when does…when does…\" and given the context of the conversation at the time, my MO completed my thought: \"When does the risk go down to that of a normal, never-had breast cancer woman? After 20 years.\" said MO. ",
      "MessageIndex": 60,
      "PostDate": "11/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/825836",
      "Title": "Stage 1-recurrance percentage % risk? DXat32 Ygammyyet"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Apr 2, 2014 07:18PM jessica749 wrote: none. no symptoms.",
      "MessageIndex": 32,
      "PostDate": "02/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/819541",
      "Title": "Did you have any symptoms prior to being diagnosed? Footballnut Footballnut"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Nov 4, 2014 09:28PM jessica749 wrote: My onc never gave me a stat but rather a range, and then demanded that I never 'quote\" that for attribution. ;o) So, I took from it all that stats can come back and bite you in the proverbial ….. that they are really not reliable, and not so relevant really. So my odds are 8%, or 18%, or in that range, before or after tamoxifen,  I never got it straight. And it doesn't really matter. It will come back, or it won't. And my onc has no idea if it will or not.  I know that makes no sense if you're not in the head for it, but I am. It will or it won't, and if it does, who knows when, and if it doesn't , I won't really know until it just keeps on not, so there's no choice but to let the worry - with time - go from front burner to back burner and try and appreciate and live life to its fullest, with fingers crossed that bc and every other potential calamity stays at bay. So banal, I know. But true. Good luck arriving there.",
      "MessageIndex": 23,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/825836",
      "Title": "Stage 1-recurrance percentage % risk? DXat32 Ygammyyet"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Mar 8, 2015 02:52PM jessica749 wrote: To be clear: My understanding is that hormonal + bc is LESS likely to come back after you pass the 5 year mark…(in other words, more women who get recurrences get them w/i the first 5 yrs not later) HOWEVER er+ bc is MORE likely to recur after 5 yrs THAN triple neg is…that said, my MO was pretty clear to me that each year, your odds of recurrence go down, period. Even if they remain higher with ER+ than with other cancers, they still go down each year…. Contrary statistic to cite for me to look at - would like to if so.",
      "MessageIndex": 57,
      "PostDate": "08/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/825836",
      "Title": "Stage 1-recurrance percentage % risk? DXat32 Ygammyyet"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Mar 28, 2014 12:18PM jessica749 wrote: Ugh, so awful to read this stuff and draw conclusions from internet and others, when really it is your oncologist who knows better and can explain.  I can't tell you how often I freak myself out about various things I think, imagine, read, hear, conclude. Then my MO just shoots it down, very common sense-ly.  Or explains it in a context I didn't know, which makes the information much more palatable. So, perhaps your MO didn't mention it because it doesn't mean very much right now outside of the oncotype--maybe the oncotype info will trump whatever the ki67 is. I assume you will have Onc. test results soon, and will then be having a conversation with your MO.  So there's no point in your MO going there right now.  Good luck with your Oncotype, I remember the wait being a very stressful time. Soon will end….",
      "MessageIndex": 1,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/819608",
      "Title": "Waiting for OncoType LovebeingNana noonrider"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Mar 27, 2014 12:34PM jessica749 wrote: Ugh, hate that \"work like a team\" line.  On the other hand, I understand and respect why they play it the way they do: discouraging switching in order to facilitate collegial relations among professionals, not competitive \"eat what you kill' ones like some law firms…Perhaps that's a bad analogy, but you get my point.  You wrote this a while ago, wonder if you got any satisfaction. ",
      "MessageIndex": 9,
      "PostDate": "27/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/817774",
      "Title": "How can I switch my oncologist within MSKCC? LelaMiller sophie786"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jun 16, 2014 03:44AM jessica749 wrote: No single test is perfect 100% in its prediction or certainty. Every decision and factor is an odds game. All you can do is weigh them in your case - get a lot of info as you and MO are, and mak a most informed decision.  It's hard.  ",
      "MessageIndex": 15,
      "PostDate": "16/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/814504",
      "Title": "Mammaprint and Oncotype Dx FairyDogMother voraciousreader"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Nov 24, 2013 01:43AM jessica749 wrote: Hi again. Sorry your radiologist made you feel like you asked a 'stupid' question. I don't like that. I'm sure I've asked a lot of stupid questions in my life, but a doctor should simply answer them or explain to you if they think you're way off. I would have said, you might ask your radiologist for bs recommendations because yes, absolutely, I agree with you and juneping - I think you should remove it no matter what the FNA says. FNA is a very small sample of the whole thing.",
      "MessageIndex": 11,
      "PostDate": "24/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814907",
      "Title": "I'm so angry; I did not ask my radiologist the right questions. GraceBer barbe1958"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Nov 26, 2014 03:18AM jessica749 wrote: Who told you that you were 'behind' in starting on chemo?",
      "MessageIndex": 3,
      "PostDate": "26/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826354",
      "Title": "HELP! NEED MO IN NYC ASAP Rosettastone jessica749"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Oct 13, 2013 01:44AM jessica749 wrote: School Counselor: I am with you all the way. You are so lucky to have oncologists (double opinion in agreement) who GET that (1) oncotype is not the be all and end all and (2) particularly given your age, and as you add, your race, certain stats don't apply, and others do. I too was not 'afraid' of chemo. I was / am AFRAID of cancer killing me prematurely. Luckily, the oncotype didn't figure in my case either and we (onc and me) could just do what would have been done pre oncotype. As you know, whatever the oncotype says, it's just odds also. It's not a guarantee. And, it's only a 10 year warranty/ horizon. Many E+ return past ten years! At 44, I know you're not ready to pack it in at age 55. I too did everything I could medically to treat my disease at Sloan at the time. This included CMF therapy. I think because my IDC was less than 1 cm and E+, Sloan would give me nothing else chemo-wise. Because I had a double mast there was no radiation. I wasn't afraid of radiation either- I got the bmx because I was high risk and just couldn't deal with any more unreliable mammograms. Good luck to you!!!!!",
      "MessageIndex": 522,
      "PostDate": "13/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Mar 7, 2013 07:33PM jessica749 wrote: Hi, I don't know where you live, and what options insurance/finances provide, but I would want to make sure that my team diagnosing / doing the surgery were all specialists in breast cancer, vs general surgeons, general pathologists etc.  I would want to be fully comfortable in the skills/qualifications of the initial diagnosis, and the surgeon.  If you are, then fine, I'd wait until the FINAL pathology ie post surgery to get a second opinion re course of treatment.  Get a second read on the bc once it's all out.",
      "MessageIndex": 6,
      "PostDate": "07/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/801522",
      "Title": "When should we get a second opinion? JohnLeo InspiredbyDolce"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Apr 6, 2014 06:58PM jessica749 wrote: The doctor recommending this…is the doctor at a NCI ranked comprehensive cancer center? see link www.cancer.gov/researchandfund...… I've not really heard of giving someone who is 88 chemo…I would think there'd be many things to consider, such as the effects of the treatment weighed against its benefits at that age. I mean, what are the stats on recurrence without chemo, vs with chemo? How aggressive is cancer at that age? Cells are just growing slowly aren't they, even if it's a cancer that might be aggressive in a younger person….I don't know these are just my random thoughts.  I would definitely get a couple of opinions of HIGHLY RANKED/EXPERIENCED people.  They could lay out the pros and cons based on current data and help you make the right decision",
      "MessageIndex": 3,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819931",
      "Title": "Whether to chemo or not ChristineHS Pessa"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Feb 1, 2013 08:52PM - edited Feb 1, 2013 08:55PM by jessica749 Brejim I was once you, sort of.  Only I was so shockingly ostrich/head in the sand, I wasn't anywhere near a website like this, let alone posting on it. So having had ADH, and having later (5 yrs or so, later) developed IDC, here's my \"been there, done that\" rap for you: Ask your doctor if the ADH is all removed. Ask if and by how much your odds are of having it recur, and/or in the other breast. Ask by how much more your risk of breast cancer, in the ADH breast, or the contralateral breast, is increased. Ask how, now that you are at elevated risk by virtue of your ADH, you will monitored in the future, given that you are 51 and mammograms are known to be, in the best of hands at the most advanced #1 rated cancer centers, to be only \"at best\" 80-85% accurate (as per Larry Norton MSKCC public lecture 2 yrs ago-probably available on their website still). If they tell you that your breast density rating is only 3, not the highest 4, and therefore mammograms will pick it up, tell them no, that's not true; you know someone whose breast denisty was rated 3, and who had mammograms at MSKCC, and the 2 plus cm abnormality biopsied as invasive cancer, easily visible on u/s and mri--was NOT visible at all on mammogram up until and through the days before surgery....(that someone would be me). If they suggest that you can take Tamoxifen to cut your risk of developing bc in half, ask them what happens if you are in the other half, ie. if you DO nonetheless develop bc while on the tamoxifen: will your bc be E-/more aggressive/ a bc untreatable by Tamoxifen? What are the ramifications of taking a drug prescribed for cancer when you don't have cancer???? I recall the surgeon cavalierly suggested that I could take tamoxifen after the ADH biopsy, and rattled off the side effects, which were frankly, to my 44 yr old non cancer patient ears, frightening.  Request that you sepak to a MO about it, frankly. I regret I didn't fully examine the question by someone more qualified to answer i.e an MO vs a (however highly qualified) breast surgeon. I also regret that, in ignorance, I didn't insist on greater surveillance, as I naively believed that mammograms were 98% effective as screening and the 1-2% error rate was a technician skill thing.  SO WRONG I was. I have no idea where that ignorance came from.  ",
      "MessageIndex": 13,
      "PostDate": "01/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799717",
      "Title": "Atypical Hyperplasia brejim brejim"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jan 2, 2013 08:45PM jessica749 wrote: Just want to add that while no institution run by humans can always be perfect, I can't imagine a better place I could have been at for treatment other than MSKCC. In fact, when I was going through my breast cancer treatment, every single person--beginning with the breast surgeon's office secretaries that you deal wtih on the phone to schedule initial appointments, to the person who is behind the desk when you walk off the elevator, to the people who lead you from the waiting room to the exam room, let alone the nurses, social workers, and yes, last but not least, doctors-- each has been S-U-P-E-R-L-A-T-I-V-E.  It actually brings tears to my eyes as I think of the unrelenting patience, kindness and benefit of their knowledge/experience/skill/ability given to me by these people, all during the worst times (more than one appointment!)  of my life....just phenomenal.   Anyway, sorry you had a bad experience.  I think the posting by the hospital patient rep is more indicative of their patient - service orientation than your experience would have otherwise led you to  believe.",
      "MessageIndex": 34,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729028",
      "Title": "Sloan-Kettering KATIEKAY Hortense"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Nov 23, 2013 01:56PM jessica749 wrote: Your radiologist will disappear from the picture instantly if the results are positive. You will in such a case consult with people who will be better able to answer your questions-breast surgeon, possibly oncologist. My radiologist had little to say - was trained I think to say little - called with the results (positive) and from there, surgeons oncologists etc have the knowledge and experience. They took the the time to answer Qs and had the experience to deal w those Qs. Your feelings of anxiety and desire to be fore \"armed\" with knowledge is understandable and, I think, a healthy way to deal. Kind of the way I deal. It's about anxiety and control, I think. Understand though that at this very early point there is very little to know so it's hard to get ahead of it. A little more time will answer your questions. Good luck.",
      "MessageIndex": 3,
      "PostDate": "23/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814907",
      "Title": "I'm so angry; I did not ask my radiologist the right questions. GraceBer barbe1958"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Aug 6, 2014 08:22PM jessica749 wrote: Any good surgeon will recommend single mastectomy over double if you don't have either of the BRCA. But perhaps you want to ask about the 'third gene' and any others yet to be discovered  :o)   www.nytimes.com/2014/08/07/hea...… I did bmx over single very aware as the mods said that it was my body and I needed to live with it, and in it, no one else, for the rest of what I hoped would be a long, long life.  It's true though, NO sensation in the fake breasts which is a big drawback.  Also, living with a certain chest tightness you get used to. My size is also smaller, not out of choice but PS said that's the way it was/would be.  But I am happy for the choice I made. I save money, time, and angst by not having any breasts to screen and biopsy.  I also reduced whatever the risk was of a local recurrence of X%- some said 5%, others said 10 %,  who knows, but now we do and it's basically down to 1%.  That was why I did it.  PS my happy end is that the 'healthy' side had DCIS which no one noticed from the ultrasound or the MRI or the mammogram.  ",
      "MessageIndex": 11,
      "PostDate": "06/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/823426",
      "Title": "Chance of recurrence if only single mastectomy? Bubu efeuer777"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Mar 24, 2015 08:28PM jessica749 wrote: A colleague recently asked me out of the blue, \"Could your bc recur ever?\" and i said, \"YES! It can!\" and she looked horrified. I reassured her odds were good it wouldn't, but hey, my odds were good I wouldn't get bc initially…. This is a scary story, but it is a very true story. http://www.latimes.com/opinion/op-ed/la-oe-becklun... ",
      "MessageIndex": 65,
      "PostDate": "24/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/825836",
      "Title": "Stage 1-recurrance percentage % risk? DXat32 Ygammyyet"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Sep 6, 2013 07:21PM jessica749 wrote: Correct me if I'm wrong but I thought the whole point of oncotype test is that the old fashioned pathology just doesn't cut it the same;  that our way of judging with trained pathologist eye is not as accurate a prognasticator as a biological, molecular analysis. And so, if that is true, you can't say from looking at any stage 1 cancer that it's not threatening enough to merit oncotype ds.  The whole point of the test is that which you thought looked like it was not aggressive could at a molecular level be so. And the opposite, an aggressive looking stage 1 cancer (grade \"3\") could earn a low score on the molecular analysis...",
      "MessageIndex": 12,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/808731",
      "Title": "anyone not get an oncotype test? kika2013 Cathymck"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jan 2, 2013 10:52PM jessica749 wrote: my post above was to tenaj but yea, exbrnxgrl, you make a great point.",
      "MessageIndex": 38,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729028",
      "Title": "Sloan-Kettering KATIEKAY Hortense"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Dec 15, 2013 02:52PM jessica749 wrote: It's often hard to get an appt quickly with a surgeon in NYC who has a good reputation. At least in my experience. I would imagine the two referenced above by others have a few weeks wait too. But you never know re cancellations etc so be eager and make that clear. PS I would skip Mt Sinai and Beth Israel. Freya at NYU is renowned, and there are plenty at Sloan where I went. Feel free to pm me for info too.",
      "MessageIndex": 4,
      "PostDate": "15/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/815644",
      "Title": "NYC Surgeons Recommendations jluv babs6287"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jul 15, 2014 11:40AM jessica749 wrote:  Sometimes nurses aren't so great/experienced/skilled what have you so they are incapable of veering from their superiors instructions ... Ask your MO about getting your vit D levels next time blood is drawn., and ask MO what they think generally about vit D and it's possible role I do not believe it is  standard to get vit aD levels taken but there is a school of thought/theory that it is helpful to have them in the sufficient range, at least.  You can read the mixed reviews/data about vit D on this breastcancer.org website.   (Latest: http://www.breastcancer.org/research-news/questionable-study-finds-no-vitamin-d-link I don't know where you go for treatment but I am surprised no one apprised you of SE. Very important to know as you really need to be in touch with them about it - I would ask MO about this (and since she was away let her know NO one spoke to you about this and you need that conversation!)",
      "MessageIndex": 8,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/822794",
      "Title": "Standard of Care? MomtoIrishQuads voraciousreader"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jul 15, 2014 01:04PM jessica749 wrote: Momtoirishquads I agree and understand re  mid range results and how the recommendation for chemo or not - based on oncotype testing - is unclear.  I see your profile/remember another post - I think you are younger than average,  grade 3 , this was a second time , P-, and your case is lobular.  Keep in mind while you crunch numbers and listen to others and read others experiences -  your distinct differences in terms of ILC/IDC, grade, age, your own personal history.  Oncotype dx testing is another tool.  In decision making, it should not, nor is it intended to, eliminate everything else. It is to help guide and another piece of info-arguably superior info - even the testmaker's own corporate website would probably tell you that. Also- I don't know the answer to this but maybe you want to ask your MO about the extent of validation testing that's been done re oncotype on lobular, vs ductal.  And if this is relevant.   (Also keep in mind that the reason oncotype test makers themselves say it is a tool because the test is in and of itself limited- albeit the best we have today. For example, what is the risk beyond 10 yrs particularly if you are diagnosed young?  Oncotype has not been studied that long and I think most studies are based on post menopausal median age 60 type thing...) I would also urge you not to base important treatment decisions for yourself on things like less-than-competent nurses.  If you are unhappy with treatment at this place, by all means, go elsewhere for additional opinion or even treatment but make it a superior second opinion place (nci - ccc).   Chemo sucks - no two ways about it.  But it ends.  And most get through it successfully. If indeed you are the mother of 4 young kids, you owe it to them to do everything best recommended for cure. Heck, even if you had no kids-of course you would owe it to yourself to do everything best recommended for a cure!  It's great you contacted your CA mo for a second opinion but you might want a third opinion and why not get one from MD Anderson if you are not too far from there. Pick someone with some YEARS of experience at a place like Anderson to counter your MO who sounds fine/good but young (and with poor nurses!)",
      "MessageIndex": 10,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/822794",
      "Title": "Standard of Care? MomtoIrishQuads voraciousreader"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Dec 21, 2013 10:12AM jessica749 wrote: Your insurance paid for a private room!!!???????????!!!!!!! Wow.",
      "MessageIndex": 6,
      "PostDate": "21/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/815644",
      "Title": "NYC Surgeons Recommendations jluv babs6287"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Apr 6, 2014 07:39PM jessica749 wrote: Just curious, and perhaps I'm ignorant-but why would say a radiation oncologist have an opinion on chemo? The hospital I go to is specialized, and doctors in various specialities wouldn't necessarily be in a position to pronounce on what treatment should be done by another specialist.  I.e. a radiation oncologist could only speak to radiation treatment, etc.  I personally would rather  go to two different breast cancer medical oncologists - ideally affiliated with different institutions(ie.. chance of differing philosophies/opinions) and get their opinion.",
      "MessageIndex": 6,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819931",
      "Title": "Whether to chemo or not ChristineHS Pessa"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jan 2, 2013 10:47PM jessica749 wrote: Were you trying to book a specific MO or just any MO for consult?  I cannot imagine it possible that not a single MO had an open appt available for two entire months. ",
      "MessageIndex": 37,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729028",
      "Title": "Sloan-Kettering KATIEKAY Hortense"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Nov 18, 2013 11:26PM jessica749 wrote: 48",
      "MessageIndex": 36,
      "PostDate": "18/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Jan 7, 2015 02:32AM jessica749 wrote: Wow, followed this thread just now to the end, see it was back in early Nov you posted….intrigued by the heading \"when they start being really nice…and rush the biopsy…\" Thank god they do that, both in your case and mine. When are you planning to have your surgery?",
      "MessageIndex": 39,
      "PostDate": "07/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825948",
      "Title": "When they start being so nice and rush the biopsy Ewt717 Hotrodmommy"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Apr 26, 2015 03:19AM jessica749 wrote: Hmmm, have to agree with you ann13820. A friend once indicated that I might now want to go to MSK because it could be a depressing or scary place. Her mother had bc, then had a recurrence years later, and both times avoided MSK. (live in NYC). I felt/feel the opposite. Like you ann, I urge you Janeway and others who are fortunate to live near top centers to take advantage of it by at least getting second opinions there -- if not your treatment. I don't work for MSK but frankly might sound like I do in the sense that I could rave about them: if you think they are scary, let me tell you, I don't think there is a place where receiving your breast cancer care could be more, well, caring, and comfortable. I often say thank you to Evelyn Lauder under my breath when I visit. It is a very nice, very welcoming, very comfortable center (the breast center--named after Lauder--a building exclusively devoted to the care of us). And it's not just a physical thing, it is the people, from the greeters in the lobby door to the ones at reception when you walk off the elevator. Everything, everything, is very patient friendly. They even book all your appts for you when dealing with scheduling your next stuff is overwhelming. You become spoiled, because you are left to fend for yourself in other places. There are so many resources to take advantage of there, or not if you choose not to. Okay. I just don't want you to be scared. Because it's as kind, comfortable, and welcoming a place through its breast center building on 2nd ave and E 66th st as any hospital where you receive treatment can be. I have always felt very fortunate to be able to receive treatment there.  Good luck with everything.",
      "MessageIndex": 9,
      "PostDate": "26/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830751",
      "Title": "Can doctors in NYC be recommended here? Janeway69 Fakeboobs123"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Apr 6, 2014 07:40PM jessica749 wrote: My post above was in response to VR suggesting a tumor board. ",
      "MessageIndex": 7,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819931",
      "Title": "Whether to chemo or not ChristineHS Pessa"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Aug 31, 2013 08:06PM jessica749 wrote: Hi MaddiesMama. Your daughter looks gorgeous in that photo!  LIsten, it is so easy to think the worst when you are at the point you are at now, and that is a terrifying point in the journey: where you are led to believe you have something that is cancer, but you know nothing more.   It is also terrifying if this has been in your family and/or your mother had an early death adn you are similarly aged/positioned with young child. Your fears are so understandable for any woman, let alone your particular history.  Please dismiss everyhting the tech said to you.  The tech knows nothiing with regard to diagnosing...projecting their own fears and dramas and those  of others onto you...why are people like that allowed to work in such a field? But the radiologist knows something, and if the radiologist wants it biopsied, it's something that should be  biopsied obviously. Different places operate differently, but I went somewhere where they didn't keep things secret from me only to relay info to my gynecologist who would break it to me. In fact, my gyno was completely out of the loop and good thing she was as she was useless entirely.  Entirely.  Never really returned to the gyno.  See someone else now. My breast screenings were always done at Sloan Kettering, and when there was a question about anything on a mammogram or an ultrasound, absolutely the radiologist came to me and told me and when I did have something 'suspicious', the radiologist did examine with an ultrasound, did comment rightly or wrongly to me about how it looked (something to the effect of questionable/not great/ needs to be biopsied and are you free for us to do this TODAY?????? which of course sent me into a panic that it was so bad looking she wanted me to stick around TODAY until someone was free to biopsy....) I want you to know that even though during this awful waiting period, when I thought my life would soon be over, it all turned out to not be half as bad as it appeared at the beginning. The imaging pre-surgery all turned out to be worse looking than the post surgery pathology.   Please take some reassurance in the fact that you had an ultrasound in December. It is so likely that nothing was there in December, so whatever you have has grown quickly in the interim and you will now take care of it. It is so unlikely that you would go from nothing to stage IV in such a short time. Please try and be calm. You will soon have answers you need. If worst suspicions are confirmed, you will take the steps you need to and, once you have your plan of action, you will be in a much better place than you are now.",
      "MessageIndex": 5,
      "PostDate": "31/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/810226",
      "Title": "Mass Confirmed, Waiting for Biopsy Results & Terrified MaddiesMama75 Beesie"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Dec 3, 2013 05:06PM jessica749 wrote: A huge undersold benefit of mastectomy( for most people) in my opinion is avoiding radiation. Not sure why surgeons don't point this out as a benefit. They still push for lumpectomy. Hmmmm…wonder why? I think it's seen as an 'advance' to remove less of the breast when the results are the same insofar as death from the disease. For some reason it's seen as an advance to remove less of the breast, when it's not like that with other kinds of surgery, especially on parts of the body we don't need. Seems there's lots of 'judgment' around the breast…! No one cares whether I take out my whole thyroid or just the growth on the thyroid. Surgeons don't push one way or the other, at least in my very limited experience they didn't. It was kind of up to you. Sort of like the breast thing was, only I felt TONS of judgment and opinion about that. While breast cancer deaths maybe the same btwn lump. and mast. candidates, I think there have been studies that show that if the left side of the chest is radiated, there is a higher risk of heart issues later?",
      "MessageIndex": 9,
      "PostDate": "03/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815288",
      "Title": "Confused about recurrence possibility Mayanne ruthbru"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Dec 3, 2013 07:34PM jessica749 wrote: BD I am with you! Beesie I know you can find the research better than I . The fear is rooted in fact, in science, it's not just irrational fear. It is what it is, and obviously the benefits from radiation in treating breast cancer far outweigh the risks …. Each individual has to weigh carefully what is important to them. I wish the decision was presented this way….I feel it's loaded in a push for lumpectomy unless your pre surgical imaging screams large area. I don't get it.",
      "MessageIndex": 12,
      "PostDate": "03/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815288",
      "Title": "Confused about recurrence possibility Mayanne ruthbru"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Dec 3, 2013 07:42PM jessica749 wrote: Special K I am with you too re the imaging problems and 'no faith' after diligent screenings… Timbuktu, I don't know those details re Elizabeth Edwards, however, it is possible that cancer was found to have spread into other areas of the breast after the lumpectomy, a new primary, or a recurrence in another part of the breast and size/location / previous radiation prevented them from doing a lumpectomy and radiating the same area again.? I don't think it has anything to do with one being better than the other, just that if you have a recurrence locally you can't , I don't' think, get radiation again-it must be a single mastectomy. This is why pretty much anyone who has a local recurrence or second primary after lumpectomy gets a single (or bi) mastectomy….And boy hindsight is 20/20 there! Definitely would have gone back in time and done it all mastectomy the first time.",
      "MessageIndex": 13,
      "PostDate": "03/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815288",
      "Title": "Confused about recurrence possibility Mayanne ruthbru"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Feb 7, 2013 07:41PM jessica749 wrote: It sounds like you are going to a good competent doctor/screening facility.  That you are in good hands.  They would be remiss if they failed to biopsy you pronto.  Not because it is likely, but because there is a possibility that must be ruled out.  Even a 5% possibility, 95% benign. I had a lump on my thyroid years ago. I was in my early 30s.  The internist said it was probably nothing.  \"Not to worry\". That most of the time - \"95% of the time\" he said, they were nothing, just something viral. But to see an endocrinologist. When I saw the endocrinologist a week later (on a Friday, I remember very well), he scheduled me for a biopsy on Monday morning. I was so worried that he was acting with a sense of slight urgency re diagnosing me.  I remember he told me to come in before the regular patients started, because he was so booked for the week, etc.  That night I had dinner with friends, one a surgeon's daughter. She told me, \"OH don't worry: if they were really worried, they would have biopsied you on the spot.\"  I thought: be he was really worried--his assistant had left early so he was on his own in the office and couldn't biopsy me on the spot, and he's having me come back first thing Monday morning before the rest of his patients arrive, squeezing me in ahead of everything.  She was trying to make me feel  better, but it actually made me feel worse, realizing even more his sense of urgency would have been to do it that afternoon had he not been alone in his office save for the secretaries at that point! Turns out it was all benign. But he was prudent, and he was one of the top endocrinologists in Manhattan.  I can infer a high medical professional standard of care from this, that if  there is a 5% chance-- a prudent, competent doctor isn't going to let that slide--a 5% malignant chance must be ruled out, sooner, not later. So think positive, and don't let the fact that they are checking you out as a priority over others make you think anything other than they are being prudent and know what they're doing. That you are being taken care of as you should be.   Will check back to see how you're doing, post an update.",
      "MessageIndex": 4,
      "PostDate": "07/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800131",
      "Title": "Suspicious morphology in US Mcol86 Mcol86"
    },
    {
      "AuthorID": "jessica749",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120546/profile",
      "Content": "Feb 11, 2013 03:22PM jessica749 wrote: justegan, very interested in hearing more of what you say re \"isolated tumor cells\". I had this too, in SNL, but understand that it is considered node \"negative\" vs micrometastasis, which is considered node \"positive\".   Many with so-called negative nodes, and hormone feuled cancers, choose to pass on chemo., particularly if they have had an Oncotype DX test which indicates they will not benefit from cemo (most less than 1 cm hormone cancers don't benefit from chemo, I understand).  So I'm interested to know how/what you were told is different.",
      "MessageIndex": 3,
      "PostDate": "11/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/800299",
      "Title": "What determines if chemo happens before or after surgery? PamelaKay gingit"
    }
  ]
}