{
  "AuthorID": "JessRN",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174344/profile",
  "Posts": [
    {
      "AuthorID": "JessRN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174344/profile",
      "Content": "JessRN wrote: Hi guys, so I'm new here. A little about myself. I'm 31, married for 12 years, 2 great kids. A career in nursing(neonates). And a few months ago I noticed some green discharge from both breasts. From my right breast in one duct blood began to come out. So I got an appt with my Ob/gyn who did a ton of labs and then sent me in for a mammo/ ultrasound. I was then referred to a breast surgeon who sent me in for a ductogram which I had yesterday. At first glance the radiologist said everything looked great but called me 2 hours later an apologized profusely and told me I have some suspicious areas and will most likely need surgery. Since yesterday I've now gotten blood out of my left breast. I'm terrified! Anyone else have a similar experience? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/802117",
      "Title": "Waiting and worried JessRN Moderators"
    },
    {
      "AuthorID": "JessRN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174344/profile",
      "Content": "JessRN wrote: Posted on: Mar 21, 2013 10:57 AM Joined: Mar 2013 Posts: 1 JessRN wrote: I'm new here. A little about myself. I'm 31, married for 12 years, 2 great kids. A career in nursing(neonates). And a few months ago I noticed some green discharge from both breasts. From my right breast in one duct blood began to come out. So I got an appt with my Ob/gyn who did a ton of labs and then sent me in for a mammo/ ultrasound. I was then referred to a breast surgeon who sent me in for a ductogram which I had a few days ago. At first glance the radiologist said everything looked great but called me 2 hours later an apologized profusely and told me I have some suspicious areas and will most likely need surgery. Since then I've now gotten blood out of my left breast.Im now scheduled for a ductogram on my left side. I'm terrified! Anyone else have a similar experience? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/802183",
      "Title": "Really scared! Need some advice JessRN JessRN"
    },
    {
      "AuthorID": "JessRN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174344/profile",
      "Content": "Mar 23, 2013 01:58AM JessRN wrote: Ladies thank you so much for your replies! I'm hoping it will all turn out ok. I appreciate you taking the time to give me advice, I'm so happy I found this place to get encouragement from such stong women. Thank you!",
      "MessageIndex": 4,
      "PostDate": "23/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/802183",
      "Title": "Really scared! Need some advice JessRN JessRN"
    }
  ]
}