{
  "AuthorID": "Jesstunnell…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261869/profile",
  "Posts": [
    {
      "AuthorID": "Jesstunnell…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261869/profile",
      "Content": "Nov 3, 2017 04:48PM Jesstunnell wrote: Just another update. I had already made a follow up appointment with my doctor for Monday morning. Well the ultrasound tech just called me and said the doctor who was also doing the ultrasound wanted me to know he referred me to a general surgeon so that they can see if the lump is something to be concerned about. I’ll find out when that appointment is on Monday.",
      "MessageIndex": 6,
      "PostDate": "03/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859612",
      "Title": "Hard lump between breast and collarbone. Jesstunnell Micheleb52"
    },
    {
      "AuthorID": "Jesstunnell…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261869/profile",
      "Content": "Nov 3, 2017 01:20PM Jesstunnell wrote: Hello all! I am back with an update! This past Tuesday I had an appointment with my doctor. She felt the lump immediately but her face did not give away anything. They didn't brush me off because of my age, thank goodness. She wrote down a few things and said she would send me for an ultrasound. I had my ultrasound this morning. The tech searched for maybe a minute, and then went to get the doctor. He came in and felt the lump with his fingers and searched a little longer on the screen. He said he didn't see anything worrisome on the ultrasound but he couldn't tell me what the lump was. He said to just monitor it and speak to my doctor if I grow more concerned. I guess I was making a strange face because he said \"I wish I could tell you something more definitive but I can't.\" Is it common for ultrasounds to miss something? I've already decided I'm going to request an MRI, I'm not okay with just NOT knowing what the lump is. Even if it's benign and absolutely NOTHING to worry about, I would still like to know. (By the way, the doctor wrote that it was a firm, oval mass about 1cm if that's relevant at all)",
      "MessageIndex": 5,
      "PostDate": "03/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859612",
      "Title": "Hard lump between breast and collarbone. Jesstunnell Micheleb52"
    },
    {
      "AuthorID": "Jesstunnell",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261869/profile",
      "Content": "Jesstunnell wrote: so last week I noticed a very hard lump at the top of my breast about 2.5 inches below my collarbone. It's so hard it feels like a bone. When I lay down, it gets softer but is still firm and I can definitely feel around it when laying down. It doesn't really move, maybe slightly. It's not on the other breast at all. I'm only 25 so not too worried about it, hoping it's just a cyst. I have an appointment with my doctor on the 31st to have it looked at. I don't want the run around or be told “Come back in six months and we'll keep an eye on it\" Whatever it is, I want to KNOW. So should I request an ultrasound to see if it's a cyst. And if it's not, should I request a mammogram? MRI? Biopsy? Has anyone had something similar in that area of the breast? What did it turn out to be? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859612",
      "Title": "Hard lump between breast and collarbone. Jesstunnell Micheleb52"
    },
    {
      "AuthorID": "Jesstunnell…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261869/profile",
      "Content": "Oct 23, 2017 05:37PM Jesstunnell wrote: I definitely will!",
      "MessageIndex": 3,
      "PostDate": "23/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859612",
      "Title": "Hard lump between breast and collarbone. Jesstunnell Micheleb52"
    }
  ]
}