{
  "AuthorID": "jessie123",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
  "Posts": [
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Mar 31, 2019 07:02PM jessie123 wrote: I also have it --- it's like a long hard sausage under my scar. My surgeon said it will go away. She also said to massage it. Isn't this fun !              ",
      "MessageIndex": 4,
      "PostDate": "31/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870644",
      "Title": "Firmness/Hardness in Lumpectomy Area 2.5 months post lumpectomy? kec1972 Volleyballmom2008"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Jan 19, 2019 06:15PM jessie123 wrote: I plan on having just one breast removed. I think that recovery will be easier for me. Plus I feel safer now since I've had cancer than before cancer -- because my exams will be much more thorough.",
      "MessageIndex": 9,
      "PostDate": "19/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869388",
      "Title": "Should I have gone for preventive 2nd breast mastectomy Vgmggroup claireinaz"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Apr 7, 2019 06:58AM jessie123 wrote: Well, it looks like everyone is having boosts with no real problems. I've read people with margins less than 2 mm have a greater chance of reoccurrence or metastasis later down the road. One of my margins was 1.1 mm so I think that is why he is concerned. The old standard used to be a 1mm margin and some facilities still use that standard, but many have gone to the 2 mm standard. I guess better safe than sorry on this one.",
      "MessageIndex": 7,
      "PostDate": "07/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870873",
      "Title": "Did you have Boost at end of radiation jessie123 dl1129"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "jessie123 wrote: I don't think my RO wants to give me the end boost treatments, but because I had a 1.1 mm margin on one side he may have to. I could feel his concern so I've been reading about the boost treatments to see why he was hesitant. Seems that the boost treatment increases the chance of short term and long term side effects. I'd hate to have a \"forever\" side effect. Do most people have the boost at the end of radiation? If you had it can you tell me why it was ordered. Also,how many people didn't have it Dx 11/2018, LCIS/ILC, Left, 2cm, Grade 2, 0/2 nodes, ER+/PR+, HER2- Surgery 2/21/2019 Lumpectomy: Left; Lymph node removal: Sentinel Radiation Therapy 4/15/2019 Whole-breast: Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870873",
      "Title": "Did you have Boost at end of radiation jessie123 dl1129"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Apr 6, 2019 07:03PM jessie123 wrote: Hi Beaverntx -- did your doctor think a prophylactic ovary removal would help keep the cancer from reoccurring? I was diagnosed with cysts in my ovaries 12 years ago -- it was checked two years in a row and since there was no change the doctor didn't worry about it. That was the last time I went to an OBGYN except for a quick pap 2 years ago that about killed me. I've been a widow since I was 53. I thought my ovaries were done producing estrogen.",
      "MessageIndex": 2,
      "PostDate": "06/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870873",
      "Title": "Did you have Boost at end of radiation jessie123 dl1129"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Mar 31, 2019 07:41PM jessie123 wrote: My surgeon ordered a bone scan prior to my surgery to check for metastasis, but also probably as a baseline. It may be helpful in the future for comparison.",
      "MessageIndex": 10,
      "PostDate": "31/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/870657",
      "Title": "Doctor wants CT/Bone scan before 1st oncologist/surgeon meeting? dadof3ohio kber"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Dec 7, 2018 11:54PM jessie123 wrote: Thanks to everyone for the good information. I don't know how people manage without this board. Vera -- that lower table really relieves my mind - I might be able to bend down onto it while holding onto the supports. Nanette -- that breast bone position worries me because sometimes mine is sore for no reason. I'll make sure I'm positioned correctly. Borogirl --- no, no, no to arms overhead. When I was in my 40's I ruptured a disc in my cervical spine and haven't been able to lift my arms over my head since then --- also hurt my right rotator cuff a couple years ago while trying to pull my mom up from the bed. The arm thing is a real concern. Mytic - I did ask the doctor for medicine and she gave me 5 valium -- I WILL take it. And now that I'm old and really don't care as much about pleasing people I will in a nice way ask the people to help me until I'm comfortable. I do really have to have this MRI because my cancer is Lobular which does not show up on MRI's -- so they need to do this. However, since they screwed up my first biopsy at another hospital it seems it would be best to do my second biopsy to confirm cancer before they put me through all this. I'm also having a bone scan before the biopsy --- guess the doctor really does think it's cancer. I can't believe this is happening --- still in shock.",
      "MessageIndex": 6,
      "PostDate": "07/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868736",
      "Title": "Breast MRI ??? jessie123 jessie123"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "jessie123 wrote: I was just diagnosed with Lobular via biopsy but the hospital messed up so I've gone to a different teaching hospital and all the tests will be repeated. One test I will have next week is a breast MRI. I am 70 yrs old with stiff sore joints. My question is \"how will I get on the table to lay on my stomach\" If I had to lay on my back there would be no problem --- but I can't get on my knees to lay on my stomach on a hard table. I had a ruptured cervical disc when I was in my 40's and haven't laid on my stomach since then. I just hope I'm not totally embarrassed because I can't even get on my stomach to lay down. Can you tell me how it has worked for you. Dx 11/2018, LCIS/ILC, Left, 2cm, Grade 2, 0/2 nodes, ER+/PR+, HER2- Surgery 2/21/2019 Lumpectomy: Left; Lymph node removal: Sentinel Radiation Therapy 4/15/2019 Whole-breast: Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868736",
      "Title": "Breast MRI ??? jessie123 jessie123"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Apr 17, 2019 05:42PM jessie123 wrote: Keywestfan --- I think your doctor told you that women 70 and older don't need rads after lumpectomy because that is the new standard for early stage cancer in the 70 and over group. However, there are some factors that warrant the rad's --- one being close margins. One of my margins was 1mm -- my RO said that although I am 70 and I have a \"good\" cancer the margin issue requires radiation. Bad luck. I started this week and the radiation is very easy -- I just hate going every day for 3 weeks. There are no giant machines that confine you and it's not loud.",
      "MessageIndex": 6,
      "PostDate": "17/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871048",
      "Title": "Radiation at 85 keywestfan keywestfan"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Mar 27, 2019 05:07PM jessie123 wrote: Everetta --- A friend of mine had a 2cm - node negative tumor that was Er positive and Pr negative. She got a second opinion at M.D. Anderson in Houston. They recommended Chemo. I don't know how aggressive her tumor was. Do you know if yours is aggressive? I doubt you have to rush into the decision. I took months just to decide between a lumpectomy and mastectomy. If I were you I would do a lot of online research on Pr negative Breast cancer and also maybe get a second opinion. I don't understand why these breast cancer doctors make us make all the life and death decisions. The decisions are almost more stressful than the treatments.",
      "MessageIndex": 11,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/870368",
      "Title": "chemotherapy with a stage 1a lobular breast cencer. everetta everetta"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Jan 19, 2019 03:03PM jessie123 wrote: I know how you feel --- a couple of months ago when I was diagnosed I thought that I wanted a BMX. Then later I thought for sure that I wanted a lumpectomy because some one said to start small and move up if you need to. Then after my MRI they found 7 cm of DCIS in the breast with the cancer. They didn't know about the DCIS until the MRI. The Oncologist is afraid with a lumpectomy they would have to take out too much tissue and may not get clean margins --- but it's my choice. So now do I do a BMX or just one breast. BMX means a 95% chance of no reoccurrence. However, the surgery is longer and I think will be more difficult to recuperate from. Now I'm beginning to want my last healthy breast to stay with me. AM I ever going to get used to seeing myself without a breast. There are too many decisions and it's almost cruel to make us make the decisions -- because the doctors can make no guarantees. I just keep thinking --- if it's safe go small and work up as needed. Good luck",
      "MessageIndex": 4,
      "PostDate": "19/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869438",
      "Title": "HELP! I don't know what to choose! Jgargasz27 Jgargasz27"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Dec 1, 2018 08:11PM jessie123 wrote: I was just diagnosed last week and I've told all my friends -- I think my friends would feel hurt if I didn't share this with them. I even told the brick layer -- but it was because I had to put a hold on his work -- turns out his mom had breast cancer and has called me to answer any questions I have",
      "MessageIndex": 15,
      "PostDate": "01/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868555",
      "Title": "Who do I tell? Suzyshacklechick AliceBastable"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "jessie123 wrote: I think that I have the best surgeon in my city -- she has a wonderful reputation. However, my diagnosis has been difficult. One hospital diagnosed lobular then the second hospital diagnosed \"carcinoma with lobular features\" When I asked my surgeons nurse what that was she explained that it is mixed ductal and lobular and is treated like ductal. Since then I have done a great deal of research on mixed carcinoma -- another name for it is IDC-L. Anyway when I talk to my surgeon about the pathology report she insists it means my cancer is Lobular. Today I called the pathologist who diagnosed my cancer and he also said it is mostly IDC with some lobular mixed in. My surgeon has been practicing for years and years. She is published on Pub-Med. She works at a teaching/medical school hospital. MY QUESTION --- Do I need to worry that my surgeon doesn't know what kind of cancer I have? Do surgeons need to know? Maybe it doesn't make any difference . I started with a surgeon rather than an Oncologist -- is that normal or do most people start with an Oncologist? I really am concerned about this, but maybe I really shouldn't worry about it. Dx 11/2018, LCIS/ILC, Left, 2cm, Grade 2, 0/2 nodes, ER+/PR+, HER2- Surgery 2/21/2019 Lumpectomy: Left; Lymph node removal: Sentinel Radiation Therapy 4/15/2019 Whole-breast: Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869706",
      "Title": "surgeons knowledge of your type of cancer? jessie123 AliceBastable"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Dec 2, 2018 05:09PM jessie123 wrote: I can't talk about the cancer treatment because I too am newly diagnosed. However, I can emphasize with you about being a widow living alone. I luckily do have many friends, but they are not going to be here at my house. I would just feel better to have someone living with me. As far a medicare goes --- if it was me (and you're already used to paying a premium) I think I would buy a good old fashioned medicare supplement instead of one of the new advantage plans where you give up your medicare and everything is through the HMO. I was at a large medical group a month ago and saw a sign that they will no longer accept Humana effective 2019. That's scary. No regular doctors office is going to not take medicare Just do a lot of research before you decide --- and don't get pulled into the 'free exercise groups the HMO's offer. . Blue Cross has a medicare suppliment and there are many more. The medicare website will list them.",
      "MessageIndex": 4,
      "PostDate": "02/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868662",
      "Title": "Newbie with Bone Mets and Alone meg8000 meg8000"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Jan 15, 2019 07:22PM jessie123 wrote: I can feel my tumor -- before biopsy it was really hard to find - needle core ultrasound measured 1.3 cm. After biopsy it was really easy to find. I mentioned this to the surgeon and she said that it's because the tumor is swollen from the biopsy trauma. I just had my MRI which is a month after the biopsy. The swelling has gone down so I'll be curious what size it measured. Will let you know.",
      "MessageIndex": 5,
      "PostDate": "15/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/869080",
      "Title": "Size difference in tumor between ultrasound and MRI... kec1972 mammalou"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Feb 11, 2019 06:25PM jessie123 wrote: You probably already know this - but in a nutshell -- Medicare part A pays the hospital -- however there is a deductible per inpatient visit (don't know how much it is this year) Medicare part B pays the doctors at 80% - you pay 20%. A straight medicare supplement policy to help with medicare coinsurance and deductibles is over a $100.00 a month -- probably closer to $170 monthly. The medicare website has a list of coverage options for these supplements. Blue Cross used to be a popular one. Then the advantage plans began -- they are worrisome to me, but I know a lot of people who have them --- When my parents were living with me at the end of their lives I dropped their medicare supplements because we were spending more a year on the supplement than we were saving on medical care. Example - took mom to doctor -- charge $100.00 -- free medicare payed $80.00 -- the supplement payed $20.00. The supplement Insurance that month was $160.00. I got caught one time when she was hospitalized for a broken hip. Had to pay the hospital $1,500 deductible. When my mom went on hospice she kept them for almost 7 years because Medicare doesn't have the staff to watch medical stuff --- a patient is not supposed to be on hospice longer than 6 months. So it worked for me - although was taking a little chance. The very best people to talk to you about insurance are the people who file insurance claims in the doctor's offices.",
      "MessageIndex": 13,
      "PostDate": "11/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869761",
      "Title": "Medicare Supplement Plan: Recommendations for stage iv? DivineMrsM Zillsnot4me"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "jessie123 wrote: I finally had my surgery last Thursday after months of decision making. I had a lumpectomy and my surgeon was also going to take out two sentinel nodes ------ however, there is no incision under my arm. My 5 or 6 inch incision from the lumpectomy is on the far left side of my left breast. Do you think she went through the tumor incision to remove the nodes? I hope she didn't forget about my nodes -- Has anyone had a surgeon who removed nodes through the lumpectomy incision???? By the way -- this was just a wonderful surgery. I have had absolutely no pain --- haven't used the Norco she gave me or the tylenol I purchased. However, I do have one drain. Also, I still don't like anesthesia or getting up at 4:30 in the morning for the 7:30 surgery Other than that I have no complaints. Dx 11/2018, LCIS/ILC, Left, 2cm, Grade 2, 0/2 nodes, ER+/PR+, HER2- Surgery 2/21/2019 Lumpectomy: Left; Lymph node removal: Sentinel Radiation Therapy 4/15/2019 Whole-breast: Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870027",
      "Title": "incision for sentinel node removal? jessie123 leftduetostupidmods"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Apr 20, 2019 06:50PM jessie123 wrote: My lumpectomy was large and I had no pain in my arm or incision when I got home. However, I did have one drain which I did not expect. It was taken out in a week, but there was no guarantee of that --- I would not want to go to work with a drain.",
      "MessageIndex": 3,
      "PostDate": "20/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/871004",
      "Title": "Questions after surgery. Sattaylor AliceBastable"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Apr 17, 2019 02:29AM jessie123 wrote: Motheroftwo --- I just noticed that you are in Mobile --- I recently had to make the same horrible decision and finally decided on lumpectomy -- had it done 2/21. Where are you being treated? I started at providence, but got angry with them so switched to Mitchell Center -- My Oncologist and surgeon are at Mitchell, but I'm using Mobile Infirmary for radiation.",
      "MessageIndex": 16,
      "PostDate": "17/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870141",
      "Title": "Double or Single Mastectomy Motheroftwo36 HopeBry"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Mar 3, 2019 09:50PM jessie123 wrote: I agree with Runrcrb -- It took me almost 4 months to make the decision --- However, my cancer was slow growing. I thought at first that I wanted a BMX -- then I changed it to just one breast. Then someone said to start small and go big if you have to and that is what I ended up doing. A lumpectomy has the same long term results as a mastectomy as far as metastasis goes. Even though my breast may be a little deformed I'm still glad I did the lumpectomy. Please do get a second opinion regarding surgery. The MRI will tell you much more and probably will help with your decision making. A friend of mine did get a single MX when she was 41 --- she is 71 now and fine.",
      "MessageIndex": 9,
      "PostDate": "03/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870141",
      "Title": "Double or Single Mastectomy Motheroftwo36 HopeBry"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Apr 17, 2019 02:55AM jessie123 wrote: A friend in my neighborhood used providence and was happy with them. She also had DCIS. I was told to always get a second opinion on the pathology since that helps determine your treatment. Mine was sent off to a breast pathology specialist after surgery. It did agree with the Women and Childrens hospital path report. You might want to tell Providence to do that. Then when you know for sure what you have you can get treatment recommendations elsewhere. I'm just exhausted by all the doctor visits and testing.",
      "MessageIndex": 19,
      "PostDate": "17/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870141",
      "Title": "Double or Single Mastectomy Motheroftwo36 HopeBry"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Dec 15, 2018 02:52PM - edited Dec 15, 2018 02:55PM by jessie123 key 1972 That's pretty much what my report said. Then a pathologist half did the test and came up with Lobular carcinoma --- Lobular does not normally show up on Mammograms -- mine did not. Also it normally does not present with a lump. However, I also felt a lump on my upper outer left breast so had the ultrasound. Had a second core biopsy at another hospital yesterday and am waiting on results as you are. I am still praying for benign, but not as likely for me since I am past menopause. My internist told me to get a second opinion from a different pathology group no matter what the finding are -- both if positive or negative. Good luck!!",
      "MessageIndex": 10,
      "PostDate": "15/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/868826",
      "Title": "Anyone have a benign BIRADS 5 rated mammo? kec1972 TB90"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "May 14, 2019 12:42PM jessie123 wrote: Purple -- I also just finished the hypofractionated treatment and I'm not having bad SE's. I have just done the first boost out of four. I'm a week out from the whole breast part and still fine --- just kind of dark pink - no itching. Remember the hypo fractionated regime is a larger daily dose, but a total less dose --- so less radiation overall than the 6 week program. Also, I can't imagine having to go 6 weeks - I'm sick of it at 3 weeks. I have large breast and just put the aquaphor on at night before bedtime and didn't even do that until the 3rd week. I do get tired, but that comes and goes - it's not overly severe. Also, I am fair skinned so that doesn't seem to make a difference. Good luck.",
      "MessageIndex": 11,
      "PostDate": "14/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871454",
      "Title": "Did I make the right decision? purplejc5 cassiecanada"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Jan 13, 2019 09:40PM jessie123 wrote: I could be wrong, but I read somewhere that with a lumpectomy you do continue to have MRI's. It was one of the \"down factors\" when I was deciding which surgery to have. However, I finally decided on the less invasive lumpectomy even though I'll have to have the terrible MRI's. At least we will know we are completely cancer free in our breasts",
      "MessageIndex": 2,
      "PostDate": "13/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/866347",
      "Title": "Follow up protocol? Mama1416 Sara536"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "May 4, 2019 08:26PM jessie123 wrote: I gained 5 pounds when diagnosed and through all the testing and surgery. Then during radiation I lost the 5 pounds because it makes you lose your appetite. That 5 pound loss was after simulation. I have 6 more sessions. I wonder if the radiologist reads the films daily or if they can tell the simulation is off. Even if they don't consider 5 pounds too much how do they know that most of it didn't come off the breast? One more thing to worry about.",
      "MessageIndex": 11,
      "PostDate": "04/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/774202",
      "Title": "Radiation and Weight Loss mary7 gb2115"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Feb 25, 2019 02:16PM jessie123 wrote: What do you mean \"nodes light up\". Do they inject something into the armpit to find the nodes? Is that why my urine was blue or green for two days? Also my nipple had a ink mark on it but the incision wasn't anywhere near that mark. Do you have any idea what that could be? I see the doctor on Friday and have so many questions.",
      "MessageIndex": 10,
      "PostDate": "25/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870027",
      "Title": "incision for sentinel node removal? jessie123 leftduetostupidmods"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "jessie123 wrote: My lumpectomy (a month ago) was on the outer side of my left breast. I had a large section of breast removed. My scar is healing beautifully. About 4 days ago I noticed a section of my skin (far away from my incision) on the inner side of my left breast extending out about 4 inches from the nipple was or is inflamed. It's a medium color pink semi circle of inflamed skin. It blanches when I press it. There is no pain, fever, stinging etc. I'm to see the surgeon on Monday if it's not gone. Anyone had a similar experience? Might this be a delay (long delayed) reaction to the radioactive dye injected in that nipple? I searched and found someone with a similar situation posted something like this back in 2007 --- but she's no longer on the board. I wonder what this may be. Any ideas? Dx 11/2018, LCIS/ILC, Left, 2cm, Grade 2, 0/2 nodes, ER+/PR+, HER2- Surgery 2/21/2019 Lumpectomy: Left; Lymph node removal: Sentinel Radiation Therapy 4/15/2019 Whole-breast: Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870559",
      "Title": "infection a month after lumpectomy????? jessie123 morningdove"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Apr 2, 2019 06:38PM jessie123 wrote: Thanks Morningdove --- I saw the radiation oncologist on Friday and he wasn't worried about the redness --- same as your radiologist. Mine sounds like it's in the exact same place as yours -the inside of breast kind of on the lower inside, but not underneath --- my surgery was way to the left of my breast closer to the underarm area. I have no bumps or irritation -- just a very pretty pink color. My radiation setup is Thursday and hypo fractionated radiation starts Monday. Now I'm scared mine will also act up. Was your color just a soft pink semi circle or was it more inflamed. I think that it does sound like an allergic reaction to the dye because there is no reason only that area would turn red when our incisions are so far away. Why does this have to happen --- aren't we nervous enough already. Oh, by the way, I also have an anxiety disorder that started when I was about 21. I don't take medicine --- I just avoid a million things that cause me anxiety --- It's very inconvenient (-:",
      "MessageIndex": 6,
      "PostDate": "02/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870559",
      "Title": "infection a month after lumpectomy????? jessie123 morningdove"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Feb 25, 2019 11:31AM jessie123 wrote: Thanks everyone --- that makes me feel better. It seems I keep having more questions even after surgery. I've read of so many people having underarm pain which I was anticipating. I'm at the end of day 4 after surgery and I still feel a little tired --- like I don't want to do anything --- but I am older and also I was on such a high for 4 months before surgery --- it may just be that I'm finally beginning to relax.",
      "MessageIndex": 7,
      "PostDate": "25/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870027",
      "Title": "incision for sentinel node removal? jessie123 leftduetostupidmods"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Mar 29, 2019 08:41PM jessie123 wrote: Morningdove --- you are right - our symptoms are almost identical --- even our surgery date -- mine was Feb 21st. The nurse practitioner said they inject the blue dye on all 4 sides of the areola --- it is to light up the lymph nodes so the doctor can find them. My areola started changing colors off and on about 2 weeks after surgery. It would no longer be pink -- kind of a dark brown and the texture was different. The doctor told me that is normal. However, this pink rash like semi - circle is not normal. The radiation oncologist looked at it today and is not going to postpone radiation because of it. I am going to be very curious if the antibiotics take care of yours. Please let me know. My doctor was going to give me Cipro, but I wanted to wait. I also had a melt down at radiology today -- I really wanted to be able to use the prone board (lay on your stomach) because it is safer for the lungs. However, it hurt my thoracic spine for some reason so I've got to go the traditional route. I wouldn't let them do the set up because I had been there since 11:00 and it was then 4:00 -- had also seen the Oncologist ---- was exhausted. Too much waiting",
      "MessageIndex": 4,
      "PostDate": "29/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870559",
      "Title": "infection a month after lumpectomy????? jessie123 morningdove"
    },
    {
      "AuthorID": "jessie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282623/profile",
      "Content": "Mar 25, 2019 07:09PM jessie123 wrote: Just got back from the doctor -- she doesn't know what it is. It is not near my incision. Her nurse practitioner said that she has seen this before and she thinks it is a delayed reaction to the blue dye injection when I had the surgery. My gosh, my surgery was a month ago. I'm answering my own question in case someone searches in the future.",
      "MessageIndex": 2,
      "PostDate": "25/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870559",
      "Title": "infection a month after lumpectomy????? jessie123 morningdove"
    }
  ]
}