{
  "AuthorID": "jesscr05",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126001/profile",
  "Posts": [
    {
      "AuthorID": "jesscr05",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126001/profile",
      "Content": "jesscr05 wrote: I am 25 years old, have no family history of bc. I had a ultrasaound on a lump and it came back birads 4. But when the Radiologist was talking to me, he made it sound like birads 3, telling me that its probably benign fibroadenoma, and that some doctors would wait 6 months, but he has all of them biopsied. I am very scared!!!! I havn't ate or sleep in a week. It seems like it is kind of painful now too, I have been handeling it some. It is close to my nipple, close to the serface. What are the odds of birads 4 at my age? Are they in my favor? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766302",
      "Title": "Birads 4 ultrasound, biopsy today jesscr05 BioAdoptMom3"
    },
    {
      "AuthorID": "jesscr05",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126001/profile",
      "Content": "jesscr05 wrote: I am 25 years old, have no family history of BC and I am freaking out. I have never been this terrified before. My doctor found  a lump by my nipple about 3 weeks ago at my annual. It was hard, so she wanted me to go in for an ultrasound. So I went and it was horrible, The radiologist came in and said that he wants me to get it biopsied, he said that most doctors would have me come back in 6 months, but he always has them biopsied because even fibroadenomas grow. He said that their was like a duck head on it. Then he left and the lady who did the ultrasound said are you familiar with the birads scale your a birads 3. So I cried the whole way home, and immediatly looked up birads. I felt a little bit better about the birads 3. Then I had a appt a couple days later with my doctor and when I thought it couldn't get any worse it did, he put birads 4 in the report. He put oval, vascular, some sharp edges, but probably benign fibroadenoma. Then on top of that my doctor knew nothing about fibroadenoma, she just told me that birads4 was really bad. The more I looked up, the more I realized that I think that the odds are still in my favor. Just hoping there is some people out there with birads 4 reading and have had it come back benign. I have never been so scared in my life!!!! I'm supose to be getting married in August, but I can't even think about it. I can't eat, sleep or anything. I go in tomorrow for my biopsy. Thanks :( Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766271",
      "Title": "25 years old & very scared jesscr05 hrf"
    },
    {
      "AuthorID": "jesscr05",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126001/profile",
      "Content": "Mar 17, 2011 11:38AM - edited Mar 17, 2011 11:38AM by jesscr05 Thank you Kelly, you made me smile :)",
      "MessageIndex": 3,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766271",
      "Title": "25 years old & very scared jesscr05 hrf"
    },
    {
      "AuthorID": "jesscr05",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126001/profile",
      "Content": "Mar 17, 2011 11:39AM jesscr05 wrote: Thank you Makraz :)",
      "MessageIndex": 4,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766271",
      "Title": "25 years old & very scared jesscr05 hrf"
    }
  ]
}