{
  "AuthorID": "JesusLVS",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
  "Posts": [
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "Jun 16, 2015 12:55PM JesusLVS wrote: Hi-I'm kind of in the same boat. I'm 28. After a couple months of the let down/engorged feeling in one breast and an itchy nipple I went to dr. Who found a lump. Had ultrasound done. Just got results yesterday after waiting 10 days. Now waiting for a breast specific gamma imaging MRI. The ultrasound report is freaking me out. Last night was very emotional for me. This is not a fight I want to fight. But, if I do have to fight it, I hope I can fight half as well as these ladies have. This is a great place for support. Please keep us updated.",
      "MessageIndex": 1,
      "PostDate": "16/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832661",
      "Title": "Being sent for Diagnostic Mammogram and U/S SOOOO scared!!! RockMamaof2 crmnsuga1973"
    },
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "JesusLVS wrote: Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/832643",
      "Title": "Please look at my u/s results while I wait for MRI JesusLVS JesusLVS"
    },
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "Jun 8, 2015 02:47AM JesusLVS wrote: thank you for your reply. I've had the inflammation around my lungs before but it went away quickly. My RA is really really manageable, it was worse as a young child but I haven't been on meds for it since 13years old. So I just kind of have a hard time believing it's that. Maybe it is though and all will be good with some steroids:)",
      "MessageIndex": 6,
      "PostDate": "08/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/832423",
      "Title": "MY symptoms and concerns while I wait JesusLVS JesusLVS"
    },
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "JesusLVS wrote: I'm in my late 20s. Maybe 2 months ago my left breast was sore, kinda felt like it does when engorged and need to feed baby, but it doesn't look swollen. Then I was having let down feeling, no discharge. I haven't nursed in over a year. I waited to see if it went away after my period or if maybe I was pregnant. Nope. Persisted so I went to my gp because I also swore I started feeling a lump near my nipple. Gp ordered ultrasound. She told me it was going to be a 10 day wait for my insurance to approve it, the office called the very next day, not even 24 hours later with an appt for the following day! I credited this to good office staff but now my worrisome thinking is making me think dr pushed it faster because maybe she was concerned? So I went for ultrasound. The tech found a \"normal benign cyst, fluid filled\" and fibroadenoma. Then she went to the side of my nipple closest to my armpit, she said it was weird and dark and definitely inflamed. She said my milk duct system was being affected. This whole time I'm watching the screen, I didn't see tumors. Then she went to my armpit. She asked if I've been sick lately. NOPE. She measured a lymph node and said it was enlarged. I had no idea. She said she's only seen that kind of darkness in the ultrasound one other time but never followed up with the radiologist to ask what it ended up being. So now I wait. Hopefully this week. Now I'm going thru everything in my head. I have rheumatoid arthritis. Back in September I started having what I thought was another case of inflammation around my lungs. Put it off as possible pulled muscle. Went to rheumatologist in December, he couldn't hear pleurisy so he ordered a chest xray, but he said he was assuming it was just some inflammation in the joints that connect to my ribs and breast bone. I never went and got it done but the feeling is still there, only with deep breaths or when I lift my arms or roll side to side while sleeping. I'm not noticing any changes in breast skin, ultrasound tech said it just felt a little warm. I guess I'm just wondering if anyone else had these symptoms? I'm not going to say I'm scared or worried, I know Gods plans are much better than mine and He knows what He's doing. IF it is something, I will blessed to be able to pray for all you warriors and survivors. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/832423",
      "Title": "MY symptoms and concerns while I wait JesusLVS JesusLVS"
    },
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "Jun 24, 2015 09:49PM JesusLVS wrote: I sooooo appreciate your responses!!!",
      "MessageIndex": 11,
      "PostDate": "24/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/832423",
      "Title": "MY symptoms and concerns while I wait JesusLVS JesusLVS"
    },
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "Jun 8, 2015 06:05PM JesusLVS wrote: I'm still waiting for radiologist report. I don't feel well today. Maybe it's all in my head. I have been exhausted lately and also my chest just really aches. When I do my hair, when I lift my arms...anyone else have these symptoms??",
      "MessageIndex": 7,
      "PostDate": "08/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/832423",
      "Title": "MY symptoms and concerns while I wait JesusLVS JesusLVS"
    },
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "Jun 24, 2015 05:34PM JesusLVS wrote: hi ladies- very long story short, my ultrasound was abnormal. I am getting a diagnostic mammo and MRI on Monday. Can you tell me about your experiences with those? Is it standard protocol to have both of those ordered?",
      "MessageIndex": 8,
      "PostDate": "24/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/832423",
      "Title": "MY symptoms and concerns while I wait JesusLVS JesusLVS"
    },
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "Jun 25, 2015 07:40PM JesusLVS wrote: I picked up the ultrasound full report and films. It says there is hypoechoic heterogeneous tissue. So now of course I'm googling like crazy. Posterior acoustic attenuation noted. Ah all these big words",
      "MessageIndex": 13,
      "PostDate": "25/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/832423",
      "Title": "MY symptoms and concerns while I wait JesusLVS JesusLVS"
    },
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "Jun 29, 2015 02:48AM JesusLVS wrote: what was your diagnosis again crmnsuga? I think it's weird I had the ultrasound first and NO diagnosis but being sent for MRI. Maybe because I am only 27 and the lump was palpable. I don't know. I'm not nervous about the tests just want the results and to move forward with whatever the outcome is:) I hope you are doing well.",
      "MessageIndex": 2,
      "PostDate": "29/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/833011",
      "Title": "After abnormal ultrasound, MRI and diagnostic mammo tomorrow JesusLVS JesusLVS"
    },
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "Jun 29, 2015 10:37AM JesusLVS wrote: interesting. We are kind of in the same boat then, unfortunately!",
      "MessageIndex": 4,
      "PostDate": "29/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/833011",
      "Title": "After abnormal ultrasound, MRI and diagnostic mammo tomorrow JesusLVS JesusLVS"
    },
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "Jul 2, 2015 09:42AM JesusLVS wrote: got the results. Birads score 3. So I'm going to request a biopsy. It's a solid nodule and I just don't want it there",
      "MessageIndex": 7,
      "PostDate": "02/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/833011",
      "Title": "After abnormal ultrasound, MRI and diagnostic mammo tomorrow JesusLVS JesusLVS"
    },
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "JesusLVS wrote: it's been almost a month since my abnormal ultrasound. Finally tomorrow are my appts for further testing. I picked up my ultrasound report and of course I've been googling all the words ever since. My MRI is first, then mammo. I've never had either of these things and some of you gave me great advice to help understand what it will be like. Does anyone know if I will get an idea of results tomorrow? Any of you have anything similiar to me? Axillary lymph node measured at 1.4X1.2x.79cm. There is a cyst at the 3 o'clock position. 4oclock position contains heterogenous ill defined hypoechoic region with posterior acoustic attenuation noted. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/833011",
      "Title": "After abnormal ultrasound, MRI and diagnostic mammo tomorrow JesusLVS JesusLVS"
    },
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "Jun 30, 2015 07:54AM JesusLVS wrote: so I went for my MRI this morning. Went well, just weird and loud. Then my mammogram was supposed to happen..they came and said we have to do an ultrasound because of your age it's protocol and you don't need a mammogram. I've already had an abnormal ultrasound but I figured what the heck, more images might not be bad. So I do the ultrasound. Then they tell me I can leave. 10 mins later they call me and said the dr saw \"asymmetry\" on the MRI and wants me to come back for mammogram. All done now! Should know by Thursday they said. Just want to move forward and KNOW.",
      "MessageIndex": 5,
      "PostDate": "30/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/833011",
      "Title": "After abnormal ultrasound, MRI and diagnostic mammo tomorrow JesusLVS JesusLVS"
    },
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "Jun 25, 2015 02:19AM JesusLVS wrote: one more question: if by some crazy chance I have a tumor in my chest wall that was originated there but infiltrating my breast, would it be seen on either the diagnostic mammo or breast MRI? I've had what I thought was pulled muscle pain in my chest since September...I don't think that's normal. It's a tired feeling in the center of my chest a few inches above breast bone. The ultrasound report said what was found could be some kind of phlegblah blah(I think it was a fancy word for inflammation or mastitis) or infiltrating tumor. Soooo...that's why I ask.",
      "MessageIndex": 12,
      "PostDate": "25/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/832423",
      "Title": "MY symptoms and concerns while I wait JesusLVS JesusLVS"
    },
    {
      "AuthorID": "JesusLVS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216793/profile",
      "Content": "Jun 25, 2015 02:05AM JesusLVS wrote: I'm in a similiar situation. Had an abnormal ultrasound, NO birads score, and now I am scheduled for a MRI and diagnostic mammo on Monday. I think it's so odd! The radiologist is the one that recommended the MRI for me, it says so on the report. Weird. I guess I will know soon!",
      "MessageIndex": 6,
      "PostDate": "25/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832887",
      "Title": "Question Lula480 I_Spy"
    }
  ]
}