{
  "AuthorID": "jetnet91",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194510/profile",
  "Posts": [
    {
      "AuthorID": "jetnet91",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194510/profile",
      "Content": "Jan 13, 2014 10:37PM jetnet91 wrote: I would love to join all of you as I will be getting the same treatment starting Jan 21.  I am in Ontario also",
      "MessageIndex": 26,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/816598",
      "Title": "Ladies in your 30's getting FEC-D protocol? calmandstrong robsp"
    },
    {
      "AuthorID": "jetnet91",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194510/profile",
      "Content": "Jan 19, 2014 02:29PM jetnet91 wrote: Gonein40, I feel the same way- the unknown is hard- I start on Tuesday, and my second chemo is the same day as your first- I'll be thinking of you.  When I feel anxious, I find it helpful to talk to my husband, to friends, to pray, and there have been times I have had trouble sleeping during this cancer thing.  I have found it best if I wake up and can't go back to sleep to actually get up and read a good book or check my email/facebook for 10 or 15 minutes- then I find I can go back to sleep.  If I just lay there I keep getting upset.  This week I have been doing a lot of preparing- cleaning the house, getting bills caught up, and this has kept my mind off the anxiety.  I feel almost like I am \"nesting\" like I would do if I was expecting a baby! I have also thought of trying music to see if this will help nerves, but I have not tried it yet.  My husband and I are going out to dinner tonight before I get my PICC line put in tomorrow. Calmandstrong, I'd love to hear how you are doing if you feel well enough/inclined to post as you are one step ahead of me! Thanks for the friendship, all of you.",
      "MessageIndex": 32,
      "PostDate": "19/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/816598",
      "Title": "Ladies in your 30's getting FEC-D protocol? calmandstrong robsp"
    },
    {
      "AuthorID": "jetnet91",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194510/profile",
      "Content": "Jan 24, 2014 07:54AM jetnet91 wrote: Thanks for the encouragement.  I have been feeling pretty nauseous, especially the first day when I ate too much before the nausea hit.  Hopefully today will be better- it's day 4 for me.  When did the rest of you feel the nausea taper off?  I know now to take the extra meds as soon as I start feeling nauseous, and not wait at all.  Am finding it a challenge to drink enough.",
      "MessageIndex": 41,
      "PostDate": "24/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/816598",
      "Title": "Ladies in your 30's getting FEC-D protocol? calmandstrong robsp"
    },
    {
      "AuthorID": "jetnet91",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194510/profile",
      "Content": "Feb 16, 2014 07:22AM - edited Feb 16, 2014 08:31AM by jetnet91 Mommy13, sorry you had such a hard time with cycle 1!  I found my cycle 2 was better since I knew what to expect, I had more anti-nausea meds, and I always have them do the long version (45 min) of the third drug (Can't remember which one it is- the one that gave you a migraine.)  My hair started falling out on day 13, so I cut it really short, then shaved it.  But I must say some is growing and some is falling out when I rub my head- depends on the day.  I am waiting to see what will happen on day 13/14 of this, my 2nd cycle.  Seems inconsistent hair loss and I wonder if I could have kept most of it, starting with very thick hair...oh well, too late!  I am on day 6 of my 2nd cycle and still very chemo-fogged.  Hoping it will be better soon.   I hope your second cycle goes better!!!  Hang in there. additional note- just took a shower and my hair is definitely falling out...I guess it does not fall out by itself so much, but a little scrubbing makes it fall out.",
      "MessageIndex": 53,
      "PostDate": "16/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/816598",
      "Title": "Ladies in your 30's getting FEC-D protocol? calmandstrong robsp"
    },
    {
      "AuthorID": "jetnet91",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194510/profile",
      "Content": "Feb 13, 2014 03:11PM jetnet91 wrote: Quasi, So sorry you've had such a rough go of it.  I hope they can sort out all your symptoms and next time will be better.  Hang in there!",
      "MessageIndex": 51,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/816598",
      "Title": "Ladies in your 30's getting FEC-D protocol? calmandstrong robsp"
    },
    {
      "AuthorID": "jetnet91",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194510/profile",
      "Content": "Jan 29, 2014 02:09PM jetnet91 wrote: I am feeling better this week, but not 100%.  I don't have a great appetite and don't have my full energy level.  But I am glad to be over the nausea of the first 4 days!  Calmandstrong, I hope your 2nd cycle goes OK.  Did you lose your hair?  Was it upsetting?  I am planning to get a wig and also to go to a Look Good Feel Better workshop next week.  My youngest (almost 4) is not happy about my upcoming loss of hair.  I want to try to look as normal as possible for her.",
      "MessageIndex": 46,
      "PostDate": "29/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/816598",
      "Title": "Ladies in your 30's getting FEC-D protocol? calmandstrong robsp"
    },
    {
      "AuthorID": "jetnet91",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194510/profile",
      "Content": "Feb 10, 2014 04:22PM jetnet91 wrote: Gonein 40, I'll be thinking of you tomorrow when you get your 1st treatment and I go for my second.  Hope it goes OK.  My plan for tomorrow is to try to stay peaceful, drink lots of water, and eat blandish food.  My hair started falling out on day 13 so I had my hubbie give me a buzz cut.  Then I had him shave it last Thurs as I was getting a free wig from the cancer society.  Unfortunately, our car battery died so I had to reschedule for 2 weeks later.  So for now it's hats and looking like that beautiful woman on the Star Trek movie. Brioche78, did your D go OK? Calmand strong, did you find the 2nd cycle any easier? Mommy13, hope yours is going OK. Did I miss someone currently doing FEC-D?  If I did, hope yours is going OK too. Thinking of all of you.",
      "MessageIndex": 48,
      "PostDate": "10/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/816598",
      "Title": "Ladies in your 30's getting FEC-D protocol? calmandstrong robsp"
    },
    {
      "AuthorID": "jetnet91",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194510/profile",
      "Content": "Mar 8, 2014 01:23PM jetnet91 wrote: robsp, I just finished my third of 3 cycles of FEC this last Tuesday. Hope yours goes OK.",
      "MessageIndex": 61,
      "PostDate": "08/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/816598",
      "Title": "Ladies in your 30's getting FEC-D protocol? calmandstrong robsp"
    },
    {
      "AuthorID": "jetnet91",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194510/profile",
      "Content": "Mar 29, 2014 02:04PM jetnet91 wrote: calmandstrong, how did your Taxotere go?  I had my first one on March 25.  I found the ice-packs painful, but days 1+2 + part of 3 pretty good.  I do have bone pain and feel very tired now, but it is much better than the nausea with FEC.  I am giving myself nupogen injections (to increase white blood cell production) for 5 days- today will be day 4.  Wondering if the bone pain will ease after the injections are over.  Also my ears ache.  Anyone have that?  I am finding it easier with the Taxotere and I am glad to be over halfway through.  How is everyone doing?",
      "MessageIndex": 64,
      "PostDate": "29/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/816598",
      "Title": "Ladies in your 30's getting FEC-D protocol? calmandstrong robsp"
    }
  ]
}