{
  "AuthorID": "jewlls",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83272/profile",
  "Posts": [
    {
      "AuthorID": "jewlls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83272/profile",
      "Content": "Jun 9, 2009 12:20AM jewlls wrote: hi i am starting chemo end of month, still trying to get head round it , all happening so quick with me, diagnosed last month , had lumpectomy 2 weeks ago removed 1 node which showed traces, think im keeping kleenex in business with amount of tissues im going thru, see my oncologist on monday again and hes expecting me to have load of questions for him but my mind blank , hardest thing for me is coping not working and trying to keep up that im ok with it all, dont think its sunk in yet,im thankfull that my tumor has been removed but will i cope with chemo and radiotherapy i know i need to talk but cant bring myself to any ideas as to what i should be asking? i was 40 yesterday , u always think it wouldnever happen to you",
      "MessageIndex": 110,
      "PostDate": "09/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/734424",
      "Title": "Starting Chemo June 2009 zuzeee zuzeee"
    },
    {
      "AuthorID": "jewlls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83272/profile",
      "Content": "Jul 24, 2009 04:09PM jewlls wrote: hi all ive just had my first chemo on wed and all though it was not as bad as i thought im scared stiff about my hair falling out!! my wig is sitting in bottom of wardrobe and hats scarves etc all in but im so scared as im very self consious as it is and i think once it goes everyone willbe staring at me....i know this is paranoia but i guess untill it happens i cant say howi feel.....now its just they waiting ...i did try to get hair cut but got to hairdresser and totally frieked out crying shaking and ready for being sick , i went home in tears ...........",
      "MessageIndex": 2919,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jewlls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83272/profile",
      "Content": "Jun 25, 2009 02:56AM jewlls wrote: 1. Did you find your lump on your own or did a mammogram pick it up? I found it myself as was too young for mamogram 2. Please describe to me what exactly your lump felt like to you or your doctor. abt 2-3cm hard and moveable 3. Is there a family history? no im first n family to have BC",
      "MessageIndex": 25,
      "PostDate": "25/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/695857",
      "Title": "WHAT did YOUR lump FEEL like? gscott MomOfTeenGirl01"
    },
    {
      "AuthorID": "jewlls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83272/profile",
      "Content": "Jun 15, 2009 02:05AM jewlls wrote: twinmom77 I to have just been diagnosed 4 weeks ago i have had my lumpectomy and 1 node removed i thought i would just get radiotherapy but i see my OC again 2m to get my start date for chemo, i feel exact same as u i think im still in shock and denial, i dont want to lose my hair and i think this is whats hurting the most i know my tumour is gone but i too just want my life back to way it was. This site is my kinda saviour as everyone is friendly helpfull and here for you if you just need a chat , this site is helping me and im sure will help you too.",
      "MessageIndex": 3,
      "PostDate": "15/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/735856",
      "Title": "Terrified, angry, depressed Twinmom77 cancersister"
    },
    {
      "AuthorID": "jewlls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83272/profile",
      "Content": "Aug 14, 2009 06:30PM jewlls wrote: hi all well finally shaved head 2d and i feel totally drained and my mood is so low, i just feel like giving in right now, hopefully mood will change in morn. luv to all",
      "MessageIndex": 1017,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "jewlls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83272/profile",
      "Content": "Jul 27, 2009 06:05PM jewlls wrote: hi all kinda new here,had first chemo of 12 on wed and  im feeling very tired fedup,taste has gone and the arm they used for my chemo is sore, i feel as if i constatantly have the shakes:( still cant bring myself to lose hair........this is how im feeling    only after one!!!! will it ease up or worsen?",
      "MessageIndex": 660,
      "PostDate": "27/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "jewlls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83272/profile",
      "Content": "Aug 11, 2009 12:30PM jewlls wrote: well just been for my wbc check and ok for 2nd treatment 2m, hair coming out fast now got to stage where i need to shave its too upsetting to watch and very messy on a down note due to prob with pain in hand and probs trying to locate veins ive to have a Hickman line put in b4 3rd chemo:( just watched a vid of one being inserted and was scarey as will be awake. hope everyone is doin ok and no bad se luv to all xxx",
      "MessageIndex": 972,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "jewlls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83272/profile",
      "Content": "Aug 12, 2009 03:42PM jewlls wrote: well 2nd one down just 10 more to go got a smelly clay bandage put on arm after chemo for pain so to get hickman line fitted day b4 next round, really tired, good luck to all who have finished and to everyone who had chemo 2d hope all s well with minimal se luv to all",
      "MessageIndex": 995,
      "PostDate": "12/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "jewlls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83272/profile",
      "Content": "Aug 2, 2009 05:23PM jewlls wrote: hi all well im in day 11 after first chemo and god my bum is killing me lol thought of goin to loo makes my eyes water (now i know how a baby feels) as for the hot flushes i thought id share how i cope.......i purchased a chillow pillow from http://www.chillowpillow.co.uk/     it stays cool all night it was £25 and best money ever spent....as for hair its now coming out strand by strand coulnt bring myself to shave as yet so have had it cut short and wear a hat but will prob have to face clippers next week",
      "MessageIndex": 810,
      "PostDate": "02/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "jewlls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83272/profile",
      "Content": "Aug 23, 2009 07:58AM jewlls wrote: gillyone I was with wig specialist on friday and she has said its ok to use hairspray on all wigs even synthetic , she use some on mine and its fine my friend has been using it for months , saysshe cant function without it. hope this helps",
      "MessageIndex": 1100,
      "PostDate": "23/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "jewlls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83272/profile",
      "Content": "Aug 28, 2009 03:47AM jewlls wrote: p373 I am due to have a portput in on monday due to problems with hands and arm after chemo, my arm feels so tight and my hand balloons up and i have to constantly take pain killers, also i have probs with them finding veins, to say im scared getting it done is an understatement as i will be awake!!! love to all",
      "MessageIndex": 1165,
      "PostDate": "28/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    }
  ]
}