{
  "AuthorID": "jfelice",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166392/profile",
  "Posts": [
    {
      "AuthorID": "jfelice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166392/profile",
      "Content": "Feb 1, 2013 11:44PM jfelice wrote: thanks to everyone for their well wishes.  Joan had her re-do of the first lumpectomy yesterday.  It went well, as far as surgery goes.  She's doing well today, and not being a very good patient as I'm having a hard time keeping her resting.  It will be 5 business days until she gets the path results of the increased margins.  That will be a big day.  Then she has the follow up for post surgery to occur Feb 13th and the nature of that will be directly relating to the path report.  I will post next Wed. or Thurs. after the results. Our surgeon will call us with the result, which made us realize WHY didn't our first lump surgeon call us with the path results when he got them???  Instead of letting Joan wait until 11 days after the surgery for her in office visit to hear for the first time \"cancer\".  And she suffered so much with not being able to do anything at all for 2 weeks because it was the friday before xmas.  Well, what is done is done but dr.s shouldn't sit on adverse path reports.  But we have a better team now and we're looking forward. We'll keep you informed.",
      "MessageIndex": 30,
      "PostDate": "01/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799162",
      "Title": "Just Diagnosed now MRI finds a 2nd Lump jfelice Camillia"
    },
    {
      "AuthorID": "jfelice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166392/profile",
      "Content": "jfelice wrote: My wife Joan (sorry but she doesn't use the computer) was diagnosed with DCIS the Friday before Christmas.  Now an MRI breast scan found a 2nd lump.  Joan has a very serious question regarding the protocol for 2 lumps.  Here is a timeline: 2010 Mamogram found lump right breast 2010 core biopsy finds lump benign, no treatment 2012 (Sep) Mamogram finds lump, need 2nd view 2012 (Oct) Mamogram confirms lump, need ultrasound 2012 (Oct) Ultrasound confirms lump of 2010 has grown 50% in one direction 2012 (Nov) Meets with Surgeon (general surgeon) who directs Biopsy 2012 (Late Nov) Core Biopsy guided by Ultrasound 2012 (early Dec) Biopsy benign recommend lumpectomy but say she could have lumpectomy or not, she could elect to wait and see.  Joan & I decide for Lumpectomy 2012 (Dec 11) Lumpectomy 2012 (Dec 21) In surg. f/u Surgeon informs Path was DCIS recommends re-do lumpectomy to increase the margins as they are too thin (though clean) to be safe 2012 (Holidays) Horrible time as we go 2 weeks due to holidays and vacations before she can speak to a health professional, had some online consultation, youtube videos, national org counselors.  At this time Joan decides to get 2nd opinion with Vanderbilt a NCI Comprehensive Cancer Care Center. 2013 (jan 3) tt orig Lump. surg./ informs it is DCIS intermediate, was 6mm, cancel Jan 7th re-do with orig/surg 2013 (jan 9) meet with Vand. Breast Center surgeon, reconfirms diagnosis, but wants to do MRI because Joan has dense tissue.  Re-do of op sched Jan 31 2013 (jan 14) MRI of both breasts finds 2nd lump 4mm recommends core biopsy on Jan 23.  The good news is that MRI finds no lumps in left breast and no other smaller lumps in right breast. 2013 (jan 18) Vand. surg says if new lump is cancerous she needs to do a mastectomy because the protocol is that everything between the 2 lumps must be removed and that this is too much tissue (but at the time of the phone call she was not sure how far apart they trully were) and in that case a mastectomy would be better. Joan's Question: She wants to know if that truly is the protocol to remove the intervening tissue or can two lumpectomies be done? Joan is not doing well with this.  She feels very guilty because she cointinued Estradahl even after the warnings of the drug were out.  They started her on an anti-depressant (Lexipro).  If you can help us with some information that would be really great.  Thanks for being there. Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799162",
      "Title": "Just Diagnosed now MRI finds a 2nd Lump jfelice Camillia"
    },
    {
      "AuthorID": "jfelice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166392/profile",
      "Content": "jfelice wrote: My wife Joan (sorry but she doesn't use the computer) was diagnosed with DCIS the Friday before Christmas.  Now an MRI breast scan found a 2nd lump.  Joan has a very serious question regarding the protocol for 2 lumps.  Here is a timeline: 2010 Mamogram found lump right breast 2010 core biopsy finds lump benign, no treatment 2012 (Sep) Mamogram finds lump, need 2nd view 2012 (Oct) Mamogram confirms lump, need ultrasound 2012 (Oct) Ultrasound confirms lump of 2010 has grown 50% in one direction 2012 (Nov) Meets with Surgeon (general surgeon) who directs Biopsy 2012 (Late Nov) Core Biopsy guided by Ultrasound 2012 (early Dec) Biopsy benign recommend lumpectomy but say she could have lumpectomy or not, she could elect to wait and see.  Joan & I decide for Lumpectomy 2012 (Dec 11) Lumpectomy 2012 (Dec 21) In surg. f/u Surgeon informs Path was DCIS recommends re-do lumpectomy to increase the margins as they are too thin (though clean) to be safe 2012 (Holidays) Horrible time as we go 2 weeks due to holidays and vacations before she can speak to a health professional, had some online consultation, youtube videos, national org counselors.  At this time Joan decides to get 2nd opinion with Vanderbilt a NCI Comprehensive Cancer Care Center. 2013 (jan 3) tt orig Lump. surg./ informs it is DCIS intermediate, was 6mm, cancel Jan 7th re-do with orig/surg 2013 (jan 9) meet with Vand. Breast Center surgeon, reconfirms diagnosis, but wants to do MRI because Joan has dense tissue.  Re-do of op sched Jan 31 2013 (jan 14) MRI of both breasts finds 2nd lump 4mm recommends core biopsy on Jan 23.  The good news is that MRI finds no lumps in left breast and no other smaller lumps in right breast. 2013 (jan 18) Vand. surg says if new lump is cancerous she needs to do a mastectomy because the protocol is that everything between the 2 lumps must be removed and that this is too much tissue (but at the time of the phone call she was not sure how far apart they trully were) and in that case a mastectomy would be better. Joan's Question: She wants to know if that truly is the protocol to remove the intervening tissue or can two lumpectomies be done? Joan is not doing well with this.  She feels very guilty because she cointinued Estradahl even after the warnings of the drug were out.  They started her on an anti-depressant (Lexipro).  If you can help us with some information that would be really great.  Thanks for being there. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799162",
      "Title": "Just Diagnosed now MRI finds a 2nd Lump jfelice Camillia"
    },
    {
      "AuthorID": "jfelice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166392/profile",
      "Content": "Jan 28, 2013 10:53PM jfelice wrote: We're in the middle of it right now.  1st we got a call on the answering machine confirming the Thursday surgery (we were at another unrelated Dr. appt).  Joan called up to see if the pathology was in and got a nurse who at first said the report wasn't in and then during the conversation she said she found the path report BUT couldn't tell us without the surgeon's approval, because good or bad she needs approval.  So, we are awaiting the call back now.  But she says it will be tomorrow.  We don't know what the surgery will be, lumpectomy or mastectomy.  We both believe her surgeon (a woman) has always leaned more toward a mastectomy even before the 2nd lump was found, so we don't know yet. Joan says thank you so much for your concern and for writing and all.  She says she's scared-to-death.  And doesn't know what to do but she wants to do the right thing.",
      "MessageIndex": 23,
      "PostDate": "28/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799162",
      "Title": "Just Diagnosed now MRI finds a 2nd Lump jfelice Camillia"
    },
    {
      "AuthorID": "jfelice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166392/profile",
      "Content": "Feb 4, 2013 11:33AM jfelice wrote: An hour ago she got the call.  GOOD NEWS.  Everything is fine with the pathology.  For once our tears were for joy.  Thank you so much.  You have no idea what an important part this forum and thread have played in this process so far.  I will post here again some significant milestones for those friends who have subscribed to this thread.  But as we go forward with new questions of radiation, and of monitoring I will start a new thread or post in another sub-forum.  Love you.  Joan and Tom",
      "MessageIndex": 35,
      "PostDate": "04/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799162",
      "Title": "Just Diagnosed now MRI finds a 2nd Lump jfelice Camillia"
    },
    {
      "AuthorID": "jfelice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166392/profile",
      "Content": "Jan 21, 2013 02:43AM jfelice wrote: Thanks to you both.  Just to be clear, not looking for someone to tell us what to do, still trying to get the info.  Joan still wants to know if 2 lumpectomies can be done on the same breast, same time, without the intervening breast tissue (that between the 2 lumps) having to be removed. I searched \"two tumors\", \"two lumpectomies\" and didn't find her answer.  It might be there, I didn't find it.  She's not trying to find out if she should do a certain thing, but if that certain thing can be part of the treatment.  Thanks so much.",
      "MessageIndex": 3,
      "PostDate": "21/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799162",
      "Title": "Just Diagnosed now MRI finds a 2nd Lump jfelice Camillia"
    },
    {
      "AuthorID": "jfelice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166392/profile",
      "Content": "Jan 24, 2013 04:48AM jfelice wrote: Joan had her 2nd lump biopsy today.  They couldn't find it with the ultrasound so she had to go on the MRI.  The tech indicated the sampling went well, finally.  I don't know how official these stats are but when we asked pre-biopsy, what are the chances the 2nd lump would be benign, the bs said 75-80%, so we are looking at 1 in 4 chance it will be cancerous.  Not odds we're happy with but it could be worse.  Now we wait, again.  It is the worst part.  They used a very big (wide) needle so hopefully we won't get a false reading like the first time with the 1st lump.  (it was negative but turned out to be cancerous).  So we can trust it better if the news is good.... IF... hopefully. Living in a 2 lump world, it is so difficult because it ups the ante so much.  When she just had the 1 lump, it was intermediate DCIS stage 0 6mm.  They'd say stuff like, if you have to have cancer this is the one to have.  You're lucky, it's small it's early.  But then with the 2nd lump showing up and now they are talking mastectomy and before chemo was not discussed now it is being discussed.  Recurrence statistics go up.  It is almost as big a shock as the first shock.",
      "MessageIndex": 13,
      "PostDate": "24/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799162",
      "Title": "Just Diagnosed now MRI finds a 2nd Lump jfelice Camillia"
    },
    {
      "AuthorID": "jfelice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166392/profile",
      "Content": "Jan 21, 2013 05:10AM jfelice wrote: Thanks Annette and Jaycee, Joan found both references helpful and relevant.  She drew from the fact that it was only through a clinical study, for Jaycees mother, that they would have done separate lumpectomies would seem to indicate that the normal protocol is to do a mastectomy in the case of two malignant tumors.  And that is backed up by the livestrong link Annette provided that indicated it is usual to do a mastectomy for two malignant tumors in one breast but that you have the option for two lumpectomies for two tumors where one is malignant and one benign.  This is the type of info Joan finds helpful.  She thanks you as do I.  If anyone else has relevant references that would be great.  Thanks so much.",
      "MessageIndex": 6,
      "PostDate": "21/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799162",
      "Title": "Just Diagnosed now MRI finds a 2nd Lump jfelice Camillia"
    },
    {
      "AuthorID": "jfelice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166392/profile",
      "Content": "Jan 29, 2013 12:02AM jfelice wrote: Yay!!  About a half hour after the above post the surgeon called.  Good news, 2nd lump benign, pathologist and radiologist concur the 2nd lump doesn't even have to come out.  So, we are back on for the original re-do of the 1st lumpectomy on Thursday.  Joan was thrilled.  Our hearts and thoughts are now with those who are awaiting their 2nd lump diagnosis.  We are so so very thankful for this group.  Joan read every reply with interest.  In the past, pre-bc, whenever there was an email, like from a friend or grandchild, she might say, oh, I'll read it later.  But when there was a reply from this group she'd jump right over and read it.  Her battle is not over but it is great to get some good news for a change.  Thank you and love to all, Joan and Tom",
      "MessageIndex": 24,
      "PostDate": "29/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799162",
      "Title": "Just Diagnosed now MRI finds a 2nd Lump jfelice Camillia"
    },
    {
      "AuthorID": "jfelice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166392/profile",
      "Content": "Jan 28, 2013 02:52AM jfelice wrote: thanks to everyone again, Joan really appreciates hearing from each and every one of you.  No word as of Friday, so we're hoping to hear something tomorrow, Monday.  Surgery is for Thursday the 31st but the result of the 2nd biopsy is not in yet.  Joan is hoping to know something tomorrow so that if it is the worst she has a couple of days to prepare for it.  They keep telling us that postponing the surgery is not a big deal at her stage with her type but she wants to have it settled. She just read a Readers Digest article by Dr. Susan Hwang (California) basically saying that maybe DCIS shouldn't be treated at all because most of the time it never amounts to anything but even the amount of times, the article acknowledges, it does advance or turn invasive is still a pretty large amount we don't think her conclusions make any sense.  We saw Dr. Hwang's Youtube vid on the same topic and her advice seems dangerous.  She's 100% right if only you knew for certain you were in the 60% that were going to be okay with no treatment. @Camillia - did you mean 1.9 Cm (not mm) and 1.2 cm?  That would be bigger than Joan's 6mm. What are satellites? Again thanks, Joan says you are doing a wonderful work providing the replies that you do.  I think so too.",
      "MessageIndex": 19,
      "PostDate": "28/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799162",
      "Title": "Just Diagnosed now MRI finds a 2nd Lump jfelice Camillia"
    }
  ]
}