{
  "AuthorID": "jgbartlett",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
  "Posts": [
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "jgbartlett wrote: Hi, This is my first post. Three days ago I had a mammogram and ultrasound, which stated that I had a lesion in my right breast which is consistent with a breast carcinoma, it also showed slight asymmetricl thicking of the cortex of a lymph node. The report suggested that I get a core biopsy of the mass, and fine needle aspiration of the node.  I've just got home from that appointment, and I got the core biopsy of the mass. What has confused me is that they did not do a fine needle aspiration biopsy on my lymph node??? When the radiologist looked at it she said that it looked fine to her, the doctor had a look and then moved the ultrasound probe underneath my armpit.  He then stated that instead of a fine needle aspiration he would do a core biopsy (which made me think, ok maybe this is worse than we thought), and the nurse went to get the equipment. He kept looking in the area for a while (under my armpit), and he and the radiologist made some comments to each other (which I couldn't understand).  Then he got up and left, and the radiologist said that was it, and I would only need the one biopsy today. Why is it so hard to say what's on your mind in these situations, why didn't I just ask them why then?   But no, I didn't say anything and now I'm concerned about what the doctor saw to make him change his mind.  What are the reasons why he would decide not to worry about a biopsy, when it seemed like he definately saw something threre? Julie.  Julie Dx 5/16/2011, IDC, 2cm, Stage IIA, Grade 3, 0/3 nodes, ER+/PR-, HER2- Dx 9/16/2017, IDC, Right, 2cm, Stage IV, metastasized to bone, Grade 3, 0/2 nodes, ER+/PR-, HER2- (IHC) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/768902",
      "Title": "Supposed to biopsy my lymph node but didn't ? jgbartlett"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Mar 21, 2018 04:10AM jgbartlett wrote: Hi, diagnosed stage 4 in 2017",
      "MessageIndex": 505,
      "PostDate": "21/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Jun 7, 2012 04:37AM jgbartlett wrote: wrsmith2x - How was your local recurrence found? As it was quite big at 3.2cm. So, sorry to hear it's come back. Sorry dsub to digress a bit from the reason for your post.",
      "MessageIndex": 7,
      "PostDate": "07/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/787529",
      "Title": "5 year survival question dsub burge"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Apr 17, 2013 08:56PM jgbartlett wrote: I'm sorry you are worrying so much, but I know exactly how you feel. All of this is so hard. Have you spoken to your doctor about your concerns? And I know it's hard to talk to family & friends because you don't want them to worry about you (and sometimes they are just so positive and keep telling you that everyone is going to be ok, and we know that it might not be). Sorry, I probably haven't helped you at all, but just wanted you to know you're not alone. Make sure you report back & let me know how you go.",
      "MessageIndex": 1,
      "PostDate": "17/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/803351",
      "Title": "Removing a fibroadenoma Mommy2Katelynn tran2501"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Feb 15, 2013 07:53AM jgbartlett wrote: 'like'",
      "MessageIndex": 38,
      "PostDate": "15/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797000",
      "Title": "Grateful! -Celebrating My 3 Year Anniversary as a Survivor CharlotteMe hmh23"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Jul 5, 2015 08:38AM jgbartlett wrote: Hi all, I haven't been on this site for a while, everything has been going pretty smoothly. But I've started having some symptoms and have a drs appt next week but just thought I'd see if anyone else had something similar. Brief history dx May 2011 IDC stage 2 grade 3 chemo rad bilateral Sal Ooph in Jun 2013. A few weeks ago I got abdominal pain (like period pain) and a bit of spotting. Only lasted a couple of days, thought I'd take the wait & see approach and it's back again. I shouldn't be bleeding if I've got no ovaries right? Any similar experiences?",
      "MessageIndex": 3062,
      "PostDate": "05/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Dec 7, 2013 04:13PM jgbartlett wrote: Thanks Chrissy, I've got him booked in at the docs next Friday as he's got some moles I want to get looked at - so I'll get it checked out for sure and let you know what they say. The doctors at our medical centre seem to turn over a lot & unfortunately the one I'd had all my life has retired and there are a lot of training doctors. Do you think I would be sounding unreasonable if I insisted on an ultrasound?",
      "MessageIndex": 1926,
      "PostDate": "07/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Jul 10, 2015 07:55AM jgbartlett wrote: I got my ultrasound results. There were no masses and the lining was ok but there were two areas that they weren't 100% happy with so I'm off to my gyno for a hysteroscopy next week. I'm pleased they are following it up further.",
      "MessageIndex": 3067,
      "PostDate": "10/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Jul 18, 2012 12:30PM jgbartlett wrote: Hi all, thanks for this very helpful thread. I haven't read from the start, so I apologise if I'm asking a question that has already been asked. In March this year I had a bone scan due to some paid I was having in my back. It came back negative.  I still have the pain at times, so I'm assuming it is muscular. In the past couple of weeks I've been getting some quite severe pain in my sternum/rib on the same side as my breast cancer.  I'm due to see my onc again on 16th August. My question is around the speed of bone mets developing. If I had a clear scan 4 months ago, is there any possibility this may be something to worry about? Julie.",
      "MessageIndex": 584,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Sep 23, 2013 09:08AM jgbartlett wrote: Hi ladies, I've had a few scares over the last six months - but a negative breast lump surgical excision, oophorectomy & abdominal ultrasound and I decided to stop worrying and get on with life (easier said than done). But my next symptom is one that really scares me - it's happened 3 times now over the past four weeks. While driving I've sort of blanked out - not passed out but for a second or two I have no idea where i am, its scared the crap out of me but within a couple of seconds it comes back to me. It's sort of like where am i and where am i going? I started arimidex four weeks ago (coincidence?) and am noticing bone pain, stiffness, insomnia, liver soreness, nausea & headaches. Could my brain issue be a side effect of this as well? I've also been really busy working two stressful jobs, maybe it's from this? The last time it happened was about 7 days ago. Should I make an appt with my GP or wait to see my onc on Oct 23rd?",
      "MessageIndex": 1745,
      "PostDate": "23/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Sep 23, 2013 10:14AM jgbartlett wrote: Thanks chickadee, I was diagnosed at 39 & am now 41 - so I hope it's not old timers already! It just scared me as I didn't recognize anything around me for those few seconds. I've been trying so hard to move on too. I guess I'll just monitor myself over the next weeks till I see the onc. I am prone to fainting after growing out of juvenile epilepsy, but luckily the incidences are getting further apart. Oh the joy of it all!!!",
      "MessageIndex": 1747,
      "PostDate": "23/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Apr 5, 2013 06:01PM jgbartlett wrote: I feel so sad seeing the posts that tell us that our stage iv friends have become angels. The latest was Elisha82 - she was so young. I'd like to pay my respects, I read her blog and once diagnosed stage iv her cancer was very aggressive. It made me realise any of us could be diagnosed stage iv and gone very quickly. My condolences to her family & the families of all we have lost to this horrible disease.",
      "MessageIndex": 1252,
      "PostDate": "05/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Jul 8, 2015 08:17AM jgbartlett wrote: Thanks Chrissy & Carpe, Pain was unbearable so got into doctor early and had ultrasound today. Radiologist suggested I see my GP tomorrow so I've got a morning appointment. Fingers crossed it's nothing too serious.",
      "MessageIndex": 3065,
      "PostDate": "08/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Dec 7, 2013 03:41PM jgbartlett wrote: Hi Ladies, just got a quick question which I know doesn't really fit here - but not sure where else to post it and I know there are lots who read these posts. My son is 14 and has had a hard sore lump under his right nipple for 4 or 5 months now. He's mentioned it a few times and I've always just past if off as hormonal changes as he has certainly shot up in height and his voice has changed during that period of time. He complained about it again today and when I had a look the lump is bigger and his nipple is quite red and hard as well, and it is quite noticable that it is different to the left side. I'm pretty certain that at his age it couldn't be anything bad - but as usual that c word pops up in the back of my mind. Have any other mums had anything similar as their boys have been going through puberty? Thanks, Julie.",
      "MessageIndex": 1924,
      "PostDate": "07/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "May 16, 2018 05:25AM jgbartlett wrote: Hi ladies, I have bone mets but over the past four weeks I've been getting pain under my ribcage on the right side, it also spreads around to my back. Not all the time and some days worst than others. I went to the dr and had some recent bloods that showed all my liver markers looked fine, so the doctor dismissed them. But i'm not making it up! So can I ask a quick question of you - did your liver mets always show up in your liver blood tests as abnormal? Thanks and thinking of you all. Julie",
      "MessageIndex": 8778,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Apr 4, 2012 08:57AM jgbartlett wrote: Waiting ........ we all hate it. Once you know what you are dealing with you can work through it in your own head, and plan a course of action. Until then we send lots of (((((((hugs))))))) Julie.",
      "MessageIndex": 3,
      "PostDate": "04/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/785225",
      "Title": "Despite everything... this is scary! kieraann Blessings2011"
    },
    {
      "AuthorID": "jgbartlett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129068/profile",
      "Content": "Feb 8, 2013 06:22AM jgbartlett wrote: I had chemo on the Monday & took that first week off, and then worked for the other two. Some days were a struggle but I got through them. I actually found the radiation more difficult, I ended up with extremely painful 2nd degree burns and had to take two weeks at the end of my treatment to recover - once they actually stopped zapping me (and they called it quits early due to my reaction) my skin healed quite quickly. I hope you have a flexible workplace, my boss and colleagues were fabulous.",
      "MessageIndex": 4,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/800125",
      "Title": "Working Fulltime bhlri rozem"
    }
  ]
}