{
  "AuthorID": "JHeart",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196847/profile",
  "Posts": [
    {
      "AuthorID": "JHeart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196847/profile",
      "Content": "Feb 26, 2014 03:14PM - edited Feb 27, 2014 03:52AM by JHeart Oh My Gosh.  How do you all keep slugging along?  My technique is to keep my eyes on the road and keep  on keepin' on.  And so here we are. Well I will start with saying thank you to the tenor of the majority of you who have responded to my post. Thank you! I needed a boost of self confidence and kindness. Too long have my husband and I sucked it up and slugged along on our own.  I've been hesitant to join a forum such as this because I am very adverse to dealing with anyone's emotional distress beyond what faces me every day in the mirror. Stubborn indeed. But that is also necessary when dealing with the reality of abused and abandoned dogs (OK, not just dogs, but they are my fav..) and the emotional toll that comes along with that. So we all come along with our defenses.  Yes, this woman has tried really hard to be there for me, I hate to throw that friendship out based on something that she was driven to share that she probably shouldn't have. But DARN that hurt!  Yep, I turned to you all for help.  Thank you, thank you, thank you. Regardless of our difference in approaches you are a pretty darn loving and supportive group. Rock on. This has helped me to take a breath and reevaluate. (As far as the back and forth with Bon, I've modified this post to remove my response. For many reasons there is no point in continuing to engage.)",
      "MessageIndex": 19,
      "PostDate": "26/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818425",
      "Title": "Anger Over Friend's Comment on House Cleanliness JHeart carpe_diem"
    },
    {
      "AuthorID": "JHeart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196847/profile",
      "Content": "JHeart wrote: Hello All, This is my first post. I've had Stage 4 Metastatic Breast Cancer (at diagnosis) for over 2 years. I am married, to a wonderful guy (lucky me), and we've had off and on support from friends and family. One group, a non profit organization dealing with animals, has come over to our home (we live on a multiple acre plot) to help with chores around the house and helping to maintain the yard. We also have multiple dogs, which takes a lot of energy and effort to maintain well.  One women has put a lot of effort to help organize the chore days, she brings us dinners, and has turned into a good friend.  She stopped by last night to drop off a dinner and to talk about scheduling another chore day.  Shortly before she left she told us of a conversation between herself and another woman volunteer who has been to our home multiple times.  They apparently talked about how messy our home is, how we needed to have more then aisles through the house, how we were 'collectors' and that she could back her pick-up truck to the door and take stuff to Good Will, etc....  She went on to explain how they were going to be over soon to help clean, and so on. OK. We are neither collectors nor hoarders. Really.  We do not have 'aisles' through our home. But nor are we neat freaks. Yeah, there is stuff stacked on counters, the dishes aren't always done, and vacuuming is a never ending job with multiple dogs. We have a nice home that is probably messier then it was 3 years ago when we weren't exhausted all the time, commuting to multiple doctor appts. and treatments, and struggling with the stress and toll of our friend cancer while holding down our jobs. When this friend stopped by we had just emptied all the furniture out of the living room to wash the floor. After she left I mopped the floor and cried for an hour. So now my husband and I are struggling with a whole range of emotions. Embarrassment - are we really slobs? Anger - What gives her the right to judge how clean my house is? Betrayal - Is this what friends do?  My first reaction is to slam my doors, lock them and refuse all help.  I am so embarrassed and angry. So now what? Do we reject help from this group?  Swallow our pride and shut up? Try and work it out directly with this one person?  I don't feel like we can afford to turn away help since we are exhausted so often, however the price to pay seems emotionally really steep.  Even early on in my diagnosis it was difficult to have people over to help but now it seems insurmountable.  Uhg.  Have any of you experienced this and what did you do? I'm really struggling. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818425",
      "Title": "Anger Over Friend's Comment on House Cleanliness JHeart carpe_diem"
    }
  ]
}