{
  "AuthorID": "jilllori",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143656/profile",
  "Posts": [
    {
      "AuthorID": "jilllori",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143656/profile",
      "Content": "Jan 24, 2012 02:03AM jilllori wrote: I hope you are right, AmylsStrong that my pain is work related, but it is so hard for me to believe that it is. Today I had occasional pain in my left groin area as well as in the tissue between my breast and underarm, so I am panicking.  However, I have promised myself that if everything turns out ok that I will follow your words of wisdom and try not to worry so much. ",
      "MessageIndex": 9,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/781455",
      "Title": "Very scared jilllori SusanHG"
    },
    {
      "AuthorID": "jilllori",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143656/profile",
      "Content": "Jan 30, 2012 06:34PM - edited Jan 30, 2012 06:35PM by jilllori Just want to let you all know that I had my mammogram on Friday and an ultrasound early this morning. The mammogram didn't find anything but they also did an ultrasound because I felt something.  Ultrasound was normal. I was told that I am feeling normal breast tissue. I asked about the pain and was told that many women complain of random breast pain and it doesn't necessarily mean you have breast cancer. I am glad I got it checked out. So I am more convinced that my pain is work related and that even though it feels like its coming from my breast it may be muscular. As for the joint pains I was getting, if they persist I will mention it to my doctor at my physical which is soon. Knowing me they are probably and hopefully psychosomatic and I shouldn't assume the worst with each ache and pain. Good thing I never went into med school, as I would have come down with every affliction I would be studying, at least mentally.  I am sure next year when I have my next mammo done, I will freak out again. Oh, the fatigue that I was feeling is gone now. Amazing what a good sleep will do.  Thanks to all of you for your support.  Much appreciated.  :)",
      "MessageIndex": 15,
      "PostDate": "30/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/781455",
      "Title": "Very scared jilllori SusanHG"
    },
    {
      "AuthorID": "jilllori",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143656/profile",
      "Content": "Jan 27, 2012 12:58AM jilllori wrote: Just wanted to give an update.  Going for mammogram tomorrow. Very very nervous.  I have been tired for the past week and have noticed 2 lumps in breast.  Still have intermittent breast pain. I was wondering if being tired all day is a symptom of breast cancer that has spread. I also have throbbing achy pain in some of my joints (now its elbows) and my left shin. Last year I had a normal mammo and ultrasound, but I didn't feel like crap like I do now.  Say a prayer for me for tomorrow.  Thank-you",
      "MessageIndex": 10,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/781455",
      "Title": "Very scared jilllori SusanHG"
    },
    {
      "AuthorID": "jilllori",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143656/profile",
      "Content": "jilllori wrote: I am 43 years old and have been having intermittent achy pain in outer part of left breast for past 3 years. Three years ago I had a normal mammogram, and last year (I skipped a year) I had another normal mammogram and a normal ultrasound.  Pain has recently come back and I feel that it is worse.  Ít's still on left side near side of body and occasionally I feel it when I lift my left arm.  Went to my Dr. on Friday and she couldn't feel any masses but is trying to make my next scheduled mammogram (in April) as soon as possible.  Since last week I have been getting joint pain in hips, elbow area and wrists and a bit of pain in my back. I am so scared that I have had undiagnosed breast cancer for past 3 years and now it has spread to my bones.  I am known to be a bit of a hypochondriac and have had psychosomatic symptoms in the past especially when I hear stories of people my age who have breast cancer. I am so worried that I am going to be diagnosed with stage 4 and will die without seeing my children grow up. I should add I am a dental hygienist and occasionally get back and neck pain related to my working position. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/781455",
      "Title": "Very scared jilllori SusanHG"
    },
    {
      "AuthorID": "jilllori",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143656/profile",
      "Content": "Jan 23, 2012 02:42AM jilllori wrote: Thank you Marie and Annie. You have both made me feel a little bit better.  I still can't help but worry since I do have pretty constant pain in my left breast and just read that invasive ductal carcinoma can present as breast pain, but will wait for mammogram and ultrasound appointment before driving everyone crazy with my worrying.",
      "MessageIndex": 4,
      "PostDate": "23/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/781455",
      "Title": "Very scared jilllori SusanHG"
    },
    {
      "AuthorID": "jilllori",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143656/profile",
      "Content": "Jan 27, 2012 01:36AM jilllori wrote: Yes, Marie, I did have blood work taken last Friday and just got the results earlier today that everything came back normal.  But unless I am wrong I don't think that a general blood test shows the presence of cancer that has metastasized, I know it can show leukemia. Hope I can sleep tonight. Thanks again",
      "MessageIndex": 13,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/781455",
      "Title": "Very scared jilllori SusanHG"
    },
    {
      "AuthorID": "jilllori",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143656/profile",
      "Content": "Jan 30, 2012 07:10PM jilllori wrote: thank you Marie, Your comment about stress and anxiety is so true. Have to figure out a way to turn my brain off. Take care ",
      "MessageIndex": 17,
      "PostDate": "30/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/781455",
      "Title": "Very scared jilllori SusanHG"
    }
  ]
}