{
  "AuthorID": "Jillianmomm…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169943/profile",
  "Posts": [
    {
      "AuthorID": "Jillianmomm…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169943/profile",
      "Content": "Feb 27, 2013 02:30PM Jillianmommyof3 wrote: Hi qkidsma, when I noticed a depression in my breast that's when I found a palpable lump just at the bottom of the indention. Feel around the area and see if you can find anything that would be causing it or wait a cycle and see if it is still pulling in. I hope it's nothing!! I was already scheduled for my 6 month ultrasound of my right and breast and called to add the left breast. I am not sure if it's harder to get an appointment without a palpable lump though.",
      "MessageIndex": 1,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801120",
      "Title": "Question? qkidsma qkidsma"
    },
    {
      "AuthorID": "Jillianmomm…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169943/profile",
      "Content": "Feb 25, 2013 04:53PM Jillianmommyof3 wrote: Christal, I am sorry to hear you are going through with this again. Waiting is the worst!! I know that waiting another 3 months sounds awful, but I don't think there is another option unless you pay out of pocket. My suggestion is to call and get an appoinmtment for the day your insurance kicks in so you know you don't have to wait any longer than that. Being young and feeling brushed off is the worst (I am 31) I got that feeling alot! Good luck to you and I hope it's all benign results :) (((HUGS)))",
      "MessageIndex": 1,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800900",
      "Title": "Having a Hard Time Niner5689 ballet12"
    },
    {
      "AuthorID": "Jillianmomm…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169943/profile",
      "Content": "Feb 13, 2013 07:18PM Jillianmommyof3 wrote: Cassie you should go see a doctor just to ease your mind. I know how frightening it is to feel something and not know what it is. It is intimidating to think of asking a doctor about it at your age, but it is worth doing to relieve stress and anxiety. Good luck ((HUG))",
      "MessageIndex": 1,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800442",
      "Title": "Havent gone to see doctor yet cassie2318 itsjustme10"
    },
    {
      "AuthorID": "Jillianmomm…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169943/profile",
      "Content": "Feb 20, 2013 12:42PM Jillianmommyof3 wrote: CRGirl, I'm sorry you are going through the waiting game like so many of us. It truly is the hardest part not knowing what you are dealing with. I hope you get in with the surgeon quickly. Mine was a month out, but I asked to be on the cancellation list and I ended up getting in a week after my mammo/ultrasound. Now I have a months wait for my excisional biopsy and duct removal. This is driving me a little crazy, but I am so happy to know that whatever is inside me is getting taken out and really looked at! Good luck to you and I hope these forums help you as much as they help me get through the waiting game ",
      "MessageIndex": 8,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799655",
      "Title": "Stressed CRGirl CRGirl"
    },
    {
      "AuthorID": "Jillianmomm…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169943/profile",
      "Content": "Feb 25, 2013 08:20PM Jillianmommyof3 wrote: Jen the ladies are right about sharing your feelings with your spouse. I have downplayed the whole thing for this past month and finally had a meltdown yesterday and talked about my fears with my husband. I feel so much better now that I can talk with him about anything! I feel so supported now and I know it was my fault for not letting him in. CRGirl, I am glad to hear so far so good for you!! I hope this will be a big scare and nothing more! Keep us posted :)",
      "MessageIndex": 16,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799655",
      "Title": "Stressed CRGirl CRGirl"
    }
  ]
}