{
  "AuthorID": "Jill_45",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63700/profile",
  "Posts": [
    {
      "AuthorID": "Jill_45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63700/profile",
      "Content": "Apr 5, 2008 04:08AM Jill_45 wrote: Well I am in for April. I am having a sentinel node biospy and a re excision to try to get clean margins this time on April 21st. I am just starting to heal nicely from my lumpectomy 3 weeks ago and now they are going to cut it again.(sigh). I even thought I could get away with just day surgery but no way as they are keeping me in for 24 hours this time. Maybe they can knock me out enough to catch up on all the sleep, lol. Hope you all have a great weekend. Jill. ",
      "MessageIndex": 70,
      "PostDate": "05/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/702931",
      "Title": "Anyone having surgery in April?? ottawagirl wahine"
    },
    {
      "AuthorID": "Jill_45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63700/profile",
      "Content": "Apr 20, 2008 09:47AM Jill_45 wrote: Thanks Sam 408. I have to be at the hospital at 10:30 tomorrow for the prep of the SNB and then surgery is at 1:40. have to stay overnight this time so will be back home on Tuesday. Good luck to everyone else having surgery and to those who have had theirs this month I wish you all a speedy recovery. Jill. ",
      "MessageIndex": 159,
      "PostDate": "20/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/702931",
      "Title": "Anyone having surgery in April?? ottawagirl wahine"
    },
    {
      "AuthorID": "Jill_45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63700/profile",
      "Content": "Apr 23, 2008 07:39PM Jill_45 wrote: Hi All. I got back home yesterday from having my surgery on Monday and it is a lot tougher this time after just having the last surgery 6 weeks ago. I had a SNB done and re-excision this time and should get the pathology report next week. Hopefully as long as the nodes are clear it will be just radiation. My first appointment with the oncologist is May 14th.  Hope everyone who has had surgery so far this week is doing good. Jill. ",
      "MessageIndex": 179,
      "PostDate": "23/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/702931",
      "Title": "Anyone having surgery in April?? ottawagirl wahine"
    },
    {
      "AuthorID": "Jill_45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63700/profile",
      "Content": "Jill_45 wrote: This Post was deleted by Jill_45. You gain strength, courage and confidence by every experience in which you really stop to look fear in the face. You are able to say to yourself, 'I have lived though this horror. I can take the next thing that comes along.' Eleanor Roosevelt Dx 3/17/2008, IDC, 5cm, Grade 3, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722500",
      "Title": "Breast Cancer Song Is inspirational Jill_45 Jill_45"
    },
    {
      "AuthorID": "Jill_45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63700/profile",
      "Content": "Feb 16, 2009 11:23PM Jill_45 wrote: Wow Laura...we are always learning something new on here aren't we. Where did you end up getting your bracelet? I emailed the girl that Binny said to get the wallet card. Well off to the Docters for a checkup in a few minutes and to see when I have to get that dreaded mamogram for my good side. YUK. Jill.",
      "MessageIndex": 16,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/729087",
      "Title": "Wear to buy cool LE Bracelet? Estepp lvtwoqlt"
    },
    {
      "AuthorID": "Jill_45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63700/profile",
      "Content": "Mar 31, 2011 01:59AM Jill_45 wrote: Yan, I was so so sad to hear about your wife Olga passing away. I remember you from our Chemo 08 thread as I was going through my treatmants at the same time. My thoughts are with you and your family. Jill.",
      "MessageIndex": 105,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766686",
      "Title": "Hugs From Yan barbe1958 Chevyboy"
    },
    {
      "AuthorID": "Jill_45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63700/profile",
      "Content": "Feb 16, 2009 03:49PM Jill_45 wrote: Laura. I was told that even the removal of any nodes that you have to be careful. I have high blood pressure and was told that I should not have my blood pressure taken on that side. I was wondering also that you say you had all your nodes removed on that side so I am a little curious as to how many there are as I see so many that are a higher number than yours that have been removed and I know of a few girls that have had 29 nodes removed on one side. Another puzzling question . lol.  Hace a great day. Jill.",
      "MessageIndex": 12,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/729087",
      "Title": "Wear to buy cool LE Bracelet? Estepp lvtwoqlt"
    },
    {
      "AuthorID": "Jill_45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63700/profile",
      "Content": "Apr 1, 2008 02:02PM Jill_45 wrote: Viv, can he not go online and get them. That's what my Doctor did after 7 days as my Surgeon was on holidays and I would have had to wait 2 weeks otherwise. He knew my frustration that day I saw him and so he stayed in the office after hours, got it online and then called me that night with the results. Not that I really wanted to hear that news over the phone but better than waiting. Now I have to wait for a call from a new surgeon as mine doesn't do the SNB and have to to have a re excision done as well. Waitng does funny things to the mind!!!!! Jill. ",
      "MessageIndex": 6,
      "PostDate": "01/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703183",
      "Title": "Climbing the walls...Pathology How Long?? crazydaisy beergirl"
    },
    {
      "AuthorID": "Jill_45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63700/profile",
      "Content": "Jun 13, 2008 09:53AM Jill_45 wrote: I am going to keep my fingers, toes and anything else crossed for you that it turns out okay. Now if I could wear a cross my heart bra I would cross that too but unfotunately with one boob and no prosthetic it won't work yet,lol. I am doing doing the Survivors Victory Lap tonight at the Relay for Life here in Victoria so I will think of you when you are doing the walk there.I just had my mastectomy just over 2 weeks ago so not ready to do the whole relay. Big hugs go out to you and hope your tests come back okay. Jill. ",
      "MessageIndex": 9,
      "PostDate": "13/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/707230",
      "Title": "Panic Attack!! Too Soon crazydaisy crazydaisy"
    },
    {
      "AuthorID": "Jill_45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63700/profile",
      "Content": "Jun 14, 2008 10:41PM Jill_45 wrote: Viv. I am so proud of you for sticking it out through all that bad weather you had at the relay. I only did the Survivors Lap and walked a couple more with my family. I hope you will let us know how your tests turn out, still keeping everything crossed for you. Jill. ",
      "MessageIndex": 18,
      "PostDate": "14/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/707230",
      "Title": "Panic Attack!! Too Soon crazydaisy crazydaisy"
    }
  ]
}