{
  "AuthorID": "Jillejo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133687/profile",
  "Posts": [
    {
      "AuthorID": "Jillejo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133687/profile",
      "Content": "Jul 21, 2012 04:40PM Jillejo wrote: I went to a wig shop and spent about 300 on a wig before my hair fell out. I wore it every single day. When it started getting ratty, I went online to Joshua24 and found the same wig for much much cheaper, so I bought a duplicate. I am glad I went to the wig store first, though, because they were so kind and helpful and really worked with me to make sure I got a wig that I would feel comfortable wearing. I was really hard on my wigs, and I ended up buying 5 different wigs. Wore it for the last time on June 4, and now I am sporting between 3-4 inches of hair, depending on what part of my head you measure! Crazy curly in the back, but starting to straighten out a little on the sides and front. Had color and highlights a couple of weeks ago, so I am starting to look a little more like me! Sigh...trying to be patient...",
      "MessageIndex": 16728,
      "PostDate": "21/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jillejo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133687/profile",
      "Content": "Jul 22, 2012 01:55AM Jillejo wrote: Tpolychron, I bought false eyelashes but never wore them. I lined my eyes with a thicker line than normal, but it didn't seem like my lashes were gone too long; it seemed like they came back pretty quickly. Losing your hair is hard, and I am so sorry about your tears at the wig shop. Hang in there and keep reminding yourself that this will not last forever. Wishing you peace, strength, and healing.",
      "MessageIndex": 16744,
      "PostDate": "22/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jillejo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133687/profile",
      "Content": "Jul 22, 2012 04:58PM Jillejo wrote: Tpolychron, I am a teacher also, and thankfully I was diagnosed in the summer as well. Otherwise, all the tests and preliminary appts would have exhausted my sick days before I even started treatment! I started chemo the week before school started in August and went every other week for 8 treatments. I had chemo on Friday, and chemo days were the only days I missed school. I was very glad that I waited to make a decision until I saw how I would react to chemo. School kept me busy and gave me less time to fret. I didn't tell my students about my cancer, but most of their parents knew. I talked to our hr dept before starting treatment so I knew my options concerning work going in to treatment, and knowing my options helped me. I also hated feeling like I was not in control. Hang in there, you can do this, and it WILL get better!",
      "MessageIndex": 16781,
      "PostDate": "22/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jillejo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133687/profile",
      "Content": "Aug 14, 2011 09:07AM Jillejo wrote: First, thanks for the warm welcome to the board. Had my first ac treatment Friday, and it wasn't bad at all. the worst part was that I started crying as soon as my big toe entered the room. Ugh! Wiped the tears away, got my big girl panties on, and did the deed. Quick, easy, and painless. Then lunch at cheddars and home. Felt fine Fri and really fine yesterday, according to my family, since I was a one woman comedy troupe. fortunately, I remember very few of my antics. Scott had to het his sister to come babysit me while he ran errands bc I was so goofy. The good news is no nausea, and I can lay down whenever I feel like it for now, until school starts Tuesday. Hope everyone has a great Sunday!",
      "MessageIndex": 605,
      "PostDate": "14/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Jillejo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133687/profile",
      "Content": "Aug 11, 2011 06:09PM Jillejo wrote: Guess it is time for me to introduce myself. I'm Jill from Texas. Married with 3 kids, a dog, and a cat. Starting chemo tomorrow, and I am really nervous about it. I am having 4 rounds of AC, 2 weeks apart, then 4 rounds of Taxol 2 weeks apart, and then 33 days of radiation I have been to the dr more in the past 2 months than I ever imagined possible! I am a teacher, so I have not missed any work due to dr appts, but I go back to work next week, and I am hoping I can work during treatment. I really don't want to stay home and think about being sick, which is how I feel I have spent much of my summer! I feel very lucky to have found these boards, and while reading them is sometimes scary, it is nice to know there is a place to go where others can offer support and encouragement. I am just ready to get started with this phase of treatment. fear of the unknown is just really scary.",
      "MessageIndex": 501,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    }
  ]
}