{
  "AuthorID": "Jillg284",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202682/profile",
  "Posts": [
    {
      "AuthorID": "Jillg284",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202682/profile",
      "Content": "Aug 22, 2015 01:41PM Jillg284 wrote: I thank god work 3 days a week only. So as long as I feel good I go and do my 3 days. I was on disability for a year and a half and it was horrible. I actually went back to work this past July since we realized how I was on taxol and my blood counts never really dropped much enough to be at risk. My job works really well with me so my boss is on standby for Wednesday in case I don't feel well. But if I have no nausea and not much fatigue I should be fine. I guess Monday will be a test run. Hope you enjoy your camping weekend! I'll keep you posted on Monday after halaven #1!",
      "MessageIndex": 1439,
      "PostDate": "22/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Jillg284",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202682/profile",
      "Content": "Aug 19, 2015 09:02PM Jillg284 wrote: I just saw her message, she is away until mid September! Just my luck!!",
      "MessageIndex": 1435,
      "PostDate": "19/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Jillg284",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202682/profile",
      "Content": "Aug 20, 2015 04:48PM Jillg284 wrote: I start Monday. Would you think getting halaven on Monday I would be able to work on Wednesday? I was able to on taxol.",
      "MessageIndex": 1437,
      "PostDate": "20/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Jillg284",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202682/profile",
      "Content": "Aug 19, 2015 02:51AM Jillg284 wrote: funny thing is..I get a CEa done which has always been normal..ca 27.29 which spiked to like 50 at one point but now normal and my liver enzymes were thru the roof on taxol and carbo my last round. I stopped carbo since the 1st week of July and kept taxol but then my enzymes went up and down. Carbo worked for me got rid of a positive node from February to June. I think taxol stopped that's why I'm changing now! I'm a little nervous about the hair. I've been so lucky to never lose it but it is what it is!",
      "MessageIndex": 1432,
      "PostDate": "19/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Jillg284",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202682/profile",
      "Content": "Aug 18, 2015 12:40AM Jillg284 wrote: Hi everyone! I guess I can consider myself part of the stage 4 crew even though I hate to admit it! I'll run down my list of what happened in a year & a half. *2/14 diagnosed with stage 1, 1.3cm right breast IDC triple negative. Negative nodes, clear margins, double mastectomy *5/14-10/14 CMF chemo *11/14 small lytic lesion found in head of right clavicle *12/14 radiation to clavicle *2/15 clavicle clear but two less than 1cm nodes in right supraclavicualr area positive for mets. Started on taxol & carboplatnin *6/15 nodes clear of cancer but now 1 hilar node in chest and 1 subpectoral node lit up on PET. Continued on T&C *7/15 Liver enzymes high stopped carbo kept taxol *8/15 new pet shows hilar node from 1.7cm to 2cm, subpectoral node gone, new 1cm para tracheal node lit up and one supraclavicualr node returned in neck. All my organs are ok just 3 active nodes going on Now I'm starting on Halaven & Carbo next week. Studies show those two work well with triple negative. I've never lost my hair with any chemos I was on, just thinned with taxol. I tolerate chemo well, also work full time as an ICU nurse. I'm wondering all the side effects anyone had with Halaven?? What should I expect? Let me know the good, bad and ugly of this drug! I start next Monday!! Hope everyone is doing well! ;-)",
      "MessageIndex": 1424,
      "PostDate": "18/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Jillg284",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202682/profile",
      "Content": "Aug 17, 2015 09:23PM Jillg284 wrote: thanks RonnieKay..I'm at the point where it's like do what you gotta do to keep me alive. I'm 31..lost my breasts, lost my chance at having children on my own (thanks to fertility I have 21 embryos waiting) I don't want to go anywhere. I'm to young for this! So I continue to fight. I'm grateful it's not in an organ it's just some nodes but I want to kick them to the curb before it turns into a disaster! I just can't believe a two years ago I had not one care in the world, healthy about to be married then BAM! This all happens. Thanks Brca gene! 😩",
      "MessageIndex": 1427,
      "PostDate": "17/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Jillg284",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202682/profile",
      "Content": "Aug 18, 2015 01:59AM Jillg284 wrote: thanks for the info! I didn't lose my hair on taxol at all, it thinned and like small clumps would come out in the shower but I still have a full head of hair. I already use that stuff by Joan rivers because my sides are VERY thin so when my hair is up you can't even notice the baldness. I've been so lucky to not lose my hair at all but if it happens, it happens. I tolerated taxol well. By day 3 I was fine and back at work! No nausea or anything? I rarely had nausea with taxol. The main question is..did Halaven work for you?? I'm combining it with carboplatnin so I'm praying it gets rid of these nodes!",
      "MessageIndex": 1429,
      "PostDate": "18/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Jillg284",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202682/profile",
      "Content": "Aug 19, 2015 08:58PM Jillg284 wrote: What thread is it? I am just getting use to this site.",
      "MessageIndex": 1434,
      "PostDate": "19/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Jillg284",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202682/profile",
      "Content": "Aug 25, 2015 02:05AM Jillg284 wrote: Got my first dose this morning..felt tired this afternoon but i also had a busy weekend. Other than that, I feel good! Lets see what tomorrow brings! ;-)",
      "MessageIndex": 1440,
      "PostDate": "25/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Jillg284",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202682/profile",
      "Content": "Oct 6, 2015 02:30AM Jillg284 wrote: Hi Ladies! I sem to be doing well on Halaven physically. I do not get sick and I usually feel pretty normal on it. Did not lose hair, I am on tx #3 that I got today. I get it day 1, day 8 and on day 8 they give me carboplatnium as well. Now thats annoying! Im having a problem with my clavicle again. Last year in November it fractured randomly which turned out my Stage 1 early cancer, cancer free they actually told me in October 2014 turned into stage 4 because the fracture ended up being bone mets. I got radiation during christmas break and it was gone by Februarys scan. August 2015 scan shows a small area on my clavicle next to the old mets lit up. So thats why Im on halaven and carboplatnim. (along with two nodes in my chest under 2cm that lit up) Who knew a small area on your clavicle and two positive nodes makes you Stage 4..but anyway my clavicle has been killing me again..tried to ignore the pain until my December scan but its getting annoying..went to my radiation oncologist who finally listened to me and scheduled me for a CT scan of the chest. I am just afraid of another fracture, or maybe this new area on my clavicle needs to be radiated! The RO said it could be inflamed from chemo targeting the area and aggravating it..but come on do we ever believe doctors these days??  Fingers crossed my scan is ok!! Hope all you ladies are doing good!",
      "MessageIndex": 1446,
      "PostDate": "06/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    }
  ]
}