{
  "AuthorID": "Jinx27",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
  "Posts": [
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Oct 31, 2018 08:45PM Jinx27 wrote: Still here!!",
      "MessageIndex": 42,
      "PostDate": "31/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/845339",
      "Title": "Large tumour survivors LM070917 Mumoftwo416"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Jan 19, 2016 04:12AM - edited Jan 19, 2016 04:30AM by Jinx27 I had similar symptoms! Both my gyn and gp thought is was hormonal changes and technically they are right BUT two years later I developed strong ER PR breast cancer in both breasts. I believe at that time my cancer was in its super baby stages. I dont carry the BRCA 1 or 2 gene, I have never been on birth control in my life. However I began menstruating at the age of 10, that was definitely an increased risk for hormonal changes, BC and many other conditions. All of my docs thought I had fibrocystic breasts due to my age 25 at the time. I just took it as that and left it alone. But then I started to feel a dent and a lump in the left breast and non cyclical itching and swelling. My breasts felt like they were getting bigger. I went back to my GP and then he wrote a script for a mammogram and an ultrasound. If I had to do it again, I would have pushed harder for an ultrasound, mammogram and maybe MRI the first time BEFORE the dent and lump. Im telling you catching this early whether its benign or malignant will save you headaches. Push for imaging!! If something suspicious is found the worst that could happen is that they want to watch and wait for more changes and have you come back ever so often for imaging. If it get large enough to biopsy they may. Imaging can rule out many things. During that time I would also get genetic testing to see if you dont carry the gene for BRCA 1 and 2 and other cancers. Seek out medical advice on how to zero in on your bodies hormone levels with both conventional doctors and alt/complimentary practitioners who have experience with hormonal imbalances. Please PM me with any questions and I wish you the best of luck!! Jinx27",
      "MessageIndex": 1,
      "PostDate": "19/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/840450",
      "Title": "hormone changes?! m29 Jinx27"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Jan 5, 2016 12:25AM Jinx27 wrote: My MRI overestimated one axillary node and one mammary node. My BS biopsied the axillary node and it came out negative. During surgery the mammary node was not seen as \"enlarged\" as it was on the MRI therefore it was kept in tact. Chemo is recommended for me though. My profile gives details about other node involvement I don't believe those nodes showed up on the MRI at all.",
      "MessageIndex": 10,
      "PostDate": "05/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/839285",
      "Title": "Do MRIs accurately predict node involvement/non-involvement? PiNKiDC51 Moderators"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Oct 13, 2015 08:50PM Jinx27 wrote: Im sorry your here but this forum is what helped me last month when I was diagnosed, I was just diagnosed and am narrowing down on choosing a team and treatment plan.  What was useful for me.... Genetic testing and how it can help the oncologist determine a plan of action Benefits of chemo before surgery Benefits of surgery then chemo Size of mass and it's relation to the stage Oncotype DX ( I think this test is done after excision of the entire mass) What treatment is recommended for someone of your age and the type of cancer you have (hormone receptive) Do you want children ? Egg harvesting or protecting your ovaries during treatment",
      "MessageIndex": 1,
      "PostDate": "13/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/835712",
      "Title": "Best Questions for Oncologist brithael brithael"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Oct 15, 2015 05:28PM Jinx27 wrote: Hey Keepstrong88, I'm 27 as well! Just diagnosed this past September. This site has been my refuge. I'm sorry you have to be here but we can do this together. Many of the members here have messaged me and shared their stories. Don't be afraid to message me. Your are MUCH stronger than you know! ",
      "MessageIndex": 14,
      "PostDate": "15/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/835735",
      "Title": "27 & Struggling :( Keepstrong88 nem126"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Jan 19, 2016 03:57AM Jinx27 wrote: HELLO LADIES!!! I just wanted to drop by and say hello and best wishes! I had a double mx with reconstruction in Nov and love my results. I wish every success in their surgery and recovery!  Jinx27",
      "MessageIndex": 408,
      "PostDate": "19/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Dec 26, 2015 04:58PM Jinx27 wrote: Hey Ladies! I'm five weeks post op (BMX and immediate reconstruction with free flap) and just wanted to say yes it is possible to get through surgery successfully. God bless you all, I pray for a safe recovery and great margins!!",
      "MessageIndex": 35,
      "PostDate": "26/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Nov 6, 2015 06:43AM Jinx27 wrote: Hey ladies! I made a typo my surgery is 11-17-2015. I have been, going a little wacky trying to get things together for surgery. Hugs kisses and prayers to you all.",
      "MessageIndex": 109,
      "PostDate": "06/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Nov 23, 2015 03:47PM Jinx27 wrote: @frill God has blessed you darling! I'm a soo sorry about your scare during surgery. I'm happy you made it. I'll be thinking of you. Take it easy and heal, you significant other sounds loving, that's what you need right now. @ sugar and spice I agree with your opinion on not having reconstruction, I almost decided to not have reconstruction and go flat and be free. There are complications with reconstruction but I somehow I chose for immediate. I really just want treatment to begin. Chemo is in my future (4 months) and maybe radiation on the left side. My incision site on my belly is tight that I have to walk a little slouched. We will see with the final path report.....best wishes and positive energy to you from me. @Tikkasmom I promise not to overdo it, I chose to take another pain med instead of Percocet, I wasn't ready for the effects at all. I'm very scared of taking it again. Only as needed. My thoughts are with you, positive energy to you! I'm hoping for good path reports for the both of us. @loving is living I believe I have chemo in my future too and I'm scared. I'm praying for you and your recovery.",
      "MessageIndex": 312,
      "PostDate": "23/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Nov 23, 2015 06:01AM Jinx27 wrote: Hello Ladies, Just dropping in to say I made it through surgery on the Nov 17th!! I had a double mx with immediate reconstruction, with a free flap from my abdomen. The plastic surgeons incision was shaped like a lollipop, my nipples were not spared, however the skin and tissue from my abdomen match pretty nicely. There is some swelling and chest pain, breathing is okay but my chest just feels soo darn tight sometimes. I willl practice inhaling with spirometer, that should help things wake up. I have six drains that feel like little children lol!!! These thing are annoying and I cannot wait until they are removed. I empty them and record the amount of drainage twice a day. Unexpected things that happened before and after surgery. 1) My menstrual cycle came on the DAY of surgery. How nice. 2) After surgery, my hemoglobin level was low therefore I needed some blood, got two bags on the second post op day. The doc told me I'm \"naturally anemic\" and recommended iron tablets. Im also taking black strap molasses. This really has me concerned because if during chemo my hemoglobin is low what in the heck will happen? 3) Was given Percocet and immediately became superwoman, I cleaned my hospital room without any pain, talked to friends in the phone till 1 am and then went to sleep. In my dream I built a spaceship. Overall I'm pleased with the outcome. My final path report should be in next week maybe. I stayed the hospital from the day of surgery until yesterday. I'm now resting and praying at home. I think of all of you when I'm alone and you all will be in my thoughts! Best wishes to everyone!",
      "MessageIndex": 305,
      "PostDate": "23/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Oct 19, 2015 01:14PM - edited Nov 1, 2015 10:12PM by Jinx27 Hey ladies! After deliberating between my second and third opinion, I have chosen a team. The breast surgeon would like to do a BMX with recon in Nov. Most likely November 4th. Most likely it will be a DIEP free flap. I pray for zero complications so that I can get into treatment after healing. I'm happy there is a place to connect :) UPDATE! Surgery is Nov 17th. Sentinel Node Biopsy was done last Friday and 13 nodes were removed: 10 negative , three positive :(",
      "MessageIndex": 8,
      "PostDate": "19/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Nov 1, 2015 02:13PM Jinx27 wrote: UPDATE! Surgery is Nov 17th. Sentinel Node Biopsy was done last Friday and 13 nodes were removed: 10 negative , three positive :( Axillary dissection will be done during surgery.",
      "MessageIndex": 64,
      "PostDate": "01/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Nov 3, 2015 04:41PM Jinx27 wrote: @Missbee123 I wish you the best surgery recovery :) Best wishes to all of you ladies!! As for crying, I have been anxious about surgery too. Seeing a counselor has helped me. I just want it to be over. I'm very nervous about managing pain and how my new boobs will look.  ",
      "MessageIndex": 79,
      "PostDate": "03/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Nov 5, 2015 12:37PM Jinx27 wrote: TallnTerrific I was diagnosed in one breast on 09-08-15 and then the right breast on 09-15-15. I spent the rest of Sept and October getting opinions. My surgery is 11-15-15, I have had counseling to help me control anxiety and stress, it has helped and I'm happy I took the time for it. I'm still nervous and will prob cry before and after surgery, but it's natural. Let the tears flow. Not everyone has to deal with cancer and for that we are WARRIORS!! XOXO TO ALL OF YOU LADIES!",
      "MessageIndex": 101,
      "PostDate": "05/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Dec 15, 2018 01:44PM Jinx27 wrote: Your not alone! I feel the same however I find peace in focusing on the things I do have control over. Meditating, praying, being present in life and enjoying right now. Sending encouragement to you. ",
      "MessageIndex": 19,
      "PostDate": "15/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/868751",
      "Title": "Stage 3c How do I keep from obsessing about recurrence orlando74 Meow13"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Oct 12, 2015 07:40PM Jinx27 wrote: Meme2006, I'm so sorry you were diagnosed, but you caught it early !!! Excellent :) I was diagnosed on 09-08-2015 and have finally narrowed down my choice for who I'd like to be my oncologist and breast surgeon. It can take time, but my case is much different than yours. After having three opinions, I was most comfortable with a comprehensive cancer center that is widely known in my city. There are some questions that need to be asked like... What are your options for surgery ? Will you need radiation afterwards ? Do you need genetic testing ? Having access to a comprehensive cancer center will be an advantage to you regardless of the stage of your cancer.This could be a university hospital with roots in research and innovation. Look around and ask some board members that may be in your area. BEST WISHES TO YOU !",
      "MessageIndex": 8,
      "PostDate": "12/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/835684",
      "Title": "Just diagnosed this week meme2006"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Feb 15, 2016 09:18PM Jinx27 wrote: I'm praying for you @Scarlettprinny ! My symptoms were a bit similar, my lump seemed to become large in a short amount of time as well. I also had an indentation and inverted nipples before the lump became palpable. My doctors thought it was fibrocystic changes due to my age. I wasn't diagnosed until many months after that. Please press for your ultrasound and biopsy and possibly mammogram. If confirmed malignant , which I'm hoping not ,you have many options to tackle this! My breast surgeon was very aggressive, we did ultrasound, mammogram, biopsy, then all imaging and bloodwork in a two to three week time span. I was then recommended an oncologist but was told to shop around for someone who I was comfortable with. That took time as well. But if surgery is recomended don't take too long! Having too much time between biopsy and surgery is frowned upon for a few reasons. Please stay positive and know you have a resource here!",
      "MessageIndex": 14,
      "PostDate": "15/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/840955",
      "Title": "Large lump appeared over night. scarletprinny Kicks"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Jan 27, 2016 02:12PM - edited Jan 27, 2016 02:15PM by Jinx27 I'm so frustrated with Adjuvant online being down for soo long. Every time I want to use it there is message that it won't be up until later. And get this, the date is always on my chemo infusion day. Go figure. Lol. I like to use PREDICT or Cancer Math for now. Predict gives me great numbers and its a much more easier to translate and comprehend. Cancer Math I believe uses percentages but reading the results is a bit confusing. Hope I helped! ",
      "MessageIndex": 1,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/840748",
      "Title": "What is being used instead of Adjuvant! Online? farmerlucy farmerlucy"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Oct 20, 2015 03:08AM Jinx27 wrote: I'm sorry your posting here! Once my biopsy results came in, everything was confirmed. I know it's agitating but you should wait for your biopsy results. From the description of the MRI something is up for sure. Your descriptions about how your breast feel sound like something is up too. Be demanding about scheduling your biopsy ASAP! Basically both breasts have masses in them that are abnormal and with your BIRDS score I'm suspecting something . The MRI is very descriptive enough to tell the reader about activity seen in breast. The note about the lymph node is important as well, this could indicate node involvement if this is malignant. I wish I had the power to tell you but I dont. The good thing is you went to the your provider when you notice things weren't normal. Discharge, sizing changes are signs of something, we don't know yet but its something. I have dense breasts and detecting anything wether being or malignant was hard. An MRI, ultrasound and biopsy was needed. In most cases that is the protocol I believe. You must attempt to stay calm and collect ALL the information you can once your biopsy results come in. There is network here of folks to support you! Keep us posted!! Thinking of you!",
      "MessageIndex": 1,
      "PostDate": "20/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/835915",
      "Title": "MRI shows 20 x 5 x 5 mm elongated mass! Daliddle1 Daliddle1"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Oct 11, 2015 12:27PM Jinx27 wrote: I would get another opinion or speak to your dr again. I had an indentation and thought is was a benign and that wasn't the case. My gyn and gp assumed it was benign, a third gp suggested I go for imaging. It took a breast surgeon to find it and biopsy it. Keep investigating until it has been confirmed! Best wishes to you ☺",
      "MessageIndex": 1,
      "PostDate": "11/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/835680",
      "Title": "mammogram clear but still worried as indent on breast Busymum2015 evey40"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Dec 19, 2015 08:20AM Jinx27 wrote: Busymom2015, I have been thinking about you! This is EXCELLENT news!! If its not malignant, than can they remove it, or are they wanting to let it rest if it isnt ? Im hoping for great results!",
      "MessageIndex": 68,
      "PostDate": "19/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/835680",
      "Title": "mammogram clear but still worried as indent on breast Busymum2015 evey40"
    },
    {
      "AuthorID": "Jinx27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221135/profile",
      "Content": "Oct 12, 2015 04:03PM Jinx27 wrote: Best of luck Busymum, I'm not convinced yet either! Find a breast center or a cancer center and have them give you an opinion. It could be another benign mass. I want them to confirm if it is or isn't. My indentation was at 5 o clock on left breast and was only seen when my arms were by my side. They thought it was fibroadenoma, then lobular cancer but then initial path report from the biopsy said ductal carcinoma. Keep Pushing! I'm praying for the best for you!",
      "MessageIndex": 10,
      "PostDate": "12/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/835680",
      "Title": "mammogram clear but still worried as indent on breast Busymum2015 evey40"
    }
  ]
}