{
  "AuthorID": "jivon",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129994/profile",
  "Posts": [
    {
      "AuthorID": "jivon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129994/profile",
      "Content": "jivon wrote: Hello, My mother is an 11 year breast cancer survivor. YAY!  (She was in her late 50s when diagnosed). I am 47 yrs old. On May 12, I experienced shooting pains in my right breast. I experienced this pain off-and-on for a couple of hours. The pain immobolized me each time. I was terribly concerned, but because the pain went away after a couple of hours, I did not worry too much about it. On May 29, I began experiencing pain and discomfort in my right breast. It feels achy and like a knot is buried deep in my breast.  I do not feel a lump. I know what many people think . . .breast cancer does not cause pain. Well, my mom experienced pain, and a couple of months ago my paternal aunt (81 yrs old) was diagnosed with breast cancer and she had tremendous pain before the lump finally appeared. Thoughts? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/769714",
      "Title": "Painful, uncomfortable breast jivon CameoBarbie"
    },
    {
      "AuthorID": "jivon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129994/profile",
      "Content": "jivon wrote: Hello, My mom is an 11 yr breast cancer survivor. She was diagnosed in her late 50s. My paternal aunt is 81 yrs old and was diagnosed with BC 2 months ago. They both experienced pain prior to diagnosis. My right breast began hurting on May 12 when I felt shooting pains that immobolized me. This went off-and-on for about 2 hours. On May 29 I started feeling a deep rooted pain in my right breast. It is achy and uncomfortable. The pain is constant. There is no lump that I can feel, Suggestions? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/769715",
      "Title": "Are my symptoms worthy of concern? jivon bdavis"
    }
  ]
}