{
  "AuthorID": "jjhegreen4",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68002/profile",
  "Posts": [
    {
      "AuthorID": "jjhegreen4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68002/profile",
      "Content": "Jun 11, 2008 09:49AM jjhegreen4 wrote: Thank you all for your responses.  We are going to keep working the doctor until we get responses other than what we have received to date.  I just want them to tell me what's going on so we can deal with whatever is going on. Hopefully, it's nothing but my fear is that the doctor will come back 6 months - 1 year from now and say that \"We found this and if only we would have taken the biopsy in June, we could have addressed it sooner.\" ",
      "MessageIndex": 6,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707076",
      "Title": "Concerned husband jjhegreen4 jjhegreen4"
    },
    {
      "AuthorID": "jjhegreen4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68002/profile",
      "Content": "jjhegreen4 wrote: My wife has a history of \"female-related\" issues.  Many, many surgeries to clean-up endometriosis.  Shortly after our second child was born, they tried a partial hysterectomy (uterus only) and then when the endo/cysts kept coming back, they tried some other things but ultimately they took her ovaries.  They put her on the climara patch because she was 30.  Still, the pain continued (on a cycle) so another doctor went in and found an active piece of ovary.  She removed it and kept my wife on the climara.  Around 2 months after this surgery, she starts having issues with her breasts.  She is tired, has noticeable lumps, tenderness, heaviness and is now lactating.  She had a mammogram at her doctors office and they rush ordered an ultra-sound at the hospital.  They saw something, (they had to, because we both can feel it), but they did not biopsy it for some reason.  They only said that they want her back in 6 months for a follow-up mam/ultra-sound.  I am concerned that they didn't complete the testing.  No answers as to what it could be.  Just told to wait. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707076",
      "Title": "Concerned husband jjhegreen4 jjhegreen4"
    }
  ]
}