{
  "AuthorID": "jjwarner",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147911/profile",
  "Posts": [
    {
      "AuthorID": "jjwarner",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147911/profile",
      "Content": "Mar 28, 2012 11:22PM jjwarner wrote: Her MO said that it takes 6-10 days for neulasta to take its full effect and should not be given with chemo. It could do more harm.   If she was getting chemo every two weeks then it would be fine. She is going on vacation and wanted to get a treatment next week since she is missing this week, so I think that was why he didn't want to give her the shot.  I asked about neupagen but he didn't like that idea either.  I know it is a daily shot so it doesn't stay in your system as long. It was a very confusing visit and very upsetting to her. ",
      "MessageIndex": 5,
      "PostDate": "28/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784869",
      "Title": "Questions on treatment options jjwarner Leah_S"
    },
    {
      "AuthorID": "jjwarner",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147911/profile",
      "Content": "Mar 28, 2012 11:25PM jjwarner wrote: When she was first treated for BC two years ago, she took avastin, taxatere, and something else.  Sorry, I can't remember.  Will they treat you with a chemo you have previously taken?",
      "MessageIndex": 6,
      "PostDate": "28/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784869",
      "Title": "Questions on treatment options jjwarner Leah_S"
    },
    {
      "AuthorID": "jjwarner",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147911/profile",
      "Content": "jjwarner wrote: My friend has Metastic TN.  She has had WBR for brain mets, Carbo with Gemzar, Havalan, and now on Navelbine.  She has a very good MO but has never recommended anything other than chemo.  She has cancer in the chest area, bones and liver.  He told her if Navelbine does not work there isn't much else he can do.  Her liver functions are still good but slowly creeping up and white cell count too low to get chemo.  We asked for nuelasta and he said \"no\"  My mom went through this and her doctor gave her nuepagen shots so she could continue chemo.  Have other's received nuepagen during chemo? Can you try a chemo that you have already had but was two years ago?  Still wants to fight and after her appoinment yesterday, I feel like the doctor has given up.  Everytime we bring up something like liver radiation or other things we have read about, he just says he is not fond of that.  Should she get a second opinion or is this typical?  She is only 38 and my best friend. My mom lost her battle a year ago. Just doing everything I can for her. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784869",
      "Title": "Questions on treatment options jjwarner Leah_S"
    }
  ]
}