{
  "AuthorID": "Jk1979",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249464/profile",
  "Posts": [
    {
      "AuthorID": "Jk1979",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249464/profile",
      "Content": "Jk1979 wrote: Hi, I was hoping someone out there may have some answers for me. I was diagnosed with Grade 3 invasive mammary carcinoma on 3/17. I'm only 37 years old and have no family history of breast cancer aside from my mothers grandmother which is pretty far down the line. It has gone to my lymph nodes as well. I see an oncologist tomorrow and Friday as well as the genetic counselor tomorrow. My question is, even if I test negative for this gene, can I still have a double mastectomy, covered by insurance? My treatment is going about to be 9 months to a year according to the surgeon and clearly I don't want to do this again in 10 years. Anyone out there been in this situation? I would hope that they would take my age into consideration. Please let me know. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853823",
      "Title": "New Diagnosed-No family history-double mastectomy options Jk1979"
    },
    {
      "AuthorID": "Jk1979",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249464/profile",
      "Content": "May 15, 2017 02:04AM - edited May 15, 2017 02:05AM by Jk1979 Hi. So I'm right now undergoing the \"red devil\"... one more cycle before an 8 week weekly cycle of I don't remember what's next. My tumor is about 2 inches big and within my duct. I'm not looking for any sort of firm answers but all I keep getting going into the oncologist is nothing. No answers. They don't know what stage (thinking IV)and quite frankly I don't blame them for not giving me survival odds yet. I'm only 37.Surgery has to be done first so see how many lymph nodes exactly. Surgery should be done, according to my calculations, end of July, early August. What do you all think? I'm pretty sure it's a stage 4. My grade is at 3. I know its in my lymph nodes and last PET there was no movement to my organs but have had a bad cough for about a week where I'm leaking urine. I'm scared to death right now...",
      "MessageIndex": 4066,
      "PostDate": "15/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Jk1979",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249464/profile",
      "Content": "Mar 29, 2017 06:23PM Jk1979 wrote: Thank you for your reply. I am doing the same thing. I'm going to where I was diagnosed for the initial oncology appointment and then I'm going to Sloan Kettering on Friday. It's just the weeks of so many questions, not many answers that is driving me crazy. If I get any firm answers from Sloan (since they are the best) I will send you feedback on Friday evening. My appointment there isn't until 4:40pm.",
      "MessageIndex": 2,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853823",
      "Title": "New Diagnosed-No family history-double mastectomy options Jk1979"
    }
  ]
}