{
  "AuthorID": "jklls",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89755/profile",
  "Posts": [
    {
      "AuthorID": "jklls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89755/profile",
      "Content": "Sep 26, 2009 05:31PM jklls wrote: Ok guys,  Being a radiation therapist I have never heard of henna tattoos. This is something i need to look into. I have always either given tattoos or used the tegaderm on top of the sharpie marks.  As for not removing them I think that if you have one that is in open sight for everyone to see have a punch biopsy done and remove it.  You will still have the scar but not the tattoo.  I think treatment tattoos should be very small and only come up in conversation if your are at a nudist camp.",
      "MessageIndex": 14,
      "PostDate": "26/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/740510",
      "Title": "Using ink instead of tattoos -what wont rub off ? MTG jklls"
    },
    {
      "AuthorID": "jklls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89755/profile",
      "Content": "Nov 11, 2009 11:14PM jklls wrote: Hello, I thought I would just add in my 2 cents.  They may not be worth much but here they are.  I am a Radiation Therapist.  The reason they don't put a lead apron on you before treatment is because if they did, it would slow down the energy of the beam and that would cause more scatter and your body would absorb more of a dose.  Radiation dose not scatter through air.  Rad techs do not think you are \"stupid.\" but may not know what areas are being treated on you internally.  There may be scatter to your stomach if they need to treat lower on your chest to cover all the breast tissue but that may be specific to your case and not other persons. As for your throat being burnt, that can happen if there is treatment to the super clavicle area.  Depending on how your head is turned, your throat can get some radiation.  Your doctor can show you pictures of how it your treatment was planned off of your CT (or cat scan) but if your therapists didn't check your chin position, it be turned into the treatment field.  As for me, Yes, I would have radiation.  It is much better choice than having mets.  No one should have to ever go that.  In the end, it is a personal choice and one that only you can make, Good Luck and bless you during this time.   ",
      "MessageIndex": 9,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/742143",
      "Title": "Radiation scatter? linn56 jklls"
    }
  ]
}