{
  "AuthorID": "jkmoumouni",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246827/profile",
  "Posts": [
    {
      "AuthorID": "jkmoumouni",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246827/profile",
      "Content": "Feb 10, 2017 07:52AM - edited Feb 10, 2017 07:54AM by jkmoumouni Thanks for the welcome..Im also on Arimidex (anastrozole), I seem to have a lot of side effects. Does anybody else experience any side effects from this med?",
      "MessageIndex": 57,
      "PostDate": "10/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797780",
      "Title": "Pain in lumpectomy site years later Rachel1 mom2bunky"
    },
    {
      "AuthorID": "jkmoumouni",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246827/profile",
      "Content": "Feb 9, 2017 06:13PM jkmoumouni wrote: In Oct 2016 I was diagnosed with IDC Stage 1 then I Had a Lumpectomy and 6 Sentinel Lymph nodes removed 11/11/16. Also had 5 days of Brachytherapy ( Radiation) Everything went rather smoothly for me considering the ordeal we go through for this situation.. However of late ( 12 weeks after surgery and radiation) I'm starting to have pain/ achiness and tenderness in the upper fuller part of my breast ( not the surgery site) and the tingling and jagging sensations off and on as well. I'm not sure if this is from the internal radiation devise that was used for my treatment or just some healing going on. Also my under wire bra seems to be really causing me some discomfort on the side of my breast where the wire ends. The tissue under my skin seems bruised a bit. So Ive gone back to wearing a sports bra most days. But they just aren't as supportive when you have large breasts. I have been starting to worry myself sick about the pain just like the rest of you. I'm seeing my Radiation Oncologist for a follow up in 3 weeks so I'm praying he just tells me its tissue and nerves healing. Thanks for the posts/threads they really help to comfort a fellow survivor.",
      "MessageIndex": 55,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797780",
      "Title": "Pain in lumpectomy site years later Rachel1 mom2bunky"
    }
  ]
}