{
  "AuthorID": "jla12",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67512/profile",
  "Posts": [
    {
      "AuthorID": "jla12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67512/profile",
      "Content": "Jun 6, 2008 07:45PM jla12 wrote: Hi Anne, Acutally I never had breast cancer. The enlarged lymph node doesnt seem to worry anyone, its about 1 5+ CM..they said at 2 CM, they get concerned. Ugh.. I just got my MRI results yesterday and it does see the growth under the breast implant, and the MRI is inconclusive, recommended Biopsy. My plastic surgeon wants it out as do I and I am seeing another surgeon to remove it this coming Tuesday. Will have to go without the implant for about a week until the results are in, and if all goes well, I will have a new one put in, or maybe a complete Newer Model Set! I am going to talk to this new surgeon I am dealing with about the lymph node. What do you think? Can I have it just biopsied or do they have to remove it? I also have to go for a complete pelvic floor reconstruction and hysterectomy in the next couple of weeks...... Jackie   ",
      "MessageIndex": 6,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/706395",
      "Title": "Lump on Rib Beneath Implant jla12 jla12"
    },
    {
      "AuthorID": "jla12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67512/profile",
      "Content": "jla12 wrote: I just had an MRI because of a lump on my rib beneath my left implant. I had been having a dull ache now and then, and sometimes a sudden sharp pain when I move a certain way which made me decide to reach under the implant to see if something was there. I found a hard lump attached to my rib. When I first touched it, the pain jolted right through me, (I'm not sure if I disturbed it somehow or slightly moved it) but it did hurt. I can touch it now without much pain at all now wince the initial time I found it. Its VERY hard, yet not quite as hard as my rib. I really have to move the implant out of the way to get to it. I don't know what made me look, but something told me to check. MY jaw just about dropped when I felt it. I am supposed to go regularly about every 8 - 12 months for a mammo because of some areas on the left breast they are just watching as a precaution. But being the bad patient, I didnt go for the last 3 years until now. Ugh....  I can feel it at times like there is something there when I am laying on that side, or move just the right way. I think its about a 1/2 to 1 inch in width and 1/2 inch in height from the rib. I have an appt with a surgeon recommended by my plastic surgeon who feels it should come out regardless what it is. I jut had a mammo and ultrasound but they can not detect or see blow the implant ( the implant is below my muscle ) so that why I Had the MRI. Just waiting to see the surgeon, and wondered what anyones thoughts are on this. The fact that it is attached to my rib is what concerns me. Thanks  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/706395",
      "Title": "Lump on Rib Beneath Implant jla12 jla12"
    },
    {
      "AuthorID": "jla12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67512/profile",
      "Content": "May 29, 2008 12:34PM jla12 wrote: Thank you June. I'm staying very positive. I failed to mention that I've had an enlarged Lymph node under the left arm ( same side as lump on rib ) for approx. the last 3 years. Dr's didn't seem to concerned about it because it wast just over 1.5 cm, and they don't get concerned until it hits 2 cm. However, I'm a very small person, and I still wonder about all this.  UGH! Jackie ",
      "MessageIndex": 2,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/706395",
      "Title": "Lump on Rib Beneath Implant jla12 jla12"
    },
    {
      "AuthorID": "jla12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67512/profile",
      "Content": "May 29, 2008 03:39PM jla12 wrote: Hi Shirlann Actually I'm pretty positive about all this. The Dr. said its a tumor, but they feel it's benign by the way it feels. I have implants so I have to take the left one out to remove the lump. My Plastic Surgeon said I will probably have to go like that for a bout a week until the results of the biopsy come in. Eh...it's like changing a tire, no big deal. But what do you think of this englarged node under my arm all this time. No one seemed to want to test it. Jackie ",
      "MessageIndex": 4,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/706395",
      "Title": "Lump on Rib Beneath Implant jla12 jla12"
    },
    {
      "AuthorID": "jla12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67512/profile",
      "Content": "Jun 8, 2008 07:32AM jla12 wrote: Hi! They are sure its a tumor of some sort, hopefully benign however there are some suspicious indicationa. Its attached to a rib which sort of scares me. So they have to remove my left implant to get to it, and hopefully if the biopsy comes back clear, my plastic surgeon can replace the implant. I do have a swollen lymph node like you mentioned under my left arm too..for a few years now. It cant be missed, its just under 2 cm and very palpable. I hate the idea of taking it out to biopsy because I am an avid golfer and I dont want it to screw up my game. You probably think I'm silly to worry about it, but its the one thing I really enjoy and do for myself. Jackie ",
      "MessageIndex": 8,
      "PostDate": "08/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/706395",
      "Title": "Lump on Rib Beneath Implant jla12 jla12"
    }
  ]
}