{
  "AuthorID": "Jld03",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186364/profile",
  "Posts": [
    {
      "AuthorID": "Jld03",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186364/profile",
      "Content": "Oct 9, 2013 09:32AM Jld03 wrote: I admit I was frightened at the thought of the wire localization, only because I felt it wasn't explained really well in advance. Once I arrived at daysurg, the nurses were great and really explained it. I had to wait about an hour because another lady was also having it done and she was scheduled before me. They sat me in a private area, in a lounge type bed, with blankets, tv, lots of attention. The wire localization itself probably took about fifteen minutes. They sat me in a tall, straight backed chair pushed up to the mammogram machine. They took a couple of pictures to check the location and the previously placed clip, then gave me a numbing injection, which I did not feel, then placed the wire. I didn't feel a thing. Then they covered the wire with sterile gauze, led me back to pre-op, where I waited another fifteen minutes or so before having my excisional biopsy. I thought I was going to have conscious sedation for the excisional biopsy, but when I arrived at preop, the anesthesiologist told me he had decided to use general instead.",
      "MessageIndex": 1,
      "PostDate": "09/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/812556",
      "Title": "Why do they tell you one thing then it changes at pre-op appt?? gtgirl gtgirl"
    },
    {
      "AuthorID": "Jld03",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186364/profile",
      "Content": "Aug 24, 2013 07:50PM Jld03 wrote: Oh, hugs on the menopause symptoms. I never took HRT so I went through that three years ago. one reason i was so dismayed to get the hot flashes back again, and the mood swings. Yuck. I am definitely having pain in my wrists and hands, which go numb frequently throughout the day--and at night as well. My MO said that by the ninety day mark, the SEs should start to get better, mostly because the brain gets used to the level of pain and starts to ignore it. If you can make it to the ninety day mark, he said, you should be able to do the five years. I was really surprised how quickly the SEs started. I foolishly thought it would take a couple of months before they kicked in. I take Tylenol or Ibuprofen to help me get everyone done. However, I have noticed over the last couple days that the pain does seem to be getting a little better. Not gone, but definitely better. Now if the mood swings would go with them... I am noticing the dryness issue, as well, but stupidly didn't put two and two together. What treatments or supplements are you using to help with that? As for supplements, i'm taking 1800 mg CA and 1000 mg D3, a multi vitamin and flax seed oil. My bone density was normal going into this and I am praying every day that it stays normal throughout. I also wish you good luck with your decision, MelissaDallas.",
      "MessageIndex": 5,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/809525",
      "Title": "On Aromasin for high risk instead of to prevent recurrence? CBrown107 Jld03"
    },
    {
      "AuthorID": "Jld03",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186364/profile",
      "Content": "Aug 25, 2013 08:36PM Jld03 wrote: As would I. I'm slowly making my way through the \"life on Aromasin\" thread. A lot of useful information there. Thnx.",
      "MessageIndex": 11,
      "PostDate": "25/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/809525",
      "Title": "On Aromasin for high risk instead of to prevent recurrence? CBrown107 Jld03"
    },
    {
      "AuthorID": "Jld03",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186364/profile",
      "Content": "Sep 2, 2013 07:47PM Jld03 wrote: My SE's are definitely getting better. I still get achy, headaches, mood swings and numbness in my hands, but it's definitely better. Tolerable. How about you? I hope you are doing well.",
      "MessageIndex": 13,
      "PostDate": "02/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/809525",
      "Title": "On Aromasin for high risk instead of to prevent recurrence? CBrown107 Jld03"
    },
    {
      "AuthorID": "Jld03",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186364/profile",
      "Content": "Aug 22, 2013 10:15PM Jld03 wrote: After a surgical biopsy showed \"ADH approaching DCIS,\" I started Aromasin on June 29th for risk reduction. The side effects for me started pretty much right away. Mostly aches and pains in my muscles and joints, especially my ankles and legs, coupled with a general feeling of weakness in both my arms and legs. Hot flashes, headaches, and difficulty concentrating round everything out. Lately, I've started taking the med at supper, rather than breakfast, in hopes the worst of the aches will happen while I sleep. It's too soon to tell if it's helping yet, but I have hope that I'll get some relief. My oncologist assures me that this is as bad as the side effects will get. It was a difficult decision, especially considering the potential of Aromasin to weaken my bones, but my risk was high enough that I was willing to give it a try. How about you? How did you make your decision? Have you noticed any side effects yet?",
      "MessageIndex": 1,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/809525",
      "Title": "On Aromasin for high risk instead of to prevent recurrence? CBrown107 Jld03"
    },
    {
      "AuthorID": "Jld03",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186364/profile",
      "Content": "Oct 17, 2013 03:32PM Jld03 wrote: So happy to hear your good news, momoshki, and happy you got your results right away. I don't get mine until Monday with my BS, but I didn't get a call back from the mammo center for more pictures (the first time in over two years), so I'm thinking that's good news. Good luck with your tests today, momcat. Will be praying for good news.  Thanks, all, for your support and good wishes. It really means a lot.  ",
      "MessageIndex": 260,
      "PostDate": "17/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "Jld03",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186364/profile",
      "Content": "Oct 22, 2013 08:23AM Jld03 wrote: Sports mom, the only time I really thought about the amount of radiation I was being exposed to was during the stereotactic biopsy. They did two sites and they took so many pictures to make sure they got everything right and it did cross my mind that it was a lot of exposure in a small amount of time. But the six month follow ups are spread out over time, so no, I don't really think about it, as I really need the reassurance that early detection will save my life. I haven't even researched anything about the radiation levels because I'm going to have the mammos regardless and I just don't need another thing to worry about.  But that's just me.",
      "MessageIndex": 266,
      "PostDate": "22/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "Jld03",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186364/profile",
      "Content": "Nov 14, 2013 09:33PM Jld03 wrote: I've been taking exemestane for five months. Besides all the aches and pains it's given me, about a month ago, I began to suspect it was leaving me more than a bit depressed and foggy headed, but I soldiered on, sinking deeper into the blahs every day. Four nights ago, I finally decided to skip a dose. I haven't taken it since. The relief from the side effects has happened as quickly as the aches and pains came on. My head has cleared. I'm sleeping better, moving easier, feeling less crippled, easing into exercise again. What finally prompted me to skip the med wasn't even the depression, it was my hands continually going numb, then achey and tingly, like they were asleep and waking up. They burn and they hurt. I'm still feeling that, though not nearly as badly. I haven't called my MO yet. I suppose I could ask him to add in an anti depressant. But those have their own problems and I'm not sure I want to go that route, either. I don't think I would be worrying about this if my biopsy hadn't been borderline for DCIS. I know no one can answer this dilemma for me, so I'm not really sure what my purpose is in posting this. I guess I was just wondering if any of you have tried these medications, then changed your mind?",
      "MessageIndex": 275,
      "PostDate": "14/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "Jld03",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186364/profile",
      "Content": "Oct 11, 2013 09:14AM Jld03 wrote: I was on the six month follow up rotation for microcalcifications when they finally \"changed\" this year, leading to the stereotactic followed by excisional biopsy straight to \"ADH approaching DCIS\" land. I hate my diagnosis. It's not pure ADH. It's not quite DCIS. It's some wasteland in between, leaving me with plenty of questions and not so many answers. But it's not cancer, so I'm thankful every day. Today is my first six month mammo post biopsy and I feel a bit ambivalent. I fear the exemestane I'm taking is starting to leave me somewhat depressed.",
      "MessageIndex": 241,
      "PostDate": "11/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "Jld03",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186364/profile",
      "Content": "Oct 11, 2013 07:24PM Jld03 wrote: Thanks for the smile, sports mom. I kinda liked your metaphor :) After two years of having extra films and the radiologist looking at them immediately, my first post biopsy mammo was more than a bit anti-climactic. The tech simply took the pictures, then sent me on my way, with \"your doctor will get the report in a few days\". I see my BS on the 21st, but I assume if there's anything important in there, they'll call me in sooner for magnifications. Momoschki, thanks for sharing your experience with the second and third opinions all being different. It is frustrating and confusing. Are you on exemestane? Or one of the others? What are your side effects? When I first started with it, I had bizarre nightmares, but these lasted only a couple weeks, along with strong body aches, especially in my legs, knees, and feet, headaches, and the strangest feeling of general weakness all over. The achiness is not as severe now, but it is constant, worse after I've been sitting for any length of time, even a few minutes, and still that feeling of general weakness--I can't really explain it. My hands go numb frequently and I am always tired, always, and I've gained about twenty pounds. My MO said weight gain wasn't really a common side effect, but that I could be moving less because of all the pain, and that is definitely true. My DH never could keep up with me when we went walking together. Now I'm limping along like I 'm ninety. I don't see my MO for another four months. I'm not sure what I'm going to do, but I'm leaning toward not taking it. I plan to discuss it with my BS on the 21st and see what he thinks. God luck with your mammo on Monday. I wish you the same boring results as you wished me, lol.",
      "MessageIndex": 246,
      "PostDate": "11/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "Jld03",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186364/profile",
      "Content": "Oct 21, 2013 10:07PM Jld03 wrote: Finally got the results of my first post biopsy mammo today. No suspicious masses, etc, so I was very happy, but I do have a newly developed, never seen before microcalcification in the upper outer quadrant that surprisingly has left me in a strange mood. Not depressed, more like aggravated, I guess, when I should just be grateful that all is well. And I am grateful, but I 've driven this road before and even though it's just a lonely little microcalc at this moment, I know in a few months it will have spawned little friends to keep it company, blah, blah, blah. Now to keep from worrying about it until April. sheesh.",
      "MessageIndex": 265,
      "PostDate": "21/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "Jld03",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186364/profile",
      "Content": "Oct 25, 2013 09:46AM Jld03 wrote: Hi Mimi, sending you hugs and good wishes, hope and prayers, as you start your new journey. May you find all the love and support you need, both at home and here on these boards. I'm new here, as well, and I've never met a kinder, more generous, caring, thoughtful, supportive, and compassionate group of women, so willing to give of their time and their knowledge. ",
      "MessageIndex": 271,
      "PostDate": "25/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "Jld03",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186364/profile",
      "Content": "Feb 26, 2014 08:50PM Jld03 wrote: Last year, after my biopsy showed ADH, I struggled with the decision on whether or not to take a medication to reduce my risk, as I was really feeling pretty good at that time. I went through all the fear of if I do...and the fear of if I don't. I decided I would give it a try and see what happens. A lot of women suffer side effects, but a lot do not, as well, and I was hoping to be one of the \"no side effects\" gals.  No such luck. I went on exemestane and lasted six months. I had aches and pains all through my joints, and a good bout of depression.  I think I would have continued, but the holidays rolled around and the thought of everything I usually embrace with great joy (coking, baking, entertaining) left me wanting to weep. So I stopped. My oncologist said I could try another, and we briefly discussed tamoxifen, but eventually I decided against it, opting instead for surveillance. Now, i'm three weeks out from my next 6 month mammogram and i'm praying everything remains status quo.  But I don't regret trying the medication. I just couldn't justify spending five years feeling so badly when I don't actually have cancer, and might never have it. These are trying times, emotionally and physically, and my prayers are with all of you strugging with your decisions, whether they be for medication, or pbmx.",
      "MessageIndex": 315,
      "PostDate": "26/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    }
  ]
}