{
  "AuthorID": "jm4555",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77699/profile",
  "Posts": [
    {
      "AuthorID": "jm4555",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77699/profile",
      "Content": "Jan 14, 2009 06:34PM jm4555 wrote: That makes sense.  They put a drain in after the fact and I made them take it out after four days since I was still leaking and it had failed twice.  It seems logical  to sew me up and force my body to acclimate.  However, I am technically sewed up, but the incision is not closing.  My understanding is radiation is to blame for that.  This group of doctors is supposed to be the best, but I feel I am being treated to avoid lawsuits (not that I have ever sued anyone) as opposed to what is actually best for me.  I feel they are smart, but far too aggressive. That is another story altogether.  My first time around was in another city so this group is new for me and I am just not feeling good about my whole experience.",
      "MessageIndex": 5,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727233",
      "Title": "Never ending drainage jm4555 Pat634"
    },
    {
      "AuthorID": "jm4555",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77699/profile",
      "Content": "jm4555 wrote: My surgery scar never closed from my lumpectomy under my armpit.  Two weeks after surgery there was an explosion of liquid all over me.  Thankfully I was at home.  It has been 8 weeks and the opening is not closing and the amount of drainage is not slowing down.  My doctors are more confused than I am which is not at all comforting.  They expected it to stop weeks ago.  Has anybody else experienced this? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727233",
      "Title": "Never ending drainage jm4555 Pat634"
    },
    {
      "AuthorID": "jm4555",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77699/profile",
      "Content": "Jan 14, 2009 03:13PM jm4555 wrote: There is no infection.  It seems everyone else has the problem of fluid build up with the need for getting it drained.  My incision did not completely close after surgery so I continuously drain.  I could deal with it if it seemed to getting better, but it isn't.  They keep telling me it will stop eventually, but they seem as bewildered as I am.  I might add that this is my second go round and this area has been radiated before so I know that is slowing the process but 8 plus weeks seems extreme.",
      "MessageIndex": 2,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727233",
      "Title": "Never ending drainage jm4555 Pat634"
    }
  ]
}