{
  "AuthorID": "JMCrider29",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118046/profile",
  "Posts": [
    {
      "AuthorID": "JMCrider29",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118046/profile",
      "Content": "Jan 5, 2011 04:51PM JMCrider29 wrote: Thank you all for your kinds word. Fortunately, my father's side has no history of cancer. His side has the cardiac problems. A friend told me today that she had a friend who had cancer and she said without the support from ladies like you, she would have never gotten through it. I know my chance has doubled since my mother getting breast cancer and believe me, I'm going to be very vigilant at getting checked out. My mom goes for her three CAT scans (chest, abdomen, and pelvis) and a bone scan tomorrow. We are hoping they all come back negative but we have to take it one day at a time. Her pre-op bloodwork, including LFTs, was normal and so was her chest x-ray. We are just praying all of the cancer was removed and whatever may be left chemo and radiation will take care of it. P.S. My mom is actually taking this well. She hasn't really cried, that I've seen. She said she always kind of expected it to happen because of her family history. I have to say, I feel the same way.  But she did tell me last night that she doesn't plan on going anywhere :) Her spirits are good and she is such a strong woman. ",
      "MessageIndex": 5,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762929",
      "Title": "Significant Family History JMCrider29 JMCrider29"
    },
    {
      "AuthorID": "JMCrider29",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118046/profile",
      "Content": "JMCrider29 wrote: I just wanted to share my story and my recent concerns. Unfortunately, cancer (especially breast cancer) is not an unknown word in my family. My maternal grandmother died of breast cancer 7 years ago. My maternal aunt was diagnosed with ovarian cancer 9 years ago but she is in remission. Another maternal aunt was diagnosed with breast cancer 1.5 years ago and she is now in remission. Yet another maternal aunt died of pancreatic cancer 1.5 years ago. At the beginning of December, I learned that my mother has breast cancer. I just want to say, always go with your instincts. My mom said she felt a lump in her breast and she had a mammogram and an ultrasound done. They both did not identify a tumor. My mom was persistent though and they ended up doing a biopsy, which came back positive for cancer. They originally suspected it to be very small. She had a mastectomy with two sets of lymph node removal done on December 30. We just got back pathology reports today and it was actually 2.7 cm (as opposed to 9  mm which they originally thought). Cancer was also positive in 9 out of the 22 lymph nodes removed. She now needs chemotherapy and radiation. The tumor ended up being larger and more aggressive than any of the doctors suspected. So please, if you think you feel something, be persistent! DEMAND that your doctor does the necessary tests! I'm new to this site. I'm only 23 years old and I have a fear of developing a cancer that usually women do not generally need to even start worrying about they are 40 years old. I am supposed to go for mammograms starting at 25 opposed to 40. Really, I'm just looking for support of breast cancer patients/survivors or family members. This is a really difficult time for me and it's hard to discuss my fears with my mom when she has a plethora of fears herself. I am staying strong for her and I put on a strong face. I'm used to dealing with hardships and family grief (I'm also a nurse). I know there is a gene test BRCA1 and BRCA2, which my mother and two of her sisters had, all of which were negative for the gene. I know this means that I am negative as well, but I can't escape the fear/worry for my mom and myself.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762929",
      "Title": "Significant Family History JMCrider29 JMCrider29"
    }
  ]
}