{
  "AuthorID": "Jme2012",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156407/profile",
  "Posts": [
    {
      "AuthorID": "Jme2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156407/profile",
      "Content": "Jme2012 wrote: Of course I'm scared of getting the worst possible news. I am 33, married with one son age 4 1/2. I had a bilateral reduction in 2002 and have had no problems since. I have never had a mammogram until last week. My GP was doing a very thorough physical (she's awesome) when she said she felt some fullness/asymmetry in my left breast. She sent me for mammogram and ultrasound and they recommended a core biopsy. The only information I managed to think to ask was the size and I was told 8mm. According to the ACS risk assessment, my risk is 0.3% of developing breast cancer in the next 5 years. One of my best friends, same age with no kids or history, was diagnosed stage 2 IDC in Oct 2011...has had chemo, bmx, and rads and doing well. Of course I think if she can have it...I must also. She is going with me tomorrow an I have tons of family support but I'm scaring myself to death reading so many stories of young women being diagnosed. Mostly I'm afraid of never having another child which we were going to start trying in October. Thanks for listening, this is a wonderful site with so much information. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790602",
      "Title": "Biopsy Tomorrow... Jme2012 Jme2012"
    },
    {
      "AuthorID": "Jme2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156407/profile",
      "Content": "Jul 19, 2012 12:16AM - edited Jul 19, 2012 12:20AM by Jme2012 ",
      "MessageIndex": 6,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790602",
      "Title": "Biopsy Tomorrow... Jme2012 Jme2012"
    }
  ]
}