{
  "AuthorID": "JMJ532",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62254/profile",
  "Posts": [
    {
      "AuthorID": "JMJ532",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62254/profile",
      "Content": "Jul 30, 2008 05:03AM JMJ532 wrote: Hi Heather, I had two drains and major incisions in my bottom.  My doctors told me to wait 1 week before showering and then I could.  I wasn't feeling the best so I rented one of those seats that go in the shower.  I would sit on that with the shower water running down on me.  I put my drains onto the seat while I showered.  As well, on my butt incisions I put tegaderm (a clear like bandage to cover stitches). Just remember you have the drains on the seat and lift them when you go to get out of the shower--I forgot a few times and when I stood up my drains dangled--ouch! In the meantime, before showering, I had bought diaper wipes and used them to sponge bathe. Good luck, JMJ",
      "MessageIndex": 2,
      "PostDate": "30/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/714669",
      "Title": "showering with drains HeatherL PhyllisCC"
    },
    {
      "AuthorID": "JMJ532",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62254/profile",
      "Content": "Apr 24, 2008 04:16PM JMJ532 wrote: Hi, I was told by my BS that there is a 2% chance of cancer coming back (that is 2% more than someone without cancer) and that it would most likely occur in the chest wall or along the scar line if it were to come back.  I guess I'll be crossing my fingers for a long time! JMJ",
      "MessageIndex": 2,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/704527",
      "Title": "Recurrence after mastectomy??? HeatherBLocklear dtad"
    },
    {
      "AuthorID": "JMJ532",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62254/profile",
      "Content": "Jul 19, 2008 08:32AM JMJ532 wrote: HI Mare, What type of surgery are you scheduled for? I just had my fifth surgery July 15--had my tissue expander replaced with implant. I hate surgery!  As well, I get very nervous at pre-ops, too.  Maybe a mild sedative could help you when you get anxious (adivan); it helps me to relax. I also have to remind myself to take deep breaths and breathe.  If you have soft music that may help you too. My surgery went great!  Couldn't have gone better--some issues with anesthesia after effects but not to bad. Good luck to you.  Believe it or not, you will get through this!! JMJ",
      "MessageIndex": 4,
      "PostDate": "19/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/709298",
      "Title": "surgery is approaching mare5135 mare5135"
    },
    {
      "AuthorID": "JMJ532",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62254/profile",
      "Content": "Mar 31, 2008 07:04AM JMJ532 wrote: RJ62, Please let us know what you finally did.  Now that it is Monday morning.  Hope things went well!",
      "MessageIndex": 20,
      "PostDate": "31/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703036",
      "Title": "Drain tube broke!!! RJ62 RJ62"
    },
    {
      "AuthorID": "JMJ532",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62254/profile",
      "Content": "Nov 11, 2008 09:25AM JMJ532 wrote: I would think to have the SNB on both sides...after your mastectomy it is harder to get it done; I had just a right side mastectomy with SNB--no pain at all (of course, other than mastectomy).  I would think it is better to have it all done at once--just precautionary.  Good luck with whatever you decide! JMJ",
      "MessageIndex": 3,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724151",
      "Title": "Having Bilat Mast--SNB Just on DCIS Side or Both Sides? ASL momof3kidz"
    },
    {
      "AuthorID": "JMJ532",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62254/profile",
      "Content": "Aug 3, 2008 08:58AM JMJ532 wrote: HI, I waited about one month between surgeries.  Originally, I wanted to do it sooner but my surgeon wanted me to heal a bit. He felt it would do more harm going in to soon. Good luck, JMJ",
      "MessageIndex": 4,
      "PostDate": "03/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/718915",
      "Title": "Experience with re-excision? oldlady oldlady"
    },
    {
      "AuthorID": "JMJ532",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62254/profile",
      "Content": "Aug 5, 2008 11:01PM JMJ532 wrote: Hi, I agree with ckslow--bloody discharge is serious no matter how small.  This could be sign of DCis and does not always show up on mammo, ultrasounds, or even MRI.  My surgeon removed the duct the blood was coming from thinking it was an intraductal papilloma (usually non-cancerous about 90 percent of time. Well, I was unlucky 10 percent and it was DCIS. Please advocate for yourself.  Hopefully, it is just a papilloma. Let us know!",
      "MessageIndex": 8,
      "PostDate": "05/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/714646",
      "Title": "Bloody nipple discharge ccrider86 suz7731"
    },
    {
      "AuthorID": "JMJ532",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62254/profile",
      "Content": "May 13, 2008 09:07PM JMJ532 wrote: Hi, You may decide to go to a surgeon and see if you may need to have a duct removed; my nipple wasn't greenish discharge but rather a bit bloody.  I went in for an intraductal papilloma to be removed (no cancerous signs on MRI, mammogram, or ultrasound)--95% of time this was to be non-cancerous; unfortunately I was in the low 5%.  My surgeon was surprised at finding cancer--luckily it was found early! Do what you think is best for you.......remember that you are your own best advocate! JMJ",
      "MessageIndex": 5,
      "PostDate": "13/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/705482",
      "Title": "MRI Detection - Second Opinion? msrich110279 crunches1"
    }
  ]
}