{
  "AuthorID": "jmz",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136458/profile",
  "Posts": [
    {
      "AuthorID": "jmz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136458/profile",
      "Content": "Oct 16, 2011 04:33PM - edited Oct 16, 2011 04:38PM by jmz To all of the BC sisters here on this thread--  Thank You for all of your thoughts, ideas and encouragement. Your comments mean so much to the specific person may be writing to, but also to all of us who are reading and keeping up on everyone's progress.    My surgery is this Thursday and I have been reviewing for the second and third time this month what I may need in the hospital and what to expect afterwards. I live in Michigan and  I am a single mom of three college age children.  Three days after I officially became an empty nester-- I got called back for more mammogram pictures and then after that my diagnosis. I can say I am glad that none of my kids are here to watch me go through this. There are times I do get sad to be going through this alone- but wouldn't want either of my exes to be here either.  My kids are having some trouble handling all of this so far from home. My oldest is my daughter- lives in TX and is in med school there; next is my older son- he is about 2 hours away studying to be a pharmacist; and my youngest son is a freshman who is 3 hours away from home.  My older son is having the hardest time. He has decided to use my diagnosis as an excuse to go wild. I told him last week that his bad choices are making me stressed and sicker and that he needed to stay away from me until he got his act together. That was hard but what I felt I needed to do for me. I am not used to putting myself  and my needs first.  My parents and sisters have stepped up to the plate to take care of me after surgery and I could not be more thankful.  It has been hard to accept help- usually I am the one doing the helping for others.      The big puzzling thing for me is what bras/camis may I need afterwards. I will have TE. My PS hinted that I may come home with nothing- no compression vest or anything.  I have read through and found so many good suggestions from many of you. Thank you!  ",
      "MessageIndex": 908,
      "PostDate": "16/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "jmz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136458/profile",
      "Content": "Oct 8, 2011 01:33AM - edited Oct 8, 2011 01:34AM by jmz jmz-  October 20- BMX with TE",
      "MessageIndex": 618,
      "PostDate": "08/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    }
  ]
}