{
  "AuthorID": "joaniji",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
  "Posts": [
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 17, 2009 08:12AM joaniji wrote: LuAnn, sorry to hear that there has been some progression.  It is hard news to hear and I feel for you.  It does seem that because the bone lesions are improving, that some elements of the treatment are working - this is good.  Perhaps shaking up the protocol for a bit is not such a bad idea.  Knock the cancer out of the node and then back to hormonals?  It sounds like you have a very competent doctor and your own tremendous knowledge to trust.  Do what gives you the most peace of mind.  I wish you the best in this journey. Take good care.",
      "MessageIndex": 14,
      "PostDate": "17/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737534",
      "Title": "Progression on scans - need advice LuAnnH mom2acat"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 26, 2011 02:53PM joaniji wrote: After my mastectomy and reconstructive surgery six years ago, I had to have fluid drained several times.  The procedure wasn't painful (have your doc. use lidocaine first) and I felt much better after the fluid was removed.  I am a bit puzzled as to why you would be having this problem now, so long after your surgery.  I know that sometimes scars and the tissue around a scar can become necrotic (dead) and that this tissue can feel thick and full.  Sounds like you have a number of questions to ask. I truly hope that this issue clears up quickly and is not related to a new metastases. Best wishes to you.",
      "MessageIndex": 2,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772189",
      "Title": "Fullness on side of surgery caall1234 K-Lo"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 10, 2009 11:16AM joaniji wrote: Congrats on 5 years Janis.  We seem to share the same time line - here is hoping that we can continue on for many more years doing the things we love to do!!  I really appreciate your post as I was getting stuck looking at my cancerversary in a more negative light.",
      "MessageIndex": 11,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745176",
      "Title": "My five year cancerversary is this week. Fitztwins sushanna1"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 2, 2009 09:14AM joaniji wrote: Hi Liz, I am on Aromasin as well and definitely have had periods of brain freeze!  I don't know if you had already reach menopause or if you have been on something like Lupron to induce menopause but for me, I found that the dramatic loss of estrogen has messed up my memory.  The worst thing for me is to park in a big parking lot and then to forget where my car is!!  Maybe the Aromasin is not the right med for you?  What did I just say? (only kidding).  I guess some humor is needed to cope.  My mother swears that by doing crosswords and word puzzles her memory has gotten better.  Maybe we should try this!  you are not alone. Joani ",
      "MessageIndex": 4,
      "PostDate": "02/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738272",
      "Title": "AM I LOOSING MY MEMORY? ead activern"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 7, 2009 02:08PM joaniji wrote: Hi Heather, I don't really have an answer to your question because I am wondering the same thing!  I have had fluid in my ear and ear drainage recently and am planning to ask my onc. this week at my appointment.  I certainly hope for both of us that this is simply an annoyance and not indicative of the cancer!!  Please don't worry about asking questions because as you can see, your questions are often the questions of others. I thank you for asking your questions - I just wish that I could help with this one.   I am thinking of you and hoping that you feel better soon. ",
      "MessageIndex": 1,
      "PostDate": "07/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735466",
      "Title": "??? hezzy heatherpalmerton"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "May 22, 2010 08:34AM joaniji wrote: Maybe this is a ridiculous question but bear with me - I am self-employed as a therapist and have greatly reduced my hours over the past few years.  Now I work under ten hours a week and am a full-time mother.  What happens to stay at home mothers when it comes to SSD?  Does anyone know if women at home (whom should earn 110,000 dollars!), can qualify for SSD?  Thanks for thinking about this. Joani ",
      "MessageIndex": 43,
      "PostDate": "22/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752731",
      "Title": "SSD QUESTION Fitztwins blondiex46"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 28, 2010 01:24PM joaniji wrote: I have no wise words for you but I do have a lot of compassion which I am sending your way.  It must have been so awful to read your doc's letter.  Somehow when things are written down they become far more scary.  I wish that you didn't see the letter because even the best of docs don't know everything.  I suggest to you that you do whatever you can to nurture yourself through this painful time.  If you don't agree with the doc. then do whatever you can to disregard his words! It sounds like you aren't ready to view your life in such shortened terms - the best enemy against this may be to live your life as best you can,  doing the things that bring you happiness.  Please know that you are being thought of and that warm wishes are being sent your way.  ",
      "MessageIndex": 13,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747297",
      "Title": "\"Frank conversation...\" Dee2810 candy14510"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 19, 2010 10:09AM joaniji wrote: Hi Robin, I am so glad to hear that your first treatment with Gemzar went smoothly and that, so far, you are feeling well.  I truly hope that this treatment is successful in returning you to the symptom free position you were in one month ago.  I hope that you are still able to take your trip to Israel.  Have you been before? Best wishes, Joani ",
      "MessageIndex": 144,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755270",
      "Title": "The prognosis in not good RobinWendy BrokenHeart"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 15, 2010 02:38PM joaniji wrote: Dear Robin, I am just chiming in to extend you my support. I am so sorry that this is happening to you.  I can't imagine how difficult it must be to now have Dr. Winer's prognosis in your mind.  I am having such a hard time integrating his thoughts with the vital and seemingly symptom free (until recently) woman we all know you to be.  If you don't mind, I will go back to imagining you as the strong, capable, compassionate and bright woman full of zest for life that I know you to be.  Perhaps if we all keep alive the Robin we know you to be, we can collectively wish away your pain and blast those liver tumors out the door.  I am so glad to hear that you are able to return to yoga, it sounds like it is helpful to you.  Please know that you are in the thoughts and hearts of many.  Wishing you the best, joani ",
      "MessageIndex": 100,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755270",
      "Title": "The prognosis in not good RobinWendy BrokenHeart"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 2, 2010 01:18PM joaniji wrote: Hi Renee, I can completely relate!!  I have a number of bone mets, some are stable and some appear to be healing.  While I don't usually take pain meds., I do have a prescription for Norco to take when needed.  I find the pain seems to come out of the blue - most of the time it is just a nagging sensation but then sometimes it is an ache.  I think that it is worse in the damp, cold weather.  The strangest thing is that sometimes I could swear that I have pain where I don't seem to have mets. Basically, I am stiff until I get moving.  Is this the same for you?  I am sorry to hear that you are in pain, I wish I had a solution for you(me).  Wishing you the best. ",
      "MessageIndex": 7,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747723",
      "Title": "Pain Reneepals 33skidoo"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 27, 2010 12:27PM joaniji wrote: Great news Rachel.  I just want to second Elizabeth's email - the lower the number the better! A tumor marker of 39, according to my doc. is just within normal range.  The fact that the marker number has decreased is a positive indicator that the treatment is working.  Congrats. May your improved health continue!!",
      "MessageIndex": 3,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747443",
      "Title": "PET scan SUV ratings rpailleret rpailleret"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 20, 2009 12:24PM joaniji wrote: Sending you lots of good wishes, warm hugs and good karma.  I hope that you have a swift recovery and are soon comfortable and sniffing the flowers!  Just a note though on the need to make the negative positive -  I understand that this is a survival method but I certainly appreciate how hard it is to always find the silver lining in a rotten situation.  Please know that we all have empathy for how scary and frustrating your experience must be.  Best wishes.",
      "MessageIndex": 14,
      "PostDate": "20/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736197",
      "Title": "STUPID BRAIN! DARLENEDENISE EGAL"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Mar 15, 2011 05:54PM joaniji wrote: Glad to hear that you managed the first treatment with your fantasies and good humor intact!!  Wishing you best as the treatment progresses!",
      "MessageIndex": 153,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766178",
      "Title": "Zappity Do Da - My WBR konakat konakat"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 6, 2011 06:02PM joaniji wrote: Just chiming in to wish Lynn the best tomorrow.  I know that this is such a difficult time for you both and that hearing your beloved wife considering ending treatment is certainly not what you want to hear but, at least you have such a loving relationship that you can talk about these things together.  May comfort and healing come to you both. Joani ",
      "MessageIndex": 18,
      "PostDate": "06/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764332",
      "Title": "Round 4 Redux Bernicky nancyh"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Apr 4, 2011 01:42PM joaniji wrote: I did have pain from bone mets so it wasn't surprising to me when they were diagnosed on the PET.  I think that it really varies from person to person as to whether pain is felt.  I know that it is so scary to be left waiting for results of a scan.  I also fear discovering on a PET that the cancer is spread.  At least with the bone mets, I feel the pain therefore aren't surprised.  I don't know whether you are in pain at all - I hope not.  Let us know how the Pet goes if you like.  Wishing you the best outcome, Joani",
      "MessageIndex": 2,
      "PostDate": "04/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/767074",
      "Title": "does it require symptoms Polyana Mazy1959"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 4, 2010 05:43AM joaniji wrote: Sorry to hear about the infection but I am glad that it doesn't seem to have gone inside - that is a relief.  It is such a bummer when the thing that is supposed to make life more comfortable, acts up.  It just doesn't seem fair.  Good luck and plenty of wishes for speedy healing. Joani ",
      "MessageIndex": 14,
      "PostDate": "04/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758854",
      "Title": "Port Infection / UGH Reneepals X3sMom"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 22, 2010 03:09PM joaniji wrote: Hi Bonnie, Unfortunately, I don't have much to add on the tumor marker subject. My numbers have stayed fairly consistent over time. I really just wanted to extend my empathy to you.  I would imagine that after 7 years of stable numbers, the recent elevation, is pretty darn scary.  It is so hard to live with fear - I hope that you surround yourself with comforting people and things until your scans come back and you have more detailed info. on your health.  Please know that whatever happens, support is flowing your way.  ",
      "MessageIndex": 11,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747104",
      "Title": "Tumor markers WAY up BonnieVA tami444"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Mar 2, 2011 09:29AM joaniji wrote: Fantastic news!  please don't hesitate to post your good news.  You are cared about and valued and we all want you to be as healthy as possible.  I hope that you get your uti taken care of - wishing you continued stable health!",
      "MessageIndex": 24,
      "PostDate": "02/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765595",
      "Title": "Bit of Good News ..TMs keep going down! JeninMichigan Marybetz"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Apr 3, 2011 06:38PM joaniji wrote: Fantastic news - Yeah!!  Enjoy your improved health.  May it last a long long time!",
      "MessageIndex": 35,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766950",
      "Title": "Just got a call IwillBhealed vickib"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 1, 2009 11:36AM joaniji wrote: Glad to hear that you are still NED -- how wonderful.  I think that it is standard for women to be told to take Calcium while on Zometa.  I was told to take 600mg but to tell you the truth, I forget most of the time!!  Best wishes for continued good health.",
      "MessageIndex": 2,
      "PostDate": "01/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741306",
      "Title": "Zometa and calcium vivo Chelee"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 1, 2009 06:26AM joaniji wrote: Vivo - What marvelous news!  May good health continue for a long long time.",
      "MessageIndex": 6,
      "PostDate": "01/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736755",
      "Title": "MRI says clean breast! vivo virginiamom"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 15, 2009 03:39AM joaniji wrote: I am so sorry to hear of your tremendous loss.  No words seem sufficient in a time like this so please accept my sincere empathy.  With time may the pain of your loss diminish as the memories of Rooni's life with you and your children grow and provide you with warmth and love.",
      "MessageIndex": 14,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737409",
      "Title": "my beloved rooni has went home to the lord rooni janie44"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 8, 2010 08:54PM joaniji wrote: I am just hoping that you might be able to share some more information with us so that we can learn from your friend and that you can get the responses you need,  What is TEMP? and what kind of BC is it being used for?  Forgive me if I am ignorant, but I haven't heard of this treatment and am curious.  I do hope that it continues to kick your friend's cancer to the curb!  Warm wishes to your friend and to you - it is clear that you must be a wonderful friend.",
      "MessageIndex": 1,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753819",
      "Title": "Tamoxifen Etoposide Platinol Mitoxantrone olisad olisad"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 27, 2010 09:46AM joaniji wrote: Hi Mary, I have bone mets that were diagnosed four years after my mastectomy for stage 2 cancer.  There was no indication at this time that cancer was in my good booby!  It is my understanding that the bone mets came from cancer cells that had escaped my first course of treatment - maybe in your case, a few cells survived your first chemo and gradually invaded your bones.  I am not sure if you are saying that you now have cancer in your good booby or if you are wondering how you got mets.  If cancer has now been found in your remaining breast, it is my understanding that it would need to be tested to determine if it is a new cancer with different characteristics than your existing cancer.  Maybe you could clarify your question a bit so that you get the info. that you are looking for.  Good luck, joani ",
      "MessageIndex": 2,
      "PostDate": "27/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758593",
      "Title": "Has anyone gotten cancer in good boob while METs from bad boob? MJ6266 Fitztwins"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 25, 2009 02:54PM joaniji wrote: Justablondy, Your post was so moving, I can really get a sense of the powerful connection you share with your mother and the fear that you are now feeling.  I am sorry that I don't have a way to make your situation less frightening and sad; I am only able to send warm hugs and best wishes.  It does seem that focusing on the immediate medical crisis (recovering strength and basic skills) before tackling the cancer, may be necessary.  I would concur with the other women who have suggested that less intense treatments for cancer, like hormonals, bone medication and even oral chemo might be useful.  I think that improving and then maintaining your mother's quality of life maybe be most important.  I hope that you feel comfortable to use this forum to gain support and advice - if appropriate, let your mother know that there is a community of women behind her -wishing her comfort and peace.",
      "MessageIndex": 6,
      "PostDate": "25/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737938",
      "Title": "New here & needing support JustaBlondy donnabee"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 4, 2013 02:10PM joaniji wrote: Hi ysw,  I am sorry that your mother is having difficulty right now and I am sure that she appreciates all the help and concern that she gets from you.  It sounds like you and your mother are puzzled by her new symptoms.  There are many factors at play here (pre-cancer health, the effects of cancer, treatment side effects...) - which makes it presumptuous of us to speculate what could be going on.  What I would encourage you to do is to be the best advocate you can be for your mom.  If your mother gives you permission, talk to her doctors, arrange for a second opinion if need be, question answers and treatments...Best wishes to you and your mom, Joani",
      "MessageIndex": 2,
      "PostDate": "04/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805678",
      "Title": "Hot flashes, dry mouth, frequent urge for urination ysw ysw"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 20, 2009 07:04PM joaniji wrote: Hi Elizabeth, I don't think that you are \"bitchy\" - matter of fact, I find your posts thoughtful and compassionate.  I think that I agree with you!  I appreciate the good wishes and compassionate comments of women suffering from bc in any stage yet, I do attend more to the advice given by my fellow stage 4 sisters.  At times, advice given on this site by early stage bc sufferer's sounds a bit hollow, unrealistically positive and sugar sweet. I feel badly saying this - I truly don't mean to offend but to acknowledge the uniqueness of our stage 4 situation. I appreciate your bringing this issue up and I look forward to the comments of others - stage 4 or not. Joani ",
      "MessageIndex": 1,
      "PostDate": "20/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739271",
      "Title": "Advice for metsters konakat RobinWendy"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 29, 2009 03:15PM joaniji wrote: Dear Abbyglp, I just wanted to extend my best wishes to you.  I am so sorry to hear that your onco. is having difficulty sorting through your current situation.  I imagine that his lack of confidence is so unnerving for you.  I wish that he could be more confident instead of putting this anxiety on you - like you don't have enough anyway!!  I am sorry that I can't speak with any authority on your experience but I know that more knowledgeable women will come on board soon.  I did want to let you know that you are in my thoughts and that I wish you much comfort and resolution. Take good care.  Cyber hugs to you, Joani  ",
      "MessageIndex": 1,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738120",
      "Title": "Hate to ask but need a couple prayers abbyglp pitanga"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 15, 2009 02:05PM joaniji wrote: Dear Anne, While I can't really offer advice on the removal of your tumor following your stage 4 diagnosis (although I think that I would want my tumor out too!), I can offer my input on the lung nodules.  Six months ago when I learned the cancer had returned, I had multiple bony lesions and multiple tiny lung nodules.  While my onc. was hesitant to say that the lung nodes were definitely cancer, hormonal treatment (Aromasin, Lupron and Zometa) seemed to do the job and recent scans showed the nodes were no longer there. This seems to indicate that the nodules were in fact cancerous. While it is scary to have had cancer spread to the lungs, perhaps my case can provide you with some reassurance that small lung nodules can be effectively treated!!  I am so sorry that you are experiencing this - I can completely relate to just wanting to survive for as long as possible (I have kids too).  I wish you all the best in making your decision.  Please have the strength to do what makes you more comfortable and secure.  ",
      "MessageIndex": 3,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 22, 2010 06:45AM joaniji wrote: Hi Pobster23, I am so sorry to hear that your mother is struggling with this miserable disease.  Watching her suffer must be so difficult for you; your care and concern for your mother are lovely and bound to help her fight this battle.  I guess that I would strongly encourage you to check with your mother's doc. about the use of a drug like Zometa (a bisphosphinate).  It seems pretty standard here on the board to hear about women with bone mets receiving infusions of bone building and cancer fighting medication.  I have had bone mets for 18 months and really feel like Zometa has helped prevent fractures, heal bone and fight the cancer.  Your mom's doc. referred to people not feeling well on these drugs - it does seem that most women have some flu like symptoms that last 48 hours of so.  The symptoms usually go away after the first few treatments. Bone mets are painful and can be disabling but they can be treated and the pain can be alleviated.  Please extend to you mom (and to yourself) our support and encouragement.  The board is visited by lovely, intelligent, compassionate and supportive women who don't hesitate to respond to questions rapidly and with deep respect.  Please post again if you like.  Wishing you and your mother the best, Joani ",
      "MessageIndex": 4,
      "PostDate": "22/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755656",
      "Title": "new to this pobster23 pobster23"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 2, 2012 07:10PM joaniji wrote: How wonderful! Thank you so much for sharing your good news, this is most importantly, a gift to you but it is also a gift to us. After the nap, I would say a celebration is in order!  Enjoy.  Many wishes for continued improvement. Take good care, Joani",
      "MessageIndex": 25,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782026",
      "Title": "WBR results banjobanjo banjobanjo"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 21, 2010 06:45PM joaniji wrote: I think that it would be quite alright to shout with glee at having your home quieter for a bit.  It sounds like you are a remarkable woman managing a really difficult set of circumstances so well.  I hope that between the endless chores that you do, you can take some time for yourself.  Do you have a good support system? I truly hope so.  I will have to keep the magnesium in mind to try when my bone mets act up.  I hope that you continue to get some relief from the pain, which I know from experience, can be so terrible.  Wishing you more comfort and peace, joani",
      "MessageIndex": 3,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754381",
      "Title": "magnesium oil for bone pain... nine_rugrats nine_rugrats"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 19, 2009 03:57PM joaniji wrote: Zent, so sorry to hear of the loss of your mother.  I know the grief must be overwhelming now but I hope that with time the pain will lessen and fond memories of your mother will fill your heart with love.  Warm wishes and lots of compassion are being sent your way.  Take good care.",
      "MessageIndex": 8,
      "PostDate": "19/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737619",
      "Title": "Passing of Mother zent76 zent76"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 8, 2011 04:08PM joaniji wrote: Great news!!   Wishing you a wonderful trip - may it be comfortable and full of relaxation and adventure!",
      "MessageIndex": 7,
      "PostDate": "08/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772842",
      "Title": "Dodged the bullet mthomp2020 MCTHO"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 25, 2010 12:00PM joaniji wrote: Hi 3katz, Thanks so much for sharing your experience at the retreat.  I live in Chicago and had considered going on this retreat but actually didn't because I was a bit concerned it would emphasize sharing too much.  You would think that because I am a therapist, I would like such a retreat but I definitely don't think I would.  It works for some but I for one, wouldn't be comfortable seeing others become so emotionally vulnerable nor would I want myself to become so vulnerable in a group of strangers. I think the notion of inner peace is intensely personal and extremely complicated and would likely find activities geared toward this, trite. I love the idea of a retreat involving activity, good food, laughs and support.  Sign me up!!",
      "MessageIndex": 2,
      "PostDate": "25/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758526",
      "Title": "Review: Infinite Boundaries Retreat in Wisconsin Dells 3katz susan_02143"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 17, 2009 08:22AM joaniji wrote: Your grand daughter is beautiful.  She is very fortunate to have a grandmother like you.  A grandmother's love is truly precious and unique.  I say get that sewing machine out!!  I was just visiting my mother along with my kids, sisters and nieces - the little girls got out some wonderful costumes that my mother had sewed for us kids.  The grand kids loved the costumes!!  Your beautiful grand daughter will treasure what you make her forever.  Enjoy this phase of life.  ",
      "MessageIndex": 26,
      "PostDate": "17/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737440",
      "Title": "Heather Palmerton's new grand daughter pictures Fitztwins virginiamom"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 19, 2010 09:23AM joaniji wrote: My deepest condolences to Caerli's family.  May her memory be for a blessing.  River, thank you for gracing this board with your presence, your spirit will live on.",
      "MessageIndex": 86,
      "PostDate": "19/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746933",
      "Title": "River is an Angel now. Fitztwins susanmary"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Apr 1, 2011 02:22PM joaniji wrote: Hi Katherine, I somewhat reluctantly applied for SSDI (as you know, here in Chicago) last summer and within 6 weeks I received my first payment.  That payment was an one-time lump sum payment covering the year that I had mets but was not on SSDI.  After this payment, I started receiving monthly stipends.  I have not discussed this with my onco. - all I did was bring copies of all the scans and blood work that I have had done, to the local SSDI office.  I had filled out the paperwork on line and even though I had left much of the paper work blank, the local office took care of it quickly, respectfully and thoroughly.  I completely understand being ambivalent about the whole thing - I receive my check and am thankful for it but remain ambivalent.  I don't know that this is the way to go for you, that decision can only be made by you.  Because I know you personally I can say that I would be amazed if you didn't find a job (if that is what you want).  You are so intelligent, write so well and are tech. savvy...a company would be blessed to have you.  Best to you, Joani ",
      "MessageIndex": 16,
      "PostDate": "01/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766802",
      "Title": "Job Hunting Strategies EnglishMajor PizzaDad"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 19, 2009 03:54PM joaniji wrote: Bethie, I kind of think your Onc. is nuts! Why would she/he think that you wait until a problem occurs before you scan for it? and what is this \"you only have bone mets\"...bone mets are just as cancerous as other mets, perhaps not in of themselves lethal, but cancer nonetheless.  I think that scans exist to catch the cancer before it causes significant symptoms.  I hope you feel confident enough to push for what will give you peace of mind. If bone mets are progressing then it makes sense to me, to scan for other problems (maybe a CT or MRI would be sufficient).  Sorry to get worked up but it bugs me that some docs. only want to act after symptoms arise. Whatever you do, I wish you the best. Take good care. ",
      "MessageIndex": 14,
      "PostDate": "19/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737591",
      "Title": "Need Some Opinions AusAla LuAnnH"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 29, 2009 10:26AM joaniji wrote: Watson, wishing you continued improvement, happiness and joy.  ",
      "MessageIndex": 23,
      "PostDate": "29/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739630",
      "Title": "Liver, lung, bone, and brain...Oh my! Watson cmb35"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Mar 12, 2012 06:58PM joaniji wrote: Thank you to Kim for posting this message.  I didn't have the priviledge of knowing Suze but it is clear to me that she must have been a very special person to have a friend like you.  Your message is a testament to Suze's character, concern for others-even in her time of quiet desperation - and to her ability to hope for the future of others.  May her memory be a blessing.",
      "MessageIndex": 82,
      "PostDate": "12/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784030",
      "Title": "A sad update on Suze 35 Suze35 Janie-bug"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 16, 2010 04:08AM joaniji wrote: gosh darn it!  So sorry to hear that things are not going well for you.  Are you uncomfortable? It makes me so sad to hear that you aren't seeing the results you want and deserve.  I hope that whatever new treatment you add gets those numbers back in place.  Please feel the warmth and support being sent your way. Thinking of you, Joani ",
      "MessageIndex": 19,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758065",
      "Title": "Gemzar Sucks and Isn't Working RobinWendy 3katz"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 14, 2009 08:27AM joaniji wrote: I am sorry that you are in the position you are in but since you are I would suggest doing whatever is going to increase your peace of mind.  It might make you feel more secure to have a complete mastectomy - this decision is truly yours to make.  I had a left breast mastectomy and immediate reconstruction.  Until the surgeon evened out my breasts, I felt uncomfortable and a bit self-conscious.  I think it is important to consider how your body and mind will feel if you have a partial versus a full mastectomy.  I wish the best in making this decision.",
      "MessageIndex": 3,
      "PostDate": "14/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740097",
      "Title": "LCIS+ADH/borderline DCIS on R, mastectomy ? Ling joaniji"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 7, 2012 08:50PM joaniji wrote: Thanks for posting about this!  I will be there and hope to meet many of you there.  To answer Sonny's question - yes, the conference is for those of us living with mets.  It offers a chance to connect with others (please come to the dinner at Chicago's famed pizza place - Gino's) and to hear about the latest developments/treatments in the fight against this disease.  Any questions, feel free to pm me or English (we are working on the conference).  Take care everyone!",
      "MessageIndex": 11,
      "PostDate": "07/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793142",
      "Title": "MBCN Annual Conference is Oct. 13 in Chicago: Who is Going? EnglishMajor LuAnnH"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 22, 2010 02:20PM joaniji wrote: Dear Robin,  I can't add much to what Janis just said - she said it so wonderfully.  So, I am just chiming in to let you know that you are very much in my thoughts and heart.  I don't know much about the drugs you have left to try.  Obviously I hope that they work and allow you to maintain a good quality of life. Wishing you comfort, peace and improved health. Love and light, Joani ",
      "MessageIndex": 71,
      "PostDate": "22/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758065",
      "Title": "Gemzar Sucks and Isn't Working RobinWendy 3katz"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 13, 2010 02:00PM joaniji wrote: Oh, I am so sorry to hear of your extreme discomfort.  This must be a very scary time for you - I hope that you get relief soon.  You are in my thoughts and in my heart.  Wishing you all the comfort possible.  Best wishes, Joani",
      "MessageIndex": 53,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757773",
      "Title": "Not Doing Well At All! Nanalinda leprechaun"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 15, 2009 04:08PM joaniji wrote: Terrific!! What a relief the news must be.  It is truly a bummer that you had to wait so long for the docs input but what great news. Thanks for updating us.  Be well.",
      "MessageIndex": 51,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737391",
      "Title": "STABLE!! Fitztwins MJLToday"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 13, 2009 10:00AM joaniji wrote: I just found this post and am stunned to hear of your lovely daughter's passing. I am so sorry that you and your family have to go through such a monumental loss.  I hope that with time warm memories of your togetherness will temper the grief that you must be feeling.  Once again, we need a cure.  Take good care and please know that women all over are wishing you peace and comfort.",
      "MessageIndex": 48,
      "PostDate": "13/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730041",
      "Title": "New here virginiamom Mazy1959"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 9, 2011 09:55AM joaniji wrote: I have nothing profound to add -- except, YUCK!",
      "MessageIndex": 8,
      "PostDate": "09/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776162",
      "Title": "uuuggh apple nancyh"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Apr 3, 2011 06:49PM joaniji wrote: MBC definitely needs more advocacy.  Treatments are needed to help extend our lives.  There is inadequate funding for research focused on metastatic breast cancer.  I urge everyone to join The Metastatic Breast Cancer Network (mbcnetwork.org).  This is the only patient led advocacy group dedicated to increasing awareness of the disease and to fighting for more treatments to help us continue to live the lives we love.  We don't need a cure, we need treatment!   Joani ",
      "MessageIndex": 15,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762806",
      "Title": "I'm MAD at Susan G Komen BaseballFan nurse-ann"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Nov 6, 2011 06:31PM joaniji wrote: You are not alone.  I am so sorry that so much has happened to you.  Although hearing that you have metastatic breast cancer is definitely difficult news to cope with, please have hope.  Treatments can work wonders on bone mets and there are many hormonal meds to try.  I don't think that there is any 'trick' to figuring out how to cope with your new reality - the only thing that I know is that you will likely feel so many different ways about this news.  Be patient and kind with yourself and trust that you will feel more empowered as soon as treatment begins and you fight this disease.  I was on faslodex and Xgeva (like Zometa) for a year and I found this treatment very tolerable. The shots can be painful though so you might try taking a pain med before you get the shots.  When I remembered to do this, it definitely helped.  Best wishes to you, Joani",
      "MessageIndex": 10,
      "PostDate": "06/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777653",
      "Title": "Car Wreck & Bone Mets Aerial Oki88"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 14, 2010 01:16PM joaniji wrote: Hi Elizabeth, Just checking in to see how you are doing.  I hope that you are having a nice weekend in Boston.  Are you in the city or suburbs? (I grew up in Lexington). Maybe you are enjoying some good Italian food and lots of great wine. I especially hope that the BF is treating you really well the Valentine's Day and helping to cheer you up.  Take care and have a safe trip home. ",
      "MessageIndex": 95,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 21, 2009 05:27PM joaniji wrote: Thank you Hollyann for the update.  You are truly a wonderful friend to Kbug.  Please let her know that she is being thought of and that healing energy and best wishes are being sent her way.  Here is to hoping that she is home and resting comfortably for the holidays.  ",
      "MessageIndex": 8,
      "PostDate": "21/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745709",
      "Title": "Update andPrayers for Kbugmom hollyann sheila888"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 28, 2012 09:35AM joaniji wrote: Hi,  It is wonderful to hear that your cancer has responded positively to the chemo - this is great.  When I was diagnosed with mets three years ago a small biopsy from my bone was done and it determined that I was ER+, just like I had been when I had stage 2 cancer in 2004.  When the cancer spread to my liver in Sept. a liver biopsy was done and I was rediagnosed as TN.  This meant a treatment change to Xeloda and to my delight, the liver tumors are gone.  I do think that it is critical to get a biopsy (if it can be done) when your cancer spreads.  In reality though, the chemo drugs should be doing the job of the hormonals, in fighting cancer.  If the chemo is working then it makes sense to stay the course.  If your liver tumors return then I would recommend asking for a biopsy.  The other thing to consider is having an oopherectomy (ovaires out).  For me, this procedure was relatively simple and it helped give me peace of mind. I wish you the best.  Take good care, Joani",
      "MessageIndex": 7,
      "PostDate": "28/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783312",
      "Title": "How Do You Know if ER+ Has Turned ER-? charlestongirl63 33skidoo"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 31, 2010 12:34PM joaniji wrote: Hi Jean, I know that any surgery is scary but as far as this one goes, my opinion is that it is a relatively uncomplicated surgery with a pretty straight forward recovery.  Are you having any reconstruction done at the same time?  I had reconstruction done at the time and although the surgery was made longer by this, I woke up with two breasts.  I would imagine that waking up with only one breast might be emotional for some, if this is the case for you, I wish you comfort and peace.  The actual surgery is under two hours and I think that you are able to go home after one day.  Usually women have a few drains that remain for a while.  This took some getting used to.  As far as pain, in my case, the pain was minimal.  It was a bit uncomfortable for a while, in particular when sleeping.  I found that lots of pillows, good food and pain killers if needed did the trick.  I truly hope that your recovery goes smoothly and that you get strength from knowing that you are removing some of the cancer.  Peace, Joani ",
      "MessageIndex": 2,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762737",
      "Title": "Surgery.....7th KentuckyMom ibcmets"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 9, 2010 08:18AM joaniji wrote:",
      "MessageIndex": 5,
      "PostDate": "09/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756525",
      "Title": "Feeling down tonight DebZaz DebZaz"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "May 12, 2010 05:42PM joaniji wrote: Thanks for sharing such wonderful news.  I am delighted for you that your body is fighting back so successfully.  Can you please find a photo of your Onco hunk to share with us -- that would be fun.  I can't wait to see your blonde hair!  Enjoy and many wishes for continued improvement.",
      "MessageIndex": 1109,
      "PostDate": "12/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 13, 2010 01:18PM joaniji wrote: Dear Elizabeth, I am really sorry to hear your news.  I know that my empathy is really rather lame but please know that it is sincere!  You are a wonderful, humorous and compassionate presence on this board and so many of us are truly behind you as you confront this latest hurdle. Give yourself plenty of time to digest this news, cry if you wish, rage if you like, drink and eat plenty...When you are ready, you will fight back!!  Please keep us informed.  You have a personal army of fighters behind you - feel our essence and hear our roar.  Forgive the unbelievable corniness (is that a real word?).  Take care as best you can. Love, Joani ",
      "MessageIndex": 82,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 18, 2009 11:31AM joaniji wrote: kbugmom, So sorry to hear that you are in the hospital but delighted that you are more comfortable.  I know that it is miserable being in the hosp. but I am glad that you are enjoying your icecream and your connection to the boards.  Hopefully, the illness will pass quickly!!  Best wishes. ",
      "MessageIndex": 9,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736064",
      "Title": "Im in the hospital kbugmom faithandfifty"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 28, 2010 05:38PM joaniji wrote: Hi Sandy, I started Faslodex about two months ago after having some progression on Aromasin.  I received a loading dose of the drug given over 6 weeks (a shot in each cheek every two weeks) and am now on the monthly plan.  The shot is not the most comfortable but when injected slowly, doesn't hurt as much.  I find that my butt is sore for a few days but then I feel fine.  I think that I feel better on this medication.  The only side effect that I have had is a bit more fatigue and more night sweats.  I truly hope that this med. works for you.  Best wishes, Joani ",
      "MessageIndex": 3,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762620",
      "Title": "Tell me about Faslodex blondiex46 blondiex46"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 18, 2009 07:19AM joaniji wrote: Dear Wendy, Many warm wishes are being sent your way.  May the surgery go well, your recovery smooth, and your health improved.  I wish you comfort and peace.   ",
      "MessageIndex": 8,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736081",
      "Title": "WendyV needs our support katie11 heatherpalmerton"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 1, 2010 01:32PM joaniji wrote: Thanks for the update Olisad.  If Irina reads this - please know that so many women are sending you warm wishes and positive energy.  Rest comfortably, Joani",
      "MessageIndex": 16,
      "PostDate": "01/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758799",
      "Title": "Spoke with Irina olisad dmacw"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 31, 2009 10:20PM joaniji wrote: Hi Carla,  Just writing to wish you the best.  I am sorry to hear of your progression - this disease is miserable and so unpredictable.  Sounds like a second opinion might be helpful.  Take good care of yourself as discovery of progression can be so upsetting. Joani ",
      "MessageIndex": 11,
      "PostDate": "31/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739694",
      "Title": "Crap Liver Mets ccarter48818 sportsmom"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 14, 2010 06:02PM joaniji wrote: Hi Robin, I am so glad that you have a treatment plan now; the uncertainty of what you were going to do next must have been quite troubling.  If you don't mind, could you clarify a bit - I thought that you had only been receiving hormonal treatment and not classic chemo.  Did chemo fail you? Are you doing this type of treatment because hormonal tx stopped working?  It sounds like you are feeling optimistic but realistic at the same time.  I know how difficult it is to think about leveling with your daughter.  I think the doc's suggestion of how to raise the issue, is wonderful.  Perhaps it would also help if you decided ahead of time, what you really want your daughter to understand and to grasp.  Once you know this, you can guide your conversation.  You seem like a very dedicated, perceptive and loving mother and I imagine that the discussion you have with your daughter will reflect these characteristics.  I wish you all the best as you begin this new course - one that will hopefully bring you continued well-being and perhaps, an even closer, relationship with your dd.  The best to you, Joani ",
      "MessageIndex": 2,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746778",
      "Title": "Back from Boston with new treatment plan RobinWendy RobinWendy"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 18, 2014 09:17PM joaniji wrote: Hi, I am so sorry that you are having sleep issues and that your nurse doesn't seem to be empathic to this issue.  I have mbc and am a psychologist.  In all my years of practice -- and in my own experience-- I have found that the best long-term sleep aid is a medication called Trazadone.  This med is a very old anti-depressant and when taken at a sub-clinical dose (25 to 50mg) nightly, works wonders for most people.  Please don't hesitate to push your onc. to let you try something other than Ativan for sleep.  Ativan works for many people but it is primarily a fast acting anti-anxiety med that often doesn't allow for a full night sleep.  Hang in there.  Best to you, Joani",
      "MessageIndex": 10,
      "PostDate": "18/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818159",
      "Title": "Sleep issues Kjones13 Kjones13"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 20, 2009 07:10PM joaniji wrote: sorry to hear about your friend's diagnosis.  Adjusting to such a diagnosis and at such a young age can take time, support and compassion.  She is fortunate to have you as a friend.  Please encourage her to check this site out as well as the one mentioned above.  A lot of \"young people\" visit here.  I was 40 at the time of my first bc diagnosis and 44 when mets to bones were found.  I just turned 45.  Wishing your friend the best, Joani",
      "MessageIndex": 15,
      "PostDate": "20/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739145",
      "Title": "Stage IV, in bones, under 45? JodiTLG Tilly123"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 6, 2009 12:04PM joaniji wrote: Dear Abby, I am so sorry to hear that you are having so many unexplained symptoms and so much pain.  What  a lousy situation.  Please don't give up - it sounds like you need a second opinion and some good diagnostic tests to be repeated.  I know that it is miserable to be scared, confused and in pain and I don't think that you have to be suffering like this.  Is there someone who can help advocate for you?  I also want to suggest that you check with a dentist to determine if the jaw pain you are having is from the Zometa.  This med. can caused severe dental issues in some people.  Good luck with this.  I wish you improved comfort!! ",
      "MessageIndex": 7,
      "PostDate": "06/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741546",
      "Title": "3 doctors and still no dx for me abbyglp chainsawz"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 23, 2010 08:19PM joaniji wrote: Don't worry about being a \"debbie downer\" - it is unfair to classify yourself as this.  You are going through such a difficult time of course you would be upset.  You are a brave women to consider ending your treatment ,this is an intensely personal and difficult decision to make.  I hope that you receive some treatment soon to alleviate your exhaustion and discomfort. You deserve to be more comfortable!!  I wonder if when you are a bit more comfortable, you will make the same decision? What ever you decide to do, please know that you are being thought of.  Many good wishes for improved health and comfort.  Warm hugs, Joani ",
      "MessageIndex": 6,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748778",
      "Title": "Received results of MRI to Hip today kenzie57 ElaineD"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 26, 2010 06:46PM joaniji wrote: Dear Patti,  My empathy and support goes out to you!!  I think that one of the challenges of dealing with this disease is that it contributes to emotions that are sometimes not readily understood, logical or predictable.  Although your mind is trying to use logic to understand your present funk, it is your heart and body doing the thinking here.  I truly believe that anniversary dates can trigger intense reactions that even great brains can't get a hold of.  Imagine your feelings as a bruise that isn't healing.  It hurts when suddenly hit.  Well, you are being banged again now and the mammogram is doing it!  I know from my experience, that my emotions and thoughts went wacko around the anniversary of my cancer mets diagnosis.  It was like the flood gates opened ... I was flooded by thoughts of my own demise, anger at my hubby for not making my life \"perfect\", worry about my kids, fury at my self for not being more \"successful\"... I can tell you though that these feelings did settle down - once the date passed and the scans were done, it was back to clear (well clearer!) thinking.  I hope that your blue mood is transitional but if it sticks around too long, please seek assistance (meds, food, pole dancing, primal scream therapy...I am trying to be funny here but I do appreciate the seriousness of the situation). Warm hugs are being sent your way.  Take good care. ",
      "MessageIndex": 11,
      "PostDate": "26/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747363",
      "Title": "I bounce between hating this site and loving it pattih tami444"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 31, 2010 08:45PM joaniji wrote: Dear njwall, I am just writing to let you know that you are not alone.  I know that you are in a dark place where hopelessness is threatening to overtake your heart.  Please know that we are behind you - feel the embrace of those who know what it is like to fight this disease and to struggle to get the services needed.  I encourage you to use the helpful information provided on this forum and to reach out to someone -- Network of Strength hotline can connect you with someone to listen and CancerCare can provide you with financial and emotional assistance.  You don't have to be alone in this.  We care.  Many wishes for more comfort and for hope, Joani ",
      "MessageIndex": 16,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762696",
      "Title": "Need a friend njwall mamanmidwife"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 17, 2010 08:22AM joaniji wrote: so glad to hear that you are taking comfort in your new hugAhan.  May it bring you warmth, healing and peace.  ",
      "MessageIndex": 25,
      "PostDate": "17/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756796",
      "Title": "Mystery solved -- it's a hugagan! konakat AnnNYC"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 28, 2010 09:16PM joaniji wrote: Hi Judi, I am so sorry to hear about your progression.  Of course you are shaking, the news is a major bummer!!  Despite this, please hang in there - there is hope.  RobinWendy might be a great resource for you as I believe that she had estradiol therapy.  Perhaps she will come along soon or maybe you could pm her.  Wishing you fast improvement and much more peace and comfort.  Best wishes. ",
      "MessageIndex": 7,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747503",
      "Title": "Estrogen Therapy? Bad news just now. Judiiiii Jellydonut"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 29, 2010 09:03PM joaniji wrote: Dear Heather, I am truly moved by your ability to handle difficult situations with grace, integrity and even humor.  You have had so many difficulties in life that provide ample reason to be bitter but there is no bitterness in your voice.  While your perspective on the situation is wonderful, I do hope that sometime soon, the dad in question begins to teach his children to think before they speak!  Best wishes to you, beautiful woman. ",
      "MessageIndex": 12,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747499",
      "Title": "KIDS DO SAT THE DARNDEST THINGS heatherpalmerton heatherpalmerton"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 7, 2011 10:50AM joaniji wrote: Thanks for the suggestion.  I don't know why I never thought about donating here - I will do it now!!",
      "MessageIndex": 11,
      "PostDate": "07/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776034",
      "Title": "Ladies?? (re:Pink hell month) Fitztwins Seashellie"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 11, 2009 12:18PM - edited Jun 11, 2009 12:19PM by joaniji Hi Liz, I am sorry that you are in the unenviable position of needing to let your dear daughter know of your change in treatment.  As a parent of two (11 &13), I can completely relate.  While I am no means an expert in what you should say to your daughter, I can share some things that I found helpful to do with my kids.  I think being open and direct is key - she is no doubt smart and perceptive and will know something is going on even if you don't tell her.  Perhaps setting up a time on a weekly basis where you can update her on your health and answer any questions that she may have, would be helpful.  She may have worries about what will happen to her if you are sick or worse - letting her know of the people in her life that care about her might reduce her fears.  I found that it helped my boys to look at this disease as a management issue similar in some ways to diabetes.  I also gave them each a journal to use if they wanted to write about their feelings instead of sharing them with me. Perhaps the blessing of your daughter's age is that kids are usually pretty preoccupied with themselves (social stuff...)  I try to encourage my kids to keep on doing everything that they are doing even if it is being impossible adolescents!  It is truly heartbreaking to have to have this disease and to watch the pain it can cause our loved ones.  I am so sorry you have to deal with this.  My thoughts and best wishes are with you.",
      "MessageIndex": 5,
      "PostDate": "11/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735685",
      "Title": "How do you tell your child about cancer? ead raro"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 19, 2010 09:40AM joaniji wrote: Hi Elizabeth, Thanks to the woman who posted the funny videos! - I laughed so hard you KNOW what happened - too embarrassing to write. No videos however, can top your funny words!  So glad to hear that you connected with a colleague who helped you come up with ideas for volunteer work.  I am struggling to come up with some volunteer work to do too.  What ideas do you have? I don't know about the silver lining stuff - I don't buy it.  But, I do think life's challenges provide opportunities for change.  I am all for change that brings more meaning and connectedness to our lives.  Sometimes this connectedness comes from people and sometimes from a good and big margarita!! Best wishes to you as you search...keep us updated.",
      "MessageIndex": 108,
      "PostDate": "19/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746762",
      "Title": "Progression in liver and bones :-( konakat dreamwriter"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Apr 8, 2010 09:17PM joaniji wrote: Darn it Robin - what a bummer!!  It sounds like this news fell like a ton of bricks on you and I am so sorry that you are suffering so.  I don't think that you have been on chemo in a long time (I hope that I am remembering correctly) and I imagine that confronting this type of treatment is overwhelming,frightening and disappointing.  You have always provided others with straight forward and compassionate advice, perhaps it is time for us to do the same for you so here goes...I hope that once you allow yourself to feel the despondency, you will feel more energized to fight.  You have fought so successfully for so many years - who says that the fight is over?  I realize that chemo is miserable - it makes the disease and your battle apparent to others, it can be miserable to endure and it just sucks but it can work!!  I hope that when you are ready, you can once again feel hope.  Many compassionate wishes are being sent your way.  Take care and remember that we care.",
      "MessageIndex": 25,
      "PostDate": "08/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/750993",
      "Title": "Failure Again...Progression RobinWendy Fidelia"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 17, 2009 09:00PM joaniji wrote: Happy Hipday!!  I will be thinking of you and wishing you all the best as you wait for your scan results.  We seem to be on the same scan schedule - I just had my Pet on Tuesday and was delighted to receive the news today that although the cancer in my bones is still there, nothing new has appeared.  I had a hard time talking about the pre-anxiety that I had but my body seemed to be so tense and I could barely sleep.  I just hope that you receive good news and can go back to living life as best as you can!! Be well.",
      "MessageIndex": 20,
      "PostDate": "17/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745521",
      "Title": "Happy Birthday to my HIP!! Fitztwins getwell"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 9, 2010 09:10AM joaniji wrote: hoping to hear from you Robin and especially hoping that the new treatment is doing its' job but leaving you comfortable.  You are in my thoughts.  Sending cyber hugs your way. Be well, Joani ",
      "MessageIndex": 9,
      "PostDate": "09/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759069",
      "Title": "RobinWendy katie11 Lowrider54"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 19, 2010 05:31PM joaniji wrote: Thanks so much for the update.  I continue to think about you, Robin and to wish you all the comfort and peace possible.  We are behind you. Hugs, Joani ",
      "MessageIndex": 82,
      "PostDate": "19/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759069",
      "Title": "RobinWendy katie11 Lowrider54"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 15, 2010 11:34AM joaniji wrote: A huge hug is being sent your way.  I am so sorry to hear about the recent discovery of more mets.  Damm sneaky disease. I am sure that this caught you off guard - the unpredictability of this disease is so unfair.  I hope that your new drug combo is successful and you feel better soon.  All my compassion is being sent your way.  Do whatever you need to do to nurture yourself through this hurdle. I hope that you can feel the positive energy being sent your way.  Thinking about you, Joani",
      "MessageIndex": 65,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746762",
      "Title": "Progression in liver and bones :-( konakat dreamwriter"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 27, 2010 09:37AM joaniji wrote: Glad to hear that more women are considering going to the conference.  It should be a wonderful experience for us all. Hope to see many of you there. One of the keynote speakers is Dr. George Sledge, the ASCO president. Please see below for some information on this speaker and his current activities.  ASCO President, George W. Sledge, was among the clinician, government  and industry leaders selected to testify before the President's Cancer Panel in Boston on September 22, 2010. The meeting, titled, \"The Future of Cancer Research: Accelerating Scientific Innovation,\" focused on assessing the past 40 years of cancer research and exploring potential future enhancements and advances in biomedical science. In his testimony, Dr. Sledge addressed the need to reinvigorate the  National Cancer Institute Cooperative Group Program; health information technology's potential to drive cancer research; and the projected oncology workforce shortage. The article can be viewed at  http://click.broadcastemail.asco.org/?ju=fe2e167870660d7b751570&ls=fdb715707766037b731d79706d&m=ff2d16787160&l=fe5315767c63017f7c11&s=fe25157971640c7f731c74&jb=ffcf14&t=",
      "MessageIndex": 2,
      "PostDate": "27/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758581",
      "Title": "Metastatic bc conference IND ibcmets joaniji"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Mar 24, 2011 04:43PM joaniji wrote: Thank you Janis for finding a way to put in words, the sentiments that we all share.  Yan there aren't enough words to say how sorry I am for the loss of your beloved wife.  With time I hope that the acute pain of her loss will be balanced by the wonderful memories of the times you shared.  Thank you for courageously sharing your story and for allowing us to travel this journey with you.  Wishing you comfort and peace, joani",
      "MessageIndex": 39,
      "PostDate": "24/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766552",
      "Title": "Yan, just for you. Fitztwins clemson93"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 1, 2010 10:19AM joaniji wrote: Robin, I am so glad to hear that you are celebrating your half anniversary.  This is definitely something to celebrate.  Hmmm how are you going to mark this? do something special for yourself perhaps.  Glad to hear also that you are enjoying your treatment break.  I think that you are in the land of functional denial and bravo to you for traveling to this delightful land.  Enjoy and may your spirits and health continue to be strong!",
      "MessageIndex": 8,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753428",
      "Title": "Six and a Half Year Cancerversary... RobinWendy Anne45"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 14, 2009 09:47AM joaniji wrote: Dear Kystyna, I am truly sorry that you are experiencing all that you are.  Your angst, concern, confusion, anger...are completely understandable.  You have had no time to digest such traumatic news. I would vote for you to take whatever trip you would like to do but not because you are \"terminal\" but because the trip would provide you experiences that remind you of the living you still have to do!!  As you will see on the board, many women do lead meaningful and comfortable lives after receiving devastating news.  Your treatment CAN be successful.  While I don't have liver mets, I do have bone mets that have responded well to monthly infusions of Zometa and daily Aromasin.  The Zometa is meant to strengthen your bones while protecting them from further spread and damage.  I haven't had any trouble on Aromasin and it has been working for 9 months.  I truly hope that it works for you.  Continue to turn to this forum for support and guidance, we are all here for you. ",
      "MessageIndex": 22,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741902",
      "Title": "Just diagnosed with liver metastasis Krystyna Krystyna"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 14, 2009 05:22PM joaniji wrote: Just writing to wish you the best Analemma!  You have had a lot to deal with and I am sure that the thought of more surgery is depressing.  I do hope though that it goes well and that you are feeling better shortly.  I am wishing you a speedy and comfortable recovery and resolution to this, seemingly, unusual problem.  Take good care, joani",
      "MessageIndex": 6,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738940",
      "Title": "Superior Vena Cava Syndrome - any experience? Analemma jeanne46"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Nov 9, 2009 03:12PM joaniji wrote: Go for the drugs.  Geez, you should get what ever you want.  Your comfort is important! and you have soooo much to deal with.  What about Norco or Vicadin? anti-anxiety meds such as Xanax, Valium and Clonapin are good.  The most important thing is for your doctor's to take your discomfort seriously (I think that they become brain and heart dead and can't imagine what pain is).  Even though you are unhappy now, your wonderful sense of humor comes through.  I hope that you can still find ways to laugh.  Wishing you much comfort, Joani",
      "MessageIndex": 7,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743559",
      "Title": "Waah! I had a meltdown. I don't care who posts! Watson konakat"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 16, 2010 01:10PM joaniji wrote: Glad to hear that you made a decision to ramp down the work.  I hope that disability gives you enough to enjoy yourself a bit.  I have a project idea for you though -- please write a book!!!  You are an absolutely wonderful writer; your ability to merge humor with pain and seriousness is a true talent.  On a more pensive note, I wish you the best as you begin this new phase of your life and of your battle against this miserable disease.  Every time I eat something decadent or drink a glass of wine (both of which are occurring far too frequently!), I think of you and smile.  Take care.",
      "MessageIndex": 81,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746762",
      "Title": "Progression in liver and bones :-( konakat dreamwriter"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 22, 2009 05:59PM joaniji wrote: Klynn, Many warm and positive wishes for an easy surgery and a restful and smooth recovery.  I hope that your blood is not needed!  I too am about to have a hysterectomy.  Although surgery is not fun, that Lupron is a pain in the a--!!  No more hormones - YEAH!!  Gosh, what a weird thing to be saying.. Glad to read that you have a sense of humor, I am sure that is a reflection of a positive attitude.  Wonderful.  I am wishing you the best and a very happy birthday.  May it be the beginning of a year filled with contentment, peace and stable health. ",
      "MessageIndex": 5,
      "PostDate": "22/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736324",
      "Title": "So here's the scoop about me this week coming...ughh. KLynn Marple"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 12, 2010 12:27PM joaniji wrote: I am getting worried - has any one heard from Robin?  I continue to think of you Robin and to hope that you are comfortable.  Sending cyber hugs and warm wishes - Joani",
      "MessageIndex": 29,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759069",
      "Title": "RobinWendy katie11 Lowrider54"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Nov 13, 2011 07:14PM joaniji wrote: HI Jackie, I am so sorry that you have so much to deal with and at a time in your life when you should be on cloud nine.  This disease stinks and doesn't follow the \"rules\".  Because it doesn't always behave like people predict it will, please don't get overwhelmed by the stats.  Keep visiting this forum and you will see that many wonderful women are continuing to lead meaningful, joyful and productive lives well beyond what the stats predict.  A second opinion is often helpful - you don't say where you get your treatment but I know that Indiana University has some wonderful oncologists.  The organization that I am active in called The Metastatic Breast Cancer Network (mbcn.org) held its conference there in 2010.  The doctors were impressive.  I hope that once your treatment starts working you will feel more hopeful.  It is an isolating disease though so please come back here for support - we all understand.  Wishing you the best, Joani",
      "MessageIndex": 10,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778048",
      "Title": "Just diagnosed IBC and liver met; I'm scared Jacque1102 ibcmets"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 2, 2010 01:31AM joaniji wrote: Darn, cancer is confusing.  Hard to tell what anything means!  I wish I had some good advice but I am afraid that I am useless!!  Just wanted to tell you that I was thinking of you and sending good vibes your way.  I will hold out the hope that the rising TM's are a result of the little suckers meeting a terrible end!!  Warm wishes.",
      "MessageIndex": 4,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747673",
      "Title": "what to do???????????? Tumor markers up heatherpalmerton SeanE"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 14, 2009 04:33PM joaniji wrote: Thank you so much for posting this information.  While the anti-hormonal meds seem to be working for me, knowing that this study is being conducted at a hospital near me, is a huge reassurance.  Keep us posted if you enter this.  Thanks once again, Joani",
      "MessageIndex": 5,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738927",
      "Title": "IMCA12 for progression on anti-hormonals? MJLToday MJLToday"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "May 12, 2010 05:48PM joaniji wrote: Dear Angelsabove,  I am so sorry to hear your news.  This must be a truly scary time for you.  You have come to the right place; the women hear understand and provide unlimited support and wonderful guidance.  My situation is different than yours but I know that someone will come along soon who can speak with more authority.  I just wanted to let you know that you are being thought of with warmth and compassion.  I did have a biopsy of a tumor in my chest and found it to be quite tolerable.  Make sure they give you light sedation so that you can drift off.  There are many treatments out there and you will see from this board, that many women continue to live well while fighting this miserable disease.  I wish you all the best as you begin this unfortunate battle.  Hugs, Joani ",
      "MessageIndex": 2,
      "PostDate": "12/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752564",
      "Title": "Did not know where to go..... angelsabove vickib"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 16, 2009 03:44PM joaniji wrote: Wonderful news.  Aromasin is working well for me too.  Enjoy the last fews weeks with your son before the big transition.  Be well! Joani ",
      "MessageIndex": 4,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739023",
      "Title": "Aromasin.. So far, so good ;-) WingsofHope ead"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 10, 2009 03:23PM joaniji wrote: Cheryl, Of course we are going to acknowledge your post - you deserve acknowledgement, support, empathy...cancer sux!!  I don't think you are \"feeling sorry for yourself\"... but actually, shouldn't you be feeling sorry for yourself?  I am sorry for you - that you are having a miserable time now, sitting alone in a cubicle, getting poked and fighting for meds (WTF).  Your vent is heard and understood.  I truly hope that things start to feel better for you so that you don't have to be forced to sit on the sidelines of a life you seem to cherish.  Many wishes for improved health, much comfort and support.  Take good care, Joani ",
      "MessageIndex": 2,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738716",
      "Title": "My cancer-induced vent mason204 leggo"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "May 20, 2009 02:34PM joaniji wrote: Hi Debzaz, My warm wishes and virtual hugs are being sent your way.  I can only imagine the pain of losing your sister and watching her battle a disease that you now have.  Your emotions are no doubt intense and scary and UNDERSTANDABLE.  Please accept the compassion and understanding from us all and try to take comfort in the knowledge that so many of us care.  Please reach out as you need, connection with others may help the feelings of aloneness and despair.  Also, I for one, would love to share in the cancer jokes!  I find jokes at my own expense incredibly cathartic.  Feel free to share your pain,jokes, questions...  Take good care, Joaniji ",
      "MessageIndex": 15,
      "PostDate": "20/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734496",
      "Title": "Hi I'm new to this board DebZaz DebZaz"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 26, 2010 02:34PM joaniji wrote: Katherine, What a moving and important post.  I will be standing outside, with you in spirit, memorializing the women and men lost to this insidious disease.  I will be affirming my determination to push for more research so that one day, a memorial like the one you suggest, is no longer needed.  Peace. ",
      "MessageIndex": 15,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759846",
      "Title": "Pinktober: It's Not Over 'Til We Say It's Over... EnglishMajor cookie97"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 9, 2009 02:17PM joaniji wrote: Insurance and doctors aside, I don't see why you shouldn't have the opportunity to do what is going to help you feel better about your body.  Unless there is truly a founded medical reason not to have the surgery, I say continue exploring your options.  If you don't want a uniboob then reconstruction SHOULD be open to you.  Feeling reasonably well about out bodies when they have failed us in this major way, is OUR right!!!  Good luck.",
      "MessageIndex": 9,
      "PostDate": "09/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741751",
      "Title": "Want to hear from Stg IV BC re: Plan of Care activern activern"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 21, 2010 10:32PM joaniji wrote: Welcome Monarch, I am sorry that you find yourself dealing once again with BC, especially after such a long time cancer-free.  It is so hard to be in a position of waiting - waiting for a definitive diagnosis and for a treatment plan to be established, is miserable.  I can relate in multiple ways.  Perhaps it might be helpful to hold off telling your son until you have some more information and have allowed yourself to feel the myriad of feelings that you must have.  I think that no matter when you tell your son, it will be difficult. No one really knows how a loved one will react but I am hopeful that with time, your son will adapt as best he can. I wish that this wasn't happening to you.  Please know that you can come to this forum for support and comfort, women here truly understand.    ",
      "MessageIndex": 4,
      "PostDate": "21/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748693",
      "Title": "new to the forum monarch15 autumriley"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 13, 2009 12:18AM joaniji wrote: Dear Heidi, I am so glad to hear that you are home.  In the comfort and safety of home, I hope that you continue to heal within the embrace of your little ones.  All my best, Joani ",
      "MessageIndex": 57,
      "PostDate": "13/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 15, 2009 04:35AM joaniji wrote: Dear Heidi, Thank you so much for keeping us updated on your treatment.  I am so sorry that the treatment is so hard on you - if there is any way to keep the end in sight, please do.  Mark a calender, light candles, pay your self per treatment -- do whatever it takes to progress through this nightmare.  I agree with Elizabeth, perhaps 9/11 will start a new phase of life.  Sometimes this is how the life cycle works; out with the old in with the new!!  I think of you daily and wish there was something more that I could do.  If you wish to share your address, I am sure you would be inundated with cards!  Cyber warmth, compassion, support and hugs are being sent your way. Joani ",
      "MessageIndex": 86,
      "PostDate": "15/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 1, 2009 07:12AM joaniji wrote: Thanks Heidi's little brother for taking the time to update us on Heidi's condition.  Your support for her is priceless and I am sure, a part of her ability to keep fighting.  Please continue to give her our best wishes and to accept some of those wishes for you and your family as well.  Take care, Joani",
      "MessageIndex": 231,
      "PostDate": "01/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 30, 2009 02:40AM joaniji wrote: Dearest Heidi, family and friends, Please feel the support, compassion and warmth from this community of breast sisters.  We have truly treasured Heidi as she brought to this forum an openness, humor, warmth and level of self-awareness unsurpassed.  It has been our honor to know her in this difficult and heart-breaking time of her life.  Thank you to Heidi's family and best friend for sharing her with us and for continuing to post here even as you experience so much heart-break.  Please know that you are enveloped in a collective hug.  I am wishing you all comfort, peace and resolution. Joani ",
      "MessageIndex": 804,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 10, 2010 10:35PM joaniji wrote: amazing!  I am so glad that you have such confidence in your doctor - it certainly seems as though he is at the forefront of treatment development.  I hope that this works for you.  Please keep us updated!!  ",
      "MessageIndex": 24,
      "PostDate": "10/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746519",
      "Title": "Spoke to Dr. Winer about next steps RobinWendy Reneepals"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Apr 18, 2012 04:40PM joaniji wrote: Thanks for sharing your positive news!  Sounds like you have a good game plan - get those suckers out of your body!!!  I hope that your plan goes smoothly. Joani ",
      "MessageIndex": 4,
      "PostDate": "18/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786048",
      "Title": "They Are Dropping lukejessesmom lwd"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 18, 2009 05:37PM joaniji wrote: Dear Crazydaughter (no way are you crazy!!), I am so sorry for the turmoil and pain that your family is experiencing.  A diagnosis of mets. is crazy making - please give yourself the compassion you need to cope with this news. It sounds as if your mother is attempting to cope with her emotions by shutting down and withdrawing.  Please allow her and yourself time to adjust to this horrendous news.  If you can offer her your unconditional support while gently encouraging her to continue living life, this would be wonderful. With time, both of you will realize that while mets are definitely undesirable they do not usually mean an immediate death sentence.  Bone mets can be treated and controlled for a long period of time.  It has been one year since I was diagnosed with bone mets and there is no indication that the cancer is spreading.  This can happen for your mother as well.  Sometimes it takes several months before the Zometa and hormonal meds kick in.  If your mother is uncomfortable, then the best thing you can do for her is to advocate for her.  It doesn't seem right that she is suffering so much.  Please explore getting a second opinion, switching hormonal meds, adding pain killers and perhaps even therapy and medication. You sound like a loving and dedicated daughter, your mother is fortunate to have you.  Perhaps you can read your mother some of the responses to your post.  She must know that she is not alone and that there is hope.   I am wishing you both much peace and comfort.  ",
      "MessageIndex": 7,
      "PostDate": "18/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745576",
      "Title": "The reality of bone mets crazydaughter Mazy1959"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 30, 2011 10:04PM joaniji wrote: This was a wonderful blog.  I would love to see the list that the blogger created, printed and given out.  I loved what she said because I could really relate.  Thanks so much Katherine for posting this.",
      "MessageIndex": 2,
      "PostDate": "30/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775768",
      "Title": "Blogger: What to Expect When You Are Recurring EnglishMajor susan_02143"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 7, 2013 09:21PM joaniji wrote: okay, my brain is mush.  The email address that I gave in the previous post is wrong.  My email is jgudeman3@gmail.com.  What a mess my brain is.  Sorry.  Feel free to email if you like.  Take care, Joani",
      "MessageIndex": 5,
      "PostDate": "07/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807327",
      "Title": "Chicago Moms: Chemo Carpool? DancingVeggie EnglishMajor"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 21, 2010 08:20PM joaniji wrote: Hi Fightn, I am so sorry that you have had some progression so soon after completing treatment.  I think that the first time progression occurs is no doubt the hardest.  While I don't know what kind of treatment you have been on and for what kind of mets - I can say that one bone met is a bummer but not catastrophic!!  Are you on Zometa already?  My guess is that you will be given this drug as a monthly infusion, it fights bone cancer and helps restore bone health. It is generally an easy medication to use and with time, helps with the pain (if you have pain).   If Aromasin failed you, there are plenty of hormonal meds such as Tamoxifen, Femera and Arimidex still to try.  It might be helpful if you post what treatments you have been on - there are really wonderful woman here who have much information to share.  Hang tight, they will come along.  Til then, take good care of yourself and try not to panic - there is hope!!  The best to you, Joani",
      "MessageIndex": 2,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754400",
      "Title": "Friday's Bone Scan Results FightnF8 konakat"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 14, 2010 03:40AM joaniji wrote: Sometimes it is best to give yourself the permission to feel badly.  Please allow yourself to feel the emotional pain; once it is experienced and validated, it will likely diminish. The more you fight the emotions, the more they tend to hang around.  I can relate to the despair that seeing your kids can trigger.  I have been there. The emotions are so intense and overwhelming but understandable.  I know that it sounds overly simplistic to say but, with time you will feel a bit better. The crying will be less intense and the fears more manageable.  Just give yourself the compassion necessary to begin to heal. Please be as strong an advocate for yourself as you can be - if your side effects are awful, then talk to your onc. and insist that help be found.  You deserve to be as comfortable as possible. Wishing you the best, Joani",
      "MessageIndex": 10,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746694",
      "Title": "Feel like hell my3sonz getwell"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 28, 2010 02:52AM joaniji wrote: your post brought tears to my eyes - the good kind of tears.  It is wonderful to hear that you are experiencing wonderment, success and joy. I hope that you keep feeling well and enjoying yourself.  Thanks so much for sharing your happiness.  ",
      "MessageIndex": 9,
      "PostDate": "28/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759917",
      "Title": "Some Happy Stuff!!! JeninMichigan chrissyb"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 19, 2010 08:27PM joaniji wrote: Please don't be afraid - while no one wants to have surgery, in my experience, a mastectomy is manageable.  After I was initially diagnosed with stage 2 bc I had a mastectomy and a tram flap reconstruction all at the same time.  While the surgery was long (5 hours) and I had to stay in the hospital for 4 days, I recovered pretty quickly.  I liked that I had the reconstruction at the same time; when I woke up I still had two breasts (one made out of excess abdominal skin).  The drains remained for about a week.  If you have a mastectomy only then the drains seem to come out within days.  I wish you the best as you go through this.  Take care of yourself, Joani",
      "MessageIndex": 1,
      "PostDate": "19/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759593",
      "Title": "Surgery caall1234 EnglishMajor"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 15, 2009 11:03AM joaniji wrote: Best wishes to Denise for a speedy recovery.  I am so sorry to hear that your treatment is causing difficulties.  It is so hard when something that is supposed to help heal, hurts.  Lots of warm wishes and positive thoughts are being sent your way.  May you soon have strength and energy!!",
      "MessageIndex": 4,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737413",
      "Title": "We have another sister in the hospital kenzie57 heatherpalmerton"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 29, 2010 07:41AM joaniji wrote: Thank you for sharing such wonderful news.  Your situation gives hope to others.  I wish you continued success, may you enjoy peace of mind and better health for a long time.  Take care.",
      "MessageIndex": 30,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747310",
      "Title": "Some Good News Kim_888 bourscheid"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 19, 2009 02:25PM joaniji wrote: Dear Heidi, I am so sorry to hear that you are having trouble with your port and are so sick.  You have been such a trooper to stick with the port despite the complications that you have had with it.  It sounds like you are resolved to having it taken out and this sounds like a great idea!  I truly hope that you heal quickly and can have another port placed, perhaps on the other side!  Warm wishes are being sent your way.  I hope that you can rejoin your family on vacation soon.  Please take care and hugs to you. ",
      "MessageIndex": 16,
      "PostDate": "19/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737588",
      "Title": "Infected Port Heidi_Ho konakat"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 17, 2009 12:09AM joaniji wrote: Dear Mary, You are almost there!! I know that it is so hard to continue fighting when you are tired and down but I believe that you will feel better in a short time.  Maybe making some changes in how you go through your treatment might help - perhaps a special friend can come with you or maybe you can have manicures at the same time or a stiff drink (only joking!) Whatever the means, mixing the program up a bit can help.  The best to you as you finish up.  Many supportive wishes and hugs are being sent your way. ",
      "MessageIndex": 9,
      "PostDate": "17/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737428",
      "Title": "I soooo don't want to do more chemo! MJ6266 Marybe"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 13, 2010 07:51AM joaniji wrote: Kerrilyn - I don't have TN cancer but I wanted to write anyway because your use of the word whinning got me thinking.  I don't think that you are whinning one bit!!  You are a young woman fighting a very scary disease.  Please feel free to unload here, while some like myself don't share your situation, we can offer support and encouragement as you look for ways to keep your spirit up as you fight your fight.  I am sure more women with TN will come along soon but, for now, just know that you are being thought of with warmth wishes.  ",
      "MessageIndex": 2,
      "PostDate": "13/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746683",
      "Title": "Stage IV triple negative 5 year survivors Kerrilyn Cathy-CA"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 14, 2009 12:54PM joaniji wrote: Dear Linda, I love your posts!  While I am a natural skeptic and in general someone who does things the \"hard\" way, I appreciate your attitude.  I say that whatever works to make all of us more comfortable in our journey then wonderful.  I wish that I could laugh more but not because I think it would make my cancer retreat but because it would make me happier!  Thanks for sharing your philosophy and your life experience.  I will try to bring more laughter in to my life.  ",
      "MessageIndex": 39,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742059",
      "Title": "Laugh and love your cancer back to health. Laughjoyfully CapeBretongirl"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 7, 2009 04:00AM joaniji wrote: Needles stink!!! Up until I got my port, I used lidocaine on my arm before blood draws. I also take a Norco pain pill before blood draws, mostly to help quiet the anxiety. Now that I have my port, the nurse takes the blood from there. I don't really see it and the prick is not too bad. I still take the pain meds though!!! Good luck with your treatment. Lots of empathy coming your way. Take care, Joani",
      "MessageIndex": 5,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738488",
      "Title": "After all I've been thru DianaT joaniji"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 27, 2009 10:30AM joaniji wrote: It takes courage to put yourself out in a public arena.  Thank you for representing all the women who are struggling like you.  COOL.",
      "MessageIndex": 9,
      "PostDate": "27/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740974",
      "Title": "15 minutes of Fame Fitztwins LRM216"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 7, 2012 01:11PM joaniji wrote: Oh da-m, I am so sorry to hear this news.  You are one strong and brave woman. I know that it is heart-breaking to have to tell your family this news ... when I was last struggling with this, a friend reminded me to take time to care for me and to trust that my kids/husband would then take care of themselves.  Easier said than done but maybe you need to focus on you right now so that you have the energy and emotional strength to move forward.  I am wishing you all the best.",
      "MessageIndex": 33,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782258",
      "Title": "friggin brain biopsy results :< chainsawz AnacortesGirl"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "May 1, 2009 01:47AM joaniji wrote: Dear Kristom3, I am so sorry to hear about your situation.  I can relate to much of what you said and to much of what you feel.  I am 44 yrs old and after 4 years was recently diagnosed with mets to the bone and small nodules to the lungs. It is so scary and overwhelming - especially, to me, when I think about my boys (11 and 13).  I am beginning to feel hopeful, and I hope that you will too once the shock subsides.  I am taking Lupron and Zometa and in the 3 months that I have been on this treatment, the bone pain has almost gone away and my tumor markers have fallen.  While the hot flashes aren't pleasant, I do think that this is a reputable course of treatment and a treatment that is relatively painless.  I know that it all seems so unfair, traumatic and painful right now.  It is awful but it is also possible to go on.  Give yourself time to grieve, only then will fighting this be possible.  All my hopes and best wishes,joaniji ",
      "MessageIndex": 9,
      "PostDate": "01/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733363",
      "Title": "3 Years Remission... now stage IV... Help! BcMomOf3 SAMayoFL"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 2, 2010 12:49PM joaniji wrote: I am not on Femara but have had success with Aromasin.  I have been on this med. for one year and am considered stable. My bone mets are beginning to heal and no new spots have been detected.  I wish you all the best as you begin this treatment.  I know that for some, it takes a few tries to find the right hormonal med.  I was on Tamoxifen following my initial diagnosis but this med failed me. At first I was skeptical that I could do well on hormonals vs. chemotherapy but I am so glad now that I have not needed a more toxic treatment.  Good luck.",
      "MessageIndex": 9,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747670",
      "Title": "homone therapy patti4511 lovinmomma"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 11, 2009 02:54AM joaniji wrote: Dear Heidi, I read your post with a heavy heart.  I know that this is a really awful time for you and that there is very little I can do to alleviate your pain.  I do know however, that you have an army of breast sisters behind you who are sending you much energy, compassion and support.  Please continue to use us all as your personal army!  You are faced with many tough decisions and difficult treatment options.  As a mother, I can relate to the wish to plan out the kids lives and to provide a protection plan that will guide them through the challenges of life.  When things feel so out of control, I know that the need to find a way to restore the balance of control is high.  Perhaps now though, the emphasis needs to be on taking care of you while keeping connected to your little ones in small ways.  It is the phone call you make to them from the hospital, the care package that you can have hubby deliver to them, the personal note that you can write from the hosp -- that will be treasured by your babes.  When you have energy, record your instructions, words of wisdom and sweet memories.   A dictation service can transcribe your recordings at a later date.  Right now, you need to focus on you for this will help the ones you love.  When you feel well enough staying connected to your kids in some of the ways familiar to them will likely help you both.  I think that the urge to micro manage this dreadful situation is so understandable but the bottom line is that no matter how much we do, our loved ones will deal with our illness in their own ways.  So, I think that it may be best to do what YOU need to feel as though you are retaining your beloved role as mother while you fight this miserable battle.  Just try not to expect yourself to do Everything!!  You are a fighter and a woman of strength.  Please feel the cyber hug I am sending you.  Be well girlfriend.  Love, Joani  ",
      "MessageIndex": 33,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 3, 2009 11:06PM joaniji wrote: May this message find you resting reasonably comfortably, enjoying the warmth and support of your family and happily counting the days until you are finished.  Wishing you well,Joani",
      "MessageIndex": 246,
      "PostDate": "03/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 16, 2010 02:37PM joaniji wrote: sorry to hear that you haven't been feeling well lately.  Just wondering if you are on a new medication that may be causing these symptoms? could it be arthritis? As you can see, I am trying to find something other than cancer, to link your symptoms to.  Probably a good idea to get a Pet scan sooner than later.  I truly hope that you end up having something innocuous and easily treatable.  I can relate to the ambivalence around wanting to know what is going on in my body and the intense desire to remain in deNile.  No easy resolution to this except when I look at my kids - seeing them helps to push me out of deNile and into action.  Maybe this is true for you?  Wishing you more comfort, Joani",
      "MessageIndex": 2,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758113",
      "Title": "Just asked My Onc for a scan .. I am concerned JeninMichigan meima-Bev"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 17, 2009 06:06PM joaniji wrote: Dear Heidi, Thanks for updating us.  I am sorry to hear that you are back in the hospital but I hope that it proves to be a hospital stay that results in improved comfort and health.  So glad that your kids visited - hope their love is helping to give you the energy to continue the fight.  We are all behind you.  Wishing you more comfort, peace and energy.  Hugs to you, Joani ",
      "MessageIndex": 110,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 6, 2009 07:43AM joaniji wrote: continuing to think about you Heidi.  Wishing you the ability to enjoy the long holiday weekend with your family.  I am wondering how you are tolerating the treatment.  Heidi's little bro, please share when you can.  Your keeping us updated on someone we have all come to care about so much, has been invaluable.  We send you support as well.  Take good care, Joani",
      "MessageIndex": 260,
      "PostDate": "06/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 18, 2009 03:14AM joaniji wrote: Dear Heidi, I am thinking of you today (actually I think of you everyday) and hoping that you are resting comfortably, enjoying time with your family and perhaps even gaining strength.  I am not giving up on you!!  Please be well dear breast sister.  May it be a peaceful day for you and your loved ones. Joani ",
      "MessageIndex": 424,
      "PostDate": "18/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 28, 2009 12:07PM joaniji wrote: Dear Ead, What a rough time you are having.  My heart goes out to you.  I think only yelling after the third time calling your daughter shows incredible patience!! No way should you be rudely criticized for this.  Engaging in normal parenting behavior is exactly what your daughter needs from you and what you need to do.  What is upsetting to me is that your husband seems to have given up on you and that attitude must be crushing to you.  We need our partners to hold the hope for us when we struggle to stay afloat, to encourage us to fight and to reaffirm for us our need to keep living.  Damm him for stealing this from you.  I sense that he is really troubled underneath and may need an outlet, other than you, for his depression.  I hope that you can find a quite moment to talk to him and to tell him how his words hurt.  Maybe then he can modify his ways and maybe get some HELP.   Be well. Much warmth is being sent your way.",
      "MessageIndex": 12,
      "PostDate": "28/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736603",
      "Title": "Cruel words from husband ead WendyV"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 7, 2013 05:19PM joaniji wrote: Hi DancingVeggie,  Just thought I would let you know that I live in Lakeview and have kids - they were in elementary school when I was diagnosed but now they are in highschool in the city.  Although I live in the city I go to Lutheran General for treatment.  If you want to email me at my personal email, please do so: joanig@gmail.com.  Maybe I can help you out.  Take good care, Joani",
      "MessageIndex": 4,
      "PostDate": "07/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807327",
      "Title": "Chicago Moms: Chemo Carpool? DancingVeggie EnglishMajor"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 16, 2010 07:56PM joaniji wrote: Hannah, this must be a frightening time for you and your mother, my best wishes go out to you both.  It sounds as if this is your mother's first progression since starting treatment for hormone positive mbc.  It is my understanding that hormonally driven cancers are first dealt with by using a variety of hormonal medication.  I take Aromasin but my onc is likely going to change me to Faslodex when progression in the bones is confirmed.  I think that chemo is used if the cancer spreads to the soft tissue or if widespread bone mets. occur.  Treatment should be specific to your mother though.  It sounds like she is in good hands at MDanderson.  Please don't assume that she is headed for a wheelchair.  As you will see on this forum, many many women live quite well with numerous bone mets.  Although I have mets to both hips, my spine, ribcage and chest, I continue to exercise and do most everything I have always done. Pain medication and sometimes radiation can work wonders by controlling the pain that bone mets can cause.  I wish you and your mother the best.  Please keep us posted. Joani ",
      "MessageIndex": 1,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758095",
      "Title": "Sacrum, Neck mass, possible Breast Wall, Doc Says New Meds hannah4 joaniji"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 17, 2009 12:13AM joaniji wrote: Hi Dana, My friend just got back from Vegas and had a great time.  She went to see the Bette Midler show and another show but I forgot what it was (menopause brain!).  It is hard to go on adventures when your health isn't necessarily stable but push through it - I doubt you will regret it.  Have a wonderful relaxing and fun trip!! ",
      "MessageIndex": 13,
      "PostDate": "17/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737417",
      "Title": "Going to Vegas and worried as usual.... WingsofHope EWB"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 30, 2011 09:02AM joaniji wrote: Hi Jen, I am a psychotherapist and the mother of a 13 yr. old who is on anti-depressant medication.  I think that medication can be useful if its' use is carefully monitored and supplimented by non-medical therapy (talk, art, music...).  It was very difficult for me to agree to put my son on medication and I continue to be concerned however, it was the right decision.  Medication can be very helpful, especially in a situation in which a child's emotional suffering is threatening to disrupt the activities and experiences that the child loves.  Panic attacks can be debilitating and if left untreated, cause sufferers to experience anticipatory anxiety.  While cognitive-behavioral therapy has been proven effective for anxiety, such treatment is sometimes just not enough.  Anti-depressants do carry some risk but when carefully monitored they can help kids settle down enough to be able to learn more effective coping strategies.  Sometimes, an anti-anxiety medication used on an as needed basis is enough to let kids experience success in dealing with difficulties.  It is such a tough decision but you know your child the best and I am sure that you will make the best decision that you can make.  Medication has helped my son continue to enjoy all that he loves and when he is ready, we will slowly take him off.  The best to you and yours, Joani",
      "MessageIndex": 13,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/773577",
      "Title": "Off Topic - Zoloft for preteen Anxiety???? JeninMichigan apple"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 14, 2009 12:35PM joaniji wrote: Liz, Thank you so much for posting about your experience at Heidi's memorial service.  Through your observations, reflections and descriptive writing, I feel like I had an opportunity to join her service.  Heidi's vitality, honesty, humor and compassion were evident from the day she started posting and her presence here and of course, in her daily life, will truly be missed.  Wishing her family comfort and healing. By the way I love her self-reflective comment on her popularity on the boards.  I am sure many of us can relate to this concern!  Heidi most certainly was a woman whose posts attracted others to her.   She continues to provide inspiration. ",
      "MessageIndex": 27,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742066",
      "Title": "Heidi's Memorial Service - October 12, 2009 elizzim AnnaM"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 21, 2009 01:42PM joaniji wrote: Hi Kirby, I am so sorry to hear that you are in intense pain and that the Aromasin failed you.  What is the matter with that darn drug!!  I was just wondering if you had an xray or bone scan to determine why you were in pain in a new area.  Just to let you know, I have experienced similar pain and an xray showed that I had two broken ribs due to cancer.  It does take ribs a long time to heal (so I hope that your's aren't broken) but you will feel better once the Zometa kicks in.   Wishing you improvement and comfort.  Don't hesitate to continue to check things out on this forum, if the answers help you ask more questions of your docs then great!!",
      "MessageIndex": 22,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742341",
      "Title": "I'm in PAIN kirby Krystyna"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 12, 2009 05:15PM joaniji wrote: River, I am so glad to hear that you are home and that you are more comfortable.  I can only imagine how powerful the experience will be for you to see your husband hood your son.  The ceremony will no doubt be extremely meaningful and perhaps emotional for you.  Congratulations to all of you on reaching this extraordinary milestone.  Wishing you many more celebratory occasions. Take Care, Joani ",
      "MessageIndex": 17,
      "PostDate": "12/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745277",
      "Title": "Home after week in hospital riverinerabbit vickib"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 13, 2010 06:11PM joaniji wrote: My sincere condolences to you and your family on the loss of your beloved sister.  I am so sorry that she was taken from you and that her situation was aggravated by reluctant doctors.  I hope that with time the pain of her loss will be soothed by good memories.  ",
      "MessageIndex": 41,
      "PostDate": "13/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746576",
      "Title": "my sister has died Rebecca2008 CrunchyPoodleMama"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Mar 26, 2012 09:08PM joaniji wrote: Congrats on being stable - that is great news!  I am not a doc. but my thought is that since the Abraxane worked well in getting your mets in control maybe the doc. wants to try a treatment that might be just as effective but a bit less toxic.  Faslodex is a newer hormonal treatment - it is usually given by injection in your butt.  The shots hurt a bit but since you only get them once a month, it is pretty tolerable.  In my case the side effects were minimal beyond the ache from the shot.  Sometimes Faslodex is used if you have already tried other hormonal meds and they stopped working.  Have you been on hormonals?  are you pre-menopausal?  The most in important thing is for you to be comfortable with the proposed treatment plan so, ask questions!!  Best of luck, Joani",
      "MessageIndex": 1,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784753",
      "Title": "Stopping Abraxane; starting Faslodex holdontohope vickib"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 12, 2009 02:18AM joaniji wrote: Perhaps I am feeling protectively toward you -- I would say GET A SECOND OPINION if you can, you don't sound as though you feel secure in the care your onc.  is providing.  I was diagnosed with bone mets after having a bone scan, pet scan, blood work and a bone biopsy.  My onc. also said that it was too hard to biopsy a hip so I had a small spot on my manubrium (chest) done. Although it was hard for the radiologist to get a big enough sample, the process was very comfortable and recovery swift.  I also had an x-ray of my hips, but this did not show the mets that were clearly evident on the Pet.  Be persistent, you deserve good care.  Wishing you all the best.",
      "MessageIndex": 6,
      "PostDate": "12/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741909",
      "Title": "Testing to make sure it's bone mets? Chelee joaniji"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 24, 2009 06:53PM joaniji wrote: Thank you all so much for your input.  I appreciate the advice and the good humor!",
      "MessageIndex": 8,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737914",
      "Title": "partial hysterectomy on Mon. joaniji lovinmomma"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 28, 2009 08:41PM joaniji wrote: just home from the hospital.  The surgery in itself was not bad at all but the gas - that is a whole different story!!  It has left me looking and feeling like a beached whale.  KLynn you were so right - the pressure under the ribcage is really uncomfortable.  If anyone has any suggestions as to how to get rid of this please let me know! Thanks again for your support.  One more step taken to stay ahead of the deadly estrogen.",
      "MessageIndex": 14,
      "PostDate": "28/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737914",
      "Title": "partial hysterectomy on Mon. joaniji lovinmomma"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 23, 2010 06:45PM joaniji wrote: Hi Janis, Wishing you many more years full of zest, new floors, vacations, good food, wine...Please consider coming to the MBCN conference in October.  I would really love to see you again.  For now, I am wishing you continued stable health and lots of living and lovin'.  Thinking of you, Joani ",
      "MessageIndex": 46,
      "PostDate": "23/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756854",
      "Title": "2 years ago...I was diagnosed with mets Fitztwins jenny66"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 10, 2009 06:30PM joaniji wrote: I am so sorry that you are having so much pain.  Bone mets are fickle - they can act up out of the blue, react to the weather.. and be affected by the meds we take.  While it is always good to get new symptoms checked out ASAP, I am hoping for you that the pain actually means that your body is healing.  I have been told that healing bones actually hurt! As the other women have said, the hormonal treatment and the Zometa can cause achy bones especially around the time of the infusion.  I hope that you find relief with pain meds and then can keep yourself moving.  I know that for me, the heaviness I feel in my bones is often partially alleviated by exercise. Best wishes for no bad news and much relief.",
      "MessageIndex": 6,
      "PostDate": "10/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741843",
      "Title": "ive been fine for nearly three months zeeka71 activern"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 12, 2009 11:18PM joaniji wrote: My thoughts and best wishes are with you. From reading the article about you in (crap, I can't remember the name of the magazine!) it is clear that you are determined and spirited.  I hope that the insurance co. sees this life in you and honors it by \"allowing\" you to get your treatment.  How appalling that you are in this position!  Best of luck, Joani",
      "MessageIndex": 30,
      "PostDate": "12/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745085",
      "Title": "I NEED YOUR PRAYERS!! CarynRose pitanga"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Mar 26, 2012 07:29PM joaniji wrote: Hang in there...there is hope!  I am also 47 and while I was initially diagnosed with stage 4 hormone positive mbc, in September the cancer spread to my liver and a new biopsy determined that I am now TN.  I know that the literature points to a bleak future for people with TN but please remember that statistics are not accurate reflections of what will happen for YOU.  I can tell you that the chemo that I am on (Xeloda) has done wonders for me.  I am not in pain anymore from my bone mets and my liver mets are too small to show up on scans.  TN does respond well to chemo -- I know that it is a major bummer to be on chemo and I truly have a lot of empathy for you.  It is a scary diagnosis and it is okay to be upset, furious, devastated...whatever.  Please know that you can come here for support and guidance.  I don't think that there is an emotion or side effect that someone here hasn't experienced before!  I am so sorry that this has happened to you.  Feel free to PM me if you like.  Take good care, Joani PS.  Results from scans are often confusing.  Sometimes things show up on one scan but not another.  Once you and your docs. get a full sense of what is going on, then you may choose to repeat one type of scan every three months or so, to monitor your cancer.  I stick mostly to PET scans because this seems to be the most reliable scan for me - you will see what is best for you.   ",
      "MessageIndex": 9,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784676",
      "Title": "Stage IV and Triple Negative kokonut Heidihill"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Apr 19, 2010 10:08AM joaniji wrote: Sounds like you are coming down off that ledge - thank goodness girlfriend.  The fear of the unknown is the worst!!  It is so hard to calm the mind - of course it goes to the worst case scenario.  Hopefully you can hear the compassion in the written responses here.  Have you had a bone scan? This might help to clarify the situation.  I truly hope that the numbness is one of those quirky things that just GOES AWAY.  Please know that we are thinking of you and hoping for the best.  Wishing you more comfort and a quick escape from the ledge!",
      "MessageIndex": 9,
      "PostDate": "19/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751327",
      "Title": "Hanging out on the ledge Alpal chainsawz"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 16, 2011 02:48PM joaniji wrote: Take good care.  Many wishes for a smooth delivery.  May the joy of holding your newborn bring warmth to your heart and energy to your spirit.  You will be in all of our hearts and minds.   Best wishes, Jaoni",
      "MessageIndex": 19,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/773176",
      "Title": "Update katie31 Lena"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 8, 2009 11:30AM joaniji wrote: Becky, First, I am sorry for your situation - it never feels good to sense that others are acting in purely self-serving ways.  I have only one point to add to the astute comments of the women before me.  I don't want to sound presumptuous but I think that you may be confusing the issues a bit.  I sense that you wish (totally understandable) that your husband be treated with the same respect and consideration that you may wish (again understandable) that others treat you given your cancer.  While I would hope that people would be sensitive to you and your husband, your husband's role in the engineering department and the expectations placed on him are likely going to be different than the demands placed on you (per the cancer).  If your husband has concerns about the situation and wishes for a different class load then he needs to act accordingly.  But to hope that he be treated compassionately because of you, may be unrealistic.  I wish this weren't true but I am afraid it is.  Support him all that you can but it is probably his issue to fight.  Perhaps you can help him by helping him to articulate his feelings and to come up with a reasonable way to broach this issue with the dept. head.  You have enough fighting to do!! I hope that this makes sense.  I wish you and your husband the best.  Good luck, Joani",
      "MessageIndex": 4,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738566",
      "Title": "Disappointment in Coworkers - how to move past this rkt rkt"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "May 22, 2010 02:01PM joaniji wrote: It is absolutely understandable that you are feeling so miserable but it is absolutely NOT what you need to be experiencing.  When emotions leave you feeling hopeless, helpless, lethargic and discouraged for over two weeks, it usually means something biochemical is going on.  This in no way means that you are not competent or not coping well , it just means that this crappy disease is messing you up!!  Meds can definitely help, it may take some experimenting to find the right one and make sure you check how the meds interact with the cancer meds. you are on.  Remember that all the treatments that we have to endure can also wreck havoc with emotions.  I know that I was a complete basket case when I took Tamoxifen and again when I took Lupron.  I used lexepro for a while and have a prescription for Ativan to use when needed.  Please hang in there and try not to be so hard on yourself.  We are all behind you.  I hope that you feel better soon. Joani ",
      "MessageIndex": 8,
      "PostDate": "22/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752978",
      "Title": "Sadness jleigh jleigh"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 24, 2013 06:19PM joaniji wrote: Sorry to say, but this does happen.  It happened to me!  I was diagnosed with stage 2 in 2004 and was Er+, in 2008 I was diagnosed with mets to the bone and a biopsy confirmed that I was still ER+.  Two and a half years later, I developed liver mets and a biopsy determined that I was TN.  It was a painful shock but I am still doing quite well, two years later.  There are many treatment options out there for TN.  Chemo can be very effective.  I am wishing the best for you and your wife.  I hope that your wife will tolerate her treatment well and that you can continue to enjoy your time!",
      "MessageIndex": 2,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/808222",
      "Title": "From ER/PR+ to Triple Negative sfhusb Latte"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 21, 2010 06:41AM joaniji wrote: Linda, I too, am so sorry to hear that you are not well.  I am sending all the positive energy I have your way (and some hope too!!).  I wish you peace, comfort, togetherness and resolution as you travel down the path to come.  ",
      "MessageIndex": 24,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758297",
      "Title": "How do you say goodbye? Nanalinda konakat"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "joaniji wrote: Hi everyone, I am scheduled for a partial hysterectomy on Mon. and was wondering what this surgery was like for other women.  I know that I will be relieved to not have to get the Lupron shots anymore.  These injections seemed to aggravate my bone pain.  While I know that this procedure should be relatively easy, I am surprised at some of my concerns.  I am not really nervous about the surgery but am a little sad that yet another of my \"female organs\" are going away!  I never expected that I would have this concern but here I am a bit sad about this.  Has any one had this surgery and/or felt this way about female stuff being removed?   joani Dx 1/1/2009, 2cm, Stage IV, Grade 2, 0/3 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737914",
      "Title": "partial hysterectomy on Mon. joaniji lovinmomma"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 26, 2011 04:49PM joaniji wrote: Yes Yes Yes!!  I am on Xeloda and I don't think that I have ever felt so emotionally vulnerable.  Sometimes there is no reason that I am sad but I am --- one more thing that we have to deal with.  I mentioned this to my onc. and she looked at me strangely (given my frame of mind, I might have misinterpreted her look!).  Best of luck dealing with this.  Wishing you a better day tomorrow. Thinking of you, Joani",
      "MessageIndex": 4,
      "PostDate": "26/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780017",
      "Title": "Does chemo affect you emotionally? blondiex46 vickib"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 4, 2009 08:55AM joaniji wrote: Thanks all - It is now one week past the surgery and I am finally feeling more normal. That gas was rather uncomfortable! My experience in the hospital was not the greatest. I am reminded all over again that I HATE HOSPITALS. Damm this disease! No one told me about the gas nor that the gas can cause referred pain elsewhere. My shoulder hurt like heck from the gas and I felt like I was a nutcase when I mentioned it to a nurse. There was no pain medication ordered for me and they did not have my regular medication to take. This was a major teaching hospital! The resident came to see me for 10 seconds and the medical students were good looking baby guys who said nothing! Excuse my rant, thanks for listening. Take good care lovely women, Joani",
      "MessageIndex": 18,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737914",
      "Title": "partial hysterectomy on Mon. joaniji lovinmomma"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 30, 2011 07:21PM joaniji wrote: Glad you posted this picture - it is a perfect picture of happiness - little boy enjoying Mom's kiss but protesting ever so mildly. Love ya! ",
      "MessageIndex": 50,
      "PostDate": "30/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771005",
      "Title": "Why I Keep Going Fitztwins Member_of_the_Club"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Apr 26, 2012 09:41PM joaniji wrote: Nice to hear from you!  Good luck with the physical therapy - I hope that it helps restore your strength and motion.  The best to you!",
      "MessageIndex": 39,
      "PostDate": "26/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786324",
      "Title": "any news from chainsawz marieibrahim Cathy2"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 14, 2012 08:57PM joaniji wrote: I just want to wish the best as you move forward.  I don't know about you, but for me the first significant progression that necessitated a major treatment change, was emotionally difficult.  I hope that you have enough goodness in your life to help you move forward with hope.  After a 3 year run on hormonals, I found out that I was TN and I started to take Xeloda.  If possible, I would suggest that you get a biopsy of the new spots - cancer characteristics can change.  I hope that because your cancer responded so well to faslodex it means that it will respond equally as well to a new treatment!  Wishing you peace and comfort, Joani ",
      "MessageIndex": 28,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780997",
      "Title": "Never get scans results on Friday the 13th LuAnnH MJLToday"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 11, 2009 03:41PM joaniji wrote: Dear Yvonne, I am just chiming in to wish you all the best as you cope with such awful news. I am so shocked by the pessimistic approach of your doctor.  I know that it is natural to respond to such news with intensity and despair.  I wish that I could fill you up with the strength and optimism of the women on this forum.  It is absolutely possible to fight this disease and to continue living with energy and positivity.  I hope that your little princesses keep you pushing forward.  While my mets status is different than yours, I have been living well for the year since I was diagnosed with mets.  I had mets to my lymph nodes that responded well to treatment - I sincerely hope that yours do too.  I received the bad news about my mets last Dec. so I know how hard it is to cope especially during the holiday season.  Take time for yourself, to cry, to rage...then do something loving for yourself. Best wishes,Joani ",
      "MessageIndex": 13,
      "PostDate": "11/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745212",
      "Title": "The \"get your affairs in order\" talk mossybaby RobinWendy"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 24, 2010 01:28PM joaniji wrote: Glad to hear that you are feeling a bit better Irina.  I hope that your appetite increases because losing all that weight is probably not the best for you.  Rest comfortably! Please don't give up hope - we all have a lot of hope for you! Joani ",
      "MessageIndex": 11,
      "PostDate": "24/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755760",
      "Title": "No Tx for me Irina dlb823"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 22, 2009 03:22PM joaniji wrote: So sorry to hear that your recent scans showed that the ugly beast was invading you again!!  I know that cancer any where is rotten but I am glad to hear that it is not in your vital organs.  I had a bone biopsy in January and from this experience I understand that the sternum is generally the best place to get a biopsy.  The radiologist who did the biopsy said that bone biopsies can be difficult and sometimes necessitate breaking the bone.  Yuck!!  In my case, it took about six tries (all done while I was semi-under) but a small biopsy was done (without breaking the bone) that confirmed the cancer.  The treatment that I am on involves Zometa (a bone strengthening med.) and an hormonal med.  I hope that your biopsy is done quickly and easily - make sure they put you in twilight zone!!  I am thinking of you with warm and optimistic thoughts.  Take good care.",
      "MessageIndex": 3,
      "PostDate": "22/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736303",
      "Title": "3 month scans tropicmom raro"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 10, 2011 08:57PM joaniji wrote: My heart goes out to you during this especially difficult time.  As a mother myself, I know how awful it is to see your child (no matter what age) in pain, especially with a pain that you can't fix with a motherly hug/advice.  I imagine that your son knows that you are \"standing by his side\" even if you can't always literally be there.  Take care of yourself -- all my wishes for healing, Joani",
      "MessageIndex": 14,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776210",
      "Title": "Out of remission, now my son has cancer mcbird edwh001"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 3, 2009 05:31PM joaniji wrote: Camdenandmo, Sorry to hear that you are not feeling too well.  After my first Zometa I had symptoms that reminded me of a bad flu (fever, aches and chills).  These didn't last long and only happened after the first treatment.  I have had four and have had no problems since.  I do find that if I remember to take a pain killer before the treatment, I really feel fine!  I hope that you rest, treat yourself well and feel better soon!! Joaniji ",
      "MessageIndex": 7,
      "PostDate": "03/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735235",
      "Title": "Started my Zometa lovinmomma konakat"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 2, 2010 02:55AM joaniji wrote: I grew up in Lexington, Mass. but have been in Chicago for the last 25 years.  I love the friendliness of the midwest but miss the beauty of the east.  Go Blackhawks. ",
      "MessageIndex": 63,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753351",
      "Title": "Where is everyone from? shelbyjane72 BarbaraA"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 3, 2010 01:50PM joaniji wrote: Hi Robin, It is really tough waiting - waiting leaves too much room for speculation.  I haven't figured out how to combat the mind going crazy with what ifs but I hope you are more successful than I am!  Actually, it does help me to keep busy - so I am so glad to hear that the trip to Israel is on.  I don't know if this trip has any spiritual/religious meaning to you however, I think that you will find the scenery (outside major cities) calming and the sense of history significant.  The falafel on the street corners is pretty good too!  I hope that you are tolerating the chemo well - are you?  I know that you wrote about feeling more tired - how are you.  Wishing you comfort, Joani ",
      "MessageIndex": 6,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756267",
      "Title": "I Spoke Too Soon But The News Is Not Bad RobinWendy Lowrider54"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 12, 2011 04:55PM joaniji wrote: Please check out The Metastatic Breast Cancer Network.  It provides a different message for October.  We need more treatments to extend our lives, not more pink blenders or panties!  Support MBCN's mission to advocate for more awareness and to push for more treatment options.  We all know that early detection is important but does not guarantee a cure.  There is no cure and it is about time that the public understands this!!  ",
      "MessageIndex": 3,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774681",
      "Title": "A different message in Oct. Chickadee Alpal"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 5, 2011 08:16PM joaniji wrote: Hi Tammie, Gosh you must be frustrated!  I am so sorry that you are in this position.  When I was first diagnosed with bone mets, I had a bone biopsy but it was so difficult for the radiologist to get a large sample.  As you have learned bone is hard to biopsy.  For now, are you being treated like your previous diagnosis?  When my liver mets were discovered in Sept. I consulted with an interventional radiologist who then did a biopsy.  My cancer went from being Er+ to being TN.  I am now even more convinced that repeat biopsies are tremendously useful.  Could you have a consult with an interventional radiologist even if your onc. thinks that a biopsy of your liver couldn't be done?  This might be helpful to you.  I wish you the best as you go through this.  Fight for what you want!  Take care, Joani ",
      "MessageIndex": 12,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779062",
      "Title": "USELESS BIOPSY tammie tammie"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 8, 2011 01:20PM joaniji wrote: I feel honored that you chose to share your thoughts and feelings with us, during what must still be, a very difficult time.  You remind me that when I am gone, my spirit can continue to live on in others and perhaps inspire them to battle a disease, or enjoy their littles ones more or treasure any given moment more...I am so glad that you have your memories to hold on to.  My hope that with time, your memories will diminish the sadness.  Thank you for sharing and the best to you, Joani",
      "MessageIndex": 4,
      "PostDate": "08/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776143",
      "Title": "My Amy- 6 months an Angel luvmywife MJLToday"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 8, 2009 07:20PM joaniji wrote: Dear Cindy, I am sitting here infuriated on your behalf.  I know that that does you no good but I just wanted you to know how much you and your partner were in my thoughts.  My heart goes out to you.  It is appalling that Chris' care is dependent on financial matters.  She deserves the best treatment out there.  I am wondering if contacting the patient advocate at the hospital where Chris is going for a second opinion, would be helpful.  I wonder also if it would be worthwhile to contact Breast Cancer Network of Strength for assistance.  I think that they have resources that assist people who are not sufficiently covered by insurance.  I wish I could come help you fight this battle but since that is not possible, I am sending you all the compassion and strength I can.  Hugs to you and Chris. ",
      "MessageIndex": 19,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737005",
      "Title": "I just don't FRICKIN understand cindoe cindoe"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Mar 23, 2011 07:03PM joaniji wrote: May Olga's memory be for a blessing.  My sincerest condolences on the loss of your beloved wife.  She will live on forever in your heart and the souls of your boys.  Warmest wishes to your family in this time of pain and sorrow.  ",
      "MessageIndex": 76,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766537",
      "Title": "Olga Simkin Z\"L leprechaun Bestbird"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 9, 2009 07:14AM joaniji wrote: I am continuing to think of you both and hope that you got some sleep and Chris is resting comfortably in the hospital.  Please keep us posted on your journey.  You both continue to be in my thoughts.  Warm wishes for comfort.",
      "MessageIndex": 22,
      "PostDate": "09/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737005",
      "Title": "I just don't FRICKIN understand cindoe cindoe"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 9, 2009 01:09AM joaniji wrote: Mindy - I am so sorry to hear that the scans showed some progression.  This is truly an agonizing disease.  I am familiar with bone mets but not with mets to the peritoneoum.  This is somewhere by the ovaries right?  I noticed that you are hormone positive, I am not sure of your menopausal status, but would a hysterectomy remove the mets? I am scheduled for one the end of the month and the docs. assure me that the surgery is not so bad. I am so glad that you feel able to start a new chemo.  I hope that it wipes the sucker out!! I have a port and think that it is wonderful.  It is comfortable and eases the psychological and physical pain of being stuck by a needle (which I really hate).  Best wishes for a smooth recovery from this.  Warm wishes are being sent your way.",
      "MessageIndex": 2,
      "PostDate": "09/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737125",
      "Title": "mets to peritoneum...what can you tell me??? morgansmom leggo"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 30, 2009 11:34PM joaniji wrote: I am sending my best wishes to Heather.  I wish her much comfort, peace and improved health. Take good care, joani ",
      "MessageIndex": 10,
      "PostDate": "30/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738170",
      "Title": "HeatherP is not feeling well Reneepals heatherpalmerton"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 8, 2011 07:04PM joaniji wrote: My onc. looks at trends in my marker numbers over a span of 3 months.  Since this is your first month with an elevated number, maybe it is a fluke!  Hold on to the knowledge that your recent scans were positive - see if you can take a big breath - and wait to see if your numbers continue to rise.  Sounds like you are due for a scan in the next month and I hope that the results give you peace of mind. Wishing you the best, Joani",
      "MessageIndex": 6,
      "PostDate": "08/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772836",
      "Title": "Markers Up, I'm Down lukejessesmom Bruburn"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 6, 2011 07:15PM joaniji wrote: I am sorry to hear about your recent diagnosis.  It is devastating but please keep hope alive.  This is what I am working to do!  I was diagnosed with mets three years ago and when the cancer spread to my liver in Sept., a repeat biopsy determined that I was no longer hormone positive - I was TN.  So, I am in there with you!  Please know that there is a lot of research being done to create more treatment options for TN.  I am on Xeloda and am relieved to report that my liver tumors are rapidly shrinking!  I wish you all the best as you fight this miserable disease.  You are not alone so don't forget to come here for support.  Take good care, Joani",
      "MessageIndex": 10,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778875",
      "Title": "Triple neg bone mets stage4 Hfitzpatrick1 Hfitzpatrick1"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 11, 2009 05:37PM joaniji wrote: Zeeka, It would be wonderful to get to know everyone a bit more but I am not comfortable with this process if it involves searching for the \"reason\" that we all got bc.  I have blamed myself enough and don't wish to encourage others to do the same.  If you would like more info. on who I am as a person - my family, job,  wishes, thoughts...then great, I will happily provide this.  Maybe a deeper connection is what you are looking for?  ",
      "MessageIndex": 16,
      "PostDate": "11/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741900",
      "Title": "get together on this zeeka71 allalone"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 4, 2010 09:50AM joaniji wrote: Hi Jennifer - I know that it doesn't really help with your reality but I think you should blame the Tamoxifen!! Your hormones are likely really out of wack and causing your body to protest, to hold weight, to sweat, to grow hair where you don't want it and lots of other \"lovely\" side effects.  I found Tamoxifen to be miserable.  I had wild mood swings and major hot flashes along with weight gain.  Have you explored with your onc. the possibility of using another hormone med?  I had my ovaries removed last summer and switched to Aromasin.  I feel soooo much better.  Maybe you would too?  You are doing so much - taking care of yourself, your farm, your job and your children, I wish that you didn't have to feel badly about yourself too.  Take good care, Joani",
      "MessageIndex": 13,
      "PostDate": "04/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756284",
      "Title": "Big and Sweaty :-( JeninMichigan Fitztwins"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "joaniji wrote: Hi All,  hey... did you see the info on the MBCN mets conference Oct 16? I've heard Kathy Miller speak and she is fabulous... some great topics are listed on the agenda - they have a TN talk and another talk on pain management and also chemo brain! Check the website www.mbcn.org . some financial assistance is offered for those who need help. I will be going and would love to see you there.  Is anyone else planning to attend? Let me know and maybe we can meet up in Indianapolis!  Be well, Joani  Joani  joani Dx 1/1/2009, 2cm, Stage IV, Grade 2, 0/3 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757108",
      "Title": "MBCN conference in October joaniji Fitztwins"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 24, 2010 03:43PM joaniji wrote: The Metastatic Breast Cancer Network (MBCN) is an advocacy group run by and for women and men with advanced breast cancer.  It has held conferences in the New York area, where its' leaders are from.  It is a wonderful group that is attempting to meet the needs of women like us.  Please consider joining the organization (there is no cost nor obligation).  This year the conference is in the Midwest and will focus on a variety of topics relevant to women like us. I haven't attended before but I do know that the women who lead this organization are wonderful.  The conference should give us an opportunity to learn more about our disease and to connect with others like us, battling this disease.  Please check the website out and consider attending!! ",
      "MessageIndex": 2,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757108",
      "Title": "MBCN conference in October joaniji Fitztwins"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 24, 2010 07:08PM joaniji wrote: Check out hotel information on the website!  There are three hotels to choose from - one is located where the conference is and two are close by.  I made a reservation to stay at the hotel at the conference site.  It is called something like University hotel and conference center (my brain is fuzzy).  I will be getting to Indianapolis Fri. afternoon and would love to meet up with anyone who wants to meet up.  Fitz, I am absolutely thrilled to hear that you are going to try to make it!!!!!!! To all - please consider coming! Joani ",
      "MessageIndex": 4,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757108",
      "Title": "MBCN conference in October joaniji Fitztwins"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 30, 2009 12:20AM joaniji wrote: Dear Heidi, I was on vacation in upstate NY. so I haven't posted in a while.  As I was on my trip though, I thought about you, knowing that you were somewhere close.  I continue to think of you often and to wish you as much comfort and peace as possible.  I remember that your rads are done on the 11th of Sept. so you are getting close!!  We all will be counting down for you!!  Glad that you are able to see your kids - hope that their energy flows into you.  Be well sweet bc sister. Joani ",
      "MessageIndex": 205,
      "PostDate": "30/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 13, 2009 07:45AM joaniji wrote: Oh dear Heidi and family, I just realized that your little brother had updated us with your sad news.  I am so truly sorry to hear that things have not been going well.  There are no words to express how I feel - I can only imagine the angst you and your loved ones feel right now.  I am so glad that you are able to rest at home surrounded by the ones you love and who love you.  Your presence through your spirit has truly been felt.  Now may you feel the spirits of all the women here who are sending your their strength and compassion.  Rest peacefully friend, Joani",
      "MessageIndex": 344,
      "PostDate": "13/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Apr 15, 2010 10:25AM joaniji wrote: May her memory be for a blessing. Warm wishes to all that loved her. Please stop this disease.",
      "MessageIndex": 23,
      "PostDate": "15/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751290",
      "Title": "BonnieVA is a Angel konakat ChocolateLover"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 20, 2011 09:49PM joaniji wrote: I am definitely looking forward to meeting you at the conference!  I wish that I could answer your questions but as my liver mets are a recent discovery, I am not sure what treatments are available (I am on Xeloda). I am sure that some more experienced people will come soon to offer their insight.  I just want to let you know that I am thinking of you.  I hope that you are going to attend the seminar at the conference on soft-tissue mets and the one on living with mbc.  I think that the seminar called Living with MBC (I am moderating this one) may also be helpful to you as the panel members have been fighting this disease for a long time and have lots of words of wisdom to share. Best, Joani ",
      "MessageIndex": 1,
      "PostDate": "20/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776782",
      "Title": "Update and Questions/Conference Baltimore AngelaMBlack72 justjudie"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 14, 2010 04:27PM joaniji wrote: Dear Anne, Welcome to this forum and to a group of women who will happily offer you the support and encouragement that you need.  It is so understandable that you are worried, frightened and acutely aware of every sensation that your body feels.  I do think that with time, you will start to be able to distinguish between new pain and the pain that comes as your body begins to heal.  I was diagnosed with bone mets a year ago and have been on a treatment plan of Zometa and Aromasin.  I was initially on Lupron but found that med to be miserable! I had a lot of aches and hot flashes on Lupron so, over the summer I had my ovaries out.  This was a relatively easy procedure and has enabled me to stop lupron and begin Aromasin.  You may want to ask your doc. if the Lupron could be contributing to your pain.  As I have two broken ribs myself, I can relate to the pain such a break causes.  With a bit more time, the Zometa should start to help - it took about 6 months before I started to feel better.  I am not sure of the significance of the CEA but the CA 26-27 can be useful if the marker initially reflected the cancer.  28 is a good number though, wonderful!   I am so sorry that you have to find yourself in this situation, please know that there are many women here to listen to and support you along this journey.  Take good care, Joani",
      "MessageIndex": 4,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748297",
      "Title": "Tumor Markers Anne45 Anne45"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "May 4, 2009 10:08AM - edited May 4, 2009 10:09AM by joaniji When my bone mets (to the ribs, vertebrae, sternum, and hip) were found on a PET scan I was sent to an interventional radiologist to biopsy a site to make sure the cancer was the same as the original bc.  The doc. ended up getting a sample from my sternum but he did say that it was difficult to do this because a biopsy from the bones often result in the bone breaking.  This definitely does not sound pleasant!  Maybe your doctor is concerned about the damage to the bone if a biopsy is done?  I feel for you - while I didn't want my bone to break I really did want to make sure that it was the cancer showing up and not something else.  I hope that you get some answers that feel sufficient for you.  Question the doctor!!  I am just learning to do this and it is hard but information can ease the anxiety.  Best to all.",
      "MessageIndex": 11,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733567",
      "Title": "biopsy for bone mets vivo joaniji"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 15, 2010 11:17AM joaniji wrote: Dear Patti, Waiting under any circumstance is tough but in your case, waiting is truly miserable and perhaps it is even your worse enemy.  Once you know what the treatment plan is, I bet that you will feel a bit better.  I am so sorry that this is happening to you; I know that you have been through so much and that the despair is overwhelming sometimes.  I say, put on those granny pjs (or sexy ones, your choice) hunker down and nurture yourself.  The unknown is a darkness that feels suffocating - we are all behind you, trying to bring some light into your life.  Don't pressure yourself to do a video, however you choose to memorialize your life is up to you.  Perhaps your lack of clarity on this issue is really your way of saying that you aren't ready to end this battle.  I wish you the best as you move forward.  Keep us posted, we care. Hugs, Joani ",
      "MessageIndex": 25,
      "PostDate": "15/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748247",
      "Title": "It is a bad sign that I am in my pj's pattih joaniji"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 18, 2011 05:21PM joaniji wrote: I had to have a tooth extracted and because it was causing sooo much discomfort, I made the decision to have it pulled even though I was on Zometa.  I didn't have any trouble.  I do think that the optimal way to handle this is to be off the bone med for a couple of months before you have your dental procedure.  I know from my own experience that this is not always possible so, if it is not possible for you to wait rest assured that the risk of jaw problems is very low.  My dentist said that extractions were not as likely to cause jaw problems as an untreated infection or a more invasive root canal.  Best wishes!",
      "MessageIndex": 4,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/773276",
      "Title": "Osteonecrosis of the jaw annafrederik annafrederik"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 20, 2010 10:45AM joaniji wrote: Welcome to this forum Dorit.  I imagine that this is not where you want to be but please be assured that while we don't want to be here either, we are a friendly, compassionate and intelligent group.  I am delighted to hear that your tumor was able to be removed; I have a tumor on my L1 (and lots more) but I didn't know that they could be removed.  It is wonderful that you are making life style changes to enhance your health.  I am wondering however, if you are taking any hormonal medication?  I do think that the medication is helpful and I hope that you consider using what your doctor recommends in addition to complimentary methods.  I have had multiple bone mets and now a node met, for the past two years and although I do have pain, I continue to do virtual everything that I have always done.  I hope for you that you have a long long time of good health.  Best wishes, Joani",
      "MessageIndex": 7,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759538",
      "Title": "Really need to hear optimistic stories Dorit dianemom2"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Nov 23, 2009 10:15AM joaniji wrote: Vivo,  I think that the stress and worry that you are feeling really are emotions that we all can relate to .  I am so sorry that you are feeling these feelings so sharply right now.  When I feel scared about a new symptom I have found it helpful to remind myself that the new symptom is not likely to kill me right NOW.  I know that this sounds odd, but reminding myself that cancer often grows slowly helps me to feel less overwhelmed and to believe that there is time - time to live and to fight.  Whatever the symptom is, it is likely that you will have time to get a plan in place and to FIGHT the cancer.  There are many treatments out there, please have faith that you will find something.  In the meantime, I think that RobinWendy's advice to compartmentalize is great.  It is so hard to do but imagine that cancer and then slam your mental door on it, and go tend to yourself.  Treat yourself compasssionately Vivo and come here for support.  We all care so much.  Joani",
      "MessageIndex": 14,
      "PostDate": "23/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/744304",
      "Title": "desperate feeling (for the moment) vivo lukejessesmom"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 17, 2011 01:09PM joaniji wrote: Can't wait to meet some of you and see \"old\" friends once again.  See you soon! Joani ",
      "MessageIndex": 21,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776553",
      "Title": "Who's going to the conference in Baltimore? rkt neogirl"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 6, 2009 09:44AM joaniji wrote: Cindoe, I am so sorry that you and your partner are experiencing such pain and anxiety.  While I am not a physician it does seem that there should be something out there to give Chris some relief.  You sound like a wonderful advocate for her - maybe an assertive attitude is necessary to insure that the doctors listen to her concerns and move quickly to provide relief.  I found that  a sports bra that zipped in the front was helpful to me following breast surgery.  Perhaps this might help Chris.  I am frustrated on your behalf!  Where is Chris getting treatment?  I wish I could give more pertinent advice but since I can't, I am sending what I can - lots of good wishes and hugs.  Take good care.  ",
      "MessageIndex": 5,
      "PostDate": "06/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737005",
      "Title": "I just don't FRICKIN understand cindoe cindoe"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Apr 17, 2010 05:31PM joaniji wrote: I am not on Falsodex but on Aromasin and I think that it took about a month before my bone mets started to feel a bit better.  I truly hope that for you, the meds work quickly!!  Pain sucks (gee isn't that profound).  Other than pain meds, I have tried a heating pad, warm baths, a gentle massage, food and booze.  Not really sure that the last two are really helpful but the distraction they provided was nice for a bit!! Hang in there - wishing you comfort fast.",
      "MessageIndex": 6,
      "PostDate": "17/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751413",
      "Title": "Pain Reneepals KasSha"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 9, 2009 01:26PM joaniji wrote: I am sending lots of good wishes for comfort and peace of mind.  I know that it must be agonizing to see your mother in this situation and to witness her rather rapid change in functioning.  Please trust that you made the best decision in placing her in a nursing home.  Perhaps with her basic care being handled, you will have more energy and spirit to connect with her.  I am sure that your love is the best medicine she could ever need.  ",
      "MessageIndex": 5,
      "PostDate": "09/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737145",
      "Title": "Prayers for my Mom Please Jadai hollyann"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "May 6, 2012 06:02PM joaniji wrote: Thank you for posting such meaningful and joyous pictures.  I completely get how important these milestones are.  I am so glad that you got to experience this one!  Your beautiful as is your gorgeous daughter and adorable grandchildren.  Congrats.  ",
      "MessageIndex": 11,
      "PostDate": "06/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787054",
      "Title": "Reached one of life's milestones! Cathy2 texasrose361"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 26, 2009 08:39PM joaniji wrote: Thank you all so much for sharing your stories and wishing me the best.  Today I had to drink this DISGUSTING liquid laxative (still waiting...). kk69z, I have been in chemically induced menopause for 6 months and although I have loved not getting my period the night sweats have been intense. I am hoping that the night sweats will go away? maybe this is just wishful thinking? It is so amazing what female hormones can do to us.  I will be glad to just have it all out - one less thing to worry about.  Thanks again to all. Joani ",
      "MessageIndex": 12,
      "PostDate": "26/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737914",
      "Title": "partial hysterectomy on Mon. joaniji lovinmomma"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 8, 2010 03:12PM joaniji wrote: I have learned from my own experience that understanding the pain behind bone mets is nearly impossible!! I too have mets to my sternum and have heard many explanations as to why the mets seem to act up at times.  It is true that when a new treatment starts, tumors often flare and cause pain that lessens as your body adjusts to the new protocol.  I have also heard that bone mets can hurt when they are dying (I especially like this explanation!).  Bone met pain can also be affected by the weather or by injury to the muscles that surround the met.  I guess that the most important thing is to treat yourself with compassion and bug your doctor to give you an explanation that you feel is sufficient.  I don't take pain meds much either but I really don't think that taking them means that you won't be aware of your cancer.  Pain meds might provide you some relief so that you can continue to do the things you love.  Your comfort is important.  I am thinking of you and wishing you the best.  Be well, Joani",
      "MessageIndex": 6,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753798",
      "Title": "Sternum Pain Lynn1 Lynn1"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Apr 17, 2010 11:18AM joaniji wrote: Ugg..the waiting and wondering is just pure misery!  I would imagine that your mind is going to all sorts of negative places; please know that we understand.  I know that it is easier said then done but if you can distract yourself this weekend with pleasurable activities, you might get some relief from the worry.  It is really too early to say that the lung abnormality seen on the x-ray is cancer.  Some spots can be cancer but some can also be indicators of minor illness or scarring.  It sounds like your docs. are going to evaluate the situation.  Please believe that if it is cancer, treatment can be effective.  There are plenty of women on this forum that are living well with cancer in their lungs.  I will be wishing the best for you.  Take care, Joani",
      "MessageIndex": 3,
      "PostDate": "17/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751391",
      "Title": "lung mets? finally Fidelia"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 12, 2009 09:51AM joaniji wrote: Dear Heidi, If I recall correctly, isn't today the last of your treatments?  I truly hope so!!!  Wishing you improved comfort, a rapid recovery and lots of warmth and joy.  Lots of love and support, your breast sister, Joani ",
      "MessageIndex": 320,
      "PostDate": "12/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 14, 2009 10:36AM joaniji wrote: Dear Heidi and family, I continue to keep thoughts of you close to my heart.  I am hoping that in your time of need you feel the presence of all who have been blessed to know you, your spirit has truly been felt.  Rest comfortably sweet breast sister.  To Heidi's loving family, I send you compassion and best wishes.  I know that this is an excruciatingly painful time for you all.  May peace and solace find you. Joani ",
      "MessageIndex": 368,
      "PostDate": "14/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 23, 2009 12:18PM joaniji wrote: Dearest Heidi and family, I continue to think about you all everyday wishing that I could do something tangible or even miraculous to ease your pain but sadly I can't.  The peace and resolve that your family exudes during this exquisitely painful time is remarkable and must be a reflection of your family's wisdom.  May Heidi rest comfortably and die peacefully.  Heidi, your willingness to share with this community your dilemmas, humor and inspirational personality has been a gift to your breast sisters.  With us you will live on. ",
      "MessageIndex": 526,
      "PostDate": "23/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 21, 2010 09:34PM joaniji wrote: Thank you for the laugh - you have a wonderful way with words! No camp in sight for me - ugg.",
      "MessageIndex": 5,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754398",
      "Title": "On a lighter note -this is all true pattih cwrightrn"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 3, 2013 03:04PM joaniji wrote: I am here too!  Diagnosed stage 2 er+ in late 2004 then with mets in 2008. When cancer spread to my liver in the fall of 2011, a biopsy confirmed that I was now TN.  Did a year of Xeloda and am now on Gemzar.  Bone and liver are now stable.  The best to you all!",
      "MessageIndex": 16,
      "PostDate": "03/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 17, 2010 11:13PM joaniji wrote: Thanks bmdaley!!  I am thinking of attending this conference and am interested in the travel grants you referred to.  If you have more information on this, could you please post it? Thanks so much.  I have never attended a conference by myself and I know that this makes me sound pathetic, but oh well, I am a bit nervous to go alone.  I would love to meet some of the women from this board - how did you guys meet up last year?  If you have a moment could you please post some of your thoughts on the convention?  Maybe this will help some of us decide to go!! Thanks again.",
      "MessageIndex": 2,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748450",
      "Title": "Conference for Women with Metastatic Breast Cancer bmdaley EGAL"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Mar 2, 2011 12:19PM joaniji wrote: Hi Tonya, I am sorry but I can't offer any advice on your situation but I do want to offer my support.  It seems like mets are equal opportunity invaders - showing up all over without making much sense.  I am sure though that someone more knowledgeable will come alone to answer your question.  I hope that the mets are not causing you too much discomfort (how did you know that they were there?).  I hope that treatment blasts them away.  Best wishes, Joani ",
      "MessageIndex": 1,
      "PostDate": "02/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765626",
      "Title": "Abdominal mets TonyaB Annie4"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 3, 2010 07:14PM joaniji wrote: Dear Elaine, I am so sorry to hear of your pain -- I certainly can relate to the intense pain that watching our children suffer brings about but please please know that depression can be treated.  As a psychologist, I can attest to this.  I hope that your daughter is exploring treatment options - remember that it often takes a try on several different medications to find the right one and the correct dose.  With the proper treatment and therapy, depression often abates within a month. There is so much going on in your life, no apologies for your absence from the board are necessary.  You are an immensely wise woman whose words of wisdom inspire many.  Perhaps it is time to slow down a bit and let others nurture you.  I wish you much improved health, rest, relaxation and peace of mind.  My best to you and your family, Joani  ",
      "MessageIndex": 4,
      "PostDate": "03/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761491",
      "Title": "Finding it hard to focus ElaineD LC815"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Nov 6, 2011 01:30PM joaniji wrote: Hi Karen, Wonderful news that your cancer has regressed! I know that from my own experience, sometimes positive news triggers a fresh bout of sadness.  I don't know really why this is but I think it may be due to the fact that when you have been fighting hard and intensely for something and then the goal is achieved, there is still a ton of energy left.  Not knowing what to do with the energy is completely understandable.  Do you relax and feel safe or do you press on preparing for the next battle.  No easy answers.  I hope that you can give yourself some time to feel however it is you feel without feeling guilty about not feeling the way you think that you should!  Living in the land of gray is not easy nor comfortable for most of us.  I wish you the best as you move forward and am sending you a cyber hug!  Let us know about the vaccine trial at JH - I will be hoping that it will be successful for you. Best, Joani",
      "MessageIndex": 9,
      "PostDate": "06/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777465",
      "Title": "why is it that i feel down when i am making everyone feel up LilSchatzie joaniji"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 24, 2009 12:48PM joaniji wrote: Thank you Anne and KLynn so much for responding to my questions!  Like KLynn, I am having just my ovaries and tubes out laproscopically.  I should have made that clear!  I really appreciate the honesty in terms of explaining the recovery and the GAS.  I had heard that the gas could be pretty miserable.  Like most women, I am denying the fact that the surgery could slow me down!  I needed the reminder to be careful for a bit - it is so hard for me to ask/receive help.  I have to work on that!! Thank you so much for the support.",
      "MessageIndex": 4,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737914",
      "Title": "partial hysterectomy on Mon. joaniji lovinmomma"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "May 7, 2010 07:53PM joaniji wrote: Oh Fitz so sorry to hear your news.  Unfair to have to cope with cancer and its nasty assault and to have to be told that you can no longer participate in a trial.  I hate the word failure.  I hope that the switch in meds. will be a good one for you.  I know that it is rough to leave this trial but I am glad that you discovered that it was failing you sooner vs. later.  Best of luck to you as you try a new treatment.  Glad your long drives are over.  Take good care, thinking of you, Joani",
      "MessageIndex": 21,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752335",
      "Title": "I am out of my trial. Fitztwins 3katz"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 21, 2010 05:50AM joaniji wrote: Living with uncertainty is a true burden and an awful consequence of this cancer.  I know that it feels terrible to be filled with anxiety before your scans, but it is SO understandable!!  Please give yourself some compassion and nurture yourself in any way that you can.  Food, drink, massage whatever... I will be thinking of you.  Anti-anxiety meds. can also help - do you have some?  I will be thinking of you and wishing you the best. Joani ",
      "MessageIndex": 9,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758292",
      "Title": "I NOW KNOW WHY imbell justjudie"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 11, 2009 08:18PM joaniji wrote: Dear Susan, I am so sorry to hear that you are suffering -- cyber hugs being sent your way.  You are a woman of strong faith, may this faith bring you comfort and renewed hope.  Hope the docs come up with a tolerable treatment that will kick the cancer out of the door!! Take good care, Joani ",
      "MessageIndex": 10,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738762",
      "Title": "petscan results back not good kbugmom jader"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "May 30, 2012 02:00AM joaniji wrote: Wishing you the best as you go through this surgery. I am not sure from your post exactly how you feel about this...I hope that you feel that this is the best option for you.  Wishing you comfort and peace, joani",
      "MessageIndex": 12,
      "PostDate": "30/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788269",
      "Title": "it's always something apple K-Lo"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 12, 2010 09:18PM joaniji wrote: Hi Janis, Your boys are beautiful, or should I say, handsome!  I think that they look like you.  I know that this day is so significant to you; birthdays are always meaningful but I think that given our precarious situation, birthdays are intensely meaningful - happiness tinged with introspection and perhaps sadness.  I get it.  Today, I hope, you are filled with joy and pride.  Go eat some cake!!  See you soon, Joani ",
      "MessageIndex": 24,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759233",
      "Title": "My babies are 10 today!! Fitztwins jeanne46"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 17, 2009 07:43PM joaniji wrote: Dear Linda, Speaking only for myself, I am sorry that you need to leave the board.  I feel like your post(s) challenged the safety of the world that I seem to live in.  A world full of \"rules, scientific knowledge, procedures and stoicism\".  I truly appreciate your opinion even if it is foreign to me.  Your posts reflect your optimism and strategy for handling this miserable illness.  I love hearing about methods and means that others use to cope.  It is through the suggestions of others, even ones seemingly mystifying to me, that I challenge myself to try new ways of looking at the world and my place within it.  Thank you. ",
      "MessageIndex": 94,
      "PostDate": "17/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742059",
      "Title": "Laugh and love your cancer back to health. Laughjoyfully CapeBretongirl"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 30, 2009 06:59PM joaniji wrote: Happy times for you!!  May this period of good health last a very long time so that you can continue to do the things you love!!",
      "MessageIndex": 35,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741197",
      "Title": "Stable and some shrinkage.. Fitztwins sushanna1"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 16, 2009 02:49PM joaniji wrote: Irina, So glad to hear your good news.  I hope that your improved health continues for a long long time.  Thanks for sharing your pictures.  You are a marvelous photographer and the pictures transported me on a mini cyber vacation.  Take care, Joani",
      "MessageIndex": 15,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738967",
      "Title": "Good News Irina hollyann"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 20, 2010 01:22AM joaniji wrote: Thank you for posting such wonderful news.  I am so delighted that your wife is in much better health.  I imagine that this is a tremendous relief to you both.  I say go out and ENJOY as much of life as you can (and tell us your stories!).  I wish your wife continued improved health and the both of you much happiness and joy.",
      "MessageIndex": 9,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759591",
      "Title": "NED! SeanE texasrose361"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 30, 2011 04:31PM joaniji wrote: Thank you so much Katherine for your endless advocacy, creative ideas, sense of humor and dedication to raising awareness. I look forward to using your suggestions. Best, Joani ",
      "MessageIndex": 6,
      "PostDate": "30/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775737",
      "Title": "MBC Awareness Day Tweets & FB Updates You Can Use EnglishMajor Marie50"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 26, 2010 08:18PM joaniji wrote: Hi Ejnova, Glad that you found your way to this site.  Although no one wants to be a member of this group, it is a truly welcoming and supportive community.  I am so sorry that you are dealing once again with cancer; it is wonderful however, to hear that you are feeling well.  I have been taking Zometa and Aromasin for the past 14 months to treat bone mets.  The treatment has been working and I am now much more comfortable and have not experienced any progression.  I am feeling more confident that bone mets can heal and that this form of cancer can be considered a chronic illness.  I wish you success with your treatment plan; may you have many more years of relative comfort.   ",
      "MessageIndex": 19,
      "PostDate": "26/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748880",
      "Title": "stage IV breast to bone mets ejnova reesie"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "May 1, 2010 11:26AM joaniji wrote: My understanding of why some docs order bone biopsies and others don't is that some times it is possible to do a bone biopsy without major destruction to the bone but sometimes to do a biopsy would involve breaking the bone and this is not good!  My onc. said that it was a good idea to do a biopsy if possible though because the biopsy would help determine the hormone status of the tumor.  My bone mets were diagnosed four years after my initial diagnosis with stage 2 bc so the biopsy was necessary to determine if the cancer was the same as the first one.  Hope this helps.  Best to all, joani",
      "MessageIndex": 71,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748880",
      "Title": "stage IV breast to bone mets ejnova reesie"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "May 7, 2010 06:56PM joaniji wrote: Glad to hear your news lissyross. I am so happy for you.  I will be sending positive wishes your way for continued improvement. Take care, Joani ",
      "MessageIndex": 78,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748880",
      "Title": "stage IV breast to bone mets ejnova reesie"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Apr 12, 2010 02:05PM joaniji wrote: Hi Bonnie, I had AC after my first diagnosis of bc when I was 40, almost 6 years ago.  I also had a muga scan before beginning treatment.  Although the muga scan was strange - this was my first exposure to all the machinery that gets used with women like us - it was painless.  I found AC to be very tolerable.  I did lose my hair and feel a bit under the weather, I was able to go to work the next day with no problems.  Frankly, once of the most troubling aspects of this treatment for me was when the drug began going in to my veins. It is a red color and looks kind of disturbing going in.  I hope that you have as easy a time as I did with this med. combo.  I am wondering though if you are hormone positive? I have bone mets as well and am currently being treated with hormones and Zometa.  Is the chemo going to be used to fight the liver mets? I really wish you the best.  Please keep us posted as to how you are doing.  I am glad that you decided to post here!!  Take care, Joani ",
      "MessageIndex": 22,
      "PostDate": "12/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751112",
      "Title": "ADRIAMYCIN & CYTOXAN ???? BUTTERFLYBONNIE BUTTERFLYBONNIE"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Apr 18, 2012 08:42PM joaniji wrote: I am so saddened by this news.  I had the pleasure of meeting Dana at the MBCVN conference in October.  I had invited her to share her story with our attendees and she did so, with grace, dignity and humor.  At that time she appeared vibrant and energetic.  I will be forever grateful to Dana for sharing of herself the way she did and for demonstrating that trouble could be faced with quiet fortitude and deep spirituality.  May her transition be peaceful and as comfortable as possible.  Thank you to all of Dana's friends and loved ones who are easing this process for her by surrounding her with love.  Thank you Dana.  You are in my heart, Joani Please see mbcn.org for a video of Dana presenting her story. ",
      "MessageIndex": 3,
      "PostDate": "18/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786065",
      "Title": "WingsofHope - Dana Alaina MJLToday"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 7, 2009 05:43PM joaniji wrote: Hi Renee, Your brand new baby grandson is absolutely adorable.  I also love the picture of baby Joey's uncle Sal (is Sal  your son?).  I am so glad that your family has the opportunity to enjoy a healthy baby - to me, babies are a demonstration of the beauty of life.  Enjoy the joy and fatigue this little one will bring.  Congratulations to all. ",
      "MessageIndex": 4,
      "PostDate": "07/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740082",
      "Title": "My First Grandchild Reneepals EGAL"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 29, 2010 03:48PM joaniji wrote: If you do decide to start Zometa, there are some precautions you can take each time your visit your dentist.  I have a prescription for an antibiotic to take just before and after dental procedures (including cleanings).  As far as more significant dental work, I was told that the risk for future jaw problems is generally low so, it is okay to go ahead and do the dental work.  If you have the opportunity to get the work done, perhaps at a dental clinic with a sliding scale, it would be beneficial to get it done before starting Zometa.  I am not aware of other drugs that don't have the same potential risk.  Zometa has worked wonderfully for me and I hope that it will help you.  Good luck.",
      "MessageIndex": 14,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747483",
      "Title": "Zometa caall1234 Judiiiii"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 26, 2011 05:45PM joaniji wrote: Thanks for the heads up! so sorry that you had to experience this.  Sounds like your experience was similiar to mine - I watched extreme makeover today and the story was about a woman (with three kids) fighting metastatic colon cancer. Needless to say, it was heart-breaking and way too close to home but I simply couldn't turn it off.  It is taking me a while to rebound from this - maybe for you too.  I am hoping that you feel better about this soon.  I saw a great movie called the Artist.  I highly recommend this one although your boys may not like it too much.  Wishing you happiness and peace, Joani",
      "MessageIndex": 4,
      "PostDate": "26/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780016",
      "Title": "Bad review- we bought a zoo Fitztwins bkglenn50"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 23, 2010 04:56PM joaniji wrote: Oh Irina I am so sorry to hear that you are not feeling well.  I know that it is such a disappointment to have to miss treatment.  I hope though that the little break gives your body time to recover and come back even stronger.  I wish you much comfort and improved health.  My thoughts and support are with you, Joani",
      "MessageIndex": 1,
      "PostDate": "23/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755760",
      "Title": "No Tx for me Irina dlb823"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "May 1, 2010 07:49PM joaniji wrote: I am sorry that I can't provide any advice to you but just wanted to say that I hope that you feel better soon.  Check in with your doctor - it is okay to call on the weekend if you aren't feeling well and are worried about your symptoms.  Good luck.",
      "MessageIndex": 1,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752067",
      "Title": "ascites becky1 katie11"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Nov 24, 2009 12:06PM joaniji wrote: I can completely relate!! I had an ooph. in July and since then sex has hurt like heck! The pain really dampens the interest and the anticipation of pain does nothing to help!! I have found that lubricant helps as does altering your position - to put it bluntly, try being on top.  Good luck and give yourself a break! you have been through a ton - take your time.  Be well.",
      "MessageIndex": 7,
      "PostDate": "24/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/744428",
      "Title": "sex following oopherectomy jmar19 Nelke01"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jan 25, 2012 02:46PM joaniji wrote: In addition to talking to your mom's oncologist, I would recommend talking directly with the radiologist or event the technician would did your mom's scan.  I know that everytime I go for a PET they ask me if I have had a reaction to the injection/contrast.  Please be your mom's best advocate!  You are wonderful for exploring this for her.  Best wishes.",
      "MessageIndex": 9,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781562",
      "Title": "Pain/Discomfort after PET? mzsumthing joaniji"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jun 21, 2010 07:38PM joaniji wrote: Ah sh-t Fitz what a bummer!!  Had this happen once shortly after giving birth.  Made a mad dash home from the park but didn't quite make it.  Prayed no one would see.  These are the kind of things that make having cancer funny in a very twisted way.  Maybe depends would help (only kiddin').  Thinking of you and wishing that I could be having a drink by the lake with you!   Be well friend, Joani ",
      "MessageIndex": 1,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754407",
      "Title": "WARNING: Tykerb and Pineapple juice does not mix!! Fitztwins kimmie68"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 22, 2009 05:37PM joaniji wrote: Tontoandme, It doesn't matter that I don't know you because we are all connected here in our fight to thrive!  I appreciate your sensibilities, maybe it is the Midwest thing.  I am in Chicago \"enjoying\" another cold and rainy day.  Today I ate 2 pieces of humungous stuffed pizza - comfort food of any kind is sure good!  Sorry to hear of your current difficulties but glad that you reached out again.  Welcome.  Myself, I prefer a good margarita - have you tried one?  I wish you the best on your journey.  Please visit us soon and keep us posted.  Sending you cyber hugs, Joani ",
      "MessageIndex": 19,
      "PostDate": "22/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742533",
      "Title": "Just taking time to talk tontoandme pip57"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Dec 28, 2011 04:06AM joaniji wrote: Chele, so sorry to hear that you are experiencing emotional swings with Ativan -- I can completely relate.  Every time I take an anti-anxiety, I am an emotional mess the next day.  Sounds like you have a terrific plan in place to wean yourself off of this mess.  I give you so much credit for checking this out - better than feeling as though something was really wrong with you.  Nothing is wrong - tearfulness is a true side effect for some.  I have found that using a med called Trazadone at a low dose (50mg) at night as a sleep aid, works wonderfully without the side effects of Ativan.  I recommend that you talk to your doc. about this.  Although I am not a physician, I am a psychologist who has worked with lots of psychiatrists who recommend this drug.  I hope that you get relief soon.  Thinking of you and wishing you a restful night, Joani",
      "MessageIndex": 16,
      "PostDate": "28/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780052",
      "Title": "Ativan causing depression? chele Heidihill"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 4, 2011 07:21PM joaniji wrote: My heart goes out to you.  It is so hard to celebrate sometimes - I understand that the joy is tinged with sadness.  I do think that you are not alone in this so be kind to yourself and think of all of us who stand with you in this tough time.  My oldest son is also turning 16 this fall and while I will be celebrating the fact that I am here to share this day with him, there will be a sense of loss threatening to break though.  It is also so hard to keep emotions in check when pain is so awful.  I am hoping that you get answers quickly.  I had horrible neck and shoulder pain that was accompanied by nerve tinging...it turned out to be bulging discs.  My situation was helped so much by physical therapy -- maybe this is something to try.  I wish you all the best.  Take good care, Joani",
      "MessageIndex": 16,
      "PostDate": "04/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774192",
      "Title": "Struggling Through Today lukejessesmom china"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 13, 2009 09:28PM joaniji wrote: Dear Pat, It is always rotten to hear that there is progression - I am so sorry that you are experiencing this.  It is my understanding, as someone with bone mets, that bone mets are definitely treatable.  Like Fitz, I also take Zometa on a monthly basis.  This helps fight the cancer while strengthening the bone.  My onc. does not recommend radiation as a treatment due to its potentially damaging effects.  I wish you the best and I hope that you experience pain relief soon.  Shortly after beginning treatment for the mets, I did notice that I was feeling better.  I hope that this happens for you!!  Be well, Joani ",
      "MessageIndex": 9,
      "PostDate": "13/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738838",
      "Title": "Now bone mets, need encouragement wayover20 kbugmom"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 5, 2010 01:35PM joaniji wrote: I am so glad to hear that Kimberly is feeling better - what a frightening ordeal for your whole family.  My heart goes out to you all.  Wishing you all comfort and peace.  Keep coming here for support, you certainly deserve it.",
      "MessageIndex": 110,
      "PostDate": "05/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757424",
      "Title": "Today was frightening day Kimberly is in ICU dhmeiser RobinWendy"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Mar 16, 2010 08:03PM joaniji wrote: Frankie, I am sorry to hear that this is happening to you now.  I have had bone mets for the past 15 months and I have never heard my multiple lesions referred to by their size.  I do know that if you have a PET scan, the lesions are assigned a value - the lower the value the better.  In order to confirm bone mets, it is common to have a biopsy.  This can be hard to do if the bone is not easily accessed.  My biopsy was of the sternum - the radiologist said that this was the easiest place to reach.  I do think that if you don't have a biopsy, then a follow up bone scan would be helpful.  It is often hard to advocate for yourself in such an emotional time - is there someone who could push for a scan on your behalf? It is common to have scans (bone) every three months.  I hope that your next scan reveals that the lesion is due to an old injury!!  Best wishes to you for more comfort.  Enjova - welcome to this club - while no one wants to be here it seems that we make a good community.  Glad to hear that you are not in any discomfort - I hope that this continues for you. Are you also having Zometa? This is a drug given by infusion that helps fight the cancer in your bones as well as heal the existing lesions.  The best to you. ",
      "MessageIndex": 36,
      "PostDate": "16/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748880",
      "Title": "stage IV breast to bone mets ejnova reesie"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 2, 2010 04:29PM joaniji wrote: I am not sure if the symptoms you are experiencing are from the Lupron but I can tell you that I found the side effects from Lupron miserable.  While I don't recall feeling the symptoms that you are feeling, other side effects from this med. made me irritable and uncomfortable.  Not that I am wishing surgery on you, but has your doc. talked to you about having your ovaries out? I had my ovaries out (at Lutheran General) over the summer and I feel soooo much better.  No more Lupron!  If you have any questions about this please pm me.  Good luck finding answers and relief.",
      "MessageIndex": 2,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747691",
      "Title": "Zoladex (lupron) hand/foot pain/stiffness? EnglishMajor Reneepals"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 21, 2009 11:00PM joaniji wrote: It sounds like you have a treatment plan in place - I hope that knowing what you can do to fight this provides you with some hope.  I just want to wish you the best.  With time, I hope that you can feel like it is possible to continue on living your life to its fullest, don't give up!!  Sending you lots of healing energy and warm thoughts.",
      "MessageIndex": 10,
      "PostDate": "21/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740688",
      "Title": "Encouragement for Brain Mets denisela DARLENEDENISE"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Nov 1, 2010 04:04PM joaniji wrote: Thanks for the information Katherine.  This article helps clarify what it is Komen actually does and where the money they raise goes. Now that I know that the money raised stays local, I suggest that all of us Illinoisans lobby Komen to spend more on research, treatment and care of metastatic women.  What do you all think about the way the money is directed?  I don't know the actual facts but it does seem that resources are directed to early detection and treatment of early stage bc.  These of course, are worthy areas to focus on but what about us? Should we band together in our respective states, to push Komen to do more for us?  I would like to.   Joani ",
      "MessageIndex": 1,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760166",
      "Title": "Balanced view of Komen EnglishMajor ibcmets"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 29, 2010 10:35PM joaniji wrote: Wonderful news.  Thanks so much for sharing.  Sending you wishes for continued stability.  Enjoy!!",
      "MessageIndex": 19,
      "PostDate": "29/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758659",
      "Title": "good news with stability :) vivo undecided8"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 8, 2009 09:07AM joaniji wrote: Thanks Sherri and Donna for your responses.  They are truly valued.  I guess that I am also wondering whether any one here with bone mets is given other tests to determine their bone health.  While I ache sometimes more than other times, I wonder how at risk my bones are.  Do women with mets fracture easier? do we need more calcium? is there anything other than Zometa that can help with the repair of bones?   I can certainly relate to being a ticking time bomb - I think we all are. Thanks to everyone who might respond, Joani ",
      "MessageIndex": 3,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741666",
      "Title": "bone scan confusion joaniji Alpal"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 11, 2009 01:04PM joaniji wrote: Dear Linda, Please don't be so hard on yourself.  I do think that whatever we are engaged in that is not good for us (relationships, eating patterns, work...) is part of our attempt to survive.  Sometimes, even bad relationships are serving needs that we have.  You are incredibly strong to now decide that you don't need this man in your life - I am sure that, although he is a bum, there are things that he has provided you that have felt good to you.  I guess the first part of getting out of a rotten situation is figuring out what needs were filled while in the lousy relationship.  Once you know what you got, then you can figure out new ways to get those needs met.  I hope that I am not sounding preachy - I am just trying to share some thoughts that I have.  It is so darn scary having this disease that it is soooo understandable that perhaps most of us at some point, stick with what we know even if it isn't the best.  Trying to tackle change when things can seem so out of control, can be overwhelming.  I wish you all the strength possible to make the changes that will, I hope, give you peace of mind and contentment.  The best wishes to you.   ",
      "MessageIndex": 7,
      "PostDate": "11/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737245",
      "Title": "Putting up with bad relationship b/c I'm StageIV kenzie57 AliceJean"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Apr 12, 2010 12:57PM joaniji wrote: What an upbeat attitude you have!!  So glad that you can find the humor in the darkness.  The best to you as you begin this new treatment.  With all my heart I am hoping that it works.  Take good care.",
      "MessageIndex": 30,
      "PostDate": "12/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/750843",
      "Title": "WELL DAGNAMIT ONTO JIM BEAM heatherpalmerton heatherpalmerton"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 14, 2010 12:56PM joaniji wrote: Wishing BMDaley much comfort and peace.  Thank you for bringing this to our attention.  ",
      "MessageIndex": 12,
      "PostDate": "14/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756727",
      "Title": "Please pray for Beth (BMDALEY) WingsofHope littletower"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Feb 6, 2012 09:50PM joaniji wrote: Welcome - there is hope!  I was originally diagnosed with hormone positive metastatic bc in 2008 but when the cancer spread to my liver in Aug. a new biopsy determined that I was TN.  I was definitely frightened and overwhelmed when I heard that news but here I am 5 months later.  I am on an oral chemo called Xeloda.  There is a separate thread devoted to this chemo, if you are interested.  My scan just a few days ago showed that the liver tumors were all gone.  Please don't give up hope!  I hope that things go well for you - take good care. Best, Joani",
      "MessageIndex": 10,
      "PostDate": "06/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782201",
      "Title": "Metastatic TNBC - any survivors? rahimaw Bestbird"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 24, 2010 08:52AM joaniji wrote: My heartfelt condolences to Kendra's loved ones.  May her memory be for a blessing.  ",
      "MessageIndex": 22,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757111",
      "Title": "Another Angel - Times3 (Kendra) dreamwriter 3littlegirls"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "joaniji wrote: Hi breast sisters (as Heidi said), I am confused because I just had my third bone scan since being diagnosed with bone mets and I find the reports confusing.  The radiologist uses language like worsening cancer, no change and slight improved when referring to the multiple mets that I have.  The onc. then says to me - it doesn't matter if the spots are worse or better it just matters if there are new ones.  On the one hand, I should find that reassuring I guess but I find it hard to ignore language like worsening mets..Who to believe? Is there any way to measure improvement? Do I just sit back and wait for the cancer to spread?  I felt really off after my appointment and I can't figure out why?  I would love your input/support.  Thanks much, Joani joani Dx 1/1/2009, 2cm, Stage IV, Grade 2, 0/3 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741666",
      "Title": "bone scan confusion joaniji Alpal"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Jul 24, 2011 08:00PM joaniji wrote: Hi Janis, been there and done that! My oldest (15) won't let me forget that in a fit of anxiety and frustration I called him a f---ing brat.  The problem is that because he is a teenager, he won't let me forget that I screwed up and did this ONCE.  The blessing of your sons youth is that they are less likely to hold on to this one episode and to use it to antagonize you!  Honestly, don't let this incident become evidence of your parenting.  I think that it is okay and absolutely understandable to lose it every once in a while - it lets others know that you are vulnerable too.  A few cosmos are definitely in order.  I wish you all the best as you go through your scans - the anticipatory anxiety has a life of its' own and can be so hard to get a handle on despite your best efforts.  It will pass.  Best of luck also with your foot - are you in pain.  I hope not.  Warmth and compassion, Joani",
      "MessageIndex": 16,
      "PostDate": "24/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772102",
      "Title": "I am Mommy Dearest Fitztwins blondiex46"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Sep 15, 2009 12:27PM joaniji wrote: Peace, comfort and warmth to all who loved Mena.  Another senseless loss.",
      "MessageIndex": 29,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740382",
      "Title": "mena got her wings... celia088 Irina"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Aug 9, 2010 06:46PM joaniji wrote: Hi F&F's Mom, (had to shorten your name - hope you don't mind!). Like you I have multiple bones mets (entire chest area, vertebrae and hips) - I exercise regularly on the the elliptical machine.  This machine is low impact and can be adjusted for difficulty.  I used to run but I can't really do that any more.  I find that any exercise that involves standing for a long period of time is difficult.  The suggestion to try swimming is a wonderful one.  If I had a pool nearby, that is definitely something I would do.  I know that the risk of fracture is higher for us bone metsers so I do try to avoid any risky activities.  Basically I think the goal is to keep moving but to be careful not to push too hard.  I hope that you find an activity that you are comfortable doing because for me, activity helps remind me that I am living and surviving!  Best, Joani ",
      "MessageIndex": 3,
      "PostDate": "09/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756550",
      "Title": "Safe exercises for bone mets frankandfernsmom YogaLady"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 15, 2009 11:04AM joaniji wrote: Goodbye beautiful and inspirational woman.  Thank you for sharing your insights, personality and journey with us.  Wishing Amber's family comfort and peace.  ",
      "MessageIndex": 18,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742156",
      "Title": "Mrs_X_Sunneedazee (Amber) dmacw janie44"
    },
    {
      "AuthorID": "joaniji",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43693/profile",
      "Content": "Oct 12, 2009 06:04PM joaniji wrote: Happy Birthday Linda, I wish I knew how to post a cute graphic but I am computer challenged.  So please just accept my heart felt wishes for a wonderful day.  May it be the start of a year of comfort, peace and joy!!  Enjoy. ",
      "MessageIndex": 19,
      "PostDate": "12/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741999",
      "Title": "Today Is My Birthday Nanalinda heatherpalmerton"
    }
  ]
}