{
  "AuthorID": "JoanDavies",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
  "Posts": [
    {
      "AuthorID": "JoanDavies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
      "Content": "Feb 3, 2011 08:38PM JoanDavies wrote: I had my BMX/TE recon last Wednesday. Scheduled for the PS tomorrow (please take out the drains!)... I\"m curious to identify all the sensations I'm experiencing in my chest area. I'm all numb yet tingly. Is that the TE, or healing from the surgery, or the tubes from the drains, or a combination? Or is it a phantom pain? The BS did a nipple sparing, but I'm pretty sure I'm going to lose them - they are look like they are scabbing over or something. How can you tell if the nipples won't make it? I'm also worried about the implants - I've been reading so many stories from others who have had terrible implants with multiple revision surgeries. If the placement of the TE is any indication, I won't be happy with my results - they are spread far apart, almost to my armpits. I would appreciate any advice so I can talk intelligently with the PS tomorrow. ",
      "MessageIndex": 445,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "JoanDavies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
      "Content": "Feb 12, 2011 02:35PM JoanDavies wrote: First night last night after drain removal, and no sleeping on the side yet. The chest area is still a little too sore for that. My BF loves the filled TEs and can't wait to pounce on me. They look kind of cool, but so weird to touch, and look nothing like me at all. The PS said when he does my exchange, he can reduce the size of my nipples if I want (had nipple sparing, and they seem to be doing well). I think he thinks my nips are freakishly large or something, but he said since I'm used to them he doesn't have to mess with them. Yes, Mr. PS, please leave my nipples intact, that's what makes me feel somewhat like my old self. Funny how the TE doesn't look that big with clothes on, but naked I feel like I look huge. Always something...",
      "MessageIndex": 545,
      "PostDate": "12/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "JoanDavies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
      "Content": "Mar 3, 2011 07:57PM JoanDavies wrote: Rennasus - I hate these bricks in my chest too. I keep bumping them on things and not even realizing it until I feel this weird pressure but no pain. They come so far out to the sides that I can't put my arms together. I feel like I'm wearing this strap-on chest plate and I want to take it off and feel my normal breasts. Fortunately, it looks a little more normal than it feels, except that I now have a \"crumb catcher\" as all of my shirts have this gaping hole between my TEs. I keep dropping food in the hole that I have to fish out. The last time I experienced this was when I was pregnant and my boobs were huge before going back down to their bitty B cup size. ",
      "MessageIndex": 641,
      "PostDate": "03/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "JoanDavies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
      "Content": "Feb 4, 2011 10:40PM - edited Feb 4, 2011 10:41PM by JoanDavies Hey, everyone. Visited my PS today and got two of the four drains removed. I was so disappointed to be stuck with the other two for another whole week! I was worried about my nipples because they are kind of scabbing over, but the PS says that's normal, and everything looks good so far. I'm just supposed to put neosporin on it to help it heal better. I was reading on another site about iodine (taken orally and applied to the breast). Does anyone know anything about this? Also, the biopsy came back negative-node, which I understand is good, but I'm still supposed to see an oncologist for treatment options next Friday. What does that mean? I still have some cancer in there, they didn't get it all? It's a little confusing to me. The BS did say there was a small bit of cancer behind the right nipple (I had DCIS in the right breast, although I got a BMX to be safe), but he didn't seem concerned enough about it to take the nipple away. (Should I be relieved or worried now?) Seems like I read stuff online and get as educated as possible but the BS and the PS kind of pooh-pooh anything I ask or say. ",
      "MessageIndex": 460,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "JoanDavies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
      "Content": "Feb 9, 2011 01:12PM - edited Feb 9, 2011 01:16PM by JoanDavies I started driving about five days after surgery. I'm pretty sure I wasn't supposed to, but there was no way around it. Wasn't too bad, except I couldn't get the seatbelt in a comfortable position around my chest and I kept catching my drain tubes on things. What a nuisance. Hardly anything coming into the drains now and I'm so impatient to wait until Friday to remove them. Lucky ducks who can side-sleep now. Back sleeping is torturous after a while. I agree the TEs feel weird, and there's the oddest combination of numbness and tingling going on. I feel like my boobs are under my armpits, they're so far off to the side. I hope the implants will make me look a little more normal. I'm excited to get my fills and so happy that at least I'll never droop again. There has to be something good out of all this and aren't we lucky that we at least have some options these days? I can't seem to get warm in my chest area... Does anyone else have this problem? I'm assuming it's because there's no tissue there, but between the tingling, the numbness and the cold, it's kind of unpleasant. Maybe we need to invent a chest sweater or something... ",
      "MessageIndex": 515,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "JoanDavies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
      "Content": "Feb 11, 2011 05:59PM - edited Feb 11, 2011 06:05PM by JoanDavies Saw the onc and PS today. Onc said I only need Tamoxifen - no chemo or rads as my tumor is only .2 (whatever the measurement is). So that's pretty good news. Going to start reading up more now on that procedure, as it seems to have some pretty serious side effects if you're not careful. And apparently you have to go through a whole bunch of other testing as well (bone density, CT, blood tests), and see a counselor and nutritionist. Seems pretty thorough, although I seem to be finding as much information here as I would actually seeing someone.  The PS took out my last two drains (thank goodness! I had a total meltdown last night thinking that I wouldn't get them taken out because I was still producing a significant amount of fluid). He was hesitant about taking them, but went ahead and removed the drains, theorizing that the fill would prevent further fluid buildup. So he put in 100cc in each TE, which is in addition to whatever was in there to start. So I think I'm already bigger than I was 2-1/2 weeks ago. I feel like a Hooters girl with these globes stuck onto my chest. I find that I'm paying attention to all the sensations going on with the TEs and my muscles, which seem to spasm now and then kind of oddly. So, since no rads, I only have to wait three months to get the final implants. And I can go back to work at the office on Monday. Feels good to kind of put things back to a normal order, even though things are anything but normal anymore... All the best to those who have a more challenging road than I do.",
      "MessageIndex": 541,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "JoanDavies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
      "Content": "Mar 1, 2011 12:15AM JoanDavies wrote: hillck - thanks for the info. I did tell my PS several times I don't like the way the TEs are coming out to my armpits and please make sure the implants are in closer on the exchange. I'm not sure how much attention he is paying though. He did show me the high projection implants he is planning to use, which are not as spread out as the other ones he has (I guess what you refer to as the base), so I'm hopeful what I've said has sunk in a little. I keep bumping my chest on things and it feels so weird (although I don't actually feel anything). It's like a have something strapped to the front of me and I just want to take it off.",
      "MessageIndex": 623,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "JoanDavies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
      "Content": "Feb 6, 2011 05:19PM JoanDavies wrote: Hillch - Thanks for the advice and encouragement. If there's one thing I know about all this, it's so very confusing! I'm a little envious that everyone else's drains have come out so quickly after surgery and I have mine for more than two weeks before they come out. I'm not quite sure what's up with that. Re: the bras - I haven't worn mine since the first couple days home from the hospital. I was never much of a bra wearer anyway, and my TEs are about the same size as what I was before the BMX, so I'm not really missing much. The PS said it wasn't mandatory to wear a bra (those phony girls aren't going anywhere), and since I had the nipple sparing operation, I've been trying not to squash the nipples and let them breathe, lol. Seems kind of silly, but seeing my nipples poke through my tank really helps me cope with what was taken away.  I have another question for anyone who might be experiencing the same thing... There's this spot on either side of my back that really hurts, I'm assuming it's a muscle (kind of near the shoulder blades and upper arms). My boyfriend massages it for me and it hurts incredibly during the massage, but feels so much better after that I'll endure it. A friend was thinking that maybe it's a muscle that's connected to the breast muscle that's being stretched. Sounds reasonable...? ",
      "MessageIndex": 480,
      "PostDate": "06/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "JoanDavies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
      "Content": "Feb 26, 2011 06:04PM JoanDavies wrote: My PS seems to believe in filling to the brim quickly, so I had my final fill yesterday, which was actually only the second of two fills. The first was 100cc each and yesterday he stuck in 200cc each. So, I have 500cc each total, and holy cow! It hurts to move! I see some of your PSes go the slow and ateady route, but mine just squirted them in and said, nah you shouldn't need any pain pills for this. I'd like to see him filled up with 500cc of fluid in his chest and not need a freakin' pain pill. Ugh. Hopefully, I will adjust quickly enough and by the time I get to do my exchange in May, I'll be comfortable. My BF does like the way the TEs look in a t-shirt though!",
      "MessageIndex": 613,
      "PostDate": "26/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "JoanDavies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
      "Content": "Feb 27, 2011 08:51PM JoanDavies wrote: mdg - I'm one month post-op also, and my PS said he'd rather get the fills in sooner than later, so there's time to adapt before the exchange. I feel completely abnormal, although my BF thinks I look hot. At 500cc total on each side, I am NOT getting anymore put in there. This is plenty big enough for me, as he said he's using high projection implants and what I see right now is pretty much what I'll see after the exchange, just softer (thank goodness). And hopefully not into my armpits like they are right now.I can't even bring my arms in front of my chest like a normal person. Sigh...",
      "MessageIndex": 615,
      "PostDate": "27/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "JoanDavies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
      "Content": "JoanDavies wrote: I read somewhere else that injesting iodine, as well as \"painting\" it on your breast, is supposed to help with cancer recovery. Just small amounts, but on a regular basis. Does anyone know anything about this treatment? Joan Dx 12/28/2010, IDC, 2cm, Stage I, Grade 3, 0/3 nodes, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764450",
      "Title": "Iodine as Treatment JoanDavies JoanDavies"
    },
    {
      "AuthorID": "JoanDavies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
      "Content": "Jan 30, 2011 06:55PM JoanDavies wrote: Everything you guys are talking about, I'm sitting here nodding my head - yep, yep, yep. My chest feels like an alien is going to pop out of it, I can't poop to save my life, and I'm conflicted about how much pain meds to take. My BMX was Wednesday, went home Thursday afternoon, been sitting so much my butt is flattened by the couch, I think. I'm so ful of mixed emotions right now, I'm not really sure who to talk to or how to react to things around me. So, reading about you all really helps me deal with this better. :)",
      "MessageIndex": 385,
      "PostDate": "30/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "JoanDavies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
      "Content": "Jan 31, 2011 10:00AM JoanDavies wrote: Can you add me to the list of mastectomies? Mine was last Wednesday, Jan. 26. I had a BMX with TE. Sitting at home with the drains, recovering and whatnot. Fortunately, I'm able to telecommute with my job during the recovery phase, but I seem to find myself gravitating to this website and reading what everyone else is doing to deal with this whole thing.",
      "MessageIndex": 391,
      "PostDate": "31/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "JoanDavies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120501/profile",
      "Content": "Feb 7, 2011 08:18PM JoanDavies wrote: Went into work today for a short time. I'm not really cleared to go back, but I asked if I could just take in a couple of meetings and the PS was like...ok...said some other stuff, but all I heard was blah blah blah because I really wanted to go to work. I feel physically fine, and working helps keep me mentally sane. But I also don't want to risk infection with those stupid drains. I have my two drains hanging on a shoestring around my waist, so I look like a really ballsy guy. :) I had the pooping issues too - OMG felt like I gave birth to a baby from the backside, I have never had that much pain going potty. Seems like I can only go sporadically, so I'm assuming it's the meds filtering through our systems that make us so irregular. I keep feeling my TEs and trying to figure out what's what inside my boob skin. I love seeing how you all are doing and the similar yet different reactions we're all having to the same ugly word \"breast cancer.\"",
      "MessageIndex": 495,
      "PostDate": "07/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    }
  ]
}