{
  "AuthorID": "joanna69",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111029/profile",
  "Posts": [
    {
      "AuthorID": "joanna69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111029/profile",
      "Content": "joanna69 wrote: Well, since my last post in Oct. I have had a mamogram and Ultrasound. The Radiologist said he saw 2 cysts and a suspicious area. I dont know what that means but now I have been scheduled by my dr. to see a breast surgeon on Dec. 2.  The oddest thing is that my left armpit (same side as suspicious breast), is quickly changing. I notice that there are some very firm lumps in it which I did not have a month or two ago along with a couple growing lumps in my neck (left side). I have a bad feeling about all this but hopefully I will find out soon.  What concerns me most right now is that having breast implants, I am not sure they can do a needle biopsy? The radiologist said rupture was a risk. I also had my fallopian tubes clamped and due to the metal clamps, cannot have an MRI hence the BS appt. What will the breast surgeon do then?  I feel like they wont be able to do anything in regards to testing. I am not sure what happens from here. Suddenly, it all feels very complicated. : (  Sorry to vent but I guess I will know more after Dec.2.  Big hugs to all you ladies. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/761239",
      "Title": "Mamo, Ultrasound, and next the BS joanna69 leaf"
    },
    {
      "AuthorID": "joanna69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111029/profile",
      "Content": "joanna69 wrote: I called and made an appt for the dr. to check out this breast lump this morning and the one on my lower left ribcage. Neither one of these hurts. Its such a strange feeling......I almost have a surreal sense of calm on one hand that its all nothing and then a totally panicked feeling, Lol. I basically feel like I am totally losing it going back and forth between these two emotions. Geez. I hate this waiting to find out whats going on. : (   My sweet hubby keeps telling me Not to worry. I AM Trying but its really hard at times until I see the dr and she tells me what to do next.  Yikes. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759284",
      "Title": "Dr. Appt today for lumps--so nervous joanna69 alwaysworried03"
    }
  ]
}