{
  "AuthorID": "Joannes_sister",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64643/profile",
  "Posts": [{
    "AuthorID": "Joannes_sister",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64643/profile",
    "Content": "Joannes_sister wrote: To all of Joanne's bc 'sisters', I know that I will not be able to adequately express this, but I felt compelled to thank all of you for many things. First, your outpouring of support to our family and all of your kind words, thoughts and prayers have touched all of us.  We are overwhelmed by your kindness and truly feel your support. Thank you for all of the words of wisdom, encouragement, hugs, prayers and strength that you have provided to Joanne over these months.  For most of this time, I didn't know that all of you were along on this journey, and it gives me great comfort to know that you have been here with Joanne all along.   Thank you for providing a safe place for her to express her thoughts, fears and wisdom.  I know that she protected her family from alot and I'm grateful she had a place where she could really be herself. I am so lucky to have had her as my sister for all of my life.  I have always known how amazing she is, and have been blessed with her presence, her wisdom, her kindness, her strength, her passon, her humour, her energy and her great compassion. I can see from all of your comments, that you have benefitted from all of this too - wow, you have no idea how much that means to me.  It is so gratifying to know how many people she touched and how many people have touched her. You are my heros and I wish you all peace and happiness in your lives. With hope and gratitude, Joanne's sister, Kelly Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "21/03/2008",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702624",
    "Title": "Words cannot express... Joannes_sister Traci-----TripNeg"
  }]
}