{
  "AuthorID": "jobigsister…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137976/profile",
  "Posts": [
    {
      "AuthorID": "jobigsister…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137976/profile",
      "Content": "Oct 23, 2011 09:15PM - edited Oct 23, 2011 09:17PM by jobigsister Tiffany, I so appreciate your offer. I am really glad that I have come to this site and met such wonderful people like you. I would love to meet you someday as well. I will get in touch with you. I go Tues. morning for a new Mammo and Ultrasound. I have to go to the downtown TMC and my daughter in law is taking me this time. I am hoping that they will move things along faster and that there has been no change since the July reports. Scares me I had to wait so long. I will keep you posted. How are you? I know that with 2 small children this must be such difficult time for you. Thank you so much for your kind offer! JO",
      "MessageIndex": 10,
      "PostDate": "23/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776625",
      "Title": "BiRad 4 US need biopsy jobigsister TifJ"
    },
    {
      "AuthorID": "jobigsister…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137976/profile",
      "Content": "Oct 18, 2011 03:48AM - edited Oct 18, 2011 03:50AM by jobigsister Thanks so much GiGil.  I am in the state medical program and will be starting the Mammo and US process from square one.  I have now been awarded Workmens Comp for the ankle. So there is some money I can use.  It is amazing that illness can bring out the worst in family and friends. Life is difficult already for my daughter and for some reason she is terrified of any illnesses. She tries to help but has a phobia about germs. We have a semi good relationship otherwise. She is afraid to drive and any disruption in her normal routine creates severe anxiety. I also come from a family of 9 children. Believe it or not they all have very busy lives.  There may be one sister who is in Nursing School right now that may be able to help if I can get my appts. when she is not in school. My husband was a very depressed person. We had lost our business of 10years in 2009. He just quit on life. I tried to carry the weight. He depended on me. When I could no longer support us and the future looked scary he went home to his daughter. Very sad. I was not surprised. I am a fighter and always will be. I know if I have Cancer I will do what I have to do to fight it. Do you understand any of the verbage in my diagnosis? Is blood flow to hyperechoic areas more concerning? I know you may not have that answer but any info would help. Again, thank you so much for your concern and advice. I will be praying for you as well. God bless. JO",
      "MessageIndex": 2,
      "PostDate": "18/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776625",
      "Title": "BiRad 4 US need biopsy jobigsister TifJ"
    },
    {
      "AuthorID": "jobigsister",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137976/profile",
      "Content": "jobigsister wrote:  2 suspicious lesions in right breast were found on July 28th. #1hypoechoic mass which has isoechoic tissue within the cystic structure. Soft tissue has positive blood flow. 0.5 x 0.6 x 0.4 cm. #2 hypoechoic mass which is anechoic inferiorly and hypoechoic superiorly with a septation. There is blood flow to the hyperechoic area. Over all size measures 0.7 x 0.9 x 0.4. Was ordered to have a biopsy. 1 day before consult with Breast Surgeon I fell an broke my ankle. Very severe Trimalleolor fracture. Had to postpone. Husband left and disappeared after ankle fracture. My daughter who is very unsympathetic had to bring me home to Missouri to care for me as I could not even go to the bathroom by myself. This type of fracture takes a very long tome to heal. I am in the State medical system and the soonest appt. to start over all breast testing will be Oct. 25th. My daughter has stated that since it will be downtown that she will not take me. She also stated that if it is cancer she will not help me in anyway. She said she will not allow her home to be disrupted and I will need to find someone else to care for me. She did bring me to her home but she has been so hateful at times and makes me feel like I am dirty and an extreme burden. Dear God I am so scared. Just need some ideas on how to cope. I have no idea what the US means Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776625",
      "Title": "BiRad 4 US need biopsy jobigsister TifJ"
    },
    {
      "AuthorID": "jobigsister…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137976/profile",
      "Content": "Oct 18, 2011 06:17AM jobigsister wrote: PLJ, just knowing that there are others who care means so much. I have never felt so alone in my life.  Scared is just part of my emotions. I know that God will send the right people at the right time who will not humiliate me, abandon me and who just love me. You are very kind and I am ever so grateful. How is your progress coming along? I hope and pray for you with my heart that all will go well for you. I just want to find out so I can know what to do next. Limbo so sucks!",
      "MessageIndex": 4,
      "PostDate": "18/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776625",
      "Title": "BiRad 4 US need biopsy jobigsister TifJ"
    },
    {
      "AuthorID": "jobigsister…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137976/profile",
      "Content": "Oct 20, 2011 08:49PM jobigsister wrote: Thank you everyone for the kind words.  I will be seeing the Dr. Tues. Oct.17th. I have no idea what will happen first. The clinic I am going to told me they will most likely start with a new Mammo and Ultrasound. Hoping they will move quickly. It has been over 3mos since the first set of tests. Having such a hard time sleeping. Wake up every hour or two. Have had severe hot flashes and a racing heart that makes me feel panicked. Very weird. I am post meno and these are different. They started over 6mos ago. Wonder if it is connected to the lesions?  TifJ I am in the Lee's Summit, Independence area. I go back and forth between my Son and Daughter. I have been sleeping on my Daughtersn couch and when I have a Drs. appt for my ankle my Son brings me to his house. He has been taking me to appts when he is off.   Marie, it was an Ultrasound that detected the blood flow. I think it was a Doppler. I agree with you about not researching too much. It does confuse me more. I am praying that there is another explaination for the blood flow as well. The radiologist was extremely intense when he talked to me about the results. He made it sound like they will have to be completely removed. They are not palpable. He really scared me.  PLJ, I can only imagine the feelings you felt. I know I was floored and as soon as got to my car I broke down. I thought it would be routine and no big deal. The first Mammo the Tech told me not to worry if I got a call back and that I had very dense breasts and they may need another look. When she called back and said I was to come again and also have an ultrasound I worried. She also said that it would be read that day. Shook me up for sure.  I have thought of you and the girls who have replyed to my post all evening. I am so blessed to have your support. I don't feel as alone now. I will keep everyone posted on my progress. I will sleep better knowing there are others who are there fore me. Blessings to all of you. JO",
      "MessageIndex": 8,
      "PostDate": "20/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776625",
      "Title": "BiRad 4 US need biopsy jobigsister TifJ"
    }
  ]
}