{
  "AuthorID": "JoJo2341",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103155/profile",
  "Posts": [
    {
      "AuthorID": "JoJo2341",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103155/profile",
      "Content": "Jan 23, 2011 08:31PM JoJo2341 wrote: I did TCH chemo starting last May and had Lumpectomy in Oct. and finished 42 rads. Met with my MO and was told my cancer markers were normal and that he would like me to go for a 2nd opinion. I went to that appointment and it was recommended that I do 4 cycles of Adriamyicin chemo 2 weeks apart. She told me that it would decrease my chances of a recurrence by 30 %. I will stop my weekly Herceptin while I do these 4 cycles then restart Herceptin after to finish out my year which will be in May. She also said I need to do 5 yrs of Aremidex as I am ER+. I know this is what I need to do and am set up to start next Fri. How do you get in the right mind set for chemo again? The first time ignorance helped and you just seemed to float thru it. Any help you all can give will be appreciated",
      "MessageIndex": 18,
      "PostDate": "23/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763235",
      "Title": "Anyone do Neoadjuvant AND Adjuvant chemo? NannaBaby anna4969"
    },
    {
      "AuthorID": "JoJo2341",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103155/profile",
      "Content": "Jan 24, 2011 01:18AM JoJo2341 wrote: Nanna I know what you mean by freaking out! My family and close friends are freaking out also and that is not helping. God I hate BC!  I have spent the day telling myself this is what I need to do and trying to get into the right frame of mind. Will be glad to go to work tomarrow and not think about it till I have my first cycle on fri.",
      "MessageIndex": 21,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763235",
      "Title": "Anyone do Neoadjuvant AND Adjuvant chemo? NannaBaby anna4969"
    }
  ]
}