{
  "AuthorID": "jojo38",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168219/profile",
  "Posts": [
    {
      "AuthorID": "jojo38",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168219/profile",
      "Content": "jojo38 wrote: Hello all, I have been on these boards just a couple of times, but I am still trying to figure out who to navigate through forums. My name is Jo-ann in So Cal, 39 yrs as of Feb. 12th, recently dx w/the following: 04/2012. Misdiagnosed right breast 01/30/13 Triple Neg 6.5cm right 02/15/13 Estrogen & HER2+ 1cm left 02/28/13 Possible mets 2 lungs (nodules both sides) = Stage IV BC I've been emotionally challenged and as a wife & mother of 2 girls (8 & 12), I am trying to do my best to be strong. Was wondering if there's anyone out there that has survived this staging? I have been told by my doctors I am a rare case and that worries me. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801485",
      "Title": "Any Younger Females w/Bilateral Breast Cancer w/Lung Mets? jojo38 ibcmets"
    },
    {
      "AuthorID": "jojo38",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168219/profile",
      "Content": "jojo38 wrote: Just had an u/s needle biopsy on my 6.5 cm mass in right breast which moved and grew more outward after my initial mammo last April 2012. Thought it was due to my saline implant under muscle, but after visiting my plastic surgeon last week, he determined it was not due to implant. My initial mammo came out negative for cancer, so with the lack of knowledge and aggressiveness from my doc @ Kaiser, I did not attempt to follow up with a breast specialist until recently. Luckily the biopsy of today went very fast & well. I, of course, tortured myself mentally reading online blogs that made me quite nervous. The biopsy was a breeze! Now, the \"waiting game\" begins. My follow up appt is this Friday, the same day my results should be in. I'm 38 yrs old with my mom diagnosed 3 yrs ago with Stage IIb breast cancer. I'm kinda numb now with less freaking-out episodes, but of course having a go-with-the-flow attitude. Can't seem to worry though. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/799643",
      "Title": "The \"Waiting Game\" Begins jojo38 april485"
    },
    {
      "AuthorID": "jojo38",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168219/profile",
      "Content": "jojo38 wrote: What a week! My 39th bday is next week (Feb 12th) and I feel my life has just spiraled out of control! I was told yesterday via phone by my BS that I do have breast cancer. My mammo last April showed a mass, but came back negative for cancer and to see my plastic surgeon regarding mass cuz it may be due saline implants under muscle. Saw my plastic surgeon last week, which he told me to ask my doc for an ultrasound cuz he didn't think it was from implants. Today was my 3rd time to see my BS. Ultrasounds & ultrasound guided biopsy confirmed b/c. I have a shit load of tests (PET, CT, Bone, Heart & Brain) to be scheduled. Also, since my mom was diagnosed with b/s 3 yrs ago, I'm being sent 2 genetics for additional testing. Honestly, I'm scared of death to lose my hair (cuz my young daughters will worry so) plus the fact that I don't want my 8-yr to freak out @ school when strangers or others she may not know, but know me, whisper behind her back about my condition. Unfortunately, we live in a very discriminating world where if you look sick, most people treat you like you have an incur able disease. I don't mind losing my hair cuz there are many cool looking wigs, but I do mind the stares & glares my family will get when chemo starts. I do mind not being able to work at home (run an after-school program), and I do mind not being able to feel strong enough to get up cuz I'm a very active person. Forgive me all, if I sound mixed up, but I have so many different thoughts going through my head right now. What sucks, my tumor reads negative for any other drug & my BS says my only option is chemo or mastectomy/radiation/chemo. She also told me that I won't die from breast cancer, but I'm thinking...will I die from all the chemo/radiation? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/799800",
      "Title": "Just Told I Need Chemo B4 Therapy jojo38 SpecialK"
    }
  ]
}