{
  "AuthorID": "Jorf",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/25699/profile",
  "Posts": [
    {
      "AuthorID": "Jorf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/25699/profile",
      "Content": "Jan 28, 2009 12:53PM Jorf wrote: There's a book called Breast Cancer Husband or something that might be helpful. Support her but support yourself as well. You will be having a lot of feelings that may not feel \"right\", like resentment, adverse reactions to her hair, scars, weight gain or loss, sexual frustration. That will go along with all of the fear and caring and all the feelings you expect to have. Be sure that you have someone to talk to about those feelings that you'll want to push away - either a good friend or an oncology social worker or a support group for caregivers or other. These things are normal and if you pretend to ignore them it won't do either one of you any good. Remember that people with cancer are made to feel as if we are the center of the universe and that everyone should understand what we need without us telling them. Do try to anticipate her needs but be sure to check in frequently and ask her what would help. Then be prepared to do alot of the work around the house, etc, alot of having a very wet shoulder (I had total breakdowns every chemo week 5 days after chemo and then I was fine....), etc, etc. If you can go to chemo infusions - do. Bring some fun thing to do together during the hours. Bring along a favorite toy or icon. Start a book to read aloud to each other. Buy her a nice warm shawl to wrap around her during chemo. (My DH bought me an iPod. I said, \"If I have to do chemo, I want an iPod!\" and he had it inscribed. I'd listen to it when he went out to do errands while we were in town for chemo anyway.) You're doing great just by posting here. Be your loving concerned self and take care of yourself.",
      "MessageIndex": 12,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/728047",
      "Title": "How help my wife through chemo? Husband11 Ninja"
    },
    {
      "AuthorID": "Jorf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/25699/profile",
      "Content": "Sep 27, 2009 07:28PM Jorf wrote: I'm gonna go with Lovinmamma and say, keep trying. You need an advocate at one of the program centers - not necessarily at the BCCTP at the medicaid office. We have an amazingly helpful guy at m'caid but we're not in your state. Keep going. I'm being sure you can get coverage. It's one of very few safety nets in this d@mn crazy health care program in this country. I know it's hard right now to put energy into it but find yourself an advocate. They will work with you if you find them. (I'm here to tell the story!) I'm positive for you sister.",
      "MessageIndex": 7,
      "PostDate": "27/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/740798",
      "Title": "Lack of insurance bettyelay bettyelay"
    }
  ]
}