{
  "AuthorID": "josephine_",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88676/profile",
  "Posts": [
    {
      "AuthorID": "josephine_",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88676/profile",
      "Content": "May 20, 2011 02:24AM - edited May 20, 2011 02:27AM by josephine_ Hi Nola Agree with the other posts.  Have a good chat with your oncologist.  I too am TN and have just finished 6th round of docetaxol + avastin + zometa. Have also had three blood trasnfusions this year, but now on EPO.  All manageable, but I hope that the CT scan shows continued improvement as it did at end of cycle 3 (no evidence of new disease and significant reduction in nodes, nodules etc (but not all) in thoracic region.  I will stay on avastin, but my body could definitely do with a break from the chemo for a few months.  I would have thought it rather early to have a break just after cycle 2, but your oncologist will now best.   regards  Josephine Diagnosis.  June 2009 IDC 2cm ER+/-? PGR-, Her2-, 0/11 nodes.  DD AC/T x 8 plus 36 rads.  Nov 2010, mets to lung, brain and ribs.  Jan 2011 gamma knife.  Feb 2011 docetaxol plus avastin and zometa every three weeks x 6.  Neulasta and EPO June 2009 IDC ER+? PGR- Her2-, 2cm, 0/11 modes.  Nov 2010 mets to lung, brain and rib.  TN confirmed, docetaxol, avastin, zometa evry three weeks for six cycels.  Neulasta and EPO",
      "MessageIndex": 10,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769176",
      "Title": "ONC already discussig a break jenn3 apple"
    },
    {
      "AuthorID": "josephine_",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88676/profile",
      "Content": "Oct 1, 2009 10:34AM josephine_ wrote: Very pleased to hear your good news Lisa.  Just slightly puzzled by your statement that ' 80% of spots found in Switzerland are cancerous'  do you have a reference to this please Lisa Thanks Josephine BC grade III 0/11 nodes.  wide excision  A/C dose dense + taxol + radiotherapy",
      "MessageIndex": 2,
      "PostDate": "01/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/741283",
      "Title": "Had Breast MRI this morning momoftwo71 josephine_"
    },
    {
      "AuthorID": "josephine_",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88676/profile",
      "Content": "Oct 6, 2009 01:02AM josephine_ wrote: Thanks Lisa. Stressful situations can certainly affect your brain function, but I have to say chemo brain is somewhat more spectatcular (spoken from personal experience). The 80% / Switzerland comment simply did not make sense, and the only interpretation possible would have been that their testing was likely to be more thorough (to have such a large hit rate) because the incidence is not likely to be that different. I also thought it would incite my European colleagues to rant a bit as it could have been interpreted as another US forum member ridiculing EU practise (people have complained about this). Yet to me in most of these correspondence there is simply a misunderstanding of the facts, or a corresponding misreading of the email, or agitation brought about by chemotherapy. Indeed I am surprised that there is not more about the effects of chemo on the brain, and mood effects. It is perhaps the most consistent side effect. So when I see someone having a 'paddy' I put it down to chemo. Have a good day. Kind regards. Josephine Josephine",
      "MessageIndex": 5,
      "PostDate": "06/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/741283",
      "Title": "Had Breast MRI this morning momoftwo71 josephine_"
    },
    {
      "AuthorID": "josephine_",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88676/profile",
      "Content": "Sep 10, 2009 12:47AM - edited Sep 10, 2009 01:23AM by josephine_ Josephine here, For what it's worth I thought I would add my experience of cold caps here in the UK. I am on the A/C accelertated program (every 2 weeks) plus taxol (further 4  every 2 weeks).   The so called 'gold-standard'.  I have used the cold cap (the one attached to a machine that circulates coolant continually).  Apparently this was developed by an engineer whose wife had cancer, and was using the conventional type (cap in freezer and remove).  All the toxins I am on are on the 'A' list for most likely to cause hair loss.  After 2nd round of chemo hair started coming out so I had it cut short, and today have my 4th round of A/C.  I still have a light covering of hair, and only occasionally have I used my wig. Indeed several people have commented on how I suit short hair (and several of them do not know that I am having chemo).   I suspect that this light covering will eventually disappear, but I have had 6 + weeks of hair post chemo on a regimen where most people loose hair. The wig I have is great, but because I have had more hot flushes, it has been great not to have to wear my wig.   I did have thick hair, so probably could take more hair loss.  The scalp cooling 'works' by reducing (probably only marginally) the surface temperature of the scalp with the hope that less drug reaches the hair follicle, and also that its metabolic rate is reduced.  I chose the cold cap because it was available, and I was generally keen to reduce less chemo going to the brain.  I have concern's abnout what is loosely called 'chemo brain'  as for sure some of my cognitive function (or at least short term memory) goes.  I have difficulty remembering the names of things.....  but that could be my age!!  (51).  My treatment for practical reasons here in the UK is private, as I have worked throughout and can choose when and where I have my tretament.  However at our local hospital (in the university where I work) a cancer charity has recently installed one of these machines, and intends to locate one in every hospital breast onco clinic  in the UK.   I am a research scientist (a Professor in a leading University) and my scientific opinion (based on n=1 with no control) is that  cold caps are effective, but probably much more so with these coolant machines, with the cold cap being fitted well (no gaps, or air pockets) plus a cool down period before starting.  .  (although the correct control would be half head cold cap; half head not!!) but I am pretty convinced as 90% women loose their hair with the drug regime that I am on (Adriamycin (known in the research world as red Devil!!), cyclophosphamide plus Taxol).     So if you have a choice go for it..   Grade III, IDC 2cm,  stage 1, 0/11 lymph nodes.  A/C + T every two weeks 8 cycles plus radiotherapy",
      "MessageIndex": 184,
      "PostDate": "10/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738978",
      "Title": "Starting chemo September 2009 krcll sanaisa"
    },
    {
      "AuthorID": "josephine_",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88676/profile",
      "Content": "Oct 20, 2009 10:28AM josephine_ wrote: Don't they have Ethics Boards in Canada? I find it amazing the number of inappropriate requests made on this site.  Forget the moderators, in the civilized world no researcher can approach a patient for any study, irrespective of whether tissue (saliva, blood) is needed or not, nor ask confidential questions without the study being approved by a local (and now in the UK) a national ethics board.  Quite simply if such a request were made it would be turned down because it simply is not ethical. ",
      "MessageIndex": 4,
      "PostDate": "20/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/742426",
      "Title": "Seeking Participants for Study on Breast Cancer and Well-Being bcstudy ADK"
    },
    {
      "AuthorID": "josephine_",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88676/profile",
      "Content": "Apr 2, 2011 03:34AM josephine_ wrote: Good luck Leanneh My TN BC story is similar to you, diagnosed June 2009   had lumpectomy, and despite 0/11 nodes, dd ACT and rads, TN BC returned late summer (I reckon) in August 2010.  Have mets to lung, bone and brain. Have had gamma knife in Jan (two mets in brain) follow up soon, and Taxol and avastin. Lung situation under control, but bone disease progressing despite Zometa,  Be positive, this disease is swings and roundabouts.  Some things improve, and others fell neglected and cause a stir. Best of luck with WBR",
      "MessageIndex": 36,
      "PostDate": "02/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766830",
      "Title": "Now the Brain Leanneh sincitydealer"
    },
    {
      "AuthorID": "josephine_",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88676/profile",
      "Content": "Oct 9, 2009 12:23PM josephine_ wrote: I did a very quick search, and got the non scientific version; however URL link professional.cancerconsultants... DXTM Predicts Recurrence Risk in Postmenopausal women with Node-positive, ER positive Breast Cancer Researchers affiliated with the Southwest Oncology Group and The Breast Cancer Intergroup of NA have presented data showing that Oncotype DXTM helps predict the risk of a recurrence in postmenopausal node-positive, estrogen receptor (ER) positive breast cancer treated with tamoxifen alone as well as defining a group that did not benefit from adjuvant chemotherapy. These results were presented at the 2007 annual San Antonio Breast Cancer Symposium(SABCS).1 so oncotype test may well be useful for post menopausal women with node involvement.........",
      "MessageIndex": 6,
      "PostDate": "09/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/741774",
      "Title": "Lymph nodes weezee unklezwifeonty"
    },
    {
      "AuthorID": "josephine_",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88676/profile",
      "Content": "Aug 29, 2009 05:42PM josephine_ wrote: Hi,  I am new to this forum, and the community.  I cannot address the orginal thread as it has been removed but I did check out the website on the new patent purported to have therapeutic effects on BC.  One of the main components (NAC, N acetyl cysteine) has been aroung for years (it is a food additive) and the Herzenbergs at Stanford (both Professors) studied the effects of NAC in HIV.   Google the Herzenbergs and the science (not the hype on this website) will emerge.  Josephine, London IDC grade III  stage 1 0/11 lymph nodes",
      "MessageIndex": 3,
      "PostDate": "29/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/739673",
      "Title": "Preventium prevents breast cells from becoming cancer cells. Jraffanti josephine_"
    },
    {
      "AuthorID": "josephine_",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88676/profile",
      "Content": "Oct 23, 2009 03:16AM josephine_ wrote: Hi Tara, Slightly late response to your post on 20th Oct  In respons to your query about working through rads.  I has dose dense A/C every 2 weeks X4 then Taxol ditto.  I started rads x6 weeks at the same time as Taxol (not after if I understand your post correctly).  I have worked through everything, other than having day off for chemo (Thurs) and Friday to recover.  Work has kept me sane, but helped as work is flexible.  The combo of Taxol with Rads either coincidentally, or because there is a real synergism is increased tiredness.  The overall feeling was no unpleasant, as the dexamethasone (steroid)  you are given in the pre meds with the chemo, plus the dex that give you after to take (I dopped it out as I was not nauseous) makes you hyper, and I had problems sleeping.  I generally have this 'not unpleasant tireness'.  However,  througout chemo, my Hb was dropping (for obvious reasons) and although the GCSF (Neulasta) kept my neutrophils up, on week two of rads, I found I could not finish a sentence and the bloods indicated HB of 9.5.  I got a couple of units of blood, and once I got over the virus I has, now feel much better.  So despite everyone being different, and if you can do it I highly recommend keeping working.  It is good for the mind and good for the soul.  When I was at home, I found I relected (perhaps too much ) on BC, and spent alot of time on sites like these.  Work and its limitless problems (I run a research group of 20) was a much better distraction. IDC  Lumpectomy, clear margins, 0/11 nodes Grade 3, A/C + Taxol dose dense, rads x 6 Tmaoifen ib next",
      "MessageIndex": 285,
      "PostDate": "23/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "josephine_",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88676/profile",
      "Content": "Nov 15, 2009 03:10AM josephine_ wrote: Hi Malaika, I have just finished rads (6 weeks including boost)  which was given at same time as Taxol.  I had a lumpectomy, and the fibrous tissue inside the breast was quite hard (at the start of rads) and the breast nurse said it may get worse during rads (hard to tell).  Breasts are still same size.  I had no problems throughout, and used aqueous cream.  Last week though the burn under the breast started to weep (this is where they direct the photons to targte lymph nodes at the back of the chest wall) and also had tissue breakdown around the nipple area.  However, mending well with dressings and only a few days out.  The radiographers said this was entirely normal.  Everyone is slighlt different in their response, and I would suggest to take things as they come along.  No good preparing for the worse and it not happen.  Good luck IDC Stage 1 (2cm) grade 3 0/11 lymph nodes A/C + T DD Rads x 30",
      "MessageIndex": 1,
      "PostDate": "15/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/743909",
      "Title": "Hardness? symmetry malaika elimar"
    }
  ]
}