{
  "AuthorID": "JoTro",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193413/profile",
  "Posts": [
    {
      "AuthorID": "JoTro",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193413/profile",
      "Content": "JoTro wrote: Hi I am new here,  I noticed a lump about 2 months ago, thought it was related to periods as I normally get sore/sensitive breasts and nipples at that time and during self examinations feel the sides of both breasts are \"ropey\" anyhow.  This lump was more defined and moved around a bit.  Did a bit of google research and every thing said 9 out of 10 lumps are nothing to worry about.  Woke up one morning and said to myself that today is the day to get it checked.  Told by doctors office that I could not get an appointment for 3 weeks!  Went in and saw the nurse who got me an appointment the next day.  Doc agreed there was something there and referred me to the hospital clinic for a scan.  3 weeks later I get the mammogram and the lady says straight out there's calcifications inside the lump and then I'm getting an ultrasound and then the specialist says \"we are very worried\"  Holy cow.  Next day I'm getting a biopsy and now I'm waiting for the results.  Hoping to get them by the 24th.  Cannot believe my life is being turned upside down just like that.  I have a very worried husband and very confused kids, and I've just explained my predicament to my boss as this is the busiest time of year at work and I don't know what is going to happen next due to the holidays am I going to have to wait until mid January, MRI? Surgeon's appt? surgery? Treatments?  How do I tell people,  OMG this sucks. DX IDC Grade 2 Stage 1 19/12/13, LX 23/01/14, Chemo 4xTC 24/03/14, Rads 16 +4 23/06/14, Tamoxifen 5y+, Total Abdominal Hysterectomy 22/10/15 for excess growth caused by Tamoxifen, back on Tamoxifen :( Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815948",
      "Title": "Waiting for biopsy results JoTro marie5890"
    },
    {
      "AuthorID": "JoTro",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193413/profile",
      "Content": "Dec 20, 2013 09:11PM JoTro wrote: Thanks so much for your kind responses.  I have rang my doctor's office and have made an appointment for Tuesday, just in case we get results by that day.  I'm feeling pretty rough after the core biopsy, really tired and \"flu\" like.  Not sure if my body really did not like someone poking round inside it, or if it's stress/anxiety etc... Maybe a combination of both...",
      "MessageIndex": 4,
      "PostDate": "20/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815948",
      "Title": "Waiting for biopsy results JoTro marie5890"
    },
    {
      "AuthorID": "JoTro",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193413/profile",
      "Content": "Dec 26, 2013 01:33PM JoTro wrote: Well I got the results back on Xmas Eve, yep they were right. Infiltrating Ductal Carcinoma, provisionaly Grade 2.  My GP could not offer any other insight, I asked her for a copy of the pathology report.  Appointment with BS on the 8th Jan. Mercedes24 I hope you are ok?",
      "MessageIndex": 6,
      "PostDate": "26/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815948",
      "Title": "Waiting for biopsy results JoTro marie5890"
    },
    {
      "AuthorID": "JoTro",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193413/profile",
      "Content": "Dec 23, 2013 01:28PM JoTro wrote: Your not alone in this,  I - like you are expecting results from a biopsy today.  It's been a week of waiting and I have felt every emotion from sheer panic, terror, calmness and acceptance, complete denial and sorrow.  I have a partner and I feel so guilty I'm putting him through this too.  Yesterday we both said \"they have made a huge mistake and frightened us by being over dramatic about the mammo and biopsy.  Just a huge embarrassment.  Will know in a few hours my reality.  Fingers crossed for everyone out there expecting results before Christmas.",
      "MessageIndex": 8,
      "PostDate": "23/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815964",
      "Title": "I choose to wait... AnxietyAnne SchoolCounselor"
    },
    {
      "AuthorID": "JoTro",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193413/profile",
      "Content": "Jan 3, 2014 05:01PM JoTro wrote: Hi Katiegrey - you are not alone out there,  I am in your boat too.  Same diagnosis on same day!  I am tearing myself apart emotionally, scared, paranoid of any ache or pain I feel, terrified it has spread or is already in my bones, horrified at what I will endure and angry at some pretty poor healthcare I have received in the past 10 years that may have picked this up earlier.  Every emotion under the sun I am experiencing = it feels excruciating.  I have a surgeons appt on Wednesday, so hoping to find out more then.  This seems to be the only place I have found that allows me to vent, with people who are telling us this is a normal reaction in the process of it all.  This alone gives me a sense of wellbeing.  Good luck to you and me and all of us newbies out there!",
      "MessageIndex": 9,
      "PostDate": "03/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/816373",
      "Title": "Wait time between diagnosis and surgery katiegrey Pupcake"
    }
  ]
}