{
  "AuthorID": "journey61",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159939/profile",
  "Posts": [
    {
      "AuthorID": "journey61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159939/profile",
      "Content": "journey61 wrote: Hi, I posted this in the Canadian Survivor's forum as well. I'm from the interior of BC and was wondering if anyone can recommend a GOOD or even GREAT breast cancer onc in Van. Sorry if the answer's already in one of the threads and I'm being redundant. Dx 7/2009, IDC, 2cm, Stage IIB, Grade 3, 1/3 nodes, ER+/PR+, HER2+ Surgery 8/20/2009 Lymph node removal: Left, Underarm/Axillary; Mastectomy: Left Chemotherapy 9/9/2009 Adriamycin (doxorubicin), Taxol (paclitaxel) Targeted Therapy 12/5/2009 Herceptin (trastuzumab) Radiation Therapy 3/1/2010 Breast, Lymph nodes Hormonal Therapy 4/24/2010 Dx 10/14/2011, DCIS, Stage IV, mets, ER+/PR-, HER2+ Radiation Therapy 11/16/2011 Bone Chemotherapy 1/9/2012 Taxotere (docetaxel) Hormonal Therapy 11/24/2012 Femara (letrozole) Targeted Therapy 12/20/2012 Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/808755",
      "Title": "Recommendation of a breast cancer oncologist in Vancouver journey61 journey61"
    },
    {
      "AuthorID": "journey61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159939/profile",
      "Content": "Apr 11, 2013 07:14PM journey61 wrote: 171 Read everyday and hope to post more often. I thank all of you for helping me find comfort.",
      "MessageIndex": 192,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "journey61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159939/profile",
      "Content": "Feb 28, 2014 07:57AM journey61 wrote: Funny, I don't think I'm courageous either, even when people say I am. I just think, if people were in my situation they'd do the same thing. I look at women on this board who are dealing with so many issues and still get up each day to deal with them and reach out to each other. Within this board, I term them courageous. Maybe we are more terrified, but it takes alot to hear bad news time and again and just keep going. The first time I was diagnosed I felt like I'd been hit by the bus that everyone talks about and eventually got up. Then I was given Tamoxifen without Herceptin and walked down the wrong road. I hadn't even gotten up to dust myself off and find that I've actually crawled over to the train tracks. That train is bearing down, but is it going slow or at full speed, and my healthcare team is driving it. I'm trying to use a communicator but its processing is slow, the team is talking to each other but not seeing me and the train appears to be hurtling. Yet, I also have events that have helped me through divine intervention and that's the only way I can describe the situation, because I would not be here if those events hadn't happened.  I like the terms that have been brought up on this thread-we are sure dealing with alot of dreck combined with more shizzle and it certainly is terrid.",
      "MessageIndex": 63,
      "PostDate": "28/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818107",
      "Title": "MBC is Not a \"Journey\" Bestbird cliff"
    },
    {
      "AuthorID": "journey61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159939/profile",
      "Content": "Feb 28, 2014 07:04AM journey61 wrote: Thanks you guys for making me feel better. Bestbird, I have to say that I have some of your posts bookmarked from Inspire.com and you have helped me alot in my experiences.  Annie62 I understand your point of view. I don't think any words can make us feel better about our situation. I feel that we are more than survivors-we are courageous women who get out of bed each day (because sometimes it would be so easy to stay there) and we face whatever that day will bring. We go to the doctor, go to the doctor, go to a treatment, go to a scan, go to a doctor, on and on and we keep our heads up even though we may be terrified and try to keep our hearts and faith strong. I would never have wanted to be part of a stage 4 group but I would like to say that I am proud to be in the company of so many resilient women who go above and beyond whatever is thrown their way and have so much strength in the face of adversity.",
      "MessageIndex": 59,
      "PostDate": "28/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818107",
      "Title": "MBC is Not a \"Journey\" Bestbird cliff"
    },
    {
      "AuthorID": "journey61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159939/profile",
      "Content": "Jul 8, 2013 08:25PM - edited Jul 8, 2013 09:45PM by journey61 I had a biopsy of a sternal met in Nov 2011 and all I remember is that I was given a local and was awake with a nurse by my side the whole time I was put in and out of the CT machine. I do remember telling them that so far it was in one place and they took one sample. Afterwards I was monitored for bp and left after a few hours. I had some soreness, but nothing compared to the pain of the met because it was 3 cm through my sternum. I had 20 rads, started and am still on an oral bisphosphonate called Clasteon, followed by 6 rounds of Docetaxel and Herceptin, have continued on Herceptin and added Letrozole.   Research breast cancer oligometastasis on this site and the internet-new thoughts are coming out about treatments. At the time I was rediagnosed there wasn't enough research to know what to do-the doctors told me it was unusual to come back in one spot-I was given options and decided to do everything all over again.  I had finished 8 rounds of chemo, Herceptin, and 25 rads within the two previous years. I had asked about a sternectomy but was told that it was a long recovery and most likely would recur while I was recovering.  After I finished the rads and chemo my TMs came down and the first scan noted a healing response to therapy. I have had CT and bonescans about each 3 months and they say stable compared to previous. I   am having some issues right now with soreness in the sternal area and a rising CEA and am wondering if it is healing because the last scan said \"minimally expansile\" and I'm still waiting for an explanation of that.  I may change to an IV bisphosphonate.  Such tough decisions to make. First you will have to see what the receptors are and what your onc suggests. Like I said, research, because there is some encouraging information on oligomets. Just curious, was your original tumour in the inner quadrant, and were you ever on Tamoxifen? Good luck, tomorrow!",
      "MessageIndex": 9,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807249",
      "Title": "Mets to sternum Pat634 Pat634"
    },
    {
      "AuthorID": "journey61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159939/profile",
      "Content": "Nov 4, 2013 09:25AM journey61 wrote: Hi, I personally know one woman who was diagnosed early stage 10 years ago and didn't get Herceptin in the trial. Two years later it came back in her bones, so she did chemo and got Herceptin. Two years later it came back in her head, she had brain surgery to remove it, continued on Herceptin and Letrozole and it is six years after that. Another woman, same thing, no Herceptin in the beginning, then two recurrences/mets, treatment of chemo, Herceptin, was in the TDM1 trial and almost died so had to be taken off, but she is a few years out from that and no recurrence and no Herceptin or anything. I know another woman who was diagnosed stage IV six years ago with numerous liver mets and is on Herceptin. ANOTHER woman in another province is six years out with bone mets and on Herceptin, Xgeva and Letrozole. I am two years out from stage IV and have something going on with my adrenal and possibly lungs but it is not considered critical right now. (critical in my eyes but not the doctor's)These problems were most likely there for years but are just now showing up and have been aggravated by scan solution and a treatment of Pamidronate I recently had. I am doing more of trying to rebuild instead of tear down in terms of supplements and diet and I think it has gotten me this far. There are women on the Her2support.org site who are 10 and 18 years out from diagnosis. The common thread I see is to boost your immune system by diet, supplements, STRESS REDUCTION and finding out what is right for you. Yes, I know these women all had Herceptin, but I believe more women should be on it even though they don't test more positivly for it-research just hasn't proven that yet.",
      "MessageIndex": 35,
      "PostDate": "04/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813964",
      "Title": "2003, 2004, 2005.....and before ? Mamita49 LizLemon"
    },
    {
      "AuthorID": "journey61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159939/profile",
      "Content": "Feb 19, 2014 06:30AM - edited Feb 19, 2014 06:41AM by journey61 Wow, I really hesitated in responding because of my site name, but I have to explain why I chose it. My name doesn’t just reflect my experience with breast cancer, but my health issues for years. I have had symptoms dismissed and illnesses missed and have been chastised, demoralized and patronized by certain members of the health industry. I have been told I have mild MS and fibromyalgia years ago and since then have had to have emergency surgery for narrow angle glaucoma (almost lost my eyesight) and had a slight stroke BEFORE I was first diagnosed with breast cancer. Two years later I was diagnosed with it to my sternum. Two years later I am dealing with it possibly in my adrenal gland. (surprise, surprise) When I was first diagnosed I had been going to the doctor for two years saying something was wrong. By the beginning of 2009 I was sleeping sitting up in bed because of vertigo, had lost 20 pounds, was dizzy (there is a difference between dizziness and vertigo), was exhausted, and had vibrating vision. Every morning I got up something else would go haywire. Through a lot of divine intervention and meeting the right people at exactly the right time I am now, after almost 5 years, feeling MUCH BETTER than five years ago. It has taken 45 radiation treatments, 14 rounds of chemo, alot of Neupogen and Herceptin as well as relentless research and many appointments with my wellness team to get to this point. I still have some health workers treating me cruelly to the point I have almost walked into a neighboring river after one recent appointment. But I have to remember that I have people who believe in me, lift me up in spirit, and those are the ones who have helped the most. I could have picked a name to signify this “trip” like maybe LSD would have been a good one, but I chose journey because it encompasses my path to healing. The word clarifies the significance for me and I have come so far from where I was. I can make myself a sandwich, dress and feed myself, go out for a good time, walk, and just enjoy life. I have a sister who died of MS 12 years ago and she couldn’t do those things. Both of my parents lived through opposite sides of World War II-my dad in the Royal Airforce as a navigator and my mum as a teenager in Berlin. They had to live with the PTSD from their experiences-my dad developed OCD and had shrapnel in his head until the day he died. My mum lost a brother and another was captured. Her father was in both World Wars. He was a doctor of philosophy at a school and would have exchanges with English students. With every fibre of his being he wanted peace.  My family has been devastated by the effects of war and for that reason I dislike any terminology associated with it. I am grateful for each and every day, be it sinking into a valley of despair or having an epiphany and feeling like I’m on top of a mountain. When doors have been slammed shut in my face I have found the help I needed at the right time. I dislike that I have metastatic disease and am playing the real life game of Survivor where I have to outwit, outplay and hopefully outlast the games this illness can play, and my road has taken many twists and turns. I am going through some difficulties right now and am scared…….but I am alive and I am blessed.",
      "MessageIndex": 41,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818107",
      "Title": "MBC is Not a \"Journey\" Bestbird cliff"
    },
    {
      "AuthorID": "journey61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159939/profile",
      "Content": "Mar 14, 2014 04:03AM journey61 wrote: I agree with Kjones13, would it be possible to have a thread for her2 stage 4? I may be needing to change treatment and it would be so helpful and easier to find someone like me on one thread.",
      "MessageIndex": 9,
      "PostDate": "14/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816361",
      "Title": "Her2+ gals Kjones13 Kjones13"
    },
    {
      "AuthorID": "journey61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159939/profile",
      "Content": "Jul 10, 2013 07:41PM journey61 wrote: Risk of Recurrent Disease in HER2-Positive Patients ( 1 2) You know, I can’t prove that Tamoxifen causes recurrence, but especially in Her2+ there have been some indications that there is cross-talk between the receptors. (ER and HER2)My experience-I was stage 2b/3 in 2009 and had read on this board and the Her2 site that there could be crosstalk and to be careful about taking Tamoxifen. The above thread and others were good information for me. When it came time for the anti-estrogen, I had huge reservations and asked to stay on Herceptin for longer and if I could be tested to see if I metabolized Tamoxifen-told no on both counts. I really can’t remember any real difficulties when I was on both H and T, until I dropped the H because I was done the standard of care of 17 treatments by Nov 2010. Within months I noticed swelling on my mast side, itchiness where the original tumour had been, seatbelts were irritating to wear across, and I had some dizziness episodes. By the summer, my brother-in-law gave me a hug (not too firm) and it felt like I’d been crushed. Went for an x-ray which didn’t show anything, called my contacts in a larger centre (because I had to travel there, 3 ½ hours away for rads the first time) and they suggested a bonescan, which my local onc wouldn’t order but my gp did. The local onc’s nurse phoned the day before my bonescan the next week and said basically the onc didn’t think I needed a bonescan so he wasn’t putting the req in for it. I said “that’s ok, my gp ordered it and I’m going tomorrow”. Don’t hear anything from anyone, even though I went to the onc office after my bonescan and asked them to contact me.  I had an appt the next week (after Thanksgiving of 2011) by myself because I hadn’t heard anything from anyone and was told I had a recurrence or met, which turned out to be a 3cm lesion right through my sternum.  Everyone told me it was unusual to only find it in one place. Well, that’s me. I am convinced, in my situation, that I couldn’t metabolize the Tamoxifen and without the Herceptin, it fuelled the Her2 back up. They sure took me off it fast and put me on Letrozole, even though I had asked 3 months before if I was post-meno so I could go on an AI, and was told that I was still pre-meno by the numbers. I was so mad when rediagnosed and said, “what am I-another one for the database that recurred on Tamoxifen?”. Since then, I have found information that a “benign” condition called Gilbert’s Syndrome is being hypothesized to be a new risk factor for breast cancer because of the body’s inability to metabolize a certain kind of estrogen, due to a lack of an enzyme. Upon further research, I found info that said because of the metabolising problem to use extra caution when having Tamoxifen therapy. Now, I am not a doctor, but a lot of things are now making sense for me. What to do? Well, Her2+ or not, find out if you are a poor, intermediate, or extensive metabolizer of Tamoxifen (test CYP2D6) because if you can’t, it’s like putting the wrong oil in your car. I don't know if CYP2D6 is the same as the Gilbert's enzyme-don't quite understand it yet. I don't know, maybe I'm completely wrong, but maybe there is something to this. I told my onc that there is nothing I can do about what happened to my family and me, but hopefully I could spare someone else the hell  that I've gone through in the last 2 years. In 3 years I had 14 rounds of chemo (complete with a hospital stay the last time) and 45 rads, moved to a different town for rads for a total of 3 months, not to mention all the lovely side effects, pain, cost and STRESS.  I'm still dealing with issues, but hey, at least I'm here and to look at me you wouldn't know what I've gone through. I suppose that's part of the problem-I LOOK fine so I must BE fine. As for the inner quadrant, I don't know if sternal mets are more prevalent there, but mine was also in the 11 o'clock position on the left breast.  Last Oct I asked my rad onc if he could check my rad mapping from 2010-I wanted to know if there had been anything like swollen lymph nodes and he said back at that time he would not have called it, but I had a 1 cm area of sclerotic bone (I think that's what he called it) and in retrospect that's where I got radiated this last time. Sorry for the rant. It's my 4 year anniversary, I just had an appt with my onc this morning with the usual great debates, and then I had an echo. Think I'll go a movie tonight.",
      "MessageIndex": 12,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807249",
      "Title": "Mets to sternum Pat634 Pat634"
    },
    {
      "AuthorID": "journey61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159939/profile",
      "Content": "Sep 24, 2013 05:05PM journey61 wrote: Inky, How's everything going?",
      "MessageIndex": 4,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807931",
      "Title": "Can Afinator/Aromasin cause a tumor flare? Inky Inky"
    },
    {
      "AuthorID": "journey61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159939/profile",
      "Content": "Aug 23, 2013 03:01PM journey61 wrote: I've been thinking about you alot, and am wondering how everything is going. How are your TM's? My CEA must have heard how yours is, and has decided to rise as well. Highest has been 24, then just dropped to 21 recently. I'm wondering if it has to do with gallbladder/liver problems metabolising. I am on zopiclone and my local pharmacy changed brands. I had been feeling out of it and loopy for awhile and think part of it could be from too much overload on my liver, because I dropped the pill to 1/4 (was taking 1/2) a night and am feeling more coherent. Doesn't help that the Letrozole causes drowsiness and dizziness as well. Anyway, upon research on wikipedia, zopiclone can have enhanced pharmacological effects on people with liver disease (I have a \"benign\" liver problem called Gilbert's Syndrome, which is being hypothesized as a new risk factor for breast cancer because of the body's inability to metabolise 4OH estrogen). Also, in the article on wikipedia, zopiclone is linked to various cancers because of it suppressing the immune system. By the way, I have just gone for a head MRI-at my expense because the onc suggested a head CT and I wanted an MRI because it would show the visual area more (told to me by my rad onc for a previous MRI), but he said he would have a hard time getting me in because the mobile MRI machine only comes to our area once a month. So I travelled 3 1/2 hours away to a private imaging centre. The MRI showed that the thinglets that I've always had are still there with nothing new, except for a stable area, maybe a stroke. Nice. No one seems to be concerned about the stroke thing.  Are you on anything non-cancer related that could be contributing to rising markers and possibly inflammation in your lymph nodes?",
      "MessageIndex": 3,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807931",
      "Title": "Can Afinator/Aromasin cause a tumor flare? Inky Inky"
    },
    {
      "AuthorID": "journey61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159939/profile",
      "Content": "Sep 29, 2013 12:34PM journey61 wrote: Inky, Have your TMs stopped rising? Any news?",
      "MessageIndex": 5,
      "PostDate": "29/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807931",
      "Title": "Can Afinator/Aromasin cause a tumor flare? Inky Inky"
    }
  ]
}