{
  "AuthorID": "JOxnop",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111249/profile",
  "Posts": [
    {
      "AuthorID": "JOxnop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111249/profile",
      "Content": "Dec 25, 2010 02:39PM JOxnop wrote: Hi Honeybear, I don't know if you are a goal oriented person but it may help to sit down and work on a list of things you want to accomplish, see or do.  I find that the days I don't have a goal are the days I get depressed and end up dwelling on the negatives in life.  You have been used to working and accomplishing work goals.  Maybe you just need to transfer some of that same energy into making your life the way you want it to be.  We stage IV people have been given the opportunity, as abhorent as it is, to condense the life experiences we always wanted to do before we die.  Whatever it may be, go after it with all the gusto you can muster.  Surround yourself with the people that matter to you and seek help when you need it.  Other people are always happiest when they can help. I don't know if any of this advice will be helpful but this is a great group of people to share your experiences with and hopefully some of it will help.  I hope you can find your way to a satisfying life, as complex as it may be. ",
      "MessageIndex": 11,
      "PostDate": "25/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762424",
      "Title": "Feeling major depression setting in Honeybear Honeybear"
    },
    {
      "AuthorID": "JOxnop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111249/profile",
      "Content": "Jan 6, 2011 08:16AM JOxnop wrote: I first found my BC mets when I was just walking the dog and my hip fractured.  It showed up on an MRI that the Lytic lesions had weakened the bone so much that just walking fractured the hip.  They then did a PET scan and a Bone scan to see if there was any other involvement and nothing showed up...not even the fx hip area!!!  So now I have a full spine MRI (1.5 hours inside that machine!) and a CT scan every 3 months.  I do have bone mets in spine, pelvis, hip and femur.  They haven't scanned the rest of my bones so there is probably some there as well.  These tests are not fullproof and the humans that read the tests are not perfect.  Oh, and it's my understanding that your spine IS bone.",
      "MessageIndex": 18,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752135",
      "Title": "Spine mets with no bone mets? JerseyMom JOxnop"
    },
    {
      "AuthorID": "JOxnop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111249/profile",
      "Content": "Dec 28, 2010 01:01PM JOxnop wrote: Irr4993, I think sensitivity to each other is foremost on this whole website on the whole.  Thank you for contributing.  I appreciate it.",
      "MessageIndex": 11,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762597",
      "Title": "Do PET scans work for you? JOxnop mthomp2020"
    },
    {
      "AuthorID": "JOxnop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111249/profile",
      "Content": "Dec 29, 2010 08:44AM JOxnop wrote: Hi mthomp2020,  Yes, I recommend getting copies of ALL of your tests, bloodworks, scans, whatever.  I have a 3\" D-ring binder FULL of them all.  It is very interesting to follow changes in the bloodwork for example.  It's also VERY helpful if you need to see a new doctor.  If they don't already have copies of your previous tests you can whip it out and they can make a copy.  It saves on duplicating tests and cuts down on appointments.  My chemo brain doesn't allow me to remember very well and it's so nice to have this info at my fingertips.  I carry an updated, printed list of my meds with me at all times too.  That way I don't have to be pressured to remember. I'm sure my onc told me about the lytic lesions not showing up on my PET and bone scans but I forgot!  Chemo brain strikes again.  Duh. ",
      "MessageIndex": 16,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762597",
      "Title": "Do PET scans work for you? JOxnop mthomp2020"
    },
    {
      "AuthorID": "JOxnop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111249/profile",
      "Content": "Dec 29, 2010 09:06AM JOxnop wrote: khartoregon, which doctor did you talk to?  Was it your onc or the radiologist?  Get a copy of the radiologist's report and go over it.  They you can see for yourself what the expert at reading scans saw and not have to listen to another doctor's translation of it.  Oncs have to rely on what the radiologists see.  I am very lucky that my husband is a family doc and he knows the radiologists personally.  There are 2 radiologists that he feels does the best job at reading the scans.  I always get a copy of the radiologist's report for my own records.  I can ask more informed questions that way too.  As my husband says, not all radiologists are created equal.  It's very difficult to interpret scans and no 2 radiologists will give the exact report.  Hope this helps.",
      "MessageIndex": 18,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762597",
      "Title": "Do PET scans work for you? JOxnop mthomp2020"
    },
    {
      "AuthorID": "JOxnop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111249/profile",
      "Content": "JOxnop wrote: I'm just wondering if there is anyone else in this community that has had no luck with PET scans.  My bone mets were discovered 2 years ago when I broke my hip just walking the dog one day, no fall, just walking.  An Xray and MRI later and I was thrown into this world. At that point it had been 7 years since my initial BC dx.  I was sent for a PET scan to see where else the CA had spread and it showed no CA at all!  If only that were so.  Now every 3 months I have an MRI of my upper, middle and lower spine (1.5 hours inside that MRI machine, oy vey!) and a CT scan of my chest and abdomen.  They are the only scans that seem to work for me.  I feel that this is so strange that so many women are given a PET scan and are told that there is no CA in areas where there most certainly is.  If I hadn't had the MRI first and they KNEW the CA was there then I would have thought I didn't have mets.  Has anyone experienced this? Jeannine Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762597",
      "Title": "Do PET scans work for you? JOxnop mthomp2020"
    },
    {
      "AuthorID": "JOxnop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111249/profile",
      "Content": "Dec 28, 2010 01:50PM JOxnop wrote: Wow chainsawz, that's allot of good information.  Thanks!",
      "MessageIndex": 14,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762597",
      "Title": "Do PET scans work for you? JOxnop mthomp2020"
    },
    {
      "AuthorID": "JOxnop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111249/profile",
      "Content": "Dec 28, 2010 12:51PM JOxnop wrote: Please don't delete.  I find your input valuable.  ",
      "MessageIndex": 8,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762597",
      "Title": "Do PET scans work for you? JOxnop mthomp2020"
    },
    {
      "AuthorID": "JOxnop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111249/profile",
      "Content": "Dec 28, 2010 12:13PM JOxnop wrote: A high \"crap shoot\" factor really describes tests and treatments for BC perfectly.  It's a roll of the dice to find the right test for detection and the same for finding the right treatment.  It took 9 months of 3 different chemos to find one that slowed the progression of my mets.  9 precious months of horrible side effects when the whole time we didn't know if the chemo was working.  Finally, the 3rd chemo worked and I enjoyed 6 months of chemo free living.  My next MRI & CT scans are coming up on Monday and I find I'm doing the \"I know it's progressing and I'm going to have to restart chemo\" mental games with myself.  The dice are rattling around in my head.",
      "MessageIndex": 2,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762597",
      "Title": "Do PET scans work for you? JOxnop mthomp2020"
    },
    {
      "AuthorID": "JOxnop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111249/profile",
      "Content": "Dec 28, 2010 12:36PM JOxnop wrote: My initial BC lump in the breast was very palpable and didn't show up on either mammogram or US either.  Medicine truly has a long way to go.  Wouldn't it be great if they had triquarters like in Star Trek where they could just hold the little box near your body and it would tell you what was wrong?  Perhaps a hundred years from now.",
      "MessageIndex": 6,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762597",
      "Title": "Do PET scans work for you? JOxnop mthomp2020"
    },
    {
      "AuthorID": "JOxnop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111249/profile",
      "Content": "Jan 13, 2011 04:14AM JOxnop wrote: I can recommend a probiotic called Florastor that helped me.  Xeloda made my stomach a big hershey squirt factory and the Florastor helped.  You can get it online or ask your pharmacist.  You don't need a script for it but they keep it behind the counter and you just have to ask for it, at least at my CVS pharmacy they do.  And the bag balm really helped my hand and foot syndrome too.  It's great stuff. After my first bout of cancer with chemo and radiation I went through a spell of feeling really bad all the time.  I ended up going to get allergy testing and found that I was allergic to most of the foods I was eating (soy, rice, almonds, chicken...).  I had never had allergies in my life!  The allergist said that the chemo put me through early menopause and probably caused my hormones to go haywire (my word, not his) and I ended up with allergies.  He said that women sometimes go through menopause and loose allergies that they have always had or get them if they've never had them.  Those blasted hormones again.  Stirring up trouble.  After eliminating those foods from my diet my frequent, liquid stools were much better.  ",
      "MessageIndex": 9,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763259",
      "Title": "Tykerb Tummy Trouble momto2angels makmak"
    },
    {
      "AuthorID": "JOxnop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111249/profile",
      "Content": "Jan 13, 2011 04:21AM JOxnop wrote: I had diarrhea so bad, for so long that I developed a rectal fissure that was insanely painful.  I had to have surgery on it (not a fun surgery!).  During that surgery they also clipped my rectal band, the rubbery band that opens and closes so I am looser down there (sorry to get so graphic) so with bouts of bad diarrhea there can sometimes be little accidents. I live in fear of sneezing!  I get those extra long sanitary napkins for some security.  No one ever knows.  Good luck momto2angels. ",
      "MessageIndex": 10,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763259",
      "Title": "Tykerb Tummy Trouble momto2angels makmak"
    }
  ]
}