{
  "AuthorID": "jpixstix",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
  "Posts": [
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 14, 2009 07:09PM jpixstix wrote: Just got back from ps.  he said that he plans on using 340-350 silicone implants so they will be slightly bigger than I am currently. I'm planning on being a good size B when I'm done, that seems big to me now considering the small A I was before.  I told him that I would like to have them out a little futher, not so wide, but closer together.  Like I was placing an order for something, it was funny but he assures me that he can do just that.  Here's hoping he can.  Also, a few days recovery and get this NO DRAINS!!!!!! The little things that make you happy.  I have another appt tomorrow  with my breast surgeon, you ladies would get a kick out of her, the energy she has, my god.  Cali, I love having a big family.  It does get hectic, there is bickering, but I would be lost without my family.  Especially my two sisters, love them dearly.  They are both doing a bc walk on mothers day in phila in my honor and really want me to do it as well.  I told them that I think this year may be too soon for me, still too emotional myself and don't know if I can handle seeing that much emotion right now, still pondering that though. I'm on facebook and yes it is easy to post pics on there.  Love facebook. Deen, Hope your possible last fill went smoothly. Take care.",
      "MessageIndex": 853,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "May 13, 2009 04:37AM jpixstix wrote: Hey ladies.  Sorry it's been a while, just crazy busy.  I hope everyone is doing well.  I thought I posted here yesterday but for some reason it isnt showing up. Just to fill you all in, I met with ENT and am having my thyroid biopsy done this Thursday.  keep your fingers crossed, however, I just have this feeling.  On a good note, we got a new minivan this weekend.  It's our first brand new car and I am loving it.  Had a terrific mothers day.  My two sisters did the Susan G Koman breast cancer walk in Phila in my honor and then our husbands planned a barbecue for us.  They transformed one room in my sisters house to a real nice, serene, beautiful room and brought in a massuse (spelling) to give us all massages.  Loved it. I haven't had time to keep up with everyone's posts and hope to do so this afternoon after my bloodwork, but I hope all is well with everyone. I'm thinking that I am going to ask my doctor to give me a rx for some type of medicine to help me relax, I feel like my head is spinning. Hugs to everyone.",
      "MessageIndex": 960,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Mar 28, 2009 12:10PM jpixstix wrote: Hello ladies.  I haven't been on much either.  Trying to get back to normalcy.  Started helping out in my youngest Kinder. class this week.  It's amazing how great 24 5 and 6 yr olds can make you feel.  Bee, I mentioned your expander flipping to my ps and he said that that is why I am to wear my surgical bra 24/7, even when sleeping.  I have to admit it is not very comfortable but at the same time, I'm sure what you and danni are going through is not comfortable either.  I wish you both luck with that.  Question about sizing.  So far I have 250 ccs and my ps said I am at a B.  I would like to be a full B, small C when I'm done.  Any ideas on how many cc's I should get total?  Also, my oncotype came back at a 19.  My onc thougth it would come back at a 10 or 12 and said I would  not need chemo, just tamox.  I spoke with him yesterday after he reviewed my results and said that the 19 has not changed his decision, he still feels chemo benefits do not outweigh the risks.  Anyone have input on that? I think I am going to go see another onc for a second opinion, don't get me wrong, I really am happy about not needing chemo but because I am only 35, I don't know how comfortable I am with a 19 onco score.  Lastly, I am a former smoker, quit the day before my surgery Feb 23rd and am still having a tough time with that.  You would think when you have a dx of cancer, smoking would be the last thing on your mind but I still can't seem to shake the craving.  This is my new prayer for myself.  To help with that. Gotta go, little one's crying. Hugs to all.",
      "MessageIndex": 764,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 3, 2009 09:06AM jpixstix wrote: Cubsfan, You were right.  The first night after my last fill was horrible.  I felt like I was set back a few weeks, but this am (two days after fill) I am feeling soooo much better.  The ps says one or two more, which would put me at 350-400 and I should be good.  I want to be a full B small C.  It's really wierd how there are so many different cc's but they end up the same size.  i don't know if has to do with the size of a person body and how they were before but I would think 400 cc's on me would be the same size 400 cc's on somebody else.  I have faith in my ps and I think he knows more than I do so I'm going with his judgement.  2new1's, I am sorry to hear that you seem to be getting the short end of the stick alot.  Keep your head up and hang in there, we will all get through this bc process one way or another.  I've been there way to many times the past three years.  three yrs ago my husband was in a bad accident and lost complete use of his right arm, we were just getting on with our lives with that when I was dx, so here goes another rollercoaster ride for my family.  I knew I hated rollercoasters for a reason. I look at your spirit for my own encouragement and it helps me tremendously. As far as sleeping on my side, I CANT WAIT!!!!!  One of these days and we will all be side sleepers.  Sami, just to let you know, 2nd onc said he didn't think chemo benefits are high enough for me, so I'm going with it.  No chemo, just tamox.  I'm hoping that's enough given my age but again, faith in the doctors and the lord.  Take care everyone.  Michele",
      "MessageIndex": 803,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 7, 2009 06:59PM jpixstix wrote: Hey all. Just wanted to say I'm getting another fill tomorrow, possibly the last.  WOOOHOOOO!!! I shouldn't get too excited, there still may be one more after tomorrow but at least things are moving along.  I have a question for all, does having a bilateral mas vs. a lumpectomy or single mas. reduce your chances of a recurrance?  If so, then does onco tests base the final number on the procedure each individual has had?  I was under  the impression that on some kind of level, having a bilateral vs a single masectomy reduced my chances of a recurrance on the healthy side.  On another note, all three of my children are home from school all this week for easter break, however they go back the day after easter.  This is the dumbest thing I've heard in a while.  Who wants to rush home from Easter dinner because the kids have school the next day but have had off for the past week.  I don't know who makes up these rules, obviously not a mom.  I've also had two extra kids here the past two days, needless to say I am exhausted mentally.  Hope all is well with you all.  If anyone is having any procedures, appts, etc tomorrow, good luck. Thoughts and prayers with you all. Michele",
      "MessageIndex": 823,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 29, 2009 09:08AM jpixstix wrote: Hey everyone.  So Friday after surgery I felt great.  Woke up Saturday and felt like someone hit me all over my chest with a baseball bat.  Today i go for my follow up and am feeling much better physically.  Emotionally I'm a mess.  I have to go to an ENT tomorrow to have my thyroid looked at, I have a nodule (that's been there forever) but haven't had it biopsied in 4 years and the docs want another biopsy because of it's size.  So now I'm freaking out thinking that I have thyroid cancer and bone cancer (because of all of the ache's and pains that I've had for years).  I'm thinking I want to set up an appt with my onc to demand a pet scan just to give myself a piece of mind.  This whole bc thing really sucks.  Some days are like great, ok, I'm winning this, and then there's days where I think I'm dying and leaving my children without a mother.  Do any of you feel like this or am I just a mental case? Sorry to unload on you all but I needed to vent somewhere and sometimes hubby isn't as compasionate as I'd like him to be.  But the implants are much much much nicer than the te ladies.  Really can not wait for you all to get yours.  Off to see ps. Michele",
      "MessageIndex": 927,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "May 17, 2009 06:47PM jpixstix wrote: I'm hoping that a lack of posts means everyone is doing great.  Hope all is well with everyone. Michele",
      "MessageIndex": 967,
      "PostDate": "17/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "May 22, 2009 08:40AM jpixstix wrote: Hey everyone.  So glad to see you all on here and doing well and that exchange surgeries are being scheduled.  2 new ones, glad to see you have your te exchange surgery.  I know you must feel back at square one with having to start will fills all over, but there is light at the end.  It will be here soon for you, I just know it.  Keep your head up.  It was all of you ladies with your spirit and overwhelming sense to overcome anything that helped me through some of my darkest days and I thank you all. My thyroid results are in and they are b9.  The ENT said if it starts to grow more, he will have to take it out and I said do what you want with it as long as it's not cancer.  I thought for sure it was and have never been more glad to be wrong.  I hope you all enjoy your holiday weekend, I intend to. Michele",
      "MessageIndex": 981,
      "PostDate": "22/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "May 25, 2009 07:07PM jpixstix wrote: Hey ladies. Have a funny story for you all and I apologize if I already posted it here. I ran into a woman who I haven't seen since my BM.  She ran up and asked how I was feeling, telling me I look great, blah blah blah.  Then she looks at me and says,\"So are you having reconstruction done?\" I started laughing hysterically and said,\"I already did.\"  She was so embarrassed(spelling)and apologized over and over.  I was wearing an oversized tshirt but I still look bigger than before my BM.  It was funny. Thought you all could use a laugh. Dani, love the shirt logo.  I would love to get my veins done, I have spider ones and a very nasty varicose(spelling) one.  Sue, I know what you mean about people starring at them.  I finally got to put on a regular bra and depending on bra type, I am a 34 c or a 34b.  I then tried on some cute summer tops but am self conscience about having my cleavage showing.  My sisters think I am crazy and say I should wear everything low cut from now on but I'm just not there yet.  Maybe I'll get used to it someday, we'll see.  jill, my nodule is 3.1 cm.  Pretty large and noticeable(spelling again, it's been a long weekend). Terri, please continue to post on here, would love to know how you're making out. Good luck. Well, hope all is good, gentle hugs. Michele",
      "MessageIndex": 988,
      "PostDate": "25/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Sep 17, 2009 06:30AM jpixstix wrote: Hi ladies, like Sami, I have not been on all summer but have tried to read through and keep up with things.  I'm glad to see things are moving along for most of us.  I had my exchange in May due to incision seperation and so far so good.  I can tell you that I see many \"ripples\" in my implants and the corners(they are round so I don't know why the surgeon calls them corners) are noticeable.  I talked with ps about the ripples and he said it was because I was so tiny. He says if I gain 10 pounds they wouldn't be so noticeable and that so many ps's are trying to find a solution to my problem.  They aren't exactly symmetrical (but then again neither were my real ones) but in clothing and a bathing suit, I feel I look pretty ok.  I should probably call ps to schedule nipple surgery but I am just so damn busy with three kids back at school, football, baseball,etc. I guess since it's not a life/death matter I'm not rushing to take care of it.  On another note, how do you get on to post pictures/view pictures? I can't seem to find it and am starting to feel like an idiot.   Glad to hear that you all are hanging in there and moving along with your processes.  Take care, michele",
      "MessageIndex": 1108,
      "PostDate": "17/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 21, 2009 04:59AM jpixstix wrote: Bee Best wishes for an easy surgery.  Let us know how everything is going, I'm sure you're glad to be moving forward (literally). Stacy, about the whole bad mom thing, sometimes kids drive you nuts.  I think most mom's would agree that we've said things we shouldn't have.  If that's the worse we do, than we are doing good as far as I'm concerned.  My daughter is only 7 but I'm dreading when she gets older, the attitude that she already has, it's worse than my 13 year old sons attitude.  Hope, thanks for the excersice info.  I also have a tough time wearing some of my clothes that are tighter under the arm, it is just very uncomfortable.  So glad that summer is almost here, tank shirts should be pretty comfortable.  I hope everyone is doing well and enjoying some nicer weather.  Friday's my big day ladies, I'll be sure to post updates once I'm softer.  Hubby has a long weekend of running three kids to millions of sporting activities all by himself so I can rest at home ALONE.  Looking forward to it, I'm curious how he is going to handle it. Take care everyone, hugs to everyone. Michele",
      "MessageIndex": 882,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 30, 2009 12:06PM jpixstix wrote: Thanks to all of you wonderful ladies for responding.  I saw my ENT today and he have an ultrasound scheduled for next Thursday but he did make me feel better.  He said my blood work is all good and thyroid really isn't all that large.  he feels that because I am so small and thin that it is just more noticeable.  It's been this way for at least 7 years and hasn't seemed to grow at all so it's good news so far.  I really appreciate all your feedback and posts.  It's good to know that I'm not losing it or just feeling sorry for myself.  As far as our DH's wanting our cancer over, they can't possibly want that more than we do.  Thanks again, hope everyone is doing well. Michele",
      "MessageIndex": 934,
      "PostDate": "30/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Mar 17, 2009 01:10PM jpixstix wrote: Hello everyone.  I don't have much time but wanted to share my great st pattys day news.  I went to see onc today and he feels that it is pretty likely I will not need chemo.  YEAH!!! Still waiting for my onk tests results but he doesnt seem to think the benefit will outweigh the side effects.  He did give me a rx for tamox. so hopefully I will tolerate that well.  With the great news and great weather, I am having my best day so far. Hope all is well with everyone.",
      "MessageIndex": 656,
      "PostDate": "17/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Mar 19, 2009 03:14PM jpixstix wrote: jillisucat, good luck tomorrow.  I hope all goes well with your bellybutton. caligrlof68 glad to hear that everything went well and that your drain is out. What a relief that is. Question, before my ms i was barely an A cup, now with my 2nd fill in and 200 cc's I'm a B.  I know it doesn't seem much but to me it is a huge difference. I am noticing stretch marks on my new foob area and the skin in between them seems to be constantly peeling.  I was at the PS yesterday and forgot to ask if I can use cocoa butter or stretch mark cream on them to prevent the peeling and stretch marks.  Anyone know? Also, I clean houses once a week and am wondering how long before I'll be able to go back and clean without killing myself.  Carrying a vacum cleaner seems next to impossible to me still and it's been almost 4 weeks.  I was thinking of calling my clients and telling them another 2 weeks but not sure if I should tell them longer. Hope everyone is having a good day today.",
      "MessageIndex": 675,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Mar 22, 2009 07:06PM jpixstix wrote: Hello everyone.  The weather was great this weekend and it felt great trying to get back into the swing of things.  My two little ones had baseball practice Sat, my middle one had a basketball game and today was a little yard work(although my husband couldn't understand why I was only as competent as our 13 year old but I was proud of my accomplishments).  I felt great, and by great I mean better.  I hope you are all doing just as well. I'm noticing alot of talk on here about bras.  My ps said I am to wear my surgical bras(a tight sports bra) 24-7.  I told him that I am much more comfortable without but he said my TEs could move if I don't wear one.  Anyone else hear this?  It seems so many of you were told not to wear anything at all.  Also, does Xanax help with pain or relaxation?  My most uncomfortable time is at night.  Between my \"come and go\" pain and the hubby snoring, I am waking up 50 times a night.  I can not wait to be able to flop down on my bed on my belly. It's the little things in life that matter. Hope everyone is doing well and feels even a little better tomorrow. ",
      "MessageIndex": 718,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Mar 23, 2009 10:24AM jpixstix wrote: Caligirlof68, your spirit is incredible and makes me laugh.  I could only imagine what a d cup would even feel like as i was barely an A prior to my  bs.  Soon enough I'll know what a B, maybe small C feels like.  hope4cure, my ps says that the bad side always feels worse than the \"good\" side and seems to have more complications (it's usually more sore, swollen, and you feel the fills a bit different).  Although the pains I have that come and go seem to go from one side to the next but my last fill, I definetly felt more in my left (which was my bad side). by the way what are ABD's? 2newones, we used to have comcast and have switched to verizon fios.  i don't know if they offer it where you live but we did a combined tv, phone, and internet deal and have made out pretty well. however I will tell you that I liked comcast television much better but can deal with the differences. Hope all is well today with everyone.",
      "MessageIndex": 726,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Mar 31, 2009 07:14PM jpixstix wrote: Hey girls. Cali, so glad to hear that you are feeling better.  Sam, my ps does 50 cc's every week but I've read some posts where women are getting 100 cc's per visit.  As with the bra issue, I think the fill issue varies as well.  I also feel shifting once in a while, even with my bra on 24-7.  This bra used to be very uncomfortable but either I am getting used to it or once I started feeling better, the easier it is to deal with.  FYI, I asked my ps about the implants shifting or moving and he said that there is always the possibility but with the pocket they create, it rarely happens.  Here's to hoping that we all have great implant pockets when we are done with these tes.  Hope all is well with everyone.  I go for my 4th fill tomorrow, last one I felt the needle on the right side, but it was worth it.  They looked so much better and I am hoping that after tomorrow's visit, they will look even better.  Take care. Michele",
      "MessageIndex": 788,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 1, 2009 02:26PM jpixstix wrote: Hey everyone.  I had my 4th fill today, I'm now up to 300 cc's.  The doc says maybe 350 or 400 total to get me to be a full B, small C and given my size and the breast size I had prior to my mast.  that's as big as he'll let me go (I wouldn't want to go bigger than that either).  Anyways that means one or two more fills for me and then I'm done with that part and onto the next stage, the waiting for exchange.  I have to say that today I am more sore than my previous fills and can definitly notice a difference pain-wise.  It may be because I normally take  2 ibubrofin before my visit and today I forgot.  We'll see how sleeping tonight goes.  Cali, I know what you mean about getting kids to do things.  My oldest is 13 and he only does things around the house when he wants something in return.  He does have normal chores (cleaning up the dog doo doo, taking out the trash, and in the summer helping with cutting the grass).  Those he does do but with constant nagging.  Anything over that I usually tend to offer him some money and that gets him motivated.  He is like a girl and loves to shop for his clothes.  My second is almost 8 and I think because she is a girl, she is very generous when it comes to helping mommy with housework.  My youngest is 6 and he is clueless really.  2new1's, I am the one who cleans houses, but needless to say, I still have not been back to that yet.  I am hoping to get back to it in a couple more weeks but to be honest, I just don't feel ready.  Cleaning my house is one thing, I can do a room a day if I want but to have to clean a 3 bedroom, 2 and a half bath house in four hours, I don't think I could do it just yet.  I also watch children and this week I started only watching one of the three that I normally watch.  I give credit to all of you who are back to work and moving on.  I'm just glad that our tax refund should be here soon to help off set the income loss.  Cali, I intend to go back to school next year when my little one is in full day school.  I was up in the air between nursing or teaching.  I'm leaning towards teaching so it can be more like my children's schedules.  But I truly would love to be an OR nurse.  Time will tell I guess. Have a good night ladies.",
      "MessageIndex": 795,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 9, 2009 11:51AM jpixstix wrote: Terri, This whole bc thing is for the birds.  I hope and pray that in my daughters lifetime they come up with a more precise and accurate way of testing for bc.  I had my mammo the end of dec 08, biopsy 1/3/09 with an original dx of dcis.  I did have a mri that showed other areas of concern within the same breast.  After my mast, my surgeon said that my entire left breast contained this dcis and they also discovered a very small tumor of an invasive cancer.  Don't get me wrong, I thank go for the advancements in bc thus far but I can't help but think that there's more out there and hope and pray it will be discoverd by the time my 7 yr old has to deal with such issues.  Good luck to you with everything, whatever choice you make, it will be the right one for you.  I went to ps yesterday, he asked how i was with my fills so far (I am up to 300 cc's total).  i told him that I actually am happy with the current sizing.  I am more bustier than prior to mast (previously a small A cup ) and feel confident that they are neither too small or too big.  I am a small person in general.  5'2\" and 105lbs.  Needless to say, after removing my steri strips, my left incision is seperating, the right incision looks great.  The ps said that he wants to move up my exchange surgery to be done in two weeks because of the seperation.  Holy crap, two weeks he said.  I was not expecting this to happen so fast but am all for it.  I just hope that nothing happens in the meantime with this incision and no infection develops. I'll be having softer foobs sooner than I thought.  And to think, to be able to sleep comfortably again, AHHHHHH!!! Gentle hugs to all, prayers are with everyone.  ",
      "MessageIndex": 827,
      "PostDate": "09/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 22, 2009 11:14AM jpixstix wrote: Thanks for all of the prayers and good thoughts ladies.  I'm hoping Friday goes smoothly.  Yes, Jenni, I am getting my exchange this Friday.  It happened faster than expected because of an incision seperation but I am thankful, although, I was hoping to have one more fill.  My ps did assure me that the implants will be 40-50 cc's bigger than what I have now (which is 300 cc's). Oh and I did reply to your message on fb about sesame place.  Cali, again you are cracking me up.  It it better that you found  out sooner than later about the guy and so glad that you are having other options.  Good for you!! Bee, hope you are feeling ok and things went smoothly for you. Hope all is well with everyone.",
      "MessageIndex": 889,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 24, 2009 03:56PM jpixstix wrote: Hello ladies. Bee, so happy for you, one less surgery is always a good thing.  2 new ones, so glad that you got good news regarding your father Sami, so sorry for everything you are going through and the loss of your father in Feb. Everyone keeps telling me god only gives you what you can handle, I told our pastor that between hubby's accident 3 yrs ago and my bc, god better not ask any questions of me and just let me right in.  He laughed.  But in reality, if this had happened to my one sister, I think it would have really affected her alot worse, so I'm glad that if it was one of us, it was me.  I'm used to stress I guess. Dani, I was only filled to 300 cc's, ps wouldnt do more because my skin was getting pretty thin and an incision was seperating.  However today he took out te and replaced with 371 cc's mid profile silicone gel implants.  (Although they don't seem any bigger than before, actually they don't seem to project quite as far as the te but they are more fuller and start higher and gradually expand).  I would have liked to go a tad bigger but I am comfortable with the size, as I am much bigger than before bc.  Sami, the high projection goes out further than midrange and small projection so that's a good thing in your case.  I did not know they came in different projections untill i looked up the website from my new medical device card I got today. If i would have known, I would have requested the high profile vs the midrange ones. LADIES, I CAN NOT WAIT FOR YOU ALL TO GET YOUR IMPLANTS!!! I do have some pain and am taking the percocet, but aside from the pain from surgery, I feel marvelous.  My chest does not feel heavy and uncomfortable with these nice soft foobs in.  I already am loving them.  The stretchy, tightness feeling is not as bad.  I feel like a new woman.  Hopefully I will feel this good tomorrow, lol.  I'm going to go fall back asleep on the recliner, but really girls, you have so much to look forward to.  And no drains. Take care, gentle hugs.  Enjoy the lovely weather. Michele",
      "MessageIndex": 906,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "May 14, 2009 05:27AM jpixstix wrote: Jill, I've had a thyroid nodule and enlarged gland for years.  Found it with one of my pregnancies.  I did have a biopsy done years ago but at pre admisssions for my last surgery the doctor who saw me said, \"you really need to have your thyroid looked at, there is a large nodule on there\".  So here I am.  The ultrasound said left nodule occupies most of my left thyroid lobe so I am have a guided biopsy today with ultrasound.  They did not do a guided biopsy last time, just a needle biopsy. I go next Thursday to ENT to get results. Back to the waiting game.  It really is all much easier once you know where you're going.  I'll keep you informed.  Keep on top of your thyroid, I was getting it ultrsounded every 6 months and when ENT said I can go a year before next one, I never went back, so now here I am. Take care.",
      "MessageIndex": 963,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Mar 16, 2009 04:33AM jpixstix wrote: I had a bilat mx with expanders on feb 23rd.  I'm trying to figure out how to join this thread so I am just posting to it.",
      "MessageIndex": 636,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Mar 24, 2009 06:29PM jpixstix wrote: The surgical bras that I got clasp in the front. They call them surgical bras but they look more like sports bras to me.  I got them at a store that specializes in masectomy and lumpectomy wear.  My breast doctor gave me a Rx for them and my insurance covered them so you all may want to look into that. Although they are not the most comfortable but then again, what's comfortable these days:) I'm heading to bed early tonight, I have my third fill tomorrow and then I have to be at my godson's church at 3 as I am his sponsor for confirmation as well.  Nothing like sitting in a church pew for two hours.  I think tomorrow night I will need a percocet to deal with the discomfort. Night everyone.",
      "MessageIndex": 731,
      "PostDate": "24/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 11, 2009 02:33PM jpixstix wrote: Hope everyone has a wonderful Easter. ",
      "MessageIndex": 840,
      "PostDate": "11/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 14, 2009 06:26AM jpixstix wrote: First off, Bee congrats on being able to get the flipped foob fixed, that must take a lot of worry off you, because lord knows we all have enough worry.  Calif, so glad to hear that your are dating, that will help lift your spirits.  The \"new\" stuff is always nice, not that I don't enjoy my husband of 13 years.  I'm hoping that in another 6 or so years, hubby and I can start to feel \"new\" again with \"our\" time once the kids are all a little older.  Speaking of husbands, I go tonight for my pre op visit with ps.  Hubby wants me to ask if there is anyway he can go  a little bigger on the implant.  PS was not able to do more fills because of the incision seperation.  I'm going to ask, only because I would like a tad bigger than I am now, however, if ps says he can't then that's fine too.  I already am bigger, fuller, and perkier than my old post three children real ones.  Exchange surgery is set for next Friday, the 24rth.  I have a million questions to ask my ps tonight at visit.  I completely was not thinking that again, I will not be able to drive afterwards and have to arrange pick ups for the children for school.  All the work that has to go into a mom having surgery.  When my husband needed surgery, nothing else to worry about other than him having surgery, me, I have to rearrange life. Go figure. Sami, how much are you going up to?  If you don't mind me asking, how tall are you, your pic looks like you have a small frame like myself. Just wondering, I'm hoping my 330 implants that ps plans on using is going to be enough.  I'm thinking it will, I just don't want to wish later that I went a little bigger if possible.  My easter was nice, the kids were up at 3:30 AM when I made them go back to sleep and then they woke me up at 6:45.  They didn't even do that for Santa Claus, what makes the Easter Bunny so special, I don't get it.  I have a big immediate family, I'm one of five and all of us with all 16 of our children had dinner at one of my sis's house. Very nice, all of our kids are around the same age so it's nice to keep them close.  I am glad that kids went back to school though.  Hope all is well with everyone, I'll fill you in on my ps visit later.  10 days to go to softer foobs. Whew.",
      "MessageIndex": 848,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 14, 2009 09:48PM jpixstix wrote: Allison,Just wanted to post my situation.  I am a 35 yr old mother of 3 (13,7,6), originally dx with dcis througout one breast.  No family history and brca test was negative. I had bilat mast. 2/23 where they did find a .9 mm tumor of an IDC, sentinal and 3 other lymph nodes negative, onco score of 19.  ER pos/PR postitve/ Her negative. My onc and a 2nd opinion both said no chemo, the risks outweigh the bene's. I am taking tamox for at least 5 years. This is a scary road to have to travel but you'll find so much support, advice, and wisdom on these discussion boards.  There seems to be somebody on here for every stage of dealing with breast cancer, whether it's surgery, chemo, hormone therapy, etc.  I send you many prayers to help you get through this. Good luck to you, keep us posted. Michele",
      "MessageIndex": 10,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732355",
      "Title": "just diagnosed at the age of 33 aaronali12 nandy1975"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 16, 2009 11:08AM jpixstix wrote: mandy, so glad for you. ",
      "MessageIndex": 14,
      "PostDate": "16/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732252",
      "Title": "3 cm lump in left breast mandymonkey nanapat6225"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Mar 15, 2009 10:20PM jpixstix wrote: Samiam, Yes the path report did find a very small 1cm IDC.  I will find out more about that on Tuesday.  I am  doing my wall walking exercises along with some others that the PT showed me, and they do seem to help.  I think I am just very anxious about my recovery. Deen, how do I join the feb surgery thread? Thanks for responding everyone.",
      "MessageIndex": 4,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730777",
      "Title": "bil/mas with t/e, when will I feel comfortable again? jpixstix JanMarch"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Mar 23, 2009 05:15PM jpixstix wrote: Thanks for the words of encouragement chrissy. I actually am starting to feel better and better each day. I still can not wait for the night of comfortable sleep but can handle everything a little better.  I am 4 weeks out now. Red, how did it go at the doctors today? did you get your drains out? I hope all went well with you. I know when I got my drains out I was relieved.  My doctors said I couldnt shower until they were out, just sponge bathing.  I had them in for one week and that was enough for me.  The one on the breast with the cancer still had some drainage  and my drain itself was blocked inside so  my doctor had to push around and did manage to get quite a bit out but I was definetly in pain that entire night.  But like I said above it is week 4 today and I feel like a whole new person than I did that week. Take care.",
      "MessageIndex": 14,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730777",
      "Title": "bil/mas with t/e, when will I feel comfortable again? jpixstix JanMarch"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Apr 7, 2009 10:07PM jpixstix wrote: sygi,  I also had both of mine done together.  It is a personal decision but if you already know that you want them both removed, it may make it easier in the long run to have them done together.  I had my bilat 2/23 and am feeling really pretty good now.  Don't get me wrong, for the first two weeks, my mom was here doing everything for my 3 young children.  For two weeks after that my two wonderful sisters took turns coming over and cleaning my house. However, now I'm feeling good and can tolerate the pain/uncomfortableness with ibuprofin generally. Good luck to you, whatever decision you make, it is the right one for you.",
      "MessageIndex": 42,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730777",
      "Title": "bil/mas with t/e, when will I feel comfortable again? jpixstix JanMarch"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "jpixstix wrote: Hello everyone.  I had a bilateral masectomy with tissue expanders on feb 23rd.  It is almost 3 weeks and I am still so uncomfortable.  I experience these pains that come and go and they almost feel as if my ribs are digging into my chest, I can't reach above my head completely without the stretching feeling or pain and the pain seems to get worse the flatter I lay down.  Is all of this normal? When can I expect to start to feel normal again? I am a very active mother of 3 and having to depend on everyone else is making me depressed.  I meet with the onc on Tues and will find out if chemo is needed.  I give all of you women so much credit, you make this process do-able. michele Dx 1/9/2009, IDC, <1cm, Stage I, Grade 2, 0/4 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730777",
      "Title": "bil/mas with t/e, when will I feel comfortable again? jpixstix JanMarch"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "jpixstix wrote: Hello everyone.  I had a bilateral masectomy with tissue expanders on feb 23rd.  It is almost 3 weeks and I am still so uncomfortable.  I experience these pains that come and go and they almost feel as if my ribs are digging into my chest, I can't reach above my head completely without the stretching feeling or pain and the pain seems to get worse the flatter I lay down.  Is all of this normal? When can I expect to start to feel normal again? I am a very active mother of 3 and having to depend on everyone else is making me depressed.  I meet with the onc on Tues and will find out if chemo is needed.  I give all of you women so much credit, you make this process do-able. michele Dx 1/9/2009, IDC, <1cm, Stage I, Grade 2, 0/4 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730777",
      "Title": "bil/mas with t/e, when will I feel comfortable again? jpixstix JanMarch"
    },
    {
      "AuthorID": "jpixstix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80755/profile",
      "Content": "Mar 15, 2009 09:57PM jpixstix wrote: I had a my BM with TEs on 2/23.  At the time the surgeon did not think he would be able to expand any, however, after my surgery I was informed that he was able to put in 100 cc.  I had my first fill last week and also noticed that they seem a little bigger a day or two after.   I was a very small A cup prior so I already think I'm ahead of where I was. I would imagine you will be seeing your doctor again shortly, check with him/her as well.",
      "MessageIndex": 4,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730763",
      "Title": "Ms w/ TE on 3/03 I am swollen! Why? comingtoterms comingtoterms"
    }
  ]
}