{
  "AuthorID": "jpmercy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107508/profile",
  "Posts": [
    {
      "AuthorID": "jpmercy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107508/profile",
      "Content": "Nov 6, 2011 08:10PM jpmercy wrote: Hi ladies, wondering if anyone could shine some light, I'm 31 fished chemo last January had just taxol weekly 12 weeks and herceptin for the yesr just finished that have had three periods in past 10 months....terrified that I'm going into menopause and wont be able to have more children.....I'm so sad and terrified to have any tests done to confirm menopause but also just want answers it's been three months since last period, took an ovulation test just to check it said I was ovulated but I've read that is a bad sign since ur lh levels are high in menopause so it common to get a faulse positive for ovulation....anyway just worried thanks for reading....",
      "MessageIndex": 19,
      "PostDate": "06/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762701",
      "Title": "Return of menses LtotheK slanderson"
    },
    {
      "AuthorID": "jpmercy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107508/profile",
      "Content": "Nov 10, 2011 05:02PM jpmercy wrote: Thanks ltothek! I actually got my period this week, going to start acupuncture And hope for the best!",
      "MessageIndex": 21,
      "PostDate": "10/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762701",
      "Title": "Return of menses LtotheK slanderson"
    },
    {
      "AuthorID": "jpmercy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107508/profile",
      "Content": "Jan 5, 2012 01:07AM jpmercy wrote: fertile hope is a great resource! you can google it and find the website you can also call them. i have heard of woman taking lupron shots and such or you can freeze eggs ect. all of which fertile hope can help with. i am 31 finished chemo at 30. i did taxol x 12 and herceptin for a year taxol is not as hard of a chemo and with my young age my periods have returned to normal but took a long time to regualate just went three months in a row with them regular hoping they stay this way as i did not save eggs and can start to try for my second child in two more months! good luck to you i know BC at our age is terribly difficult! PM if you would like! Jen",
      "MessageIndex": 2,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780261",
      "Title": "chemo and pregnancy an1245 jpmercy"
    },
    {
      "AuthorID": "jpmercy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107508/profile",
      "Content": "Sep 23, 2010 09:54AM jpmercy wrote: hi ladies, i was wondering if anyone is in a similar situation. i started off original dx with DCIS grade 3 multifocil BMX on Sept3 final pathology showed Grade three multifocil microinvasions and a 2.5mm tumor that is HER2neu +3 and grade three 40% ER/PR anyway i jsut turned 30 so im confussing to my oncologists and ive seen a few one at a major cancer institute. they are recommending a year of herceptin and four doses of light chemo with taxol and something else but i cant remember the name anyone go this route for such a small IDC? i have an 8 month old baby and i feel like ill through anything at this at this point i just want it gone! and im hoping to eventually have another baby lots of wondering and worrying about what lies ahead any insight would be great!!  also what exactly does HER2 +3 mean? thanks ladies!",
      "MessageIndex": 3700,
      "PostDate": "23/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "jpmercy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107508/profile",
      "Content": "Sep 23, 2010 01:05PM jpmercy wrote: Thanks Seyla and elimar! i know having found this early and knowing how aggressive it was it what is making me feel thankful and not so upset about the upcoming treatments, Seyla your 4x chemo sounds simlar and the herceptin what were your side effects did you loose all your hair with the 4x chemo? and any problems iwth herceptin? thanks!",
      "MessageIndex": 3705,
      "PostDate": "23/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}