{
  "AuthorID": "Jr114",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
  "Posts": [
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 13, 2016 04:05AM - edited Jan 13, 2016 04:07AM by Jr114 Thanks Grandma3x. Same to you and Kessa619. I didn't sleep well myself...a lot anxiety. Sending you both calming thoughts and prayers Thanks mominator for the link. I will definitely check it out",
      "MessageIndex": 291,
      "PostDate": "13/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 1, 2016 04:46AM Jr114 wrote: Hi Kessa, I don't think there are any nodes there. I would definitely call Drs....they should be aware of any changes. Sending calming thoughts....the anxiety is awful. I have a skin spot that has a bluish tint to it that they have me cream to put on .....hoping it isn't the start of necrosis. The top layer keeps pulling off but seems like new skin keeps coming up but still is bluish. I go tomorrow to both bs and ps so hopefully they will be able to tell me something on it.",
      "MessageIndex": 622,
      "PostDate": "01/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 4, 2016 03:39PM Jr114 wrote: Balthous---- Mainland side of Long Beach Island. Hopefully another good nights rest",
      "MessageIndex": 705,
      "PostDate": "04/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 16, 2016 06:50AM Jr114 wrote: Hi everyone. I am glad to hear of the positive responses from everyone outcome. My experience was more like Balthus. Had delay in surgery so didn't make it out till 630. Then didn't get to room till about 8. Had a lot of nausea from surgery. Thank goodness my husband stayed with me the first night. The pain and being sick was awful. They were giving me a lot of fluids and pain meds through IV to get me comfortable. I ended up having to stay another night due to fever and hemoglobin being really low. I got to come home late yesterday and sooo glad to be here. Still having lots of pain but Valium and Vicodin helps. I have to do breathing excerise frequently to help with chest expansion. Seems that everyday is getting better so hoping to be able to wash hair soon. No shower for me till drains are out. Too be honest don't think I could do it right now. On antibiotics every 6 hours and have to watch for more fever. Supposed to get up and move around and use arms to stay loose. Good news came that node was clear but will get rest of pathology in a week or so. Hugs to all hoping everyone is progressing day by day.",
      "MessageIndex": 355,
      "PostDate": "16/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Apr 16, 2016 12:19PM Jr114 wrote: Gardengirls -- glad to hear you are doing good and getting some traveling in. After my last fill and before my exchange surgery my husband took me to Myrtle Beach for a couple days. Our first alone vacation since having kids (which was along time coming since they are19 & 15). It was great for me to just not have to think about cancer, surgeries etc. Grandma3x - glad to hear from you. I am hoping there is a lot less anxiety with your surgery in May. Glad to hear the ai aren't giving you too many se. I hope everyone else in our group is doing well",
      "MessageIndex": 929,
      "PostDate": "16/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 15, 2018 05:39PM - edited Jan 15, 2018 05:41PM by Jr114 Checking in with all my surgery sisters on the 2 year anniversary. Things have settled into the new norm. Sending positive thoughts to you, grandma3x. Hoping your biopsy comes back clear. I had a complete hysterectomy December of 2016 bc of the brca 1 test coming back positive luckily everything came back good Hoping 2018 is filled with good health, peace and happiness for everyone!!!",
      "MessageIndex": 963,
      "PostDate": "15/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 27, 2016 04:59AM Jr114 wrote: Great news mominator.....so happy for you. One more step to this being behind you",
      "MessageIndex": 544,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 28, 2016 04:57AM Jr114 wrote: Balthus - I would definitely get another opinion. It took me 3 bs to get to the one that I felt confident with and I am so glad I did. You have to be sure that you are happy with the final result and have all information to make an informed decision of how to proceed. As far as AI - Back in April I had two excisional biopsy that resulted with large amount of adh. My bs thought that I should try taking tamoxifen bc it was er/pr+. She said try it and hopefully it will block the estrogen and starve off any potential cells from changing. I did try it but 3 month later my next mammo came back with calc then biopsied came back dcis. Due to the large area I went with nsm bmx. I did not handle tamixifen well so I will prob opt not to take again if suggested. But during the journey I have talked with many that have taken these type of drugs with very little side effects so I would suggest if it makes you feel better to try it since no one can give you a definite yes or no to take or not to try it especially if it will give you peace of mind that you tried it Mominator--- hope you are doing better today. Merymete- try to take it easy so wounds can heal. That really stinks to have the wounds reopen. Decisionfreak - Glad to hear that your surgery was a success and you handled it well. I can't believe that it is the end of January already, Seemed like my time up to surgery went slow and now the last two weeks since my surgery really went by fast. I went for my post op appt#3 and I still can't have drains out since My output is double what they want. Next appt is Tuesday so fingers crossed that drainage gets better. Down to just Advil now at night so pain is really minimum. Hugs to everyone.....things get better with each passing day. ",
      "MessageIndex": 559,
      "PostDate": "28/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 30, 2016 05:01PM Jr114 wrote: Hello everyone, I had my bmx nsm on 1/13. I still have 2 drains in and still producing 40cc every 24 hours which has been pretty consistent for over a week. Any suggestions on how to get drainage to reduce? They want me at 20cc in 24 hrs to remove them but just doesn't seem to be changing for me. I also have a small skin opening that they have me putting cream on twice a day. They say they aren't that worried about the skin bc it has blood flow to it. Any suggestions would be appreciated.",
      "MessageIndex": 601,
      "PostDate": "30/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 30, 2016 05:18PM Jr114 wrote: Hi kessa619, My limitation was pickup nothing over 5lbs, limit over shoulder lifting, basically no housework ( laundry, vacuum etc). So Ithink in the beginning I was doing too much just to move around but now I really have been taking it light, but other then the color now being yellowish clear the output still is the same. It is actually starting to make me a little crazy lol---who would think not being able to vacuum would bother me somuch. My swelling has really gone down so I thought that would help with reducing output. Still have a lot of tightness at times with the te. The ps made it sound that until the drains are out we can't start filling. Also they will not give me driving clearance with the drains in.",
      "MessageIndex": 605,
      "PostDate": "30/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 4, 2016 10:48AM Jr114 wrote: blue heron-- ugh I hate the not knowing. I opted for bmx for my dcis biopsy to avoid rads and taking hormone therapy but knew it would be determined with final path results as long as it came back with just dcis. Luckily that is what it came back with. I would definitely seek another opinion. I have found that different doctors have different insight",
      "MessageIndex": 696,
      "PostDate": "04/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Dec 26, 2015 04:24PM - edited Dec 26, 2015 05:15PM by Jr114 Hello everyone...I was diagnosed with DCIS in the beginning of December after biopsy. I have scheduled my bmx for January 13. After 2 excisional biopsy's in April that resulted in ADH bordering on DCIS and now another biopsy coming back with DCIS decided on bmx with te. It has really helped to read about everyone's experiences on this website  ",
      "MessageIndex": 34,
      "PostDate": "26/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 6, 2016 01:53PM Jr114 wrote: Edwsmom - I am also going with nsm, my area was far enough away that they felt I was safe to try and keep them. My bs said that they will biopsy the area near the nipple and I may have to have it removed. It was a hard decision to make but emotionally I think it is better for me",
      "MessageIndex": 171,
      "PostDate": "06/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 8, 2016 05:34AM Jr114 wrote: Thank you Grandma3x for that information. There are so many things to have to look into from treatment, surgery, recovery etc. it is great to have this forum as a way to prompt different discussions with all the different doctors. This week has been a long one. Gearing up for surgery next week. Last day of work is Monday .... I hadn't told many clients of what I am dealing with sooooo having to tell some of them has been tough bc it seems they do not know what to say. Heading to preop appt now...Hope everyone has a nice Friday",
      "MessageIndex": 199,
      "PostDate": "08/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 11, 2016 10:43AM Jr114 wrote: I believe it is standard too. My bs and ps told me I would be the last surgery of the day because of the reconstruction. They said the plastic surgeon does not like to be rushed and if he has the last surgery spot he can take all the time he needs. ",
      "MessageIndex": 256,
      "PostDate": "11/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 12, 2016 06:38AM Jr114 wrote: Glad to hear that Balthus. Calming and healing thoughts to everyone!!!",
      "MessageIndex": 271,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Apr 25, 2016 04:48PM Jr114 wrote: Great news Mominator. I am on a similar schedule. 6 mo for both bs and ps. I have some ripples and ps offered fat grafting. I told him that I would see how things go but I didn't want to do anything else till September. I still have to deal with hysterectomy within the year but probably won't have that surgery till the end of the year. I just also want to say that this forum was a very comforting place to come during this journey. Thank you to everyone that has shared. I am back at work now, but I still check in to see any updates. Hugs to all!!!!",
      "MessageIndex": 938,
      "PostDate": "25/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 21, 2016 03:36AM Jr114 wrote: Hi Everyone, Wow I am so glad to hear of the great progress that so many are making in the healing process. It has been a little hard for me to keep up with all the posts (with the drug induced haze of Valium and Vicodin). But I am one week and one day post opt and everyday seems to get a little better. I did have a couple bad days between pressure from the te and constipation. My ps suggested heating up a couple ounce of prune juice and drinking it down. They said wait and hour or so an if it didn't work to try again.....after the secnd glass....relief. ☺️. I got a call yesterday that my pathology report came in and it was pure dcis with more adh around it. So that was great news that no invasive component was found. I am not sure of the total area but they said I made the right choice having the bmx especially with the brca 1 gene coming back positive for mutation. I will get to see the whole report when I go back to her in a couple weeks but they wanted to at least give me the good news. I also had my follow up with ps and they said everything is looking good. I have one area of concern where there is blue dye that has dissipated but they hope as I start to excerise that arm it will be better. I was very happy with the new look. I was afraid that I wouldn't \"be me\". But incisions and everything went well and my husband has been super supportive about it and he said that he didn't care what it looked like that it will be perfect what ever the out come. I tried to sleep in my bed the first couple nights but that was a disaster so I am now sleeping in recliner which is 100% better. My doctors don't want me to try to stop pain meds yet. Getting rest and being able to be mobile is really important. Does anyone have any suggestions for the tightness associated with the tissue expanders. I get very bad pain in my upper chest from them and nothing seems to help. I have been trying breathing excerises, stretching but nothing is working (but the pain meds of course😳) We are bracing for a winter storm here in South New Jersey.....hopefully it is all hype.being by the coast usually means one on 2 things. Either we get nothing or we get slammed. My husband has been doing so much that I definitely don't want him to have to deal with more. Sending hugs to everyone. I am hoping everyday gets a little better for everyone.   ",
      "MessageIndex": 437,
      "PostDate": "21/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 26, 2016 05:26AM - edited Jan 26, 2016 05:38AM by Jr114 svgsurvive - so happy for you that is great news. It is always positive to hear good outcomes. I received my final pathology report and it came back good 👍. All dcis was removed with some adh also removed from my left side. Clean margins also so I think my decision for a nsm was good. I have tissue expanders in and the first view at my first post op appt I handled good....thinking that it looked pretty good. The second post ops was a little harder since swelling went down quite a bit and looked a little more disfigured. Poor hubby because I think it was my first day I really cried about it....he was surprised by my reaction because he said I looked great. He has been my rock through this whole process. I am 43 and it kinda of hit me at that moment that this was the new me. A little more emotional for a couple days after that too...but better theses days. I was a little mad at myself for being upset because I know my situation could be so much worse. I meet with mo and bs next week but have my next appt with ps tomorrow hoping for these drains to come out and first fill ups are scheduled. Anysuggestions on going for the fill ups....should I take a Valium or Vicadin for the visit. I have been trying not to take either just Advil Tylenol but thought I might need a little more for that appt. Sending all good thoughts to those coming up for surgery. Just know that everyday definitely gets better. I know that the first day I could reach down and put my own socks on I felt like such a huge milestone. Like I should put a gold star on the calender or something. Lol As of Wednesday I am two weeks after surgery and able to dress myself and am feeling pretty good. TE are a little uncomfortable but as long as I keep moving, they get better. Since I live in south NJ this snow put a damper on getting a nice walk in. However good excuse not to have to go out and shovel. ❄️❄️❄️❄️ I am not allowed to do any excersizing for a couple more weeks but ps want me to move arms around and try to move around as much as possible. Sending hugs to all....",
      "MessageIndex": 531,
      "PostDate": "26/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 2, 2016 02:57PM Jr114 wrote: Decisionfreak I couldn't imagine dealing with both your and your moms health decisions. Hang in there and take it day to day. Good luck at your post op!! Grandma3x- I am not sure if the saline settles as you go on. They filled me with 180cc at time of surgery and it seemed that the pain shifted over the first couple days. Not sure if that was just from the surgery or from the shift in fluid. ",
      "MessageIndex": 654,
      "PostDate": "02/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 4, 2016 03:14PM Jr114 wrote: Mominator--- that is great .....sometimes it is the little things....sometimes it's the big things that make it a little better day!!! I am from the Jersey shore area as well.....hoping no snow!!! Have a good night!",
      "MessageIndex": 702,
      "PostDate": "04/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 13, 2016 02:32PM Jr114 wrote: Melgirl...I know exactly where you are coming from. I am about 4 weeks out from my bmx with te. I can tell you that this last week I have been feeling better. During surgery they put in 180cc and I had a really hard first 2 weeks. My drains didn't come out till week 3. I just last Tuesday had my first fill up of 60cc and surprising to me it actually helped my discomfort. I go again on Tuesday for next fill up. Hopefully it is the same for you. I wear a loose fitting cotton bra that closes in front. I had stopped taking the prescribed Valium at two weeks and was miserable. I went back to taking it night and it helped me sleep. I also did some walking before this cold snap and that helped as well. Hang in there...it has gotten better for me I hope it is the same for you. I am just catching up on the posts. Glad to hear the good news that have been posted. ",
      "MessageIndex": 795,
      "PostDate": "13/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Dec 27, 2015 07:41AM Jr114 wrote: My boys are 15 & 18 and since having two excisional biopsies in April they have been aware of what is going on with me. So when my last needle biopsy in November came back DCIS we were able to sit down and talk about it. My older son was diagnosed with Type 1 diabetes a week after graduating high school and he handled it extremely well. His word were \"It is what it is\" and that has become our saying. His attitude towards his diagnosis has really helped me. Thank you to everyone for posting it has really helped me .....it is really a journey that has a lot of ups and downs. Taking it day by day and not looking to far ahead helps me ",
      "MessageIndex": 47,
      "PostDate": "27/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 6, 2016 10:22AM Jr114 wrote:",
      "MessageIndex": 166,
      "PostDate": "06/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 7, 2016 04:22AM Jr114 wrote: Hi Kaybee....glad to hear you are now on the recovery road. I am having surgery next week. I am 43 and having similar surgery. How are you managing your pain? I am nervous about the drains. Glad to hear you were up to posting here. Hoping everyday gets a little better for you!!!",
      "MessageIndex": 182,
      "PostDate": "07/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 9, 2016 01:10PM Jr114 wrote: Thank you for your responses. Glad to hear that the dye injection wasn't too bad. My surgeon said they will numb the area prior to the injection so hopefully that will help. I wasn't given any cream. My surgery is tentatively scheduled for 11:30 so hopefully that doesn't change and I can do it all in one day. It is getting to the point that I am ready for the surgery part to be over with so I can get to the healing part. Sending out healing thoughts to everyone  ",
      "MessageIndex": 228,
      "PostDate": "09/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 3, 2019 05:13PM Jr114 wrote: Happy New Year to everyone!! Just checking in on our 3 Year anniversary. I go for my 3 year check up in February. I still struggle with a little fatigue which seems a little worse in the winter but I think it is due to less activity. I hope everyone is doing good... Woodstock99... I am hoping for a negative biopsy result for you. Wishing everyone a happy, healthy 2019.",
      "MessageIndex": 969,
      "PostDate": "03/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 9, 2016 05:49AM Jr114 wrote: Thanks Balthus that is a good reference guide. Gemma12. Glad to hear you are doing so well. It is encouraging to hear you are progressing. I am sorry if you already posted this but how long before surgery did you have to go in to the hospital to have the dye injected for the snb part. My bs said if my surgery time is early in the morning that I may have to go the day before to have the dye injected. I am hoping not to have to do that. I have enough anxiety about going to the hospital. I was just curious how long the dye takes to get to nodes ",
      "MessageIndex": 219,
      "PostDate": "09/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 10, 2016 09:03AM Jr114 wrote: I agree Grandma3x.....there are many things to be thankful for and I keep telling myself it could always be worse.A year ago when I went for my very first biopsy (12/23/14)I never thought I would be where I am. After seeing two prior surgeons that told me I should just \"wait and see\" I was totally frustrated and worried. Finally in April 2015 I went and saw my current breast surgeon and she was very knowledgeable and confirmed that something wasn't right. I am very thankful that I did not listen to the first 2 Drs. Who knows where I would have been if I would have just waited. Grandma3x.... I am glad you followed you gut and pursued that something wasn't right. It was the same for me. 27heart - Good luck tomorrow....sending calming thoughts your way. Sending positive thoughts to everyone going in for surgery this week. Also hoping that everyone that had surgery last week a quick recovery.",
      "MessageIndex": 237,
      "PostDate": "10/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 22, 2016 02:53AM Jr114 wrote: Good morning all... So sorry to hear Grama3x that more surgery is in your future. But hopefully it is just the next step in your journey to having this behind you. It is a shame with all the tests that they couldn't see more of your tumor. Opting for having your other side done may be a good option for you. I decided to get a bmx when I had surgery for a couple reasons but peace of mind was a big one. I will have to meet with my gyn in the next couple months to discuss a hysterectomy .I am not sure we're our journeys are leading us but I always feel there is a reason things happen and if we just follow our path it will become clear. Melville - they did not do a snb on my prophylactic side since there was no sign of cancer. Svgsurvive- thank you for that great post......for some reason I am having trouble absorbing all the info and having to read it repeatedly. I guess it could be the Valium and vicaden Lol. I wanted to mention that I have a blue dye mark as well that does cause me some concern since it hasn't dissipated. Hoping it is not a skin problem. Going back to ps to look at it today. Hope everyone is on the healing road and good luck to all the strong women that will be having their surgeries. Supposedly expecting a snow storm tonight and on the good side for us...no shoveling allowed(Sorry for typos but it's early and not quite awake yet before my coffee☕️❄️⛄️) Hugs to all......",
      "MessageIndex": 461,
      "PostDate": "22/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 1, 2016 05:20AM Jr114 wrote: Good morning Grandma3x That is great to have first fill. My ps told me that usually it is 50cc a fill but depends on the person. Sometimes they have to do less but more often. He also told me possibly weekly fills. Did your ps tell you how often they will fill",
      "MessageIndex": 624,
      "PostDate": "01/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 2, 2016 04:25AM Jr114 wrote: Melgirl I have pain in my chest and different parts of my chest at various times. The ps told me it is the muscles and the te. I am 3 weeks out tomorrow and still have this. I occasionally at night still have to take a Valium just to relax the muscle. I think bc he put 180ccin the te my muscles are still adjusting.",
      "MessageIndex": 633,
      "PostDate": "02/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 3, 2016 04:17AM Jr114 wrote: Thanks Mominator for that response. I was up most of the night worrying that they came out too soon. However felt good to not carry them around. ",
      "MessageIndex": 662,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 4, 2016 08:44AM Jr114 wrote: Balthus-- sounds like quite an adventure. I still haven't driven since surgery. Thanks for the tips on stretching. I have a lot of tightness and doing small stretches help to loosen thing up. I wonder if I have a little fluid build up. The tightness is not totally not tolerable but just uncomfortable most of the time Grandma3x. How frustrating when you have to reschedule appts. Welcome carjeanne3 and moonstruck. This is a great place to ask questions, vent and get great information.",
      "MessageIndex": 689,
      "PostDate": "04/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 4, 2016 04:16PM Jr114 wrote: Hi Melgirl... I am 3 weeks post op yesterday and things seem to get a little better everyday. I hope the coming days improve for you as well",
      "MessageIndex": 707,
      "PostDate": "04/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Dec 29, 2015 12:21PM Jr114 wrote: Hello Everyone, MKTCA--- I had two excisional biopsies in April and I would have to say that ice packs were very helpful in the day or two after. Grandma3x- my ps said he was going to give me all my post op prescriptions when I meet back with him before surgery. I think keeping busy really helps. Now that Christmas is over it seems my mind seems to think of the surgery. I am better when I am at work.    ",
      "MessageIndex": 54,
      "PostDate": "29/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 12, 2016 10:53AM - edited Jan 12, 2016 10:54AM by Jr114 Thanks Kaybee for the update.....that is very encouraging andgreat to hear you progress. I am from NJ too and noticed the flurries. Hoping that the nipple area just needs a little more healing time. That is the same procedure I am having and they told me it is not a 100% that it will be successful but I really want them to try. I just got my genetics test back and tested positive for brca1 mutation. Ughh!!! Sounds like I will be having to make some more surgery decisions in the future. The only positive is it reaffirms my decision for bmx. Still waiting for my final time for surgery. They said they will call after 3 to confirm my 12:30 surgery time and to let me know my time for snb injection. Hugs to all!!",
      "MessageIndex": 278,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 2, 2016 06:07AM Jr114 wrote: Balthus- I go to both ps and bs today. I also look pretty good but can most of the time move like a turtle. I still have drains in and not allowed to get them wet. Both Drs said I am out of work at least 6 weeks but possibly more. I have a desk job but it requires a lot of up and down. Definitely feels like Groundhog Day",
      "MessageIndex": 638,
      "PostDate": "02/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 2, 2016 02:07PM Jr114 wrote: Kessa- great to hear that!! I saw bs and ps today. They decided to take drains out even though my output was still higher than 20cc. They also cut out dead skin caused by the blue dye and stitched together the good skin. Glad they were able to do that in the office. ",
      "MessageIndex": 650,
      "PostDate": "02/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 4, 2016 10:38AM Jr114 wrote: grandma3x. That is great news!!!",
      "MessageIndex": 693,
      "PostDate": "04/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 4, 2016 10:40AM Jr114 wrote: Decisionfreak---- that is also great news!!! So good to hear good news today!",
      "MessageIndex": 695,
      "PostDate": "04/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Feb 13, 2016 03:00PM Jr114 wrote: Melgirl... I did not wear a compression bra because like you it caused too much pain. I have been trying different sports bras but have found the only one that works is by Hanes. When talking to PS he told me that the te will cause spasms but with time it will get better. I have also tried to eat more protein to help heal the muscle. I hope some of this will help you",
      "MessageIndex": 797,
      "PostDate": "13/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Dec 26, 2015 05:46PM Jr114 wrote: I found abbreviations under help under the menu section.",
      "MessageIndex": 38,
      "PostDate": "26/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 10, 2019 05:20PM Jr114 wrote: Woodstock 99...sorry to hear that you will be going through more doctoring...ugh! I agree with Mominator about thyroid treatment. A friend of mine had similar surgery and has been on medication for many years and is doing great. I can understand the nerves and stress of dealing with yet another hurdle. Sending positive thoughts your way...",
      "MessageIndex": 972,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Apr 13, 2016 11:51AM Jr114 wrote: Hello Balthus, It is great to hear that you are getting back to pre-op norm. It is hard to believe I hit my 3 month anniversary today. Looking back to the days of surgery it seemed that life would never be normal again but now I can see the light. I am a week post op from exchange surgery and feeling so much better and more like my \"old\" self if that is possible. I am returning to work next week after being out since January surgery. I am a little nervous but also excited to start back to my old routine. I am so thankful I was able to take this time off because I needed the time mentally to wrap my head around everything that has happened in the past year. I do not have to go back to the bs and mo till July so I guess we are on the same follow up schedule. I was back to walking almost two miles prior to my exchange surgery and hoping to be starting back to walking after next Tuesdays follow up appointment. Sending out good thoughts to everyone and hoping that spring has finally sprung here in NJ . It figures that the weather is finally supposed to warm up once I go back to work. ",
      "MessageIndex": 925,
      "PostDate": "13/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Oct 31, 2017 06:22PM Jr114 wrote: just checking in with everyone... just had my 6month check up since I had to have a revision surgery in April of this year. I hope everyone is progressing good. I seem to have more good days then bad but every so often the anxiety creeps back in. I am changing primary care doctor which is making me a little nervous but I guess if I don't like him I can always change again. Sending good vibes to everyone!",
      "MessageIndex": 956,
      "PostDate": "31/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Jr114",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225595/profile",
      "Content": "Jan 25, 2018 05:08PM - edited Jan 25, 2018 05:08PM by Jr114 Grandma3x....I am so so to hear about your granddaughter...I will keep her in my thoughts. So young to be dealing with such issues. I also want to thank everyone who contributed to this thread. I was very thankful for the connections ...it really made me feel like I was not alone in this journey. My cousin goes in for a biopsy on Wednesday...I am praying for a benign diagnosis. The doctor told her he doesn't think it is anything to worry about...doing biopsy for precautionary purposes. Fingers crossed that it is nothing ",
      "MessageIndex": 966,
      "PostDate": "25/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    }
  ]
}