{
  "AuthorID": "jrow7",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
  "Posts": [
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "jrow7 wrote: Hello 🙂 My PCP called me this evening and told me I have DCIS (which I was expecting because I researched medical journals like a crazy woman, lol). He said it appears \"aggressive\" so he sent a note to the Breast Hlth Ctr and asked they see me as soon as possible. Honestly I don't recall much of the conversation. He said he would release the path report to my online chart so I could see it. I've pasted it below. Is it me or does the path say not only DCIS but IDC as well? I feel quite in a daze reading it. 8am can't come soon enough, I'm hoping for a face to face as soon as possible to go over it. ~jen Left breast, calcifications, stereotactic core biopsy: · INVASIVE MODERATELY DIFFERENTIATED DUCTAL CARCINOMA, THREE FOCI MEASURING 0.3 CM IN GREATEST DIMENSION IN THIS LIMITED SPECIMEN. · LYMPHOVASCULAR INVASION PRESENT. · EXTENSIVE HIGH NUCLEAR GRADE DUCTAL CARCINOMA IN SITU WITH COMEDONECROSIS AND ASSOCIATED MICROCALCIFICATIONS. MICRO: Sections show multiple cores of breast tissue which are involved by extensive high nuclear grade ductal carcinoma in situ with associated microcalcifications and comedonecrosis. Within this background are three foci of invasive moderately differentiated ductal carcinoma measuring up to 0.3 cm in greatest dimension. Invasive ductal carcinoma shows a solid nested pattern with no tubule formation, moderate to marked nuclear pleomorphism, and up to 9 mitoses/10 high power fields. There are foci of lymphovascular invasion identified, confirmed by immunohistochemical stain for CD31 performed on block 1A. The presence of invasive ductal carcinoma is confirmed with immunohistochemical stain for smooth muscle myosin heavy chain performed on block 1A Dx 3/1/2017, DCIS, Left, 1cm, Stage 0, Grade 3, ER+/PR-, HER2- Dx 3/1/2017, IDC, Left, 1cm, Stage IIA, Grade 3, 1/4 nodes, ER-/PR-, HER2+ (IHC) Surgery 3/1/2017 Lymph node removal: Sentinel; Mastectomy: Left; Reconstruction (left): Nipple reconstruction; Reconstruction (right): Nipple reconstruction Chemotherapy 4/13/2017 AC Targeted Therapy 6/7/2017 Perjeta (pertuzumab) Chemotherapy 6/7/2017 Taxol (paclitaxel) Targeted Therapy 6/7/2017 Herceptin (trastuzumab) Radiation Therapy 9/19/2017 Whole-breast: Breast, Lymph nodes Hormonal Therapy 11/3/2017 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/851796",
      "Title": "Overwhelmed jrow7 Moderators"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Feb 1, 2017 07:09PM - edited Feb 1, 2017 07:09PM by jrow7 The BS spoke again with the PS and now he is saying he would do the lift/reduction on the R breast while BS completes lumpectomy on the L. However we are all waiting on genetics result. I think I'm giving this page a break for a bit. Just too overwhelmed",
      "MessageIndex": 15,
      "PostDate": "01/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/851796",
      "Title": "Overwhelmed jrow7 Moderators"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Feb 7, 2017 08:12AM jrow7 wrote: Surgery pushed back until 3/1 so both the BS and PS will be present... Genetics negative",
      "MessageIndex": 17,
      "PostDate": "07/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/851796",
      "Title": "Overwhelmed jrow7 Moderators"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Jan 30, 2017 02:41PM jrow7 wrote: Hello again...so the result of the breast MRI was another area of concern, which then lead to an US to confirm what they saw and then had an MRI guided biopsy which revealed DCIS at the \"noon\" position of my left breast in addition to the DCIS and IDC at the 3 o'clock position. Had blood drawn today for genetic testing, we should know that result sometime next week. Chance is minimal but insurance covered it so why not be extra sure, right? No chemo before. Surgery is scheduled for 2/13, large lumpectomy, left breast. BS is going to take the area from noon to 3 out, which will reduce the size of my left breast. She's going to reduce the size of my right breast at the same time - also moving my nipple upwards so that both of my nipples will be at the same location. I begged her to do as much as she can in one operation because I do not want to keep resetting my \"healing clock\" to deal with this. Praying for clean margins so I can heal and prepare myself for the next step in this battle. That's about it for now. I'm sticking with my Dr in NH vs Boston - just didn't get the best feeling being down there (too many people). ",
      "MessageIndex": 8,
      "PostDate": "30/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/851796",
      "Title": "Overwhelmed jrow7 Moderators"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Jan 12, 2017 02:08PM jrow7 wrote: Thank you everyone for taking a moment to drop in...much appreciated! I had my meeting this afternoon and I am feeling so much better and relieved. Yes I do have both DCIS and IDC but it's quite an early dx. I have a breast MRI scheduled for Monday with a follow-up appointment on Wednesday. We need to wait and see if lumpectomy + radiation or mastectomy. They would like me to have genetic testing since I'm on the younger side - which I'm going to have done because depending on that, it may be a factor in having a bilateral mastectomy - and the fact that we have 3 daughters (and 2 sons). I don't feel I need a second opinion but I am being urged by a few to head into Boston since \"that's where the best Dr's are\". I have asked for opinions on my current Dr and I have looked up her experience and I feel she is a good match to my personality. I'm comfortable with how we are approaching this. But we shall see....I may cave to the pressure. The hardest part has been saying \"I have breast cancer\" to my Boss, my coworkers, and friends. (I have a wonderful relationship with my boss & co-workers so that's why I told them.) So that's it for now....waiting patiently for Monday...feeling much more at ease....and continually reminding myself to focus on God... Much love to all ~ Jenn",
      "MessageIndex": 6,
      "PostDate": "12/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/851796",
      "Title": "Overwhelmed jrow7 Moderators"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Jan 31, 2017 12:12PM - edited Jan 31, 2017 12:20PM by jrow7 Yes she is trained in PS as well (Oncoplasty). I did meet with a PS as well. The PS did not want to touch my R breast until after chemo and radiation, which would be months down the road (something I am not interested in at all). That's why I went back to the BS and discussed the PS with her.",
      "MessageIndex": 13,
      "PostDate": "31/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/851796",
      "Title": "Overwhelmed jrow7 Moderators"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Mar 8, 2017 06:12PM - edited Mar 8, 2017 09:11PM by jrow7 hi! Had lx and lift last Wednesday. Found out today I'm actually Stage 2a because of lymph node involvement. Will need a port and chemo. Waiting for medical oncologist to call. Day by day.. Feeling pretty good. SNB site is more sore than anything else.",
      "MessageIndex": 143,
      "PostDate": "08/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Mar 15, 2017 07:28PM jrow7 wrote: so I met with the Oncologist and I start 20wks of chemo either 4\\5 or 4\\6. A\\C first then Taxol + Herceptin. Then radiation for who knows how long. Then tamoxifen for who knows how long. Ugh",
      "MessageIndex": 241,
      "PostDate": "15/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Feb 25, 2017 07:58PM - edited Feb 25, 2017 08:07PM by jrow7 Hello, I'm scheduled for 3/1 large lx left breast w/reduction & lift of right breast. Excited to get this show on the road & petrified all the same..",
      "MessageIndex": 81,
      "PostDate": "25/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Mar 15, 2017 07:54PM jrow7 wrote: sorry, I do have all the info. It's just so much to post. I'm feeling so overwhelmed. I don't know my start date because the Coordinator originally had me scheduled for 4\\3 but I don't want a Monday because I plan on working as much as I can. I haven't met with Radiation Oncologist yet ergo I don't know treatment length. Tamoxifen is a discussion we will have at a later time. Sorry I have a kindle and it makes it difficult to post (keyboard is awful). ",
      "MessageIndex": 245,
      "PostDate": "15/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Mar 16, 2017 01:01PM jrow7 wrote: 2FUN - that is a hoot about the Benadryl but eek!! Hope you are feeling well! I know I am...a lot fell into place today :o) Amen! Sorry for my little pity party last night - eekers! Port placement tomorrow! Woohoo, lets keep this show on the road folks! Hope all are well.....",
      "MessageIndex": 249,
      "PostDate": "16/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Feb 28, 2017 09:03PM jrow7 wrote: today is my day! 8hrs to go...excited and scared...",
      "MessageIndex": 90,
      "PostDate": "28/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Jan 27, 2017 10:57AM jrow7 wrote: Good morning, I've only been on this journey for a couple of weeks now. I've had a stereotactic biopsy and an MRI guided biopsy. I have IDC/DCIS HER2+ at the 3 o'clock position and DCIS ER+ at the noon position in my left breast. I've had quite a few appts so far. I'm hoping next Wednesday I'll have my fight plan laid out for me. We told our children a few days after my diagnosis because they picked up that there were whispers going on around them and saw the tears in my eyes. They're 19, 17, 15, 8, 8 - so far they're all handling it quite well. We've kind of made it a funny thing that mommy might lose her hair or not have a boob or either :o) Laughter is a stress reliever for us. I don't post much but I read a lot. This is a good site. I hope you have a good day today... :o) Praying for peace & comfort to you and your family.",
      "MessageIndex": 9,
      "PostDate": "27/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/852160",
      "Title": "I'm joining the club and so scared right now bratmobile singlemom1"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Jan 17, 2017 09:21AM - edited Jan 17, 2017 04:10PM by jrow7",
      "MessageIndex": 2,
      "PostDate": "17/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/851925",
      "Title": "St1/G2, Er-/Pr-/HER2 (3+) and MRI guided breast biopsy jrow7 Kicks"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "jrow7 wrote: This Post was deleted by jrow7. Dx 3/1/2017, DCIS, Left, 1cm, Stage 0, Grade 3, ER+/PR-, HER2- Dx 3/1/2017, IDC, Left, 1cm, Stage IIA, Grade 3, 1/4 nodes, ER-/PR-, HER2+ (IHC) Surgery 3/1/2017 Lymph node removal: Sentinel; Mastectomy: Left; Reconstruction (left): Nipple reconstruction; Reconstruction (right): Nipple reconstruction Chemotherapy 4/13/2017 AC Targeted Therapy 6/7/2017 Perjeta (pertuzumab) Chemotherapy 6/7/2017 Taxol (paclitaxel) Targeted Therapy 6/7/2017 Herceptin (trastuzumab) Radiation Therapy 9/19/2017 Whole-breast: Breast, Lymph nodes Hormonal Therapy 11/3/2017 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/851925",
      "Title": "St1/G2, Er-/Pr-/HER2 (3+) and MRI guided breast biopsy jrow7 Kicks"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "May 9, 2017 02:00PM jrow7 wrote: I've had two AC so far, I go in for my 3rd this Thursday. I'll do Taxol + Herceptin afterwards so we aren't in the same situation but I figured I'd share anyways since I think I have a \"good\" story. Day of AC I feel like my head is \"thick\" and feels horribly hung-over. Nausea and heartburn kick in around evening time. (My nurse is going to give me more fluid this week and see if that helps with the head complaint). For the next couple of days I take anti-nausea med, dexamethasone, Claritin, and Zantac then I drop the steroid and keep going with the other ones. I hydrate as best I can and nap or just lay low. Appetite takes a few days to come back but until then I just eat when I feel I can handle it. This last round wasn't as bad as the first, I made sure to keep sipping ice cold liquids or chew ice while the nurse administered the AC and I didn't have as many mouth sores and didn't feel like I had burned my whole mouth on something. I also started taking Claritin the day of so I didn't have too much bone pain - sternal pain but no hip/spine pain. My last AC was on a Wednesday so I took Thursday and Friday off. I worked the following Monday, Tuesday, took Wednesday off, worked Thursday then went to Drill Friday through Sunday. I would say I'm back to myself 100% around day 9-10. I wish you all the best in your treatment!",
      "MessageIndex": 5,
      "PostDate": "09/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854949",
      "Title": "AC Chemo lynae23 PowerpuffinSF2017"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Jan 16, 2017 10:32PM jrow7 wrote: 40, screening mammogram found it",
      "MessageIndex": 693,
      "PostDate": "16/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Feb 14, 2017 04:37PM jrow7 wrote: Doesn't look like this thread has been active in the past few years (except for lately)....I'm in the same boat as you ladies. Surgery 3/1.",
      "MessageIndex": 100,
      "PostDate": "14/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    },
    {
      "AuthorID": "jrow7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245272/profile",
      "Content": "Jan 31, 2017 11:50AM jrow7 wrote: February 13th: large lumpectomy L breast and reduction of R breast. I feel like the \"large lumpectomy\" is really a partial mastectomy because BS is very concerned about the size of my R breast (in comparison to my L) after the procedure and making sure that she reduces the R to match the L. BS also mentioned something about moving my R nipple up on my breast so that it is at the same height as the nipple on my L breast. I feel like I need to have an appt and get some clarification (we cancelled our meeting for tomorrow because I said I understood everything but apparently, I do not lol)",
      "MessageIndex": 1397,
      "PostDate": "31/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    }
  ]
}