{
  "AuthorID": "JSB2011",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132201/profile",
  "Posts": [
    {
      "AuthorID": "JSB2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132201/profile",
      "Content": "Jul 24, 2011 07:43PM JSB2011 wrote: MustangSally, sorry you had to join this group but I will say that the ladies on these boards are an awesome source of positive support. We all share your concerns. I, too am 44 years old and have two young children and I know that scary feeling of thinking this is a death sentence. Please try not to think that way. I have been told to remain positive. Medicine has come a long way and there are soooo many people surviving breast cancer now. I found my lump back in February and was diagnosed in May. All these months have been a test of my patience. Wait Wait Wait. Biopsies, diagnostic scans, surgery. I am now waiting to start my 1st chemo this Thursday. I am terrified but the support I have from family, friends and the wonderful people on this forum has helped me immensely.  I know this is a terrible inconvenience and it just plain sucks! Totally know how you feel! Breathe. Concentrate on getting well. All things will fall into place. Keep coming back here for support. YOU WILL GET THROUGH THIS! We are all here for you! ",
      "MessageIndex": 18,
      "PostDate": "24/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772030",
      "Title": "just diagnosed yesterday.... MustangSally67 Jen42"
    },
    {
      "AuthorID": "JSB2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132201/profile",
      "Content": "JSB2011 wrote: Hello there. I just finished #6 of 6 rounds of TCH (yippee!!!) and will now begin the Herceptin (alone) treatments next week and every 3 weeks until July 2012. My question to anyone who has had Herceptin alone... Has it affected your tastebuds at all? I know with the combination TCH I have had horrible tastebuds for 10-14 days after each treatment. I am hoping that the Herceptin alone will be more forgiving. Thanks in advance! Dx 5/19/2011, IDC, 1cm, Stage IIIC, Grade 3, 13/20 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778566",
      "Title": "Herceptin Alone JSB2011 Judy_63"
    },
    {
      "AuthorID": "JSB2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132201/profile",
      "Content": "Nov 24, 2011 04:55AM JSB2011 wrote: @Kathleen1966, I didn't lose any weight while on TCH hehe. Just a few pounds the week after a treatment due to horrible tastebuds. But the weight always came back once my buds were working again. @AmyIsStrong, thanks for the advice. I can't wait for the day when I realize I feel great again! Soooo looking forward to that day! I wonder if I will have issues on my flight the next day if I take Benadryl during my treatment. Hmmm another question for the nurses. Thanks again!",
      "MessageIndex": 7,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778566",
      "Title": "Herceptin Alone JSB2011 Judy_63"
    },
    {
      "AuthorID": "JSB2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132201/profile",
      "Content": "Nov 26, 2011 05:47AM JSB2011 wrote: I was wondering about the steroids as well. My Onco says no steroids for me but I may be taking Benadryl. I hope I don't need it as it makes me very tired. I am hopping on a plane the next morning after my first Herceptin treatment and I hope to have enough energy to enjoy myself on this quick trip. My Onco said I would be fine. I guess I will find out soon enough.",
      "MessageIndex": 12,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778566",
      "Title": "Herceptin Alone JSB2011 Judy_63"
    },
    {
      "AuthorID": "JSB2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132201/profile",
      "Content": "Nov 24, 2011 04:12AM JSB2011 wrote:",
      "MessageIndex": 4,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778566",
      "Title": "Herceptin Alone JSB2011 Judy_63"
    }
  ]
}