{
  "AuthorID": "jsdbsn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281246/profile",
  "Posts": [
    {
      "AuthorID": "jsdbsn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281246/profile",
      "Content": "jsdbsn wrote: Let me first say - thanks to anyone who reads this. So I was in the shower yesterday and found a sizable lump. I can feel it very easily buy just running my hand down my shirt. How I missed this is beyond me! I use a wash cloth and don't do self checks. Dummy me. It didn't hurt one bit, until I found it, read google nonstop, and tried to figure it out myself. My breast hasn't seen that kind of action in a long time! :) I know most of us have probably googled the hell out of it and have no more answers than when we started! One thing I did find that is very confusing to me is when they say - does it move or is it rooted??? Does that mean it doesn't move at all? I also read, if you can roll it like a grape in-between your fingers that it is, most likely, fine. That's all fine and dandy, but I have no idea what they mean??? I did call Susan G Komen (yep, I guess I am panicking a bit). The girl I spoke to didn't really make it any clearer. She said it can move, but a doctor can tell if it seems to be rooted. Anyone, have any idea? Also, has anyone heard of someone finding a decent size lump and it being bad? Also, what do they mean by hard. Mine feels hard to me, but do they mean hard as a rock? I have an appointment on Friday though the BCCCP which can't come soon enough! Sorry for the \"freak out\" Side note: Years back I had some questionable fibroids, but it didn't freak me out, because the doc was very reassuring. I had a biopsy and it was fine. About 5 years after that I had a lumpectomy and again, it was fine. This just feels different. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867781",
      "Title": "a bit concerned and I don't want to worry anyone I know jsdbsn Astrid"
    },
    {
      "AuthorID": "jsdbsn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281246/profile",
      "Content": "Oct 16, 2018 12:42PM jsdbsn wrote: good news is that I got in today, due to a cancellation! The gynecologist tried to measure it, but she said it was difficult because the irregular shape. I’m scheduled for a diagnostic mammogram and ultrasound in ten days. I’m glad their moving quickly",
      "MessageIndex": 4,
      "PostDate": "16/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867781",
      "Title": "a bit concerned and I don't want to worry anyone I know jsdbsn Astrid"
    },
    {
      "AuthorID": "jsdbsn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281246/profile",
      "Content": "Nov 7, 2018 07:53AM jsdbsn wrote: Biopsies are done! She said that I shouldn’t worry and that I’ll have my results, most likely, this week. I’m not worried, especially after seeing all that some of you have gone through. You are a tough bunch and I thank you that you took the time to respond to me. Truly, you are amazing to take the time to put people like me at ease. I’ll be back in a few days with the good news!",
      "MessageIndex": 10,
      "PostDate": "07/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867781",
      "Title": "a bit concerned and I don't want to worry anyone I know jsdbsn Astrid"
    },
    {
      "AuthorID": "jsdbsn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281246/profile",
      "Content": "Nov 25, 2018 12:53AM jsdbsn wrote: got the all clear",
      "MessageIndex": 13,
      "PostDate": "25/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867781",
      "Title": "a bit concerned and I don't want to worry anyone I know jsdbsn Astrid"
    },
    {
      "AuthorID": "jsdbsn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281246/profile",
      "Content": "Oct 27, 2018 09:15PM - edited Oct 28, 2018 12:23PM by jsdbsn I had my tests! 3D diagnostic mammogram Radiologist then had me do a 2D to get a closer look of micro calcifications on the 3D Then the ultrasound She said one is a cyst but there is thickening and something beside it She thinks the other one is a fibroadenoma I'm not sure what the colors mean. The rad tech took pictures/screenshots of my lymph nodes but the radiologist said nothing about them. I am getting biopsies. She said I should be getting a call to schedule on Monday. If I don't hearby noon, I'm supposed to start calling them and they'll make sure the biopsy person responds. I'm a bit concerned about the sense of urgency on the biopsy, but she told me not to worry. Would the radiologist tell me if there is a cause to worry? Thanks! ",
      "MessageIndex": 7,
      "PostDate": "27/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867781",
      "Title": "a bit concerned and I don't want to worry anyone I know jsdbsn Astrid"
    }
  ]
}