{
  "AuthorID": "JSilb",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191592/profile",
  "Posts": [
    {
      "AuthorID": "JSilb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191592/profile",
      "Content": "Nov 26, 2013 09:04PM JSilb wrote: I met with the surgeon today. He agrees about the double mastectomy, but he thinks I may need chemo before the surgery. I have to go in for a biopsy of my lymph nodes now which I have already been told are probably malignant too. Has anyone done chemo before their mastectomy? The doctor says it is my best chance at long term survival. How bad is chemo? Can you still function while undergoing treatment? I don't care about losing my hair, but I am worried about not being able to do the things that need to get done.",
      "MessageIndex": 9,
      "PostDate": "26/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814690",
      "Title": "Got My Biopsy Back Today JSilb elindy"
    },
    {
      "AuthorID": "JSilb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191592/profile",
      "Content": "Nov 18, 2013 05:24PM JSilb wrote: I got my biopsy results. It is cancer. I have both invasive and noninvasive types. They think I may be stage 2 with a tumor grade of 3. I feel better knowing. I am scheduling a double mastectomy, and I will see what happens after that. there are a lot of scans coming up. I feel better just knowing.",
      "MessageIndex": 8,
      "PostDate": "18/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814339",
      "Title": "Radiologist told me I have a malignant tumor JSilb laura11103"
    },
    {
      "AuthorID": "JSilb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191592/profile",
      "Content": "Nov 27, 2013 06:33AM JSilb wrote: Thank you! I appreciate the info.",
      "MessageIndex": 11,
      "PostDate": "27/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814690",
      "Title": "Got My Biopsy Back Today JSilb elindy"
    },
    {
      "AuthorID": "JSilb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191592/profile",
      "Content": "JSilb wrote: I found out today thatI have both invasive and noninvasive breast cancer. They think I am stage 2, but I won't know for sure until after my mastectomy. The tumor grade is 3. It is a relief to know. I actually feel better about things now than when I was waiting for the results. I won't know about follow up treatment until after my surgery, but they think it might have gone to at least one lymph node. I am opting for a double mastectomy because of my family history and some spots in the breast that was not biopsied. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814690",
      "Title": "Got My Biopsy Back Today JSilb elindy"
    },
    {
      "AuthorID": "JSilb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191592/profile",
      "Content": "Nov 15, 2013 05:04PM JSilb wrote: Thank you so much for the information and support. I had a core biopsy done on Wednesday, but I don't get the results until Monday. I am most worried about my kids. My son is autistic and has a seizure disorder. I can't begin to think how this will affect him. He depends on me heavily. I have a sinking felling that the news isn't going to be good given my family history. It is going to be a long weekend of waiting.",
      "MessageIndex": 5,
      "PostDate": "15/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814339",
      "Title": "Radiologist told me I have a malignant tumor JSilb laura11103"
    },
    {
      "AuthorID": "JSilb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191592/profile",
      "Content": "JSilb wrote: I have my biopsy on Wednesday. At my mammogram and ultrasound the radiologist told me she is sure it is cancer and it is in at least one lymph node. I am scared. Right now I am most worried about the cancer spreading. My mammogram a year ago was fine, but when I went in for my annual the doctor found a pretty good size lump and sent me for a diagnostic mammogram a week ago. The radiologist did say that my left breast was fine; the cancer is in my right breast. She said that from the ultrasound it appears one lymph node is cancerous. I haven't been able to sleep since I found out. Are they able to tell the stage of the cancer from the biopsy? How fast does breast cancer spread? I am 46 years old. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814339",
      "Title": "Radiologist told me I have a malignant tumor JSilb laura11103"
    }
  ]
}