{
  "AuthorID": "Jtej",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229172/profile",
  "Posts": [
    {
      "AuthorID": "Jtej",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229172/profile",
      "Content": "Jtej wrote: Hello everyone. I am only 27 but i am scared to death about a lump i just discovered in my right armpit. I was doing a self exam. Always had fibrocystic changes in breast so my breasts always feel lumpy and its hard to tell what is concerning. Anyway, i have a small hard movable node under left armpit. And i started to feel my right armpit and found another smaller node. And i moved up and found another hard movable node but bigger and i freaked out until i moved higher and found a grape sized hard but movable node. It didnt hurt until i poked around so much (since it is high and deep in armpit) that i cant even touch it from the pain. Please is anyone has any reassuring stories. Share! I will be seeing my obgyn this week so i will be posting updates. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841528",
      "Title": "New and found a lump Jtej marie5890"
    },
    {
      "AuthorID": "Jtej",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229172/profile",
      "Content": "Feb 22, 2016 05:27PM Jtej wrote: thank you so much for your reply! My insurance doesnt kick in until march 1st due to my recent move, but i went today to my obgyn and paid out of pocket. He definitely feels it. Gave me a thorough exam and spent time feeling and examining it. He doesnt believe it is anything bad even though it is quite big. Im going back in a week. He will feel again and if its still there refer me to a specialist.",
      "MessageIndex": 4,
      "PostDate": "22/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841528",
      "Title": "New and found a lump Jtej marie5890"
    }
  ]
}