{
  "AuthorID": "JTilCT",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166623/profile",
  "Posts": [
    {
      "AuthorID": "JTilCT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166623/profile",
      "Content": "Jan 15, 2013 10:11PM - edited Jan 15, 2013 10:13PM by JTilCT Hi Everyone.  I am fairly new to this board so this is a great opportunity to introduce myself.  I am 47 years old and live the life of a suburban housewife, only because I am on sick leave from my job as a police officer. I was initially diagnosed in 2007, had surgery, radiation and chemo and have had normal mammograms ever since.  I had a persistent cough for several months that my GP insisted was allergies.  Well, after 8 months, he finally sent me for an xray and guess what?  Tumors all over my lungs and lymph nodes.  The lung biopsy (if you have had one, isn't it the worst experience ever?) confirmed it was the same cancer that I had five years earlier.  Had lots of chemo and it has worked so far.  The tumors are still there but are soooo much smaller.  (the latest radiology report used words like \"significant\" and \"dramatic improvement\").  Am getting monthly Zolodex shots to put me into menopause and it has been physically(and mentally!) rough.  I am not sure where post-chemo side effects end and menopause symptoms begin. Emotionally, we are doing OK now, though it has not always been so the past few months.  I have someone I love and who loves me.  He takes excellent care of me   We are not married but have been together for many years and have an 11 year old daughter together.  I pray often and try really hard to be thankful for the time I have had, rather than regret the time I don't have in my future.  More than anything, I want to see my daughter grow up and be good friends with her as an adult. Meanwhile I am trying to change what I can, eating better, exercising, being kinder, saying yes more often.  I don't frequently post but I am thankful to have this resource, and for all of you who have been so generous sharing your experiences.",
      "MessageIndex": 38,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798841",
      "Title": "Roll Call 2013 LilSchatzie reader123"
    },
    {
      "AuthorID": "JTilCT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166623/profile",
      "Content": "Nov 4, 2014 05:50PM JTilCT wrote: My eyebrows have not been the same since my first chemo in 2007.  Since then, I have become a huge fan of the Bobbi Brown Natural Brow Shaper.  It comes in a few different shades and if you apply it lightly, it looks like little eyebrow hairs.",
      "MessageIndex": 23,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825429",
      "Title": "Eyebrow Mascara blainejennifer diana50"
    },
    {
      "AuthorID": "JTilCT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166623/profile",
      "Content": "May 22, 2013 08:10AM - edited May 22, 2013 08:12AM by JTilCT Ladies, I am scared and pissed off too.  The ups and downs are so drastic!  I was diagnosed in July '12 with lung mets and the onc. talked in terms of months.  Chemo worked great, shrunk those things down to almost nothing.  Just had a CT scan last week and they have grown.  When things are going well, I feel invincible (big high).  But now that treatment isn't working as well, I want to scream \"WTF!!!!!!!\" (big low). My onc. is big on quality of life, he asked, \"How do you feel?\"  I feel great!  So he does not want to throw chemo at me again- we'll save that in case I start to have issues breathing again (coughing, shortness of breath).  Will try Xeloda see if that works.  I would like to squeeze as many years out of this as I can- I am not ready to go! p.s. I need to update my pic.  My hair looks fabulous and the onc. says I can keep the hair on Xeloda!",
      "MessageIndex": 76,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "JTilCT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166623/profile",
      "Content": "May 21, 2013 01:55PM JTilCT wrote: I'm in too.  I hardly ever post.  When things are going well, I don't even go on the site.  I finished chemo in October and my last CT scan in February showed only 2 tumors .25 cm. each!  Chemo worked awesomely!  Had a scan last week and \"They're baaaaack\" so now I'm back.  Is it wrong to only need you guys when times are bad? Anyway, will probably go on Xeloda so I have been reading here about it.  Thanks to all who have posted such valuable info. Can't figure out how to put it in my signature but I have lung mets.  I also get monthly Zolodex shots but didn't see where to put that in my signature either.  Oh and this scan showed something on an ovary so will have to deal with that as well.",
      "MessageIndex": 371,
      "PostDate": "21/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "JTilCT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166623/profile",
      "Content": "May 22, 2013 08:37AM JTilCT wrote: While I was on Arimidex, and now Femara, I was taking them at night and the hot flashes woke me up like every hour.  Or do they call it night sweats when it happens at night?  My onc. told me to take it in the morning so the hot flashes would happen during the day and I could sleep at night.  It did not work for me but it might be worth a try.  What has worked so far is taking Effexor- now I might only have 1 episode per night and none during the day.  I also take ibuprofen for the joint pain when needed but that has eased over the past 3-4 months.",
      "MessageIndex": 13,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801955",
      "Title": "Femara - best time to take? Mzmerz alma1947a"
    },
    {
      "AuthorID": "JTilCT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166623/profile",
      "Content": "Nov 14, 2014 01:05AM JTilCT wrote: I did a few rounds of CMF recently with no noticeable side effects. I kept my hair and continued to go to work and live my life as usual. Unfortunately my tumors grew so it did not work for me. I am not posting to discourage you, only to say that taking CMF was not a bad experience for me. Also, it is a fairly quick session as cytoxan is a drip, but methotrexate and flouracil are pushed.",
      "MessageIndex": 2,
      "PostDate": "14/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826107",
      "Title": "Has anyone taken CMF... Qimsy_Crumbs1982 Qimsy_Crumbs1982"
    },
    {
      "AuthorID": "JTilCT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166623/profile",
      "Content": "JTilCT wrote: Hi all. I am scheduled to have radiation to a spot on my spine next week. Starting to get a little nervous worrying about side effects. Only information from doctor is that it may hurt more than it does now (before it gets better), and some bowel issues. I don't want to spend Christmas in the bathroom! Anyone have anything to report? Thanks in advance. Dx 2/2007, 1cm, Stage IA, ER+/PR-, HER2- Surgery 3/13/2007 Lumpectomy: Right Chemotherapy 5/10/2007 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Hormonal Therapy 9/1/2007 Dx 7/2012, Stage IV, metastasized to bone/lungs, ER+/PR-, HER2- Chemotherapy 8/10/2012 CEF Hormonal Therapy 11/1/2012 Femara (letrozole) Chemotherapy 6/5/2013 Xeloda (capecitabine) Chemotherapy 10/26/2013 Doxil (doxorubicin) Chemotherapy 7/28/2014 CMF Chemotherapy 10/22/2014 Ixempra (ixabepilone) Chemotherapy 2/3/2015 CEF Hormonal Therapy 7/14/2015 Faslodex (fulvestrant) Targeted Therapy 7/14/2015 Ibrance (palbociclib) Chemotherapy 9/30/2015 Halaven (eribulin) Radiation Therapy 12/22/2015 External: Bone Radiation Therapy Balloon-catheter: Breast Hormonal Therapy Zoladex (goserelin) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/838596",
      "Title": "Stereotactic radiation to spine- anyone with any experience? JTilCT GG27"
    },
    {
      "AuthorID": "JTilCT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166623/profile",
      "Content": "Jan 3, 2013 04:10AM JTilCT wrote: I am fairly new to this board as well.  I have not figured out how to post all my diagnosis/treatment info below but I was diagnosed with Stage IV this past July with mets to the lungs and lymph nodes.  I am only now able to breathe (literally and figuratively!) and start to participate in this forum.  Initially my onc. and I had the months vs. years debate.  I needed something to focus on so I got all my affairs in order and started to travel.  I have survived 6 rounds of chemo and am now on hormone therapy.  A second opinion supported the treatment plan I was already on and that gave me great peace.  That was probably the turning point in my attitude from fear to hope.   Be good to yourself.  Take all help that is offered.  Pray or do whatever will bring you peace.  It will get better.  ",
      "MessageIndex": 23,
      "PostDate": "03/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798264",
      "Title": "Terrified and trying to hold it together ShelMel JTilCT"
    },
    {
      "AuthorID": "JTilCT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166623/profile",
      "Content": "Nov 11, 2014 08:42AM JTilCT wrote: Check out the website for Thru My Eyes. It is a service to parents with a life-threatening medical condition, who have a child/children under 21. They make \"legacy videos\" that you can leave for your family. It took me months to get up the courage but I finally did it yesterday and I am so relieved. A therapist interviews you about your history, your childhood, family, children, etc. and they edit and send you a cd free of charge. They will come to your house if you live in the NY metro area, and they will conduct the interview via Skype if you don't live in the area. Having a reason to do this is horrible but they treat you in such a way that makes you comfortable and very at ease. I didn't even cry while making the video! www.thrumyeyes.org",
      "MessageIndex": 348,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "JTilCT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166623/profile",
      "Content": "Sep 4, 2013 12:39PM JTilCT wrote: That is the worst thing about this.  I feel awful I will leave a little girl (now 11) without a mother.  If it was just me alone in the world, I would (sort of) have peace with it.  I pray it will be a very long time from now.  I look healthy, I mostly breathe OK, and most of the tumors are stable.  I have included her in all age-appropriate conversations since the beginning.  Sometimes she doesn't want to hear it, but if I keep something from her that I tell her later, she gets mad that I didn't tell her.  We pray together often, we are creating memories with my bucket list, and we go to a children's support group.  I think we are making the best of a very bad situation.",
      "MessageIndex": 11,
      "PostDate": "04/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810309",
      "Title": "Please tell me you are OK mom? stagefree Fitztwins"
    },
    {
      "AuthorID": "JTilCT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166623/profile",
      "Content": "Dec 21, 2015 09:26AM JTilCT wrote: Tomorrow is the day, getting a little nervous. Radiation will be to the L4 so it will pass through the intestines. And there will only be one treatment so I hope there won't be too much fatigue. Thanks to all for sharing.",
      "MessageIndex": 6,
      "PostDate": "21/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/838596",
      "Title": "Stereotactic radiation to spine- anyone with any experience? JTilCT GG27"
    },
    {
      "AuthorID": "JTilCT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166623/profile",
      "Content": "Dec 29, 2012 09:47AM JTilCT wrote: I like www.hatsscarvesandmore.com and www.4women.com",
      "MessageIndex": 5,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798103",
      "Title": "Websites for cute hats and scarves? Surly SpecialK"
    },
    {
      "AuthorID": "JTilCT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166623/profile",
      "Content": "Feb 4, 2014 12:25PM JTilCT wrote: Mental health services are tough to find!  Keep trying.  When I was first diagnosed, I found a private therapist for my daughter through my employer's EAP.  I also spoke with her teachers and the school counselor and she also had sessions with the school social worker.  We also do a kid's group through Cancer Care and occasional family groups through them as well.  Not sure if you have a Cancer Care location near you, but the kid's group was a good fit, especially as my daughter was reluctant to talk.  They focus on an art or craft project and do not press the kids to talk.  Parents meet separately to give the kids more freedom to express themselves.  BTW, for graciesmom, not sure where in CT you are but the kids group meets at Norwalk Hospital.",
      "MessageIndex": 25,
      "PostDate": "04/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816403",
      "Title": "New to stage 4 - how do I help child PattyPeppermint graciesmom15"
    }
  ]
}