{
  "AuthorID": "jtslg",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126410/profile",
  "Posts": [
    {
      "AuthorID": "jtslg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126410/profile",
      "Content": "Nov 14, 2011 05:33AM - edited Nov 14, 2011 05:33AM by jtslg thank you Baywatcher.  Hugs to you as well.  You're pain and anger is no less important than mine.  I hope you are able to find peace during your own journey.",
      "MessageIndex": 9,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/777967",
      "Title": "Help-complications force me to join this \"club\" jtslg lollypop59"
    },
    {
      "AuthorID": "jtslg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126410/profile",
      "Content": "jtslg wrote: I had a BMX with NS on 9/14 due to LCIS in both breasts.  10 days later I had emergency surgery for a hematoma.  Four days later another surgery to remove large implants that had gone south (replace with 500 cc).  Three weeks later another emergency surgery to remove/replace right implant that had started rejecting Alloderm.  Two weeks later (Wednesday) surgery #5 to completely remove both implants due to a staph infection on the right side and again rejecting the implant. So here I am today feeling completely lost.  Not only am I implant free and flat as a pancake but all the surgeries have left me with multiple scars that wouldn't normally be there.  It is horrifying.  The thought of taking my shirt off in front of my husband is terrifying.  I just don't understand how I got here.  I had \"precancerous\" cells.  The plan was to have the BMX with immediate reconstruction and move on with my life.  Two months later, I still have fresh stitches, drains and a staph infection that has me concerned.  I look like hell and can only pray that someday I'll be off Percocet. I have no idea where I go from here.  What do I do about a bra?  I feel like I need one if only to hold the drains in place.  Help! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/777967",
      "Title": "Help-complications force me to join this \"club\" jtslg lollypop59"
    },
    {
      "AuthorID": "jtslg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126410/profile",
      "Content": "Nov 18, 2011 07:41AM jtslg wrote: einarsen-sorry to hear you are in the same spot as me.  I feel so sad that you waited three years for reconstruction.  I can understand your devastation. ",
      "MessageIndex": 13,
      "PostDate": "18/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/777967",
      "Title": "Help-complications force me to join this \"club\" jtslg lollypop59"
    },
    {
      "AuthorID": "jtslg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126410/profile",
      "Content": "Nov 13, 2011 07:22AM jtslg wrote: Actually, my journey did not start because of a mammogram (it was normal).  I had a reduction in March and the path reports came back showing the LCIS.  So ironically, exactly one year ago I was fighting with insurance to approve the reduction and now today I sit here with no boobs whatsoever. Shastamom-WOW-it sounds like you know exactly how I am feeling right now.  I do feel like I have gone through two mastectomies-the second being much more painful.  It is encouraging to hear that you did heal and were able to move forward with reconstruction. Mags-love the kitty.  PS did not recommend any mastectomy cami's or anything else for that matter.      1Badbood-I know you are right and I should be thankful that everything was found early etc.  But after 5 surgeries I'm not even close to that place right now.  Before all this took place I was struggling with whether or not I could call myself a survivor since it was only precancerous.  I definitely consider myself a survivor now! Otter-oddly enough I'm not worried about hiding the drains.  I have tied around my neck by a ribbon and the whole world can tell something is hiding under my shirt.   Maybe after 8 weeks I've just come to accept them.",
      "MessageIndex": 7,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/777967",
      "Title": "Help-complications force me to join this \"club\" jtslg lollypop59"
    }
  ]
}