{
  "AuthorID": "Judy67",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
  "Posts": [
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 23, 2012 07:11PM Judy67 wrote: Nancy - Don't know if this will help, but I read on a previous thread of someone who said eating Raisin bran worked for them.  I tried it and it worked for me as well.  I've been eating it pretty regularly now. Sleepless -  The dosage recommended for Zinc L-Carnosine is 8mg Zinc & 29.5mg L-Carnosine.  I bought it off Amazon for $7.99/bottle.   Just ordered Saturday so it's not here yet.  I'll give feedback after next chemo tx.  Let me know if you try it what you think.",
      "MessageIndex": 714,
      "PostDate": "23/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Mar 20, 2012 04:28PM Judy67 wrote: I noticed everyone's SEs are so different.  I am doing TCH and haven't had any problems with nausea and my onc did not give me anything extra to take for nausea other than Lorazepam, which he said helps nausea even though it's an antianxiety.  But I feel like there is some sort of beast high up in my abdomen.  Like a giant knot or hole and the only thing that seems to help it sometimes is to feed it.  I'm pretty sure a lot of this is from the Dexamethasone.  I've gained 10lbs since I started chemo.  I'm developing neuropathy in the bottoms of my feet.  I hope this isn't permanent.  Also, I'm not sure if anyone else is having this and it's a little embarrassing, but I am having rectal bleeding with every bowel movement.  Kind of freaks me out even though onc. says it's probably just hemorhoids.  I plan on bringing it up again in my next appt.  I'd hate to go through all this and then have colon cancer.  I have one more tx (other than Herceptin) and I'm hoping my body can hold out for one last round of poison.  I can't wait until this time next year when we are on the other side of this. Riceandbeans, sorry this is such a late response, but this tx round I drank a lot of the Crystal Light Strawberry Lemonade and was able to drink so much more this time. ",
      "MessageIndex": 1737,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Mar 20, 2012 08:36PM Judy67 wrote: Diane - I've had the bad acid reflux but I've mostly got it controlled with Omerprazole.  That could certainly be part of this beastly knot. Denise - I got a horrible headache that felt sinus related after the first 3 tx's.  My onc. said one of the delivery mechanisms for taxotere was known to sometimes cause sinusitis.  Rachel - I did tell the Onc about the neuropathy.  He said if it is in my fingertips and lasts more than a few days then he will probably not do the last Taxotere tx, mostly because he doesn't want it affecting my job (dental hygienist).  I plan on letting him know how it's going tomorrow.  I think it is barely in my fingertips and a lot in the bottoms of my feet.  I will give him all that info tomorrow when I go in for labs and let him make the call I guess.  My thought is that I only have 1 tx left so maybe I should take my chances and just do it and hope for the best. Thanks Angie, I may try the coconut oil. ",
      "MessageIndex": 1750,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 22, 2012 09:01PM Judy67 wrote: Hey guys, Just checking in.  I'm now 13 days post 2nd tx and I feeling great again.  One bright side to this whole thing is how much I appreciate feeling good.  Now trying to think of things that might help with SE's next time.  At the women's health seminar I went to, the Dr. speaking mentioned that zinc L-carnosine can protect your sense of taste and your mouth tissues from the effects of chemo.  Ordered some from Amazon today as I couldn't find the combination needed in the health stores.  I'll let you guys know if it helps.  My taste is slowly returning again like it did last time but I'm worried at some point it might not return. ",
      "MessageIndex": 700,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 27, 2012 07:10PM Judy67 wrote: Lumpy -  Happy Birthday!  Hope you start to feel more at home in your apartment.",
      "MessageIndex": 805,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 18, 2012 07:33PM Judy67 wrote: Hey guys, hope you don't mind if I join in. 6 tx's of Taxotere/Carboplatin/Herceptin, then Herceptin every 3 weeks for a year and 5 years of Tamoxifen.  Had my 2nd tx a week ago.  So far the trend this tx seems to be the same as the first.  Day 1 - acid indigestion  Day 3,4,5 bone and joint pain   Day 6,7,8 cramping and diarrhea.  Last time I didn't really feel like myself again until day 10.  Can't wait to be through with chemo.  Also, I am not doing rads, had BMX with reconstruction.  Rads wasn't even offered as part of my tx. I kept most of my hair until day 23, then I had too many bald spots to  cover and scalp was so tender I had my husband give me a bur cut.  I look like GI Jane without the rockin hot bod.",
      "MessageIndex": 580,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 1, 2012 01:14PM Judy67 wrote: Hey all, I'm sitting in the chair enjoying my 3rd round of chemo cocktail.  Next to me is a man who has been on chemo for four years with stage IV colon cancer.  He has such a great attitude.  I feel a little bad for whining about my 6 tx's. By the way, I think the Zinc L-Carnosine is helping with my mouth.  I'll let everyone know for sure after this next tx, but it is definitely worth trying.  It is supposed to help protect the lining of your mouth and preserve you sense of taste.  Dosage is 8mg of zinc and 29.5mg of L-Carnosine 2-3x a day. I bought mine from Swanson through Amazon.com for 7.99.",
      "MessageIndex": 921,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 3, 2012 01:55PM Judy67 wrote: Thanks ladies, glad to know I'm not the only one breaking down. grateful - yesterday was my last steroid day and I am hunkering down now.  I take the Claritin like everyone suggests but it has not worked that well for me last two treatments.  Hoping this time is different.  Also, already hitting the Advil.  Good luck, hope you do better this time too. Annie, I have a couple of wigs from TLC (Cancer society) and a couple from Paula Young, also online.  They were not very expensive so I was pleasantly surprised.  Look for Monofilament parts, hand tied, or lace fronts.  These fit and look more natural on top.  Also, Paula Young has some human hair blend wigs that you can actually blow dry on a moderate setting.",
      "MessageIndex": 968,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 21, 2012 12:14PM Judy67 wrote: Hi all, I'm just catching up on posts.  Kite -  I had the stool softeners too.  I may try not doing that next time and see if the diarrhea and cramping is better. Momof2 - I feel like that about my next treatment.  It's hard when you are feeling good again and you know that you are not going to feel good after tx.  It does help that I know more what to expect.  Hope your next tx is easier.  ((hugs)) I am becoming a wig expert.  I did not go and get fitted, although I probably should have, because the shop close to me charges $300 for a good wig.  Instead I've ordered mine from the Cancer society TLC site and from Paula Young.  I've spent $300 already, but I have 3 instead of just one.  If anyone out there is purchasing one soon, look for the hand-tied front.  This gives you a more natural looking part and fits closer to your head.  Also, Paula Young has some reasonable Human Hair blends.  I just got one that I love but the color does not quite look the same as it did on my computer so I am blonder than I meant to be.  You can blow dry these with moderate heat and supposedly curl them (haven't tried that).",
      "MessageIndex": 654,
      "PostDate": "21/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 21, 2012 06:08PM Judy67 wrote: I take Claritin and stil get the bone and joint pain.  Feels like I have the flu for about 3 days. Janetanned, sorry about your dog.  I lost my Jack Russell earlier this year, he had a stroke I think.  He died peacefully on the way to the vet while my daughter was holding him.  We still miss him, he was such a character.  They are family.",
      "MessageIndex": 666,
      "PostDate": "21/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 6, 2012 09:42PM Judy67 wrote: Hey all, Just climbing out from treatment #3.  I know this doesn't sound very positive of me, but I am tired of everyone around me here telling me, \"Yay, at least you are half-way done.\"  I have been very positive and smiling to them, but inside I am thinking, \"Hell, I have to go through this three more times.\"  A very glass half empty attitude I know, but I cannot help it.  On the bright side, I know I will feel a little better each day now and will hopefully feel relatively normal by this weekend.  Good luck and hugs to all those with upcoming treatments this week.  We will get there.",
      "MessageIndex": 1031,
      "PostDate": "06/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 10, 2012 09:33PM Judy67 wrote: Kellog, that is great news!  Thanks for sharing your dx with us.   You are an inspiration with your fighting spirit. Annie, the port thing creeped me out at first, but now I am so glad I have it.  Makes everything, even labs, so much easier and I don't even notice it anymore. Waitress, I like the biotene mouthwash too, also there is a book they gave me at the cancer center called \"Eating Well Through Cancer\".  It says to mix 1 tsp salt, 1 tsp baking powder and 1 quart of tap water.  Rinse after each meal or at least 4 x day.  You're supposed to make a new batch each day and it is supposed to help cut down on mouth ulcers and soreness. ",
      "MessageIndex": 1110,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 7, 2012 05:53PM Judy67 wrote: Sleepless - the Zinc L-carnosine seems to have helped my mouth.  Very little taste loss this time and water doesn't have that weird metallic taste which makes it easier to stay hydrated. Nancy - I started taking Prilosec (generic)  the same day I started the steroids. This has kept it under control so far for tx #3. Onc told me just to take it entire time, but I don't like taking it if I don't have to so I will probably see if I can taper off 7-8 days after tx.  A friend recently gave me the most comfortable headwear yet.  You can get them in all different colors on Planetbuff.com.  It's a simple tube of material with no seams, you pull it on your head and tuck it under in the back.  I plan on buying another. http://www.planetbuff.com/pages/Original-Buff-Features-Benefits-and-Uses",
      "MessageIndex": 1048,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 9, 2012 05:12AM Judy67 wrote: My experience with weight is just like Joyce's and it does suck.  As far as the cumalative effects of chemo though, so far my SE's have been almost identical for each treatment and by day 8-9 I feel pretty normal again.  This last tx, the leg pain from the Neulasta was not as bad.  I started taking Claritin 2 days before tx and continued for a week.  Maybe that's what helped, who knows. ",
      "MessageIndex": 1071,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 14, 2012 08:52PM Judy67 wrote: Hey guys, trying to catch up on posts after being off for a few days.  I've notice most are on ac, I'm on TCH like Kellogs.  I am a week away from tx # 4 and enjoying this week of feeling fairly normal before the SE's start again.  I have been very fortunate in not having problems with nausea and don't have to take any meds after tx but the day after Neulasta shot (day2), the back of my neck and base of my skull get swollen and so sore.  Also, day 4 I get a terrible headache that Advil doesn't completely kill.  I have also noticed smells bother me more like garlic and popcorn. ",
      "MessageIndex": 1204,
      "PostDate": "14/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 24, 2012 09:54PM Judy67 wrote: Jenn - you are beautiful bald.  Thanks for sharing your pictures.",
      "MessageIndex": 735,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 28, 2012 07:53AM Judy67 wrote: janetanned - one of the weirdest things about all of these SE's is how all over the board we are.  Some of us have more problems in one area and no problems in another. Even taking Claritin I have a lot of achiness with the Neulasta shot.  The second day after each of the 2 shots I've had so far, I wake up with swelling and achiness in my neck and shoulders.  Also have a pulsing aches and pains throughout my legs and joints.  Chances are your back pain is also from the Neulasta.  Hope it's gone now.  Judy",
      "MessageIndex": 813,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 3, 2012 06:05AM Judy67 wrote: So far, not too bad two days post tx.  If it's anything like the last two tx's the achey, fluish effects of the Neulasta shot will probably hit later today.  Had slight nausea occasionally yesterday, but not too bad.  I thought I was doing pretty well handling everything emotionally, but Monday night had a total meltdown over financial issues related to credit card bills from medical costs and lack of income at the end of last year do to being off after surgery. Husband and I were sitting down to budget and even though he was not trying to make me feel guilty, I just felt bad about all of it and could not stop crying.  I realized later it was just a long overdo outlet of stress and the right issue came along to set it off.  I'm still a little embarrassed though.  Has anyone else done this?",
      "MessageIndex": 958,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 3, 2012 10:07PM Judy67 wrote: Hey sisters!  Joan, I really like your New Year's wishes.  Granny, I am so sorry about your friend, I will include her in my prayers.  I hope she recovers. I'm day 14 from 1st tx and now on \"hair watch\".   I got a great short haircut last week that I really like so I'm trying to will it to stay in. Happy New Year to everyone!",
      "MessageIndex": 10867,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 10, 2012 09:50PM Judy67 wrote: Germanfrench, what a terrible husband.  So sorry you have had to go through all that.  Hope things turn around for you soon.  We are here for moral support.",
      "MessageIndex": 10979,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 14, 2012 08:27PM Judy67 wrote: Mimi, I'll check it out when it comes back on, thanks!  They've been having disaster shows on the scifi channel today.  I've already seen them, but a new one comes on tonight. I was getting so many bald spots and my head was so tender, I went ahead and let DH shave my head.  I thought I would be sad, but it was a relief instead.  I've been wearing a soft, warm hat around today.  I'm just hanging out today because I'm having a lot of aches and pains, I guess from the Neulasta shot.  Sherry, sounds like you have an extremely supportive doctor.  Glad you had good visits and I hope you are able to get rid of the neck pain.  Yay for marking one doctor off the list.",
      "MessageIndex": 11022,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 20, 2012 03:25PM Judy67 wrote: Mooserella --  Very well said!  Sorry you have joined the club, but glad you have joined our thread.",
      "MessageIndex": 11099,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 23, 2012 09:50PM Judy67 wrote: Granny, hope you had a great trip.",
      "MessageIndex": 11123,
      "PostDate": "23/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 27, 2012 11:47PM Judy67 wrote: Joan & Kaara - Yay for good reports. Isa - ditto with the others on the diet changes and wow it is expensive to eat that way.  Buying hormone free milk for DD and it's more than twice the cost as regular milk.  But it there's a chance it will make a difference, it's worth it.  I think you might be making a good decision on the 4 chemo tx's as young as you are.  I'm 44 and had an onco score of 39.  I was totally bummed because that meant def. chemo for me, but it also took the decision out of my hands.  I'm not sure what I would have done if I'd been borderline.  Good luck with whatever you decide. Layla - that's awful that you have to work with such toxic clients.  I know it is hard to stay positive and I know everyone is different, but I don't mind my foobs and they are slowly looking better and better.  You will feel normal again and you will come through this and be a stronger person than you ever knew you could be.  We are all here for you.  (((hugs)))   Judy",
      "MessageIndex": 11210,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 7, 2012 08:35PM Judy67 wrote: Mimi - hope you find a job you like soon!",
      "MessageIndex": 11345,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 11, 2012 04:21PM Judy67 wrote: jo, isn't it crazy how Texas can be all different climates depending on what part of Texas you are in.  It was 29 degrees here this morning. Brrrr... after all those 60, 70, & 80 days we are seeing a bit of winter. ",
      "MessageIndex": 11414,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 15, 2012 12:01AM Judy67 wrote: Hello Sisters, checking in. Susan, congrats on the low score, that is awesome. Jo, sorry you are in pain but glad the cortisone is beginning to help.",
      "MessageIndex": 11477,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 15, 2011 07:10PM Judy67 wrote:",
      "MessageIndex": 10595,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 16, 2011 09:10PM - edited Dec 16, 2011 09:10PM by Judy67",
      "MessageIndex": 10636,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 16, 2011 09:31PM Judy67 wrote:",
      "MessageIndex": 10638,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 14, 2011 02:11PM Judy67 wrote: Jerry & Shannon - I'm sorry about the news about Shannon's lymph node but it sounds like with just one, that the Sentinel Lymph node was doing its job in stopping it from continuing on down the chain.  There is a site called Penguin's Cold Caps that you can Google.  It's a process that can help you keep your hair during chemo.  I'm not sure I can go that way as it requires keeping your head really cold for several hours and I hate to be cold, but several women have done it fairly successfully and there is a discussion topic where they talk about their experiences on this website.  I bet though that Shannon's hair will grow back to be just as beautiful, maybe even more.",
      "MessageIndex": 840,
      "PostDate": "14/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Sep 28, 2011 05:40PM Judy67 wrote: Trinity927 - I've been wondering about chemo before surgery too.  My surgeon scheduled my surgery first and I haven't been to the oncologist yet.  My understanding was to remove the cancer first and send it all off to pathology before taking the next step.  I'm triple positive with Ki53 so I've been anxious to get this surgery done and get the cancer out of there ASAP. Clams - I'm so glad your wife is doing well.  What a relief it must be to have that part over with at least.  Hope she heals quickly and everything else goes smoothly. Thanks for all the packing suggestions.  I must be partially in denial because I haven't even started packing yet.  I did order several pajama/lounge pants to wear while I'm recuperating.  My DH wants to get a small recliner for our bedroom besides the one we already have downstairs.  I'm not sure it's necessary.  Are most women able to sleep in their own beds propped up on pillows?  That was my plan. ",
      "MessageIndex": 278,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Sep 30, 2011 07:09AM Judy67 wrote: Hey guys,  Hope everyone doing okay tonight.  I should change my name to denial because It still hasn't sunk in yet that I'm days away from major surgery.  Hope I don't have a last minute melt-down. Dukes-up,  I had to tell my son while he's at college and I think it helped that I was very matter of fact with him (no crying).  Told him my game plan, surgery, etc.. Explained that I'm in no immediate danger from breast cancer, that my main goal was to do everything in my power to keep it from returning.  He hit the internet himself after that and except for reading all the \"wonderful\" things that go along with Chemo, I think it helped him process it all. Clams - I hope your wife has a much better day tomorrow and I hope you get some good sleep in her room tonight.  We're on the countdown to October, can't believe there are five of us on the 4th.  I'll be thinking about each and everyone of you this month.",
      "MessageIndex": 315,
      "PostDate": "30/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 2, 2011 09:55AM Judy67 wrote: Best wishes back at you Survivor, I'll be thinking of you October 3rd girls all day tomorrw.  Okay, the panic is setting in now, appetite gone again.  Meant to spend today cleaning and organizing but have had visitors all day.  Sweet of everyone to stop by though.  I cannot believe surgery is less than 48 hours away.  Still seems surreal.  If I don't get back on here for several days, know that I'm thinking about all of you and I'll let everyone know how it went as soon as I get back home again. Love and prayers, Judy",
      "MessageIndex": 386,
      "PostDate": "02/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 10, 2011 08:31PM Judy67 wrote: About the Drains -  I know every PS does things differently.  I have two drains, one on each side.  I was able to shower the day after my surgery.  Used Lanyards to hold the drains while showering at PS's advice - works great.  I was hoping to have mine out today but he said definitely Thursday.  He said it's usually 10 days.  The camisole with pockets works great.  I have two, one that zips up the front and one that I just step into and pull up.  I got them from two different nurse navigators.  Where I live, there is a hospital that services all of Tarrant county no matter which healthcare providers you use and the nurse navigator was the best one yet in explaining everything from the cancer to the drains.  She is also a stage III long time survivor herself and sends out weekly emails to everyone on her list.  I also had a nurse navigator at the hospital that I actually used.  Most hospitals have them now so call your facility and see if you can make an appointment.  They have a lot of resources to help. ",
      "MessageIndex": 712,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 10, 2011 08:33PM Judy67 wrote: Ginger - thanks for the info about the expanders, please come back and post after your exchange.  I want to know how that is and if they feel comfortable.",
      "MessageIndex": 714,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 11, 2011 04:57AM Judy67 wrote: GrandmaV & matahead7 -  Good luck tomorrow.  I'll be thinking about you.  Hope you're able to get good rest tonight.",
      "MessageIndex": 736,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 12, 2011 04:05PM Judy67 wrote: Denise - drains aren't so bad, they're just kind of a nuisance.  I'm a side sleeper and those make it less comfortable when I try to lay on my side.  Also, now that I'm flat chested my belly already looks bigger and the drains just add mass.  I only have two drains and the camisole with pockets holds them really well.  We've been out to the store, dinner, etc... even with the drains.  I'm just wearing big, baggy shirts.  I didn't really get impatient with them until these last 3 days, getting mine out tomorrow.  Yay!! Emptying them hasn't really been any big deal, it's not that gross.  Looks kind of like red lemonade.  DH did it for me in the beginning and was meticulous in keeping measurements and a running 24 hour tally.  He's still keeping the record but I'm emptying them myself now. Plan on asking ob/gyn about removing last ovary after/if I have chemo.  If pathology today shows cancer was definitely not in my lymph nodes and there were no other surprises, then I'm going to ask Oncotype DX be done to get an Onco score before deciding on chemo.",
      "MessageIndex": 782,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 12, 2011 04:13PM Judy67 wrote: Ugh, just got a call from BS office and she was called into emergency surgery today and can't see me until Monday.  They won't release pathology report to me without her signature.  So frustrating after waiting all week for this appt.  Not to mention all the calls I'm going to get from family who knew I would get results today.",
      "MessageIndex": 783,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 12, 2011 08:58PM Judy67 wrote: That is a good idea Mr. Clams.  I do have a caringbridge site but have a few non-computer friends and family members.  Fortunately the nurse called me back and gave me a very quick synopsis of my report.  Good news I think, no lymph node involvement and the cancer site had clear margins so they think they got it all.  With that much info at least, I can wait more easily until Monday for anything else.",
      "MessageIndex": 789,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Nov 17, 2011 05:56AM Judy67 wrote: Hey everyone, I haven't posted in a while but happy to see everyone recovering.  Because of a small delay with chemo decision I will actually be having my exchange surgery with my port placement Dec. 2nd.  I was wondering for those of you who had your exchange surgeries this month, how was the recovery?  Also, are they a lot softer than these expanders because I would love to sleep on my side again someday?  I have planned a week off work and I'm hoping that is long enough since I don't have any more vacation time left.",
      "MessageIndex": 1351,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Nov 25, 2011 11:35PM Judy67 wrote: Hey everyone!  Hope you all had a great Thanksgiving.  Ours was great and I got to visit with my Sister-in-law who is about to reach her 5 year mark after BC diagnosis and she's doing great.  I had Thanksgiving at our house since I won't be up for Christmas; 1st chemo tx Dec. 21st.  I am feeling so good and my foobs are looking pretty good too so I am really dreading chemo and all its \"wonderful\" SE's.  I still usually end up in the recliner every night because I get shoulder blade cramps.  Anyone else have a problem with that?  Athabanscan- Yay!! So glad the lump was negative. I think the worse part about BC diagnosis is wondering if every lump and pain is the cancer showing up again. I'm off to delegate Christmas decorating to my DH and kids.  Hope everyone has a wonderful weekend.",
      "MessageIndex": 1416,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Nov 18, 2011 05:32AM Judy67 wrote: Hi!  I'm from the October surgery group, but now having surgery again soon.  Having TE's exchanged and a port placed Dec. 2nd.  Will start chemo about 3 weeks after that.  Just in time for Christmas- oh boy!",
      "MessageIndex": 23,
      "PostDate": "18/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 7, 2011 04:30AM Judy67 wrote:",
      "MessageIndex": 240,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 8, 2011 03:19AM Judy67 wrote: Wow, I think I counted 10 surgeries tomorrow.  Good luck ladies.  Hope you have easy surgeries and quick recoveries.",
      "MessageIndex": 257,
      "PostDate": "08/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 3, 2011 06:33PM Judy67 wrote: p.s.   It was a Scopolamine patch. ",
      "MessageIndex": 150,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 12, 2011 05:12PM Judy67 wrote:",
      "MessageIndex": 359,
      "PostDate": "12/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 12, 2011 09:57PM Judy67 wrote: Good Luck Kelly!!  Hope you have a smooth surgery and quick healing.",
      "MessageIndex": 364,
      "PostDate": "12/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 21, 2011 04:59AM Judy67 wrote: Hey Cookiemonster,  hope you're feeling well and healing quickly and I hope you get those drains out before Christmas.  Hugs! Judy",
      "MessageIndex": 545,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 16, 2011 09:28PM Judy67 wrote: Tried to get my idea of eye candy to post here but couldn't get it to copy.  Anyway, if I could have a fantasy \"me\" day and do anything I wanted and money wasn't a factor - I would go see Hugh Jackman on Broadway and Rockefeller Center at Christmas time.",
      "MessageIndex": 10637,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 27, 2011 12:03PM Judy67 wrote: K - Thanks, I've been taking the natural Ginger and that does seem to help some.  I will try the peppermint.  Ironically I'm drinking Peppermint tea as I write this.   Thanks for the hugs, Judy",
      "MessageIndex": 10766,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 10, 2012 12:56AM Judy67 wrote: Joan - What a great idea about the candle. Hope everyone doing okay.  Have I mentioned that I don't like the cold.  That's why I'm always so attracted to Sheila's vacation pictures.  The places all look so warm and inviting.  It's cold and raining here today.  We need the rain, I'm not complaining about that, but I don't need the cold. Hugs out to everyone!",
      "MessageIndex": 10946,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 10, 2012 10:51PM Judy67 wrote: So sorry about Zoh, that is so sad.",
      "MessageIndex": 10984,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 23, 2012 12:06AM Judy67 wrote: That's pretty cool that you can see your records online.  If that is available to me, no one has ever mentioned it.  I try to get copies of everything for my own records though.",
      "MessageIndex": 11119,
      "PostDate": "23/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 21, 2012 10:36PM Judy67 wrote: Good evening sisters.  It was a beautiful day here today and I had planned on finally getting back into exercising.  Where is my willpower, my drive?  Went out to eat DH and DS instead and then parked myself in front of the TV.  I think I've gained about 7 pounds since starting chemo.",
      "MessageIndex": 11547,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Mar 17, 2012 01:03AM Judy67 wrote: Sorry I've been off the grid this last week. Just catcing up. Hawk, congrats on being done with Rads! I started walking this week 1-3 miles everyday. I have officially gained 10lbs since starting chemo! Ugh!! Truebff, so glad you made it through the storms okay. They were showing some footage on the news today. That was wild. Welcome to all the new people, sorry you were diagnosed but glad you found this site.",
      "MessageIndex": 12062,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Apr 13, 2012 12:35AM Judy67 wrote: Hey Divina,  I am her2+ also and just recently finished up with chemo.  Sorry you've been diagnosed, but this is a great place to come for support and advice.",
      "MessageIndex": 12353,
      "PostDate": "13/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 18, 2011 02:17PM Judy67 wrote: Sheila,  thanks for the picture, looks beautiful.  Today in Sunday School we talked about the journey to Bethlehem and how the Bible is filled with journeys no one wanted to take.  That's the journey we are all on now, but my journey is made easier by sharing it with you guys.  I wish there was something I could do or say to make the journey easier for us all.  I hope you all find some joy this Christmas. I'm finding it in time spent with my DH and kids, I love them so much.",
      "MessageIndex": 10654,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 26, 2011 09:34PM Judy67 wrote: Corgi - congrats on the low score. Sheila - I'm having Herceptin every 3 weeks for a year. I did okay after my first tx.  Some aches and pains all over.  The worst part was acid indigestion like I have never had before.  Now I'm coming down with a cold.  But Christmas Day I felt pretty good and really enjoyed the time with my family.  Hope you all had a Great Christmas too. Granny - hope your friend is doing better.",
      "MessageIndex": 10764,
      "PostDate": "26/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 10, 2012 09:41PM Judy67 wrote: Hey Sherry, worried that we haven't heard from you.  Hope results were good.  Let us know soon.  Also, I live in Mansfield just southwest of Ft.Worth.  Drive through Austin several times a year when I visit my grandfather in San Antonio.  Love all the outlet malls and restaurants and especially the kolaches in West.  Hate the traffic on 35.",
      "MessageIndex": 10978,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 25, 2012 01:04AM Judy67 wrote: AnnetteK - so sorry you are having to go through with this but you sound very strong and I know you will come out the other side better for it.  Sounds like he is an obstacle to bigger and better things for you.  Somewhere out there is a better man that will actually be a supportive partner and not a burden; you just have to get through this first.  We are all here for you. Hugs, Judy",
      "MessageIndex": 11156,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 1, 2012 03:45PM Judy67 wrote: Missed a day, wow you guys were busy.  Happy bday Barb and Barbara.  I'm sitting here enjoying my third chemo cocktail with about 30 min. left.  Hope everyone is doing well this week. (I'm fine too!)",
      "MessageIndex": 11285,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 11, 2012 12:54AM Judy67 wrote: Wished I could go to NY to be with you guys.  I went last May with DH choir trip.  Loved it!!!   I can see you guys calling out at GSC doing the BC flash mob. ",
      "MessageIndex": 11400,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 11, 2012 12:58AM Judy67 wrote: Layla,  I hate chemo, but I do love my new boobs.  I went the other way, down in size and I love not wearing a bra if I don't want to.  BC sucks but there are some bright sides like finding such brave, funny souls on these threads that know where you are coming from and don't judge your decisions.  I'm still in treatment too and it will be a long year, but we will come out better and stronger on the other side.",
      "MessageIndex": 11401,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Mar 2, 2012 08:32PM Judy67 wrote: munnybunni, sorry, read your posts too late to help you with any questions.  How did your appt. go?  Sheila, hope your visit with your SIL went well.  Know it must have been hard.",
      "MessageIndex": 11752,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Mar 20, 2012 10:47PM Judy67 wrote: I'm so sorry Sheila. ",
      "MessageIndex": 12098,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Apr 16, 2012 11:11PM Judy67 wrote: Prayers for quick healing Carol and lots of hugs.",
      "MessageIndex": 12374,
      "PostDate": "16/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 19, 2011 08:30PM Judy67 wrote: Welcome Sunny-one and Hawk, Sherry - hope you had a good time at the Christmas Party after all. Jo - Congratulations on the good checkup.  I know it must feel great to get a good report and not have to go back for 6 months.  I'm wondering if I will have Dr. appt. withdrawals when I don't have at least one to see every week.",
      "MessageIndex": 10673,
      "PostDate": "19/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 21, 2011 07:36PM Judy67 wrote: Thanks guys for all the support!  I had no problems with my first tx so far.  I'm more nervous now than before waiting for SE's, not knowing when or if they will hit.  In the meantime I'm going to make the most of this steroid energy injection to finish up my Christmas stuff.  Hugs to all!!",
      "MessageIndex": 10707,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 30, 2011 11:02PM Judy67 wrote: Haven't been on in a couple of days while I was dealing with SE's of 1st tx.  So sorry to hear of another life lost to this awful disease.  Sometimes it is hard to stay positive with all the sad stories around us.  I keep trying to remember how blessed I am.  I wish with all my heart that we had a cure for cancer, all cancers.  We've come so far, sometimes it seems that a cure should be just around the corner.  For all my BC sisters and brothers and their families, I wish you all a very happy New Year filled with love and many positive things. ",
      "MessageIndex": 10803,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 10, 2012 11:44PM Judy67 wrote:  Watching this movie with my DS.  Spending some time before he goes back to college.",
      "MessageIndex": 10986,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 10, 2012 11:59PM Judy67 wrote: That's so funny Sheila, I was just answering you on the other thread about Hawaii!",
      "MessageIndex": 10991,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 11, 2012 10:57AM Judy67 wrote: Sherry - Yay for no mets!  Was worried you'd gotten bad news when you didn't repost last night.   Hope you are able to get that neck pain managed though. ",
      "MessageIndex": 10993,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 16, 2012 12:18PM Judy67 wrote: Jo, where is your boat going? ",
      "MessageIndex": 11053,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 7, 2012 12:15AM Judy67 wrote: Welcome Stemanita - You have to decide what you will feel best about in the long run.  It's all a guessing game for all of us.  Either way, you'll find support here. Thanks for the group hug Sheila & Jo.  I'm just crawling out from treatment #3 and gaining back some of my sunny disposition.  Three more to go, and then I hope I never have to do chemo again.  Hugs back to all of you who make this so much easier. ",
      "MessageIndex": 11335,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Mar 1, 2012 12:27AM Judy67 wrote:",
      "MessageIndex": 11720,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Apr 9, 2012 10:44PM Judy67 wrote: Hey Sisters!  Sorry I've been off the grid for awhile.  I just finished my last chemo, Yay!!  Hope you all had a wonderful Easter.",
      "MessageIndex": 12325,
      "PostDate": "09/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Apr 11, 2012 07:49AM Judy67 wrote: Thanks for all the great wishes.  Sheila, I am doing Herceptin for the rest of the year.  Congratulations on 7 years!  That's great!",
      "MessageIndex": 12341,
      "PostDate": "11/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 10, 2011 08:17AM Judy67 wrote: Kelleyod and Slgarcia05 - hopefully you are both asleep right now getting good rest.  I'll be thinking about you tomorrow and I hope everything goes well.  Before you know it, you'll be back home again.",
      "MessageIndex": 679,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 12, 2011 02:39AM Judy67 wrote: Maria_Malta and ah2bthin -  Good luck tomorrow, hope everything goes smoothly and  I hope you're able to get a good night's sleep. iLUV2knit - I laughed out loud reading your post about slapping hormone patches all over you. Survivor11 - I bet you were relieved that you went ahead and did the ovary removal.  I still have one and am wondering if I should go ahead and have it out.  That's one of the worst things about breast cancer, it makes me feel vulnerable everywhere else.  Every time I get a pain anywhere I get a slight panicked feeling. Have appt. with BS tomorrow and should get full pathology report.  A little nervous even though initial SNB showed no cancer cells.  They only did the biopsy on one and they took two.  Hoping the other one was negative also.  Otherwise I am a week post-op and feeling great other than these awful drains.  Drains coming out Thursday, can't wait.  Able to look in the mirror with a sort of clinical detachment.  Jokingly call them my Frankenboobs. (seriously, that is what they look like) Mr. Garcia and Clams - thanks for the update on your wives.  Hope they both heal quickly and I hope Mrs. Garcia's node biopsy comes back clear.",
      "MessageIndex": 763,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 13, 2011 09:40PM - edited Nov 1, 2011 05:51PM by Judy67 Drains out today!!  Also got my first post-op fill - 100cc's, I thought I was tight before, yowza!!  My first fill while I was under was 300cc's.  Now I only have 3 - 50cc fills left to do.  Also learned why it is so important to not be doing so much with my arms. Apparently, now that drains are out, if I do too much it can cause fluid buildup and prevent the alloderm graft he did under the skin and above muscle from adhering to the skin like it is supposed to.  That scared me enough to make me slow down. Mr. Garcia, so glad Shannon is doing better today and you're right you are more comfortable at home. Grandma V - glad you're back home already and I hope the antibiotics take care of everything.  Here's to a speedy recovery. Texasrose - good luck tomorrow, hope everything goes well!",
      "MessageIndex": 820,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 15, 2011 04:49AM Judy67 wrote: Hey Cyndi, I'm where you are waiting on pathology.  My appt is Monday and I have no idea yet whether or not I'll need chemo.  Good luck at your appt. Judy",
      "MessageIndex": 875,
      "PostDate": "15/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 19, 2011 04:21AM Judy67 wrote:",
      "MessageIndex": 952,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 19, 2011 03:04PM Judy67 wrote: Okay, getting a little worried.  Everything has been going so well but Saturday felt bad all day with low grade fever.  Sunday night developed redness right side and I just had drains out and first fill Thursday.  Saw BS Monday and she put me on antibiotics and told me to call PS if it got worse.  Not exactly worse, but not better.  I feel fine now and not anymore pain in that side than the other.  Scared PS will want to take TE out and start all over.  Do they take them out or do they give them time to clear up.  Anyone know?  Waiting on call from PS.",
      "MessageIndex": 958,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 25, 2011 04:45AM Judy67 wrote: Trinity, I am so sorry to hear about your Lymphedema and will definitely research it more myself.  My doctors didn't talk about it either.  I did have one of the nurse advocates talk to me about it and what to avoid for the next couple of years but I have not taken it as seriously as I should have.  Thank you so much for sharing your experiences.  I wish it had not happened to you.  Sending you healing hugs,  Judy",
      "MessageIndex": 1084,
      "PostDate": "25/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Nov 8, 2011 05:29AM Judy67 wrote: Kim - so sorry to hear about your pathologist recommendations.  I've been told I probably won't need chemo also and I would find it really hard now to reverse and go back the other way.  My oncologist recommended the Oncotype DX test to help make the final determination and I'll find out my score this Wednesday.  I tend to agree with getting the chemo just in case, but I think we each can only make the best decisions we can for ourselves and we shouldn't second guess ourselves.  Whatever you decide I hope it all goes well. Kellyod- so sorry about the fire.  I've had the on and off again pink coloring too but it's been there for about a month now so PS sure it's not infection.  He said he thinks might be reaction to alloderm but not sure.  I had a bmx and not an mx but I find sports bras the best so far.  The stretchy ones you pull over your head.  gamergirl - I am so sorry to hear about your setbacks and I hope it all turns around for you soon.  Thanks again for starting this thread.  It has been a lifeline. Started back to work today.  It was good to get back to some sort of normalcy.  I really missed it. Hope everyone is doing well with recovery. Judy",
      "MessageIndex": 1289,
      "PostDate": "08/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Sep 23, 2011 06:21AM Judy67 wrote: Hi, This is my first posting, although I've been reading posts since I was diagnosed Sept. 6th.  It has been extremely helpful reading everyone's experiences with all the things I'm about to go through.  My surgery is scheduled for October 4th (BMX w/ reconstruction) and as nervous as I am, the waiting is the most awful part.  Until I have my surgery I have no idea how much the cancer has spread or if it's in my lymph nodes.  I was happy to find this site with others who are also about to go through surgery.  I'll be thinking of my fellow breast cancer sisters this month as we all travel on this same journey.",
      "MessageIndex": 129,
      "PostDate": "23/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 1, 2011 07:09AM Judy67 wrote: Hello October people,  Can you believe it's tomorrow.  I'm still in denial, haven't started packing yet. Trying to finish painting my bathroom.  I started the project when I needed to take my mind off my diagnosis that first weekend.  Removed wallpaper, primed and now doing venetian plaster.  I had no idea how time consuming that really was.  Hope to finish sometime tomorrow then maybe I'll pack. Survivor11 and Trinity I'll be thinking about you on Monday.  You guys are the first. Clams, hope you get some good sleep tonight.  How long will Mrs. Clams have to stay in the hospital? Getting harder to sleep again as the date gets closer.  If I let myself think about it too much I get a panic attack.  That's why I'm up posting at midnight.  My son is doing the Susan G. Komen in Lubbock tomorrow.  I'm so proud of him, he raised over $800 in a week's time.",
      "MessageIndex": 335,
      "PostDate": "01/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 3, 2011 01:05AM Judy67 wrote: Trinity, Survivor, Rocky, Thinking about you guys this morning.  The first surgeries make it that much more real that I'm going to be in your place tomorrow morning.  I'll be saying prayers for you all day.  Hope all goes well.  Blessings and quick healing to you all.  Thanks to all the wonderful people on this site who have offered so much support & advice.  It helps so much to know we're not alone in this fight.",
      "MessageIndex": 401,
      "PostDate": "03/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 14, 2011 11:49PM Judy67 wrote: Hello, I'm a fellow stage oner.  I've had bmx and reconstruction.  Orig. not slated for chemo but oncotype dx score too high so now starting chemo next week.",
      "MessageIndex": 10572,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 15, 2011 11:16PM Judy67 wrote: Thanks to all for the welcome and the hugs!! Sheila, I had an EKG.  Should they have doned a MUGA?  I believe I will have EKG's regularly throughout Herceptin tx.",
      "MessageIndex": 10603,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 20, 2011 10:34PM Judy67 wrote: Jo - I really expect to dance a jig as soon as I'm done, or at least as soon as my energy level returns enough to dance a gig.  One of my husbands customers sent him an expensive red wine for Christmas and we are saving for an after chemo celebration. Valjean - Yay for not having another doctors appt till April.  I start chemo tomorrow  so not sure if I'll make it on here tomorrow night or not.  Sweet dreams to you all.",
      "MessageIndex": 10696,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 20, 2011 10:44PM Judy67 wrote: Cleaning the lint out of my pocket right now.  Thanks for the support, I'll keep you guys all wrapped up and toasty warm in the fuzzy blanket I'm taking with me",
      "MessageIndex": 10698,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 23, 2011 10:43PM Judy67 wrote: Hey Renee, glad you are feeling better and that your friend made it through her surgery okay. Sheilia, I'm doing Taxotere, Carboplatin, & Herceptin. I'm day 2 after my 1st tx.  So far doing pretty good.  Some aches and pains today and some acid indigestion, but nothing too bad yet.  Hoping to make it through the next two days with our family Christmases and then let myself crash for a couple of days.  Thanks so much for all the support.  It really does help.  Hope everyone else is doing well and hope you all have a Great Christmas. ",
      "MessageIndex": 10729,
      "PostDate": "23/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 10, 2012 10:50PM Judy67 wrote: Doing really good Sheila, thanks!  Having 2nd chemo tomorrow and although I'm not looking forward to SE's, I'm happy to have one more down.  How about you?",
      "MessageIndex": 10983,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 10, 2012 11:45PM Judy67 wrote: I love movies where things blow up and the earth is in mortal peril.",
      "MessageIndex": 10987,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 10, 2012 11:59PM Judy67 wrote: Loved 24!  I also love it when the Scifi network has disaster movies on all weekend.",
      "MessageIndex": 10990,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 15, 2012 07:32PM Judy67 wrote: I want to do the Alaskan Cruise also.  It's next on my list of big trips.  I also get seasick, but usually Bonine works pretty well.  May check out the patch next time, that worked great for my surgery. Usually get sick with anesthesia too but didn't this last time when they gave me a Scopolamine patch.  I'm like you though Sherry, I'll have to get these medical bills paid off before we can afford any vacations.",
      "MessageIndex": 11045,
      "PostDate": "15/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Jan 20, 2012 09:56PM Judy67 wrote: isa - so sorry.  Cancer sucks and so does chemo.       I've done 2 out of 6 treatments.  I had a high oncotype dx score so chemo was recommended and I want to do everything I can to keep it from coming back.  Everyone is different with their side effects, some have almost none and some people really feel awful.  I don't feel good for the week after, but it's doable.  So far I've had a couple of days of aches and pains from the Neulasta shot they give you the day after your chemo tx to build the white cells back up followed by a couple of days of stomach issues.  No nausea or vomiting, they have a lot of great meds that prevent/control that now. You will find a lot of good info on these threads and you might want to check out the Jan 2012 chemo thread.  I did a BMX and did not have to have rads. Welcome to the club none of us wanted to join filled with some of the strongest  women you will find anywere.     (((HUGS)))  Judy",
      "MessageIndex": 11105,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 3, 2012 06:02PM Judy67 wrote: bar630 - I was told same thing.",
      "MessageIndex": 11309,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 11, 2012 09:42AM Judy67 wrote: isa - I don't take the coQ10 yet because an integrative women's health physician who did a seminar I attended said it is a powerful antioxidant and may actually interfere with actions of chemo, she recommended starting after chemo done.  I also take zinc L-carnisine 2-3x/day to help with mouth and taste buds on her recommendation.   Also taking L-Glutamine and I take Claritin starting 3 days prior to tx for a week to help with bone pain from the Neulasta shot.  Seems to help. ",
      "MessageIndex": 11409,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 22, 2012 11:35PM Judy67 wrote: Mimi, good luck on the interview, I vote for the pants outfit too. Hawk, yay for finish the 26 and good luck with the boosts.  I'm all for keeping each other motivated.  I signed up to do the Komen race (walk in my case) here.  It's only a 5K but I need to start walking so I can actually do it.  Bunch of friends and family are walking with me, it's on April 14 ten days after my last chemo.  It's my celebration walk.  I would like to shed these 7 pounds by then if possible.",
      "MessageIndex": 11567,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Feb 28, 2012 09:44PM Judy67 wrote: Sheila - hugs and prayers your way. I so hope they come up with a vaccine.  I worry about my daughter.",
      "MessageIndex": 11702,
      "PostDate": "28/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Mar 1, 2012 10:21PM Judy67 wrote: Sheila, sending comforting hugs and thoughts your way, hope you can feel them. Mimi - praying that the job will be yours. Hawk - I finally exercised yesterday.  I hope to lose some of these pounds before my birthday in May.",
      "MessageIndex": 11736,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Mar 20, 2012 08:06PM Judy67 wrote: seabeal, I love New Mexico, it is so beautiful!",
      "MessageIndex": 12082,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Apr 16, 2012 09:22PM Judy67 wrote: Good for you Annette! ",
      "MessageIndex": 12365,
      "PostDate": "16/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Apr 24, 2012 09:32PM Judy67 wrote: Belated birthday wishes Ducky!  Hope you had a good one.",
      "MessageIndex": 12454,
      "PostDate": "24/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 21, 2011 01:03AM Judy67 wrote: Mardibra - good luck tomorrow.  Hope everything goes smoothly.  Get a good night's sleep if you can. Hugs from Texas,                                                                                                                         Judy",
      "MessageIndex": 994,
      "PostDate": "21/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 23, 2011 07:10PM Judy67 wrote: iluv2knit - I was like that for the first two weeks, then just the other day I turned a corner and I can sleep all the way through the night and haven't had to nap these last couple of days.  I have no idea if it will last. AnnAlive - I'm having a totally different problem with my TE.  Everything looked good until about day 12 then redness started creeping in on the right side.  I am not having fever but most of the right foob is red and doesn't seem to be going away. I'm on antibiotics and PS said willing to go as is for a little while but if it gets worse or doesn't start getting better, right side will have to come out and the start over after redness or infection is resolved.  Makes me want to cry just thinking about starting over but it's still better than having cancer in there. Eema - sorry to hear about the biopsies. I hope everthing comes back clear. I thing once we are diagnosed with BC it makes us feel vulnerable everywhere. Dukes_up - I enjoyed a glass of wine the day before my surgery with my husband.  Good luck tomorrow, I'll be thinking about you. Hugs for Texas,  Judy",
      "MessageIndex": 1048,
      "PostDate": "23/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Nov 1, 2011 05:20PM Judy67 wrote: November 1st.  We made it through the surgery list!  Not sure about everyone else, but I was happy to say goodbye to October.  I am a month out from surgery and doing really well.  Started back part time to work and go back full-time this Monday.  The redness I had on the right side is finally going away so I'll get to keep my TE.  I am so thankful that PS was williing to wait it out instead of taking it out right away.  Had my last fill today and I have an appointment for my exchange Dec. 19th.  Trying to get it in before the end of the year because of my high deductible insurance plan.  So sorry to hear about the issues some of you are having.  Hope they resolve soon, I've not been posting but I've been reading and keeping up.  You are all an amazing bunch of Women and fighters. Thanks for the information and warnings about Lymphedema.  I've been reading up on it and taking a more vigilant approach in prevention.  You guys are right, there is not enough info and warning given about it before surgery.  After my surgery I had to keep stopping the nurses from taking blood pressure from right side.  They just didn't think about it.  They automatically went to that side because I.V.'s were in other side.  Seems like some sort of warning bracelet on that arm during hospital stays would be a great idea.",
      "MessageIndex": 1195,
      "PostDate": "01/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Nov 19, 2011 03:30PM Judy67 wrote: Rachel, I've also gained weight since surgery.  I'm pretty sure it was all those casseroles and sweets from friends plus all my recliner time.  Now I have the holidays here too and I'm about to start chemo with Taxotere listing weight gain as a side effect as well as the steroids.  Yikes!!!   Anyway, could your rash be caused by irritation from the TE rubbing?  I had a little bit of that on my left side, also not my lymph node side, but it has gone away.  I didn't do anything for it.  My TE's feel like they go under my armpits.  You might ask your PS.",
      "MessageIndex": 1382,
      "PostDate": "19/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 2, 2011 04:33AM Judy67 wrote: Welcome Rockysg, you'll be joining Survivor11 and Trinity for the first surgeries in October.  Hope everything goes well and I'll add you to the prayer list.",
      "MessageIndex": 362,
      "PostDate": "02/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 4, 2011 05:52AM Judy67 wrote: Gamergirl - thanks so much for creating this site.  It has helped with the waiting having a group of \"friends\" to share this with.  Good Luck tomorrow!  Also to MargieC , Stephanie33, DanaDane, mauimom, & SLOGeek02.  I'll be thinking about all you guys right up to lights out.  I'll hopefully be back online Thursday to check in with everyone.  Also good luck to all the other surgeries this week.  Hope the week passes quickly for you.   Judy",
      "MessageIndex": 429,
      "PostDate": "04/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 3, 2011 06:30PM Judy67 wrote: Hi Ladies, Sorry it's been so long since I've been here.  I've been trying to get Christmas stuff done before surgery as well as keeping up with some online classes I'm taking.  Had my surgery yesterday.  They switched out my expanders with silicone implants.  Immediate relief, it no longer feels like I'm wearing boobs of steel on my chest.  They also placed a port for chemo.  I asked that it be placed on my left.  I'm not sure if that is the reason or something else, but instead of going from my chest to my heart, it goes from my chest up my neck and connects into my jugular.  My neck is the only thing sore today. Anyway, I always get really sick from anesthesia, but this time they gave me a patch for nausea to wear before the surgery and I did not get sick at all.  Felt a little queasy in recovery which was totally controlled with Phenegran.  If anyone else has this problem, ask your doctor for one of those patches at your pre-op appt.  Also nurse said it helps to really hydrate the day before.  Good luck to everyone, hope you all do well with quick recovery.  I'm now trying to mentally prepare myself for chemo, ugh!  First tx on the 21st.",
      "MessageIndex": 149,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Nov 19, 2011 02:42PM Judy67 wrote: CookieMonster,  No, it doesn't.  Another issue with having all this done towards the end of the year is that insurance often changes.  One of the reasons I pushed to have this exchange done before I start chemo is that PS is not on the new insurance my husband's company is switching to.  Just one more stressful consideration.   I have already warned husband and kids not to plan anything the day after Thanksgiving, told them we are decorating for Christmas that day and they are all helping, usually I do most of it. ",
      "MessageIndex": 25,
      "PostDate": "19/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 8, 2011 09:32PM Judy67 wrote: Blessings -  Good to hear that you are doing well.  Hope you have a quick recovery.  I thought the drains were the worst part of the whole deal.  Not really painful, just annoying after the first few days.  Be sure to take it easy.  The easier you take it, the faster those drains get to come out.  Healing Hugs ((  ))  Judy",
      "MessageIndex": 286,
      "PostDate": "08/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 14, 2011 02:20AM Judy67 wrote: Ann Top,  Welcome, sorry you had to join the club.  I had my BMX Oct. 4th. Chose that route for the same reason you did and I definitely don't regret it.  Good luck with your surgery.",
      "MessageIndex": 390,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 26, 2011 08:27PM Judy67 wrote: Good luck to the ladies headed to surgery next week.  Hope you have no complications and quick healing.",
      "MessageIndex": 633,
      "PostDate": "26/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 14, 2011 10:07PM Judy67 wrote:",
      "MessageIndex": 866,
      "PostDate": "14/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 18, 2011 03:40AM Judy67 wrote: Cyndi - Good luck tomorrow!  Hope report is good. LisaWade & SalSpecht - I hope everything went great today and that you're both in recovery doing well with pain meds.  AnnAlive - I'm so glad to hear you're in remission.  That's great news! I developed a low grade fever this weekend and the beginnings of infection in right side.  Now I'm on Clindamycin, but BS also gave me good news today.  My pathology report after mastectomy only shows ductal carcinoma.  They think they must have got all the invasive with the original biopsy.  Although Staged as a 1, BS thinks probably won't have to have chemo, just Tamoxifen.  Won't know for sure until after I see Oncologist but feeling relieved either way. Hugs to all my BC Sisters, Judy",
      "MessageIndex": 929,
      "PostDate": "18/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 23, 2011 11:29PM Judy67 wrote: Just a post-op suggestion for those who still haven't had surgery.  The bras I got from Wal-mart that close in front are not that comfortable for me.  So far, the best thing I've found are soft, stretchy sports type bras.  My favorite one is a little padded so it hides my incision lines.",
      "MessageIndex": 1055,
      "PostDate": "23/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Nov 2, 2011 05:36PM Judy67 wrote: Dawn - I am so sorry you have had such a hard, awful, October.  I hope everything starts going good for you.  That's good news on the expander.  January will be here before we know it.  Thinking healing thoughts for you. MargieC - I'm with you, can't wait to change out these expanders.  I would love to sleep comfortably on my side again. Lisa - That happened to me too with my path report.  I got the call the morning of my appt and the Dr. had to reschedule because of emergency surgery.  I almost cried on the phone.  The waiting is still the hardest part I think.  Hope you get a good report and that this week flies by quickly. Shannon - sorry about the chemo, especially during the holidays.  I find out for sure if I'll have it next Wed. after I get my Oncotype DX report back. ",
      "MessageIndex": 1217,
      "PostDate": "02/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Nov 3, 2011 04:59PM Judy67 wrote: CookieMonster - I'm sorry you're looking at a Mastectomy after already going through surgery.  I did a BMX and looking back I'm glad I did.   They found a couple of areas of Ductal in another location in the breast than the original site.  Hopefully radiation would have killed this if I had went with a lumpectomy, but I feel better knowing it's gone.  I'm about 5 weeks out now and although my new boobs are not that comfortbable at the moment, I've become attached to them and it doesn't bother me to see them.  I'll get an exchange in Dec. and PS assures me those will feel great in comparison.  Hope it all goes well. Deniseday - wishing you a quick and easy recovery.  I think the drains were the worst part of it.  They weren't painful, just annoying.",
      "MessageIndex": 1230,
      "PostDate": "03/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Nov 10, 2011 02:19PM Judy67 wrote: Totally bummed yesterday as my Oncotype DX score came back a 43.  Which means after being told I would probably not need chemo since it was caught so small, I am now in for 6 treatments and a year of Herceptin treatments.  I know I'll get through it as I have read the posts of many of you strong women who have made it through. I just hope I can come through as bravely as you guys have.  Have to admit, chemo scares me more than the Mascetomy ever did.",
      "MessageIndex": 1299,
      "PostDate": "10/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 3, 2011 07:43PM Judy67 wrote: CookieMonster - my insurance did the same thing, but by the time they came back and denied it, the test had already been done.  The ins. is saying because of my her2+ component, I don't fall into their requirement category.  I think my onc. office sending them more info.  I may get stuck with that bill, but hoping not.  It was my oncotype test that changed my onc.'s mind about chemo tx's.  Originally thought I would not need it since invasive component <3mm.  Hope your insurance company comes around. Hugs, Judy",
      "MessageIndex": 1471,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Sep 28, 2011 04:05AM Judy67 wrote:",
      "MessageIndex": 234,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 6, 2011 08:13PM Judy67 wrote: I'm two days out from my BMX w/Recon.  I got to come home yesterday as I was doing well and moving around a lot.  Much better at home.  Anesthesia and pain meds make me sick so now I'm just on regular Tylenol until I can take my blessed Advil after 72 hours out. They did not find cancer in initial lymph node biopsy.  Wednesday I have my follow up with BS and pathology results should be back, then I see the oncologist to discuss Chemo and/or further treatment. Gamergirl and Survivor I wanted to cry when I read your posts.  I'm so sorry about your setbacks.  This whole ordeal is so scary.  I wished we didn't have to go through this.  I keep thinking back to 6 weeks ago when I was blissfully unaware.  I will never again take my health for granted.  Hope you both get better news soon.",
      "MessageIndex": 560,
      "PostDate": "06/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 7, 2011 05:52PM Judy67 wrote: Prayers out today for Kellyconboy, Sherylh72, clc, Jesslove29, UMX, Nell2109 - hope everything goes well for you all and I'm thinking about you. I'm now 3 days out and doing okay so far.  I'm able to look at myself with a sort of clinical detachment in the mirror. My PS came in the day after surgery and unwrapped me in front of DH and showed me all that was going on.  It did really help to get it over with and DH handled it great.  Something else my PS did that was very helpful, he had a Lidocaine pump that went in through teeny tubes one in each breast and wrapped around inside releasing Lidocaine for about two days.  I was able to take it out myself yesterday when the pain ball was empty and I'm missing it today.  Really think it helped.  Still just taking Tylenol right now, tried Tramadol but still made me woozy.  Tonight I get to start taking Advil.  Yay!! Mr. Clams - SNB is sentinel node biopsy where they take the first lymph nodes in the chain and check for cancer cells instead of taking them all which is ANB axillary node biopsy. I'm thinking about those of you with surgery next week too, I know how hard this weekend will be.  Try to relax and do something fun with your families.  Before you know it you'll be on this side of surgery and back home again. Thanks to all my virtual sisters out there who make this easier and less lonely than it would have been. Sending out love, prayer, and healing thoughts to you all.  Judy",
      "MessageIndex": 599,
      "PostDate": "07/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 7, 2011 10:58PM Judy67 wrote: Gamergirl - I hear that fighting spirit back in your virtual voice.  I've been wondering too what I'll look like bald.  My DH offered to shave his head too.  Told him I'm afraid his might not come back LOL!!  I think I'll use this as an opportunity to try out different colored wigs and see what color I want to be when it grows back. CLC - glad to hear you're already coming around.  Kelleyod & slgarcia05 - I'll be praying for you guys Monday.  Hope all goes well.  Kim137 - Hope your results show no invasion - I'll praying for you on the 13th.",
      "MessageIndex": 614,
      "PostDate": "07/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 10, 2011 08:30AM Judy67 wrote: Hello ladies, due to frequent napping during the day, my hours are all off and I'm wide awake at 1:30 in the morning.  Reading the constipation issues above, I remember reading someone else's post about Raisin Bran and so had my DH get me some day before yesterday.  Worked like a charm, no stool softeners needed.  I definitely recommend having a box on hand for all you presurgery people.  Have appt. with PS tomorrow, hoping I'll get these drains out.  Otherwise feeling good except for getting used to the 10lb weights on my chest where I used to have soft squishy breasts.  I'm wondering if these expanders ever get more comfortable, anyone know?",
      "MessageIndex": 680,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Oct 13, 2011 12:40AM Judy67 wrote: Kcobb, iLUV2knit, kim137 - thinking of you guys and praying for smooth surgery and recovery.  Hope you're able to get some good sleep tonight. Jerry - Thanks for your updates, what a supportive husband you are.  That will help so much in Shannon's recovery.  Hope the pathology reports are good and the pain gets better.  I don't know if this will help with the Elephant on your chest feeling, but when I start feeling extremely tight chested I  use that breathing thing they make you blow into in the hospital to help clear your lungs and it helps ease the tightness after exercising with it for a few minutes.",
      "MessageIndex": 798,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 10, 2011 07:35PM Judy67 wrote:",
      "MessageIndex": 332,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 14, 2011 11:54PM Judy67 wrote: Good luck tomorrow ladies, get good rest tonight.  Judy, thanks for starting and maintaining this thread.  Jo, I'm so jealous, would love to be that far along. ((Hugs)), Judy",
      "MessageIndex": 407,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 15, 2011 10:41PM Judy67 wrote: Jenn, so sorry about your pathology, that totally sucks.  Hoping your scans come back clear.  Hugs your way!  Mamabear - Laughed out loud about the anesthesiologist. Sorry, I have no idea about the headache.",
      "MessageIndex": 442,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 22, 2011 03:51AM Judy67 wrote: Kam - hope path report is good news, good luck with future surgery. cookiemonster and Chrissilini - I'm so glad you are doing good and getting good reports. goldlining - isn't great to be home?  Good luck with continued healing and I hope you get your drain out soon. Hugs! Judy",
      "MessageIndex": 562,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 7, 2011 09:14AM Judy67 wrote: I've been following this quirky thread with its many twists and turns.  Very entertaining.  Thought I would post something more to its original purpose on the question of chemo.  I am a stage 1 triple positive.  The invasive component of my cancer was removed in the original biopsy (3mm)  and both my BS and my onc. thought that chemo would be unnecessary.  I continued on with my reconstruction while my onc. sent off my original biopsy for the oncotype dx test.  My score came back a 43.  Very high chance of recurrence with thought that benefit from chemo would outweigh the side effects.  For me, this was a no brainer.  At the end of the day, even if cancer returns, I want to know that I did everything I could to prevent recurrence.  This includes 6 treatments of Taxotere and Carboplatin and a year of Herceptin followed by 5 years of Tamoxifen.  It also includes trying to live as healthy as I can with diet, antioxidants, exercise, etc...  I am extremely thankful for the science and for Herceptin.  I begin my tx's Dec. 21st.",
      "MessageIndex": 327,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "Judy67",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135904/profile",
      "Content": "Dec 7, 2011 08:09PM Judy67 wrote: Sue,  I am actually having problems with the insurance wanting to cover the oncotype test as they say her+ doesn't fit their criteria.  But I'm thankful I did it anyway as the oncologist at first didn't think chemo was warranted because invasive component was less that 3mm.  I totally had my heart set on skipping the chemo until that score came back.  Just another sudden twist in this journey with BC. By the way, I like kitties and puppies.  4 dogs, 1 cat.",
      "MessageIndex": 343,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    }
  ]
}