{
  "AuthorID": "JudyM",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
  "Posts": [
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "JudyM wrote: My daughter Kim, 51, is having a single left mastectomy (DCIS) and tissue expander inserted on Friday and a family member from my location is going to go (a long distance) and help out. First, will Kim probably be in the hospital overnight and go home the next day (Saturday)? Her DH works on Sunday, so the helper will need to be there by then if Kim is at home. Kim has an 8-year-old son, and they have a 2-story house.. Second, what will Kim be going through in the few days right after surgery? I've read she should use a recliner and pillows for comfort. Will she be on pain pills and dozing a lot? Will she be ambulatory? Will her left side be unusable and will she need a lot of assistance for activities of daily living? Or will she have some use of her left side? She is right-handed. She doesn't have a grabber tool, but I can tell her to get one. Will she be able to go up and down stairs, or plan on staying on the first floor?  Any advice on what to expect will be SO appreciated!  Judy (only 2 more weeks of radiation, yay!)  Dx 11/10/2009, IDC, 2cm, Stage IIA, Grade 3, 0/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754142",
      "Title": "Need immediate post-surgery info for helper JudyM Hannahbearsmom"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "Feb 12, 2010 06:38PM - edited Feb 12, 2010 06:45PM by JudyM Here's an update to my post starting this thread: First, Magister, I was stunned at your experience! It's like we're stuck in a whirlpool with no control or idea of how to get out of it. I'll be watching for your progress.  Well, Chemo #2 last Monday was on February 8th. Finally informed that the steroids given keep us peppy, I was at the bank on Day 2 at 3 PM with complicated bank biz, when I felt \"it\" was on its way. I got home, and that night took a long hot bath and fell into bed with chills, bone aches, fog, and yukkiness. On Wednesday, Day 3, I woke up with a California-sized headache and took two Advil. And that was it! From Wednesday at that moment till my writing this on Friday night I've felt quite normal although I get bone-weary by evening. I have no idea if it's a temporary respite and \"it\" will hit again with a vengeance, if I'm good for the next 2-1/2 weeks (hardly seems THAT could happen), or any permutation of the known side effects. This makes planning anything impossible, and living moment to moment. Which is what I'm doing. Grateful and ANXIOUS at the same time. Anybody ever heard of having only 7 hours of side effects and then no more?  A nervous Judy ",
      "MessageIndex": 20,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/748082",
      "Title": "After 1st T/C chemo: What nobody tells you JudyM mslrg"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "Feb 12, 2010 08:22PM - edited Feb 12, 2010 08:23PM by JudyM crusader1  You never had trouble with your intestines as I did on #1? When you say your 4th day, do you mean after each treatment or just once, and how long did it last? Not like what you experienced has anything to do with with happens to me. The irrationality of it blows me away! Judy ",
      "MessageIndex": 24,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/748082",
      "Title": "After 1st T/C chemo: What nobody tells you JudyM mslrg"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "JudyM wrote: I had the first of 4 chemo treatments on Monday, Jan. 18th, which I'll call Day 1. They told me it included Zofran with the drugs to prevent nausea, and so while feeling good that night I took a Zofran tablet before bed to be safe. I didn't close my eyes the whole night, watching the digital clock for hours. I assumed it was the Zofran, but yesterday (at Chemo #2), was told it was the STEROIDS they'd also given me that kept me awake. If I'd needed the Zofran I would NOT have taken it because this information was not given to me at the right time! Day 2: Full of energy, took Ambien to make sure I slept that night. Day 3: WHAM! As someone described it, covered by a lead blanket, and a 50-lb. helmet. Achy joints, felt like I was moving against water from the waist down. Started the habit of counting the hours till 10 PM so I could drug myself for a long night's sleep with 10 mg Ambien, then when that wore off, Darvocet, a narcotic (have Vicodin, an opiate, but want to save it for real pain), then maybe a small dose of Ambien again. I cut 10 mg tabs into 5 mg and 7.5 mg + 2.5 mg pieces so I can have a choice. Day 4: Same. Nasal mucosa was bloody (and was for the next 2 weeks). I had numbness in my feet and still have it today. Cold sores in the corners of my mouth and I still have them today. The skin over all the knuckles below the base of my fingers was fiery red and itchy. The itching lasted a day, and the redness gradually disappeared over 2 weeks. It was very tiring to watch TV because the closed captioning was all blurry. I couldn't get my eyes to focus. That lasted two or three days. Day 5, Friday: Called onco for constipation relief. She ordered Lactulose 3x a day, a thick sugary liquid that tastes like butterscotch. Took it at 11 AM, had a moderately small relief, took it again at 7 PM and then it was like a bomb going off in my lower intestines and rectum. Not much to produce, very small diarrhea spurts, but cramps and enormous pain in the rectum and I could swear something was protruding from the anus that was too tender to even touch toilet paper to! Blood from the rectum for 3 days all over the toilet paper I patted it with; PJ bottoms had dried blood when I did the laundry. This happened for 3 days over the weekend. Never took another dose again, of course. Day 6, Saturday: Took an anti-diarrheal in late afternoon and immediately felt better.  Day 7, Sunday: Still weak, rectum hurt from standing or sitting for half an hour, had to crawl in bed for the next 20 minutes. Repeat for whole day. I was drinking lots of water throughout the whole week. Day 8, Monday: Called onco's office at 10 AM, was shunted to \"Oncology Nurses' Line\" voice mail that asked for medical record number, name, some other number (bank account maybe?). I was crying by this time but did leave my med record number, name, and phone number. I have yet to have a call-back 2 weeks later. At 1 PM my saintly daughter Elise came over and called them back and reamed them till they promised a nurse or the doctor would call back that day. They didn't mention my doctor was not in town on that Monday. No one called back. About 4 PM Elise said, \"Mom, maybe your electrolytes need some help.\" She brought me Gatorade and in 30 seconds I could sit up straight and my head cleared up considerably! From that point on swilled down Gatorade and improved continuously. Had gotten stool softeners, took 3 at a time. Day 9, Tuesday: Onco called back, and I said I wanted to see a gastroenterologist. She said absolutely not during chemo. I had a colonoscopy a year ago and he said I definitely did not have a hemorrhoid. So no help there.  Day 10, Wednesday: I'd lost 7 lbs. over the past week. I went out and got a laxative that features \"No Cramps!\" on the box--Phillips Milk of Magnesia tablets. Took two that night and after that the bottom felt much better and within a couple of days had healed up. No more constipation. Day 11, Thursday: NORMAL AGAIN!!!!!! Got dressed and went to a book club meeting, and out to dinner. Day 12, Friday: Noticed several hairs with follicles attached had fallen, pulled out a few more, but not clumps. I had made an appointment with the hairdresser before the first treatment to have my head shaved on Saturday, Day 13. They say it falls out between days 14 and 21 and I was prepared with two free wigs from ACS and some turbans. Day 13, Saturday: Had head shaved, and I can tell you it wasn't till one week later, a few days ago, that I didn't give a start seeing that alien head in the mirror. FINALLY have got used to seeing it. It itched during the middle of the first week it was shaved, and the stubble hung onto head coverings like the catchy part of Velcro. I finally took a terry towel and vigorously rubbed the whole scalp in circles, over the sink, and loads of short stubbly hairs fell off. They don't all come out at once, I learned. Some bristles are still there, but it's not as catchy as it used to be. No one tells you it can be a long process, though some say their hair only thinned out and didn't entirely go. So far I still have lashes, and my eyebrows have been tattooed on for years.  Having the wigs trimmed and styled by a pro is essential. They look pretty close to my original hair color and style. I've worn them twice so far. Most of the time I wear a roomy acrylic knit cap night and day just to keep my head warm during the winter. At night I put a turban under the cap for extra warmth. That's the biggest concern. Yesterday was the second chemo. First I had blood drawn, then saw a different onco (mine seems to be out of town on Mondays an awful lot!) who told me my blood counts are healthy and normal! Boy, was I ever confused. Everyone had told me how the white cell count would go down by Day 12 and the immune system was compromised, so I inferred it would remain that way all through chemo. NOW I find out there is a cycle after each infusion when the above happens, and then everything should go back to normal before the next treatment! This past week I was so energetic and clear-headed I was wondering if there was something wrong with me...no one had given me the whole story. It is maddening! ACS has a thick booklet that includes contradictory info about what to do and what to avoid, so I asked the doctor about that. He explained the literature for cancer patients is all-inclusive as to the types of cancer and treatments, and requirements vary so much that putting it into one manual is almost useless for treatment of a particular kind of cancer. So beware of what you read. On the other hand, information from doctors and nurses is often partial and leaves out the parts you really need to know, for example me thinking the Zofran kept me up when it was really the steroids, so that I wouldn't have taken it even though I might have really needed it! I hope at least some of this will help newbies, who, like me, don't know what to expect and have been fed insufficient preparation for this ordeal--and don't even know it. Dx 11/10/2009, IDC, 2cm, Stage IIA, Grade 3, 0/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "09/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/748082",
      "Title": "After 1st T/C chemo: What nobody tells you JudyM mslrg"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "Feb 14, 2010 03:27PM - edited Feb 14, 2010 03:29PM by JudyM Bright-sided : how the relentless promotion of positive thinking has undermined America, by Barbara  Ehrenreich.. Ehrenreich (who wrote Nickel and Dimed) delivers a trenchant look into the burgeoning business of positive thinking. A bout with breast cancer puts the author face to face with this new breed of frenetic positive thinking promoted by everyone from scientists to gurus and activists. Chided for her anger and distress by doctors and fellow cancer patients and survivors, Ehrenreich explores the insistence upon optimism as a cultural and national trait.  ",
      "MessageIndex": 41,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/748082",
      "Title": "After 1st T/C chemo: What nobody tells you JudyM mslrg"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "JudyM wrote: I had the first of 4 chemo treatments on Monday, Jan. 18th, which I'll call Day 1. They told me it included Zofran with the drugs to prevent nausea, and so while feeling good that night I took a Zofran tablet before bed to be safe. I didn't close my eyes the whole night, watching the digital clock for hours. I assumed it was the Zofran, but yesterday (at Chemo #2), was told it was the STEROIDS they'd also given me that kept me awake. If I'd needed the Zofran I would NOT have taken it because this information was not given to me at the right time! Day 2: Full of energy, took Ambien to make sure I slept that night. Day 3: WHAM! As someone described it, covered by a lead blanket, and a 50-lb. helmet. Achy joints, felt like I was moving against water from the waist down. Started the habit of counting the hours till 10 PM so I could drug myself for a long night's sleep with 10 mg Ambien, then when that wore off, Darvocet, a narcotic (have Vicodin, an opiate, but want to save it for real pain), then maybe a small dose of Ambien again. I cut 10 mg tabs into 5 mg and 7.5 mg + 2.5 mg pieces so I can have a choice. Day 4: Same. Nasal mucosa was bloody (and was for the next 2 weeks). I had numbness in my feet and still have it today. Cold sores in the corners of my mouth and I still have them today. The skin over all the knuckles below the base of my fingers was fiery red and itchy. The itching lasted a day, and the redness gradually disappeared over 2 weeks. It was very tiring to watch TV because the closed captioning was all blurry. I couldn't get my eyes to focus. That lasted two or three days. Day 5, Friday: Called onco for constipation relief. She ordered Lactulose 3x a day, a thick sugary liquid that tastes like butterscotch. Took it at 11 AM, had a moderately small relief, took it again at 7 PM and then it was like a bomb going off in my lower intestines and rectum. Not much to produce, very small diarrhea spurts, but cramps and enormous pain in the rectum and I could swear something was protruding from the anus that was too tender to even touch toilet paper to! Blood from the rectum for 3 days all over the toilet paper I patted it with; PJ bottoms had dried blood when I did the laundry. This happened for 3 days over the weekend. Never took another dose again, of course. Day 6, Saturday: Took an anti-diarrheal in late afternoon and immediately felt better.  Day 7, Sunday: Still weak, rectum hurt from standing or sitting for half an hour, had to crawl in bed for the next 20 minutes. Repeat for whole day. I was drinking lots of water throughout the whole week. Day 8, Monday: Called onco's office at 10 AM, was shunted to \"Oncology Nurses' Line\" voice mail that asked for medical record number, name, some other number (bank account maybe?). I was crying by this time but did leave my med record number, name, and phone number. I have yet to have a call-back 2 weeks later. At 1 PM my saintly daughter Elise came over and called them back and reamed them till they promised a nurse or the doctor would call back that day. They didn't mention my doctor was not in town on that Monday. No one called back. About 4 PM Elise said, \"Mom, maybe your electrolytes need some help.\" She brought me Gatorade and in 30 seconds I could sit up straight and my head cleared up considerably! From that point on swilled down Gatorade and improved continuously. Had gotten stool softeners, took 3 at a time. Day 9, Tuesday: Onco called back, and I said I wanted to see a gastroenterologist. She said absolutely not during chemo. I had a colonoscopy a year ago and he said I definitely did not have a hemorrhoid. So no help there.  Day 10, Wednesday: I'd lost 7 lbs. over the past week. I went out and got a laxative that features \"No Cramps!\" on the box--Phillips Milk of Magnesia tablets. Took two that night and after that the bottom felt much better and within a couple of days had healed up. No more constipation. Day 11, Thursday: NORMAL AGAIN!!!!!! Got dressed and went to a book club meeting, and out to dinner. Day 12, Friday: Noticed several hairs with follicles attached had fallen, pulled out a few more, but not clumps. I had made an appointment with the hairdresser before the first treatment to have my head shaved on Saturday, Day 13. They say it falls out between days 14 and 21 and I was prepared with two free wigs from ACS and some turbans. Day 13, Saturday: Had head shaved, and I can tell you it wasn't till one week later, a few days ago, that I didn't give a start seeing that alien head in the mirror. FINALLY have got used to seeing it. It itched during the middle of the first week it was shaved, and the stubble hung onto head coverings like the catchy part of Velcro. I finally took a terry towel and vigorously rubbed the whole scalp in circles, over the sink, and loads of short stubbly hairs fell off. They don't all come out at once, I learned. Some bristles are still there, but it's not as catchy as it used to be. No one tells you it can be a long process, though some say their hair only thinned out and didn't entirely go. So far I still have lashes, and my eyebrows have been tattooed on for years.  Having the wigs trimmed and styled by a pro is essential. They look pretty close to my original hair color and style. I've worn them twice so far. Most of the time I wear a roomy acrylic knit cap night and day just to keep my head warm during the winter. At night I put a turban under the cap for extra warmth. That's the biggest concern. Yesterday was the second chemo. First I had blood drawn, then saw a different onco (mine seems to be out of town on Mondays an awful lot!) who told me my blood counts are healthy and normal! Boy, was I ever confused. Everyone had told me how the white cell count would go down by Day 12 and the immune system was compromised, so I inferred it would remain that way all through chemo. NOW I find out there is a cycle after each infusion when the above happens, and then everything should go back to normal before the next treatment! This past week I was so energetic and clear-headed I was wondering if there was something wrong with me...no one had given me the whole story. It is maddening! ACS has a thick booklet that includes contradictory info about what to do and what to avoid, so I asked the doctor about that. He explained the literature for cancer patients is all-inclusive as to the types of cancer and treatments, and requirements vary so much that putting it into one manual is almost useless for treatment of a particular kind of cancer. So beware of what you read. On the other hand, information from doctors and nurses is often partial and leaves out the parts you really need to know, for example me thinking the Zofran kept me up when it was really the steroids, so that I wouldn't have taken it even though I might have really needed it! I hope at least some of this will help newbies, who, like me, don't know what to expect and have been fed insufficient preparation for this ordeal--and don't even know it. Dx 11/10/2009, IDC, 2cm, Stage IIA, Grade 3, 0/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/748082",
      "Title": "After 1st T/C chemo: What nobody tells you JudyM mslrg"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "Feb 10, 2010 12:21PM JudyM wrote: mslrg: We have very similar diagnoses and treatment schedules. I feel like I'm reading about myself! This is Day 3. Yesterday I was still in the energized zone and was taking care of some complicated bank business, when about 3 PM I felt \"it\" starting. I got home and \"it\" progressed as I remembered it. I took a long hot bath, went to bed with chills, aches, feeling awful, did my nighttime drugs, and got out of bed 12 hours later (not all sleeping time, some luxuriating time). I had a terrible headache and took 2 Advil with the tiny breakfast I could manage getting down...and 2 hours later, no lead blanket, no 50-lb. helmet, no aches, just low-energy! Who would've thought? This didn't happen the first time. And may never happen again. You are right on the nose about the unpredictability of this process. Soul sisters!",
      "MessageIndex": 6,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/748082",
      "Title": "After 1st T/C chemo: What nobody tells you JudyM mslrg"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "Feb 14, 2010 12:44PM - edited Feb 14, 2010 12:49PM by JudyM Here's a postscript to the post that I started this thread with.  I only had 7 hours of yuck on Day 2, but have been quite exhausted. Yesterday was Day 7 and I didn't feel quite right and I laid on the couch all day and watched the Olympics, and today it's worse. Hallelujah, not the lead blanket and 50-lb. helmet--but un-ease in my middle and the rectum problem resurfacing with any bowel productions. Not extreme, but enough to making me stay immobile today. While I was turning the bacon for breakfast, I felt I had to go to the bathroom and started to feel faint. I broke out in a COLD sweat, even the top of my bare stubbly head was soaked with cold perspiration, sat down on the toilet barely conscious but managed to put water in a cup and swallow it (in case it was fluid imbalance). It took some minutes before I could pull myself up and go back to the kitchen. It wasn't a bowel problem either; nothing at that end. Scared the bejeebers out of me--I  live alone and wasn't near a phone.  Still one day at a time, and the days are getting not-so-good. Nights are GREAT with drugs of choice. LOVE my bed. Happy Valentine's Day to all of us!!!   Judy    ",
      "MessageIndex": 39,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/748082",
      "Title": "After 1st T/C chemo: What nobody tells you JudyM mslrg"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "Feb 13, 2010 12:00AM JudyM wrote: i had to get out of bed and and start the computer again because I've heard this once too often: \"Celebrate! You're halfway there!\" No, I'm NOT halfway there. I had the second of four T/C treatments last Monday, and it will be 2-1/2 weeks before the third. THAT'S when I'll be halfway there. In the meantime I'm wondering from hour to hour whether the malaise is going to start again or not (it only lasted 7 hours on Day 2) and whether some new side effect will show up. I'm only halfway to the nadir and I am already exhausted beyond anything experienced so far. So the journey will take a while longer and I'm quite aware of it. Please, no more aphorisms from the cheerleaders. Did I mention I'm cranky too?  Judy ",
      "MessageIndex": 27,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/748082",
      "Title": "After 1st T/C chemo: What nobody tells you JudyM mslrg"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "Feb 14, 2010 03:57PM JudyM wrote:",
      "MessageIndex": 43,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/748082",
      "Title": "After 1st T/C chemo: What nobody tells you JudyM mslrg"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "Jul 29, 2010 08:58PM JudyM wrote: PurpleMe:  I had my eyebrows tattooed on about 8 years ago. I was in my later 60s and I dyed my hair dark brown-black at the time, so I was busy plucking out the really coarse white eyebrow hairs, plus the outer halves of the brows were disappearing. I loved it! Then a few years ago I stopped dyeing and went steel gray. The very dark brows looked nice with it.  While I was hairless this winter and spring, I usually wore a knit beret-type hat to keep my head warm, and there were these very dark brows and the peek of a hairless head. Now that there's about 1 inch+ of whiter hair in front (last chemo March 22), the dark brows are pretty interesting. It has faded with time, so they're not jet-black looking, but darker than I would have gone if I had thought ahead to the \"gray\" years. But...tattooing was one of the best things I've done--go for it! Judy ",
      "MessageIndex": 5715,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "Jul 30, 2010 01:28AM JudyM wrote: hrf: When I had my breast MRI I asked about cosmetic tattooes in general and the technician said it was no problem. Now, if it was a head MRI I'd get the definitive answer from an expert.",
      "MessageIndex": 5720,
      "PostDate": "30/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "Jul 17, 2010 08:48PM - edited Jul 17, 2010 10:06PM by JudyM I had my last of four T/C doses on March 22nd, and let's allow 3 weeks for the side effects to wind down, so that makes 8 weeks till today that my hair has had to grow. I had it shaved off as soon as a few hairs started floating down onto my sleeve in late January, and there were a few hairs that continued to grow to about 1/2\" throughout the chemo period. I had coarse, thick steel gray hair with a medium wave here and there. In early April I could see a 5 o'clock shadow on the back of my head, and my daughter swore there were hairs growing on the top and sides, but I couldn't see it. The back started growing at an astonishing rate, and the straight top and side hair soon was growing in nicely. A few weeks ago I noticed really strong waves going back and forth in the back, hugging the scalp. Overall, I looked like an old Marine with a buzz cut. I am old..I'm 76. Then, about a week ago, all of a sudden the top, sides, and the much longer back hair started curling up...I took these pictures today (blindly) and this happened literally within a few days! Much curlier than I've ever had and as soft as cotton candy. It's my new obsession and I can't stop stroking it! I should add the heat and high humidity probably have pushed the curls to the max.   Actually, this is the only fun thing that has come out of this whole ordeal! The hair is the same color, but texture and curliness beyond imagining! I hope it stays this way for a long time--much more fun than my boring old hair.  BTW, my eyelashes got sparse during chemo but I could still use careful mascara on them, and then they disappeared a month after chemo was over. I didn't pay much attention after that and then a few weeks ago I suddenly noticed they were back to pre-chemo condition.  Judy ",
      "MessageIndex": 5651,
      "PostDate": "17/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "JudyM wrote: My last chemo was 4-1/2 weeks ago, Taxotere and Cytoxin. The weak legs became normal only a few days ago. Hooray! But I still have episodes of fatigue and immobility that come on me suddenly, and today I'm speeding (not from any medication). The neuropathy in my feet and lower legs hasn't improved at all. What can I expect? Radiation for 6 weeks starts in May. Besides fatigue, will there be any other side effects? Judy Dx 11/10/2009, IDC, 2cm, Stage IIA, Grade 3, 0/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751676",
      "Title": "Side effects after chemo is over JudyM Texas357"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "JudyM wrote: This Post was deleted by JudyM. Dx 11/10/2009, IDC, 2cm, Stage IIA, Grade 3, 0/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742917",
      "Title": "Mammo yesterday showed medium mass JudyM Luvmaui"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "Oct 28, 2009 04:44PM - edited Oct 28, 2009 04:46PM by JudyM",
      "MessageIndex": 1,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742917",
      "Title": "Mammo yesterday showed medium mass JudyM Luvmaui"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "Apr 23, 2010 01:26AM JudyM wrote: I had four T/C infusions. During the first cycle I was in a hot bath and noticed my toes were tingling--how do you do, neuropathy! It's a numbness-tingly feeling in whole foot and toes, and in the third cycle it went up to half the lower legs. I've been finished with chemo for 4-1/2 weeks and it's still there. It's more pronounced lying in bed at night. A few toe-tips are super-sensitive to touch.   It's not the worst side effect you can have, though. But definitely annoying.   Judy ",
      "MessageIndex": 11,
      "PostDate": "23/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/749481",
      "Title": "Peripheral Neuropathy and Taxotere faithfulc JudyM"
    },
    {
      "AuthorID": "JudyM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91625/profile",
      "Content": "Nov 5, 2009 06:23PM JudyM wrote: Hi, Jeanette: I'm 75 and posted earlier today about having had a needle biopsy this morning and being sent for MRI's on both breasts. I went to a book club meeting this afternoon and had some panic attacks on the drive home--the fear is the biggest thing to combat! We shall chat again.  Strong hugs to you, and I need them too... Judy ",
      "MessageIndex": 9,
      "PostDate": "05/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/743267",
      "Title": "I think I'm the oldest one here! Chevyboy Chevyboy"
    }
  ]
}