{
  "AuthorID": "JudyAnnW",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97978/profile",
  "Posts": [
    {
      "AuthorID": "JudyAnnW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97978/profile",
      "Content": "JudyAnnW wrote: Hello all - I do not mean to sound naive or stupid with this question.  Is there anyone out there who considered not doing chemo because their life and situation was so unhappy that they didn't want to go through chemo and come back to such unhappiness ?  I find myself in this situation and it is so sad !  I keep telling myself - why bother.     I'm 54, I'm an only child and have no children.  My marriage has not been very happy the past few years.  My husband is not working and everyday has become a struggle.  I am not looking for sympathy.  But - I find I am not looking forward to the future.  My life was a mess before the cancer diagnosis and now its just horrible.  So - I was wondering if anyone out there was in a sad situation when they were diagnosed, what decision they made and how they buoyed themselves up when there was really nothing out there to look forward to.  I am sorry this sounds so sad, but this is my reality. Thanks for allowing me to vent and I welcome any feedback.  I do not consider myself a coward and it is not the vanity of losing my hair that has prompted this post.  I just don't know how to snap out of this feeling.  I will be having my second surgery to clear margins and remove more nodes on June 13, then the radiation and chemo.  I have been told a positive  attitude is crucial, but how do I get there ? Thanks everyone, Judy but how do I get there ? Dx 1/15/2010, IDC, 1cm, Stage II, Grade 2, 1/14 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753597",
      "Title": "Deciding Against Chemo JudyAnnW Titan"
    },
    {
      "AuthorID": "JudyAnnW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97978/profile",
      "Content": "Jun 6, 2010 12:16PM JudyAnnW wrote: I want to thank everyone who took the time to respond to me.  I am overwhelmed by the caring and concern by you all.  I will speak to my doctor tomorrow (I am having my pre-op physical) about my issues and see what she says.  I blame myself for being in a situation with my life that has brought me such sadness.  I want more than anything to have something to look forward to - that is the hard part.  My only joy in life are my pets. I am a petsitter by profession and this has been a Godsend.  That's another thing that is a major cause for concern.  My cousin who finished chemo last year, was told to avoid litter boxes and be very careful of cat and dog scratches due to the immune system being compromised.  How can I pet sit when I have to worry about that ?  If the only good part of my life is taken away, I am going to have one hell of a time getting a positive attitude. Anyway, thanks again very much for everyone's concern.  Maybe I won't need chemo after all - I will try to remain positive. Best wishes, Judy",
      "MessageIndex": 14,
      "PostDate": "06/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753597",
      "Title": "Deciding Against Chemo JudyAnnW Titan"
    },
    {
      "AuthorID": "JudyAnnW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97978/profile",
      "Content": "Jun 12, 2010 03:53PM JudyAnnW wrote: I would like to thank everyone again for the wonderful words of support.  I have always been the upbeat person, the one who stopped and smelled the roses (literally!).  I will to continue to do so.  Being able to get up and see my dogs and cats everyday is truly my salvation. I am starting a petsitting job tonight with 3 dogs, 3 cats and 2 birds which I am so looking forward to.  I'm just so angry that with my surgery on Wednesday I will be coming home with a drain that will prevent me from rough housing with the dogs.  Luckily, my husband will be coming with me to take care of them while I nurture the cats.  My husband is great with animals.  As AlsoNativeM says, cherish the good qualities of those around you. Again, thank you all so much - you have all been my strength. Judy",
      "MessageIndex": 21,
      "PostDate": "12/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753597",
      "Title": "Deciding Against Chemo JudyAnnW Titan"
    },
    {
      "AuthorID": "JudyAnnW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97978/profile",
      "Content": "JudyAnnW wrote: Hello Everyone - I had a lumpectomy on May 13.  The doctor feels he has removed all of the cancer with clear margins but I am waiting for the pathology report.  I am curious if anyone has heard the sloshing sound in he breast where fluid has filled the breast where tissue once was. The doctor tells me this is normal and the fluid will be absorbed by the body eventually. I just had to share with everyone what a crepy feeling it is to hear this sound !  Was wondering if anyone who has heard this can share how long it lasted for them.  And, if they agree it is a pretty weird sound to come out of your breast. Many thanks and best wishes to everyone. Judy   Dx 1/15/2010, IDC, 1cm, Stage II, Grade 2, 1/14 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753004",
      "Title": "Sloshing Sound after Lumpectomy JudyAnnW Cassia101"
    }
  ]
}