{
  "AuthorID": "juju426",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235411/profile",
  "Posts": [
    {
      "AuthorID": "juju426",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235411/profile",
      "Content": "juju426 wrote: Can anyone tell me what is the difference where the port is placed? I understand it is either placed in the chest area or the arm. The negative for chest is it very noticeable, bumps can be seen and can get black and blue, but positive it is closer the main vein and chemo is faster. Has anyone had a port placed and can tell me what they have experienced? I have the option to decide where I want it placed. I prefer in arm since I already have aches and pains from the expander on the left side, and after all is finished with chemo and radiation, I will be doing plastic surgery to get the right symmetry to match the left breast. I am wondering if the port will interfere with this process, and if once port is removed from the chest area will there be a scar? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/845606",
      "Title": "Port for chemo and blood tests juju426 SpecialK"
    },
    {
      "AuthorID": "juju426",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235411/profile",
      "Content": "Jul 2, 2016 09:11AM juju426 wrote: Thank you special K for your input on port. While the port is in for whatever amount of time is needed, is there any pain or discomfort in the chest area from where is it placed? I have aches and pains, although minor every day from the expander doing its job, I would not want any more aches and pains from the port to add in that I have to deal with. Do most people have the port put in the chest area vs arm? which is the newer direction to go or does it all depend what kind of cancer you are dealing with? breast vs another area of your body?",
      "MessageIndex": 3,
      "PostDate": "02/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/845606",
      "Title": "Port for chemo and blood tests juju426 SpecialK"
    }
  ]
}