{
  "AuthorID": "Julesnpurls…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264918/profile",
  "Posts": [
    {
      "AuthorID": "Julesnpurls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264918/profile",
      "Content": "Julesnpurls wrote: Hi there. I'll start by saying I have lumpy, bumpy breast tissue - always have, so I started getting mammograms in my early 30's. I was called back for additional views on both breasts every year until I was 42, had 3 biopsies over those years, always benign. My insurance changed and I started going to many different centers for my yearly testing and was never called back again and wasn't concerned, just figuring my breasts were becoming easier to read as I got older. This year I went back to my original breast center (better, more comprehensive care). I was called back for diagnostic mammo and ultrasound of my left breast, which I had done yesterday. I wasn't worried because I've been through the drill before. I have been having left breast pain since the summer - more discomfort when I lean on it or someone hugs me or lays on it the wrong way - kind of princess-and-the-pea-ish, like, ack, that hurts. I can't lay on my stomach. I've not felt any unusual lumps but I have so much going on in that breast that I'm never completely confident I'd know if there were something concerning. The original mammo report stated I'm heterogeneously dense and found a 1.1 cm nodule, irregular. So I had my further imaging and then ultrasound. The ultrasound tech could not find the nodule, she looked at the diagnostic pics and measured and marked my breast and tried some more. She said she was surprised she didn't see it because it was big and fully visible on the mammo. She left for a bit to speak to the radiologist, came back and imaged the whole breast. She found a cluster of cysts at 6 o'clock very low at the bottom of the breast and showed the radiologist and came back in and said I'm good to go until next year.this is great news, but I'm concerned because the nodule she was looking for was at 2:00 near the areola , which is in the area of my pain. She said I could make an appointment with breast specialist for a complete work up if I'm uncomfortable with the diagnosi. I'd like to go my merry way - it's just nagging me, like what-if? So, if you've made it this far, I thank you. I'm wondering if I should just let it go and I'm being paranoid or if I should pursue further. I don't have the report yet, it will be uploaded soon. All the best to you all and happy holidays, J-n-p Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861033",
      "Title": "Should I see a breast specialist? Julesnpurls Julesnpurls"
    },
    {
      "AuthorID": "Julesnpurls…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264918/profile",
      "Content": "Dec 21, 2017 05:46AM Julesnpurls wrote: hi Michelle and dtad, Thank you for replying and yes, I should probably see a breast surgeon for peace of mind. I just don't want to overreact and am surprised at how much this is bugging me. Ugh. I'll start looking around after the holidays and make early 2018 all about breast health.:) It will be expensive peace-of-mind, but then I can stop thinking about it",
      "MessageIndex": 3,
      "PostDate": "21/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861033",
      "Title": "Should I see a breast specialist? Julesnpurls Julesnpurls"
    }
  ]
}