{
  "AuthorID": "Jules123",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99134/profile",
  "Posts": [
    {
      "AuthorID": "Jules123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99134/profile",
      "Content": "Jules123 wrote: Hi, Hope everyone is doing well.  It's 8 months since my last chemo and my hair has grown back crazy curly and is growing upwards and out (think Ronald McDonald).  I still haven't got my hair cut yet and still wearing my wig but it's 104 today and it's getting pretty uncomfortable. I just look at my hair and think agggggggghhhhhhh!  It's around 3 - 4\" long and is pretty strong.  I'm thinking of getting the Brazilian Blow Dry.  The salon I am thinking of going to uses a gentle product and is around 87% organic so should be fine.  Has anyone got their short hair straightened and did you like the results? At home and exercising I just stick a handband on and some hair oil to make it softer.  Have tried to straighten it myself and used gel but it still doesn't look good.  When does the curl start to drop out?  I've heard it may stick around for a year or two.  If you have short curly hair how do you manage it? Any tips, encouragement will be gratefully received   Julesx IDC Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/756127",
      "Title": "Hair Growing It Back Jules123 badger"
    },
    {
      "AuthorID": "Jules123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99134/profile",
      "Content": "Mar 21, 2010 04:14AM Jules123 wrote: I have been using Biafine and it has worked really well for me.  I was told not to put cream on 4 hours prior to Radiotherapy.",
      "MessageIndex": 6,
      "PostDate": "21/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/749340",
      "Title": "Bag Balm vs / Aloe/creams RegulJ 3monstmama"
    },
    {
      "AuthorID": "Jules123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99134/profile",
      "Content": "Aug 21, 2010 07:53AM Jules123 wrote: I'm a big fan of Rapid Lash it helped me a lot with eyelash growth.  I get mine from Ebay.  As for the curly hair mine is now around 4\" and it is still growing upwards.  Every day is a bad hair day but with some rosemary oil to tame the frizz and a headband it looks not too bad.  I am getting the Brazilian Blow Dry on the 21st September, it's supposed to be 79% organic am hoping I can get my hair into some style after that and I've just ordered some mini hair straighteners online.",
      "MessageIndex": 5858,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jules123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99134/profile",
      "Content": "Oct 6, 2010 12:51AM Jules123 wrote: Goldie thanks again for posting the 'photos you're a star   How long do the chemo curls last for? Julie0212  LOL yes we have a great name!  My dad's Scottish so I got the red hair from my granny.  Hated it growing up but I love it now. Noda life is so much easier isn't it, I just love it. Wishing everyone good hair days. Jules",
      "MessageIndex": 6237,
      "PostDate": "06/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jules123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99134/profile",
      "Content": "Oct 4, 2010 02:42AM Jules123 wrote: Hi, I wrote a couple of weeks ago that I was going to get the Brazilian Blow Dry.  Well I had it done 2 weeks ago so thought I'd share.  It's 10 months since my last chemo session. Like most people my hair grew back super curly.  Around 5\" at the back and between 3.5\" and 4\" elsewhere.  Think Ronald McDonald with a mullett   not a good look. When I got to the salon they couldn't believe how curly my hair was and looked at it in wonder or was that despair?!  Anyway, the procedure took around 2 hours from start to finish and my afro turned into super straight hair.  So straight that my stylist couldn't cut it.  So they sent me off for an hour to do some shopping and after that I got my hair washed and styled.  It took around 5 minutes with the hair dryer to get super sleek hair.  However, at home I just wash and go my hair is straight at the top but has some curl at the bottom but it looks nice. I had the organic version which is suitable for pregnant women and children.  I know some versions you have to wait for 4 days before you can wash your hair but I only had to wait an hour.  I am very happy with the result.  Before the BB I was still wearing my wig to work as I hated my hair.  Now I am loving it. It lasts between 2 to 3 months but as I only wash my hair twice a week I am hoping it lasts for at least 3 months.  The only maintenance is to wash with a sulphate free shampoo. Hope that helps someone! Jules ",
      "MessageIndex": 6198,
      "PostDate": "04/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jules123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99134/profile",
      "Content": "Oct 5, 2010 04:43AM Jules123 wrote: Hi Goldie, Thanks for offering to post people's photos.  I'm a bit of a technophobe and cluess about this stuff so have sent you my before and after shots. That's really kind of you to offer to post them.  Thanks again. Julie",
      "MessageIndex": 6222,
      "PostDate": "05/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jules123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99134/profile",
      "Content": "Oct 4, 2010 08:20AM Jules123 wrote: Noda it's great isn't it?  It's given me so much more confidence.  Short curly hair for me wasn't a good look.",
      "MessageIndex": 6201,
      "PostDate": "04/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jules123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99134/profile",
      "Content": "Aug 22, 2010 01:33AM - edited Aug 22, 2010 01:37AM by Jules123 The treatment I'm getting is suitable for pregnant women and children and is formaldehyde free.  With the BB the hair is not left straight but frizz free but it cuts down on drying time and if you use a hair dryer leaves you with straight hair.  With the Japanese system your hair is permanetly straight.  It should last between 3-6 months.  Will write an update when I get it done.  I emailed a few salons and they told me even though my hair is quite short it should work fine.   I am hoping I can get something similar to the first hair style as I want to grow my hair long again I think this would look ok growing out (I hope).  http://modern-hairstyle.com/tag/charming-short-hair/",
      "MessageIndex": 5867,
      "PostDate": "22/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jules123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99134/profile",
      "Content": "Mar 8, 2011 11:52PM Jules123 wrote: I carried on wearing my wig for 9 months after my chemo had finished.  It got too uncomfortable though with my hair, the wig cap and then the wig on top of that.  I had really bad chemo curls so got an organic Brazilian Blow Dry back ini September which helped a lot.  15 months on from chemo I have got to a stage where I can finally tame my hair.  It's around 7 inches long now.",
      "MessageIndex": 8135,
      "PostDate": "08/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Jules123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99134/profile",
      "Content": "Mar 24, 2010 01:40AM Jules123 wrote: Hi Deanna, Thanks for the info, I will try Vitamin B.  Did your hair come back dry and brittle or didn't you experience that problem? Julie ",
      "MessageIndex": 2,
      "PostDate": "24/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750121",
      "Title": "Hair Growth & Supplements Jules123 Jules123"
    },
    {
      "AuthorID": "Jules123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99134/profile",
      "Content": "Mar 26, 2010 11:22PM Jules123 wrote: Deanna,  I will definitely try Biotin hopefully it will have good results for me too.  I know what you mean about the curls, already I can see mine forming.  Like you I am going to wait until my hair is a decent length and then get it cut into a style I like and blow dry it straight until then I'll be wearing the wig probably for another 6 months until I can use the hairdryer. Treadsoftly that is what put me off about horsetail it has nicotine in it, I  bought some over the week-end and my cat couldn't get enough of it, she kept sniffing the tablets.  She may be addicted Kim I'll try the Nioxin next month when I am back home in the UK, I'm currently working overseas and can't get hold o.  It was recommended by a friend as well so I shall try that.  Thanks everyone, wishing you all great hair! ",
      "MessageIndex": 7,
      "PostDate": "26/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750121",
      "Title": "Hair Growth & Supplements Jules123 Jules123"
    },
    {
      "AuthorID": "Jules123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99134/profile",
      "Content": "Jules123 wrote: Hi Everyone, I am 4 months post chemo and my hair is about 1.5 inches.  It is  brittle and dry and I was told horsetail supplements are worth considering.  I asked my oncologist if I am ok to go ahead and use them.  He didn't think there would be a problem as long as I don't take phytoestrogens and super vitamins.  Has anyone else tried this supplement and had good results? Julie IDC Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750121",
      "Title": "Hair Growth & Supplements Jules123 Jules123"
    }
  ]
}