{
  "AuthorID": "JuliaJazz",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
  "Posts": [
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 9, 2017 03:32PM JuliaJazz wrote: Just sharing how it is going four days after surgery.  I enjoyed my first night home and slept in a guest room with a lower bed I didn't have to climb into.  Used a wedge pillow to raise my head and a pillow under my knees.  Slept great.  Home health nurses yesterday and today have been very helpful.  My two drains are still draining quite a bit so they warned me that when I visit the surgeon on Thursday he probably won't remove the drains.  Maybe next Monday.  He may remove a few staples which he had to use after the hematoma on my right breast.  She said he sometimes like to remove every other staple and then the following week removes the rest.  Today I am learning about \"wings\".  These are little poufy places which have appeared on the center end of my incisions.  They are funny looking and apparently it can take a few months for them to flatten out.  I am going to go for knitted knockers or microbead forms which will be comfortable and not heavy.  Just something to give me a little shape when I leave the house.  I am very comfortable and not in pain.  Following orders to take it easy though.",
      "MessageIndex": 95,
      "PostDate": "09/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 15, 2017 02:14PM JuliaJazz wrote: You'll do great noodlesmom,.  It wasn't as bad as I feared.  The waiting is definitely the hardest part",
      "MessageIndex": 147,
      "PostDate": "15/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 1, 2017 10:21PM JuliaJazz wrote: Readytobedone, I agree you will feel a big difference in a week or two.  I am two weeks from my axillary lymph node dissection and a month from my BMX.  I feel great, just a little tightness in the chest and the underarm pain is almost gone too.  I got the last of my staples out today and got permission to go back in the pool for my water aerobics classes. Yeah!  I saw the oncologist today and learned that since my Mammaprint (a test of 70 genes) showed I was at high risk of recurrence, I will be having four chemo treatments, three weeks apart with a combination of Taxotere and Cytoxan. The first treatment will be June 23rd and the last will be toward the end of August.  I am so happy to be getting such good care.  My 5-year rate of survival with pills alone would be 75% and with the chemo it goes up to 88% so that is definitely worth doing. Hang in there all you other strong women, we can do this.",
      "MessageIndex": 261,
      "PostDate": "01/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 14, 2017 03:13PM - edited Jun 14, 2017 05:07PM by JuliaJazz TRalph, I had to go back in  just like you to have more lymph nodes removed.  I did not have to stay overnight, although it was 3 or 4 pm before I got out.  Hope your path report turns out like mine, no further lymph nodes involved.",
      "MessageIndex": 324,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 8, 2017 10:53PM JuliaJazz wrote: Sunnyjay, your surgery was two weeks after mine and I had no reconstruction, so those are two differences.  There are special free exercise classes here for cancer survivors. I wonder if there are any in your area. I would go if I didn't have my water aerobics. They would know how to modify the activities for where each person is in their journey. Keep on keeping on.",
      "MessageIndex": 390,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 9, 2017 02:06AM JuliaJazz wrote: Looking good MamaOz.  It is growing back for sure!",
      "MessageIndex": 392,
      "PostDate": "09/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 10, 2017 01:03AM JuliaJazz wrote: MamaOz.  Sounds perfect.  Happy swimming!",
      "MessageIndex": 395,
      "PostDate": "10/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 27, 2017 03:48AM JuliaJazz wrote: Keep us posted on how the radiation goes. MamaOz.  Fun to have hair growing back. Hope your hair holds on a bit longer for you Sunnyjay.  We are all doing well and taking it one step at a time.",
      "MessageIndex": 407,
      "PostDate": "27/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 16, 2017 02:52AM JuliaJazz wrote: I've been busy with my 94 year old Dad who was in hospital and now at rehab. He is confused in his new surroundings and does better when a family member is there.  I am thinking about all of you and always read your comments but won't have much time to reply until things get back to normal with him. I am just glad I am feeling well enough to be there for him.  Good wishes to all of you sisters.",
      "MessageIndex": 414,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 18, 2017 06:48PM - edited Sep 21, 2017 08:58AM by JuliaJazz Mama Oz, Good luck with returning home. So glad your house is still standing.  Maybe a little break in the radiation wasn't such a bag thing.  Give your skin a little time to heal. My parents are settled and attempting to spend from 4 pm to 11 pm each day without a helper.  If my dad should fall again they will be required to have 24 hour helpers for the rest of his life.  I see the oncologist Thursday and will start Arimidex then I believe.",
      "MessageIndex": 436,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 30, 2017 11:45AM JuliaJazz wrote: Ready2bedone. You area much closer to being done! You are brave to go through all those surgeries.  I have lost 60 lbs and want to lose another 25 or so but I don't think I will do surgery for that.  Just wear some garments that work for me.  I chose no reconstruction because I didn't want any more surgeries, as well as for other reasons.  I am doing just fine with my exterior fake boobs.  To each her own I guess.  Best wishes for a speedy recovery. ",
      "MessageIndex": 445,
      "PostDate": "30/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 8, 2017 02:05PM JuliaJazz wrote: Just wanted to report that I am home from BMX surgery on May 5th. The surgery went well and the sentinel lymph node was clear. I did have a few complications which caused me to spend three nights in the hospital instead of one.. A hematoma caused me to be put back under to drain that.  Possibly because of all of that blood loss I fainted when trying to get up and then the next morning developed AFIB - racing heartbeat - but they were able to knock that down with some meds via IV and now I will take them in pill form for a month to make sure the heartrate stays normal. Hopefully that will take care of that. The incision doesn't look nearly as bad as I thought.  (No reconstruction) and I have been in very little pain.  I have only taken Tylenol (partially so as not to interfere with the other meds I was taking - but really that was all I needed).  The drains are annoying.  They can cause a sharp pain when you move the wrong way but that is happening less frequently and I will have them out on Thursday in the surgeon's office.  After that I expect smooth sailing.  I will see the oncologist in a couple of weeks and see what further treatment is advised.  Probably tamoxifen at least. Good luck to the rest of you with surgeries coming up this month.",
      "MessageIndex": 85,
      "PostDate": "08/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 15, 2017 08:33AM JuliaJazz wrote: I also will have a second surgery, mine on Wednesday for axillary lymph node dissection because on a closer examination the sentinel node was cancerous.  I will probably have a port put in as well.  I will meet the oncologist and learn about that this afternoon.  Just when I'm feeling good I will have to recover again and I got off easy with my arms the first time and will probably have more rehab to do this time with the right arm.  Oh well, gotta  get through it.  I trust my docs.",
      "MessageIndex": 142,
      "PostDate": "15/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 25, 2017 02:27PM JuliaJazz wrote: Notverybrave, what a great description of how your breasts are feeling, post-surgery.  You captured it exactly.  I am sure these feelings will lessen in time but it is hard to be patient!.  On a positive note, my final drain came out today. eight days after my axillary lymph node surgery and I am feeling free as a bird.",
      "MessageIndex": 234,
      "PostDate": "25/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 20, 2017 03:11AM JuliaJazz wrote: Thank you MamaOz.  We can do this!  I've been doing water aerobics and my tightness is getting better.  More fun for me than  regular PT exercizes but those work too.  I have had a lot of improvement this week.. My surgery was a couple weeks before yours.",
      "MessageIndex": 352,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 30, 2017 01:24PM JuliaJazz wrote: MamaOz -We all need to b a weeny sometimes.  You get over it and go back to being brave.  My thoughts are with you.",
      "MessageIndex": 380,
      "PostDate": "30/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 4, 2017 12:15AM JuliaJazz wrote: Sunnyjay, I am two weeks more out from my surgery than you and almost all of my tightness in my armpit is gone.  So you have something to look forward to.  I didn't have reconstruction though, so that may add a little time, I have no idea.   Happy to report I just got back from the oncologist with an A+ report.  I have had very few side effects so was hoping my blood counts had behaved also.  I have a low platelet count normally ranging from 90 to 104. ( I just learned that on the first day of chemo.  If my docs had ever mentioned it before it certainly did not stick in my mind.) On day 1 my count then was 92 and so (with some trepidation) the doc went ahead with the planned TC treatment..  Today, day 10, my platelets were at 104, equal to the highest in my history at my primary care doctor.  My white blood cells had been at 7.8 (good) on day 1 and on day 10 today were at 12.7 so the Neulasta certainly did its job.  I did have mild anemia, hemoglobin is at 11.4 today, down from 12.0 on day 1.  Not too bad though.  Doc feels I should be good through all four treatments even if the levels drop some.  I asked her if any effects are cumulative.  She said I might have more fatigue.  I can live with that.  For now her instructions are to live normally for the next 11 days.  I don't need to avoid crowds or anything.  So I am thanking my lucky stars. My next infusion will be July 14th.  Hang in there everybody.  We are rocking this!",
      "MessageIndex": 383,
      "PostDate": "04/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 2, 2017 06:49AM JuliaJazz wrote: @herculesmul  Your advice is excellent.  A friend who is a survivor gave me the same advice when I told her and I have been doing well to following that so far.  I read and think about the next step (for me that is the upcoming surgery).  I don't read all about chemo until I find out whether or not I will need chemo for example.  I am staying pretty calm, sleeping well, etc. Blessings to all of you. ",
      "MessageIndex": 58,
      "PostDate": "02/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 3, 2017 07:39AM JuliaJazz wrote: Not crazy at all, Dee. I can't wait til mine on Friday. I'm really not anxious but raring to go. I'll be thinking of you tomorrow, Dee. ",
      "MessageIndex": 66,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 8, 2017 02:19PM - edited Jul 8, 2017 07:45PM by JuliaJazz Hi MamOz.  Yes thanks, my chemo went very well.  Round 2 is next week so I will hope for similar.  The swim poofies are easy to do.  You actually snip the tie that holds the poofie together.  Then it is a long tube of netting.   You roll up the tube tightly until it gets to the depth you want and then place into the  the tankini  bra cup - a few pins might help.  Then you hand sew it in.  Then you make another roll and place it next to the first and do the same until you fill the whole shape.  I think it is easier to make the first roll the deepest and place it in the center of the cup and then make slightly smaller ones going out. But it doesn't really matter.  On the suit pictured, I did one that way and one straight across.  You stitch the rolls to each other and to the edge when you get to it.  You will have smaller rolls than I did for my double D cup.  One large swim poofie should do the job, unless for some reason you need slightly more.  I have done four tankini tops. I do water aerobics 4 or 5 times a week. One top had a high neck and that was all I needed to do.  For the others I stitched in a modesty panel that covered the poofie material just to make it a little more comfortable and at the top the panel was sewn on to the shoulder straps at the right height that it gave me some more coverage if I bend over. In other words it was no longer a V neck but went straight across. I chose to have no reconstruction. Others probably wouldn't need that.  I hemmed the top of the piece of fabric before I sewed it in. If that doesn't make sense let me know. My hair is starting to release so the top of my head won't look like this for much longer.    ",
      "MessageIndex": 386,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 8, 2017 07:47PM JuliaJazz wrote: Two weeks since my chemo and as advertised, hair is definitely starting to come out.  I'm not stressing about it too much, thanks to the fine examples on these forums.  I had very thick hair to start with so it doesn't look to bad yet. I will keep it as is til it gets too thin and then get it cut to an inch for awhile.  Her is a pic of the pile of curly grey  ",
      "MessageIndex": 388,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 17, 2017 12:34AM - edited Jul 17, 2017 05:56PM by JuliaJazz Here is my new transitional haircut, short in back and a bit longer on top.  Haven't had bangs for 50 years. You can hardly see them in this picture because they are very wispy, but they are there. Just don't look at the top of the head where there is very little hair left.  I am having absolutely no symptoms at all with Round 2 of my chemo.  One dose of smooth move tea fixed me up with the constipation and I have had no bone pain and last time it had started by now.  So I guess it is a good thing I am losing my hair or I might think the drugs weren't doing their job.  Have a great week everyone.  ",
      "MessageIndex": 404,
      "PostDate": "17/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 8, 2017 05:39PM JuliaJazz wrote: Hay, MamaOz. Thanks for the shout out.  3rd chemo went OK.  Had some bone pain all day yesterday but it is gone now. I'll be thinking of you tomorrow.",
      "MessageIndex": 409,
      "PostDate": "08/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 23, 2017 11:56PM - edited Jun 24, 2017 02:18AM by JuliaJazz  My first chemo infusion (Taxotere and Cytoxan) went smoothly this afternoon  Three more to go!  We arrived for my one o'clock appointment and the nurse drew blood.  After awhile Dr. Eakle. my oncologist, came in and said they needed to draw it again because my platelets were low  While they did that she called my surgeons office who is a part of the Intercoastal Group and so could access my primary care physicians records for the last 12 years.  It turns out that for all that time I have had  low platelet count, usually ranging between 90 and 100.  Normal platelet count is 140. The second time they too mine it came up to 92.  My white blood cell count (my immune system) was very good. So the doc said we would go ahead.  However, during this first cycle we will watch my platelet count carefully and if it gets too low we may have to adjust the dose or timing or future treatments. The funniest thing was that I was icing my hands and feet and the insulated lunch bags that I thought would be waterproof, weren't, so my DH had to clean with paper towels periodically and at the end we wiped the floor with one of their blankets.  They are the right size for my hands and stand up, so I think I will just add a large Ziploc baggie inside them next time and put my hands in that.  The booties I bought for my feet worked well.   I feel fine this evening.  I had Varubbi, a very expensive anti-nausea drug and will take Zofran every twelve hours for the first three doses. I will save the Compazine for if I actually feel nauseous.  I will be taking measures to avoid constipation.  Now to make a baked potato for dinner.  ",
      "MessageIndex": 364,
      "PostDate": "23/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 24, 2017 04:34AM JuliaJazz wrote: Thanks Lord help me.  I am pushing the water, usually with some Crystal Light added.",
      "MessageIndex": 368,
      "PostDate": "24/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 28, 2017 03:16PM JuliaJazz wrote: Yes Mama Oz we are on different regimens.  Mine is Cytoxan (cyclophosphamide) and Taxotere (docetaxel) . I got off very easy.  I am feeling normal on day 6 and day 4 was really the only troublesome day with some bone pain. Days 3 and 5 I had a little discomfort but not much.  I have continued with my water aerobics classes and feel good. A nap now and then. I see you have finished your chemo.  Are you on any pills or anything?  Hope it is a beautiful day in the Keys.  It is here in Sarasota.",
      "MessageIndex": 375,
      "PostDate": "28/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Apr 28, 2017 07:15AM JuliaJazz wrote: I am having a double mastectomy on May 5th.  Lymph node biopsy will determine whether I need chemo after.  I have decided after talking with friends that I will not have reconstruction.  At my age, 68, I just want to get on with life and don't want to go through any more surgeries.  It is nice to connect with all of you. My best friend, a survivor, advised me to just worry about one step at a time so right now I am preparing for surgery.  After that I will think about questions for when I meet the oncologist.  One thing at a time is better for my mental equilibrium.",
      "MessageIndex": 39,
      "PostDate": "28/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 23, 2017 03:03AM JuliaJazz wrote: Thanks for the thoughts everyone.  My Dad is now out of rehab and back to assisted living with my mom, but he has some helpers to keep him safe as he recovers his strength.",
      "MessageIndex": 428,
      "PostDate": "23/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 26, 2017 03:09AM JuliaJazz wrote:    I am starting to think about my diet post chemo.  Before my diagnosis I had lost 60 lbs in 18 months on the Atkins diet.  I decided to give myself a little bit of a break and not be so strict during chemo but I will go back on during my Arimidex treatments which will start sometime in September I think.  The oncologist says the less adipose tissue you have the better and that is the diet that works for me AND there is no sugar which is a plus. Today DH and I closed down the infusion center so the nurses were the only ones to hear me ring the bell.  I iced my hands and feet for the final time - YAH!  Today I went au natural.  I still have enough hair to walk around with although I often wear a scarf or a turban.  My best wishes to all of you as you continue your treatments.  Know that I read all of your posts and keep you in my prayers even if I don't always have time to answer each one individually.  I am still very busy with my Dad, helping him adjust to having help 24 hours a day.  It is hard for him as he has always been very independent.   ",
      "MessageIndex": 431,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 24, 2017 11:34AM - edited Oct 24, 2017 07:56PM by JuliaJazz So far I am one of the lucky ones.  I chose no reconstruction to avoid any more procedures and make it easier to find any recurrences that should occur in the future. I am happy with my \"foobs\" (several varieties of fake boobs to wear on the outside). I will maybe have some plastic surgery to improve my \"dog ears\" on my sides in a year or so but I don't want to do anything else right now.  I am done with chemo and started on Arimidex.  So far, no side effects from that that I can discern. Not Very Brave, I am sure your docs will steer you through this.  We have to trust our docs, or if we don't, get new ones.  Sending you happy thoughts.  ",
      "MessageIndex": 441,
      "PostDate": "24/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 31, 2017 08:02AM JuliaJazz wrote: Hi MamaOz. So far the Arimidex is working fine.  I have no more stiffness than I did before from my arthritis.  Perhaps there will be cumulative effects, I don't know.  My bone density is very good.  I will have to watch the cholesterol.  Yes, I feel great.  I work out four times a week with vigorous water aerobics.  I do mine in the deep end so there will be no jarring on m knees.  I can do sixty jumping jacks in 60 seconds.  Our instructor is a triathlete and she has us doing tabata (interval training) which is a really good workout.  That pain in the ribs sounds like no fun.  I hope you can find a remedy for that.",
      "MessageIndex": 447,
      "PostDate": "31/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Nov 2, 2017 09:53AM JuliaJazz wrote: Great news, not very brave.  The waiting is so hard.  Now you cn heave a sigh of relief.",
      "MessageIndex": 450,
      "PostDate": "02/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 12, 2017 12:18PM JuliaJazz wrote: Studies show after 10 yrs women who went flat are just as happy.  I'm glad I did.   Wearing my fake blobs for the first time to go out to dinner tonight one week after surgery.  I am going to order a smaller size ...LOL.  This website helped me make my decision.  http://mastectomysolutions.com/why-choose-mastecomy.php I also downloaded a $3 ebook on this site calleeFacing Your Mastectomy and making reconstruction decisions  http://nancyspoint.com/ Good luck to you whatever you decide. I'm not sure yet if I need radiation but I will have chemo.",
      "MessageIndex": 126,
      "PostDate": "12/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 18, 2017 12:39AM JuliaJazz wrote: My axillary node dissection today went very well. Took about one and a half hours including installing a port for possible chemo.  Doc told my husband that the nodes looked clear but that was true last time as well and pathology later came back with a different result.  So we will patiently wait again!  I took one oxycodone when I got home and now am going go try cutting back to half a pill thru the night.  Everyone's pain threshold is different, so it is not a contest.  Take what you need.  I am babying my right arm and my husband is patiently waiting on me but I get up an down to the bathroom, etc. quite easily from my nest on the couch.  With a variety of pillow I have my arm raised and my neck supported.  Hope everyone else who had surgery today is doing well too.  Hang in there ladies who are still waiting.  Try to focus just on the next step and not worry about possibilities down the road.  That is the best advice I have been given and it is really helping me.",
      "MessageIndex": 179,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 18, 2017 10:18PM JuliaJazz wrote: sunnyjay, that happened to me.  I had gone home before the path report so went back in ten days later.  I guess it is a fairly common occurrence.  I hope to find out the results on Monday.  I'll be thinking of you as you wait for your results.  The procedure itself hasn't been as bad as expected.  I had them just go ahead an put a port in in case I need chemo because I didn't want to go back for a third surgery.",
      "MessageIndex": 193,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 30, 2017 02:58PM JuliaJazz wrote: FancyNancy, I wish you were going to the doctor today.  Maybe you should call their office.  Pain is normal with an axillary dissection but it should get gradually better. I would definitely call the office and let them know what is going on.  ",
      "MessageIndex": 250,
      "PostDate": "30/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 19, 2017 03:35PM JuliaJazz wrote: Sunnyjay. my diagnosis and recommendations very similar to yours but I had a test called a mammoprint which showed that my tumor was more aggressive rather than less aggressive.  My doc showed me a 5 year survival of 75% without the T&C chemo and 88% with it based on the test so that is a no brainer for me.  This test only shows 5 year survival rates. I am 68 but would prefer 20 more years. My parents are both in their 90s.  I figure the few months of chemo will be over soon and I will feel better knowing I did everything I could.",
      "MessageIndex": 346,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 27, 2017 12:58PM JuliaJazz wrote: sunnyjay, one of the places I looked was on the main site under chemotherapy.  At the bottom of the page they have a list of tips from community members for chemotherapy.  It is a PDF download.  Here is the webpage to look on:  http://www.breastcancer.org/treatment/chemotherapy.    I do not have  hematologist but if my platelet counts go down too low I guess I will have to get one.  I am hopeful they will go back to what is normal for me. I am feeling well on day 5.  Day 4 was the worst day for me with some bone pains.  I had my chemo Friday late afternoon and it was really three days later (Monday afternoon) that was the worst.  However it was quite bearable.  Maybe because I have pain in my hips and knees from arthritis I am used to this.  Anyway, the question was when I got up this morning on day 5, would it be worse or better and, lucky for me, the answer is better.  Best of luck to everyone as we move through this journey.",
      "MessageIndex": 371,
      "PostDate": "27/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 29, 2017 03:20PM JuliaJazz wrote: MAMAoZ, Those of you who go the full gamut are really brave.  I guess when we don't have much choice, we just put one foot in front of the other and find the strength we need.  Blessings to you.  I am glad your hair is starting to grow back. I haven't lost mine yet but I will.   Hang in there with that radiation.  I am lucky that I don't have to have that at this point.  Have  great day.",
      "MessageIndex": 378,
      "PostDate": "29/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 9, 2017 01:39AM JuliaJazz wrote: Well one down Mama Oz, hope it wasn't too painful. I am doing Cytoxen and Taxotere which doesn't seem to be as bad as that AC.Are you done with your chemo now?",
      "MessageIndex": 411,
      "PostDate": "09/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 18, 2017 04:24PM JuliaJazz wrote: Good luck with those rads Mama Oz.  Thinking of you.  My dad gets to go back to assisted living Monday night (with private helpers at first) and then things will settle down again for me.  Just in time for my final chemo next Friday.",
      "MessageIndex": 421,
      "PostDate": "18/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 26, 2017 01:25PM - edited Aug 26, 2017 01:31PM by JuliaJazz Thanks Hap B and Mama Oz. Thanks for the support. I am doing great.  And I am lucky that I have minimal side effects.  Especially no nausea and very minimal taste issues.  I started with (very expensive) varubbi and 3 does of zofran every 12 hours.  Time 2 and 3 I backed it up to Varubi and 2 doses of Zofran with still no nausea and this time I decided to try just Varubbi and one dose of Zofran.  Score!!! I completed avoided any constipation or taking anything for that other than a probiotic capsule. Here is an interesting article about anti-nausea drugs  https://www.fredhutch.org/en/news/center-news/2017/08/new-guidelines-take-aim-at-chemo-related-nausea.html Don't worry, I will be napping like crazy the next few days.  Next step will be a bone density scan before I start the Arimidex in a month or so.",
      "MessageIndex": 433,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 11, 2017 04:59AM JuliaJazz wrote: Congrats that your surgery is behind you stephilosphy.  That pain will lessen each day.  I hope you get to go home today.  Rest and heal,",
      "MessageIndex": 109,
      "PostDate": "11/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 13, 2017 03:34AM JuliaJazz wrote: dcdrogers and lordhelpme, I too had atypical cells in my good breast.  Just glad to be done with them and hoping the chemo will eradicate any stray cells.  We just have to do the best we can and follow our doc's advice.  ",
      "MessageIndex": 313,
      "PostDate": "13/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 13, 2017 03:07PM JuliaJazz wrote: MamaOz, I am five weeks out from surgery and feeling less tightness in arms.  Not doing PT but I do water aerobics here in Florida four times a week and my own exercises. One out of 11 nodes in my right arm.  Both underarms feel numb to the touch but not too sensitive.  I didn't get reconstruction either. Busy sewing rolled shower poofies in my tankini tops.  Have just completed the third one so I am fashionable in the pool. Starting chemo in ten days.  Good luck with your continued recovery.  ",
      "MessageIndex": 318,
      "PostDate": "13/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 19, 2017 10:33PM JuliaJazz wrote: Yes, LordHelpmetoo, I will be getting 4 TC, three weeks apart, starting this Friday.",
      "MessageIndex": 350,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 17, 2017 02:32AM JuliaJazz wrote: MamaOz, Thank you for your concern.  I think we will be able to move him back to assisted living with my mom on Tuesday with round the clock private sitters until he gets stronger.  Expensive but worth it for his mental health.  The other night he walked over to the other bed to give my mom a good night kiss but it was his roommate Bob in the bed.  The nighttime sitter intervened.  As you can imagine, Bob will be glad when my dad goes home too. I will not be needing radiation.  My last chemo is on August 25th and I start on Arimidex September 15th.   ",
      "MessageIndex": 417,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 19, 2017 02:24PM JuliaJazz wrote: Thinking of you Tralph.  Hope that infection heals up soon.  Thanks to everyone for the kind thoughts.  Too busy with my dad to write much but I read all your posts.",
      "MessageIndex": 425,
      "PostDate": "19/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 21, 2017 08:59AM JuliaJazz wrote: That is a bummer Mama Oz.  Hope you get things straightened out soon.",
      "MessageIndex": 438,
      "PostDate": "21/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 4, 2017 12:39PM JuliaJazz wrote: My friend who went through this said icing hands and feet helped her not to experience this.Also massage of feet with lotion.  Here is what my friend said:   \"If you use ice on your fingers and toes, you will minimize the damage, as it prevents the meds from getting that far, as you are numb and your blood won't circulate very well. It makes for a miserable six hours, but saves you months or years of collatoral damage. I ordered really expensive chemo gloves, which I used on my hands. I put my bare feet in a dishpan sized tub of ice water. I wrapped up in lots of blankets, and teh nurses were very kind about giving me warmed blankets. In addition to making you cold, it also makes it impossible to do anything for yourself while you chill. I always had a chemo buddy to keep me company, change the channel, feed me ice chips (to prevent mouth sores) and wait on me hand and foot.  I believe it was totally worth it. Many of my Pink Sisters have reported blackened nails, loss of nails, and very uncomfortable mouth sores. My oncologist always commented on how well I had done. The only damage I suffered was to my right big toe. It's been two years. It hasn't grown at all--but it hasn't fallen off, either. I think I got off easy.\" ",
      "MessageIndex": 42,
      "PostDate": "04/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 2, 2017 01:51PM JuliaJazz wrote: Tralph.  Your doctor should be able to give you some statistics.  My chemo drugs are different but I was given the statistics that in my case without the chemo and just with some pills for the hormone positive stuff my survival rate at 5 years was 75% and with the chemo it went up to 88%.  That was based on a mamoprint that showed my tumor was more aggressive rather than less aggressive.  But whatever your individual cirumstances, your oncologist should be able to share stats with you.  For me I will rest easier knowing I have thrown everything the doc recommends at the cancer.  ",
      "MessageIndex": 406,
      "PostDate": "02/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 2, 2017 06:24PM JuliaJazz wrote: Welcome T-Sue.  Sounds like you are doing great.  There is so much good info here--both in the articles on the regular site and in the forums. It is great that you are 1/3 of the way through your chemo.  We are glad to hear from you.",
      "MessageIndex": 409,
      "PostDate": "02/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 10, 2017 08:27AM JuliaJazz wrote: Susie I had my Neulasta device on my midriff off to one side a bit so it didn't stick out in front of me.  Worked great.  You are doing so great!  Keep on keeping on.",
      "MessageIndex": 483,
      "PostDate": "10/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 15, 2017 10:51AM JuliaJazz wrote: Kim, Love the scarf. I will have to try ending smaller pics too.  Hope that ice helps you.  Luckily I don't have so many taste issues so I just drink ice water with crystal light pink lemonade in it. You look great bald.  I have a classmate who came bald to our 45th college reunion but she is braver than I.  I will be using various hats and scarves.  And maybe the halo I bought.  I think a wig will be too hot and heavy in Florida but if I'm still bald in October I might get a free one from the cancer society.  If my hair is growing back rapidly, I'll probably just not bother. For all of you lovely ladies, I will report that I tried Smooth Move tea (made from senna leaves last night.  Can't remember who on here made that suggestion.  It worked great and seemed gentler than the sennekot tablet I had used during round one. Have a great weekend. ",
      "MessageIndex": 578,
      "PostDate": "15/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 17, 2017 08:48AM JuliaJazz wrote: T-Sue, you look beautiful.  Sounds like you have been able to arrange your summer so that your son is doing very well.  Cancer can sure put a crimp in our plans.  We would normally be on our sailboat in Wisconsin for three months to escape the Florida heat, but not this year. Here is my new transitional haircut, short in bsck and a bit longer on top.  Haven't had bang for 50 years. You can hardly see them in this picture, but they are there. Just don't look at the top of the head where there is very little hair left.  I am having absolutely no symptoms at all with Round 2 of my chemo.  One dose of smooth move tea fixed me up with the constipation and I have had no bone pain and last time it had started by now.  So I guess it is a good thing I am losing my hair or I might think the drugs weren't doing their job.  Have a great week everyone.   ",
      "MessageIndex": 592,
      "PostDate": "17/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 18, 2017 10:10PM JuliaJazz wrote: PeachyJeanne, why not get a synthetic wig free from the Amrican Cancere Society.  Their Look Good, Feel Better program  http://lookgoodfeelbetter.org/   has a make up session with about $200 of free makeup which might get you some of the glow I get from the Florida Sunshine all year round. I enjoyed the class but don't put the makeup on except for a special evening or something like that. At the end of the session most places have a room full of wigs they can help you try on.  You take it and most people bring it back when they are done for the next person to use.  OH, now I reread your post and see you signed up.  If you can't get in for the makeup session til September you might ask if you could stop by and check out the wigs sooner.  Not sure how often someone staffs the rooms. Thanks to all for the kind comments everyone.  I am not used to seeing my ears - lol.  But it is a lot better than the scraggly mess I had left on my head and I can get away without a hat for now which is good in the Florida heat.  I have some nice scarves and turbans if I want to dress it up a bit. ",
      "MessageIndex": 602,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 20, 2017 11:33AM JuliaJazz wrote: Beautiful Peahy Jeanne!",
      "MessageIndex": 627,
      "PostDate": "20/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 21, 2017 10:26AM - edited Jul 21, 2017 10:58PM by JuliaJazz Here is our Maine Coon Moxie on the sailboat a couple of years ago wearing her harness. She got a hairball stuck in her throat last year and nearly died so now he has to have a lion cut and most of her silver color gets cut off  leaving just her downy white undercoat except on her head. So I guess neither of us is known by our beautiful hair just at the moment.  At least mine will grow back.  Hers won't be allowed to.  She is still a beautiful creature though and good therapy for sure.  ",
      "MessageIndex": 641,
      "PostDate": "21/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 30, 2017 09:05AM JuliaJazz wrote: Looking good, Pink.  You are getting through it, girl.  I do icing during my Taxotere treatments.  It is reported to help with nails as well as with neuropathy. I have two more to go in August.  ",
      "MessageIndex": 731,
      "PostDate": "30/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 6, 2017 12:05AM JuliaJazz wrote: To avoid losing nails is also why I ice my hands and feet during my Taxotere  treatments.  It can also help prevent neuropathy.  My MO says do it if you want, it won't hurt anything - in other word she has seen no evidence -  but a survivor friend who did it herself had only one toenail which stopped growing but did not fall off and has seen others who did not do the icing not fare so well.  So far I have had no problems with discoloration or anything. Yes it is cold.  You ice 1/2 before you start the Taxotere (or Taxol) or other med that has these SE's and remove hands and feet from ice 20 or 30 minutes after the treatment ends.",
      "MessageIndex": 783,
      "PostDate": "06/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 6, 2017 01:38AM JuliaJazz wrote: Bravo, HapB.  It is always a good feeling to give back whether it is with cancer patients or in other areas of life that you are passionate about.  Here in Sarasota there are a lot of volunteers I have met along the way.  I am just not sure yet whether that is where my path lies when I am done with this.  I am already involved in other volunteer work that I love. Perhaps you can partner with an existing organization.  Have you checked out this website. They say they have organizations they have vetted.  One supposedly offers free housecleaning help.  I didn't look through it all though  http://www.bostoncancersupport.org/ It is not surprising you are burnt out on this go around.  It is my first round and I have 88% survival rate but I sure wish that were a bit higher.  I agree about the pink ribbons.",
      "MessageIndex": 784,
      "PostDate": "06/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 6, 2017 04:47AM JuliaJazz wrote: klt5817 - we are on the same path.  My last chemo is a week or so after yours.  As usual I will be the last one to leave the infusion center and only the nurses will help me ring the bell, but I will be glad to ring it anyway.  Thanks so much for sharing that article on Dr. Brodie.  I shared it on my facebook so others can read about her. HapB. Glad you liked the site I sent.  Good to explore what is out there.  Maybe you can even find some help for yourself but at least you can get a fuller picture of where the holes in service are. ",
      "MessageIndex": 787,
      "PostDate": "06/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 16, 2017 09:37PM JuliaJazz wrote: VivianLu8.  Hope things will go well for you. Some of us have found that taking Claritin for several days helps with the bone pain which actually seems to be from the Neulasta shot.  For me it wasn't too bad.  Happened on the evening of the third day (in other words a day after the Neulasta shot and lasted 36 hours.  I just took Tylenol and used a heating pad. ",
      "MessageIndex": 840,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 18, 2017 11:22AM JuliaJazz wrote: Pink, I did the icing on the advice of a friend who knew people who lost nails and to avoid neuropathy.  Might not be necessary but can't hurt.  She used a plastic tub and put her feet in there.  I used plastic booties that I got on amazon.  Yes it is cold but it is bearable.  And I used ziplock bags for my hands inserted in lunch bags that stood up.  I wore thin socks and thin gloves.  I just didn't want my skin  fingers directly touching the ice.  You can try it and stop if you find it totally unbearable. My friend said you should start a half hour before the infusion (wo while you are getting your premeds) and keep going for 20 - 30 minutes afterward. Good luck. ",
      "MessageIndex": 852,
      "PostDate": "18/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 22, 2017 08:41PM JuliaJazz wrote: Congrats, T-Sue.  Your smile says it all!",
      "MessageIndex": 886,
      "PostDate": "22/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 26, 2017 11:31AM JuliaJazz wrote: Thank you HapB for that great nutrition link.  There is a book on amazon in paperback for a couple of bucks by those folks that I decided to get as well but I love the myths debunked.  I am starting to think about my diet post chemo.  Before my diagnosis I had lost 60 lbs in 18 months on the Atkins diet.  I decided to give myself a little bit of a break and not be so strict during chemo but I will go back on during my Arimidex treatments which will start sometime in September I think.  The oncologist says the less adipose tissue you have the better and that is the diet that works for me AND there is no sugar which is a plus. Today DH and I closed down the infusion center so the nurses were the only ones to hear me ring the bell.  I iced my hands and feet for the final time - YAH!  Today I went au natural.  I still have enough hair to walk around with although I often wear a scarf or a turban.  My best wishes to all of you as you continue your treatments.  Know that I read all of your posts and keep you in my prayers even if I don't always have time to answer each one individually.  I am still very busy with my Dad, helping him adjust to having help 24 hours a day.  It is hard for him as he has always been very independent. t ",
      "MessageIndex": 921,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 27, 2017 05:13PM JuliaJazz wrote: Hhuey, not flooding in South Sarasota where I am.  Some flooding further north.  A friend of mine and her adult son are trying to drain her car engine of water right now.  I visited my parents and will take tomorrow off because that will be day 4  my bone pain day if the usual pattern applies.  Last time though and then on to Arimidex next month..",
      "MessageIndex": 942,
      "PostDate": "27/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 1, 2017 11:21AM - edited Sep 1, 2017 11:22AM by JuliaJazz Hap B check out this video.  Because I have a big head I chose the second shaper in the video. https://www.youtube.com/watch?v=KI8uAsGaYK8   You might do as well with the first one.  Shapers give the illusion of hair and include a velvet edge that keeps the scarf in place.",
      "MessageIndex": 968,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 3, 2017 12:52AM - edited Sep 3, 2017 12:52AM by JuliaJazz Have a wonderful party, MsLin.  I am sorry but I can't reply individually to everyone. Reading everything though. Still busy with my parents.I am reading a good book, After Breast Cancer;A Common-Sense Guide to Life After Treatment by Hester Hill Schnipper.  She is a social worker married to an oncologist.  She worked with breast cancer patients and then became one herself - twice.",
      "MessageIndex": 984,
      "PostDate": "03/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 6, 2017 12:27AM JuliaJazz wrote: Hi everybody, I agree with everything Kim said.  My husband and I are taking my parents and heading to Atlanta to stay with relatives and avoid hurricane Irma.  Hope to be online some but not everyday probably.  Stay well everybody!",
      "MessageIndex": 986,
      "PostDate": "06/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 27, 2017 11:59AM JuliaJazz wrote: Congrats, Kim.  That will be a great day.  I don't know about you but my oncologist wants me to keep my port for awhile.  I think it is a superstitious thing - if they take it out they will need it again.  I will play along for awhile but I may rebel at some point.",
      "MessageIndex": 1232,
      "PostDate": "27/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 27, 2017 11:25PM JuliaJazz wrote: Sounds like you have a plan, Peachy.  That should relieve the stress. You will do well I know.  Try to relax and enjoy the time you have before your surgery. Maybe you'll get lucky like I did and not need radiation.   Susie, a vacation from the chemo doesn't sound bad at all.  Round 8 will be the clean-up round.  Enjoy your break.",
      "MessageIndex": 1244,
      "PostDate": "27/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 31, 2017 11:34AM JuliaJazz wrote: For the several of you still making reconstruction decisions, every one of us is different and what is right for one person is not right for another.  I'm not trying to convert anyone to my way of thinking at all!  Just wanted to say that for me, I have been happy with no reconstruction.  I don't go \"flat\" really as I usually wear foobs \"fake boobs\" or external prostheses instead of internal ones. These help balance out my curvy hips. If I were really thin I could probably go flat in clothes and no one would notice. Each type of breast forms have advantages and disadvantages and I choose a different one depending on what I am doing that day. I have three types:#1 - knitted knockers  (weightless); #2 - foam ones slightly weighted which are very perky but feel a bit firm when someone hugs you (ABC First Form Weighed Style 926);  #3 - lightweight silicone ones (Anita Softtouch 1052X2) which are a bit heavier and sag and move a little bit when I walk around or if I lie down they flatten out as real ones would and in general look much more like the boobs of a 68 year old person. These forms are covered by insurance as are six bras a year (pocketed bras keep the forms in place.  I am going to cross post this on a discussion board where they talk about what bras and forms to choose but thought I would post it here to give you a sense of the reality of this decision.  I didn't want ANY additional surgeries and I like the fact that it would be easier to spot any recurrences (on the chest wall) without implants.  Best wishes to each of you in making the decision that is right for YOU.",
      "MessageIndex": 1257,
      "PostDate": "31/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 31, 2017 08:19PM JuliaJazz wrote: Pink, you are right about age having something to do with it.  If I were 30 I might have felt differently. T-Sue good luck on Friday. LilSuzQ, waiting is the hardest part. We will all be thinking about you.",
      "MessageIndex": 1262,
      "PostDate": "31/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Nov 10, 2017 11:20PM JuliaJazz wrote: PAULETTE, I believe these days the evidence shows that arimidex and others in the same class (I think they call them aromatase inhibitors) work better than tamoxifen for post-menopausal ladies.  So far I am having no side effects from that.  But if my be comultive.  I've only been on it for a moth.   Out on the sailboat this weekend traveling to South Seas Resort on Captiva to meet up with other boats.  Life is getting back to normal for my husband and me. Have a good weekend everyone.",
      "MessageIndex": 1310,
      "PostDate": "10/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Nov 19, 2017 02:00PM JuliaJazz wrote: Hugs for you Peachy and LTWJ.  You will both get through this!  ",
      "MessageIndex": 1336,
      "PostDate": "19/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Nov 29, 2017 10:42AM JuliaJazz wrote: Peachy and Kim, good to hear you are both doing well.  Hope things continue to settle down for you so you can enjoy the holidays. I had 25 women at my house today for a salad bar pot luck lunch and book club discussion  They bought flowers for me and all signed a card,  Nice gals.",
      "MessageIndex": 1353,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Dec 17, 2017 09:14PM JuliaJazz wrote: Thank you, Hershey Kiss.  You are so right, it is very sad, even though I know it is the right thing to do.  Julia",
      "MessageIndex": 1434,
      "PostDate": "17/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jan 10, 2018 12:11PM JuliaJazz wrote: KIm, so nice to hear from you.  My parents were very wise 12 years ago at age 80 and 83 to move to be near us.  It would be so hard to be far away. My dad acts like he is at a hotel too, asking loudly for more coffee.  Fortunately we have substituted alcohol wine for the real thing and he can't tell the difference so that helps. He is always worried about paying for things when it all goes on the bill.  His mind is good enough that when you explain things to him he can understand everything, but then he forgets.  He is understanding mostly that the memory care is his home now and is just glad that mother/and or I come to see him everyday.  It is more work for us and it is too bad he got kicked out of the other place because we had a pretty good plan in place there, but he did.  So we just do the best we can. Glad your port scar is healing better now. My doc said mine should heal to a fine white line. Keep us posted on what you learn about your diagnosis.",
      "MessageIndex": 1453,
      "PostDate": "10/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jan 22, 2018 07:32PM JuliaJazz wrote: Ladies  I can also relate to the bed head.  I have been googling that hair grows 5 inches a year so it will take me 2 years to get back to my old \"do\".  Much patience will be required.",
      "MessageIndex": 1473,
      "PostDate": "22/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Feb 16, 2018 12:40PM JuliaJazz wrote: Thinking about you Hap B.  Muddling is good enough.  Susie, October is something to look forward to for sure.  I'm vain too.  No photos on facebook yet.  Just here with my sisters.  What a nice community we have created.",
      "MessageIndex": 1523,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 6, 2018 10:07PM JuliaJazz wrote: Great to hear, Peachy! ",
      "MessageIndex": 1592,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 1, 2017 07:20AM JuliaJazz wrote: Another source for halo wigs is here  and they are VERY reasonable.  Your local American Cancer Society might even have one to borrow for free.  Mine did but it was blond and I neeed grey. http://www.tlcdirect.org/Hats-with-Hair-for-Cancer-and-Chemotherapy-Patients-Hair-for-Hats-American-Cancer-Society-TLC-Direct",
      "MessageIndex": 108,
      "PostDate": "01/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 30, 2017 01:25AM JuliaJazz wrote: Tassie, thanks for your hair loss report.  I lost most of my hair during week 3 of my first round. but am now starting week 3 of second round and not noticing much more hair loss.  Maybe I'll keep what I have.  I can even get away without a hat if I want although it is very thin. TKDBOB - hope your wife feels better now that she is home and can rest.  I bet when she gets rid of some of those fluids she should feel stronger.  Maybe she should use a cane or walker until she does though.  You don't say what chemo drugs she is on but everyone is different.  I am sure the docs won't go ahead with round two until she is doing better.  We are all thinking of you and her.  You can search this website and maybe find some remedies for thrush. Good luck.",
      "MessageIndex": 144,
      "PostDate": "30/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 17, 2018 04:13PM JuliaJazz wrote: Hi emac.  I went through four rounds of Cytoxan/taxotere with no problems.  My hair is growing back just fine.  It takes awhile.  I chose not do do wigs but wrapped my head with beautiful scarves from wrapunzel.com.  My eyebrows were the last to go - thinned out dramatically and I am told they are often slow to come back or may never come back to quite their luxuriant previous status.  I use makeup at present.  There are some nice ones to fill in my brows and no one notices.  I am thinking of having microblading done. I had no neuropathy.  I did choose to ice my hands and feet which anecdotally seems to help with that and with any issues with finger and toenails.  I had not problems at all with feet or hands. The chemo itself was not as bad as expected as far as side effects.  The meds they have these days help quite a bit.  Taking Claritin for a few days helps with the bone pain from the Neulasta.  Day three I usually had some pain from that and sometimes curled up with a hot pad but other days were fine.  If you can take a day off now and then on those couple of tough days,it will help but I suppose you could work through it you had to. If you go back and read through this thread you can probably find more stories from other ladies.",
      "MessageIndex": 188,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 9, 2017 11:57AM JuliaJazz wrote: Lots of prayers coming your way TexasJ.  You are right that we take what life hands us. I am glad your doctor is going to fight for you. Sometimes amazing things can happen. Take it one day at a time.",
      "MessageIndex": 111,
      "PostDate": "09/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 19, 2017 09:28AM JuliaJazz wrote: You gal are all very inspiring.  Sorry I haven't had time to reply to each post but I am reading them.  I try to post if I have something to say that no one else has said.  We all handle the chemo differently and we will see how I do, but no matter what, I will get through it!",
      "MessageIndex": 228,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 20, 2017 10:31PM JuliaJazz wrote: Piink, went to a Look Good Feel better presentation at the ACS and the wig seemed too small for me.  I have a giant head.  They have free wigs though so I may go back when my hair falls out and try again.  It just gives you another option.  In the meantime I ordered a halo (they had a blond one there that I tried on (which is a circle of hair-- bangs and some in back--with nothing on top.  That fit me so I ordered one from tlcdirect.org     Once on their website look at the categories on the left and choose \"hair for hats\".  I got the short curly one in light frosted gray and they only cost $32.  It will look great with either a hat or scarf. SpeedyTeach, thanks for explaining how the Neulasta works.  I was wondering about that and forgot to ask my doc. Glad to hear you only had a few bad days after the infusion.",
      "MessageIndex": 242,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 26, 2017 10:24AM JuliaJazz wrote: Ciaci, We'll all be sending lots of positive vibes your way.  Hang in there girl!",
      "MessageIndex": 312,
      "PostDate": "26/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 16, 2017 08:37AM JuliaJazz wrote: Kim, I was thinking the same thing about picking out the hat first.  Too funny.  Have a great Sunday.",
      "MessageIndex": 585,
      "PostDate": "16/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 17, 2017 04:36AM JuliaJazz wrote: hhuey.  Bought the boots on amazon> let my fingers do the walking as usual.  Here is the link.  https://www.amazon.com/gp/product/B017CB29XK/ref=oh_aui_detailpage_o06_s00?ie=UTF8&psc=1",
      "MessageIndex": 590,
      "PostDate": "17/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 4, 2017 06:45PM JuliaJazz wrote:",
      "MessageIndex": 774,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 5, 2017 08:22AM - edited Aug 5, 2017 08:39AM by JuliaJazz Having trouble posting so I broke it up.  I also wanted to report that I completed  chemo number 3 out of 4 (Cytoxan/Taxotere).  I had a sore throat and went to my internist for an antibiotic.  It has been painful the last three days but seems to be getting better today.  My bloodwork was good so the MO said to go ahead.  Hopefully I will be lucky and have minimal side effects again.  I do seem to be a little more tired as the treatments go on.  Naps are a good thing. I have had a sore throat the past few days.  Not strep.  Got an antibiotic from my internist and my bloodwork was good so MO said to go ahead. I asked today about what comes next.  I knew I would be having a hormone blocker but hadn't asked which one.  I found out it will be Arimidex.  Makes perfect sense when I read on this site: The ATAC study found that 5 years of Arimidex is better than 5 years of tamoxifen as the first hormonal therapy for postmenopausal women with early-stage, hormone-receptor-positive breast cancer. Arimidex is better than tamoxifen for: Have a great weekend everyone. ",
      "MessageIndex": 776,
      "PostDate": "05/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 23, 2017 11:31AM JuliaJazz wrote: Feel better soon, Peachy! ",
      "MessageIndex": 896,
      "PostDate": "23/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 26, 2017 02:52PM JuliaJazz wrote: Love those socks, Kim.  Enjoy your friend's visit.",
      "MessageIndex": 931,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 26, 2017 10:40PM JuliaJazz wrote: My goodness, what a week.  So glad you are OK Susie .  and Hap B I am really impressed  I am behind schedule around here but this is my week to rest up, at least for a couple of days.  We are having lots of rain in Florida, but at least we aren't in Texas.",
      "MessageIndex": 938,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 1, 2017 10:49AM JuliaJazz wrote: ",
      "MessageIndex": 967,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 2, 2017 10:43AM JuliaJazz wrote: Yes, Peachy, it is indeed a new world.  I think many of the women wrap for religious reasons but I like the look.  There are so many variations to try.  And I find them very comfortable. Yea for your last Neulasta shot.  I certainly was glad to have my last one a week ago.  No big plan for DH and me this weekend just a lot of little projects we can work on.  Happy Laboar Day everyone.",
      "MessageIndex": 976,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 6, 2017 06:14PM JuliaJazz wrote: Hhuey.  Enjoy those sporting events.  Ah, fall in Florida.  Takes me back to old times watching my son.  Now he is 36 and we are going to see the house in Orlando he and his wife just bought.  Time flies.  Enjoy every day. Still no hair growing back but I am getting quite the scarf wardrobe. Have a great weekend everyone!   ",
      "MessageIndex": 1168,
      "PostDate": "06/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 25, 2017 03:13PM JuliaJazz wrote: Thanks, Denise, for posting about your chemo meds.  If you go into your profile you can put in your diagnosis and any treatments and they show up at the bottom of your posts. Perfectly OK if you don't want to do this but it makes it easier for people to think - that applies to me because I have a similar diagnosis or the same chemo meds.",
      "MessageIndex": 295,
      "PostDate": "25/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 25, 2017 06:04PM JuliaJazz wrote: I forgot to say that I was given a sheet from the FDA about Taxotere that says it is given in alcohol and you should consider the alcohol content on your ability to drive one to two hours after the infusion.  I had my Cytoxin infusion afterwards and slowed it down to 40 minutes to avoid headache and then had to check out and so forth so I think I could have driven, although my husband did.  But it is something to think about and not something I was told ahead of time. ",
      "MessageIndex": 299,
      "PostDate": "25/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 25, 2017 09:57PM JuliaJazz wrote: Wendeez, I am not sure what meds you will be given.  I had Taxotere and Cytoxan.  If yours are different you need to ask others who had those. I haven't felt bad at all.  I had no nausea at all.  I took Varubbi just before I started the procedure.  It was very expensive but recommended by the doc.  I took Zofran that night and the next morning and the next night.  I am off that now.    The first two days after I felt pretty normal.  Today is the third day and I napped a little more and have some mild pain in my legs but I have arthritis anyway so it doesn't feel much worse.  Lots of people say day 4 is the worst so perhaps I will have a bit more pain tomorrow.  I got a heating pad in case I need that but so far I haven't.   The procedure itself went well.  I had Neulasta Pro that was applied there and went off 27 hours later.  If you have more questions, just write again.",
      "MessageIndex": 304,
      "PostDate": "25/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 4, 2017 09:15PM JuliaJazz wrote: Gorgeous for sure, both of you.",
      "MessageIndex": 427,
      "PostDate": "04/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Nov 30, 2017 02:05AM JuliaJazz wrote: Prayers for healing HapB.  We are all thinking of you.",
      "MessageIndex": 1354,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Dec 3, 2017 07:37PM JuliaJazz wrote: Peachy and Kim, It takes a long time for that lumpiness and sensitivity under your arm to go away.  But it does. It's hard to be patient. I don't have any pain or tingling now.  A little tightness - I have to keep up the stretching.    I will probably see a plastic surgeon in the fall for some minor clean up work - dog ears and extra skin in area of lymph node removal.  Still not planning on reconstruction.  ",
      "MessageIndex": 1380,
      "PostDate": "03/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Dec 7, 2017 04:47PM JuliaJazz wrote: Kim, Sorry to hear that.  So glad they took all the nodes.  Your attitude is going to help you.  We have to take it one day at a a time to beat this BEAST. I will be thinking of you. Keep us posted on how the rads go..",
      "MessageIndex": 1394,
      "PostDate": "07/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jan 6, 2018 11:30AM JuliaJazz wrote: And this one is good for some new year's resolutions  https://www.lisaschwartzmd.com/p/myth-7-lifestyle-changes",
      "MessageIndex": 1445,
      "PostDate": "06/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 14, 2017 03:13AM JuliaJazz wrote: hhuey, I like your cap a lot.  The view from Moffit is nice too.  Congrats on getting #4 out of the way. I have one like It that I wear for sleeping and I could certainly wear around town as well but I have some pretty scarves and turbans too.  I may never bother with getting a full size wig. I will post more fashion photos as my style sense develops.  Maybe they will help someone else down the road.",
      "MessageIndex": 541,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jan 12, 2018 08:11AM JuliaJazz wrote: Yesterday I went to my first caregivers support meet up.  A friend started it.  I think it is really going to be helpful for me to have somewhere to talk about all these feelings that come up around dealing with my parents and stress relieving. At my oncologist yesterday they explained my bloodwork to me which included tumor markers for the first time.  They tested for two of these and both were within the normal range.  They said not to look at how close to the top of the range one of my markers was but to find over the next few visits (usually every 3 months) to find what MY range is (it will vary a little bit) and then only to worry if they start spiking up over that range.  Very interesting indeed.  We are lucky.  I bet they didn't have all this knowledge in the 70s when my husband's mother died of breast cancer.  Knowledge is power. All of you who are still dealing with treatment are inspiring me with the way you are keeping on keeping on.  You go. girls!",
      "MessageIndex": 1460,
      "PostDate": "12/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jan 17, 2018 05:20PM JuliaJazz wrote: Glad you found the article helpful, Kim.  I love Nancy's blog.  She has some very insightful posts. She has a facebook page as well.  I am thinking of you with those rad treatments.  You are a warrior! I didn't have an Onco score but I had a mammoprint which did give me a percentage for recurrence at 5 years - which is pretty low - but not 0.  So we all have to do the best we can to kick this thing.  Sounds like you are doing just that.",
      "MessageIndex": 1463,
      "PostDate": "17/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jan 23, 2018 08:41AM JuliaJazz wrote: Kim and Peach and all, , here is a short article I enjoyed about growing out hair https://www.bustle.com/articles/118731-7-hair-hacks-for-growing-out-short-hair-when-it-seems-impossible ",
      "MessageIndex": 1475,
      "PostDate": "23/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jan 24, 2018 09:14PM - edited Jan 25, 2018 09:47AM by JuliaJazz I agree that many of us may take longer than a year to see 5 inches. Five months after my last infusion. mine is about 3/4 of an inch but my receding hairline is showing and I was mistaken for a man when I went out without scarf/turban and earrings.  Some days I do my own hair,but if I want to look really nice, I still do the turban. Patience is called for with my eyebrows as well.  Still drawing those on , although I think they are filling in a little. Hugs to all.",
      "MessageIndex": 1483,
      "PostDate": "24/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Feb 14, 2018 02:08PM JuliaJazz wrote: Peachy, I forget. Where do your parents live in Florida?  It is beautiful down here right now. Glad your nose is better. Susie.Your hair is longer than mine and it's been almost six months since my last chemo,  Patience I guess until my fuzz grows out.  I still wear my turbans when I get dressed up but go without in the daytime.  My receding hairline is showing though and I don't like that.  I'll be having the back and sides trimmed while the top grows out. Still painting my eyebrows too. Sending good vibes to all of you June Chemo sisters.  ",
      "MessageIndex": 1521,
      "PostDate": "14/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Feb 27, 2018 12:23PM JuliaJazz wrote: Beautiful, Kim.  Have a great week, ladies.  I am heading to Colorado with my skiing husband who is meeting some classmates from college days (50 years ago).  I will get a vacation from my cat who wakes me all night (long story) and from my daily visits to my parents.  I have hired someone to take my mom to see my dad every other day. It will be good to relax a bit.  Good to see friends I haven't seen since before my life took a little detour.",
      "MessageIndex": 1537,
      "PostDate": "27/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 30, 2017 02:15PM JuliaJazz wrote: So glad to hear you are feeling better MsLin.  It's a rainy day here in Florida.  Hope everyone is enjoying their weekend.",
      "MessageIndex": 740,
      "PostDate": "30/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 1, 2017 05:07PM JuliaJazz wrote: Looking good, Curly, hang in there!",
      "MessageIndex": 753,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 15, 2017 09:51PM JuliaJazz wrote: I've been busy with my 94 year old Dad who was in hospital and now at rehab. He is confused in his new surroundings and does better when a family member is there.  I am thinking about all of you and always read your comments but won't have much time to reply until things get back to normal with him. I am just glad I am feeling well enough to be there for him.  Good wishes to all of you sisters.",
      "MessageIndex": 832,
      "PostDate": "15/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 25, 2017 07:38AM JuliaJazz wrote: PInk,  had a terrible sore throat too and then I got a lot of phlegm in my chest that I was coughing up.  Probably a bronchial infection so I got some antibiotics.  Hope your sore throat resolves soon and the taste issues as well.  I am finally better, just in time for my final chemo.",
      "MessageIndex": 904,
      "PostDate": "25/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 26, 2017 11:40AM JuliaJazz wrote: PS  - Did you see this link about nausea.  I have had none with my expensive meds.  https://www.fredhutch.org/en/news/center-news/2017/08/new-guidelines-take-aim-at-chemo-related-nausea.html ",
      "MessageIndex": 922,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 1, 2017 09:55PM JuliaJazz wrote: MsLin, yes now I remember it was you who posted about it. My chemo brain couldn't recall that. Thanks for the tip.  I bought another scarf yesterday.  Too much fun.  I think I will use them on bad hair days even when I have hair again.",
      "MessageIndex": 970,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 2, 2017 08:11AM JuliaJazz wrote: Wonderful news Hhuey.  Have a great weekend everyone.",
      "MessageIndex": 974,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 5, 2018 02:11AM JuliaJazz wrote: My doc seems to think 10 years is the coming thing so don't be surprised if after 5 years you find you are going to be extending.  I guess it will depend on what the research is saying at that time.  Good thing I have giant bones.",
      "MessageIndex": 1589,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Dec 5, 2018 01:54AM JuliaJazz wrote: How nice to hear from several folks in November and December and great to hear that all are doing well.  So glad to hear that you will finish your treatments this month, Peachy. I am hoping to have a knee replacement this winter but otherwise am in good shape.  Had my eyebrows done (hybrid brows). They need a touch up every year but I may be able to get more of my own to grow back using RevitaBrow and so need less touching up.  I am glad to see myself when looking in the mirror.  Not many problems with the Arimidex, thank heavens. I will post a recent pic so you can see my eyebrows.  I got used to my shorter hair and am keeping it. Happy holidays to all.  ",
      "MessageIndex": 1610,
      "PostDate": "05/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 3, 2017 06:12AM JuliaJazz wrote: Beautiful pic, Pink.  Thanks for sharing. Hopefully the side effects won't seem so bad knowing it's the last time.",
      "MessageIndex": 1140,
      "PostDate": "03/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 16, 2017 03:12PM JuliaJazz wrote: Thanks, Pink, I had those watery eyes and even gummy for awhile, but it finally went away.  I agree with you, Hap is my hero.  She just keeps on keepin' on.",
      "MessageIndex": 1195,
      "PostDate": "16/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 16, 2017 03:14PM JuliaJazz wrote: Thanks HersheyKiss,  The scarf is from wrapunzel.com",
      "MessageIndex": 1196,
      "PostDate": "16/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Nov 5, 2017 08:25AM JuliaJazz wrote: Paulette and pink.  Have you tried wrapping your head.  I like the scarves at wrapunzel.com.  I bought a shaper with a velvet headband that keeps my scarves in place and has a pouf on the top to give me a little volume. There are videos on you tube of how to wrap them.  ",
      "MessageIndex": 1281,
      "PostDate": "05/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Nov 26, 2017 12:56AM JuliaJazz wrote: Hip, hip hooray, Pink!",
      "MessageIndex": 1348,
      "PostDate": "26/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Dec 2, 2017 03:55AM JuliaJazz wrote: Happy birthday LTWJ.  Great to hear you are doing so well and so glad to hear you have a new doctor.",
      "MessageIndex": 1363,
      "PostDate": "02/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Dec 3, 2017 01:19PM JuliaJazz wrote: Congrats on getting thru your surgery, hhuey.  That is terrific that your nodes were clear.  Overwhelming for sure but as you heal, you will feel better and better and get out and about and back to your old activities.  For now, rest, rest, rest, and do some gentle stretching for your arms.  Probably they gave you a booklet about that.  Don't overdo though until the bleeding slows down in your drains.  We'll all be sending positive thoughts.",
      "MessageIndex": 1376,
      "PostDate": "03/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Dec 4, 2017 10:15AM JuliaJazz wrote: Kim, I think that super sharp pain is from the drain being pulled.  It happened to me sometimes too.  One day at a time.",
      "MessageIndex": 1383,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Dec 17, 2017 05:07PM JuliaJazz wrote: Kim, so glad you are feeling better today. Susie, my port was removed in an outpatient clinic with light sedation. I am feeling well but dealing with moving my dad to memory care while my mom remains in assisted living  He i exhibiting some behaviors that they are better equipped to deal with.  I think it will be a very challenging transition.  Just how I wanted to spend the holidays.  But I think once he settles down he will be in the right place.  I may not be on here much. Happy holidays to all.",
      "MessageIndex": 1432,
      "PostDate": "17/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jan 19, 2018 11:55AM JuliaJazz wrote: Hope everyone has a good weekend.  Following all your posts but too busy to reply individually at this time and don't have anything too important to say except that I am thinking of you gals.",
      "MessageIndex": 1469,
      "PostDate": "19/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Mar 18, 2018 11:39AM JuliaJazz wrote: Peachy, have a great visit with your folks.  Tr y to take care of yourself and get rid of that cold so you don't give it to your dad.",
      "MessageIndex": 1554,
      "PostDate": "18/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Mar 22, 2018 11:38AM JuliaJazz wrote: They just measure your arms in about 10 places.  Sometimes they have one in stock or in some cases they have to order a custom one.",
      "MessageIndex": 1559,
      "PostDate": "22/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Apr 8, 2018 03:42AM JuliaJazz wrote: Glad to get an update, Peachy.  Glad to hear your dad is doing better and you are down to just the two drugs. That is progress! Looking great!",
      "MessageIndex": 1564,
      "PostDate": "08/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Apr 22, 2018 02:42AM JuliaJazz wrote: Take care, Susie.  Hopefully those heart issues won't turn out to be too serious. Hope some spring weather will be coming soon.  You hae a good attitude and you will get through this.  Happy spring to all my June chemo sisters.",
      "MessageIndex": 1570,
      "PostDate": "22/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 24, 2018 10:49PM JuliaJazz wrote: Great news, Peachy. So glad to hear your side effects are minimal too.  You got this! We are now in Wisconsin where we spend the summer living on our sailboat.  it is great to be back after missing last year but I do miss seeing my parents everyday. They are receiving good care and we hired a driver to take my mom to see my dad four fays a week.  Still, it is harder to be gone now that they are separated (my dad in memory care).",
      "MessageIndex": 1598,
      "PostDate": "24/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 1, 2017 02:20AM JuliaJazz wrote: Irwells I too have been very fortunate.  Some bone pain on days 3 and 4 and I am retired but could have worked if I had too.  Really very few other symptoms.  A little constipation the first few days.  Hope I continue to do as well as you.",
      "MessageIndex": 103,
      "PostDate": "01/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 8, 2017 07:49AM JuliaJazz wrote: Two weeks since my chemo and as advertised, hair is definitely starting to come out.  I'm not stressing about it too much, thanks to the fine examples on these forums.  I had very thick hair to start with so it doesn't look to bad yet. I will keep it as is til it gets too thin and then get it cut to an inch for awhile.  Her is a pic of the pile of curly grey hair after my shampoo.  Have a great weekend everyone.  ",
      "MessageIndex": 120,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 13, 2017 04:49AM JuliaJazz wrote: Congrats Leesa D and good luck with the radiation.",
      "MessageIndex": 122,
      "PostDate": "13/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 15, 2017 05:13AM JuliaJazz wrote: Here is a pic of me at chemo #2 today.  You can see that I am icing my hands and feet.  My brother accompanied me as my husband is recovering from shoulder surgery.  Here's hoping side effects are as minimal as last time.",
      "MessageIndex": 126,
      "PostDate": "15/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 22, 2017 03:16PM JuliaJazz wrote: Irwells, yes put those legs above your heart and the swelling will go down.  I have that for the first week after the infusion.",
      "MessageIndex": 134,
      "PostDate": "22/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 30, 2017 03:10PM JuliaJazz wrote: TDK BOB - Everyone is different.  A friend of mine had a terrible reaction to the Neulasta shot and they switched her to five injections that she gave herself for five days.  I have been lucky and my bone pain has been minimal with the Claritin. Take care..",
      "MessageIndex": 148,
      "PostDate": "30/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 25, 2017 03:08PM JuliaJazz wrote:  Sutherngirl - Hope that swelling clears up.  I wonder if you might try acupuncture???  I am starting to think about my diet post chemo.  Before my diagnosis I had lost 60 lbs in 18 months on the Atkins diet.  I decided to give myself a little bit of a break and not be so strict during chemo but I will go back on during my Arimidex treatments which will start sometime in September I think.  The oncologist says the less adipose tissue you have the better and that is the diet that works for me AND there is no sugar which is a plus. Today DH and I closed down the infusion center so the nurses were the only ones to hear me ring the bell.  I iced my hands and feet for the final time - YAH!  Today I went au naturelle with the hair.  I still have enough hair to walk around with although I often wear a scarf or a turban.  My best wishes to all of you as you continue your treatments.  Know that I read all of your posts and keep you in my prayers even if I don't always have time to answer each one individually.  I am still very busy with my Dad, helping him adjust to having help 24 hours a day.  It is hard for him as he has always been very independent.   ",
      "MessageIndex": 161,
      "PostDate": "25/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 3, 2017 09:57PM JuliaJazz wrote: Hello everyone, I am starting adjuvant chemo on June 23rd, 4 rounds of Taxotere and Cytoxan every three weeks so I should be finished in late August.  I have a good friend who went through it about two years ago so she has been giving me good advice including the icing for the hands and feet.  I thank all of you for all of the tips. It is good not to feel alone.",
      "MessageIndex": 37,
      "PostDate": "03/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 24, 2017 08:25AM - edited Jun 24, 2017 10:49AM by JuliaJazz My first chemo infusion (Taxotere and Cytoxan) went smoothly this afternoon  Three more to go!  We arrived for my one o'clock appointment and the nurse drew blood.  After awhile Dr. Eakle. my oncologist, came in and said they needed to draw it again because my platelets were low  While they did that she called my surgeons office who is a part of the Intercoastal Group and so could access my primary care physicians records for the last 12 years.  It turns out that for all that time I have had  low platelet count, usually ranging between 90 and 100.  Normal platelet count is 140. The second time they too mine it came up to 92.  My white blood cell count (my immune system) was very good. So the doc said we would go ahead.  However, during this first cycle we will watch my platelet count carefully and if it gets too low we may have to adjust the dose or timing or future treatments. The funniest thing was that I was icing my hands and feet and the insulated lunch bags that I thought would be waterproof, weren't, so my DH had to clean with paper towels periodically and at the end we wiped the floor with one of their blankets.  They are the right size for my hands and stand up, so I think I will just add a large Ziploc baggie inside them next time and put my hands in that.  The booties I bought for my feet worked well.   I feel fine this evening.  I had Varubbi, a very expensive anti-nausea drug and will take Zofran every twelve hours for the first three doses. I will save the Compazine for if I actually feel nauseous.  I will be taking measures to avoid constipation.  Now to make a baked potato for dinner.  Tralph.  Good luck to you on Wednesday.",
      "MessageIndex": 266,
      "PostDate": "24/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 24, 2017 09:17PM JuliaJazz wrote: My best to all this morning.  I am sorry I don't have the mental clarity to reply to each one of you.  I always reply if I think I have something important to add that others have not said.I slept well last night.  We will see what happens when the Neulasta starts to kick in tonight but I am feeling fine today.   KimPossible thanks for the banana tip.  I bought some prunes but I will get some bananas too.  I have some Miralax for when I decide to go off the Senna. Hope your white blood count goes up quickly. Have a wonderful time with your BFF.",
      "MessageIndex": 271,
      "PostDate": "24/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 24, 2017 03:17PM JuliaJazz wrote: Pink --they can fit you better for a wig when you have already lost your hair so it is a good pick me up. Glad you are doing so well on day 9.  We are getting different meds though, so I can't generalize. I don't really know the answer to your question.  I think it probably varies a lot.  Best to ask your doc.",
      "MessageIndex": 282,
      "PostDate": "24/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 13, 2017 09:26AM JuliaJazz wrote: Fun to hear everyone's story.  My husband is from Montana and I am from the Midwest.  We met in college back on the east coast. We have been married 47 years, living lots of places including Naples, Italy, but home base was Toledo, Ohio where the company he worked for was headquartered.  12 years ago we retired and sailed our 44 ft sailboat from Ohio to Florida, checking out retirement places along the way.  We settled on Sarasota, Florida, which was a great choice.  Our 36 year old son and his wife live in Orlando about two hours away. Another 1/3 of my hair fell out when I washed it today, that leaves the final 1/3 on my head.  Doesn't look too strange yet but I will soon be entering the land of hats and scarves.  2nd chemo on Friday. ",
      "MessageIndex": 532,
      "PostDate": "13/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 14, 2017 12:57AM JuliaJazz wrote: Hhuey for sure it's too hot to garden in Florida this time of year.  Water aerobics is my thing.   Love hearing from everyone.  What a great bunch. Here is me in my transitional hat with sunglasses sticking out. I am sure when the final 1/3 of my hair goes, I will graduate to scarves and turbans.  Bought a halo wig to try.  Not sure I want to wear a heavy wig in the Florida heat although I may go to the cancer society and get one.  ",
      "MessageIndex": 538,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 14, 2017 12:30PM JuliaJazz wrote: LilSuzyq - My curly hair did the same thing - the birds nest at the bottom.  Too funny.  Your wig is very pretty.  Susi2017 - You look beautiful either way.  All of you are looking great.  Heading off to treatment #2 now.  More later.",
      "MessageIndex": 567,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 14, 2017 11:11PM JuliaJazz wrote: Round #2 went well today.  My brother accompanied me (as my husband is recovering from shoulder surgery).  He took a pic of me with my prayer shawl (sent by his daughter), my blankiegram  healing blanket sent by a local friend and my soft cap which I sleep in but it's perfect for chemo and just wearing anyplace.  You can also see that I am icing my feet in special boots I bought and my hands are in ziplock bags inside a foil-lined lunch bag.  Here's hoping my SEs are as minimal as last time.  Have a great weekend all of you beautiful people.  ",
      "MessageIndex": 575,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 15, 2017 05:10PM JuliaJazz wrote: Susie, just beautiful, both of you! ",
      "MessageIndex": 581,
      "PostDate": "15/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 22, 2017 11:54AM JuliaJazz wrote: Happy birthday Kim.  Wonderful pics.  BFFs are the best!",
      "MessageIndex": 882,
      "PostDate": "22/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 27, 2017 01:06AM JuliaJazz wrote: Thanks for everyone for all the good wishes and even a song. Hope all of you strong ladies have a restful weekend.  Off to visit my dad when the rain lets up just a bit but going out for dinner tonight before the bone pain kicks in tomorrow night.  The heating pad and some pain meds will take care of it though. ",
      "MessageIndex": 928,
      "PostDate": "27/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 16, 2017 07:46AM JuliaJazz wrote: Best to everyone facing challenges big and small. My computer charger is broken and I don't like to type on the phone. Amazon will get my new one here soon and I will write more then.",
      "MessageIndex": 1018,
      "PostDate": "16/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 30, 2017 08:03AM JuliaJazz wrote: LTWJ, you will rock the surgery!.  I'll be thinking of you!",
      "MessageIndex": 1123,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 17, 2017 09:04AM JuliaJazz wrote: Thanks, everybody for the kind words.  Today I noticed peach fuzz on my head for the first time - 7 and a half weeks after my last infusion.  I was beginning to wonder.  The front (over my brow) hasn't come in yet, so hopefully that will happen in a few more days, otherwise it will be scarves for me.  I was salt with a little pepper before.  It seems to be coming in pretty white but we will see. I love the encouragement that everybody is giving on this site.  Some of us are having good days today, some not go good, but we keep on keeping on.  We try to stay hopeful even on the bad days.  We do what we have to do.  We try to live each day to the fullest.  Our cancer has taught us some of these lessons. ",
      "MessageIndex": 1200,
      "PostDate": "17/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 24, 2017 02:37PM JuliaJazz wrote: Thinking of you, Peachy.  You will make the right decisions -- right for you.",
      "MessageIndex": 1222,
      "PostDate": "24/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 26, 2017 11:47AM - edited Oct 26, 2017 05:40PM by JuliaJazz LTWJ, Sending good vibes your way.  You can handle this.  I had a double mastectomy and the healing was not difficult. I hardly needed any pain meds but everyone is different. I can't tell you about the flap surgery as I decided on no reconstruction.. I found the ebook for sale on this blogger's page very helpful in reading about the mastectomy and the different options for reconstruction (or not).. It only cost a couple of bucks.  Scroll down on the page until you see the book Facing Your Mastectomy & Making Reconstruction Decisions.  It comes as a PDF file.  http://nancyspoint.com/",
      "MessageIndex": 1225,
      "PostDate": "26/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 30, 2017 05:51PM JuliaJazz wrote: Glad you celebrated in style Kim. Looking good!",
      "MessageIndex": 1252,
      "PostDate": "30/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Nov 22, 2017 05:45AM JuliaJazz wrote: Great news LTWJ.  ",
      "MessageIndex": 1341,
      "PostDate": "22/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Nov 30, 2017 11:21PM JuliaJazz wrote: Good to hear from you Kim. We'll be thinking of you with that procedure.  I had 11 or 13 nodes or something like that taken out.  I can sure relate with the hair issues.  It doesn't seem fair that we lose brows and lashes AFTER we are done with chemo.  I am using eyeliner to compensate for the lashes and fill in the brows with my Lancôme product I purchased at Ulta.  It stays on until I take it off so I don't have to redo it every day with the little angled brush.  As for my hair, it is coming in slowly, except that I have receding hairline at my temples. I think I had some of this before but my long hair covered it up.  So I am still wearing my turbans.  Also I have a funny cowlick I never knew about.  I also think I have more fuzz on my face than I used to (you can see it down below my ear).  Oh the joys we pink sisters get to experience.  But yes, life is returning to normal for me.  I see my surgeon today and I am hoping to arrange to get my port out soon,   ",
      "MessageIndex": 1357,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Dec 1, 2017 05:57PM JuliaJazz wrote: Good to get that update, Susie.  One hurdle down, a few more to jump through.  We're thinking of you.",
      "MessageIndex": 1366,
      "PostDate": "01/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Dec 9, 2017 12:29PM JuliaJazz wrote: Kim, Try going to my profile, my treatments and adding another surgery for the lymph nodes.  Have a good weekend.",
      "MessageIndex": 1400,
      "PostDate": "09/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jan 6, 2018 11:07AM JuliaJazz wrote: Happy New Year everyone,  Things have settled down for me after a couple of difficult weeks with my Dad moving to memory care.  We had a nice Christmas with my son and wife and one of my brothers here to help and brought my parents over to my house a lot to ease the transition.  After they left my mom and I have begun the routine of visiting him every afternoon.  Some days I drop her off and run errands and return to get her.  Other days we both stay.  Once a week she is playing bridge and I go by myself.  Once a week or so we will try to have them over for dinner instead of an afternoon visit. He was angry at first and had difficulty understanding why he had to be there.  After much repetition he is accepting of the situation.  The biggest blessing is that his facility is 5 minutes away from my house and hers is another 5 minutes past that.   So now to try to get back to putting my own health first.  I want to lose another 30 pounds this year.  I had lost 60 before I was diagnosed but took a break from dieting for the last 7 months during all this cancer stuff and just tried to maintain.  It is hard to go back on my variation of Atkins (Neris and India's Idiot Proof Diet) but I know I can do it.  Wish me luck. I have been thinking of all of you and hope the new year is going well for you so far. Julia",
      "MessageIndex": 1443,
      "PostDate": "06/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jan 17, 2018 01:46PM JuliaJazz wrote: An interesting post by one of my favorite cancer bloggers about changes to the staging system.  Wanted to share it here for you dear friends.  This is my favorite of the 5 or six forums I am on on this site.  I appreciate how we have kept the support going. http://nancyspoint.com/confused-ajccs-updates-breast-cancer-staging-system/",
      "MessageIndex": 1461,
      "PostDate": "17/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jan 31, 2018 12:50AM JuliaJazz wrote: Peachy, you are looking great.  I am jealous because, being younger than me you don't have the receding hairline.  Other than that my hair is about the same length as yours but it has been five months for me.  I can't wait til the front grows a little more so it can cover the bald spots.  Kim, I hear you on the AIs.  I feel some pains too, but since at 69 next week, I have arthritis in my knees and hips I don't know whether to attribute the pain to the AIs or just old age.  I have some tenderness in my back too, but perhaps I just tweaked it.  Hope that doesn't become the new normal.  You are right though, it is a tradeoff.  The key is not to sit for too long at a time.  Get up and move around before you get stiff.",
      "MessageIndex": 1500,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Feb 17, 2018 01:37PM JuliaJazz wrote: hhuey, so nice to  hear from you.  How great that you are almost done with rads.  Keep us posted on your gallbladder surgery.  My dad went through that at 90 and did well, so I am sure you will do just fine. Good luck with that exercise program.  Sounds like a good plan.  The new normal is just ahead for you.",
      "MessageIndex": 1525,
      "PostDate": "17/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Apr 9, 2018 11:42AM JuliaJazz wrote: So sorry for your loss hhuey.  Glad you got to be with him.though and very glad that your treatments are almost done. Hang in there through the next whirlwind and enjoy your downtime.  You have earned it.",
      "MessageIndex": 1566,
      "PostDate": "09/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Apr 25, 2018 09:21AM JuliaJazz wrote: Dear Peachy, So glad to hear you are feeling good all in all but so sorry to hear about Brody.  That really is too much. Praying for sure.",
      "MessageIndex": 1572,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 14, 2018 01:16AM JuliaJazz wrote: Happy mothers day to all moms and daughters. My mom just celebrated her 92nd birthday.  My dad has settled in to memory care so that makes it easier for us when we go to visit him every afternoon. I am blessed to have them both.  I had a nice call from my son.  We saw him and his wife last weekend and will go to see them again this weekend. He called me today and put a sweet post on facebook about how he is grateful for modern cancer medicine.  Love to all my sisters here online.",
      "MessageIndex": 1579,
      "PostDate": "14/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 21, 2018 12:10AM JuliaJazz wrote: Greetings Peachy.  We will all be thinking of you during your surgery.  Please keep us posted. Hoping for a speedy recovery for you.",
      "MessageIndex": 1582,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "May 25, 2018 03:50AM JuliaJazz wrote: hhuey.  Enjoy your summer.  I think all of us will try to pack this summer with some good memories to blot out those of last summer. The smiles of your children are undoubtedly the best meducine",
      "MessageIndex": 1584,
      "PostDate": "25/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 1, 2018 03:47AM JuliaJazz wrote: I was just thinking the same thing, Peachy.  Hopefully the fact that we don't post as often means we are doing well.  I am feeling great and enjoying the summer on our sailboat in Wisconsin.  Heading back to Florida in two weeks and I will be so glad to see my parents.  Two of my brothers have visited over the summer to check in on them and my son has stopped in too. As for my health, I am feeling great and doing water aerobics here in the chillier Wisconsin waters.  My arthritic knees aren't so great so I can't do much walking.  My orthopedic surgeon wants me to lose 30 more pounds but it is a very slow process and I hope I can convince him to do knee surgery this winter.  Wish me luck with that. My anastrozole is causing hair loss.  For now I can get by with a comb over.  The picture I will attach (of my in the cabin of our sailboat) shows my hair the first day after a shampoo.  After that it gets fuzzier and fuller looking but it Is continuing to thin.  I will talk to the oncologist when I get home. There are some threads on here about products people have used and some people have switched to Femara and had less thinning.  I guess my improved life expectancy is worth it, even if I have to go back to my turbans.  One day at a time, right ladies.  Happy Fall to all of you.    ",
      "MessageIndex": 1603,
      "PostDate": "01/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 6, 2017 08:08AM JuliaJazz wrote: Rukoni, thanks for your report. I am very interested in how you are doing since, as you say, I will be just three weeks behind you with my treatments and having the same two drugs.  And thanks to all the rest of you who have posted.  We can do this together!!! Julia ",
      "MessageIndex": 69,
      "PostDate": "06/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 21, 2017 12:01PM JuliaJazz wrote: Loving all the pet pics, everyone. HapB. She gets shaved twice a year and has to be put under.  In between I clip her with a scissors with a comb on it. http://scaredycut.com/cat.html Kim and TRalph.  I had to have more nodes taken out a week after my BMX and sentinel node biopsy (one was positive).  Now two months later all feels normal on my side and underarm and luckily they did not find any more positive nodes.  I wish the same for you. ",
      "MessageIndex": 644,
      "PostDate": "21/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 26, 2017 10:10AM JuliaJazz wrote: Hap B.  Good luck with the radiation.  I know nothing about that.  I don't like texting either but I know that sometimes we have to ask for help.   Text them back and say I could use help with X, Y or Z.  One simple request, perhaps shopping for you. Then you will find out what kind of friends they are. People are so busy and they should offer but they don't so make a request and see what happens. Thinking of you nd hoping it goes well today.",
      "MessageIndex": 694,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 18, 2017 02:11PM JuliaJazz wrote: Pauette/  I just used those cheap gloves you buy in drugstores in winter. they must be acrylic or something but they are thin and I usually buy black ones.  I bet you have a pair lying around. And yes, thin cotton socks.  The ice will melt and you have ice water. I wear some crocs to tale my still damp feet home in.  I Don't get up for the bathroom but you could if you had to and thn get back on the ice.",
      "MessageIndex": 854,
      "PostDate": "18/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 29, 2017 09:51AM JuliaJazz wrote: Glad you got some antibiotics, Peachy, hope that does the trick.  I'll be thinking of you.",
      "MessageIndex": 952,
      "PostDate": "29/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 2, 2017 10:07PM JuliaJazz wrote: I know how bad that smoke can be, Pink, Have relatives in Montana and other western US states.  One nephew has even been a smokejumper.  Hope fall will arrive soon with some cooling rains.  It doesn't seem fair when you are dealing with so much else but we know that life is not fair.",
      "MessageIndex": 978,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 15, 2017 04:47AM JuliaJazz wrote: Kim and all the rest of you dear friends,  Got back Tuesday at midnight from Atlanta.  15 hour drive with terrible congestion at stops for food and gas and bumper to bumper traffic.  We had a nice time with my cousin.  It was tiring through as I was the full time caregiver for my 94 year old dad, including waking at night to help him use the facilities.  We lost power in Atlanta (their first tropical storm ever) and spent our last evening in the dark.  Temps were cool so that was to problem.  Headed back on Tuesday as we had imposed on them long enough.  Since I got home I have been resting up.  Starting to feel more normal today.  Our home here in Sarasota has lots of branches in the yard we will have to pay someone to clean up and a few torn screens on the pool cage but we never lost power.  Our son in Orlando boarded up his windows and hunkered down and he and his wife are fine too.  Glad to read that all of you are keeping on keeping on.",
      "MessageIndex": 1010,
      "PostDate": "15/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 18, 2017 09:44PM - edited Sep 19, 2017 12:11PM by JuliaJazz Peachy, I ordered a very inespensive ebook that helped me in my decision making about whether to have a single or double mastectomy and in deciding about reconstruction/no reconstruction.  You can find the link to it here.  Her blog is also very good.  Wishing you peace about whatever you decide http://nancyspoint.com/ebooks/ ",
      "MessageIndex": 1049,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 25, 2017 10:47PM JuliaJazz wrote: Sending good vibes to all and celebrating your successes and praying for your struggles but just too busy to reply individually right now.  Got to get caught up on all the things I neglected when I wasn't feeling top notch.  LOL.",
      "MessageIndex": 1099,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Sep 27, 2017 02:52PM JuliaJazz wrote: Good luck with those next steps, Peachy.  You and your surgeon will make the decisions that are right for you.  You will do great.",
      "MessageIndex": 1108,
      "PostDate": "27/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 13, 2017 01:08PM JuliaJazz wrote: It is so great to hear how well everyone is doing.  Good luck with the surgery hhuey.  Some of us had that first so feel free to ask questions here.  Hope everyone has a great weekend.",
      "MessageIndex": 1181,
      "PostDate": "13/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Oct 16, 2017 01:42PM JuliaJazz wrote: Still no hair growing back but that doesn't bother me as much as the thin eyebrows.  I didn't lose all of them, maybe because  I put some coal tar stuff I bought on them twice a day but they are pretty sparse.  So today I spent some money at the Lancôme counter at my local ULTA and got some Lancôme Sourcils Gel Waterproof eyebrow gel cream.  The gal showed me how to put it on with a little brush which you  use just the tip and then you can buff it out a bit with the other end of the brush which looks more like a mascara brush - it is called a dual ended firm angled brush.  You just use a little on the brush and outline the shape you want first and then fill in and then smooth it out with the other end of the brush.Here is the result.  I am happy with it. The eyeliner helps make up for the sparseness of the lashes.  I usually am not one for make up but I am also using some crème foundation I got at the ACS program as under eye concealer.  I am definitely aging and I am sure the chemo hurried it along a little but, we've gotta do what we gotta do, right sisters? Have a great weekend.  ",
      "MessageIndex": 1192,
      "PostDate": "16/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Nov 15, 2017 01:03AM JuliaJazz wrote: Time on the water was great.  Felt really \"normal\" for the first time in awhile.  Florida in November is pretty nearly perfect. Ate a little too much during the dockside festivities so its back to the diet today. Good wishes to all of you going through treatments or side effects right now. I will be thinking of all of you today.  ",
      "MessageIndex": 1321,
      "PostDate": "15/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Nov 16, 2017 03:46AM JuliaJazz wrote: A really interesting blogpost on hormone blocking drugs http://nancyspoint.com/certain-breast-cancer-patients-extend-endocrine-therapy-beyond-five-years/ ",
      "MessageIndex": 1327,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Nov 16, 2017 11:38AM JuliaJazz wrote: Pink, my oncologist tends to agree with the study, but she say let's see what the data says after five years.  I've been on Arimidex for two months and really have no noticeable side effects.  My hair is 1/4 inch long now but I do have some worrisome bald spots.  Time will tell.  I will take a pic in another week or two. So glad your radiation treatments are going well.  I didn't have to go through that.  ",
      "MessageIndex": 1329,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Nov 23, 2017 02:04AM JuliaJazz wrote: Great news Peachy, especially about the nodes!!!",
      "MessageIndex": 1343,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jan 6, 2018 11:20AM JuliaJazz wrote: Have any of you watched Lisa Smith's 7 myths?  Here is the one about weight.  https://www.lisaschwartzmd.com/p/myth-6-extra-weight-is-ok",
      "MessageIndex": 1444,
      "PostDate": "06/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jan 7, 2018 02:24PM JuliaJazz wrote: Peachy, that had to be so hard to hear.  You will probably continue to tolerate your treatments well but it is a bummer that you have to do another year.  Good that there will be an extra week in between treatments.  You will be in my thoughts for sure. Good that your work is supportive.  Some folks aren't so lucky that way.  Sending a virtual hug.",
      "MessageIndex": 1450,
      "PostDate": "07/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jan 25, 2018 09:50AM JuliaJazz wrote: Looking good Luwusu.  I do hear some people on AIs have thinning hair so I am a little worried about that although I had thick hair to start with and so far my hair is growing in thickly (except for my receding hairline.  When my hair is as long as yours, Luwusu, I will be able to cover that up.  Hugs to everyone and good wishes for hair growth and prayers for those of you still on treatment for healing and speedy recovery.",
      "MessageIndex": 1486,
      "PostDate": "25/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Feb 2, 2018 01:42PM JuliaJazz wrote: Pink and all, thanks for sharing.  Yes, we rusty old tin cans have to keep oiled like the tin man in the Wizard of Oz.  It probably is a combination of things, hard to know isn't it.  I too, take Aleve, and try not to sit too long during the day.  My three times a week water aerobics class is a lifesaver.  In the pool, I am superwoman.  I can do 60 jumping jacks in 60 seconds.  On land it is quite another story.  Have a grand weekend everyone.",
      "MessageIndex": 1505,
      "PostDate": "02/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Feb 7, 2018 03:09PM JuliaJazz wrote: Peachy - So glad the three week cycle gives you time to have a little fun.  I found that was true for me.  I enjoyed the third week so much.  The nose is definitely the drugs. Dries everything out.  The trip possibilities sound great.  And PINK - wow!",
      "MessageIndex": 1513,
      "PostDate": "07/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Mar 4, 2018 05:27AM JuliaJazz wrote: What wonderful news. Kim.  Loved your bell ringing! Good luck with the letrozole.  I am not having any problems with the arimidex after 5 months of treatment.  I too will be on it for at least 10 years.  There is some talk that they may decide they want on these for our lifetimes.  I will just take it as it comes. I am currently exploring permanent makeup after reading on another forum here that people who have TC often never fully get their eyebrows back.  I have found that there is a place in Sarasota that specializes in this so I think I will go talk to them.  I have gotten pretty good at drawing them on but was expecting that to be only for a few months.  If it is going to continue, it will be a pain I think.  So I will let everyone know what my decision and experiences are. The view out the window here in Snowmass, Colorado is awesome and we are having fun with 30 old friends from college days.  My fuzzy hair and brows not quite so awesome. But life is good!      ",
      "MessageIndex": 1544,
      "PostDate": "04/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Mar 9, 2018 03:42AM JuliaJazz wrote: Hap B, there is an interesting thread called Moving Beyond Cancer/Eyebrows Months After Chemo Has Ended on this forum.  I am thinking of having my eyebrows tattoed.  I am getting tired of painting them on.  If I do I will report and show before and after photos.",
      "MessageIndex": 1551,
      "PostDate": "09/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Mar 22, 2018 10:55AM JuliaJazz wrote: Hello lovely ladies - I just got fitted for my compression sleeves for flying to prevent lymphedema.  I foolishly forgot to get them before my last flight and had some swelling that only lasted a day.  That was my wake up call I guess.  There is lots of controversy about whether these things even work but I am going to give them a try. Not covered by medicare.",
      "MessageIndex": 1557,
      "PostDate": "22/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 5, 2018 01:38AM JuliaJazz wrote: Hap B.  I will be on Arimidex for 10 years.  Not causing me any problems so far. ",
      "MessageIndex": 1588,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 2, 2018 08:34AM JuliaJazz wrote:",
      "MessageIndex": 1600,
      "PostDate": "02/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 9, 2017 02:11PM JuliaJazz wrote: Rukoni, Thanks for the update.  I am learning from you.  Will ask for a Xanax scrip in case I need it. In what area(s) of your body was your bone pain? Was the massage really helpful or would a rather heating pad do about as well?",
      "MessageIndex": 59,
      "PostDate": "09/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Aug 16, 2017 03:54AM JuliaJazz wrote: I've been busy with my 94 year old Dad who was in hospital and now at rehab. He is confused in his new surroundings and does better when a family member is there.  I am thinking about all of you and always read your comments but won't have much time to reply until things get back to normal with him. I am just glad I am feeling well enough to be there for him.  Good wishes to all of you sisters.",
      "MessageIndex": 150,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 26, 2017 07:35AM JuliaJazz wrote: LINBAD2 --The port is wonderful.  So glad I got mine.  The procedure was simple and I am sure it will be just as simple to remove it when I'm done and I hate having a line in my arm.  Consider getting a port.  An as someone else said join the August Chemo group or whatever month you are starting for day to day support.",
      "MessageIndex": 1828,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 20, 2017 04:13AM JuliaJazz wrote: Yes the Look good session I attended said polish is OK but no gel nails.",
      "MessageIndex": 84,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jun 23, 2017 11:55AM - edited Jun 23, 2017 02:17PM by JuliaJazz  My first chemo infusion (Taxotere and Cytoxan) went smoothly this afternoon  Three more to go!  We arrived for my one o'clock appointment and the nurse drew blood.  After awhile Dr. Eakle. my oncologist, came in and said they needed to draw it again because my platelets were low  While they did that she called my surgeons office who is a part of the Intercoastal Group and so could access my primary care physicians records for the last 12 years.  It turns out that for all that time I have had  low platelet count, usually ranging between 90 and 100.  Normal platelet count is 140. The second time they too mine it came up to 92.  My white blood cell count (my immune system) was very good. So the doc said we would go ahead.  However, during this first cycle we will watch my platelet count carefully and if it gets too low we may have to adjust the dose or timing or future treatments The funniest thing was that I was icing my hands and feet and the insulated lunch bags that I thought would be waterproof, weren't, so my DH had to clean with paper towels periodically and at the end we wiped the floor with one of their blankets.  They are the right size for my hands and stand up, so I think I will just add a large Ziploc baggie inside them next time and put my hands in that.  The booties I bought for my feet worked well.   I feel fine this evening.  I had Varubbi, a very expensive anti-nausea drug and will take Zofran every twelve hours for the first three doses. I will save the Compazine for if I actually feel nauseous.  I will be taking measures to avoid constipation.  Now to make a baked potato for dinner! ",
      "MessageIndex": 97,
      "PostDate": "23/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "JuliaJazz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251147/profile",
      "Content": "Jul 3, 2017 10:55AM - edited Jul 6, 2017 03:17PM by JuliaJazz Just got back from the oncologist with an A+ report.  I have had very few side effects so was hoping my blood counts had behaved also.  I have a low platelet count normally ranging from 90 to 104. ( I just learned that on the first day of chemo.  If my docs had ever mentioned it before it certainly did not stick in my mind.) On day 1 my count then was 92 and so (with some trepidation) the doc went ahead with the planned TC treatment..  Today, day 10, my platelets were at 104, equal to the highest in my history at my primary care doctor.  My white blood cells had been at 7.8 (good) on day 1 and on day 10 today were at 12.7 so the Neulasta certainly did its job.  I did have mild anemia, hemoglobin is at 11.4 today, down from 12.0 on day 1.  Not too bad though.  Doc feels I should be good through all four treatments even if the levels drop some.  I asked her if any effects are cumulative.  She said I might have more fatigue.  I can live with that.  For now her instructions are to live normally for the next 11 days until my next infusion.  I don't need to avoid crowds or anything.  So I am thanking my lucky stars.  Best to all of you as you progress on this chemo journey.  We are all different and we will all get through it if we just put one foot in front of the other.",
      "MessageIndex": 112,
      "PostDate": "03/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    }
  ]
}