{
  "AuthorID": "JulieMI",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164668/profile",
  "Posts": [
    {
      "AuthorID": "JulieMI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164668/profile",
      "Content": "Aug 15, 2014 01:47PM JulieMI wrote: I have pretty weak back muscle so the chronic back pain.  With the silicon breast forms, my back pain is unbearable.  I now wear the foam form which is very light.  To solve the riding up problem, I just wear very loose bras hang loosely around my chest.  I love the Amoena Dorothy style I got lately. I am going to see my doctor today to get another prescription for pair of new foam breast forms.  ",
      "MessageIndex": 37,
      "PostDate": "15/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/756164",
      "Title": "Hot weather and sweating behind breast forms Erica"
    },
    {
      "AuthorID": "JulieMI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164668/profile",
      "Content": "Apr 3, 2014 05:00PM JulieMI wrote: I was feeling great too.  I recovered from a tailbone injury from a year ago.  Only 2 months before BC, I told friends that I finally felt 100% healthy.  I was eating right, exercise and rest well.  What else could I do to avoid it?  That's what scare me the most.  I was taking very good care of myself and I still got cancer? I blame it on the year of dragon which is the year I was born.  Chinese believe the year of your animal is the most traitorous year for you.  Sure enough, I was hit with this. ",
      "MessageIndex": 36,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/819541",
      "Title": "Did you have any symptoms prior to being diagnosed? Footballnut Footballnut"
    },
    {
      "AuthorID": "JulieMI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164668/profile",
      "Content": "JulieMI wrote: I need to hear suggestions regarding prophylactic mastectomy. I had MX on the left last June and finished chemo 2 months ago.  A month ago I had my first post diagnose mammo and found 2 spots in the right breast which turned out to be normal.  I went through some very stressful time and decided to have the right breast removed.  I already had the surgery scheduled for March 5. But now my blood test showed low WBC which, I guess, is pretty common since I only finished dose dense AC+T two months ago.  My husband suggest me to postpone the surgery until later this year.  I rushed to have the surgery scheduled because of the latest scare and also blaming husband for talking me out of BMX last year.  Now after some thinking, I feel I maybe have acted a little too soon.  With Low WBC, it's probably not an ideal time to have a major surgery.  It's not a bad idea to wait a few more months to give the body some time to recover. I would like to hear other people's opinions. Thank you! Julie Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/799081",
      "Title": "Best Time to do Prophylactic Mastectomy? JulieMI JulieMI"
    },
    {
      "AuthorID": "JulieMI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164668/profile",
      "Content": "Jan 19, 2013 08:02PM JulieMI wrote: Maureen, Thank you for sharing your situation.  My WBC was always high too due to Nulastas.  One time it was as high as 21.  I even got the shot after the last chemo.  Now the effect of it is gone.  My body has to make WB without stimulation. I have heard it could take a while.  If I don't do surgery in March, I have to wait until this fall because I have a big oversea trip planned for June/July, August will be too busy at work according to my manager. I plan to stay flat.  My husband told me to make decision for me only because he will not like the new breasts.",
      "MessageIndex": 2,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/799081",
      "Title": "Best Time to do Prophylactic Mastectomy? JulieMI JulieMI"
    }
  ]
}