{
  "AuthorID": "juliaflood",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101382/profile",
  "Posts": [
    {
      "AuthorID": "juliaflood",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101382/profile",
      "Content": "May 5, 2010 03:04PM juliaflood wrote: Hi again ladies, just say the U/S & biopsy went fine. Very short procedure and relatively painless. They did two core biopsies under local, which I actually didn't feel at all. So for those of you out there who are worried about biopsies for papable lumps, it's very straightforward and the only side effect is a little numbness after the local and a little bruising after the needle. All good. The radiologist was the clinic director - in other words she's a consultant radiologist for breast imageing and is very prolific in the area. I recognised her from press articles etc. She reads 1000s of Mammos (incl. mine 2 wks ago) and U/Scans every week. She said she couldn't tell if a mass is b9 or not obviously, but her reading of the U/S was very positive - in other words given the history of my lumps, she would be very surprised if anything came back other than b9. Let's hope she's right!! I get the results on Friday. More finger crossing, but at least, whatever happens this waiting hell will be over and if there is something sinister, they have caught it early. Thanks so much to all of you, x",
      "MessageIndex": 10,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752131",
      "Title": "I'm petrified but bravo to all of you! juliaflood Lisa1962"
    },
    {
      "AuthorID": "juliaflood",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101382/profile",
      "Content": "juliaflood wrote: Hi! I'm so glad I found this forum - what a remarkable bunch of gals, and not a single word of self-pity (with the exception of myself) read below! Your stories give such hope, esp. in this dark days of waiting for information, good or bad. I'll try to keep this short - history of bc in family with my Mom who died last year at 79 and her sister, died in her mid-50s. I have a super lumpy left breast, since my 20s, the usual tenderness with PMS, and the lumps stayed for good in my 30s but never a prob as far a doc concerned. Went for baseline mamo & u/s last year, all clear. A second clear mamo two weeks ago but I'm not happy about the usual lumps. They're bigger & wiser, and there is a prominent movable cyst formation with firm, rubbery nodules underneath. A bit too ‘firm' for my liking. Checked by bc nurse & bs, both said ‘it seems fine, nothing sinister, but best to have u/s done and possible biopsy just to be sure' and ‘hopefully it'll be ok'. The last sentence left me rigid with fear, like never before in my whole life, and I've had colonoscopies, and surgery for endo, without even blinking. My u/s is scheduled for Wednesday 5th. I am petrified, I know it's totally irrational and I keep telling myself that the lumps are just more prominent now that I'm in my early 40s and prob a typical pre-menopausal change, but I spent today weeping in my car in a horrible parking lot, wishing this wasn't happening! Am I going completely mad? x Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752131",
      "Title": "I'm petrified but bravo to all of you! juliaflood Lisa1962"
    },
    {
      "AuthorID": "juliaflood",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101382/profile",
      "Content": "May 5, 2010 05:37AM juliaflood wrote: Huge thanks again guys: you're all bright stars in the darkest of nights! Will let you know how it all goes with my tests and thank you for all your support. x",
      "MessageIndex": 9,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752131",
      "Title": "I'm petrified but bravo to all of you! juliaflood Lisa1962"
    },
    {
      "AuthorID": "juliaflood",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101382/profile",
      "Content": "May 3, 2010 05:29PM juliaflood wrote: Thanks so much guys: very comforting and thoughtful comments. And yes, Deborah I will find a better parking lot to cry in next time - let's hope there won't be a need for one! LOL! I guess the most frustrating thing about all of this are the irrational thoughts - I'm not normally a negative person, I have very postive emotions, so this fear is overwheleming as I'm not used to it. I know that whatever happens I will have support, from my family & friends, and now here on this forum too, it can only make me stronger. I will let you know how the U/S and biopsy on Wednesday goes... fingers crossed. x",
      "MessageIndex": 3,
      "PostDate": "03/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752131",
      "Title": "I'm petrified but bravo to all of you! juliaflood Lisa1962"
    },
    {
      "AuthorID": "juliaflood",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101382/profile",
      "Content": "May 7, 2010 09:13AM juliaflood wrote: Hi ladies, all good with biop results, all 3 biops on my lump came out B9 and a fibroadenoma detected which will need to be monitored but is not of major concern. I have to say I'm relieved but numb! This has been a VERY humbling experience and I have learnt so much in the last few weeks. The hardest part for me was not just the hellish waiting game but learning to trust my medical team. It's so easy to imagine that they have no idea what they are doing despite the fact that they do it every single day. I would hate to think that the people I undertake work for would think the same about me. Thanks for your post - ICanDoThis - very cheery but I won't disappear just yet!! I will stick around to keep myself informed and to support others in the same dark place as me. There is a lot of information out there about this diease, some very helpful and some pretty hair-raising. It's important to learn how to judge all of it and to maintain awareness as well as take our health care into our own hands without being scared to death. Thank you to all of you who posted on this thread, you have no idea how much it meant to have your support. Keep the faith! x.",
      "MessageIndex": 14,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752131",
      "Title": "I'm petrified but bravo to all of you! juliaflood Lisa1962"
    }
  ]
}