{
  "AuthorID": "julieup",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70595/profile",
  "Posts": [
    {
      "AuthorID": "julieup",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70595/profile",
      "Content": "julieup wrote: I had an mri today after a gamma xray showed a problem in my left chest. The mammogram didn't show anything so they did schedule the mri. I have a swollen left breast (still nursing and this is my son's favorite side) and extreem pain on my left side. The nurse that took me in for mri said it will tell me if I have IBC as it shows everything. Is this true? Please help, I see my dr. for results on Friday morning. Bless you all, you are all so wonderful. Julie Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/719434",
      "Title": "mri and ibc julieup DianeE"
    },
    {
      "AuthorID": "julieup",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70595/profile",
      "Content": "julieup wrote: I had a  MRI last week due to extreem pain in breast, and a swollen breat. No other symptoms of IBC. I have also had a hard time in the last two weeks in sternum pain, especially while sleeping. My MRI came back with extreem inflammation and some concern about seeing something on my lung. I didn't put 2 and 2 together till I got home and realized that something on my lung could be cancer that has spread and I am very scared. My dr. is ordering a breast biopsy and cat scan of lung next week. My question is should I ask him to order a punch test (i have no idea what this is but see others talking aobut it) too? Does something spread to the lung hurt in the day? I don't cough just pain. Please advise and tell me my dr. is doing the right thing. Julie Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/719596",
      "Title": "Need advice julieup leaf"
    }
  ]
}