{
  "AuthorID": "julz4",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
  "Posts": [
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 3, 2012 06:15PM julz4 wrote: Ek read my DX line at the bottom of my post.  I was DX with DCIS at the core biopsy but when I had my Lumpectomy I was found to have a few spots of micro evasiveness's.  Mine were less than 1mm each I did not need any chemo, just radiation.  The waiting is so hard with so many unknowns.  It's not easy oh how I know....it took me from me finding my problem the end of February till May 30th a week post surgery & even weeks beyond that to know what my plan of action was gonna be.  It changed several times too, as I was first DX with a pre cancer cells called atypical hyperplasia.   Many decisions to make but not till the final word is in.  Keep us up to date when you have time as many are here to help you out.",
      "MessageIndex": 4,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/791529",
      "Title": "DCIS diagnosis just changed to IDC ek25 voraciousreader"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 2, 2008 10:42AM julz4 wrote: It sounds like you have had the  'QUEENS'  of all Dr's.. It makes me so mad when Dr's think they are GOD & know all. Only a biopsy or futher testing can give you an answer to what is going on. We will help all we can. Keep posting!  Julee",
      "MessageIndex": 7,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718934",
      "Title": "Misdiagnosed? jhawks67 Shirlann"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 2, 2008 10:12AM julz4 wrote: jhawks ~ please try & find a comprehensive breast center near you. That can get the testing you need to have! Since your new to the board. You can personal message anyone hear with a private ? you might have. Just click on there name & there is a place in the right hand side of your screen near the top that says about personal message. Click that & type your message to that person. It may take a little time to receive a message because we are not on here all the time. Or you can let someone on hear know what state you live in & someone here might be able to direct you to a place that is willing to help you! Unfortunately many women on here have to fight for their right to get the medical treatment they deserve! Keep us posted! We will be here for you! Julee",
      "MessageIndex": 3,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718934",
      "Title": "Misdiagnosed? jhawks67 Shirlann"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 2, 2008 03:47PM julz4 wrote:",
      "MessageIndex": 12,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718934",
      "Title": "Misdiagnosed? jhawks67 Shirlann"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 23, 2008 05:51AM julz4 wrote: Oh, Sweet heart I am so Happy for you Words cannot express how worried I was for you when I read your post. I just knew I had to do something. Was so glad my pal spar & I could help you out when you most needed it. Thanks to all the girls in Missouri that helped with the mission to find the right help for you! And especially your unending persistence to get to the bottom of this. Keep in touch my new friend! It is amazing what this board can do! Ohhh sooo many Happy tears for you! Love Julee!",
      "MessageIndex": 43,
      "PostDate": "23/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718934",
      "Title": "Misdiagnosed? jhawks67 Shirlann"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 4, 2008 04:33PM julz4 wrote: I'm so glad we could help you. I know the wait will be tough. But we will be waiting with you! Please come & post when ever you need. I will be here for you as well the other girls here. If you have any ?'s or you just want to vent. Or as we say here the squirrels in our attic are chattering too much! Please keep us posted!  Many gentle Hugs to you, Julee",
      "MessageIndex": 24,
      "PostDate": "04/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718934",
      "Title": "Misdiagnosed? jhawks67 Shirlann"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 16, 2012 11:29AM julz4 wrote: Layla, I'm 45 & have been on the pill off & on over the years.  I have 4 children, 7 pregnancies total.  I took natural progesterone for my last 2 viable pregnancies.  I also took the pill for excessive bleeding along with Depo Provero shot & agestin also before my hyster, just the Uterus.  That was 6 years ago.  My RO didn't say much about the progesteron type meds, but noted the use of the pill off & on for years.  Who knows what all that did.....makes me wonder.  No hormones needed for my Hyster.  But I do have a friend in her early 70's that had a complete Hyster in her late 20's early 30's.  She was on replacement hormones for many years.  She was DX 4 years ago with BC.  Not sure what kind but she needed just RADS as far as I know. ",
      "MessageIndex": 143,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 16, 2012 01:02PM julz4 wrote: Thanks Vorac.....!!!!! I thought I might be missing something!",
      "MessageIndex": 148,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 16, 2012 10:51AM julz4 wrote: Lisa NED stands for No Evidence Detected.  I was reading & saw you asked this ? so I popped in to answer.  This is what I know it to mean.  I hope this helps!  So much to think about & figure out with BC....it's never seems to be a cut & dry answer to anything!  I'm between DCIS & IDC....such a gray area!",
      "MessageIndex": 141,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 26, 2013 08:55AM julz4 wrote: *",
      "MessageIndex": 1,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/809972",
      "Title": "What can I expect with a Axillary Core Needle Biopsy? julz4 Beesie"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Sep 6, 2013 03:02PM julz4 wrote: Sorry I didn't have a chance to pop in yesterday & let you know that it all came back negative, B9, no cancer!!!! Yeahhhh! One thing less on my mental plate! Thanks Colleen for your help!",
      "MessageIndex": 7,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/809972",
      "Title": "What can I expect with a Axillary Core Needle Biopsy? julz4 Beesie"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "julz4 wrote: I am going in tomorrow morning for an axillary US guided core needle biopsy.  I have already had 2 core biopsy's of my breast over the last 5+ years.  I am wondering how this is gonna feel? recovery? & so on.  Going in soft breast tissue is some how different than going in right at the arm pit crease through muscle.  My lymph node is not protruding you have to push in deep for it & it's about 2cm in length.  DX Papillary Thyroid Cancer 2/15/2018, DX-5/15/2012, Partcial Mastectomy 5/22/201, DX-5/30/2012, Tumor DCIS/MI 2.8cmStage T1, Grade 3, 0/2 nodes, ER-PR-. 9-/25/2014 Review of slides with new Dr's at Hopkins 1.5mm invasion found. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/809972",
      "Title": "What can I expect with a Axillary Core Needle Biopsy? julz4 Beesie"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 26, 2013 10:03AM julz4 wrote: Thanks Colleen!  I am glad that it sounds like not to be bad & just like the breast biopsy.",
      "MessageIndex": 3,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/809972",
      "Title": "What can I expect with a Axillary Core Needle Biopsy? julz4 Beesie"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 30, 2013 04:56AM julz4 wrote: Hi Colleen, it wasn't bad in that I really didn't feel much with needles. I think because I still have some numbness left from the Sentinal node biopsy over a year ago. My Radiologist is really good. it also turns out he was the same one who place the Wire Guide for my Lumpectomy. A reallt sweet nice man! My arm & hand were tingly & achy because of having to stay in the same position with my arm over my head for about 45 minutes. I got a little nauseous, but that's a me reaction. They took 7 cores. The node did grow but in a good way as it still did not look cancerous. But they are wondering why it's almost twice the size as before. Looks like a long green bean. I am feeling good a little tender. I have to go back to work tonight. I am a nurses aide. So I expect to feel achier in the morning. I will find out next Thusday what the results are. Plenty to keep me busy until then. Also I'm a pro on the waiting game. My Dr is on vacation. Again thanks for checking on me!",
      "MessageIndex": 5,
      "PostDate": "30/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/809972",
      "Title": "What can I expect with a Axillary Core Needle Biopsy? julz4 Beesie"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 2, 2008 05:50AM - edited Aug 2, 2008 05:52AM by julz4 I had 2 spots of micro cals in my left breast close together seen in my mamogram in march 08. This was my second mammo ever. I am 41. I was listed as a birad 4. In May they did a stereotactic needle core biopsy. Because of the position of the 1 very small group of microcals they could only biopsy 1 of the groups. My path report came back B9. The BS is keeping a close watch on the other small group. No lump was felt where the micro cals are. I have since found a lump in my left breast, & had a sonogram / mammogram tests done. Nothing was seen in those tests. So for now they are keeping a close watch on things, it appears to be fibrocystic changes. I go for another palpable exam in a little over a week. And another mammo the end of september. I have seen many women that in just the few months I have been here. That have come for advice due to similar things seen or felt in our breasts. And there path reports have come back B9. It does happen! Let us know how you doing!   Julee",
      "MessageIndex": 3,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718920",
      "Title": "If your journey started w/ microcalcifications... newmomto1 newmomto1"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 30, 2008 08:11AM julz4 wrote: Oh the waiting is the worst, but what ever the out come. We will be here for you! Sending you Gentle Hugs & Cyber B9 thoughts your way ~ Julee",
      "MessageIndex": 6,
      "PostDate": "30/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/714659",
      "Title": "newbie prayinghands lvtwoqlt"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 10, 2008 02:52PM julz4 wrote: I had mine done just on May 8th. I did not take anything before. I worked the night before so I would be dead tired. But if you need something take it. My biopsy was a mammo needle core. It took about 35-40 minutes. I felt some tugging but no pain. Almost at the end I started to feel some pain, not too bad but I wasn't sure how much longer it would be. They gave me more numbing stuff right away. The toughest part for me was my neck too. A nurse held my hand the whole time. I bled a little after wards & the nurse put some pressure on it for about 10 min. It is 3 days since it was done & I'm still a little sore. I was using ice packs for 2 days & tylenol. But a good support bra is a big help. If you jiggle when you move or walk, I can feel it. If you have ever had kids & nursed....well it kind of reminds me of being full of milk in certain spots. Good luck & I wish you well...Remember the women on this site are really here for you...",
      "MessageIndex": 9,
      "PostDate": "10/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/705045",
      "Title": "questions about stereotactic biopsy PugMum ozwiz127"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 11, 2008 04:04PM julz4 wrote: What a special friend  you are to your friend.  For your sake as her friend it is hard to take a stand to let her know that she really needs to see a DOC. The sooner the better. She sounds like she is really scared & just doesn't want to deal with her breast lump. Fear of the unknown can make people do strange things. One of them being Denial. With that being said Know that 80% of lumps are B9. Some women are more lumpy than others. Since it sounds like she has had the lump for a while it should be checked out. I know it is Very Scary, but know that with todays advancements in breast cancer early detection is the key. With her being young, that's a good thing! Chances are on her side for the lump being benign. I wish I could help you more, keep checking in some one with more wisdom will come along. Know that I worry as your friend & you do. I have lumps, that are getting checked out on Monday. This is not a first time for me, but I know it is the right thing to do. It's a good thing to be proactive. Please keep in touch & let us know how things are going with your friend.  Hugs to you for being a Good Friend!  Julee",
      "MessageIndex": 1,
      "PostDate": "11/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708928",
      "Title": "How do i talk to my girlfriend janined86 janined86"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 30, 2008 05:53AM julz4 wrote: SleepyDream, Cathy is right NEVER WAIT, go get it checked out. There is no set pattern for pain. A few people have some many don't. As for discharge, that means something is going on & should be checked on. Discharge doesn't nessesarily mean cancer either. 80 % of lumps come back cancer free. They always should be checked out. Don't beat your self up about not doing your monthly either. Boy have I missed quite a few over the years. It's not the right thing to do but it happens. Go forward from here knowing what your mind tell's you needs to be done. Don't let fear get in your way. We are here for you & will try to help you. The ladies here are great. Keep in touch we are concered for you & like to know how your doing!                          Julee",
      "MessageIndex": 3,
      "PostDate": "30/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708292",
      "Title": "Found a lump...what should I do? SleepyDreams143 charmed-imsure"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 10, 2008 04:54AM julz4 wrote: shells, It's put in there in case they have to go back in. It's a point of reference for anything that might show up on a mammo in the future. My husband wondered if it would move & if so it could end up at my big toe by the time I am 80. LOL! I know it's no laughing matter, but we are waiting for biopsy results next week & just needed a release. Sending b9 vibes to us all!",
      "MessageIndex": 3,
      "PostDate": "10/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/705319",
      "Title": "Inserted clip shells leaf"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 7, 2008 02:13PM julz4 wrote:",
      "MessageIndex": 12,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/708382",
      "Title": "Waiting for biopsy for 2 inch tumor cestovatela Beth1128"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 3, 2008 03:08PM julz4 wrote: Erin, I am truely sorry you are having to go through all this. Please take a deep breath. It's perfectly normal to feel what you are feeling. Everyone on here has felt to some degree what you are feeling. I have not gone through what you have gone through. I had a different kind of biopsy than you. But my dr. told me about an exisional biopsy. If I had one of those I would have had to be out of work for a month. Now don't get excited, my job requires alot of heavy lifting, pulling & tugging. Go under Symptoms & Diagnosis click on screening & testing, then click on biopsy. They have info there on your type of biopsy. I wish I could help you more. This is bad time as it's a Holiday weekend coming up. Just keep cheking in w/us some one will come along & help you soon. I'm sorry your family is not giving the support you need. Sometimes they just don't realize or are scared themselves. They don't like to see their loved ones worry. I'm glad you are following through on this. Please stick with it, BUT KNOW 80% of lumps are B9 meaning no cancer. We will be with you through this. No ? is dumb or silly. I'm so glad you found us, but I'm sorry you had to join us.  A Big Hug to You ~ Julee",
      "MessageIndex": 1,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708476",
      "Title": "25 w nipple bleed & mass/ MRI loc. excision. biposy erin1 charmed-imsure"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 25, 2008 05:35AM julz4 wrote: Hi, Jaly! So glad you liked it......How about this for a visual....Hawaiian Islands, sunset, something fun & fruity with a kick of course. And a couple of nice gorgeous Hunks to wait on our every whim! Oh! & I forgot the dart board with a certain nurses picture on it. LOL! Oh I know I've been married 23 Yrs. today! My husband & I have always said we can look at the menu, but would never order from it!!!!LOL! & by the way I don't drink & never could afford the plane ticket to Hawaii! AHHHHHH! but alas all I have are visuals!!!!! P.S. Don't anyone take me wrong, I GET BY WITH HUMOR! Or I would probably cause the next great flood!",
      "MessageIndex": 26,
      "PostDate": "25/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/705410",
      "Title": "complicated cysts appearances nonspecific jalydiju TexasMelody"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 10, 2008 02:31AM julz4 wrote: Luv ~ I know you all are behind me 100%, You know I'm crossin all I can cross ! I'm just glad I don't have to drink a bunch of water for this Sonogram !  Thanks my precious laugh sis! Sam & Anne ~ I'm hoping for the scar bit too. Ahhhh the monkey chatter is better because I don't have to wait 2 months for test this time & also knowing I have such wonderful support this time the whole way through it! Spar ~ Thank You for the CRAP REMOVEAL ! Oh BTW I told my nurse practitioner about this website. She actually looked it up on her computer right then & there. From the brief time we looked at the site she thought it was wonderful! I'm getting the word out for those in need of us!         Lots of Hugs to all!  Julee ",
      "MessageIndex": 5,
      "PostDate": "10/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708819",
      "Title": "Back on the Roller Coaster Sooner than I thought! julz4 leaf"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 10, 2008 02:47AM julz4 wrote:",
      "MessageIndex": 7,
      "PostDate": "10/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708819",
      "Title": "Back on the Roller Coaster Sooner than I thought! julz4 leaf"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 24, 2008 10:19AM julz4 wrote:",
      "MessageIndex": 23,
      "PostDate": "24/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/705410",
      "Title": "complicated cysts appearances nonspecific jalydiju TexasMelody"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 15, 2008 12:04AM julz4 wrote: O.K. everyone I just came home from the Women's Imaging Center, first time there other than having my biopsy done there. I fell in love w/ everyone there, If that's possible considering what they do to you there! LOL!  Any way here goes. They took the dx mammo of L/Breast, sent me out to wait. The tech that did my mammo came back to check on me made me feel real comfortable said just a few more minutes for the radiologist to finish looking at things. Then another tech came & got me for the sonogram, she said the mammo came back that they could see the marker clip from my core biopsy in May & the radiologist would see me to discuss everything after my sonogram. After the sonogram the radiologist came in & ask me to show him where the lumps I felt were. Also to explain my changes I had been feeling & what my GYN said. I explained to him, then he did an palpable exam of the area & then the tech + the radiologist took a look with the sonogram again. The radiologist told me he DID NOT SEE ANY CYSTS or LUMPS. There appeared to be fibrous changes, that all looked normal. He said everything appeared to be normal on the mammo. Even where the biopsy was done. The clip was in place, & that there was still a few cals from the other spot not bioped. But all appeared to be well with that! He wants me to go back to my GYN in a month to have another BE to make sure there are no further changes with the thickening & the lumpyness I am feeling. I am also to keep my appointment the end of September to have the L/breast mammogram done as was scheduled,to make sure there are no changes w/calcification's. He will look at things further, do a double check. Write a report & send it to GYN. & also BS. The whole center was truly wonderful, I was made to feel like, I'm an adult with a sound mind!  The radiologist was very caring. He said he would not want me to wait unnecessarily & have concerns whether they had turned out to be something or none. There is no need to put myself through that worry! Hardly any wait!  Truly a gem of a place. I feel like my roller coaster has slowed down & I am now geting ready to exit.  YEHHHH!  Thanks you everyone for your caring & concern. I'll still be here, I love all my friends I've made here!        Julee!",
      "MessageIndex": 9,
      "PostDate": "15/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708819",
      "Title": "Back on the Roller Coaster Sooner than I thought! julz4 leaf"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "julz4 wrote: I've been waiting here for a follow up mammo on Micro Calcification's that were found in my yearly in March. I had a biopsy in May it came back B9. I had 2 spots of micro cals but no lump. They were only able to see 1 spot clear enough to Biop. Fast forward till today. I have been feeling a lumpy pea size lump in left breast for a few weeks. It is near armpit at 3 o'clock  2-3 inches from the needle core biop site. Which was at 3 o'clock at the nipple. Monday I called my BS he is out on medical leave for a month didn't want to wait any more! Got an appointment W/my Gyno nurse practitioner. I saw her today. It's not in my head, she is feeling what I am! Plus thickening in the area of lump. She checked right breast for symmetry & said left side is definately lumpier than right. Also before I went did another self check & found another ity bity lump in left breast at 12 o'clock on chest wall up high, this one hurts. She also felt that one too. She went over the Biopsy report from BS w/me, what he said was that the spot of micro cals that he could not biop was at or near the chest wall appearing to be under the arm pit......I go in on Monday July 14th for a DX mammo & sonogram in stead of waiting for a follow up the end of September. So I'm still here & waiting W/new worries. Ahhhh the roller coaster ride 80% will be Heaven (B9) or 20% it will be H@!!. Some relief that I wasn't feeling imagined lumps. But oh the clakety clack of the coaster track.  Thank you all for being here even for us that get on & off & back on the ride!   Julee DX Papillary Thyroid Cancer 2/15/2018, DX-5/15/2012, Partcial Mastectomy 5/22/201, DX-5/30/2012, Tumor DCIS/MI 2.8cmStage T1, Grade 3, 0/2 nodes, ER-PR-. 9-/25/2014 Review of slides with new Dr's at Hopkins 1.5mm invasion found. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708819",
      "Title": "Back on the Roller Coaster Sooner than I thought! julz4 leaf"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 5, 2008 12:32PM julz4 wrote: SJacques ~ I am sorry you are having more issues. It can be very scarey having new things crop up after a BC diagnosis. My suggestion is you should post this ? to the girls under the DCIS forum.  Start your own topic in both places here & the DCIS forum. You will get a quicker response from the girls. When you add on at the end of someone else's post sometimes it gets over looked. When someone is DX with DCIS there is a chance that it can show up in the other breast. Breast Cancer is NEVER predictable. Although chances are it's nothing you should call your BS & have them decide what your lump is all about. Mammo is a good tool to see things, but it has been 8 months. PLEASE CALL YOUR DR.  Please keep us posted on how your doing. Hugs Julee",
      "MessageIndex": 8,
      "PostDate": "05/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/718911",
      "Title": "ultrasound results earth TheQu33n"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 29, 2008 01:53PM julz4 wrote:",
      "MessageIndex": 14,
      "PostDate": "29/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708258",
      "Title": "Worried and waiting mom2girls mom2girls"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 30, 2008 05:29AM - edited Jun 30, 2008 05:29AM by julz4 Cathy ~ Sorry you had to join us. But we are glad to help ya. Ahh, those chattering monkey's as we like to call them. You know what we have an intuition for a reason, go with it. Not saying this to scare, just for you to be proactive. I'm glad you are following up, stick with it & don't let the doc's talk you out of a biop. Our motto here is best lump is the one in the jar, meaning get a pathology report on the lump. Please keep us posted as to how everything is going. My thoughts are with you. Julee",
      "MessageIndex": 3,
      "PostDate": "30/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708192",
      "Title": "Yet again...?? CathyaMom CathyaMom"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 1, 2008 03:14PM julz4 wrote: I'm sorry to here your still in a lot of pain. Everyone reacts different w/pain. How many inches is the incision? It is still surgery even though it is a biopsy. You say it was deep, that means they had to move lots of tissue to get to where they needed to get to. You are not a baby. Our boobs are very sensitive it will take time. I went for a stereo needle core biop which only required me to be off for 1 - 2 days. If it had been the same biopsy you had, the Dr. told me I would have to be off work 1 MONTH. There is a difference. Remember to make sure to keep the incision Dry & Clean. How does it look. If you run a fever, the incision starts to drain or gets red & or pussy. Please call your Dr..  If by tomorrow afternoon it still hurts so bad, maybe you should call him anyway. Keep in touch let us know how your doing.       Gentle Hugs to You!  Julee.",
      "MessageIndex": 1,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708362",
      "Title": "Should this still hurt? Teaches snowyday"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 18, 2013 02:45PM julz4 wrote: Sparky get in touch with the American Cancer Society in your area. They can probably get you in touch with some Trasportation. They also provide many other services!",
      "MessageIndex": 40,
      "PostDate": "18/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/805273",
      "Title": "Well, this sucks Sparkytheimp cmharris59"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 17, 2008 08:31AM julz4 wrote: I am so sorry you had to encounter an insensitive clod! I work w/one. She is always making holier than though remarks. I was talking to my nurse Supervisor (I am a CNA) about all the stuff I was going through w/my breast issues. When this B@!*^ made a comment, 'I wouldn't worry we'll all get ca or something at some point & die'. Her family is full of cancer so I'm sure it bothers her more than most. Little did she know that her grandchild would be born just weeks later W/ a possible fatal cancer like disease. Unfortunately what goes around comes around. I did not wish this on her & so wish that it did not come to the one that is Innocent.  But little do we know what could ultimately happen, when one professes such a comment. Somehow I don't think she ever thought about how she comes across & still doesn't. It's nice to now we can come here & be understood. Julee",
      "MessageIndex": 5,
      "PostDate": "17/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/709171",
      "Title": "Very Angry! LisaG42 BessB"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 30, 2008 05:52PM julz4 wrote:",
      "MessageIndex": 5,
      "PostDate": "30/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708192",
      "Title": "Yet again...?? CathyaMom CathyaMom"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 22, 2008 01:52PM - edited Jun 22, 2008 01:54PM by julz4 Dear Longhorn, Bc really sucks, but we will all be here to lend what ever support we can. The girls here are truly wonderful as you already know! As for Stevie, I know we are supposed to be supportive. But I'm wondering if she is having a really ruff time of it & just can't seem to wrap her mind & heart around the injustice of all that the women here have to go through. In reading the posts myself. It can be way over whelming what some of these women have to go through. Added to that the shoe may be on your own foot too. Can send you into a tailspin. Everyone has had days where they have just lost it. Maybe that was what happened & she wasn't thinking clearly. She just found the wrong thread to do it on. She was really new to the board when she posted & hasn't been back since she last posted..... Any way!   AN ALL ENCOMPASSING BIG BC.ORG GIRLS HUG GOES OUT TO LONGHORN! MAY WE BE THE LIGHT TO SEE YOU THROUGH THIS!                                             Julee",
      "MessageIndex": 20,
      "PostDate": "22/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/706982",
      "Title": "Ready To Hear PET results LongHornSurvivor crazydaisy"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Mar 10, 2009 10:54PM julz4 wrote: Celebrating for a week sounds Great Faith.... EBW......I wish I had a Voice like hers.....it is beautiful! Saint.....Happy Happy Birthday Baby!!!!!",
      "MessageIndex": 38,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730365",
      "Title": "Happy Birthday Saint!! faithandfifty hollyann"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Apr 18, 2012 07:16PM julz4 wrote: Oh forgot to mention that a lymph node was felt by my BS's palpable exam which hurt. Also reviewing last years mammo views there was a visible node on my mammo. But because there was no changes to my mammo from the year before. The BS thought it was just a response to something my body was fighting. He will be looking closely at my lymph nodes in the MRI. The waiting is hard. The first time was almost 3 months from yearly mammo to biopsy results. I also did 2, 6 month follow up diagnostic mammos. Watching some micro cals that couldn't be seen well enough to biopsy. Now I'm into this a month already. It won't be till the 30th that I get the MRI results & set the surgery date. After about a month of waiting into the 6 month recheck. I thought of it less & less. By the 2 end 6 month wait it was even less as the fist wait -n- see was clear. But everyone is different & we handle this in our ways! NOT easy for sure!",
      "MessageIndex": 80,
      "PostDate": "18/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Apr 22, 2012 02:32PM julz4 wrote: I hear you loud & clear Micho! It's not that we want this, nobody does! But deep down in my gut after the only other biopsy I had 4 years ago. I just thought this is the beginning for me & this isn't over by a long shot. I have just been observant & cataloged symptoms in the back of my mind till something told me to sit up & take notice! I have had the same BS since the first biopsy. He sees me every year within an hour of my yearly mammo. Does a breast exam, answers ?'s, concerns & then goes over my mammo that I just had done. When I had a problem early this year he was there for me! It's like we wait for the other shoe to drop! You know it will you just don't know when! I'm sorry this has decended upon you at such a young age! But I'm glad your being so proactive about it. Please keep us posted as to how everything is going!",
      "MessageIndex": 83,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 8, 2012 05:46PM julz4 wrote: I heard from the BS today on the answering machine (I work nights & sleep during the day). Anyway I am going in Thursday at 3:45 for a needle core biopsy & placement of clip. That way they know what the next surgical step will be. Lumpectomy if cancerous or just mass area removal if just ADH or AH cells only. While I am there he will be looking at the lymph nodes under my arms with the US as they were suspicious also. This will be done in his office. Nervous!!! I did a core biopsy 4 years ago at this exact time give or take a few days. Just nervous about the results!",
      "MessageIndex": 112,
      "PostDate": "08/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 17, 2012 07:42AM julz4 wrote: Thanks for checking in \"Chickenpants\".  Although I haven't had surgery yet mine is turning out to be more than we expected!  I saw the BS yesterday & surgery is set for this coming Tuesday May 22.  In the path report it was found that my tumour is ER- & PR-....with a grade of 2-3.  Thus probably no tamoxifen for me.  But the possibility of Chemo.  We have to wait for the path report from the surgery to come back as they need to look at the other tiny area that showed up on my MRI.  With each new finding my head is spinning more.  Even though NO IDC was found in the cores.  More waiting....so far unusual results.  So many layers to my results & with each one more concern!  I keep forgetting I not with this group anymore....I hope you don't mind me popping in!",
      "MessageIndex": 129,
      "PostDate": "17/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 10, 2008 08:14AM julz4 wrote: Stephanie, The reality can be such a shocker. Before I had my biop. I went to a bra shoppe, they have so many boob enhancers these days, silicone, foam & heck even water filled bras! I hope when your healed that you can find something to make things appear on the OUTSIDE back to what they were before. Especially in your swim suit. There has to be something to make you confident on the outside. We don't like people to look at us & wonder whats wrong with us. It can shake our self confidence. Because you know how the mind wonders. When I had a needle core biop they said they would take 4-8 2 inch cores (that would resemble spaghetti) for each spot. So for that would mean possibly up to 16 2 inch pieces of spaghetti. You can imagine what I was thinking about when I had that for dinner a few days later, (not to gross anyone out) I even cut up 16 2 inch pieces of thin spaghetti. Just to get an idea what could ultimately would come out of my close friend. Only 6 came out of my left, the smaller one. For me only I can tell. But my nipple on that breast tips up now. I can see it when I look in the mirror. I know this is not what you have gone through, far far from it. Every person is different, & I'm happy to announce I don't look like crooked head lights anymore! That biopsy was only the beginning of May 08. Not that anyone could tell on the outside. But I will say my lefty does appear a little smaller than it did before even though I had just that small amount out. But I think only I can tell! DH cant' tell! !  Wishing you the best on this NOT FUN journey! As I send B9 thoughts your way! We are here for you! Day & night!    Julee ",
      "MessageIndex": 4,
      "PostDate": "10/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708756",
      "Title": "Excisional Biopsy...cosmetic questions? KnitWit ravdeb"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 31, 2008 05:01PM julz4 wrote: Stephanie, Ahhhhh! It's so nice to be home in your own bet & sheets! I'm glad it sounds like your doing pretty good. The other girls are right about the pain meds. Research has been done about pain & healing. They say the more comfortable you are (pain free or reduced pain) the better you heal! You can rest better too & don't feel so stressed out. It all interferes with the bodies ability to heal! Just some thoughts from someone who has had many other types of surgery! I've been under the knife 14 x's in my life. Some not so invasive, others more so. Take Care, lots of rest, & A LOT OF TLC FROM THE GIRLS HERE!       Gentle Healing Hugs from Julee!",
      "MessageIndex": 4,
      "PostDate": "31/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/706540",
      "Title": "Back home after duct excision stephanieb zen_capricorn"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 24, 2013 11:52AM julz4 wrote: Went for my 6 month check with some concerns.  The tech took extra views & then I had an US.  Nothing of concern was seen.  I still have a few small seromas, scar tissue from my surgery & radiation.  I then go over right after for an exam by my breast surgeon.  He goes over all the views that they took at radiology.  He found in his papable exam an inflamed node in my axillary area.  In fact right in the crease.  He has to raise my arm press in bring my arm down & then rub the fingers down to feel it.  It's not real large & he is not too worried.  So I went back last week again as he wanted the Radiologist to do another US with biopsy if needed.  Everything got messed up & the tech did it & no immediate report.  I then had an appt. with the BS right after.  He was not happy as no report or Radiologist.  So if the report comes back this week good he will have me come back in 3-4 weeks for HIM to US in his office & biopsy if still inflamed.  If there is a ? about it  by the Radiologist I will go to my BS ASAP & he will do the US & biopsy.  He says a little less than 10% chance of CA in the node.  My tumor was DCIS with 3 spots of micro invasion.  ER, PR negative.  33 rounds of RADS no chemo.  The tumor was 2.8 cm grade 2-3 with 70% necrosis.  So \"IF\" this node ends up having cancer does that make it \"WHAT\"....stage 4 or what.  I know chemo will happen....but what beyond that?",
      "MessageIndex": 1537,
      "PostDate": "24/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 7, 2012 01:51PM julz4 wrote: Graced you have graced us with a wonderful prayer to help us see the light through which only darkness was being found! Thank You so very much! For the only day that I truely felt a sense of peace was back the end of February the day I was laying on the US exam table waiting for the Radiologist to come in to talk with me. I KNEW but not really that it was cancer & that I could do this! I was gonna be OK. Such a wonderful calm came over me! It wasn't till the middle of May till I had my diagnosis from pathology that I KNEW!",
      "MessageIndex": 85,
      "PostDate": "07/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 7, 2012 01:58PM - edited Jul 7, 2012 01:59PM by julz4 Onvacation my Rad Onc nurse told me several weeks ago to start putting lotion on it. I've been using St. Ives naturally soothing body lotion with Oat Meal & Shea Butter. I already had it in the house & the bonus is it's PABA free. It does have alcohol so it might not be good after you start. I sweat so much at work last nite I could feel my boob getting slimy with it. It was / is so stinkin hot! Over 100 today in PA! My cotton bra was soaked this morning when I got home!",
      "MessageIndex": 86,
      "PostDate": "07/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 9, 2012 06:44PM julz4 wrote: Cheers for a smooth start & Cheers for the others about to start! All went good today!  The RADS nurse was very specific as to what she wants me to use.  Calendula lotion by Boiron.  She gave me a bottle told me to use it very Liberally 2x's a day & she would give me a bottle as I need it....don't skimp on it!  Dove unscented soap only & as I'm not getting treatments to my axillary area I can use a tiny bit of deodorant Dove unscented also.  She will let me know when I am to use anything else!   I went to Wally World & got pack of 3 all cotton shelf  Jog bras in size 40 band size.  I'm a 36 so it's plenty big & I won't be falling out the bottom of it.  They give some support  but are over-sized enough to be outside the area of target.  I also got my last Tattoo today.  What a breeze & I didn't feel a thing.  Right at the edge of the areola....not sure why the other tatoos hurt so much & this one not a bit.   Onvacation I'm sure every place is a little different.  But my first time they told me ALL about Radiation & the treatments.  The nurse took an in depth medical history, & did an exam of my breast as I had had surgery.  I guess most of us do before RADS.  They brought me back last Monday to do the Simulation & it took them a week to do the planning.  I think the RADS ONC works with 2 or 3 others to plan my treatment.  My first appointment was 1 1/2 hours with the Dr. & his Nurse. Butterflylady sending sending extra soothing thoughts as my emotions have been all over the place for the past few days.  I hope yours goes over in the blink of an eye just like mine did!  In fact they were all please & thought mine was super fast for the first time!   Thanks Vacationbound for the heads up on the Natural Rays!  My RADS nurse said I could use  Hydrocortisone cream mixed with the Calendula cream she gave me today.  She said women tend to get very itchy between their girls, the cleavage area.  As always ask your Dr. if they haven't said you could use it.  ",
      "MessageIndex": 101,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 9, 2012 06:57PM julz4 wrote: Teacup what a big LET DOWN!  You spend all that engergy Mentally Prepairing yourself then poof!  I'll be thinking of you tomorrow & hope all is up & in working order!  Thanks Teacup crying does help & I really haven't let myself do much of it!  Even though I have treatments every day now it's just been not stop go with everything else this beast puts us through!  Life has kept me busy also & I guess now that I'm getting back into a routine post surgery, back at work.  It's hitting me some how! Lyrics from Hootie & the Blowfish come to mind.....Let her cry...if the tears fall down like rain Let her sing...if it eases all her pain....",
      "MessageIndex": 103,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 13, 2012 04:22AM julz4 wrote: Hi ALL sorry I haven't been on but I'm still feeling really icky!  The nurse gave me a prescrip for 30 Zofran with a refill.  When I was in getting my treatment today the one nurse or tech told my DH that she has only ever had 2 women have a reaction like me with the nausea on the first day & I was #2 !  It's rare to get it this early but it can happen after a few weeks, but is uncommon.  Yesterday I had a really bad headache too, as RADS can cause dehydration.   I wasn't getting enough fluids because it's all I can to even want to drink.  I started taking a full Zofran & am just putting up with the sleepyness. The nausea is some better tonight & was finally able to eat my first full meal since Monday night.  So far OK!  As for LEFTY the nips a little pink & so are the 2 scars from surgery.  Feeling a few twinges of pain in the scars & tiny bits of itching in different areas over LEFTY!  But the nausea far out weighs those tingles!  Isabelle yes I do remember.  I'm glad your getting everything started & closer to home.  I guess I am spoiled as the RADS place is really close to home for me.  6 miles about.  I saw a social worker on Wednesday as it's provided for all the cancer patients at Center for free.  She said that it's very normal as time goes on for the weepyness to start.  As things start to calm down & especially after the treatments end.  You have more time to think & the Dr. appts. slow down & some sense of normalcy creeps back in....the mind gets a chance to catch up to reflect, dissect all that has happened over the last months.  It really hits you.  Added to that is the deletion of those hormones because of your meds.  I am not taking any meds for the hormones but still I get teary eyed at the drop of a hat. It's all hard sending gentle hugs. Kjiberty I hope I feel better soon too as this is gonna be worse than being pregnant the way it's going.   Babette thanks this one has thrown me for a loop....as I didn't expect this from RADS!  I've been passing this older gentleman everyday on the way out at the door into the treatment rooms.  Today I said to him \"We have to stop meeting this way\"!  He's the only one I see every day.  A woman just 2 days ago had one day to go....but I don't think there is any bells, beeps, or whistles here at the finish line.  The Harley Dealership is in front of the place I get my RADS.....might be nice to go for a Ride on a HOG as a special way to finish my RADS!  Teacup I didn't realize it was one either.  I googled it after I started feeling sick.  Some say it is & some don't!  For all those that say not....tell that to my tummy!  Have a wonderful time with your sister! Graced sometimes the older Dr's have wisdom that the young pups haven't had the time to let sink in yet.  Mini space invaders! LOL!  How about Dr. Spock & Beam me up Scottie!  That thought crossed my mind!  Butterflylady the wonderful JT!  I'm glad your first went well for you!   Belinda I'm sorry they had to postpone your RADS another week.  But I'm sure it's best for you to be healed first.  But I understand as It would have been better for me to have my RADS started before I went back to work.  But that didn't happen as the Dr's were waiting for my BRCA testing first before starting.  It sure is a let down. I hope I didn't miss anyone....if I did I'm sorry as I tried not to!  I'm fading & need to get some sleep!  Night ALL! ",
      "MessageIndex": 141,
      "PostDate": "13/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 20, 2012 07:04PM julz4 wrote: Your Welcome Babette I hope it helps!!!! IT'S the WEEKEND!!!!  YEAHHHHH!  ENJOY!",
      "MessageIndex": 172,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 4, 2012 01:47AM julz4 wrote: Kj if you are referring to my work. Let's just say that others have milked our previous policy. We had 12 points before & you were out the door. A point could be several days because of being really sick. But 3 or more days in a row has to have a Dr's excuse. So ultimately some one could call off 20 without a Drs excuse in a year. But that point is a rolling year. Meaning if I called off July 1 this year without my FMLA that point would not be deleated until 2013 on July 1. Many milked this & would call off within days of loosing a point but still keep under the radar with just a verbal warning. They had patterns of calling off the same days all the time....ect. Never seemed to get in trouble. All of mine have been legit over the years! But lately trying to get off for surgical procedures in a 2 week time frame is impossible without calling off. Thus forcing me to call off because I would have to wait 3 months to get a PTO day for it. That happened last year for a colonoscopy & endoscopy I had to have so I could swallow food! I couldn't get anyone to work for me & I had to wait 3 months for the schedule to open for me to get it done. I called Off! Thus garnering me another point! Others have ruined it for me & others that truly NEED it! Carma to them as one day it may come back to bite them in the....",
      "MessageIndex": 307,
      "PostDate": "04/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 8, 2012 03:46AM julz4 wrote:   Again I have hit the \"Remove from My Favorited Topics\" button!  I have missed 4 or 5 days on this thread! 22/33 done!  So very very tired tonight.  I can't call off as it's too late now. Gotta drag myself into work again.  I just want to take off the rest of the time till I heal! Coughing, sore throat for a week now.  RO said if it get worse or not better by Friday then he will give me something for it.   Kj....yeahhhhh for getting your dress fitted & figured out!  Babette....I am so sorry your going through this.  Besides the skin not being good.  Your plans are being messed with.  We have no control with this DX & just when we think we might have a little, snap it's gone!  Besides the SE's it throws us into a tizzy of emotional mess!  Gentle Hugs! Isabelle....Awwww sweetie it can be so emotional at the least expected times!  That is such a long time.  I'm so glad your DH got to be with you.  That is good to have that kind of connection with a loved one that really get's a look at the nitty gritty.  My DH has a special look in his eyes as he ask's me how I am doing.  He know's I'm going through so much!  It makes me that much closer to him.  Yeah Lana!  I hope it misses you all together! Grace I'm sorry your going through so much.  I can't wait to get my Bra off after work.  Did you say ITCHING!!!!!  Oh how I wanna scratch!!!!!  I have had a little, nothing I couldn't control with the cortisone cream...until tonight!  The Chocolates sound wonderful for them as well as the cards what a lovely thought! Hi to ALL & Everyone!  Gotta go get ready for work!  Night Nite!  Sleep Tight!",
      "MessageIndex": 356,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Sep 7, 2012 07:55PM julz4 wrote: Hi Isabelle,  I've been reading when I have time from work.  My boys are back in school & they are both sick.  Just don't feel like posting much.  I hope you can get some rest & you will perk back up.",
      "MessageIndex": 635,
      "PostDate": "07/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 7, 2012 12:16PM julz4 wrote: Ali....in the UK & Canada there protocol is different from the US.  WE (the US) is doing trials now with 16 treatments to see if they are as beneficial on several different things.  Your getting a stronger dose every day for a shorter time.  If you need boosts as we get in the US they are done concurrently meaning the same time instead of separate like in the US.  Your still getting a hard dose dear.  I think either way dose the same thing.  But as 2 which causes more SE's or a better cosmetic outcome is what the US is into looking at amoung maybe some other things.  I was gonna be in the US trial but one of the criteria I missed & didn't qualify.  I would of been done over a week ago.  I now have 11 more days to go almost 2 weeks!  It will fly by....Along with those PROTONS!!!!  Very QUICKLY I hope!  I have a cough now with a sore throat & trying NOT to cough for the whole 5 minutes is trying!  Slowly!  But luckily it's not getting worse, no fever, just hate feeling yucky!  Chapter 4 although many of us do a number of different combos of meds.  Is seems Most everyone (not all) ends up with RADS.  Some that have no CHEMO breeze through & some don't.  Some who have CHEMO breeze through & some don't!  You just never know.  I thought I would have more skin issues as I am very fair.  It's not too bad, I'm doing it!   As for other weird issues that's hit me.  Well I reserve the right to have my mind changed as to final treatment is done & this short chubby lady SINGS!!!   I'm having a better moment right now & am some upbeat.  But believe me like many others....Your feeling or similar have crossed our paths multiple times!  We live for moment to moment!  Today while lying on that cold table waiting for the days first Zap....Out of the stereo speaker comes.....\"Looks like we made itttttttttt!\"  Yep good ole Barry Manilow!  I almost laughed what Mood Music today!  His opinion of MADE IT & mine were MILES & SHEETS apart for sure! SHEESH!!!!",
      "MessageIndex": 412,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 15, 2012 07:15PM - edited Jul 15, 2012 07:19PM by julz4 Hi All, I've been over at July Rads. I started RADS last Monday 5 done & 28 to go. I see most of you here have had Chemo. My ? Is how did you deal with the Nausea. 16 hours from the start of my first RAD treatment that is what I am dealing with. They gave me Zofran & it does pretty good but makes me tired on top of already feeling tired from the RADS. Yeah you read right I am nauseous they said every once in a blue moon someone gets it from the start & it happens to be me. My fair skin is already showing pinkness, itchy & aches too. But it's the nausea that's by far the worst, as I don't want to eat or drink much. It was thankfully a little better over the weekend. I hope everyone who has started has a good week & minamal or no SE's.",
      "MessageIndex": 166,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 12, 2013 07:57PM julz4 wrote: Papillon....first off Big Hugs as this is not easy on so many levels.  I am not stage IV but read here sometimes & just happen to read your post.  I am a CNA in nursing/rehab.  I have taken care of patients in the past year with brain cancer & also BC brain mets in the past.  I also have a niece who has been battling a brain cancerous tumor for almost 20 years now.  As with Alzheimer's cancer eats at the brain slowly or fast.  Agitation can be a big problem as they know something is wrong but then as it progresses they can loose the reasoning to know why where & how.  All depending on the part of the brain that is being effected.  They can forget words to communicate effectively with us & thus creating agitation.  Pointing out this albeit with love & humor can increase this agitation on many levels & for many reasons.  I try & remain calm.  Some of the biggest points to remember as the memory fades is taking care of their daily needs as their ability to communicate their need fades.  Our daily activities....Food is she hungry?, thirsty?, does she have to go to the bathroom?, does she have pain?   Try to remain calm, use diversion, change the subject, too much noise, boredom.  It's like taking care of a baby/young child as they can't tell us anything & we have go through a list of things to figure out the right key!  Except this happens in the reverse in cancer patients at different levels.   We treat them as adults & I try to ignore the mix ups & guide where it is needed because humor & reasoning may be lost to them at some point but still can be used.  Frustration that they can't do for themselves let alone the ability to communicate what, why, where, & how!  Maybe a support group for caregivers can help lead you in the right direction.  Her Dr's office should be able to help.  Infections & pain can cause changes also in the ability to communicate effectively & mental abilities.  All the while YOU are dealing with the loss on many levels!!!!  Please PM me if you have any ?'s  I will try & help where I can.  Just remember there is No right or Wrong!  Only Love!  I hope this helps!",
      "MessageIndex": 1508,
      "PostDate": "12/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 15, 2012 09:24PM julz4 wrote: Slak & Onvacation....apparently it's not something that happens often.  But usually shows up a few weeks into it.  My DH said one of the Techs said she had only ever seen 2 people ever get nausea from the starting gate.  I was one of them.  The first few days were really bad.  I have Zofran for it.  But am only taking when really bad.  Eating something light does help some & gingerale too.  But I also have gerd so it's a catch 1-22 as soda makes the gerd-acid reflux act up.  I take nexium but that doesn't help with the nausea at all.  But prevents the nasty heart burn I get.  Onvacation....I work nights so when I get home in the morning I run into the shower & then to RADS (7:45 am).  I don't/shouldn't eat before bed as that makes the Gerd worse. So as soon I get home I am off to bed.  At least my RADS nurse didn't hesitate to get me something for the nausea ASAP!   Slak how many days do you have done so far?  How many to go?  ",
      "MessageIndex": 170,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 15, 2012 09:55PM julz4 wrote: Thanks Kj.....I know it can happen for different areas of the body getting RADS.  But not for BC usually.  Although I wonder with my Gerd as I did have to have my esophagus ballooned to open it last summer due to scaring.  Also the nurse was surprized by it but didn't think it was unheard of.  Oh well I had a feeling I wasn't gonna sail through all this with out some hiccups!  I hope this is the worst!  I deal with it....but don't like it.  But then who does!",
      "MessageIndex": 179,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 28, 2012 12:57PM julz4 wrote: Butterfly my SIL has a thyroid problem & had BC 5 years ago.  She went through 6 weeks of RADS.  I don't think she got anymore tired than anyone else here.  Anymore symptoms.  There was a thread a few years back about whether you had hypothyroidism before you were DX with BC.  I don't know where the thread got to on here but it might have some discussion about what your wondering.  After reading much & I'm sure others will agree everyone is different some ride the norm, others either do better or worse than the norm.  You might want to talk to a Endocrinologist if you don't have one already.  Just a thought.  I hope you breeze through with the best of them!",
      "MessageIndex": 70,
      "PostDate": "28/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 15, 2012 09:48PM julz4 wrote: Onvacation good luck with your simulation!  It was easy for me....although I wasn't a lover of the Tatoos.  I'm not a wuss about it but I don't like needle sticks.  I thought it wouldn't hurt.  I did feel mine & wasn't prepared for it.",
      "MessageIndex": 177,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 15, 2012 09:57PM julz4 wrote: No Tatoos!  Good for you!!!  Well I will catch up another day as I have to go to work & am on for the next 4 nights off 1 then on 2 more!  My LONG week!  Good Night! Take Care & Thank You for asking your sister Kj!",
      "MessageIndex": 180,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 5, 2012 06:35PM julz4 wrote: Kj is does stink! A few years back one of the employees on another shift had a car accident on the way to work so obviously couldn't come to work & also couldn't give her 2 hour notice. I believe she got a point for that! I hate calling off because I hate being the one on the recording end of less staff. But sometimes it can't be helped!",
      "MessageIndex": 320,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 5, 2012 06:54PM julz4 wrote: Ps....TAB that should of been Righty instead of eighty! Gotta love spell check! Thank goodness it didn't put a bad word on there! ; 0",
      "MessageIndex": 322,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 10, 2012 04:16PM - edited Aug 10, 2012 04:19PM by julz4 I am so glad it's Friday & I'm going to see the Dr. this afternoon!  Didn't sleep well last night as I have off now till Sunday.  So I go in for my Zap this morn.  As I'm in the dressing room going through my routine of standing in front of the Mirror putting my Calendula on first.  Then the  Auquaphor on my nip....I'm in mid swirl on the nip when the door opens!  Oh! Says the lady & she closes it quickly & leaves.  DUH....I forgot for the first time to lock my door.  In ALL the other weeks that I have been coming I ALWAYS locked the door & no one has ever rattled the door knob.  The first day I forget & whoosh!   Oh well it was a woman & I think she was embarrassed more than I was.  I just hope she didn't think I was playing tiddley winks in the changing room! !  LOL!  I think she is new, as I've never seen her before.  She will catch on to the ropes soon.  Although she may not be there for the same as me.  Mmmmm  There was a man that finished his RADS last week for head & neck cancer.  He did Chemo at the same time!  He's in his 70's. Well I just got call from the Dr's they are moving my appt. time up & I gotta go.  I will catch up with all of you later!  Woo Hooo It's Friday....Only 8 more to go!  Big Hugs to you ALL!!!!   We can do this!!!",
      "MessageIndex": 387,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 23, 2012 02:35PM - edited Aug 23, 2012 02:35PM by julz4 I'm done....first day I didn't have to run....well that is to RADS.  My 2 youngest sons started school yesterday.  So I am still running them to the bus stop in the morning. Thanks Mini!  My lefty is less red all over already.  But then I think it's because I was just having my boosts the last week.  As for me being sick through this I think it has to due with the sucky immune system I have to begin with before RADS.  Again I am sick with a nasty head cold, just after finishing meds for Bronchitis.   Because I work with sick people I tend to pick up more stuff to begin with. It's gonna take time to build my immue system back up. Can anyone suggest any suppliments that might help?  I started my B's, D, & CoQ 10 back up this morn.  I plan on getting Turmeric & have been taking my fish oil all along. Yeah Babette!  I'm glad it's turning around quickly for you.  I hope school is going well for you. Belinda...your getting there!  You will be done before you know it! Kj your getting closer too.   Teacup your almost done!   Jag yeah you beat me to the finish line! Isabelle I hope your holding up ok!  Onvacation I'm hoping things are still not too bad for you.",
      "MessageIndex": 519,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 24, 2012 09:32PM julz4 wrote: Enigmas....I have had nausea since day one of RADS!  Is this the first it has hit you or has it been coming & going for days?  I know others have had it but it started weeks into treatment.  I went to my GI Dr. as I have acid reflux.  My GI said she see's patients who go through RADS that complain of nausea....a queezy yuck feeling.   Gingerale helped me or try coke, along with smaller meals with protien.  I was also given an anti nausea med. that helped a lot.  Talk with your Dr. see what they can do for you.  But don't suffer through it.  As I lost 4 pounds in a week because of it.  They don't want you to loose weight during RADS.  I hope you feel better soon let us know how things go.",
      "MessageIndex": 533,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Sep 18, 2012 12:58AM julz4 wrote: Isabelle....such a sweetie! I sure hope the pain goes away sooner!!!  I am about a month out now.  The redness is all gone, just some brown under the breast & occasional itching.  All the dark color peeled off along with a few tiny moles that turned black on the nipple.  I am having more pain/aches that I had from the node surgery.  They were about gone but are starting up again.  I am sure all that has to do with my job.  I have had a lot of 1 on 1 duty with fall risk patients lately & have to push them around in a recliner for 5 to 8 hours of my shift. A lot of pulling them back into the recliner to keep them from flipping themselves out of the recliners.  My left under arm & back of my upper arm gets more numb sore heavy feeling.  Getting my energy back.  Just wish I could sleep better, 4 or 5 hours is all I can get for a few days in a row.  Then I crash.  My boys are ok...everyone is on the mend as we have been in & out of the Dr's the last few weeks with Strep & viral gunk.  As for your Trip!  If you happen to take Route 15 through PA let me know maybe we can meet up!  That would be wonderful!  I have met 6 ladies from these boards over the years!  That would be such fun!  November is so pretty with the leaves although you will see better south of PA as we are just past peak for the best leaf color when you start your trip!  Keep me posted!  A trip is just what the Dr. should order & pay for (wink wink) for us ALL!",
      "MessageIndex": 701,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 13, 2008 02:43PM julz4 wrote: Lisa G How you doing! I hope everything goes well for you tomorrow! I go in for test's tomorrow. Sonogram & mammo again! Still having problems with the left breast, now I have a few little lumps. So I'm still waiting with everyone else here! Sending B9 thought's our way!  I hope your monkey chatter is O.K. today!  Julee",
      "MessageIndex": 3,
      "PostDate": "13/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708704",
      "Title": "Lumpectmy Scheduled 7/14 LisaG42 LisaG42"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 29, 2012 04:16PM julz4 wrote: Good topic .... I'm almost 1 week out from partial mast. & SNB.  The hair is a 1/2 in long already.  I didn't think to ask...I guess I'll have to get an electric razor.  I would think that if you wax you could get an ingrown hair.  This wouldn't be good.  I do have the electric clipper though.  My SIL who had DCIS said you can't shave during RADS....does this also mean NOTHING at all even an electric clipper?",
      "MessageIndex": 5,
      "PostDate": "29/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788221",
      "Title": "How long to wait to shave underarms after a mastectomy and SNB? Soyaandpepper MFalabella"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 7, 2012 01:11PM julz4 wrote: *",
      "MessageIndex": 840,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 14, 2008 06:04PM julz4 wrote: Hi Donna! So sorry you had to join us, but we are glad to help you through it. The  waiting is so awful, but  Dukemom is right we all feel so much. When not much is known & those dam monkey's can reek havoc with our heads. I'm glad they are getting you through faster than I did (although it's never fast enough). The ultimate fast would be All done within 1 week LOL! You know mammo & consult in 1 day WITH the Doc & Specialists docs too! Plus any additional tests needed within 2 more days special mammos, sonograms, MRI's. Same day Biops with Path report result in docs office within 3 hours of biop. Everything all done in a week. If they have a team of people to make a car in a day why can't they find a way to speed up this process. Oh well one can only dream! I know we are human & not a car but some how.........I too had my 2end mammo come back birad 4. Oh it is very scary all those monkey what if's. I waited from March 8 the day I was told to come in for diagnostic mammo. I had to wait 3 weeks for that mammo. But I was told same day that I needed a biopsy. Some of the wait was due to me wanting a bc doc to do my biop so I waited a few weeks longer for that. My bc doc was pretty good about moving things along. Anyway when almost all was said & done. I finally got my results of b9 on may 14 from the bc doc. I had a stereo needle core biop. Unfortunatly the doc could only see 1 spot of micro calcification's clear enough to biop. I had 2 spots same breast (L) close together to biop. Now I have to go in the end of Sept. to do more mammos to keep an eye on the other spot. Any way I'm beginning to feel like the queen of the waiting game. OH I KNOW THERE ARE OTHERS OUT HERE THAT WAIT WAY LONGER THAN ME. All I'm saying is that it could be 2 weeks or 2 years of waiting. Oh but it feels like for ever. I come here to wait with the rest. With the squirrels, the white elephants, & the chattering monkey's. We all are here in various stages of this journey to help one another out!  Hi, I'm Julee & I'm one those chattering Monkey's LOL!",
      "MessageIndex": 19,
      "PostDate": "14/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704709",
      "Title": "BIRAD kathy46 Donna1843"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 14, 2008 10:22PM julz4 wrote:",
      "MessageIndex": 25,
      "PostDate": "14/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704709",
      "Title": "BIRAD kathy46 Donna1843"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "julz4 wrote: This Post was deleted by julz4. DX Papillary Thyroid Cancer 2/15/2018, DX-5/15/2012, Partcial Mastectomy 5/22/201, DX-5/30/2012, Tumor DCIS/MI 2.8cmStage T1, Grade 3, 0/2 nodes, ER-PR-. 9-/25/2014 Review of slides with new Dr's at Hopkins 1.5mm invasion found. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/786914",
      "Title": "Waiting on MRI ?'s....waiting, waiting, waiting! julz4 julz4"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 30, 2012 03:29PM julz4 wrote:",
      "MessageIndex": 84,
      "PostDate": "30/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 15, 2012 09:44PM julz4 wrote: Kj.....ask your sister if she has ever come across anyone getting BC RADS that ended up having nausea.  Some say it can happen & others say no way!  I'm thinking I am more susceptible because of my Gerd.  I sure didn't see this happening.",
      "MessageIndex": 175,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 7, 2012 07:46PM julz4 wrote: January I went Walmart & got the fruit of the loom all cotton jogging shelf bras. 3 in a pack for $10. I am a small 36 C & bought size 40's. They have shrunk a little through washing. I believe they go to a 44. Not sure. You want them big so they go beyond hugging under your breasts as not to rub. Many have gotten tank top to where under there are many styles to choose from as it is the thing to layer. They have them very light & smooth. Anything you buy you should try so you know it's not hitting any scars. I also have a few Genie Bras they also can be gotten at Walmart. They are very stretchy but have no seams as they are all woven nylon & spandex. Very comfortable. For my work the cotton is working the best for me as I sweat a lot & they breathe more for me. Sometimes it's trial & error. More should come along & post there suggestions. I hope this helps. One thing I know is I've had to get over the feeling of having my girls snug as a bug in a rug! A little looser & free. In fact loose is good. Because 4 weeks in now & things are a little ouchy & at home I go braless as much as I can. I wear old shirts so I dont mind if the creams stain. Let us know how your doing.",
      "MessageIndex": 415,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 7, 2012 10:47AM - edited Aug 7, 2012 10:50AM by julz4 I have been working on compiling ALL 28 pages of Info on this thread!  I am now done.  I did not get too technical as I did this all by paper, pencil, & calculator.  Also there were so many variables due to tumor size, hormone receptors, type of BC & so many other stages besides IV. Here is what I got, (I tried to be as accurate as I could but not all the info was provided, but then it was just asked the age of first DX)  # of first time DX on all 28 pages - 761 # of stage IV - 362 # of stage IV - grade 1 - 9                       grade 2 - 58                       grade 3 - 109 3 youngest ages of 1st DX - 10, 12, & 16 youngest stage IV DX - 20 & 23 Age of 1st DX - 20's - 53                         30's - 260                         40's - 302                         50's - 109                         60's -34                         70's + - 3 Age of stage IV DX - 20's - 20                                30's - 99                                40's -153                                50's - 70                                60's - 19                                70's + - 1 Of the Stage IV DX's  1st time were 149                                 2end or more were 213  Me....DX at 45.  4 years after first biopsy came back B9.  In same breast same side of breast, different area though.",
      "MessageIndex": 838,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Nov 29, 2008 10:12AM - edited Nov 29, 2008 10:13AM by julz4 Ask the Dr's about maybe using Roxanol. It is Morphine given orally under the tongue. This is a pain med given frequently in the final days. Hopefully this medicine or maybe something else the Dr. orders can provide much Comfort for you loved one.....Praying for relief & peace of comfort for your SIL.....",
      "MessageIndex": 2,
      "PostDate": "29/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725154",
      "Title": "last days for SIL ganga LuAnnH"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Apr 26, 2012 09:15AM julz4 wrote: Hi Sunny,   It's good to have a group of us to throw ideas around & support each other.  Brenda is right, as my BS has already discussed this with me.  Depending what my MRI & Biopsy show.  He said it isn't something that is needed at this time for me unless a curve ball comes back. He has talked about the possibility of Tamoxifen though & having Mammo's every 6 months for a while.  I have a slight family risk that he always looks at.  For now that's all I know.  Many people just don't understand!  Maybe you could explain to them that it's like walking around with a stick of dynamite inside of you.....I have these cells inside of me....One day they could collide & create a spark that will detonate that stick of dynamite.  I  just don't know when its gonna happen. Not that we want to trivialize it down to a scenario! As I am typing this I just realized that I now have TWO types of cancer I have a higher risk of getting.  Both DX'ed in the same year!  I had a colonoscopy last summer & they found a polyp that would of turned into cancer in 5 years or less....in other words I have to go for a colonoscopy ever five years now because of that!  I guess my 45 year old body decided to catch up with my Grandma status!  Twice the risk for a Granny of 2!",
      "MessageIndex": 99,
      "PostDate": "26/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 16, 2012 08:14AM julz4 wrote: Since I posted the BS office called & he wants to see me TODAY! In 2 hours I'm heading there. Will have more answers later today! Thank you so much! I will check back in later!",
      "MessageIndex": 127,
      "PostDate": "16/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jan 20, 2019 09:43PM julz4 wrote: I was 45.",
      "MessageIndex": 952,
      "PostDate": "20/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Mar 9, 2009 09:54PM julz4 wrote: I'm Glad you are Having a Happy Happy Birthday Day! Faith is Sneaky indeed!!! I'm Glad she Kept us up to Date on a Celebration Day! We all need some FUN & CELEBRATION SURPRISES! Again Happy Birthday! You Know me I gotta play a Song....LOL! Enjoy! http://www.youtube.com/watch?v=3YhOamBDqY4&feature=related",
      "MessageIndex": 30,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730365",
      "Title": "Happy Birthday Saint!! faithandfifty hollyann"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Apr 23, 2012 08:50AM julz4 wrote: Brenda.....Thank you for the heads up on the insurance.  Very interesting too....Ironic maybe....My BS is getting ready to present his study of MRI before lumpectomy.  He started his study back in 2003.  My figures are going to be rounded to an approx. of what I can remember,  not exact but close.   But basically what his study compiled was some 450 plus lumpectomy's that he has done from 2003 to 2011.  In the study he got around 330+  pre lumpectomy MRI's approved.  Because he had the MRI prior to the surgery he only had to go back in a few times for clear margins.  Where as the group of maybe 100 that were denied a MRI before the Lumpectomy he had to go back in maybe 30% due to dirty margins. Because of his study, which is the largest study ever done in the US for the use of MRI before a Lumpectomy.  So he is able to detect where all the cancer is before he does his first & in most cases only surgery.  Has been shown to save time, money, waiting, pain, & most importantly the worry, uncertanty for us women!  You know the emotional roller coaster that is already bad enough without having to add to it more!  Next week he presents his study to a big conference.  He & his collegues are probably going to be written about in a major Medical publication.  Not to mention the Insurance companies that are  looking into his study.  When he started his study he said he got approval about 50% of the time MAYBE for MRI before surgery.  Now he gets approved 95% of the time!  He has the data to back him up now.  They did get it pre approved!  I just hope it doesn't backfire.  But I do trust him & he said he would call the insurance company personally for me to see to it!  He believes this much in his study!   Now don't QUOTE QUOTE me on these figures as it was round about figures but they are close by 10-20  plus or minus!  I would love to get a hold of his write up &  post it here!  It may be months away though before it is published!  I found it very interesting....somehow comforting!  He really is here for Me & all the other women & men as he has done BC surgery on men too! Thanks for thinking of me!  ",
      "MessageIndex": 87,
      "PostDate": "23/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Apr 26, 2012 04:54PM julz4 wrote: ? For you both....Did either one have any lymph nodes swollen, painful, or show up on a previous mammo? This keeps running through my mind! Monday is just too far off. That & the first biopsy came back AH.... I didn't have a good feeling about that one either!",
      "MessageIndex": 104,
      "PostDate": "26/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 1, 2012 08:36AM julz4 wrote: Sparky....Vmudrow....Sunny & All the rest of the ADH girls!  Nothing is conclusive until I have the whole Mass out on a slide....with that said the MRI didn't come back as we had hoped.  It's looking like cancer.  The Mass lit up & you can see a definate blood supply to it.  My BS wants to talk with one of his Radiologists to discuss some other things seen all on the left side. Nothing seen on the right.  The Mass isn't lighting up any larger than the Mammo or US.  But it is more spiculated looking.  A small area lit up right above the crease of my left arm pit.  This was bright yellow.  The BS didn't know what it was & also seen was what looked to be 4 or 5 nodes.  Very small though.  The Radiologist has suggested going straight to a wire biopsy.  But the BS is thinking that while he is out of town,  that it the Radiologist does an exstensive core needle biopsy they could have the results by Monday when he comes back.  Then if it IS cancer,  then he can go in & do a Lumpectomy with node disection all in one shot.  Instead of doing a wire biopsy finding cancer & having to go in to do a second surgery to get clean margins & the biopsy of the nodes.  Not sure what the % is that is a true positive.  It seems to be that MRI's have more false positives.  Still waiting....but the next biopsy will probably be this week!  Thank you all for thinking of me. ",
      "MessageIndex": 108,
      "PostDate": "01/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 11, 2012 09:24PM julz4 wrote: J2kbbax....there is a thread here somewhere about insurance troubles they may have an answer. I would post this, copy & paste. On the not diagnosed but worried & also the high risk section too. Start your own thread!!! Remember that it's the beginning of a weekend so it may be some time before the right people will see it! I wish could help more! Please let us know how your doing!",
      "MessageIndex": 117,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 12, 2012 06:41PM julz4 wrote: j2kbbax  I'm glad I could help!  Just posting in the right place makes a difference as I see!  I hope more help comes!  So inadequate ..... but Good Luck anyways!",
      "MessageIndex": 119,
      "PostDate": "12/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 14, 2012 09:27AM - edited May 14, 2012 10:02AM by julz4 Welcome Bre.....I wish you didn't have to be here, but I am glad you came so we can help.  I just went & read your other post about how you found the ADH.  From what my BS said if mine ends up being purely ADH.  I will then go on 6 month screening's for a year or so.  Also I will need to take Tamoxifen for 5 years.  But first I am thinking you need to have your other breast checked out too.  Are you seeing a General Surgeon or someone who specializes in Breast Surgery.  I would think it would be in your best interest to go for a second opinion to a Breast Center.  That's what they deal in & know what would be the next best step.  I know I got a Breast MRI which is rare for just Atypical Hyperplasia & me not having the risks you do with your maternal grandmother.  My maternal grandmothers sister & her daughter had BC also.  So in my BS's mind it was enough of a risk to push to have it done.  Also with you being much younger you have denser breast's which makes it much harder for the mammo & sometimes the US to pick up on things.  Keep us posted in how things are going.  Remember WE the patient are the consumer.  If we spent a lot of money on a service & we didn't get satisfaction.  We would be looking somewhere else to have the Job done right!  Health care in no exception! ",
      "MessageIndex": 121,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 15, 2012 03:27PM julz4 wrote: Thanks Bre! I have been through this with my SIL. She had extensive DCIS 5 years ago & we have the same BS. In fact I met him through her. So I feel as confidant as I can at this moment knowing it's a good cure rate! But not until I have that final Path report though! Thanks....I'm a little numb right now.",
      "MessageIndex": 125,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Apr 18, 2012 06:58PM julz4 wrote: I guess I'm here for now too. I was having pain, achyness, occasional itching deep inside my left breast. Half my nipple had also turned red. This all was taking place in my left breast in the same area of a stereotactic needle core biopsy. I'd had 4 years ago for micro calcifications seen in my second mammo at age 41. The past year or so I have had more achyness that would come & go in this area. Lumps that would come & go too. As not having a uterus from a hyster, but still having my ovaries. I'm never quite sure where I am in my cycle. Anyway the red nipple showed up on a Saturday with pain & visible lumps like a blocked milk duct. Nursed 4 boys....but it's been about 12 years since I did that last! Called my GYN on Monday even though the redness & lumps in nipple were gone. She didn't feel anything but was able to send me for a diagnostic mammo & US. 2 days later I had them & the findings were complex asymmetrical cystic mass in left breast at 1-2 o'clock 9 inches from my nipple near the axillary area. Was told to see a surgeon about a biopsy. Went back to my previous BS who did a US guided fine needle biopsy hoping it was more cystic & would just disappear. It wasn't! It was a solid mass. Results came back yesterday. Pathology report says....Atypical Ductal epithelium with apocrine features, cannot exclude atypical Ductal hyperplasia or intracystic Ductal neoplasm. BS's plan is to an MRI. I go in on the 24th. He is doing a Bilateral MRI with & without contrast. He wants to make sure nothing is hiding. So he will hopefully only have to go in once. He will be doing a wire guided incisional biopsy to take out the whole 10mm mass. Tiny which is good! Hoping nothing else shows up on the MRI or beyond with the biopsy. More waiting!",
      "MessageIndex": 78,
      "PostDate": "18/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Apr 22, 2012 02:51PM julz4 wrote: Sparky.....that's the hardest part of waiting for me! I want a game plan so I can deal with the avalanche of major medical issues that has besieged my family this year! I'm with you in that you need to know they got it all out! If your gonna do it don't do it 1/2 hearty!!! I'm with you on the latter I nursed my 4 boys & there job is done! Don't get me wrong I would feel a loss. Our breasts are a part of a womans identity! It's not who we are but makes us feel that part! Take away a part & we loose just a little of ourselves. I have no uterus so it's another chink missing. It doesn't change who I am but......it does how in some way?! Hugs to everyone for good path reports....well as good as they can be!",
      "MessageIndex": 84,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Apr 23, 2012 10:14PM julz4 wrote: Brenda....sorry I only have a minute to respond as I work nights & am on my way out the door!  But yes I meant Lumpectomy....Super short answer.....I think he wanted to make sure that nothing sinister was lurking anywhere before him going in....as there has been some issues with my nodes.  Gotta run but I will post when I have some more time!",
      "MessageIndex": 92,
      "PostDate": "23/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 15, 2012 03:09PM julz4 wrote: I wish I could stay with you girls!!!! But I just found out that is not what is to be. My CNB came back DCIS! Just called to see if they got the results & when the nurse gone awhile & my BS came on the line I just knew. For now I hope it stays at that DX as we talked about the sister site that lit up on the MRI. I see him Thursday to set up the Surgery. Won't know a whole lot more until the surgery is done & the path report comes back.",
      "MessageIndex": 122,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 12, 2012 10:04AM julz4 wrote: Hi Chicken....I have been so busy after surgery.... Yeah after! Since I'm not working because of recovery I go everywhere with DH & my boys soccer games, end of school year stuff & of course Dr's appts. Trying to busy my mind! Lol! Anyway the surgery went good I had some problems with low heart rate but luckily was able to go home & not have to be admitted. The pain from the centinal node biopsy has been the hardest part. A lot of nerves cut & now I have numbness with burning pain. It is slowly getting better. The BS took out 2 nodes & both were B9! As for the rest. I have DCIS with 3 foci of micro invasion < 1 mm each. The tumor ended up being much larger at 2.8 cm. Grade 2/3 & still ER & PR neg. We are now waiting on the HER2 test results. I am to start RADS soon when we find out whether I may need Chemo or other Meds. Still waiting. This stuff is aggressive either way those tests come back & with me being pre menno I don't want to mess. I have kids in school & am a Grandma again to a special Miracle Grandson! I want to do all I can. I plan on getting back on the healthy way again soon. But I just decided right now I have much on my plate & want to enjoy & not drive myself with it. Many of the good supplements I already take for my BP, Cholesterol & slight heart mummur. I have to give up through RADS. A few months I can do it. As some I have had to forgo because of the biopsy's & surgery. I will get there but I will take baby steps to start so I don't get mader at what all BC has taken or could from me!",
      "MessageIndex": 133,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Oct 4, 2012 04:54PM - edited Oct 4, 2012 05:00PM by julz4 Bennymuffins,  I have been reading along off & on for a while.  That hard knot could be what is called a Seroma it is a pocket of fluid that forms from the plasma (clear) part of the blood after surgery when the many tiny blood vessels are disrupted.  I had a small one & they can be very painful.  I have read several women on here that have had them & have had them drained.  If this is what it is it feels so much better to have them drained.  On the other hand it really needs to be checked out to make sure it's not the start of an infection also.  Your surgeon who is on vacation WILL have a Dr. on call for him.  They ALL do that.  If he doesn't call your regular family Dr. & see them ASAP!  As for the remark of that gentleman about what happened to his wife.  That is RARE & it most certainly was so advanced!  This fear even happens to US who know more about our disease & it is hard to escape sometimes!  But with that said....I am gonna tell you about my friend from church.  4 years ago she went in for Gallbladder surgery....when they cut her open they turned around & closed her right back up as they found cancer.  Shortly after they found that she had extensive breast cancer in both breasts that went all the way down to where her Gallbladder was.  The BC was 2 different kinds of BC in each breast.  They gave her Chemo before they did her double mastectomy.  She also had very extensive radiation treatments to both mastectomy area's.  It is now 4 years later & she is ALIVE!  She is doing well & will see her last child graduate from High School this year.  Yes she has been through much & has glitches from time to time.  But the cancer remains gone!  No breast cancer is not a walk in the park.  For some it is easier than others.  The NOT knowing is the worst kind of fear....when you get your path report & have a plan of action the fear will start to ease.  Some days will be harder than others but as time goes by it will be easier.  I'm glad you found us, WE KNOW as no one else does.  We have each others back so to speak & some Day you will be that OTHER for some one else!  But for now don't lift anything more than 10 pounds & no repetitive motions (over & over again) even if less than 10 pounds. Yes you should move it but not for hours on end!  I am a CNA & went back to work 5 weeks after my Lumpectomy & Sentinal Node Biopsy.  That was May 22....I am still sore at times & they say the Radiation treatments can aggravate it.  Time Benny....time it's hard but our bodies need it to heal!   I hope this helps.....PLEASE CALL THE DR\"S OFFICE!  Let us know how your doing!  Julee",
      "MessageIndex": 359,
      "PostDate": "04/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 17, 2012 07:19PM julz4 wrote: Hugs Sparky....We are all thinking of YOU!!!  Marie is right you do need to level with them & be VERY blunt about how things really are!  There is help out there! ",
      "MessageIndex": 20,
      "PostDate": "17/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/787471",
      "Title": "Biopsy today, thank u everyone Sparkysbrat Sparkysbrat"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 9, 2012 01:35PM julz4 wrote: Thanks Teacup.....I have to be there at 9:15 this morn.  I am thankful I only live 10 minutes away from one of the top of line Radiation places in PA.  Don't really want to be there but glad it's so near!  I know I will be OK....but the Butterfly's in my stomach are doing nervous dance this morn!  I know I am not getting enough sleep as I got maybe 5 hours last night!  I couldn't sleep compounded by starting back to a wild 6 nights at work last week.  My emotions are all over the place.  I've been very weepy....I was holding my very tiny but growing preemie 5 month old grandson last night & the darn flood started!  Then my 13 year old catches me in the act.....sigh!  Too much going on this year!  I know I can do this but this some what young faucet is starting to show it's age & leaks a lot lately!  Well I can't gotta go get ready!  Later Sister's!",
      "MessageIndex": 92,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 25, 2012 04:13AM julz4 wrote: Hi ALL!!! As Usual I'm running out the door & don't have much time. Kj....I love the stand in RO for this week while the other is on vacation!  He explained much & I got to see 3D views of many angles of my breast & it's radiation field. This was done so I could explain for the GI Dr. today.  Well SHE my GI Dr. was young & pretty.  But most of ALL very good, compassionate, & concerned!  She thinks my nausea is caused by a Systemic reaction to the RADS.  It also appears to her it may not be a true \"NAUSEA\" .  Where I am ready to pray to neptune & more a BLAHHH nausea unwell feeling.  If that makes sense it did to me.  Were as the RO stresses & showed that the RADS are not hitting my esophagus & stomach area.  She sees many patients that have my issue with this feeling due to RADS.  It's like how our bodies react with feeling tired, fatigued because of the RADS.  Not because of the Radiation directly hitting those areas (because they are NOT) but because it's a reaction in general of how our WHOLE body handles the Radiation treatments.   I go Oct. 2 for an Endoscopy also they will dialate my esophagus as I am having swallowing issues again that does indeed have to do with my GERD.  I am to take my nexium 2 x's a day to heal any effect of what \"EVER\" is going on for a few months.  Until RADS is over & I have a chance to heal!   Grace....Gentle Hugs!  It is getting harder as more SE's show up & we just don't feel well!  Not to mention we still have to go in day after day to keep getting hit over again.  Keep your beginning motto in sight!  It's not easy!  We have to hold on to HOPE....Holding Onto Positive Expectation....in the face of a NOT positive situation!   Gotta go now.....YEAH to those that have started!  Hang in there for those that are having issues!  Like me Ouchy Lefty Nipple!  RO nurse started me on Aquifor for the NIP!  I hope to chime in tomorrow!  HUMP DAY!!!! SIGH.... 1/2 way through our week!  Nite ALL!",
      "MessageIndex": 228,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 3, 2012 11:40PM julz4 wrote: I feel so Dumb! I thought everyone was so busy & just stopped posting! So I went looking today on my favorite topics list & couldn't find you all. I must of accidentally hit the button to Remove it on my iPod! 2 pages later of reading & am bone weary tired! So Hi Five to All! Newbies & Oldbies!!! I did remember someone asking about me & being done with my MO! Since I didn't do Chemo & any Anti Hormonals that is why he released me! I am now 20/33! Nothing more than before with the skin. Coming down with something though! I've been cold all day with 90+ temps outside. Very sore throat, dry cough, just feeling extra blahhhh! I HAVE to go to work tonight as I have FMLA but if I just caught a bug it might not counted under my FMLA. As I had a verbal warning for missing 5 days in the last year & they just changed it to only 6 days of absents now for termination I can't take any chances! So even if I'm admitted to the hospital for non cancer related stuff I could be fired! SUCKS!!!!! I HATE being sick!!!!!",
      "MessageIndex": 305,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 4, 2012 03:29AM julz4 wrote: Yeah Babette!!!!  The finish line is in sight!  Thankful for our weekend breaks!  Yes I guess hind site is 20/20 for ALL of them now. ",
      "MessageIndex": 309,
      "PostDate": "04/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 10, 2012 12:52AM julz4 wrote: Hi Tab....I still have my nipple hairs!!!  The under arm hair is not in the target zone!  Thanks for the well wishes.  It looks like my cough is not gonna get better.  Coughing a LOT & now it's productive so I'm sure it's an infection.  No fever yet but it hurts.  I am calling my GP tomorrow as my RO has suggested over the counter cough meds that could make my BP worse!  There are a lot of new guidelines out there for us high BP (even though mine is in control) ladies.  Things like Ibuprofen, cough & sinus meds.  Just to name a few so read your labels & talk with your Regular Dr's if your in my boat.  My SIL is a respiratory therapist & she said a lot of nasty stuff is going around.  Hopefully it's will by pass all YOUR neck of the woods! Babette it only seems to gets that color when it's been steaming inside my bra with a good swipe of Aqufor on it.  All wrinkled pruny looking.  That's why I go bra-less at home....give my girls some breathing room.  Isabelle what time do you want me for dessert????   Sounds yummy!!!  As for my Peach Fix these days I've been making fresh peach smoothies, cool for my throat & I can easily swallow it. Peach Smoothie, recipe....Ripe peach peeled pitted & chopped.  A 1/3 cup of non-fat plain yogurt.  Dash of Cinnamon & vanilla.  About a 1/4 to 1/3 cup of ice & a splash of milk.  Sweeten your own way.  I use about a tsp. of sugar & stevia.  Blend it up.  I have a hand held mixer & use that.  Mmmm Enjoy!  I also have a recipe for peach cream cheesecake!  Very good for a craving of something gooey but not for the waistline.  But then we do need our calories with the RADS! ",
      "MessageIndex": 373,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 12, 2012 08:23PM julz4 wrote: Well I got in earlier on Friday & saw the Physicians Assistant.  I definitely have Bronchitis & she was glad I came into see her & get the meds from her.  Apparently there have been some choices from other specialty Dr's that don't always make sense or do the Job.  I'm on the Z-pac & have Tessalon Perles for the cough.  It's helping but it's gonna take a while.  I've had to sleep on the couch the last 3 nights because the coughing is so bad at times.  As for the sore throat I have had for 3 weeks.  If it's not better after the RADS she is gonna send me to a Ears Nose & Throat Dr. to get things checked out.  On a lighter note my weekend was filled with a Wonderful Surprise Friday Night!  I am sitting on the couch in my family room & my dogs start barking crazy.  I look over to see what's up & walking through my living room into my kitchen is My Best Breast Friend!  It took me a few seconds to realize who it was.  I was dumbfounded (understatement) as we have only met in person 4 times.  She was on a trip with her DD & DH coming home from a trip down south back up north 4 states from our house.  She got in contact with my DH the day before & the 2 of them were in cahoots about the whole thing.  He told her to just walk in the house.  Until I realized who it was I'm thinking who had the audacity to just walk in my house without knocking!  LOL!  We met on these boards 4 years ago & have been fast friends since.  Back then I dodged the bullet & my biopsy came back B9.  She's been my rock through this with me.  She is 10 years out from a Trip Neg DX ironically most likely my DX. Isabelle I'm hoping they shave another 5 minutes off tomorrow.  I got pink early also & it really hasn't gotten too bad.  The creams are keeping it in check & if I ? anything I ask my RO nurse when I'm in there.  Some things are right up there alley so to speak!  Belinda I went before RADs to the dentist as I was having some issues with my teeth.  They prescibed big time flouride toothpaste & flouride gel detal trays I use every day to help strengthin my teeth.  My teeth are not the best & these treatments as well as Chemo are very hard on our teeth.",
      "MessageIndex": 405,
      "PostDate": "12/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 21, 2012 12:19AM julz4 wrote: Babette your done Yeahhhh! TAB I love the pic of you & your brother....Thinking of you! Isabelle it sounds like your body is needing the rest!  Rest if you need it! 2 to go & I'm done!",
      "MessageIndex": 489,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 21, 2012 01:16AM julz4 wrote:  Happy Dance Commencing!",
      "MessageIndex": 494,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 14, 2008 11:43PM julz4 wrote: You go right ahead & wait with us. I had to wait almost 4 weeks from the time of call back for micro cals till the time they had a cancellation to see me for more photo's of Left breast. Then a month till biopsy, results B9. More waiting because they could not biopsy both spots so they wanted me to come in end of this coming September for a repeat mammo on spot of micro cals. 5 to 6 weeks after biopsy found a tiny lump in L/B, needed to wait 3-4 weeks for any changes (not through memopause, no uterus though) to lump. Called Doc last week monday,  Saw Doc tuesday &  mammo & sonno today. Follow up in 1 month w/Doc for another BE. Then if all is well Wait till end of september for that mammo! It sounds like my GIRLS are going through changes Fibro ones that is. Although my wait is now not so worrysome as yours is. It always helps to have someone wait w/you, where we once were. The girls here are a pro at the waiting game, although none of us like the game. We will help you out as best we can. Sorry you had to join us, but we are ready to help!",
      "MessageIndex": 1,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/709077",
      "Title": "Waiting For Appointment greenThumbs leaf"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Oct 18, 2009 10:12PM julz4 wrote: Ahh Sweet Ames.....She's in the Arms of the Angels Set free from her Pain! Your up there watching over all Your Loved Ones sending them the Comfort they so Lovingly gave You!  To Ames Family.....Peace be with YOU!   (((((((((((((((((AMES)))))))))))))))))",
      "MessageIndex": 20,
      "PostDate": "18/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742333",
      "Title": "AMES (lv2cmp) RIP -angel- heatherpalmerton"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 8, 2008 09:13AM - edited Jun 8, 2008 09:14AM by julz4",
      "MessageIndex": 13,
      "PostDate": "08/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/706830",
      "Title": "worried amyt CAZ"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Apr 24, 2012 02:25PM julz4 wrote: Sparky, I go to Apple Hill in York, PA. I see Dr. Thomas Bauer through Wellspan. All he has done for 20 some years is Breast surgery for cancer & biopsy's. I will warn you that he is not young. He is at least 70. He knows his stuff though & he trained at Hopkins in Baltimore. Good Doc! I hope this helps!",
      "MessageIndex": 95,
      "PostDate": "24/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 11, 2012 06:06PM julz4 wrote: Sparky I'm glad it's all scheduled so you can go on to the next step. A never ending step process. We just hope for the best. I feel like I'm in La La Land! Yesterday the CNB was done. I did good until he hit the chest muscle it hurt but no damage. Just really sore then & today. I'm off to work tonight wondering how bad I'll feel before the night is over. I'm a CNA rolling & transferring heavy people all night. The BS got 4 long cores. Next week I go back in Thursday to set up my surgery. I hope I don't have to leave you girls but the BS & Radiologist is really leaning towards it being really suspicious. The small yellow bean thing on MRI looks cancerous also & will be taken out. He says it's linked to the main mass, a sister site he called it I think. The nodes looked ok. When all the surgery is done & all the path reports are back is when I'll either stop worrying SOME or a different place of mind! I can call in Tuesday for the path report since they couldn't get me in sooner. Working till then. As if that will keep my mind off it.",
      "MessageIndex": 115,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 8, 2008 11:36PM julz4 wrote:",
      "MessageIndex": 1,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708704",
      "Title": "Lumpectmy Scheduled 7/14 LisaG42 LisaG42"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 6, 2012 02:08AM - edited Jul 6, 2012 02:12AM by julz4 I've been reading & am on a few other Rads threads....no start date yet but I am sure next week as I had my simulation was this past Monday.  I had to wait for BRCA tests.  I was gonna be in on a RADS Trial but found out today that I didn't meet the protocol as I needed a bilateral mammo BEFORE my surgery.  Well seeing as I don't want to put the tumor back in & start all over again!  So I guess that's a no go.  So I guess I'm getting 33 days instead of a coin toss between 16 days or the aforementioned 33 days!  Oh well Let the Zapping begin!  Can you tell I'm excited!  I guess it's more the NOT knowing how I'm/my body is gonna handle this.  Everyone at work is like your gonna work while getting RADS????  Well I'm hoping to breeze through....but have my inter mitten FMLA in place just in case.   But I work all nights, need to loose weight, getting closer to 50, this is my 3erd major surgery in 6 years.  I'm a CNA & work is just hard on my body & when I get home I want to crash!  Went back to work this past Sunday night & am tired as I am averaging 4-5 hours a day of sleep.  Today was better as I got 7 solid hours....but was up at 2:30 & don't work until 10:30 tonight!  I'll be ready to crash again by sunrise!  Sorry for the minnie rant I guess it's the jitters of the unknown! ",
      "MessageIndex": 67,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 6, 2012 02:16AM julz4 wrote: Thanks Onvacation!  We all read & know the symptoms & problems that can crop up with BC treatments.  But I must have been in total La La Land with the Lumpectomy & SNB.  I was prepaired for the pain but BURNING pain & numbness pain.  That threw me!  My arm aches with numbness.  I'm thankful it's much better but still.....didn't have a clue!  I've had so many surgery's for other things you would THINK .....but I guess I didn't get the clue!",
      "MessageIndex": 69,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 6, 2012 10:26PM julz4 wrote: I start Monday also. Graced I also take CoQ10 but was told by my RADS nurse that I'm not allowed to take it while doing RADS. It's an antioxidant & helps to destroy free radacles. Makes sense not to take it till after. Boy will I miss em as they help give me energy. I've also read that they think it helps fight Cancer at a higher dose. I have been taking them for years because of my cholesterol meds depleting my body's own made amount.",
      "MessageIndex": 76,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 7, 2012 02:09PM julz4 wrote: Babette I think we all will feel it somewhat differently. I had a Mother Friend several year back that had gone through RADS & also my SIL. They both said their boobs got \"perky\" somewhat smaller. Another friend said her nipple pulled out to the side! I'm thinking good ole radiation gives our radiated boobs a liscence to do what they darn well please! Whether we like it or not! ; )",
      "MessageIndex": 87,
      "PostDate": "07/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 20, 2012 04:15AM - edited Jul 20, 2012 04:19AM by julz4 Hi Healing Dreams, Mini, Kara, Belinda, Isabelle, Kj, Graced, Babette, & any I missed! Yeah to those of you that have started as it is one step closer to the finish line!  Those that are doing ok & hoping it stays that way!  Thinking of those who have yet to begin as I know it weighs heavily on your minds!  May your SE's be very super minimal!  I think about you ALL every day, your always on my mind!  This Journey is hard, but I am thankful we have each other to lean on!   Sorry I haven't been on but with work, having trouble sleeping, & the nausea.  I just have time to read sometimes.  I saw my RO on Tuesday! !!!!!  He says that RADS do NOT cause nausea!!!!  He thinks it's my GERD....acid reflux.  He said I am drinking juices, eating a bad diet, high fat, drinking milk, & not following protocol for GERD!  Basically being bad to my body!  To say I was P-Oed is an understatement!  The RO & I NEVER have discussed my diet or any lack there of!  So he was presuming WAY too much!  Yes I am over weight.  But I might have 5 glasses of juice in a year....I don't buy it or keep it in the house!  There was no telling him differently....my DH was with me & was looking at him like the RO had grown 2 heads!  I just let him waste his own HOT AIR!  Because DH & I know more that he did!  Now I will be the first to admit that there are certain foods that I might partake too much of at times.  But because I have known I have high cholesterol since I was 26 & I weighed 105 pounds then.  Family inherited.  I have watched how I eat since then.  Especially since my GERD dx 6 years ago.  If I don't watch it I pay with pain....never nausea!  With that said & vented.  I understand he is concerned for my health as I now have a cancer DX.  Last year at this time I had an esophageal stricture narrowing & had problems swallowing.  Very scary as food would not go down at times.  I had to have it ballooned open.  If this scaring continues it very well could lead to esophageal cancer.  So he doesn't want to take any chances.  So next Wednesday I go to see a Gastro Dr. & probably will have to have yet another Endo scope done.  He has my health in the best intentions ..... but his bed side manor is that of a Horses Patooty!  Ok so that's my vent!  Or better yet what's been going on in my neck of the woods!   I have 9 RADS in & Lefty is holding up really well!  The rest of me is falling apart maybe!  On a good note I think the RADS are visibly working if that can be.  My scar from my Core Needle biopsy which ended up having a micro invasion inside because of the biopsy.  It's been sore since May since I had it done.  It always rubs, hurts & the scar is also bumped out as well as along my incision scar that were bumpy underneath.  More annoying than anything.  It has subsided & gone down.  Doesn't hurt & the bumps of the scars have gone down!  Coincidence who knows, but I will take it as a positive! I know I don't always sound positive but the nausea is waring on me. Only One more Day then we have the weekend off!!!!  1/3  of the way Done for a few of us!  Cheering Us ALL On no matter where we are in this!  ",
      "MessageIndex": 169,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 20, 2012 04:23AM julz4 wrote: Yeah Babette!  Maybe a little hydrocortisone cream mixed in with your lotion would help that tingle!  I have put it on a few times with my lotion & it has helped the itchy's!  Wooo Whoooo Mini!  HumpDay next week is looking like a mighty fine day for you!",
      "MessageIndex": 170,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 23, 2012 09:29PM julz4 wrote: About the cornstarch & baking soda mix I read on one of the other RADS groups to put it in a sock or stocking & dust it on. They said it's not as heavy, a lighter dusting. Makes sense. As for deodorant my RO nurse is into fragrance free Dove soap & deodorant. I'm aloud to use that deodorant only no sooner than 2 hours before my RADS. I shower before I go & dont use except at work. But then I'm am only having whole breast RADS & no axillary RADS. Although the line of darker skin from the RADS goes between my 2 scars on the underarm/side of rib area/boob. The pit hair is still growing & I just clip it with a battery operated personal facial hair trimmer. Just lightly so as not to nick any crinkled skin. Works good!",
      "MessageIndex": 212,
      "PostDate": "23/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 5, 2012 06:51PM julz4 wrote: Hi Jag we are at the same amount of days in. I use a bit of the hydrocortisone cream it really helps the itchy's! Tab it is weird how the one treated is warmer. My eighty is cold to touch & Lefty is my internal & \"outernal\" heater! It would of been nice in the winter!!! Hot Flashes nothin sexy about em! I'm a wet blanket these days! Momof2 I'm so glad your done! Let the healing begin! Elom I'm so glad you found us! Just wish you never had to join us! More will be along with help on the lymphedema. There also are many thread & topics here about it. The SE's never End!!!! One day.....sooner than later I hope!",
      "MessageIndex": 321,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 10, 2012 01:38AM julz4 wrote: Peaches & Cream Cheesecake....Enjoy! 3/4 cup flour 1 teaspoon baking powder 1/2 teaspoon salt 1 (3 1/2 ounce) box regular vanilla pudding mix 3 tablespoons soft butter 1/2 cup milk 1 egg 15 -20 ounces sliced peaches 8 ounces cream cheese 1/2 cup sugar 3 tablespoons peach juice 1 tablespoon sugar 1/2 teaspoon cinnamon Directions: 1 Beat flour, baking powder, salt, dry pudding, butter, milk and egg with an electric mixer for 2 minutes and pour into an 8-inch square or pie pan. 2 Drain and save juice from sliced peaches. 3 Arrange peaches over batter. 4 Mix cream cheese, sugar and peach juice. 5 Beat until smooth. 6 Spoon over the top, keeping 1 inch from edges. 7 Mix sugar and cinnamon and sprinkle over the top. 8 Bake at 350°F for 30 to 35 minutes. On a side note about the recipe.  I use Skim or 1% milk.  Also I use the lower fat but NOT fat free cream cheese.  I have used fresh peaches before the final product its much juicier but still good.  If you use fresh blanch the peaches & the skin peals right off!  I've also made it with canned peaches in there own juice but add a tablespoon of sugar or what ever you like to sweeten.  Or make with out the sugar too.  Just not as sweet for sure. But still good. Also make sure the pudding mix is the COOK kind not the instant!  Really good!  I cut back on fat where I can.  Also I use smart balance because of the cholesterol.  I have been modifying my recipes for years because of my cholesterol.  It still tastes good.  Make it either way.",
      "MessageIndex": 378,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 10, 2012 03:39AM julz4 wrote: Kj....BH or BH it's everywhere here too!  Hahaha!  (Boob Hair & Body Hair Or BAD HAIR!) LOL!  Ok I'm just too goofey!    I need sleep!  Mini that itchy stuff is weird as some days it's worse than others!  No rhyme or reason for sure!",
      "MessageIndex": 383,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 3, 2008 04:14PM julz4 wrote:",
      "MessageIndex": 13,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708474",
      "Title": "Kari is our latest Angel djd Rocktobermom"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 14, 2008 07:32AM julz4 wrote:",
      "MessageIndex": 5,
      "PostDate": "14/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707304",
      "Title": "saw primary care doctor for report stevemorse leaf"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 1, 2008 10:01PM julz4 wrote: I am so glad things turned out good for your. The peace you feel when all is O.K. is a wonderful calm. Although everything is O.K. please continue to be proactive in taking care of your health! Have a peaceful rest tonight. Remember we will be here if you ever need us. Releaved Hugs for You, Julee",
      "MessageIndex": 15,
      "PostDate": "01/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718833",
      "Title": "First mammogram and have to return/worried lmd kayakgrrl"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 10, 2012 03:56PM julz4 wrote: I'm not doing so good. I went to work last night & a little over an hour after I arrived I started really getting nauseated! The whole night I really felt yucky. When I went in for my treatment today the nurse looked at me & said whats wrong. I told her about the nausea & she said that's too early for that to happen. Quietly as if she were talking to herself. No one has the the Bug at home or work. She asked if I had any anti nausea meds at home. I do & am to take them & let her know how I'm doing tomorrow. I've only slep 4 hours today & have to work tonight! I took a pill before I went to sleep. I woke up & am still nauseated! If I have some weird side effect.....the next 6 weeks are gonna be YUCK! Don't feel like eating anything!!!! Just gingerale & ice chips!!!! I guess it's a good thing I'm 28 pounds over weight! Down 4 in one night! Babette I've done reading here & the most \"popular\" creams used seem to be the Calendula, Aquaphor, & Aloe. I think my nurse wants me to save the later 2 for the big guns. Wait to see if I need them. Go with your gut. Maybe mix a little Calendula with the olive oil. It's a tough call. As you don't want to tick em off...because you have to deal with them for a while longer. I'm gonna go & try to sleep some more. It's gonna be a long night! Then I have 4 off! Yeah!",
      "MessageIndex": 113,
      "PostDate": "10/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 20, 2012 08:47PM julz4 wrote: Mini I'm thinking get it all checked out to make sure & IF I'm right I just might gloat a little bit! Not that any of this is a game to see who is right! But we will see where this lesson will fall to!",
      "MessageIndex": 174,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 24, 2012 05:06AM julz4 wrote: Kj your welcome! I don't blame you about your ambivalence towards starting & getting done!!! Something positive to look forward to at the end of this mess! I'm off to the GI Dr. tomorrow for the nausea. After my RADS & weekly RO appt. My regular RO is on vacation so apparently I get the semi retired really nice groovy yoga RO Dr. Apparently ALL the techs love him! I wonder what he will say about my nausea....although it has been some better. But then I have cut back & out everything that can cause acid reflux problems out of my diet. They are not gonna be happy that I'm am loosing weight. I think 4-5 pounds this week. My nipple & breast are starting to hurt too. Fatigue more & more! I hope everyone is doing OK!????",
      "MessageIndex": 216,
      "PostDate": "24/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 26, 2012 05:29PM julz4 wrote: Good morning July Glow Team!  I feel like I'm glowing inside as in warmer!  Lefty is warmer than righty for sure anyone else feel like this?  14/33 done almost half way!  I called into work last night as the last 2 days of Dr's appt that are an hour away from home gave me much interrupted sleep & I was really dragging last night & knew I wouldn't make it through.  First appt on Tuesday was with my new GI Dr.  She changed my prescrip of the Nexium to 40mg  2x a day.  My insurance is making us jump through some hoops first!  So hopefully it will get straightened out before tomorrow as I am almost out!  Yesterday I saw my MO for the 2end & last time!    Yeah I ended up crying!  He is truly everything you could ever want in a Dr.  Very intelligent, easy to understand, explains everything on your level, & VERY COMPASSIONATE!  A wonderful man indeed!  He said if I EVER have any ?'s please call his nurse & tell her you need to talk with me.  He will call me back!  He ended up giving me a Hug!  The best of the best for sure!  Babette Yeah to being 1/2 way through!!!  Now everyday is closer to the end!  I'm glad your not having any fatigue.  I don't think mine would be as much if I didn't work nights & crazy sleeping times.  I hope the red/pinkness doesn't get much more.   Mini I have the itchyness but thankfully a little Hydrocortisone mixed in with my breast cream really helps that.  Last night I had a really itchy spot on the upper inside arm near my pit that's not in the line of fire.  I thought it might be a bug bite but nothing showed up. I had a tad bit of skin rubbing off like a sun burn yesterday morn.  Nothing this morn but being extra really careful to pat myself dry after showers now.  How are you feeling now? MiniMacsMom I hope you continue to do as well as you have!  Almost done too!!!   Welcome Lanagraves!  There are some others that just started too.  Everyone is different with the SE's.  The pink/redness started a little more than a week after I started.  Last Friday I started to have more skin issues.  I am very fair skinned.  But I think my skin is holding up better than I thought it would.   Graced it helps when we are taken seriously.  Now that I think of it.  I am thinking that maybe my GI Dr. may be more sympathetic to that because she really is very Beautiful!  I'm sure in the course of her medical schooling in a predominately Male field of being a Dr..  She has encountered that \"You can't be beautiful & smart\"!  I'm sure she has had to fight to be taken seriously at times.  What ever the reason I'm thankful for her kindness & compassion!   ",
      "MessageIndex": 234,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 8, 2012 11:39PM - edited Aug 8, 2012 11:40PM by julz4 Graced your getting out sooner than I am!  I have 23 done, 5 regular to go & 5 boosts.  But we are on the home stretch.  Ouch about the Nip!  I hope it's not too painful.  Mine is this red & grayish white color at times.  When I am working & wear the jog bra it's far more red when I come home.  I really just go to RADS & may stop off quick at the store after.  Then home to bed if I have worked or laze around the house doing necessities laundry, dishes....I just don't have the energy to do much more.  Work sucks it all out of me.  Mini I hate the itchiness!  But will have to wait to see if the effects are lasting after.   Maybe us your cream more often in that spot with cortisone cream too.  See if that helps. Thought for the day....I've gotton to the point that I'm SO creamed that I could slide in & out of every situation I encounter!  If ONLY!  LOL! ",
      "MessageIndex": 361,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 10, 2012 01:46AM julz4 wrote: TAB sounds good to me.  You can also get frozen berries & make em too.  My sister makes them with nectarines.  Really easy.  LMAO!  Ahh yes the sexy nipple hairs!  I always have to cut mine as they get really long & wirey thick like!  But the weird thing is I only have them on the nipple of the boob with the cancer!  Mind you they have been there for a long long time.  Things that make you go Mmmmm. Kj no teasing about it!  I posted it....it's too good not to!",
      "MessageIndex": 379,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 16, 2012 03:10PM julz4 wrote: Almost done! Babette....I hope all stays the same till the end then heals!  That bell is gonna ring soon for you!!!!  Belinda....soon for you too!  No bell at our center.   Kara....hopefully it will go by quickly with hardly any SE's.   Onvacation....getting closer!!!! Kj.....1/2 way tomorrow yeahhhhh!!! Isabelle....15 minutes lets hope it stays that way or better yet less time!!! Tab....now it's on to the 3/4 mark! Detroit.....Welcome to the group glad your 1/2 way there!  ",
      "MessageIndex": 457,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 17, 2012 12:56PM julz4 wrote: Oh Tab I am so very sorry! My thoughts & prayers are with You, & the rest of Your Family! May You ALL find comfort & some peace in the wonderful memories you carry in your hearts!",
      "MessageIndex": 470,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 25, 2012 12:44AM julz4 wrote: Teacup YEAHHHH!!!  Enjoy your weekend!",
      "MessageIndex": 538,
      "PostDate": "25/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Aug 25, 2012 01:41PM julz4 wrote: Oh Babette what wonderful wonderful surprise! Your DH is a keeper & your friends the best! But then you don't need anyone to tell you....because you have seen it! Onward & Upward!",
      "MessageIndex": 549,
      "PostDate": "25/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Sep 22, 2012 07:46PM julz4 wrote: Benny....I would say this is not normal.  Pain can do all kinds of things to our bodies.  Why is your pain not better?   I wonder if you could be getting an infection.  My arm was very painful there due to the SN biopsy.  In fact I still feel some achyness & spasms of pain & I had my surgery in May.  Are you using ice at all?  I used ice for a few weeks.  A bag of peas were what I used.  Sometimes one pain med works better than another.  You might have to try a different one.  I would definately call the Dr's on Monday & see what they say.  Try to eat a little something if you can. What ever might feel right to you at the moment.  I hope you can get some relief soon. ",
      "MessageIndex": 299,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jun 2, 2008 10:40AM julz4 wrote: Stephanie,  The reality can be such a shocker. Before I had my biop. I went to a bra shoppe, they have so many boob enhancers these days, silicone, foam & heck even water filled bras! I hope when your healed that you can find something to make things appear on the OUTSIDE back to what they were before. Especially in your swim suit. There has to be something to make you confident on the outside. We don't like people to look at us & wonder whats wrong with us. It can shake our self confidence. Because you know how the mind wonders. When I had a needle core biop they said they would take 4-8  2 inch cores (that would resemble spaghetti) for each spot. So for that would mean possibly up to 16  2 inch pieces of spaghetti. You can imagine what I was thinking about when I had that for dinner a few days later, (not to gross anyone out) I even cut up 16  2 inch pieces of thin spaghetti. Just to get an idea what could ultimately would come out of my close friend. Only 6 came out of my left, the smaller one. For me only I can tell. But my nipple on that breast tips up now. I can see it when I look in the mirror. I know this is not what you have gone through, far far from it. In regards your mother. She is from another era. It's not like she doesn't care how her body looks. But 40 yrs ago even longer there was not the emphasis on how your body looked. Magazines, T.V., movies, news. H@!! even on Billboards in major cities, have pictures of scantily clad women these days. It's everywhere nip this tuck that it's getting to be the new norm. It doesn't always make it right though. Don't get me wrong. I like to look good too. When my mother in law had her double mastectomy almost 18 yrs ago. She didn't care she wanted to live & wanted the ca gone. She wanted to live & wasn't vain about it. I think that was just her era how she was brought up & dealt with things.  Only time & healing will tell the true outcome of the wounded one. Until then you can come here for wonderful understanding comfort. We understand were your coming from some way more than others. Even if we don't it's in the back of our minds when & if that time will come. We all like to feel beautiful on the outside even when we already are on the inside!  Lots of Gentle Hugs & Mental TLC from Julee!",
      "MessageIndex": 18,
      "PostDate": "02/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/706540",
      "Title": "Back home after duct excision stephanieb zen_capricorn"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Jul 19, 2008 08:18AM julz4 wrote: Sorry you had to join us. As I don't know anything about this issue, but I am concerned about you getting the answer's you need. Please start your own TOPIC. Go back to the list of topics under 'Not diagnosed but  worried' click on the box in top right hand corner 'Start new topic' you will find you get a quicker response. It is a weekend & takes longer for people to respond.  I would suggest you head your topic \"Help need info on a HALO TEST\" or something like that. I hope this helps you. Please keep in touch. Remember to look near the top of the page after you have signed in people sometimes PM~personal message you with info., or you can PM them. I'll be watching for you! Julee",
      "MessageIndex": 24,
      "PostDate": "19/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/706540",
      "Title": "Back home after duct excision stephanieb zen_capricorn"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Sep 7, 2012 07:35PM julz4 wrote: Glad to see so many are just about done!  Good Luck & I hope all is well with everyone!",
      "MessageIndex": 633,
      "PostDate": "07/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Sep 18, 2012 12:10AM julz4 wrote: Just checking in to say Hi! Happy Birthday Babette! Kj....I'm glad you had a wonderful time.  The pics are great. Isabelle....Yeah your done & your pretty as your picture! Yeah is in order as it looks like we are all done! Everyone good luck with the anti-hormonals...I hope you all have no or minimal SE's.   They won't give them to me too much heart/clot risk.  I'm on my own now.  Just told to take 2,000 IU of vitamin D a day & have my mammo's every 6 months.     ",
      "MessageIndex": 699,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "Apr 23, 2010 03:39PM julz4 wrote:  Dream I hope you can kick up your Heals & Have a Good Birthday!!!",
      "MessageIndex": 9,
      "PostDate": "23/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751713",
      "Title": "HAPPY Birthday, Dream!! faithandfifty chainsawz"
    },
    {
      "AuthorID": "julz4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66404/profile",
      "Content": "May 30, 2012 05:16PM julz4 wrote: Wonderful News Michelle!  Continue to keep a watch but go out & enjoy your B9 results!  I too had surgery the same day!  I hope your feeling better from the surgery! ",
      "MessageIndex": 14,
      "PostDate": "30/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787817",
      "Title": "Excisional biopsy in 2 days & suddenly quite frightened! michellesharii julz4"
    }
  ]
}