{
  "AuthorID": "jumpy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
  "Posts": [
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Jan 20, 2014 03:39PM jumpy wrote: Thank you, too, Donnabelle. I appreciate all of the kind comments. Actually, I think the last picture looks a little better than real life, but at least there is progress. And, if I don't comb it while it is very wet, mine will curl up too. It was always a bit wavy in the back. You can't see it in the picture, but right above my forehead I have a tuft that is dark, curly, and coarse. The rest of my hair is so fine it is like baby hair.",
      "MessageIndex": 19927,
      "PostDate": "20/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Feb 22, 2014 10:19PM - edited Feb 22, 2014 10:22PM by jumpy    6, 7, and 8 months PFC",
      "MessageIndex": 20006,
      "PostDate": "22/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Mar 8, 2014 09:17AM jumpy wrote: LizA17--I'm still struggling with my hair recovery too. Get yourself a nice sun hat and enjoy your trip to Cabo!",
      "MessageIndex": 20097,
      "PostDate": "08/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Mar 21, 2014 11:18AM jumpy wrote: Hi, I am now 9 months PFC and still have incomplete hair recovery. I have been using minoxidil (5%) and the LaserMax hair comb for the past 4 months. I take biotin, D3, and a multivitamin--and I consume lots of protein (mostly salmon). All of my blood work--including androgens--are normal. My hair is growing at normal rate--now it is about 2.5\" on top and 3\" in the back--and the volume seems to be slightly improving (i.e., each hair is not as fine). But, other than at my forehead, I don't think there has been any improvement in the density (i.e., the number of hairs). I am frustrated because I do not know the cause--or causes. Permanent Taxotere-induced alopecia still can't be ruled out, but I just found an meta-analysis published October 2013 in The Oncologist on the effects of endocrine treatments (e.g., Tamoxifen and AIs) on alopecia. And, Tamoxifen seems to cause alopecia of varying severity in anywhere from 6-25% of BC patients who take it. Anyway, here are my photos for months 6, 7, 8, and 9 PFC. ~Jumpy      ",
      "MessageIndex": 20171,
      "PostDate": "21/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "May 13, 2014 10:12PM jumpy wrote: Hi, Lago, I'm intrigued by your \"Friar Tuck\" comment. How long was your hair thin in the crown like a monk's tonsure? I'm coming up on 11 months PFC and am still thin on top and my hair is still very fine--but it is growing. Thanks, Jumpy.",
      "MessageIndex": 20284,
      "PostDate": "13/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Jan 10, 2014 08:55AM - edited Jan 10, 2014 08:58AM by jumpy Thanks, Mely19. My dermatologist thought it was the Tamoxifen for me. They also say that with menopause all women's hair will thin, but since our hair is still so short we really notice it now. My concern, of course, is that this is permanent chemo-induced alopecia  (PCIA). But, from what I have read, that is almost always associated with loss of brows and lashes too. My brows and lashes are back, but thinner. Also, with PCIA hair does not usually grow longer than 4\" (10 cm). And, with PCIA nails usually return to normal; which mine did, but I have a toenail that hasn't grown since chemo. My thyroid was fine. I just had my annual exam and my internist is also checking my Vit D, Iron, Zinc, and Testosterone levels--which are all associated with hair growth. The only thing I just learned about is Biosil 10mg 2x/day. Is anyone else taking that? Finally, keep in mind that dermatologists are most likely to see the problem, but not see how those problems resolve. For example,  the derma I saw was great, but unless I have another skin problem I don't know I'll ever see him again. He told me to use Rogaine and sent me on my way. Remember, it is the Oncology team (MO and RN) who keep seeing you, so be sure to grill them on the time line. My OncRN says that it can take 12-18 months to recover your hair after chemo when you are also adjusting to hormone changes. Good luck in your appointment. Let us know what you learn! Thanks, Jumpy",
      "MessageIndex": 19859,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Jan 12, 2014 11:08PM jumpy wrote: Donnabelle, your hair is beautiful! Congratulations; I am very happy for you. I am 29 weeks PFC (almost 7 months!) and I am still struggling with hair. I just get my lab results and everything used to check hair issues is normal: thyroid, testosterone, zinc, vitamin D, iron. I've been using Rogaine. Do you have any advise for us slow pokes?",
      "MessageIndex": 19880,
      "PostDate": "12/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Jan 20, 2014 10:12AM jumpy wrote: Thank you, IamNancy, sly58, and lago. I am still about 25% (or less) of the density I had before chemo. And, going wingless still seems a long way off). I am getting length (top is ~1,75\"; back 2.25\"); it has been growing 1/3-1/2\" every 4 weeks--I measure by my gray roots! But, I am not sure about the density. I don't see too many shorter hairs, but I'll wait and see. With Taxotere induced alopecia hair doesn't usually grow longer than 4\" (10cn). I saw my gyne last week and I'm having more blood test run to rule out a hormone issue. But, neither of us thought that was the issue. As least the progress is forward. Thanks for your thoughts! --Jumpy",
      "MessageIndex": 19925,
      "PostDate": "20/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Jan 24, 2014 11:04PM jumpy wrote: Hi, has anyone tried Finasteride (brand name Propecia)? I have a friend from grad-school who is a dermatologist down in FL. I finally called him today and he suggested 1mg of finasteride and explained its mechanics. From my own research I had wondered about this Rx. The issue is not having elevated androgens (I don't), but the balance, or ratio, of estrogens and androgens. For some women Tamoxifen can also block the estrogen on the hair follicle receptors causing hair loss. I'd appreciate hearing about others' experience. Thanks, Jumpy.",
      "MessageIndex": 19954,
      "PostDate": "24/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Feb 22, 2014 10:31PM jumpy wrote: I just posted my progress; the photos are 6, 7, and 8 months PFC. I have been struggling with slow regrowth and am still \"thin\" (~25% of the density I had prior to TC chemo. The hair on the rest of my body has also been slow to come back, but there has been improvement in the past couple of weeks. I've been (and remain) concerned that I have permanent Taxotere-induced alopecia, but now I am thinking my slow progress may be some form of telogen effluvium. The hair that I do have is growing. The length on top is ~2\" and 2.5\" in the back and sides. I'm not sure that the density is improving much particularly in the crown area. I am starting to lose patience with the wig, but I don't think I'm ready to go topless quite yet. Thanks, Jumpy",
      "MessageIndex": 20007,
      "PostDate": "22/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Feb 23, 2014 11:39AM jumpy wrote: Thanks, LizA17, IamNancy, and lago! I am glad that there has been progress, but the photos are a bit deceptive in that they don't show as much scalp as can be seen in person. I'm keeping up with the minoxidil, laser comb, biotin, and protein. My body hair growth (legs, arms, and underarms) has just seem to kick in, so I'm hoping my scalp hair will follow soon. Lago, one of my working theories is that the Tamoxifen or the Tamoxifen-radiation combo triggered a telogen effluvium in me delaying my regrowth. Or, more likely, there is a little of several things at work simultaneously: some Taxotere-induced permanent alopecia, some Tamoxifen-induced androgenetic alopecia, and some telogen effluvium. Thanks, again, for sharing your thoughts! ~Jumpy",
      "MessageIndex": 20011,
      "PostDate": "23/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Feb 25, 2014 10:57PM - edited Feb 25, 2014 10:59PM by jumpy Karina51--the difference in laser combs has to do with how long the session is. I thing the range is from 8 minutes 3 x/week (most expensive ~$500) to about 15 minutes also 3x/week. The evidence for minoxidil is stronger than for the laser combs. Have you seen a dermatologist? Your description of your brows and lashes sound like you might have a Taxotere issue. Some women have tried Latisse on their brows and lashes. And, I think some have had tattooed brows (permanent make up). I know what you mean about stabbing your eye due to the short lashes! I just gave up on mascara unless it is a special occasion...I'm ust not that coordinated! Take care, ~Jumpy",
      "MessageIndex": 20029,
      "PostDate": "25/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Feb 27, 2014 08:26PM jumpy wrote: Hi, Mely19, I was told that it can take 6 months before you can see the effects of Minoxidil. Hang in there. I getting pretty frustrated. I've been using minoxidil for 3.25 months now and I'm still VERY thin on top. I know my hair is longer, but I'm not sure that there is any more density. But, I am considering going \"topless\" to work next week because I can't stand the wig any longer. I just don't want to appear unprofessional. Good luck. ~Jumpy",
      "MessageIndex": 20035,
      "PostDate": "27/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Jun 7, 2014 09:46PM jumpy wrote: LW0919, you look great! I'm very happy for you. I am nearly 1 year PFC and am still bald on top. And, the texture is still terrible -- very fine and cottony. I've attached a photo from 11 months PFC. Ugh! ",
      "MessageIndex": 20431,
      "PostDate": "07/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Nov 21, 2013 11:25PM jumpy wrote: Reality, I lost my lashes and brows post-final chemo also. They are both starting to make a come back now (5 months pfc). However, the left brow hairs are curling up and toward my nose instead of straight and toward my ear! Just curious, has anyone tried Latisse to promote lash growth? I know an optometrist who will prescribe this for me, but I haven't decided yet. Thanks.",
      "MessageIndex": 19697,
      "PostDate": "21/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Jan 5, 2014 05:37PM jumpy wrote: Hi, Everyone. I'm curious to know how many others out there were slow to get their hair back, but actually got it back. It seems that most women get full coverage by 6 months. But, are there any others out there for whom it took longer? My hair has been slow coming back from TC, particularly on the top of my head. My MO and her RN both say it can take a long time, but what is long? I saw a dermatologist 6.5 weeks ago (5 months PFC) he was pretty certain that the cause was primarily due to the Tamoxifen. So, I started both Rogain 5% and I bought the Hairmax Laser Comb. I also started Biotin and boosted my protein levels. Obviously, my fear is that this is permanent, but from what I've read in the scientific/academic literature (I'm an academic myself), permanent Taxotere induced alopecia is USUALLY also associated with loss of eyebrows and lashes. Fortunately, both my eyebrows and lashes are making a strong come back (just in the past month). So, am I just slow? Here is a pic of the top of my head at about 6.5 months (28 wks) PFC. Thanks and happy new year! --Jumpy  ",
      "MessageIndex": 19818,
      "PostDate": "05/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Jan 5, 2014 06:34PM jumpy wrote: Thanks, lago. However, I think some women do get some length. A recent academic article (Kluger et al. 2012--Annals of Oncology, 23: 2870-2884) included some online pics of permanent Taxotere Induced Alopecia. http://annonc.oxfordjournals.org/content/suppl/2012/05/09/mds095.DC1/Figure_2.jpg",
      "MessageIndex": 19820,
      "PostDate": "05/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Jan 13, 2014 12:31AM jumpy wrote: My fingernails were a mess from the Taxotere, but they recovered nicely; they are  back to normal now. I just lost the nail on my right big toe, but it is growing out slowly. I had a few toenails get black and ugly. And, I still have one toenail that hasn't grown since chemo. The rest are growing back healthy. I also had thick hair that used to grow fast. I don't know what the problem is. It took me 10-12 weeks to get canny hair back. Since then it is growing at about 1/2\" every 4 weeks. But, the top is sparse. UGH!",
      "MessageIndex": 19883,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Jan 25, 2014 02:18AM jumpy wrote: Thanks, lago. I saw the CR review. And, I've already contacted my onc via email. There is a more recent academic article that offers more good news. The problem seems to be the dosing. Trials have ranged from 1mg - 5mg. And, female alopecia seems to be more complex then men's. As the Duke derm notes in the CR article, some women have sensitivity to (normal) androgen levels at the cellular level. This is what my friend the derm was saying. Before Tamoxifen there was enough estrogen to overpower the androgens on my follicle's receptors. The only way to know is to try it. Also, a generic is available now. ",
      "MessageIndex": 19956,
      "PostDate": "25/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Feb 20, 2014 10:45PM jumpy wrote: Hi, LizA, I have also been slow to recover my hair. I'm 8 months PFC today and I still wear a wig. My hair is growing, but it is very thin particularly on top. I have also been slow to recover hair on the rest of my body. As you can see from my other posts on this thread and those threads dealing with Taxotere and permanent hair loss, I have done quite a bit of research on this issue and I remain concerned. I saw a dermatologist who specialized in hair last week, but she didn't know the literature about Taxotere and permanent hair loss so she wasn't much help. My oncologist doesn't know much about this either, but said that she has had patients take a full year to recover their hair. How much hair do you have on your head and the rest of your body? I'm not sure that mine is Taxotere-induced permanent alopecia because it is growing. The top is just over 2\" and the back/sides is about 2.5\"--but I only have about 25% of the density I had pre-chemo. Another possibility is telogen effluvium (hair loss during the resting stage). Chemo causes anagen effluvium (hair loss during the growth stage), but sometimes it can also cause a switch from the growth to the resting stage which delays recovery. Hormone changes brought on by Tamoxifen and the other endocrine treatments can also cause telogen effluvium which can explain the longer recovery. Also, hormone treatments can also cause androgenetic hairloss which is usually just the top of the head and not other parts of the body. I share your frustration! Please keep us posted. Best wishes, Jumpy",
      "MessageIndex": 20003,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Feb 23, 2014 08:35PM jumpy wrote: Hi, LizA17, Yes I was using Nixon and am still using it until I use it up. But, I don't think shampoos do much and that is what the dermatologist who specializes in hair said also. However, she did prescribe the Rx strength of Nizoral which you can buy at Walgreens (the Rx is called Ketoconazole 2%). These are believed to have some anti-androgen properties. She told me to use it 1-2 times per week. I would hardly consider myself a poster-child for hair growth, but among those factors that I have control over I would say that minoxidil and eating 100g of protein/day is what has helped the most. The minoxidil 5% foam 2x/day increases the blood supply to the follicles. My protein levels were a little low during chemo and radiation even though I was eating 65-80 grams of lean protein per day (a lot of salmon, turkey, eggs, etc.). So, I boosted it to 100g. After all, hair IS protein. Once my protein level were back to normal is when I started to notice additional hair growth. I also take biotin, D3, and a Centrum (w/o iron). And, I use a laser comb. I hope this helps. BTW, what part of IL are you from? Take care, Jumpy",
      "MessageIndex": 20013,
      "PostDate": "23/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Feb 23, 2014 11:38PM jumpy wrote: Yes (but I'm out of town at the moment).",
      "MessageIndex": 20016,
      "PostDate": "23/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Mar 3, 2014 05:56PM jumpy wrote: Septmom and RhodyMMM--hand in there! You will feel better soon! jojo2373 and Timbek2--you both look beautiful! Thanks for posting. Your progress is inspiring. Again, I have HAIR ENVY!!! I'm 8.3 months PFC and am still very thin on top despite doing all the \"right\" things. I went \"topless\" as work for the first time on Friday. I just can't stand the wig anymore. I received lots of compliments. But, I miss my old hair.",
      "MessageIndex": 20068,
      "PostDate": "03/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Mar 8, 2014 09:12AM jumpy wrote: Lori, your hair is beautiful. And, that style is very becoming on you! ",
      "MessageIndex": 20096,
      "PostDate": "08/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Mar 18, 2014 11:20PM jumpy wrote: hap_k, do you think it might be telogen effluvium? ",
      "MessageIndex": 20161,
      "PostDate": "18/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Nov 20, 2013 01:02PM jumpy wrote: Hi, this is my first post to BC.org, but I have been lurking since early April. I finishes 4x TC on 20 June and have been on Tamoxifen since 11 July. My hair growth has been very slow and very thin on top. Prior to chemo, my hair was thick and healthy (I'm 51). When I mentioned this to my MO last month, she just laughed and said it would grow (6-18 months--everyone is different). Yesterday I saw a dermatologist who specializes on chemo related skin issues about other post chemo concerns, so I also asked about the thin/sparse hair on the top of my head. He said he sees a lot of this with Tamoxifen. He recommended Rogaine (minoxidil) 5% (men's). So, is there anyone out there who has the same treatment profile (TC & Tamoxifen) and struggled with this? If so, did it resolve as my MO suggests it will? Was Rogaine tried and helpful? For how long? Did anyone also try the Hairmax laser brush? Also, I am 5 months past my final TC treatment today and I can still see scalp on the top of my head. I really want to stop wearing the wig and want to know when that might be a possibility! Thanks!",
      "MessageIndex": 19689,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Nov 21, 2013 12:56PM - edited Nov 21, 2013 12:58PM by jumpy Thanks, Annie. Your hair is beautiful! It looks similar to what I had prior to treatment (although I colored it). I have to confess that your photo inspired a bit of hair-envy in me. I really hate the wig--especially with the Tamoxifen induced hot flashes/sweats. But, I have a professional job and it is important to me to not call too much attention to my appearance. I just don't know what is the primary problem. The dermatologist said there are three issues: (1) women's hair thins as they get older, but since my hair is so short it is more noticable, (2) TC recovery -- my MO's onc-nurse said 6-18 months and the dermatologist conceded that ONCs would have a better feel for the timing on that than he would (But, you are fine at 5 months!), and (3) Tamoxifen--he said that the empirical data on that is lacking (I know, I looked), but, anecdotally, he said that he sees it in his office all the time--Tamoxifen and female-pattern hair loss. I just want to know if the best Rx for me is Patience or Rogaine! So, I guess I'll have to give both a try.",
      "MessageIndex": 19691,
      "PostDate": "21/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Jan 9, 2014 09:06PM - edited Jan 9, 2014 09:08PM by jumpy Hi, Shoppygirl, I'm 6.5 months PFC (TC) and I'm still very thin on top. I have between 2-2.5\" of hair, but I am very sparse on top (see photo I posted earlier this week). I still hope to hear that others have been slow BUT successful in recovering their hair. For the past 7 weeks I've been using Rogaine (5%) 2x/day and the Hairmax Lasercomb--to it is still a little too early to tell. But, I do think I have detected some smaller hairs. Plus, I take Biotin and a multivitamin and have been eating a lot of lean protein. I'm starting to get scared about my head. But, my brows and lashes are just starting to make a come back. I wish everyone luck!",
      "MessageIndex": 19854,
      "PostDate": "09/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Jan 19, 2014 11:00PM jumpy wrote: Hi, I'm posting a few pictures that I hope show some progress. I am 7 months PFC and have been struggling with slow hair growth. My greatest concern is the hair on my head, but growth has been slow all over (scalp, brows, lashes, axilla, legs, arms, and yes, there too!). I've been using Rogaine (minoxidil 5%) and the Hairmax laser comb for the past 2 months. The picks are at 6, 6.5, and 7 months PFC.        ",
      "MessageIndex": 19920,
      "PostDate": "19/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Jan 22, 2014 09:36PM jumpy wrote: LW0919, your hair is beautiful! I am so happy for you. I have hair-envy :)   I finished chemo (TC) on June 20th and my hair is at least 3 months behind yours. Thanks for sharing. And, keep up the good progress! ~Jumpy",
      "MessageIndex": 19936,
      "PostDate": "22/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Feb 17, 2014 09:50PM jumpy wrote: Formygranddaughter--you look lovely! At 4 months you are dong great. ",
      "MessageIndex": 20000,
      "PostDate": "17/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Mar 9, 2014 12:21AM jumpy wrote: Donnabelle, Carol2, and Slv58--your hair looks lovely!  Slv58--It seems to have filled in nicely. I'm still very thin on top, but started gong wigless last week...if I comb it just right and if the wind doesn't blow... AKJ--I shaved my head. I also found the wig was more comfortable without hair underneath--good luck with everything.",
      "MessageIndex": 20115,
      "PostDate": "09/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Mar 10, 2014 11:11AM jumpy wrote: SlowDeepBreaths--you're looking good! Nice full coverage. Mely19--How is the minoxidil working? Now that my hair is a little longer I tried the liquid last night (I had been using the foam). But, I found the liquid too greasy and was in the shower washing it out 10 minutes after I applied it! I'm back to the foam. Thanks.",
      "MessageIndex": 20123,
      "PostDate": "10/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "May 17, 2014 10:38PM jumpy wrote: For facial hair from Tamoxifen, AIs, post-chemo, etc. I heard a leading dermatologist recommend \"threading\". I've had it done twice and would recommend over the other methods discussed. As for the hair on my head, I'm 11 months PFC and am still very thin on top. The minoxidil that I use has made the face fuzz worse (rubs off on the pillow at night and onto my face) but the threading has helped.",
      "MessageIndex": 20314,
      "PostDate": "17/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Feb 20, 2014 11:14PM jumpy wrote: LizA17--I know it is depressing...and frustrating! I posted a summary of what is known about permanent Taxotere-induced hair loss about a month ago. (Go to Search and search for Jumpy and look under the thread for Taxotere and permanent hair loss). But, TIPA (taxotere-induced permanent alopecia) is usually associated with the symptoms you describe--reduced hair on brows, lashes, underarms, legs, arms, and pubic area. I had that, but my brows and lashes have started to make a come back. And I am getting more hair in the other areas also. My protein levels were down, so I have boosted that in my diet. Plus I have been using minoxidil (Rogaine) and a laser comb for my head. Feel free to PM me if you would like to chat off-line. I know this is very hard and I wish you the very best. --Jumpy",
      "MessageIndex": 20005,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "jumpy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175998/profile",
      "Content": "Feb 23, 2014 11:54PM jumpy wrote: Hi, Karina, I'm sorry you have also experienced slow/incomplete regrowth. I use the Hairmax Laser Comb. It cost me about $500. There is some scientific evidence that it promotes hair growth, but not a lot. The consensus among the dermis I have consulted is that it is safe and it might help. So, I have added that to my regimen. I started using that about a week after I started the Rogaine (on 19 Nov 2013) so I can not tell what is having the greatest effect. But the both work differently so can actually compliment each other.  Have you had blood work done to rule out other causes? TSH+4, zinc, Vit D, iron, protein, etc? I'm still wearing a wig but I dye my hair the same color because I can't keep some natural hair from showing. Plus, I can mark my growth rate by the length of my gray roots!  Good luck. ~Jumpy",
      "MessageIndex": 20018,
      "PostDate": "23/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    }
  ]
}