{
  "AuthorID": "June56",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
  "Posts": [
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Jul 20, 2012 07:58AM June56 wrote: I was very sore last night. I slept in a recliner. It made my but hurt! : ) We folded a towel lengthwise and put it under me so my husband could steady me as I stood up. It really helped as I could not use my arms and my legs were a bit weak. I am getting up on my own now. Don't forget a laxative. The pain meds could constipated you.the tissue expander has not bothered me. The reduction from a DD to a C is sore still. Take the pain meds! Don't let the pain get away from you and you will be able to push through it. I am going to sit in my resin chair today and wipe off. I will keep you girls updated each day so you will know how it goes.",
      "MessageIndex": 128,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 11, 2012 03:28PM June56 wrote: Fruit of the Loom makes a soft front closure bra. It may not be the greatest for the well endowed, but for average gals it should work. It is at walmart.",
      "MessageIndex": 616,
      "PostDate": "11/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 3, 2012 07:44AM June56 wrote: Oh, Mumtothree! Big, big hug! You are dealing with a ton of stuff. When I am overwhelmed with things, I take one at a time and see if I can resolve it in any way. Sometimes I can and sometimes I have to turn it over to God. Praying makes things much easier for me. About the hair loss. I had a friend with the same thing. She was married, but her husband had a heart attack and died. Happily, a year and a half later she remarried. She lost her hair at age 13 and has lived her entire adult life without it. Are you considering reconstruction? That might be an option. The foobs I have seen look better than my old ones! I had large breasts and had the PS take my one down 4 cup sizes. Less fills on the other side and smaller shirts! Yeah! Please keep posting here and we will do our best to be your support system. Try to enjoy your day. I am sitting on top of a mountain in a cloud right now. Hope to see the sun soon. Peace.",
      "MessageIndex": 315,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 20, 2012 12:47PM June56 wrote: Howhm021: Have your party girl. We all have them! I noticed as the swelling went down, I felt rougher. Healing has been a roller coaster. Stay on your meds. I didn't and it was the wrong move. The tightness is normal. It gradually eases. Be good to yourself today. Hugs. June",
      "MessageIndex": 887,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 7, 2012 08:05PM June56 wrote: Blessings: I have one drain that is putting out 50 ccs a day. : ( I am so happy to hear that you still have your surgery date. Nothing worse than being set on something and getting it pulled out from under you. Omeggo: big hug to you! Gma Foley: push for it, girl!! I know you will. Mum, Stacy, Just, Gma and leama: go kick some serious cancer butt!!! Big hugs and prayers.",
      "MessageIndex": 468,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 7, 2012 08:06PM - edited Aug 7, 2012 08:07PM by June56",
      "MessageIndex": 469,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 20, 2012 07:20PM June56 wrote: Shabby: I had a slow recovery as well. My PS gave me oxycodone. It helped better than the morphine in the hospital. Don't feel you have to tough it out. I would call tomorrow. I sure hope you get relief soon. I am so glad you guys brought up the bloating! I looked preggers and was 10 lbs heavier. What is that? Heather: Our daughter lives not far from Nashville. Good to meet you!",
      "MessageIndex": 910,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 21, 2012 09:06PM June56 wrote: Blessings: Nine months! Wow! I would be crazy! My exchange will be in Oct. I will have had my TE for 3 months. Maybe it is according to size. I have been a stacked gal all my life, so I wanted to see how the other half lived. I went from a DDD to a B. I really love not carrying that weight on my shoulders. Blessings and Hound....KCA!!!",
      "MessageIndex": 941,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 11, 2012 03:23PM - edited Aug 11, 2012 03:29PM by June56 Damiana: Heeheehee! And one big yippeeeeeee! Lisa2012: Big honking hug, sug! You did it! Shabby: I took colace with laxative. It worked so well. I learn my awful lesson day one. Have it ready for the night you get home. Take nightly as long as you are on pain meds. Remember that your intestines go to sleep with you.Hopin",
      "MessageIndex": 615,
      "PostDate": "11/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 10, 2012 06:18PM June56 wrote: Damiana: I feel your pain! I have 500cc TE and my PS put them in filled to 400cc. I started having a hard time after the swelling went down. I am dreading my first fill on Tuesday. My friend who is a pharmacist told me to take Valium before a fill because it is the best muscle relaxer there is. I guess I will try it.",
      "MessageIndex": 591,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 19, 2012 05:42PM June56 wrote: Wintersocks: It will be the best gift you ever give yourself. You will get through this as a stronger, more complete and balanced person. The reality is not as bad as your fears. Hugs. Bras: Penneys does still have the front zip bras and Walmart does as well.",
      "MessageIndex": 854,
      "PostDate": "19/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 20, 2012 12:41PM June56 wrote: Tazzy: I so understand how you feel about those drains. I had one for 32 days before they pulled it. I have had two seromas PS aspirated and it has come back again. I have an appt tomorrow so I guess he will aspirate it again. One juicy girl here!",
      "MessageIndex": 885,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Jul 19, 2012 08:30PM June56 wrote: Had a mastectomy on the right breast yesterday with TE and a reduction on the left. It is fresh in my mind, so ask away! Lots of love and hugs to the August girls!",
      "MessageIndex": 119,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 20, 2012 09:01PM June56 wrote: Lisag46, Mooleen and Trinity: will be thinking of you tomorrow.",
      "MessageIndex": 914,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Jul 20, 2012 04:30PM June56 wrote: Thanks ameggo and Tazzy! One thing I forgot to mention. Get a pair of silky boxers. They have been a life saver. They allow me to slide in the recliner and not use my arms. If I repeat myself, I am sorry. I have had two lumpectomies and the mastectomy in the last ten weeks. Very scatter brained!",
      "MessageIndex": 131,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Jul 21, 2012 06:33PM June56 wrote: Damiana9-Great to hear about your BRAC results! TE: chose it for the shorter recovery time.Recliner: got one because I am a side sleeper and I was worried I would roll over on the drains. love my wedge pillow. If you get a recliner, keep it under your knees at night to take the strain off your back.",
      "MessageIndex": 150,
      "PostDate": "21/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 21, 2012 06:32AM June56 wrote: What's on my table, alarm clock, lamp, two books, kindle fire, phone, devotional book, tiny notebook with pen, antibacterial wipes. It is loaded! It also has two drawers full of small crafty things and knitting.",
      "MessageIndex": 918,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 21, 2012 02:21PM June56 wrote: How: That is wonderful! Mooleen: You sound great! Hope it continues. I will be having my exchange in oct. Will you be my poster girl? Blessings: One more step to the finish line. Beckers:I pray that your sad , little nipple decides to fight as hard as you do.",
      "MessageIndex": 926,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 21, 2012 09:10PM June56 wrote: The dreaded drains......just wanted to add that I had my first one out two weeks after surgery and the second one out after four weeks and two days. When they took them out, I felt nothing. I sure wish that for all of you girls getting set free this week.",
      "MessageIndex": 942,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 23, 2012 06:42AM June56 wrote: Tazzy: Big hugs and a big smile on my face for you! That's the way to KCA!!!",
      "MessageIndex": 973,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 1, 2012 10:37AM June56 wrote: Hey everybody! I am one of the July girls checking in on you! August is here and it will be a month of transitions. Good, positive ones. I am two weeks out from my unimx and feel good. I took the pain meds for a week and then went to Advil. It has worked great for me. Blessings20 had a great post with lots of great tips. I wanted to list the things I got prior to surgery that I really used. List as follows: recliner, satin boxers(helps to slide and not overuse your arms),no bra cami tops one size bigger, a pair of pull on pants and shorts, ribbon or lace to pin the drains to if you are allowed to shower,a table by the recliner with all the things that will keep you company( iPad, kindle, etc.),bottle of water at all times(your throat will get fuzzy and it will clear up a coughing spell), jolly ranchers or other hard candy,and last but not least...white, cotton grandpa undershirts(so comforting to sleep in with your silky boxers. If you have any questions, please let me know. I would love to help if I can. One more thing, get help washing your hair. I have been going to my sweet stylist who has been wonderful! Know we are thinking about you and will be waiting in the other side. June",
      "MessageIndex": 265,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 1, 2012 12:25PM - edited Aug 1, 2012 12:29PM by June56 Tazzy: You will do well tomorrow. You will smile when you wake up just knowing that there is only one way to go now and that is UP. For a couple of seconds the SN stuff will make you at least think a bad word. Mine slipped out. Ekkkkk! A bit pink faced. Know I will be holding you in my heart tomorrow. Check in when you can. Hugs and prayers.",
      "MessageIndex": 266,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 3, 2012 03:08PM June56 wrote: Yippeeeeeeee!!! So glad to see you on the other side! I knew you were one tough cookie! Glad you are doing so well.",
      "MessageIndex": 326,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 6, 2012 01:23PM - edited Aug 6, 2012 01:25PM by June56 Just: have you thought about going to Abercrombie, Am Eagle to buy some hoodies then cut the sleeves to short sleeves? I got two hoodies at Kohls that had two inside pockets. I cut the sleeves and put the drains in the interior pockets. You can't even tell I had surgery. I thought about going to Victoria's Secret for another one, but thought I might be pushing it a little. : )p>",
      "MessageIndex": 405,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 5, 2012 04:51PM June56 wrote: Monday girls: will be waiting for you on the other side! Carrie: I am one of the July girls. It is a crazy ride we are on! I was dx the end of April. Told over and over that it was less than 1 cm and lumpectomy would take are of it. So, off we went for lumpie number 1. The margins came back dirty. Six weeks later we were back for number 2. Still had dirty margins and the DCIS was more like 6cm+. I was a DD cup and the lumpies had changed the shape of my breast. At this point, I was done and ready for mx. I had the worry LD in the back of my mind as I have it in my ankles due to sports injuries. I only had SNB, but I am going to be very careful with that arm. I had a major reduction on my opposite breast as my insurance would not cover a bmx. I wanted to get rid of as much breast tissue that could get cancer as I could. I went from a large DD to a B. I have TE in the rt breast and it does look like an A cup. The swelling has gone down a lot. I am a little lopsided, but unless you really look, you couldn't tell. I wish you the best. Hugs!",
      "MessageIndex": 373,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 6, 2012 01:10PM June56 wrote: Carrie: It was not a big deal for me to have a second lumpectomy. I didn't have any problems or pain with them. I would talk with my BS and get that opinion. Don't want to be going forward looking backward. I try to live without regret. The TE doesn't bother me. They feel like a water balloon under the skin. I go for my first fill next week, so I may have a different opinion then!",
      "MessageIndex": 402,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 6, 2012 09:27PM June56 wrote: Just: such a pretty bracelet and so thoughtful. Blessings: no one talked to me about drain care. We have a station in the bathroom, but Have never used alcohol wipes. We wash with disinfectant soap prior to handling them, but that is all. I will get the wipes tomorrow. I will have had them three weeks on Wed and I am still putting out 50 cc a day. I was supposed to get it out tomorrow, but I guess not. Had a nice crying jag tonight. Not usual for me, but this healing is going so slow. Sitting around is just not anything I have ever been good at. Hope everyone gets great rest tonight. Market, Robin, Pinky and Pointvalue. Thinking of you. Hugsssss.",
      "MessageIndex": 433,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 7, 2012 08:13PM June56 wrote: Christina: I had a umx on July 18. Let me know if I can help or answer any questions. If you follow the pain med instructions, you should do well. Sometimes us gals just gotta kick some butt.",
      "MessageIndex": 471,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 8, 2012 08:11PM June56 wrote: Beckers and Trailgirl: Good luck tomorrow. Sending you peace and some ammo for that fighting spirit to KCA. I am 3 weeks out from surgery today and will tell the girls who have had surgery, I think this is a turning point. I really mentally feel like me again and am sore, but in no pain. I still have one drain, but that's ok. Trying to remind myself to live in peace with very small expectations. I look at this as taking small steps to achieve one goal at a time. Looking at the complete picture is just overwhelming. I wish you peace for a great night's sleep. Hugs!",
      "MessageIndex": 511,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 8, 2012 08:19PM - edited Aug 8, 2012 08:21PM by June56",
      "MessageIndex": 513,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 8, 2012 08:22PM June56 wrote: Nighty night, Christie. You did it , girl! KCA",
      "MessageIndex": 514,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 19, 2012 09:47PM June56 wrote: Cottontail: Walmart has them.",
      "MessageIndex": 861,
      "PostDate": "19/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 20, 2012 08:11AM June56 wrote: Cottontail: so sorry, meant no offense. I live on a mountain with the only store remotely close is Walmart. It is all we have.",
      "MessageIndex": 875,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Jul 20, 2012 07:25PM June56 wrote: Trinity, I bought a recliner, but will say it is not real comfortable. Could just be the chair. I just don't trust myself not to roll over on the drains as I am a side sleeper.",
      "MessageIndex": 135,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Jul 20, 2012 04:57PM June56 wrote: Forgot! Tomorrow I go to have the onQ removed. Will let you know how that goes.",
      "MessageIndex": 132,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 27, 2012 09:28PM June56 wrote: I had a unimx 5 weeks ago. I have a swelling on my side under my arm. I am afraid it is LE. I have had LE in my ankles since I was 18 and really don't want any more. I have TE in place now. I hope that the exchange surgery does not cause even more problems.",
      "MessageIndex": 1412,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "June56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154944/profile",
      "Content": "Aug 23, 2012 05:03PM June56 wrote: Yes, there is that chance. My PS told me that if I lost weight, I would lose it in the chest as well. Good luck!",
      "MessageIndex": 1,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/792364",
      "Title": "Post mastectomy plastic surgery dreniger June56"
    }
  ]
}