{
  "AuthorID": "juneth",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170836/profile",
  "Posts": [{
    "AuthorID": "juneth",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170836/profile",
    "Content": "Mar 11, 2013 08:44PM juneth wrote: Your not the only one just diagnosed. I was diagnosed on 2-15-13 with Breast Cancer. I got the phone at 5:20 pm, it was a holiday weekend. On the 20th of Feb. I was in getting an MRI and I met with my Surgeon. He told me he could only give me the basics until after my surgery. He did tell me he thought from the MRI and the Biopsys I had Stage II breast cancer, but would not be able to tell me much more until after my Surgery.  I was extremely lucky, while I was meeting my surgeon for the first time, he told me he had a cancelation on March 4, and would do my surgery then. I was so lucky, I jumped on that date. While talking to my surgeon< I told him I wanted a double Mascetomy, because I did not want to deal with this again in my future. He told me, that is what he would recommend, otherwise there would be a good possiblity I'd be back in the same situation in a few years. On March 4, I went in and had by double mascetomy, and I still have no results on the biopsy's, I will have the results on Mach 13, when I go in to have my 3 tubes removed and the stitches removed. The doctors can't give you all your answers until after your surgery. This is going to be hard, too many questions and not enough answers. I was the same way. I was very lucky, I also had a great husband that knew 2 women who have gone through this and they helped me in some ways. I will help you on what I know if you need or want me to.  Just dont do anything stupid, give the doctors time to do what they do and it will work out. Juneth if you want to talk to me you can email me at jsteubing@hot.rr.com",
    "MessageIndex": 49,
    "PostDate": "11/03/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/801005",
    "Title": "help. nobody is responding to my posts. englishteacher juneth"
  }]
}