{
  "AuthorID": "junie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
  "Posts": [
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Jan 22, 2010 05:35PM junie wrote: So very, very sad to hear this.   A toast to Kimmy from the Crazy Tree and gentle hugs to her family and all her bc sisters.  ",
      "MessageIndex": 23,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747176",
      "Title": "Kimmytoo Sachi justjudie"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Sep 7, 2008 09:08PM junie wrote: Gentle hugs to nusband and wife!  I, too, was diagnosed with IDC, grade III, 1.3 cm, highly aggressive......I had a lumpectomy, axillary node dissection (nodes were clear) did chemo, radiation, 5 yrs Tamoxifen--just want to let you know that I had a similar diagnosis as your wife and that was over 7 years ago, and I'm still kicking!!! Best wishes to you both just now.   I think you probably can take a bit of time to get a second opinion and explore possible options.   Hope your wife will also join the discussion boards soon--so much comfort and help available here.  ",
      "MessageIndex": 6,
      "PostDate": "07/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/720810",
      "Title": "Husband of \"Just Diagnosed\" meinny7 Mary-Lou"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "junie wrote: I had ax node dissection, 15+ nodes.   Fortunately had a surgeon that cautioned me on LE.  I have been diligent about not over using my at-risk arm--no IVs, innoculations, pin-pricks, etc.   Don't carry heavy things on that side etc, etc.   But, now I have some grotesque wart that is growing larger on my upper arm.   It is to the point that it catches on sleeves if I push them up; a good scrub with a wash rag lets me know its there.    So, time has come to address removing it with my primary care physician.   I want to discuss with him, intelligently, my LE concerns... Any suggestions on the safest method of removal?   Shaving it off, freezing it off, using an OTC wart removal?   Any suggestions are welcome.   Plan to call next week for an appointment--realized that I should do this before the end of the year since I've met my med deductible for this year....thanks to all!!!     Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/725556",
      "Title": "looking for advice from you LE experts... junie Binney4"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Jun 2, 2007 09:52PM junie wrote: [[[[h u g g g s s s s]]] Take a deep breath! You are at the most terrifying time possible--may have a problem; don't know; what if.......it is a lonely, scary place to be. Your mind is in total chaos! Hoping that all your tests come up B9--good odds for that but great that you are having it checked out. Best wishes for you--keep us posted on what you find out!",
      "MessageIndex": 1,
      "PostDate": "02/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/624418",
      "Title": "terrified windblown Weimarmom"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Jan 12, 2010 04:07PM - edited Jan 12, 2010 04:08PM by junie sad news indeed.  Anyone else remember Kimmy's \"crazy tree\"??   Gentle hugs to Kimmy and family--and many thanks to Kimmy for the fun, love, and support she so generously gave to us all.",
      "MessageIndex": 27,
      "PostDate": "12/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746636",
      "Title": "kimmytoo Sachi normalcani"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Dec 12, 2008 01:28AM junie wrote: hugggssss, Diane, as you start your journey...very interesting question... I never once thought of myself as being \"sick\"--not during surgery, chemo, rads, tamoxifen...never was I \"sick\".  To me, \"sick\" is take a couple pills of this or that and call me in a couple days if you don't feel better.   What you are about to experience goes far beyond being \"sick\" but I'm having a problem with coming up with a better definition--someone else chime in here!!! you are not \"sick\"--you might get sick from chemo txs or rads tx, but YOU are not \"sick:  You will most probably get real sick and tired of treatments and their after affects, but you will not be sick--\"sick\" is now an interesting word--hope other wordsmiths voice their opinions.... but, I still can't think of a one-word definition--\"sick\" just isn't it!!!",
      "MessageIndex": 19,
      "PostDate": "12/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/725761",
      "Title": "Do you consider yourself sick? shockedat39 kmccraw423"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Jun 28, 2011 11:45PM junie wrote: Cookie--by all means, plan your dream trip!   That is what got me through chemo and rads.....I planned a trip to the southern coast of Spain--down to the hotel, which room I wanted to book, and the car rental agency!   Kept me occupied during many sleepless nights.    I haven't made it there yet, but have had some wonderful trips post tx--I was fortunate to return to my favorite place and was able to visit/stay in Venice for the 3rd time.....and, if I had to choose to return to Venice or make the trip to Spain--think I would choose Venice again!    I also love Cozumel and have been to Playa del Carmen many, many times.......plan your trip...enjoy the planning.....then, GO!!!",
      "MessageIndex": 23,
      "PostDate": "28/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770923",
      "Title": "Anyone have a real or imaginary vacation planned in the future? cookie97 NewReality"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Aug 1, 2008 11:04AM junie wrote: Gentle huggsss to Zaro and her family.",
      "MessageIndex": 19,
      "PostDate": "01/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/718844",
      "Title": "Definely Crunch Time for Zarowny!!! hollyann BethNY"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Jul 2, 2011 11:54PM junie wrote: Patriotic---as a \"young kid\"  say ages 8 to 13, my parents took me to all the places you metioned.  All were great!   But, one place that has stuck in my memory for many years is Zion Nat'l Park--might want to include that one on your list.",
      "MessageIndex": 51,
      "PostDate": "02/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770923",
      "Title": "Anyone have a real or imaginary vacation planned in the future? cookie97 NewReality"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Oct 9, 2007 11:44PM junie wrote: How frustrating!   I probably would have said something--I had a temp handicap tag during treatment.   I did get several comments from people and I would just smile and say--\"hey, you can have my permit if you'll take my cancer, too\"   That shut them up quick! I had one bad experience.....I had just finished chemo and was waiting to start rads and I had to travel for work.   When they called my flight, I got up and stood in the pre-boarding line.   A flight attendant came over and very nicely told me I was in the wrong line and to wait my turn.   I said, no--I'm pre-boarding due to medical reasons.   He started to push the issue, but returned to the counter, where I watched him point me out to other airline employees.   Bless his heart, he was also the attendant on the flight.   He surely did do a double-take when he passed by my seat and I was sitting there bald as a cue ball--because the minute I got settled in my seat, I whipped off my scratchy wig that made me look normal and suddenly, I didn't look so healthy and normal any longer!   I'm sure he learned not to be so judgmental about passengers. Before cancer, I might look hard at someone jumping out of a car who was parked in a handicap spot, or someone riding a motorized shopping cart who looked healthier than me........but, never again! Try to just laugh it off--hard, I know.   If she's been watching you for a week, you may run into her again--maybe someone will chime in with a perfect answer you can give her--short of telling her where to go and what to do when she gets there!!!   Hang in there!!!!",
      "MessageIndex": 4,
      "PostDate": "09/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693534",
      "Title": "Do I have to look disabled? Fllorik Fllorik"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Dec 25, 2007 10:27PM junie wrote: hugggsssss, jill--Hawaii sounds terrific--enjoy!",
      "MessageIndex": 58,
      "PostDate": "25/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696563",
      "Title": "OMG Brain Mets for me BJW Maya1"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Jan 27, 2009 12:22AM junie wrote: So deeply saddened by this news.   Deb was a one-of-a-kind most wonderful person!   She touched so many lives and brought such joy.   She enriched the lives of everyone--what a wonderful legacy.  ",
      "MessageIndex": 108,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Jul 6, 2008 11:58PM junie wrote: I am so deeply sad.  Kari's smile is lighting up the universe as she makes her journey.  She won't be lonely when her transition is finished--lots of dear sisters are waiting for her!  Most sweet and genlte hugs to Pat and family.   I cannot say \"condolences\" but rather, \"Congratulations\" and thank you, Kari, for being such a wonderful presence in our lives!",
      "MessageIndex": 139,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708474",
      "Title": "Kari is our latest Angel djd Rocktobermom"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Jun 30, 2008 10:27PM junie wrote: Dear KariLynn, I am sorry to hear your latest news.   Gentle hugs and much love coming your way from Eureka!  I am honored to have met you and your mom at the Eureka get-together.  I won't repeat the wonderful tributes given to you by other posters--all so true, as you are such an inspiration to so many on the boards. But, I will make one comment...ladies, KariLynn has the most beautiful smile in the world!  Her smile lights up the universe.  Keep smiling, girl!!!  junie",
      "MessageIndex": 94,
      "PostDate": "30/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708158",
      "Title": "Very bad report KariLynn roseg"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Jul 3, 2008 12:24AM junie wrote: Victoria--thanks for the update--certainly NOT one I wanted to hear any time soon! Will you all understand if I suddenly turn 3 yrs old, start stomping my foot and screaming, DAMMIT, DAMMIT, DAMMIT, DAMMIT, and burst into tears... ...gentle hugs and much love to Kari and her family.  junie",
      "MessageIndex": 112,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708158",
      "Title": "Very bad report KariLynn roseg"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Aug 24, 2010 05:58PM junie wrote: try looking up Tamoxifen......just guessing that is the drug you are trying to research.   Good luck to you and your aunt!",
      "MessageIndex": 1,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757155",
      "Title": "87 yr old with BC rcmc53 desertladyarizona2010"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Oct 22, 2006 04:19PM junie wrote: I've flown many times since finishing chemo and rads. I had 15 nodes removed. No problems and no need for sleeve. We are all different, so you might want to check with your onc, or rads onc and see what advice they offer in your particular situation. Have a great time on your trip--you deserve it!!!!",
      "MessageIndex": 1,
      "PostDate": "22/10/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/449196",
      "Title": "flying soon carlsoj NPat"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Oct 16, 2009 08:21PM - edited Oct 16, 2009 08:22PM by junie We have all witnessed much profound wisdom, courage, bravery on these threads...but none so great as what we have experienced by knowing amber.   Her star is shining brightly.",
      "MessageIndex": 57,
      "PostDate": "16/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742156",
      "Title": "Mrs_X_Sunneedazee (Amber) dmacw janie44"
    },
    {
      "AuthorID": "junie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2369/profile",
      "Content": "Apr 1, 2008 08:39PM junie wrote: I don't know if you, or who, will be traveling with your mom on the flight to Bermuda.   But, a few things to consider and can be worked out with a few quick phone calls.   Make arrangements for your mom to pre-board her flights.   I did that once when I flew during chemo treaments.   Also, if she is extremely fatigued, request wheelchair assistance as well as pre-boarding.   Most airlines don't require any written evidence, but a brief note from her oncologist would be nice to have.   Also, recommend that she wear a surgical mask while in the airport and while flying.   There are a kazillion germs flying around airports and planes.   Be sure she has a big bottle of water after she gets through security so she can stay hydrated while waiting to board and on the plane. Halfway through my treatment, I wanted to take a little trip but we were worried about low blood counts.   Mine were really low.  My oncologist had a letter typed up and gave it to me--told me to take along a thermometer and take my temperature 3 times a day.   If I started running the least bit of fever, regardless of whether I felt bad, go to the nearest hospital with his letter--they would how to treat me basis his letter... Best wishes to you and your mom! junie",
      "MessageIndex": 12,
      "PostDate": "01/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703040",
      "Title": "Travelling while on Chemo? christina82 junie"
    }
  ]
}