{
  "AuthorID": "justme1971",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201574/profile",
  "Posts": [{
    "AuthorID": "justme1971",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201574/profile",
    "Content": "justme1971 wrote: I am  a high risk 43 year old, my mother passed at 48 years old from breast cancer, maternal aunt at 50. I have been going as I should for yearly mammogram since age 30. Due to dense breast tissue and an area they wanted to watch I started going every six months in 2006, alternating between mammogram and MRI. Two months ago after my MRI, I was called back for a repeat MRI. My doctor called me 2 1/2 weeks ago on a Friday night, told me there was a new area about the size of a dime that she wanted biopsied by MRI guidance, she wanted it scheduled asap and that she was concerned, so I did as instructed. Went today for that biopsy was met by the radiologist/doctor, now mind you this is the same radiologist that has read my reports since 2010 and just read them 2 1/2 weeks ago. Was told that she now thought it was a lymph node and nothing to worry about, also that it was near a vessel and she really didn't want to biopsy that close to a vessel. So we did another MRI. She showed me the MRI it was a clear dime size lesion on it, that was not there 6 months ago. I asked how can you now be sure it is a lymph node when 2 1/2 weeks ago I was told a biopsy should be scheduled asap. She completely blew me off and told me to schedule my regular mammogram for 6 months from now. My husband was done the exact same way 4 years ago and was told he had a very bad case of bronchitis when a chest x-ray was finally done he was diagnosed with Stage 4 small cell lung cancer that already metastasized to the right adrenal gland, liver, both femurs, colon and skull. He passed 4 months later. At the time our daughter was only 3 years old. And NO he was not a smoker. I HAVE to be here to raise my daughter she is only 7 years old. How can a doctor that showed such urgency in a biopsy just 2 1/2 weeks ago now say it is not needed. Was it because I lost my health insurance last week????? Please help, does anyone know what I should do, I am lost and scared. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "13/06/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821964",
    "Title": "Being ignored by doctor justme1971 edwards750"
  }]
}