{
  "AuthorID": "justachapter",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196633/profile",
  "Posts": [{
    "AuthorID": "justachapter",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196633/profile",
    "Content": "justachapter wrote: I do not know too many specifics right now.  A bit about me though I have not felt good for a year and it was low B12 (normal, on B12 injections) low D and I had a nagging pain on my right side in my back.  Was sent to neuro as they thought it was nerve issues due to B12, then to Rheumy as they thought it was joint.  One of the MRI's showed a spot on m sacral area that said either an \"atypical hemangioma or metastasis.\"  Before they figured that out, it was decided I needed a complete work up and I'm a poster child, I had not had a mammo in 3 years and I'm 46.  We moved and I loved my old Dr. and just hadn't been proactive about it. Had the mammo, suspicious cluster, magnification, biopsy last Friday (ended up with a hematoma).  Have an appointment on Thurs as they like you to come in.  However, my Dr. called me this morning.  She asked if I had an appointment and I said yes.  She said to keep it and then asked if I wanted her to go over them with me.  It was then that I knew.  It is DCIS, but that is the preliminary, I guess other tests are still being run? I really feel not feeling well etc. was leading me to this dx. So, first of all Dr's doing the biopsy should never speculate, she stated she was pretty sure it was B9.  I had not done self exams so after the suspicion I started checking around and found a lump right near where the cluster was.  I asked the Dr. to check my mammo and she didn't see anything.  I'm dense, so of course she probably didn't.  Could they find something further once they do more testing or whatever the next step is? Thank You and thoughts and prayers to all on this board. Dx 2/26/2014, DCIS, <1cm, Grade 3, ER+/PR- Surgery 3/12/2014 Lumpectomy: Left Radiation Therapy 4/24/2014 Hormonal Therapy 6/17/2014 Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "25/02/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/818503",
    "Title": "Beginning A Journey I never thought I'd be on. justachapter Nikkito"
  }]
}