{
  "AuthorID": "JustJude",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162743/profile",
  "Posts": [{
    "AuthorID": "JustJude",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162743/profile",
    "Content": "Oct 18, 2012 08:23AM JustJude wrote: I'm 55 and ALIVE! Just went thru ALL of the same feelings in March 2012 and yes - IT SUCKS! But, you will be a new person on the \"other side\" - I promise! I had biopsies on both breasts and my \"girls\" ended up being able to swear in multiple languages! I suggest that you start TODAY by signing up for a CaringBridge.org site. It helps so much to be able to let everyone know what's going on with you & how you feel! When you're in a tizzy, as I know you have been, it's hard to remember WHO you've told WHAT to! This site can keep all of your loved ones UPDATED as often as you care to about where you are in your journey. I posted nearly every day, and was very graphic with everybody! From entry titles ranging from \"The other C word that makes you cringe too!\" to the all time favorite \"Poop!\" I wanted them to know what it was REALLY like so they could be aware of what this diagnosis / journey entails! Everybody LOVES my site and thinks that I should write a book about my journey! Go there NOW and sign up - it will save you lots of times repeating all of the steps of your journey! Your friends/family can post messages there for you too! It was TRULY comforting to only have to remember WHAT the daily update is ONCE - and let everyone know at the same time! I am past chemo (yippie), past my lumpectomy (yippie) and more than half way thru radiation right now! I am living proof that you CAN grow up when you're 55! I had never even been under anesthesia before - and was terrified of doctors & dentists, too! Oh, and on top of the fear of the medical field, I am also a PUKE PHOBE! My husband went thru HELL too. They don't give nearly enough attention to what THEY go thru with us! Patience, love & hope are what got US through this, so far! Anything that I can do to help anybody else thru their journey - I AM HERE FOR ANY Q&A! We're part of an elite group now & we're ALL IN THIS TOGETHER! One day at a time............really! Much love to all going through this!",
    "MessageIndex": 413,
    "PostDate": "18/10/2012",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
    "Title": "In shock bennymuffins websister"
  }]
}