{
  "AuthorID": "justriden",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90938/profile",
  "Posts": [
    {
      "AuthorID": "justriden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90938/profile",
      "Content": "Aug 19, 2010 09:45PM justriden wrote: O2Bhealthy, my onc office will not let his staff draw from the feet, thats why I want to keep the port until after my appointment in Dec, go figure. I, too, have been lurking for a long while. Just so worried about so many issues that somehow it seems like a security blanket type of attachment. I have heard of women who keep them for years after treatment (2 or 3 yrs). It seems easy for them to tell us we dont need it anymore, but such a hard decision to schedule the removal,for me anyway. I am not good with confrontation either.Let me know what you how it goes with the letter.",
      "MessageIndex": 2,
      "PostDate": "19/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/756912",
      "Title": "when to remove port after BMX justriden justriden"
    },
    {
      "AuthorID": "justriden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90938/profile",
      "Content": "Aug 20, 2010 05:47PM justriden wrote: kane 744, are you a horse person too?  I can manipulate my horses (or vise versa), they were my therapy during treatment as well as my sanity.  Of course, as you know, they want to eat on schedule so they motivated me to keep moving. Simply love them. I\"ve made an appointment to talk with my surgeon on the pros and cons once more. Everyone has been so much help through my journey, for that I'm thankful.",
      "MessageIndex": 4,
      "PostDate": "20/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/756912",
      "Title": "when to remove port after BMX justriden justriden"
    },
    {
      "AuthorID": "justriden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90938/profile",
      "Content": "justriden wrote: I've had a bilateral Mx with lymph removal Jan 27th, 09.  Just completed my last Herceptin July 12th and now my onc and BS both say it's time to remove port.  What about blood draws and such.  I do have mild lymphedema (mainly in the trunck area and under arms) which I have under control for now with MLD daily. My onc says with proper sterile technique, blood draw from arms is not an issue.  Port was put in March of 09 for chemo and herceptin. I'm confussed with this as everything I read says \"no blood draws or BP's\".  Can any one help with their own advice or knowledge? This is my 1st post even though I've been reading for awhile. Am I in the right place? Bilat Mx-ER/PR- Her2+ 0/12 nodes left/ ER/PR+ 0/20 nodes right. TCH x 6 march thru June 09-Done. Herceptin March 09 thru July 2010-done. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/756912",
      "Title": "when to remove port after BMX justriden justriden"
    }
  ]
}