{
  "AuthorID": "juststartin…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83051/profile",
  "Posts": [
    {
      "AuthorID": "juststartin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83051/profile",
      "Content": "Apr 30, 2009 06:40AM juststarting wrote: ElaineD How did the cancer come back with no tissue?  Is that a stupid question?  I thought if you remove the breasts and ovaries, you are clear of a reoccurance?  i see my doctor today for my BRCA results and am scared out of my mind.  I also heard that my risks for colon as well as pancreatic cancer increase but this info is through the internet and we all know how unreliable that is at times.  Does anyone know if that is true?  I found out today at 2:30 and have so many questions (all written down) but was wondering if you all could give me some additional insight.  Hoping it calms me down before I get there (2:30 today)!",
      "MessageIndex": 10,
      "PostDate": "30/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/733291",
      "Title": "BRCA testing deb6563 tweekerbeeker"
    },
    {
      "AuthorID": "juststartin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83051/profile",
      "Content": "Apr 29, 2009 07:36PM juststarting wrote: I get the results tomorrow; I would recommend anyone who is thinking of getting this done, make sure you have disability insurance and increase your life insurance first.  I am the caregiver for my family, and now with possible multiple surgeries I am worried about finances just when I should only be concentrating on my health.  All I know right now is at 39 (barely) I have been diagnosised with grade 3 breast cancer.  There is only 1 female on my dad's size and she had breast cancer and father has prostrate cancer.  Because I have the most aggresive form of breast cancer, my doctor opted to have me tested for the BRCA gene.  I am fearful on the results but preparing for the upcoming decisions either way.  I have been doing some research on the internet and see that BRCA 1 and 2 not only increase your risks with breast cancer and ovarian cancer but also colon and pancreatic?  Does anyone else know that this is true or is this just another untruth the internet is full of?",
      "MessageIndex": 38,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/706229",
      "Title": "BRCA2 positive and now what??? seoulite tweekerbeeker"
    }
  ]
}