{
  "AuthorID": "JXmom2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239770/profile",
  "Posts": [
    {
      "AuthorID": "JXmom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239770/profile",
      "Content": "JXmom2 wrote: Hi ladys please read my info below the main info I'm aiming to hear about is What was your birade score or first assumption that pointed you to a biopsy and was it correct? IF it is cancer instead of getting the lump taken it and more tests will they let me just do a double mastectomy because of my family history I would want it.. And that would skip another scar/surgery right? Last what's your opinion based on these findings. I hate dr code id rather they say oh it's ...__% that is malagnent. Info Im 27 Have a big lump, my dr said prolly a cyst but got an ultra sound. The tech did her thing said hold on came back with a dr who asked a bunch of questions then said I need a biopsy. My Drs office called the next day said they can't get me seen my by the surgical dr my dr wanted but being a timely matter he okayed for radiologist at the breast center to do it. I asked them to read the report they had from ultra sound 👇🏼 It's a birade 4C. A Suspicious abnormality with angular and indisnctive margins that's 1.3cm x 1.2 x 1.2 at the 12 o'clock position. 2 aunts on dads side have est pos breast cancer the one has HER2. My dad had prostate cancer Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/848408",
      "Title": "Drs codes. Your opinion? JXmom2 etnasgrl"
    },
    {
      "AuthorID": "JXmom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239770/profile",
      "Content": "Sep 26, 2016 11:49PM JXmom2 wrote: thank you for sharing! Only 2 days left till biopsy. Just nice to talk since I can't keep busy enought to get it off my mind/ the same breast is having pain now. A spot the side of lump/ been using an ice pack. Ready for biopsy. Just looking for story's like yours ladys with bi rad 4 of some sort. Il ofcourse post my results good/or bad to give people an idea of what their results might be!  I don't have the best breast anyway (Tublar) so to try the lump/radiation over recontruction really wouldn't be a big let down I feel like either way it's scars and treatment. I had a genetic thing that caused my liver to get cirrohis so having a transplant at 13 I'm really ready with the anything is possible ...kinda thought. It's this part the waiting and different tests that's hard",
      "MessageIndex": 2,
      "PostDate": "26/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/848408",
      "Title": "Drs codes. Your opinion? JXmom2 etnasgrl"
    }
  ]
}