{
  "AuthorID": "jzog71",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166937/profile",
  "Posts": [
    {
      "AuthorID": "jzog71",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166937/profile",
      "Content": "Jan 10, 2013 09:52AM - edited Jan 10, 2013 09:54AM by jzog71 Genetic testing came back NEGATIVE! Not to worry karenmcardle, I'm new to this too.  I had to look up alot of the abbreviations too.  My surgery is in 8 days and now I'm coming down with a sinus infection with sore throat.  Waiting to hear back from my doctor to see if I can have an antibiotic before my surgery.  I pray that the surgery is not postponed. ",
      "MessageIndex": 2,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/798310",
      "Title": "Surgery in 2 weeks and waiting on genetic testing results jzog71 jzog71"
    },
    {
      "AuthorID": "jzog71",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166937/profile",
      "Content": "jzog71 wrote: I've known about my bc since beginning of December.  My surgery is scheduled for 1/18/12 and just decided to have implant for reconstruction.  I have a high family history of breast cancer (total of 5 aunts with breast cancer).  So I opted to have the genetic testing done.  They said it would be two weeks for the results, but with the holidays it has been longer.  I've decided that if the genetic testing is positive that I will have a double mastectomy.  At this point, I only have bc in my left breast and my right is clear of bc.  Has anyone tested positive for the gene? Can someone how recovery goes with an implant, your personal experience? Dx 1/18/2013, DCIS, 4cm, Stage 0, Grade 3, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/798310",
      "Title": "Surgery in 2 weeks and waiting on genetic testing results jzog71 jzog71"
    },
    {
      "AuthorID": "jzog71",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166937/profile",
      "Content": "Jan 2, 2013 06:57PM jzog71 wrote: My surgery is January 18 - mastectomy.  Just met with my plastic surgeon 12/31/12 and was given the rescontruction options.  After careful consideration, I've opted for implant with immediate reconstruction.  All of this is quite overwhelming dealing with the preparation, emotions, thought of recovery, etc.  I've been overwhelmed by family and friends wanting to help.  I just started meal train for after my surgery.  I already have people signing up to help.  I'm the one always helping others, so accepting help is often difficult.  But, I am putting myself out there and letting others help.  I'm taking the idea of a recliner.  We're moving one to our main level that is currently downstairs.  Thanks for the pointers.  I'm finding it very helpful to hear from others that  have gone through this.  I have a wonderful supportive husband, but even then I need to hear from other BC survivors. Thank you!  ",
      "MessageIndex": 151,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    }
  ]
}