{
  "AuthorID": "Kaakmylife",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181504/profile",
  "Posts": [
    {
      "AuthorID": "Kaakmylife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181504/profile",
      "Content": "Jun 14, 2013 12:23AM Kaakmylife wrote: Thanks! I'm trying to keep myself distracted! We do have a local breast cancer center that provides free mammos and US. So that has been taken care of. I am probably just overreacting like usual ;) I hope everything turns out well for you!",
      "MessageIndex": 3,
      "PostDate": "14/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806018",
      "Title": "Worried.. Kaakmylife Kaakmylife"
    },
    {
      "AuthorID": "Kaakmylife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181504/profile",
      "Content": "Jun 14, 2013 10:57AM Kaakmylife wrote: He didn't say anything about a biopsy today..but my doc mentioned it on Tuesday..I'm hoping she calls me tomorrow! I will ask her about the biopsy. Also, I really wasn't expecting them to tell me anything today. The doctor told me they would have the results tomorrow..but when she was done doing the US she went and got him and he told me this! Ugh..this is consuming me! Sorry to hear about that, Jenna! You don't live far from me!",
      "MessageIndex": 6,
      "PostDate": "14/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806018",
      "Title": "Worried.. Kaakmylife Kaakmylife"
    },
    {
      "AuthorID": "Kaakmylife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181504/profile",
      "Content": "Jul 3, 2013 03:14AM Kaakmylife wrote: I haven't wrote anything lately but I thought I would give the latest! I had my MRI done and the radiologist is now requesting a biopsy! The solid mass is 3.3 cm x 2.4 cm x 1.9cm and a Bi- rads of 4. My biopsy is scheduled for next Wednesday and my results will be back Friday! What can I expect with this biopsy? It's an ultrasound guided! Thanks!",
      "MessageIndex": 7,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806018",
      "Title": "Worried.. Kaakmylife Kaakmylife"
    },
    {
      "AuthorID": "Kaakmylife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181504/profile",
      "Content": "Jul 4, 2013 12:40AM Kaakmylife wrote: Thanks everyone! I'm just really nervous about this whole thing! The biopsy.. the results! I know my chances of it being cancer is less..but I can't help to think about the what if's! I am going to ask the radiologist when he does this biopsy what his thoughts are. He did tell me some things about it..but not really enough to ease my mind!",
      "MessageIndex": 11,
      "PostDate": "04/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806018",
      "Title": "Worried.. Kaakmylife Kaakmylife"
    },
    {
      "AuthorID": "Kaakmylife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181504/profile",
      "Content": "Kaakmylife wrote: Thanks for taking the time to read my post. I am 31 and the mother to 4 wonderful children! My youngest is still nursing and while I was nursing her I found a lump at the 6 o'clock position on my right breast about two weeks ago. With having no insurance for myself, I waited to see if it would go away. It didn't so I made an appt with my doctor..she stated that I have a superficial firm lump and she ordered an US. Which will be done tomorrow. She stated that they will more than likely want to do a biopsy on it. She said that she was fairly certain that it was not a cyst. I have myself a nervous wreck! Any advice, thoughts or anything is greatly appreciated! Thanks so much, Wendy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806018",
      "Title": "Worried.. Kaakmylife Kaakmylife"
    },
    {
      "AuthorID": "Kaakmylife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181504/profile",
      "Content": "Jun 14, 2013 10:41AM Kaakmylife wrote: Ok..so I'm here again. Had my US today and afterwards the radiologist came in and said that it isn't a cyst. He wasn't sure if it was related to breastfeeding or you know other things ( his exact words) And his comment when feeling the limp was...WOW! ugh..that was a punch in my stomach! He said he wanted me to have a MRI ? I'm so lost and confused? Is this a normal procedure? What does the MRI tell? Thanks",
      "MessageIndex": 4,
      "PostDate": "14/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806018",
      "Title": "Worried.. Kaakmylife Kaakmylife"
    },
    {
      "AuthorID": "Kaakmylife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181504/profile",
      "Content": "Jul 4, 2013 07:55PM Kaakmylife wrote: Actually, she favors that breast the most! Which she always has! Well I won't have to wait long according to the calendar but my mind will think it's forever! Thanks for the well wishes! I will keep you informed!",
      "MessageIndex": 13,
      "PostDate": "04/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806018",
      "Title": "Worried.. Kaakmylife Kaakmylife"
    }
  ]
}