{
  "AuthorID": "Kadyann",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108017/profile",
  "Posts": [
    {
      "AuthorID": "Kadyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108017/profile",
      "Content": "Mar 5, 2011 04:13PM Kadyann wrote: Katonine,  Thanks for reaching out.  Your compassion is very touching. I too feel like there has to be some great meaning behind this journey i just wish that there was an easier way to get there.  Oh well, when I start feeling sorry for myself I just need to sit back and think of the many blessings in my life and all that has gone well.  It is just hard sometimes when I feel like I really do try to take care of myself and I see others that don't and I am the one with cancer.  I finished chemo on 12/28/10.  I had 5 cycles of TCH and will continue herceptin through next October.  I will also be starting tamoxifen soon. pfc is past final chemo.  Take care",
      "MessageIndex": 12,
      "PostDate": "05/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "Kadyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108017/profile",
      "Content": "Aug 23, 2011 10:22AM Kadyann wrote: Hi all, I had LD reconstruction with an implant as there was concern about stretching radiated skin.  I was able to get a size D cup for symetry(sp?) as I only did the one side (a decision I now regret sometimes).  However, I did have a recurrence on the mastectomy side which was in breast tissue so a mastectomy does not mean your totally safe from bc.  In fact, my doctor and surgeon at the Mayo Clinic both say that an elective mastectomy of my \"good breast\" has not been proven in studies to increase long term survival for whatever that is worth.  As far as risk goes, I have been told that the age you were when you received the radiation for hd matters a great deal.  The risk appears to be much higher (I have seen 30% and higher) if you were 20 or younger.  Something about breast tissue still maturing in these years.  It also decreases risk if you had already given birth.  Interesting.  As for the lung cancer risk, I am hoping my boobs soaked up all that radiation and spared my lungs!",
      "MessageIndex": 60,
      "PostDate": "23/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "Kadyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108017/profile",
      "Content": "Mar 4, 2011 08:45AM Kadyann wrote: Hi all, I am also a hodgkins and BC survivor.  Unfortunately I am now dealing with my second bc.  I was treated for hodgkins in 1988 with only radiation and was diagnosed with DCIS w/ micro invasion in 2003.  Had masectomy with LD reconstruction w/ implant.  This past August I felt a rice shaped bump in reconstructed breast and it was bc again.  Not sure if new primary or recurrence because pathology is totally different (first was high grade er/pr- this is low grade er+ her2+) so this time I went the chemo route.  Interestingly enough there was some talk that I possibly could be radiated again but the possible side effects sounded rather nasty and not something that I would probably ever consent to.  I hope that we can keep this thread going because it is so nice to connect with others that have shared a similar experience.",
      "MessageIndex": 8,
      "PostDate": "04/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "Kadyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108017/profile",
      "Content": "Mar 5, 2011 11:43AM Kadyann wrote: kle, I am feeling pretty good as i am 9 weeks pfc.  However, emotionally I probably have a ways to go.  I honestly never felt that I would die from the hodgkins or first bc, but now my faith has been shaken.  I was just talking to a friend who is close to her 2 year bc anniversary and said she can't wait for the 5 year mark so she is \"cured\".  I didn't really have the heart to point out that I was 6 1/2 years out and was still blind sided again.  I can't help but think what have I done that is so wrong/bad that this keeps happening to me??  I hate it but I definitely feel a little resentful.  Guess I am just having a down day.",
      "MessageIndex": 10,
      "PostDate": "05/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "Kadyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108017/profile",
      "Content": "May 3, 2011 10:21AM Kadyann wrote: Diane,  I am curious as to why your onc does not want you to use Latisse?  I finished chemo 12/28 and have been using it and have noticed huge improvements in both lashes and brows (been using it there too).  I never did lose all of either but things got pretty sparse.",
      "MessageIndex": 9107,
      "PostDate": "03/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Kadyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108017/profile",
      "Content": "Feb 23, 2011 05:39PM Kadyann wrote: I have also had this problem.  I finished TCH in late December and since fourth treatment (had 5) my eyes are a drippy mess.  They are also very swollen underneath.  I did feel that it was getting a little better but today seems to be worse again.  Kelly - how did you figure out that you had scarred tear ducts?  Some people seem to clear up on their own and some need intervention - just wondering which I am?",
      "MessageIndex": 5,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765334",
      "Title": "Watery Eyes??? mommyx3 Elizabeth1959"
    },
    {
      "AuthorID": "Kadyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108017/profile",
      "Content": "Nov 4, 2011 08:29PM Kadyann wrote: I actually lost weight and have been on tamoxifen for over 6 months and held steady on that. ",
      "MessageIndex": 1,
      "PostDate": "04/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777563",
      "Title": "Weight Gain 3girls"
    }
  ]
}