{
  "AuthorID": "Kaliaja",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85113/profile",
  "Posts": [
    {
      "AuthorID": "Kaliaja",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85113/profile",
      "Content": "Kaliaja wrote: Hi – I’m new to this board and the ladies on the IDC board suggested I check with you guys.  I really need some expertise/experience.  My 74 year old mom’s been diagnosed with IDC. She’s in such a state of shock and denial that she’s not processing.  I have been trying to come up to speed but there is so just so much out there and, though I’ve spent dozens of hours researching,  I am feeling overwhelmed and horrified that I don’t know enough – may never know enough – to guide my mother to the right decision.   That’s why I’m here.   Long story short, bizarre as this sounds, after recovering from a fall in which she broke her hip and had a severely inflamed/bruised shoulder, when the inflammation went down over the course of several weeks, in its place was a huge mass that did not go away. Although my mother swears this thing was not there before the fall, it seems impossible to me that something that big could have formed in the course of less than 2 months. The mass was diagnosed as IDC and the tumor is “the size of an apple.”  T4.  Locally advanced with lymph node involvement in the right breast.  She is HER positive, ER positive, PR negative.  They are putting it at stage IIIC.   She only has one kidney and she has had bladder cancer in the past but it has been contained and treated.  However her PET/CT showed a mass of suspicious tissue in the renal pelvis which must be investigated before they will start her on treatment.   She has a ureteral stent which must be replaced so she’ll have that done next week and while they’re doing that they’ll examine the problematic area in the bladder.   Assuming everything’s okay with the bladder (or can be made so), the medical oncologist is pushing her hard for chemo to shrink the tumor.  He’s proposing Herceptin given concurrently with either Taxotere and Carboplatin or Adriamycin and Cytoxan.  Second option is Herceptin with a single chemo agent.  Third is to go with Herceptin and the hormonal therapy (some combination of Arimidex, Aromasin, and/or Femara).    The idea would be shrink the tumor, do a mastectomy and then radiation, chemo and the AI’s.  He’s really pushing for the chemo but my mom doesn’t want chemo and, while I might be able to persuade her, I’ve read in a couple of places that chemo is often too harsh for older women and that the AI’s work just as well.    I really feel out of my depth here – I’m so scared of leading someone I love so much down the wrong path -- so I’d be grateful for any advice you can offer.   Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/735869",
      "Title": "Could Use Some Advice for My Mom Kaliaja Brenda_R"
    },
    {
      "AuthorID": "Kaliaja",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85113/profile",
      "Content": "Jun 14, 2009 06:26PM Kaliaja wrote: Hi Brenda, Thank you so much for getting back to me.  The thing is they need to shrink the tumor because it's so big so it's chemo or the hormonal therapy before they can do surgery.  I really don't feel confident about chemo -- pro or con.  There seem to be two well established arguments out there -- one saying chemo's too harsh for people over 70 and the other camp saying that because of stereotypes about older people (relying on chronological rather than \"functional age\" -- whatever that is) that older people are being undertreated.  It seems that they don't have really good data on people 70+ (very seldom allowed into clinical trials, some thinking that they weren't good subjects because you couldn't get the long-term survival rates that many of these doctors/institutions are looking for b/c they tended to die of other things) and they're extrapolating results from younger women, which may or may not be valid.   Anyway, that's why I was interested in hearing of actual experiences and opinions.  Thanks again for weighing in.  And I wish you the best.... ",
      "MessageIndex": 4,
      "PostDate": "14/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/735869",
      "Title": "Could Use Some Advice for My Mom Kaliaja Brenda_R"
    },
    {
      "AuthorID": "Kaliaja",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85113/profile",
      "Content": "Jun 14, 2009 06:46PM Kaliaja wrote: Hi Diana, thank you.  While I know that they want to do chemo to shrink the tumor, you're right -- I need to know exactly how they will know whether she can tolerate it.  I understand that -- in order to be effective -- there is a threshold minimum of the chemo agents that must be administered (plus she only has one kidney which affects how much she can tolerate), I will need to get more detail on what they're proposing.  And, yes, as far as my mom's anti-chemo attitude, I have to respect what she ultimately decides but I want to make sure she has all the facts rather than just reacting to what she's heard.  The suggestion about the support group is a great one.  Thanks again and God bless...",
      "MessageIndex": 5,
      "PostDate": "14/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/735869",
      "Title": "Could Use Some Advice for My Mom Kaliaja Brenda_R"
    },
    {
      "AuthorID": "Kaliaja",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85113/profile",
      "Content": "Jun 15, 2009 07:47PM Kaliaja wrote: Anne -- After reading your post, I looked again at my mom's pathology report and it say ER: >90% which I'm assuming means that it will theoretically respond well to HT as yours did but maybe it is the size (\"the size of an apple\") which is the reason they are encouraging chemo.  Either way  -- it's certainly worth asking about.  And I have ordered the book from Amazon -- for both me and my mom.  Thank you so much and I hope all goes well for you from here from here on out....",
      "MessageIndex": 11,
      "PostDate": "15/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/735869",
      "Title": "Could Use Some Advice for My Mom Kaliaja Brenda_R"
    },
    {
      "AuthorID": "Kaliaja",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85113/profile",
      "Content": "Jun 16, 2009 07:33PM Kaliaja wrote: Anne and Brenda,  Thank you both very much.  They are starting my mom on Herceptin alone tomorrow.  Friday, she goes in for the bladder procedure and if there's a problem there, her treatment options will narrow (ie they will need agents that are effective with treating bladder cancer as well).   I've been on the Herceptin board and -- my mother being the type of person who splits aspirin in half because it affects her too much -- this is going to be a nightmare....  :-)  Anne -- If we don't need to worry about the bladder, I am definitely going to inquire about the hormonal given the estrogen status.... Brenda -- I am really hoping my notes are wrong and that he only indicated Herceptin with the Taxotere and Carboplatin (not the AC regime).  Otherwise I'm going to have a real crisis of faith....Thank you for the warning.... Again, thank you to everyone for the support and encouragement and I dearly hope that you are repaid in kind somewhere along the way.... ",
      "MessageIndex": 15,
      "PostDate": "16/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/735869",
      "Title": "Could Use Some Advice for My Mom Kaliaja Brenda_R"
    },
    {
      "AuthorID": "Kaliaja",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85113/profile",
      "Content": "Jun 15, 2009 08:12PM Kaliaja wrote: Ellen and Robyn -- thanks for the info on the TCH regime -- I will definitely check it out as it was never mentioned by the oncologist.  There is just way too much stuff to read through and too little time -- it really helps to have specifics to ask about.  Thanks again and I will keep you both (and your mom, Ellen) in my prayers.",
      "MessageIndex": 12,
      "PostDate": "15/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/735869",
      "Title": "Could Use Some Advice for My Mom Kaliaja Brenda_R"
    }
  ]
}