{
  "AuthorID": "Kalina",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201766/profile",
  "Posts": [
    {
      "AuthorID": "Kalina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201766/profile",
      "Content": "Jun 25, 2014 09:55PM Kalina wrote: Thanks for your input Nancy. I am very excited about getting the nasty little thing out of my chest. I'm glad we are already moving along on this road. I'm keeping my  fingers crossed that your node is clear. That would be fabulous. I'm so very tired today. Actually, I've been tired for quite some time. Little did I know..... One more thing. Did you need to get a special bra? Kalina",
      "MessageIndex": 12,
      "PostDate": "25/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/822210",
      "Title": "The Biggest Challenge is here now... waiting for the details. Kalina Nancy2581"
    },
    {
      "AuthorID": "Kalina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201766/profile",
      "Content": "Aug 27, 2014 04:20AM - edited Aug 27, 2014 04:21AM by Kalina Aloha Doona, I was diagnosed with IDC, Grade 3, on June 18th. The lumpectomy on July 1st confirmed the node involvement. I'm so sorry you've joined the club, however it's a great place to start. Since we have the same diagnosis, I can certainly appreciate what you're going through. All of us have our own way to respond to these life changing events. It personally took me 3 days to get outside of the sheer panic and terror and claw back to my life. Nancy2581 and I both connected with our MO to get the additional help we needed.  I also took them up on the offer for sleep aids. So, today was actually my 2nd chemotherapy treatment. It's certainly not something to get excited about - but it is doable. The thing I tend to focus on is day to day living. It's the fear of the unknown that keeps me uptight, so I try to stay as present as possible. I know your overwhelmed right now, but you'll start to feel better when you realize how much there is out there to kick this thing. Life became a great deal 'easier' when I had my treatment in place.  My understanding is that there are 14 MILLION cancer survivors. That's nothing to sneeze at. Rest assured Doona, you'll get through this, even though there times when it looks the most bleak.  Hugs from the Hawaiian Islands. PS: Cancer is a condition - it is NOT an outcome! Kalina",
      "MessageIndex": 12,
      "PostDate": "27/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/823969",
      "Title": "results are in Doona Hopeful82014"
    },
    {
      "AuthorID": "Kalina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201766/profile",
      "Content": "Jul 10, 2014 09:54PM Kalina wrote: Aloha Sisters,  I finally received my results today on my lumpectomy. 10 days was a very, very long time to wait.  Margins clear, however 1 out of 4 nodes tested positive.  Consult with Oncologist scheduled for July 23rd. Trying to move to an earlier appointment for next week.  However, now another battery of tests await.  I am presently being staged at T2N1, still missing the \"M\", but am still classified as early breast cancer, and for that I'm really grateful.  I can only send out my sincerest hope and wishes to everyone to getting through the beginning of the battle, which certainly appears to be the most trying.  After talking to some friends, I'm realizing that treatment is like the composition of a great symphony. You have to have the most talented artists (our health community) who are skilled at understanding the depth of the music (the cancer), the nuances of the notes (the treatments), and that in turn will aid in the production of your own personal 'healing' concerto. I hope I find mine soon.  Kalina",
      "MessageIndex": 16,
      "PostDate": "10/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/822210",
      "Title": "The Biggest Challenge is here now... waiting for the details. Kalina Nancy2581"
    },
    {
      "AuthorID": "Kalina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201766/profile",
      "Content": "Kalina wrote: Aloha newest friends,  I am 59 years old and it was the 7th of June that I discovered the lump, the 13th that I had the mammogram and UT, and the 18th that I received the dx of IDC.  My lump presently measures 2.8 cm and a lumpectomy is scheduled for July 1. I have already learned such an amazing amount based on my own sleuthing (and, of course reading this board has been monumental in my understanding).  So thank you all for the sharing and the outpouring from your hearts for what can only be described as one of the, if not the most terrifying journey any individual can take.  I'm still waiting on the slides to check the receptors, etc., however I am taking it one step at a time, even though my mind continues to speed into the danger zone. I put on the brakes knowing that the feelings - which are absolutely required and necessary - are not the facts. It's because of this board that I took the initiative to inform my surgeon of feelings of dread and in turn requested a sleep aid, which was immediately prescribed. My last mammogram was 7/23/13 and was totally clean.  I was happy that I had had the mammograms I've had because it was able to provide a good basis of comparison.  What's ironic is that my Dad, who lives with us, had colon cancer almost 20 years ago, and is now 101.  I've been very busy with my head up my a#% (colonoscopys, etc.) as opposed to my breasts. It's forced me to change my priorities very quickly. The thing most challenging is keeping my mind calm and happily busy. We have no answers presently. We are grateful that there was presently no abnormal findings regarding my nodes, however the sentinel will be biopsied on the 1st. I will keep open that the finding will show no involvement. Oh, the 'we' is my wonderful husband. It was merely 1 year and a few weeks ago that he had a major heart attack and a triple bypass. We made it through that and we have plans for making it through this. I'm looking forward to what everyone has to say.  Thank you all again. Kalina Dx 6/18/2014, IDC, 2cm, Stage IIB, Grade 3, 1/4 nodes, ER+/PR+ Surgery 7/1/2014 Lumpectomy: Right; Lymph node removal: Right, Sentinel Chemotherapy 8/13/2014 AC Targeted Therapy 10/7/2014 Herceptin (trastuzumab) Chemotherapy 10/7/2014 Taxol (paclitaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/822210",
      "Title": "The Biggest Challenge is here now... waiting for the details. Kalina Nancy2581"
    },
    {
      "AuthorID": "Kalina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201766/profile",
      "Content": "Jun 23, 2014 01:30AM Kalina wrote: Hi Diane, Ariom and Nancy,  Thank you so very much for your responses.  Cheers to all of us for keeping some semblance of order in this chaos. I am already meeting people that are survivors. It is definitely not a club I planned to join, however in the women I've already met face to face - well there is an immediate understanding and kinship that escapes words. I happen to have met a lovely woman yesterday, who just 'happened' to be wearing a pink rhinestone ribbon on a chain. Before I could stop myself I blurted out that I had been diagnosed on Wednesday. She also was an IDC girl. The point being is there was an instant understanding and recognition that took place. I feel that this is one of the things that is giving me hope. That others are definitely surviving. That no matter what news comes, that there's hope. Meanwhile I'm putting together my 'healing' team and found a wonderful massage person that is willing to come on board. I also have \"Healing Touch\" practitioner's available, which I'm going to be using as well. Am I terrified?  You bet.  But it is true, each bit of information takes me closer to my treatment plan, which is much easier than dealing with the unknown. And Nancy, I am hanging so tight with you, I dare say I've lost circulation in my hand.  I am with you!  Kalina",
      "MessageIndex": 4,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/822210",
      "Title": "The Biggest Challenge is here now... waiting for the details. Kalina Nancy2581"
    },
    {
      "AuthorID": "Kalina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201766/profile",
      "Content": "Jun 25, 2014 02:56PM Kalina wrote: Hello all,  Just learned yesterday that I am ER+/PR+ which I consider to be good news.  My lumpectomy is 6 days away. I'm anxious about the sentinel node biopsy, but in all honesty, who wouldn't be?  This is such a journey, but we are getting closer to the whole picture. Thanks to all of you for your participation on these boards. It really has helped in my understanding. Kalina",
      "MessageIndex": 10,
      "PostDate": "25/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/822210",
      "Title": "The Biggest Challenge is here now... waiting for the details. Kalina Nancy2581"
    }
  ]
}