{
  "AuthorID": "Kamboka",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287384/profile",
  "Posts": [
    {
      "AuthorID": "Kamboka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287384/profile",
      "Content": "Mar 24, 2019 05:03AM Kamboka wrote: Mcnteach, Good luck. I will be anxious to see how it goes. I'll do the Taxol in May and the thoughts of more cortisone is worrying. I only get 'the day of' dose now with the AC. ",
      "MessageIndex": 235,
      "PostDate": "24/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Kamboka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287384/profile",
      "Content": "Apr 6, 2019 12:23PM Kamboka wrote: Has anyone had any problems with low blood pressure? I've had over 24 hours of BP ranging from 80s/50s to 90s/60s. I normally have high blood pressure that ranges near 140/86 so this is low. I am very fatigued and weak but still able to drink plenty of fluids. I didn't take my BP medicine this morning but it hasn't risen much. I had R2 for AC on Wednesday. I don't know if this is normal or I'm got too much of the pre-meds or it's the Fulphila shot reaction. I had a little nausea last night but didn't want to take the nausea meds as they could also lower blood pressure. I'm sure this will pass but it's taking so long. Chemo sucks! ",
      "MessageIndex": 346,
      "PostDate": "06/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Kamboka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287384/profile",
      "Content": "Mar 23, 2019 11:42AM Kamboka wrote: Hi to all, I've been reading this forum for a few days so decided to join. This is my first time posting. Just started AC-T on 3/15. This round, I was pleasantly surprised that I didn't have nausea. The worst day was day #3. I mainly had overwhelming fatigue and headache. I'm delayed for the second round by a few days as my Fulphila shot was not quickly approved by insurance. Since I got it late, I will be doing the 2nd round later. I'll be self-administering from now on. I took the Claritin before and after and it worked! I'm doing neoadjuvant chemo and am hoping that my tumor can shrink and I can do the lumpectomy in a few months. Due to lymph involvement, I'll also be doing radiation after surgery. I look forward to following everyone's journey and wishing you all the best. ",
      "MessageIndex": 227,
      "PostDate": "23/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Kamboka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287384/profile",
      "Content": "Mar 24, 2019 02:40PM Kamboka wrote: Kvz, In my week after first round, I've had some mouth tenderness that comes and goes. I started doing the baking soda washes a couple times a day. Some folks add salt but I just use the baking soda only. I also have Biotene that I use at least twice a day. I'm trying to be proactive to eliminate or reduce the mouth sores. I also would reiterate not eating spicy, salty and really hot foods. I learned the hard way!",
      "MessageIndex": 241,
      "PostDate": "24/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Kamboka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287384/profile",
      "Content": "Apr 21, 2019 04:00PM Kamboka wrote: Adhoney: Originally, I was planning on Taxol but have neuropathy already. I thought Taxotere might have fewer side effects. How has it been for you? Do you ice your hands and feet? Doing Taxotere will add more time to this already long chemo months but if there are less side effects, I'll do it. I'm also noticing that water is tasting bland and I'm not rushing to drink. I still seem to get my 6-8 glasses in but it's nauseating to get it down. I've also found that some carbonation helps. I have been mixing my water with juice with Fresca with lemon/lime juice and crystal light. That is helping to get some fluids that's not just water. Happy Easter to everyone.  ",
      "MessageIndex": 385,
      "PostDate": "21/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Kamboka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287384/profile",
      "Content": "May 20, 2019 08:23PM Kamboka wrote: MoutainMia, I hope this article can help those starting the taxanes. I had my first Taxotere infusion on Wednesday. I did the icing of the hands and feet 15 minutes before and 15 minutes after the hour long infusion. On Thursday, I promptly got a really bad neuropathy side effect. My hands and feet had red blotches and the joints were swollen. The pain was unbearable. It felt like 2nd degree burns over my palms. I have been icing since then. My feet cause me to lose balance as it hurts to walk. I also had the muscle and bone pains from the drug. I had to go to the ER on Saturday. They gave me a steroid and gabapentin. I still had the same side effects this morning but the swelling of the hands is better. I still can hardly bend my joints. I told the doctor that I will not do any more taxanes. (I had neuropathy before chemo of unknown etiology). I will take my chances and go to surgery now. I wish everyone else heading to Taxol or Taxotere the very best.",
      "MessageIndex": 431,
      "PostDate": "20/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Kamboka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287384/profile",
      "Content": "Mar 28, 2019 03:52PM Kamboka wrote: I have not started either the Vit C or the Mistletoe. I wanted to talk to my Oncologist first. I'm leaning more towards the Mistletoe. The Vit C is IV and high dose. I wish I had known about it as I would have taken it for the two and a half months that I had to wait before starting chemo. The center is so backed up with appointments that they said it would be next month before I could see the ND. In the meantime, I am talking to another center who has a practitioner who does both Reiki and lymphatic drainage. I'll need that after surgery in a few months.",
      "MessageIndex": 294,
      "PostDate": "28/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Kamboka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287384/profile",
      "Content": "Apr 18, 2019 07:03PM Kamboka wrote: In regards to taste buds. I had to get rid of two boxes of nutrigrain bars recently. I only ate two but both times during my infusions. For some strange reason, the thoughts of eating them made me nauseous. Even looking at the boxes made me nauseous. I ended up taking them to work for colleagues. The same problem with ginger candy. I needed something for dry mouth and tried to suck on the ginger but got nauseous. I ended up giving those away too. I find myself craving spicy foods--which I know I do not need. So far, I'm able to get the 8 glasses of water down. There is a slight change of taste between my filtered water and the tap. Sometimes I just mix them to make it better. I have had some nephropathy before I even stared the AC. Talked to doctor about switching from Taxol to Taxotere. Has anyone been on that or know anyone who has? I have 10 days to decide.   ",
      "MessageIndex": 371,
      "PostDate": "18/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Kamboka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287384/profile",
      "Content": "May 1, 2019 08:10PM Kamboka wrote: I finished my last dose of AC today. Yeh! The 3rd round was very hard with cumulative fatigue from anemia, BP problems and mouth sores. The doc is bringing me back in five days to get some fluids since my intake has been lowered iwth the mouth pain. I start Taxotere in two weeks and am actually more scared of it than AC. I already have some neuropathy before treatment and do not want long-term neuropathy. I plan to ice during treatmetn but might have to make the tough decision to discontinue if it gets worse.",
      "MessageIndex": 395,
      "PostDate": "01/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Kamboka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287384/profile",
      "Content": "Mar 27, 2019 09:32PM Kamboka wrote: So sorry to hear of some of the challenges that many of you have had this week. I've found that I don't look at this day by day but hour by hour. The next hour could be better! I had an appointment today at the hospital's Integrative Health Center. I want to get some acupuncture and Reiki. The doctor mentioned IV Vit C or Mistletoe as a complement to chemo. Has anyone heard of this or tried it? The mistletoe is supposed to help with SEs. My first round was not too bad and I'm scheduled for the second round in a week. So, not sure if I even need this therapy.",
      "MessageIndex": 289,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Kamboka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287384/profile",
      "Content": "Mar 29, 2019 02:25PM Kamboka wrote: Santabarbarian--You are correct that to get the doses need to possibly help would be in high doses through an IV. I had the consult at George Washington Integrative Center. After reading about both Vit C and Mistletoe, I was most intrigued by the latter. However, before starting anything like that I wanted to talk to my oncologist and the Center naturopathic doctor first. The Center's doctor is booked until sometimes next month. In the meantime, I found another place to get Reiki. I start Monday. Baldbeauty242--Sorry to hear about how sick you have been with your first round. It seems like each round is different so surely you'll breeze through the next one. Fallschurchgirl--I'm in a unique situation in which I have alopecia totalis (scalp hair loss) for many years. I'm curious to see how this will affect my scalp or the little small outgrowths that never get long. I'm 14 post R1 and noticed pubic hair loss. I would say just continue to moisturize the scalp. Not sure if he hydrocortisone would help but I guess you could try. I know how stressful hair loss can be but I've had plenty of time to get used to it--if one can ever get used to it. I'm more worried about losing my nails. I'm giving them super attention to try to save them. ",
      "MessageIndex": 303,
      "PostDate": "29/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Kamboka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287384/profile",
      "Content": "Apr 8, 2019 01:42PM Kamboka wrote: SparkleGirl2018 --so glad to hear that your second round is going better than the first. It was the opposite for me. I think I have a plan for the next round for the BP but, of course, there could be something else that pops up. Now that my BP has stabilized I can take other medications and maybe get some sleep.  Margun -- sorry you are still feeling bad. I have the opposite reaction with my appetite. Seems like nothing can stop my wanting to eat. Since this is your second week, you might be getting anemic. Try to eat foods rich in iron--meats and green leafy. That might help. Not sure your arrangement with your doctor but they might check your blood to see and then they can give supplements, if that is the problem.",
      "MessageIndex": 350,
      "PostDate": "08/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    }
  ]
}