{
  "AuthorID": "kar41287",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78461/profile",
  "Posts": [
    {
      "AuthorID": "kar41287",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78461/profile",
      "Content": "kar41287 wrote: I went in yesterday to have a sonogram on my left breast and mammogram on both. The sonogram seemed to have taken forever and the technician wouldn't tell me anything. She sent the images to my personal doctor and he told her to cancel the mammograms.  What could this mean?  My doctor's office hasn't contacted me yet (I do understand it has only been 1 day).  I don't know if it is good or bad news having my mammogram canceled, since I have never had one before.  I will be turning 22 soon and have a family history of breast cancer, plus other forms. Krista Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/729324",
      "Title": "Sonogram kar41287 Beesie"
    },
    {
      "AuthorID": "kar41287",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78461/profile",
      "Content": "kar41287 wrote: I will turn 22 in April.  I have been giving myself self-exams since I was about 15,once to twice a month.  This past Friday I was bathing with an oily body scrub, this is when I felt a small lump in the side of my left breast, close to my skin. I know that this lump was not here during my last self-exam or even around Christmas when I first used my body scrub. It has slightly increased in size over the past three days.  My breasts are not naturally lumpy, so I can easily locate this mass.  I read that lumps closer to the skin are more likely to be cancerous, and that this usually means they have been growing for years, and can make the patient more at risk. Both of my grandmothers have had cancer, breast and skin. Both of my grandfathers have had cancer, prostate and testicular. My aunt had cervical cancer when she was 25 and had a hysterectomy. My mother has cysts on her breasts and ovaries and has to be tested regularly. Other symptoms I have been having are exhaustion, for about 1 year, despite eating healthy, and getting 7-8 hours of sleep.  I also use to grow my hair very fast, but it has hardly grown at all in the last year. It has also began falling out, showing it to be unhealthy.  I try to eat very healthy food and have tried various shampoos to improve its condition. My mother also wanted to ask if this could affect my skin? I have never had acne until recently, and now I can't seem to get rid of it.  I did schedule an appointment for February 6th.  I am not sure what types of questions to ask, or what types of tests I should insist on.  I read that sonogram and ultrasound's are more effective of determining cancerous masses, compared to mammograms.  However, I also read that it is difficult to get an accurate diagnosis with women my age due to tense breast tissue.  I'm not sure what type of  test to look for.  Also,I am going to the only doctor I have ever had.  He was specializing as an OBGYN before switching to family practice.  He has already saved my mother's life when I was born, and my life twice, at my birth (3 moths early) and by spotting my heart defect, when the specialists I was going to didn't.  Should I get a second opinion, since he isn't a specialist? Can anyone give me any suggestions about how to stay calm during my appointment?  I have never had a breast exam. It will be weird for someone besides me touching my breasts. I guess any advice or knowledge is welcome.  I love biology and science, and look at life in those terms, typically (I'm a teacher), so don't be afraid of scaring or offending me.  I'm trying to keep positive and I'm praying. Krista Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/728032",
      "Title": "Almost 22 with a marble sized lump. kar41287 Emily2008"
    }
  ]
}