{
  "AuthorID": "karensimone…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133396/profile",
  "Posts": [
    {
      "AuthorID": "karensimone…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133396/profile",
      "Content": "Oct 23, 2012 07:58PM karensimone wrote: Had a double mastectomy On Oct 11. Spent 2 night in hospital . I had the drains for 11 days. SO SO happy to get those out. It only hurt a little but I did not care I just wanted them out. Today is day after drain removal, had to drive 1 1/2 hours there and then back. I  am so tired and sore today. Another thing I did which was stupid is the past 2 days I did not take any of the pain meds. Not a very smart idea but my stomach was getting upset despite drinking tons of water and taking stool softeners, so now i am trying to stay ahead of pain. I will wait a few more days and try again. I still am having issues looking in mirror, I am doing delayed reconstruction. Does any one else have trouble looking?",
      "MessageIndex": 288,
      "PostDate": "23/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "karensimone…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133396/profile",
      "Content": "Oct 25, 2012 07:04PM karensimone wrote: My reconstruction is probably going to be in June, I work in a school and since I am out about 4 to 6 weeks with this surgery I want to do when school is not in session",
      "MessageIndex": 331,
      "PostDate": "25/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "karensimone…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133396/profile",
      "Content": "Oct 29, 2011 09:15PM karensimone wrote: Hi. I started my first chemo on 10/20. Went to work the next day (Friday) felt fine laid low Sat and Sun and felt ok and went back to work on Monday. Tired like I have never known. Have had a minor headache off and on. I also had Neulesta shot the day after chemo and yesterday I was getting spasms in my back and legs. Has that happened to anyone. They are manageable with tylenol. Also noticed today one side of my head is tender. This must be the beginning of the hair loss. I asked my 16 year old if he wanted to have some fun and buzz my hair. He came to my first chemo. He really wanted to see what it entailed . My oldest is away at school in Florida. I am tying to keep life as normal as possible but today which is 9 days after treatment was kind of weepy. Anyway thanks to everyone who writes here , so helpful and love having a place to learn, vent , advise",
      "MessageIndex": 502,
      "PostDate": "29/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "karensimone",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133396/profile",
      "Content": "karensimone wrote: Hi Ladies: I had a double mastectomy on Oct 11, 2012. I am fine with my decision to remove the healthy breast. In July 11 I had lumpectomy (2) No lymph involvement, followed by 4 chemo treatments then 30 days radiation. I finished all in March and went for my mammogram in July and she found what she described as stage 0 insitu. So once again am home recovering anxious to get the 4 drains out. I do not even like looking at myself. I know a lot of it is black and blue, stitches , drains. Extra skin is left so I can have reconstruction at a later date. She wants me to lose weight ( Need to any way) so she can use belly fat and I would get a tummy tuck in process. That makes motivated to lose the weight. My question is I know there are a lot of products out there in bras Cami's etc, but just curious how you make yourself feel pretty. I know some women whether breast cancer or not have such a flair for accessorizing . I am not one of them. When i go back to work I work in an elementary public school  with special needs children. I don't have to be very dressy but have to look professional. Also waiting for results so that is weighing on me. Love this website and all of you Dx 7/23/2011, IDC, 2cm, Stage I, Grade 2 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/795034",
      "Title": "just had mastectomy feeling sorry for myself karensimone Beth1951"
    },
    {
      "AuthorID": "karensimone…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133396/profile",
      "Content": "Aug 30, 2011 10:07PM karensimone wrote: My NAme is Karen and I Have stage1, had lumpectomy on 8/25 along with a node removal. Waiting for results but thanks to Hurricane Irene they are unable to be in the Dr's. offiice. I believe i am going to have radiation but may need chemo, not sure what the test need to show for chemo. Is it if the node is not clean and something about margins?",
      "MessageIndex": 9389,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "karensimone…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133396/profile",
      "Content": "Sep 2, 2011 06:30PM karensimone wrote: Hi: Its karensimonne again. I finally got my results. Luckily my lymph nodes are clean but I need another surgery. She said the recovery will be less because they do not do lymph nodes and use same incision in breast. I was wondering if anyone could let me know how it went for them. Did you have to have chemo? How was the recovery Thank you, Karen ",
      "MessageIndex": 9407,
      "PostDate": "02/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "karensimone…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133396/profile",
      "Content": "Sep 1, 2011 11:12PM karensimone wrote: Hi: This is Karen Simone, Thank you for the responses. This is a great site. I have learnt a lot. Still no results. I called today as it is one week. The nurse said it can be from 7-10 days. Trying to be patient . My next question is what are boosts. Is it part of radiation and what side effects are there? Thank you everyone",
      "MessageIndex": 9400,
      "PostDate": "01/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "karensimone…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133396/profile",
      "Content": "Sep 3, 2011 12:31AM karensimone wrote: Thank You everyone. This sight is amazing. I also hope every one has a good long weekend",
      "MessageIndex": 9417,
      "PostDate": "03/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "karensimone…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133396/profile",
      "Content": "Oct 16, 2011 08:33AM karensimone wrote: I had to share, My sons football team has not won a game in over 2 years, yet these kids practice 6 days a week and play their hearts out. A few weeks ago my son asked if they could participate in coaches against cancer. The Athletic Director ordered pink socks and arm bands and my son told me he really wanted to win to honor me. well they did it. 48-13. The kids were so excited, dumping water on coach, running the field. It was like they won the Super Bowl.  I will be starting chemo on Thursday so this lifted everyones spirits. I love you Matt and you are so supportive of me..Thank You",
      "MessageIndex": 9841,
      "PostDate": "16/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "karensimone…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133396/profile",
      "Content": "Feb 4, 2012 09:17PM karensimone wrote: I have had 14 radiation treatments. I started getting red on week 2 which was early. Under my radiated breast has gotten so red and painful and peeling that they are doing my boost now to hopefully help me heal and then I will continue the full breast radiation. I am very tired but still working. I had chemo before this , I have to say radiation has not ben good.  At least with chemo I did have days in between that I felt good. Now I just feel very tired, sore ",
      "MessageIndex": 461,
      "PostDate": "04/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    }
  ]
}