{
  "AuthorID": "karen333",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
  "Posts": [
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "May 24, 2011 06:44PM karen333 wrote: Traxy, you should be getting your mammogram now and it will reveal the problem or the results could suggest an MRI, This is the worst moment just waiting for results, just keep putting one foot in front of the other and you will make it through.  We will all be waiting on the news so can congratulate or supprt you, so let us know how things progress.  Sending prayers and gentle hugs your way.  Karen",
      "MessageIndex": 7,
      "PostDate": "24/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/769363",
      "Title": "what i thought was a ruptured implant may be bc instead trayxdogg karen333"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jul 26, 2010 06:34PM karen333 wrote: Dear sohard,  I remember being told that the biopsy was positive for cancer and those were the only one's I heard.  I am coming up on my year anniversary now and frequently don't even think of the cancer.  I am now because I am coming up on my one year mammo, US and Mri.  I read on one post some great advice, Don't think about next month, next week, all you have to do is show up for today's treatment. You've come on a great site for info, advice, emotional support, and extremely knowlegabel women.  I still use it almost every day, and stay in contact via email and phone calla with one women I met here.  You are not alone, we are all here for you  Karen",
      "MessageIndex": 20,
      "PostDate": "26/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/755573",
      "Title": "I have cancer...It is sinking in...uuuggghhh... Ondagrow Ondagrow"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Apr 23, 2011 03:50PM karen333 wrote: Dear yellow lady, I lost my godmother 2 mos. ago and miss her desperately.  She was my best friend, I still cry and I'll keep crying till I'm all  cried out.  I wish I had a recording, a voice mail ao I could hear her again.  There just seems to be a part of my heart is gone with her passing.  Telling happy stories or memories of special time with her will help, and I'm glad you came here to tell the story.  When it had just happened, the women on Two sites helped hold me and sent prayers, hugs, and listened to me, really remarkable women who will step in to help, to listen to my stories, I still PM to 2 friends especially and hear back in minutes.  I cry for you, help us know your stepsis, tell us your special relationship.  Feel free to PM me.  (((((((HUGS)))))))  Karen",
      "MessageIndex": 21,
      "PostDate": "23/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/767970",
      "Title": "So Freaking Sad yellowdoglady karen333"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Oct 24, 2010 04:56PM - edited Oct 24, 2010 05:22PM by karen333 You're getting the opinion of some of the most  knowledgeable women on the boards.  I am over a year out and it's not part of my thoughts 24/7 anymore.  I still got scananxiety fears at the one year mammo and ultra sound tests.  I also have a diagnosis similar to your's.  If your thoughts are escalating,  don't forget support groups, these boards,  friends you can be real with, counseling and anti-anxiety meds.  I was free and clear on both tests, and am building the new me.  ",
      "MessageIndex": 6,
      "PostDate": "24/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/759805",
      "Title": "Shameless Request for Support LisaMomOfFour gentianviolet"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Oct 6, 2010 04:22PM karen333 wrote: You can also call your local American Cancer Society and explain your situation.  They can help with finding funding or free mammogram clinics.  I would not wait til Dec., when it is possible to access funding now.",
      "MessageIndex": 7,
      "PostDate": "06/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/758995",
      "Title": "Not sure what to think or do... rollergirl78 Beesie"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "May 14, 2012 04:48PM karen333 wrote: Nervous Nellie, you are reacting very normally, as others have said stay off the Internet - I did that for a few days and it made everything worse, I was convinced I had everything I read about.  Keep coming here for support and encouragement, and use this time to do distracting things that will engage your mind, I watched every funny movie I could think of, I did some gardening, did my yoga and relaxation tapes and listened to my favorite music at an unbelievably loud volume, so I could get lost in the music.  When I was driving I also blasted the music and sang along, I'm sure I looked like a loon.  And sounded worse, I also exercised, you wouldn't think so but that helped the most, got the endorphins moving.  Take care and keep us informed, Karen",
      "MessageIndex": 6,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787462",
      "Title": "Newbie here..Worrying about this lump... Nervous_Nelly Sommer43"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jul 3, 2011 03:09AM karen333 wrote: My daughter came with me as she drove, I developed an infected seroma a year and a half after the lumpectomy.  It was aspirated 3x and was just such a huge relief immediately, it was done by needle and I had a shot of lidocane first each time.  Way less painful than a shot of novacane at the DDS.",
      "MessageIndex": 11,
      "PostDate": "03/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/771027",
      "Title": "Seroma theatercat mccrimmon324"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Nov 22, 2010 02:36AM karen333 wrote: I was afraid that was the answer, I have an appt. with my BS tomorrow.  I will  ask him about the possibility that it is lymphadema. I already found a PT that does MLD.  She is about an hour away from my home. Is it a series of visits or does she teach you how to do it?  Thanks Norma June.   Karen",
      "MessageIndex": 8,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/761020",
      "Title": "truncal lymphedema? whatRstatsanyway BetsyBuzz"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Aug 17, 2011 02:13PM karen333 wrote: Just got the all clear from 2nd annual mammograms and ultrasounds.  Don't think of BC every day but always anxious just before scans and tests.  My nieghbor is 10 yrs. out and still does;t sleep the night before a mammo, so the anxiety is apparently always there.  The sense of relief after getting clear results is still so amazing!",
      "MessageIndex": 207,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758694",
      "Title": "How many years have you been a Survivor? IllinoisNancy Lou789"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Apr 14, 2011 05:03AM karen333 wrote: My irradiated breast did go down an appreciable amount, became firmer, it has still a change in color and a thickening of the skin.  My radiation was finished in Oct. 20,2010.  I am now considering a lift and reduction in size of my R side, need to check if insurance will cover.",
      "MessageIndex": 5,
      "PostDate": "14/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767298",
      "Title": "Breast Change After RADS DebRox firstclasszip"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jun 19, 2012 05:51PM karen333 wrote: The greyhound rescue league has some beautiful dogs who have finished their racing days.  Contrary to what you would think they are a very mellow breed, like to just lay around near you and are seldom barkers.  If I had a fenced in yard I would get one in a minute!!",
      "MessageIndex": 23,
      "PostDate": "19/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/789258",
      "Title": "Help with getting a new pet crystalphm cowgal"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Oct 1, 2010 05:48PM karen333 wrote: I am a 1 yr. 1 mo. survivor, my cousin is at 7 yrs., my godmother is a 26 yr. survivor.  She is 87 yrs. old and is still going strong, she still looks nifty in her polo shirt and jeans.",
      "MessageIndex": 25,
      "PostDate": "01/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758694",
      "Title": "How many years have you been a Survivor? IllinoisNancy Lou789"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 2, 2011 03:21PM karen333 wrote: I too think you should try to find a Breast Surgeon.  My doctor only does breast surgery and I had a Lumpectomy and SNB.  Came out of it with no lymph involvement and clean margins.  I could have had the surgery in the city I lived in with just a surgeon, but choose to travel instead.  As my gyn. said, \"if it were my wife, I'd go the Breast Care Center and ask them for their recommendation\". Everyone on my team was current, caring, knowledgeable and professional.  My BS even gives out his cell phone number and encourages you to call if a problem comes up.  Karen",
      "MessageIndex": 74,
      "PostDate": "02/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762500",
      "Title": "Just Diagnosed :( loving_mother nwest125"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 29, 2010 09:23PM karen333 wrote: loving_mother, You are limited to 5 posts per day until you reach, i think it is 25 or 50 posts. But you can PM as many people as you like each day if you have questions or worries.  Just click on the person\"s picture or Name [if there is no pic], and it will direct you in sending a message.  I had a lumpectomy a year and a half ago, and there is no obvious difference in size, the breast with the cancer is a little \"perkier\".  I also had 7 weeks of rads and am now on Arimidex for 5 years,  I have a few side effects from the med., but it is very doable.  Be sure you have picked a BS who you can place your trust in, one that listens to ypur questions and answers them fully.  I was very lucky when the Breast Care Center I go to suggested my surgeon.  He even has his cell phone # on his card and I did use it once when I got an infection, it was early evening and it was such a relief to hear him answer.  Feel free to PM me if you need to  Karen",
      "MessageIndex": 46,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762500",
      "Title": "Just Diagnosed :( loving_mother nwest125"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Apr 14, 2012 05:27PM - edited Apr 14, 2012 05:29PM by karen333 NoMoreHL, there is also a site called Great Saying About Depression, and their premise is depression is not a weakness, it's a sign that you have had to be strong for so long.  And you did have to be strong going through all the active treatment, the depression and anxiety seem to settle in at the one year mark when you are beginning to process ALL that has gone on.  Add to that all the Dr. appointments coming up and it is a cruel awakening of bc.  I was Dx in August of 2009, I still get nervous on those cancerverary dates, it brings everything to the forefront again with all the tests and appointments, that is the case for many of us.  BC.org was a genuine lifesaver for me, I found a group of women in my geographical area who communicate on the thread each day and meet for luncheon once a month, it is like being enveloped in love and understanding.  I also see a therapist, as do all but one member of our group of 8 and am taking an antidepressant.  The world is bright again and I have my joy back, not to say I don't have down days, getting outside in the sunlight is imperative.  Even if it is a trip to the store to get a few things or sitting on your porch.  Also if you come by someone you really feel is living your life as it is now, reach out and PM them, it just may result in a beautiful friendship developing.  It does require a little bit of faith to reach out like that but out of 3 reaches I have found 2 fast and true cyber friends, who I \"talk\" to almost every day.  So glad you seem to have turned a corner and that you found a Dr. who prescribed an antidepressant, it is just the edge you needed.  Take care, Karen  PS,. we have a luncheon today, it feels great to meet all my girlfriends.",
      "MessageIndex": 13,
      "PostDate": "14/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/785521",
      "Title": "Running out of places to turn to for help NoMoreHL karen333"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Nov 22, 2010 01:19AM karen333 wrote: can lymphedema present a year and a half after lumpectomy and rads?  My left breast is tender and swollen, I am being treated for infected seroma with antibiotics.  I have been on them for a week and there is a little improvement.  That breast has been asperated twice and that brought relief instantly.  Karen",
      "MessageIndex": 6,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/761020",
      "Title": "truncal lymphedema? whatRstatsanyway BetsyBuzz"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jul 1, 2010 03:22PM karen333 wrote: I had 1 palpable mass on my left breast and then on the MRI they found 1 little tumor, they were close and the lumpectomy is not that great a scar, though the BS called it a partial mastectomy and that freaked me out.  Waiting is the absolute worst part truthfully.  I had 8 weeks of radiation and now am on Arimidex, had my 6 mo. all clear mammogram.  I'll be holding you in my thoughts.  Karen",
      "MessageIndex": 10,
      "PostDate": "01/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754821",
      "Title": "Afraid for the phone to ring...and I'm ready to lose it... ToriGirl CoolBreeze"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "May 17, 2012 10:39PM karen333 wrote: Sparky, so sorry to hear the news, sending calming thoughts from your old home town, Batavia.  You should be getting the beginnings of a plan in place, that will give you a kind of peace to know what comes next.  I know that through the stress of appts., tests and scans, one woman's post stayed in my head, \"all you have to do is show up\", and that's all you need to do.  Start building your circle of support, your family, friends and of course bc.org sisters, we will always be here.  You may want to stop in to the Invasive Ductal Carcinoma group as they will be familiar with what you are facing, they will wecome you with open arms.  Karen",
      "MessageIndex": 26,
      "PostDate": "17/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/787471",
      "Title": "Biopsy today, thank u everyone Sparkysbrat Sparkysbrat"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Oct 15, 2012 03:48PM karen333 wrote: My skin changed drastically, now super oily, to the point I have to use facial cleanser during the day, as well as the morning shower and just before bed.  Also developed a strange sort of acne, no white matter involved, painful and has a enlarged pore in the center.  I now am using Clearasil again, had not used that since my teens.  Have tried other products with no visible effect.  Puberty again??",
      "MessageIndex": 6,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/794965",
      "Title": "Did your body chemistry change after surgery? Andrea623 aussie12"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 20, 2010 04:45PM - edited Dec 20, 2010 04:45PM by karen333 Cathi, sounds like a relaxing time for you and Ed.  I thought about how the kids were doing this weekend, remarkable how BC.Org. can form new relationships albeit cyber ones.  My grandchidren, ages 12 and 13 can barely contain themselves waiting for Christmas.  This is the first year of no letters to Santa.  I think Mica knew it last year and Addison was just doing it \"in case\"..  And we were so careful to wrap Santa's gifts in different wrapping paper and have a friend do the tags  My grandkids like yours are our gifts year round.  Take care, Karen.",
      "MessageIndex": 15587,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 22, 2010 06:21PM karen333 wrote: Cathi, aren't those handmade gifts a heart tugger,  I have a handprint from my grandson and a clay bowl from my grandaughter that I treasure.  Have a Merry Christmas and a Happy New Year and may it be a calm one.  I'm with Barbe - no drama.  Karen",
      "MessageIndex": 15594,
      "PostDate": "22/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 24, 2010 02:16PM - edited Dec 24, 2010 02:17PM by karen333 Cathi, you were certainly due for a meltdown, I would have had mine weeks ago.  Don't let them ruin your Christmas.  As Barbe said - if things get bad, invite them to leave, you do not have to take it.  I had to ask my daughter to stay at home with me, but he HAD to leave,  Much pleading on my daughter's part, but she made the choice to leave.  Tough love is so hard to do, but it is the only thing that works.  She eventually made her choice to leave him and she is now my best friend.  You' ll cry and feel like a monster, but it is the only thing to do.  take care  Karen",
      "MessageIndex": 15604,
      "PostDate": "24/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 28, 2010 11:45PM karen333 wrote: Cathi, the reunification date of 3/7 sounds so much more realistic.  With the increasing amount of time the children will be with them, Amanda may just see a more realistic view of SIL.and that intial awareness may begin to grow.  I know it did for my daughter.  The daycare will also be able to judge how the kids are doing, so you have many sets of eyes looking out for the children.  Your dropin visit is a great thing too.  I think they have put a good supervised plan into effect.  Maybe the system does work. And Alexsis will have time with her Mei ma again.  All things work to a purpose, Karen",
      "MessageIndex": 15620,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 3, 2011 12:02PM karen333 wrote: Cathi, sounds like it went well, I know you;ll feel uneasy this coming weekend - but all will be well.  I know when my grandchildren went thru this the first years of their life, I worried too.  You have good back up systems in place with the nursery school staff and social services there to observe and take action if needed.  I hope Ed is feeling better, I just made a flu run to the drugstore and grocery store - Susan is still under the weather, it rarely lasts this long for her.  Tried to think of all the foods she might tolerate, bananas, crackers, toast with no butter, soups.  Got her night time Theraflu so she can nap.  Also Imodium.  They are still our babies, no matter what their actual age.   Karen",
      "MessageIndex": 15666,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 25, 2011 11:30AM karen333 wrote: Cathi, you are doing great, sounds like a very good motto for SANITY.  Karen",
      "MessageIndex": 15749,
      "PostDate": "25/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Mar 4, 2011 04:47PM karen333 wrote: Cathi, I don't know how you are coping.  Amanda's calls can put you right over the edge. So, they can't have the kids back?   Isn't it amazing how 2 sisters turned out to be polar opposites.  Having been posting but have been reading.  Karen",
      "MessageIndex": 15914,
      "PostDate": "04/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Apr 10, 2012 04:16PM karen333 wrote: Michelle, you don't know me but I just lost my best friend to bc a month after she was rediagnosed.  I am so glad you and her husband were able to be with her.  It is an unbelieveable wave of grief you will ride, it is a terrible disease, we need a cure.",
      "MessageIndex": 74,
      "PostDate": "10/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785463",
      "Title": "My Sister Passed Away Tonight Curlylocks kaycancer"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 7, 2010 02:47PM karen333 wrote: Cathi, I posted once before when you were considering daycare for Ella, your grandchilldren are so lucky to have you and Ed.  Watch them sleep on Christmas eve and realize how blessed the four of you are.  I so admire what you are doing.  Take care,, Karen",
      "MessageIndex": 15516,
      "PostDate": "07/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 9, 2010 10:55PM karen333 wrote: Cathi, I sent you a PM  Karen",
      "MessageIndex": 15533,
      "PostDate": "09/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 15, 2010 09:44PM karen333 wrote: Cathi, why did DCF  do such nicely limited and close supervision for the first 2 visits and now willing to just throw your grandbabies into  a family that has just begun the recommendations of the court.  I just don't get it at all.  I understand that the courts are pushing for reunification of the family but - DD and SIL have plenty on their plate right now.  In no way are they ready for the two little ones to go home.  Sometimes, as a preschool teacher I would see examples of social services pressing for reunification when I as just their teacher knew it was a bad situation, and the kids were just caught in the middle.  Is their any way to get a guardian ad litem appointed?  This person would represent the interest of the children and would speak on their behalf during court proceedings.  Karen",
      "MessageIndex": 15564,
      "PostDate": "15/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 2, 2011 06:43PM - edited Jan 2, 2011 08:14PM by karen333 Barbe, knowing Sawyer that's probably exactly what he was doing.  And for dessert melted mozerella cheese - yum.  Karen   Cathi, kids home?",
      "MessageIndex": 15662,
      "PostDate": "02/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 5, 2011 04:45PM karen333 wrote: Dear all, had to go to myPCP today, he had ordered blood tests as did my onc., he went over all the tests he had ordered and then said I see DR.------ ordered a cancer tumor marker, it'''''s gone up since your last one of  / / .  I asked what that meant, he asked when do you see DR.----.  I said tomorrow A.M.  He said he'll know how to explain it to you.  So now I am freaking out, some friends dropped by but clearly were not able to hear me, as talk turned to one of their daughter's upcoming wedding, as in 2012.  I need some supportive words to slow me down, I've tried reading but can't concentrate, please talk me down.  I've been dissatisfied with this DR. for quite some time, this is my push to find a new primary.  Karen",
      "MessageIndex": 15669,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 11, 2011 10:13PM karen333 wrote: My mistake, Shirley was talking about last winter.",
      "MessageIndex": 15683,
      "PostDate": "11/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Feb 25, 2011 08:22PM karen333 wrote: geebung, sending thoughts and prayers your way.  Your son sounds like a wonderful man.  Karen",
      "MessageIndex": 15866,
      "PostDate": "25/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Mar 5, 2011 08:56AM karen333 wrote: Cathi, my heart hurts for you,Ed, Ella, and Landen. Of course you couldn't answer, don't beat yourself up over that.  What a heart rending situation.  My prayers are with you and the children.  Karen",
      "MessageIndex": 15918,
      "PostDate": "05/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Mar 6, 2011 08:13PM karen333 wrote: Cathi, there will be all your cyber friends with you in court tomorrow.  Before my godmother passed she had told me inumerable times that the book of our life is written by God from the very beginning of our life.  He holds Ella and Landen, you and Ed and even Amanda in His loving hands.  No amount of worrying is going to change tomorrow's outcome, hold onto Ed and let tomorrow come.  Karen",
      "MessageIndex": 15929,
      "PostDate": "06/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Mar 7, 2011 08:38PM karen333 wrote: great news Cathi!!  You got a judge with common sense who saw through all the excuses SIL was offering.  I second Barbe''s remarks, maybe sitting through all that made a serious impression on Amanda.  No more skating through the legal requirments, they are being held to task.  Sleep well tonight.  Karen",
      "MessageIndex": 15946,
      "PostDate": "07/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Mar 22, 2011 07:18AM karen333 wrote: Cathi, praying for strengh to get you through the next few hours.  Then time for tears.  Karen",
      "MessageIndex": 15986,
      "PostDate": "22/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Apr 4, 2011 04:59PM karen333 wrote: Cathi, I understand why the caseworker said it, but it might be nice for you and Ed to pick them up maybe once or twice a week.  Use your best judgement.  That is exactly what you are doing, an intervention, and you see how hard it is to do.  I have watched it too, and the toll on the family, who has to do the intervention is enormous, as you can tell first hand.  Sending calm thoughts your way during this stressful times.  Karen",
      "MessageIndex": 16024,
      "PostDate": "04/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jun 2, 2011 01:12PM karen333 wrote: Thanks Barbe for letting me know, I will send a prayer that they all stay safe from the fires.  It is so wet here the farmers were just now able to plant, it sure has been a year of wild weather patterns.",
      "MessageIndex": 16085,
      "PostDate": "02/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 10, 2010 09:44PM karen333 wrote: Cathi, this tough love is the hardest part for both of you, but you will have social services monitoring DDand SIL.  If you start getting the pleading calls or see that the kids are lacking food, diapers you can let social services know.  They will be your watchdog, especially since they know the wonderful care you and Ed have provided.  DD's otten come to their senses and regain that sense of self that you brought Amanda up to have.  Then she will see SIL for the person he really is and know her priorities must be her children.  My thoughts are with you.  Karen",
      "MessageIndex": 15538,
      "PostDate": "10/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 15, 2010 11:16PM karen333 wrote: Cathi, it just breaks your heart to hear of these children.  I know that their is a huge turnover in social workers my cousin lasted as a caseworker for 10 years then had to leave because of the push for reunification.  You have to believe DCF workers are aware of cases where reunification should not reoccur at all or needs to be ever so gradually phased in.  My 87 yr. old godmother always tells me that the plan for your life is already written by God, and this would have to be doubly so for little ones.  May he hold Landon and Ella in the palm of his hand right now and keep them safe. My godmother had a full mastectomy in 1984, no chemo - no rads - no AI's and is still going strong.  Her belief in a compassionate God who has written our lives is very strong.  You are all in my thoughts and prayers.  I am so sorry this is all happening.  And look at you, Cathi, checking case law, you go girl.  Karen  rest easily tonight Miema",
      "MessageIndex": 15567,
      "PostDate": "15/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 28, 2010 07:28PM karen333 wrote: Cathi, not at the age your two little ones are now, they do keep you on your toes.  My grandson and I went to lunch today,  It was a reward for a great report card - grades and comments too.  He is 12 now and I noticed a tiny shadow of a mustache, seemslike it was yesterday I was carrying him on my hip in a store so he wouldn't get into stuff.  He has a very dry wit and it was afun time for both of us. He was like your Ella as she made a beeline for the tree.  Time goes by so fast.  Karen",
      "MessageIndex": 15617,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 7, 2011 08:43PM karen333 wrote: Barbara A., thanks for your message.  I have been there looking over the thread, just posted.  See you there. Karen",
      "MessageIndex": 15674,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 11, 2011 01:45PM karen333 wrote: Dear Cathi, glad the weekend was quiet, sorry you are in pain, it's good that you did a jammies day, during the week I know ou go at fullspeed with Ella and Landon.  I had a good appt with my BS yesterday, physical exam, blood work and US.  He sees no evidence of any problem, no infection, seroma has been reabsorbed by my body.  He said most onc. don't rely on the cancer TM's unless there is a huge difference and some evidence off a problem, I feell fine.  In fact 2 of the tests showed me in the normal range, the third up 1/2 of one point, proably the smoking, I'm down to 5 a day, I was at a little over a pack, boy is my house getting cleaned!!!!!!!  I'll be meeting with an onc. he admires, so will have a far superior team.  How's your weather?, I know lovtoquilt tooka spill with the icy conditions in the Carolinas, everyone in the states affected stay safe, we are at 25 with snow expected this afternoon 2-6 inches thru tomorrow.  Karen",
      "MessageIndex": 15679,
      "PostDate": "11/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 14, 2011 02:34PM karen333 wrote: Dear Cathi, I am sorry this has happened to you, after all the rest you have gone through.  I am thinking you made the right decision - Don't have the fight left in you and you have to pick your battles when you are going through such %^$#@*& with your own child.  Have they made up the meetings they have missed?  What are the penalties if they don't, or are there no consequenses?  Remember it will work out in the long run, and the principle that is most importent is that the children are safe.  I wonder what the social worker could do if you just happened to mention it to her,   Karen",
      "MessageIndex": 15694,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 17, 2011 05:42PM karen333 wrote: Going to a new oncologist on Thurs., the one in town just wasn't knowledgeable enough.  Giving tests most drs. don't use or have no predictive value. Cathi send some of your weather up here, thisAM it was 0, unbelieveable!!!  That's a record even for W.N.Y..  How did the little ones do over the weekend, was drop off time less traumatic since they were dropped off to you and Ed? everyone stay warm.  Karen",
      "MessageIndex": 15713,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 23, 2011 06:15PM karen333 wrote:       it sounds like they are sinking financially already, now is not the time to help them.  It will be hardbut that is what tough love is all about.  Report it to caseworker, the broke comment, what you saw served and phonecall and concern for lunch packed.  School will notice also and should tell case worker.  If you help them by providing food each weekend, they will expect it each weekend.  Tough love time, Cathi!  Karen",
      "MessageIndex": 15721,
      "PostDate": "23/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Mar 7, 2011 03:39PM karen333 wrote: Cathi, let us know how court went, hoping for good news to calm your fears.   Karen",
      "MessageIndex": 15939,
      "PostDate": "07/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Mar 8, 2011 05:27PM karen333 wrote: Cathi, I agree, Ed has been a rock during all this chaos.  I'm glad he's there for you.  Karen",
      "MessageIndex": 15957,
      "PostDate": "08/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Mar 21, 2011 04:22PM karen333 wrote: Cathi, sending prayers for God to hold Ella and Landen in the palm of his hand to protect them and to keep you and Ed in a peaceful place.  Karen",
      "MessageIndex": 15981,
      "PostDate": "21/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Mar 22, 2011 02:42PM karen333 wrote: Cathi, this will be the hardest part of the day, try to keep it brief since it will be so hard not to cry and may God have you in his hand surrounded with that special grandma love (only you know how strong it is). Karen",
      "MessageIndex": 15990,
      "PostDate": "22/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Apr 3, 2011 03:49PM karen333 wrote: Cathi, just got back from a short trip and am catching up on the boards.  If Amanda mentioned taking her life, you should call the caseworker and guardian ad litem (if they have an emergency no.), and make the call today so neither the kids or Amanda are at risk.  Whenever there is a threat or mention of a plan, as a preschool teacher we were under state law to phone the department of social services and advise them of a threat to take her own life and we were to do it immediately so someone can get to Amanda and assess the situation.  sending prayers your way,  Karen",
      "MessageIndex": 16017,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Apr 8, 2011 01:05PM karen333 wrote: Cathi, you are doing great!!  Simple answers and right to the point.  And it is A-OK to cry, this is very draining to do. Hugs, Karen",
      "MessageIndex": 16030,
      "PostDate": "08/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Apr 12, 2011 04:23PM karen333 wrote: Cathi, was away for a few days and just saw your post.  When my daughter and I were estranged, I would drive from Va. where I was living to Buffalo to see her and the children.  Like you I never knew what to expect, and inevitably would be bad or worse, I would cry all the way home.  So I totally respect you coming to the boards to stay sane, I would lean on a few good friends and they never tired of me and my sometimes embarassing stories. So vent away.  Before she had her wakeup call and started to drastically change her life, which Amanda has to do too, I had threatened to take her to court for custody.  As you said I did not know where my true daughter was and thought she was gone from me forever, and I did not like or respect who she was then.  Take heart, your daughter may again emerge, but for now it seems like you and Ed have a great tough love plan in place and you and the school system are on guard for Ella and Landen and your daughter, Jaclyn is a strong support for you and the children.  It is bad enough that our children become involved with drugs, but when there are children involved it is a true heartache for them. hugs, Karen",
      "MessageIndex": 16054,
      "PostDate": "12/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jul 27, 2010 01:48PM - edited Jul 27, 2010 01:48PM by karen333",
      "MessageIndex": 15211,
      "PostDate": "27/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 17, 2010 09:31PM karen333 wrote: Cathi, I do think you are right and the ones who do care are held hostage by laws and red tape.  Hence the huge turnover in social service workers.  Like you said in a previous post about the little girl who had 3 caseworkers in one year.  But I have to believe that in Landon and Ella's case the caseworker and GAL will prevail, and this time the system will not fail.  Remember, all things work out for the best,as in my case, had my daughter not gotten involved with the chidrens father, I would not have my beautiful grandchildren.  We just have to struggle through the pain to find our daughter's finally chose the right path.  May you and Ed have a restful evening and a chance to have a quiet morning.  Karen",
      "MessageIndex": 15579,
      "PostDate": "17/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 29, 2010 09:00PM karen333 wrote: Cathi, I hope the MRI shows nothing of significance.  Do you rest while the kids are at daycare?  I don't imagine you are much of a rester, but you really need to be gentle with yourself when you can.  Just dealing with 2 pre-schoolers is a full time job.  I know 20 years ago when I was a preschool teacher I was ready for bed at 9:30 most nights, shortly after I put my daughter to bed.  And there was no hint of cancer to contend with then.  Karen",
      "MessageIndex": 15629,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 18, 2011 04:08PM karen333 wrote: sorry you are in so much pain Cathi, so glad SIL was working too.  Of course you miss them, they have been with you every single day up till recently.  It's like when I am watching over the kids and their friends while DD works, and the noise level with stereo is making the floors vibrate.  But then the friends all go home and my kids go to a sleepover - then the house is too quiet, especially if they're gone for a full day, I miss them.  Hope the weather stays warm and sunny for you, Karen",
      "MessageIndex": 15715,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Mar 5, 2011 09:48PM karen333 wrote: Cathi, one of the worst thngs is that they know how to push our buttons, especially after the day of worrying you had.  Do not leave anything on the answering machine, she is not above using it as a weapon right now.  Take a nice big glass of your favorite drink and go outside and decompress.  You have to take care of you (and  Ed), this is going to be a long few couple of days.   Karen",
      "MessageIndex": 15920,
      "PostDate": "05/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Mar 15, 2011 02:20PM karen333 wrote: Cathi, there are so many things affected by this recession, I hope Ed's meeting went well and they were able to come to a liveable compromise.  Sending good thoughts your way. Karen",
      "MessageIndex": 15968,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Mar 15, 2011 04:17PM karen333 wrote: Cathi, I will add my prayer to yours, you two have already been through so much this year.  How are you feeling physically, you don't talk about it but I am sure you are in some pain?  Karen",
      "MessageIndex": 15970,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Mar 22, 2011 09:20PM karen333 wrote: Cathi, cloudhowe put it beautifully.  Karen",
      "MessageIndex": 15994,
      "PostDate": "22/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Apr 6, 2011 06:55PM karen333 wrote: Cathi, I teared up when you said Ella was kind of wandering around then just layed her head on your lap, Ed is just a lifesaver isn't he?  I hope you get a really good caseworker, one that is concientous and easy to talk to.  My cousin was a case worker for 10 years then had to leave as she was burned out by the cases like you heard in court.  She was civil service with pension, sick benefits, etc..., but needed to be on anti-depressants for the last year she worked.  Ended up working 2 part time jobs, no benefits.  Can you imagine the pain they see and feel for their little clients, that is why the turnover is high in that job.  Just hope Amanda will come to her senses and kick SIL to the curb, and realize she is now living her life for the children.  I am always reminded by your circumstances how hard it was to see my daughter in that spot of her life.  I honestly felt I had a hole in my heart for her and my grandchildren.  I'm sure you feel the same.  hugs, Karen",
      "MessageIndex": 16026,
      "PostDate": "06/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jul 27, 2010 01:46PM karen333 wrote: Dear Cathi, I have read this site since the first post, but did not feel like I needed to offer advice since you had a great cadre of friends advising you.  You have been doing superwoman duty for so long and with such a powerful love for the children.  Time for you to take a rest.  In my previous life I was a day care teacher, and the program offered many caring activities done by dedicated staff.  I can honestly say that my team and I offered an outpouring of love for our children.  Just consider them as an extended family helping with Ella.  The socialization, art activities, guided play, gross motor opportunities can only benefit her and by extension you.  You are one amazing lady.  Karen",
      "MessageIndex": 15210,
      "PostDate": "27/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jun 6, 2011 02:35PM karen333 wrote: Dear Cathi, I am so sorry all these issues are swirling around you, especially since no one seems to realize the potential and actual damage to Ella and Landen.  The call from the nursery school just may open up Pandora's box for Amanda and SIL for social services since it was court ordered that the children be in nursery school.  Plus the lead teacher's opinion of SIL may finally have an impact.  A full out investigation may, God willing, result and the children's living situation will be exposed.  Sending prayers for you and Ed, and the little ones.  Karen",
      "MessageIndex": 16100,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jun 27, 2011 05:40PM karen333 wrote: Dear Cathi, sending prayers for the children and you and Bill.  Hold on, an intervention is a very difficult thing to do.  Karen",
      "MessageIndex": 16161,
      "PostDate": "27/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 12, 2010 02:51PM karen333 wrote: Cathi, enjoy your date night, that is a great 2 trial visits that DCF arranged, sounds like they are really taking their role seriously. Karen",
      "MessageIndex": 15542,
      "PostDate": "12/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 15, 2010 09:56PM karen333 wrote: I just reread your post, is this the GAL you were referring to?  I would think her concerns and you and Ed would carry quite a bit of weight.  Karen",
      "MessageIndex": 15565,
      "PostDate": "15/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 17, 2010 12:07PM - edited Dec 17, 2010 12:08PM by karen333 Cathi, the case worker's recomendations seem reasonable, but who sits on the reunification's team?  They don't have the childrens' interests at heart, how much power do they have?  It seems like they only want to close the case at all costs.  And at this point the children would be at risk due to the likelihood of failure on their parents' part.  My thoughts and prayers are with you.  Karen",
      "MessageIndex": 15576,
      "PostDate": "17/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 25, 2010 10:16PM karen333 wrote: Cathi, glad everything went well, and quiet coffee time tomorrow morning too.  Ed did a nice job dealing with Bill who sounds like he has a mental age of 3 or 4.  Had a great day with my grandkids, daughter.  Up at 6:45, but my grandson already had the coffee  made.  Hope everyone had a beautiful day. Karen",
      "MessageIndex": 15609,
      "PostDate": "25/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Dec 31, 2010 11:36PM karen333 wrote: Happy New Year everyone.  1/2 hour till 2011, my daughter is asleep with the flu, poor babe has been ill all day, granddaughter is at an ice skating New Years Eve. party, so Addison and I will see in the New Year together.  He's not quite sure why it is a big deal, but I'll get a hug and kiss from my best beau.  Karen",
      "MessageIndex": 15651,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 2, 2011 02:57PM karen333 wrote: We had 2 days of temps in the high 40's, it was glorious, today we are back too reality, 27 and snow.  My daughter has had the flu for 3 days, she usually doesn't get sick but this has hit her hard - hope it does'nt go through the household.  Nancy, I had a brown lab a few years back, he was such a happy boy, always looked like he was smiling.  I got home from work one day and asked my ex where the pizza was that he had ordered, he said on the counter.  Found the empty box in the hallway.  He was awful quick when it came to food.  Karen",
      "MessageIndex": 15658,
      "PostDate": "02/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 6, 2011 07:31PM karen333 wrote: Dear EWB, oncologist thinks the slight rise may be due to the fact that I am a smoker, so I became a non-smoker today, it was something I said I was going to do after being diagnosed in Aug.09.  I   am to see BS on Mon., onc. thinks infected seroma I had is still infected, since it is still warm and slightly larger.  I thought it had gone down quite a bit. aspirated 2x and 2 courses of antibiotics.  The beast never sleeps does it.  Just when you think you have your feet on the ground, they get swept out again.  I keep telling myself it is what it is and worrying isn't going to change anything.  Did find a new PCP, woman Dr. I have heard good things about and will fire old one for his behavior and attitude in telling me TA's were up.  He has always been condescending, this was over the line. I feel a little calmer now that I am taking action.  Thank you for your concern, hugs back at you  Karen ",
      "MessageIndex": 15671,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 11, 2011 09:05PM - edited Jan 11, 2011 09:11PM by karen333",
      "MessageIndex": 15682,
      "PostDate": "11/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jan 24, 2011 11:37AM - edited Jan 24, 2011 11:47AM by karen333 And so it starts, the phone calls for money,just remember if you give in once, she will be conditioned to expect it from  now on.  Make sure the caseworker is aware of it and that she missed classes.  If she missed, thenSIL missed too. Their choice to do so Cathi.  And if it means jail time, although that might be a bluff, that was their choice too.  Then Landen and Ella will be back safe and sound with you.  You feel bad because it is so hard to be so tough, but partof  DD's reality has to be she depends on herself not you for finances.  Be brave.  Karen  Part 2 - she just upped the ante by showing up at your house for a face to face talk.  As far as the upcoming weekend goes, it is possible she\"ll skip it, with no food for the household.  Make sure the caseworker is aware of all tthat is going on .",
      "MessageIndex": 15730,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Mar 27, 2011 05:40PM karen333 wrote: Cathi, perfect response!  If Landen does act up, it will be interesting to see if he turns to his parents to see if it is OK, or he turns to you as he will realize he is at MiMa's house and the rules are different.  Hope all goes well.  Karen",
      "MessageIndex": 16001,
      "PostDate": "27/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "karen333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103655/profile",
      "Content": "Jun 2, 2011 12:08PM - edited Jun 2, 2011 12:09PM by karen333 makes me worried about Cathi that no one is hearing from her, I hope she is as well as can be expected given the circumstances.  The facebook posting photos do not sound like a good sign.  Karen",
      "MessageIndex": 16083,
      "PostDate": "02/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    }
  ]
}