{
  "AuthorID": "karen_3",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79858/profile",
  "Posts": [
    {
      "AuthorID": "karen_3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79858/profile",
      "Content": "Mar 11, 2009 01:05PM karen_3 wrote: Just wanted to check in - One week out from bilateral surgery and I've started working from home today ( good to concentrate on other things ) I haven't been posting because I have not been feeling well mentally (and it's nothing to do with losing my breasts) I am in process of looking for new Oncologists, decided that I wasn't happy with my chemo cheerleader and want to discuss ALL treatment options with a couple more - 2nd and 3rd oppinions.   My surgery was a success (though I do feel like a couple linebackers are standing on my chest) no node involvement and some of my 3cm tumor was DCIS ... my left breast totally clear without even a micro-calc - so that one was just sacrificed as part of my quest to at least have matching breasts. Much of the information about surgery was RIGHT ON, thank you experienced ladies, the drains were a pain, and I found for the first days to wear a hoodie (as  I usually do) worked out well, so I could just tuck the drains in the pockets.  Much better now that those are out.  I had no other complications or constipation, etc -- my Plastic surgeon was thrilled to have put 400 cc's in both during surgery ... but I kind of think the originally planned 200 would have been fine.  He said I only need a couple more fills, the first will be one week from today. I am still having trouble with the chemo issues and YES while in the hospital, my Onc caught up to me to tell me about the wonders of TC and Herceptin for 6 rounds.  But I have to tell you ladies, I've been obsessed with research since I've gotten home and even now while I should be working :) And chemo is not 100%, there is NO guarantee that once I submit to lowering my immune system and killing off my white blood cells that those wayword cancer cells were caught.  There is NO cure and there is NO guarantee, and CHEMO may just be prolonging the inevitable which for some of us IS a recurrence. Now, it's not the hair loss that is frightening me, they have some awesome wigs out there, and my hair grows fast and I can afford extentions when it reaches 1 inch (hey if Brittany can do it, I can too) It's the FOREVER side effects of my finger tips being numb or my feet - which for some last FOREVER that have me against it.  And the fact that there is NO guarantee.  If My Onc could write down that I'd be cured after 6 rounds of TCH, I would go for it, but to think of having long term complications and a recurrence in a couple years... COME ON! This whole thing is a freaking crap shoot if you ask me, there is no guarantee that tamoxifin will do the trick or rads or whatever else they throw at you.  For those of you who feel you must throw the whole damn arsenol so that if it does come back you can better accept that - I understand, really I do.  But I believe that my body has natural defenses that I will destroy forever with chemo, or herceptin for that matter that could end up giving me congenitive heart failure...even with just a couple doses.  Some women have alergic reactions to this crap and DIE on day one. I'm not ready to sign my life away at this point - Who out there has had chemo and has has a recurrence anyway??? Who out there has had chemo and suffers from long term issues because of it. I'm not the only one, I've recently had a nurse call me and tell me that the decision for Chemo is mine and mine alone and to do my research and make my own choices and I am. everyone has to find there OWN path here with this.  Right now, I feel no matter what I do this looming dark cloud will be following me everywhere I go.  I'm consumed right now - all I think about is this with only feeling peace when I walk on the tread mill or sleep.",
      "MessageIndex": 69,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "karen_3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79858/profile",
      "Content": "Mar 13, 2009 11:03AM karen_3 wrote: Thanks to everyone for your VALUABLE advice, it really is helping me a lot to know there are so many of us out there - as unfortunate as that is. I'm obsessed with research now and can't get a handle on being PISSED OFF, I've keep reading so many studies on Birth control and breast cancer, specifically about how the risk is VERY great if you were like me and opted for some birth control for 4 years or MORE before you had your first child.  I used to joke about how I went on the pill at 20 after an abortion that tore me up emotionally and then was on the pill for 4 years, only to go off 3 whole weeks and get pregnant with my first daughter Erika.  Fertility jokes aside, I wish just one of the doctors, via many health plans and many medical groups would have whispered in my ear that there may have been a link.  I actually thought that crap was good for me, lessoning the silent cancer 'ovarian' and since I did not have any health history (adopted) thought it was a blessing. I went off the pill on October 11th 08 after reading a book by Suzanne Sommers called Breakthroughs, in which she sites her estrogen dominancy (caused by birth control for 10 years) being the link for her diagnosis, I took the book to my doctor and he joked.  My ver homeopathic doctor that I discussed growing my own vegetables with thought it was just PEACHY that I stay on the pill until AFTER menopause, maybe 12 years from now, so that I could just cheat the side effects.  I was cheated alright, that I'll agree with.  What really spooked me was a my laser doc, also very homepathic in a routine appointment for microdermabrasion, warned me of the dangers of the pill and her being in the medical community (albeit dermatology) told me there most DEFINITELY was a link and always has been.  I went off that very day in the middle of my cycle. Now I know I'm in the early stages playing the blame game here and that's how it looks because REALLY that is how it is, but I'm going to shout from the mountain tops about this link between the pill and breast cancer until someone puts a freakin gun to my head.  I intend on being the new Jenny McCarthy of breast cancer if that's what it takes.  I have meeting with two oncologists next week, one outside of my group at a Naperville hospital, but everything I read is just very standard - the her2+ plus and the size = TCH you guys are all correct in what you are telling me.  I was perhaps wanting to explore Herceptin alone, or with a very low toxic form of chemo and then possibly tamoxifin since I'm PR+ and ER+ (actually higher PR +) which gives me an over 70% of that working to resist a recurrence for me. bilateral is doing better now one week after, just to share a little tip.  Massage, massage massage!!! these expanders suck - hoping the gummies I have swapped later will be much nicer, but if I take some nice holistic oil, lavender or vitamin E, Jojoba, whatever I feel like and massage the hell out of them in the shower they feel 300% better, better than motrin or lortabs ever worked!  Just a little tip ladies, again BLESS all of you and your strong minds and hearts and thank you for all the information. Karen ",
      "MessageIndex": 82,
      "PostDate": "13/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "karen_3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79858/profile",
      "Content": "karen_3 wrote: Hey there, I was diagnosed on 2/6/09 with IDC - bilateral is scheduled for 3/4/09, even though I just have one single lump (as far as MRI is concerned) in my right breast only - I feel that this will be the best decision for me. I'm being positive about this and hoping I have no node involvement, with that being said, after researching many treatment options (radiation/chemo and drugs like Herceptin and Tamoxifin) I want this bilateral to BE my treatment.  I have a great plastic surgeon and trust that he will reconstruct me well.  But I know because of my status (ER+) even if my Oncotype DX score is LOW -- my oncologist will try to get me on tamaxofin... does anyone else feel that some of this is overkill?  If my score on the Oncotype DX is less than 16, I had a chat with God ... and I'm fine with that. I personally believe that putting hormones into my system for 15 consecutive years is what got me into this mess.  I tested neg for BRCA1 and 2 - and have NONE of the lifestyle risks, I'm so healthy it would make anyone sick and now this.  And I just turned 40!  I think there is something STRANGE going on here and I'm not willing to just take anything prescribed, in general I do not believe in pharm - and wish I hadn't been so damn fertile all my life and I could have stopped the pills years ago.... anyone else like me pushing against Tamoxifin...?  ~ Karen ~ Dx 2/6/2009, IDC, 3cm, Stage II, Grade 2, 0/6 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "karen_3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79858/profile",
      "Content": "Mar 2, 2009 12:17PM karen_3 wrote: Thanks for the valuable insight, I am getting more from the women who have gone through this than any.  I have an issue with stats in general, I always fall into that very small percentage, granted in this case it could be good or bad.  I got pregnant with my third daughter on the pill (.10 of 1 percent) in that case it turned out to be good as she is my angel.   I have been a single mom for 10 years and just don't meet those stats either - my kids get great grades are very happy, I own my own home and make well over 6 figures.  I am just used to being the odd one here.  I think it's great that all these treatment options are available, but I feel my bc is from my pill usage and right now my body is regulating my estrogen dominance.   Getting a historectomy, is not something that I would be okay with and it seems very weird that they have cancer treatments that a) cause cancer - as in the case with tamoxifin or heart problems - which is the number ONE killer of women, while bc is number two.  What about before these treatments, many women who had mastectomies did not have recurrences without the drugs?  I have heard many stories on this very discussion board.  I feel as if the same arsenal of pharms and treatments are offered to all and not tailored to the individual.  yes, I've been told her2+ but it took him a long time to come to that conclusion while looking at my pathology - why?  probably because I'm not highly positive but neutral with positive receptors... I don't think that everyone should be treated the same and I'm not throwing EVERYTHING at this so that the cancer's is nixed but other issues arise later.   The purpose of the oncotype dx test is to see if you are a candidate for chemo, and yes it factors in tamoxifin you are correct.  So if I come back at 17 or as low as you did - I will not be even considering chemo - since the test itself proves that it would not be more beneficial than the damage caused.   If tamoxifin lowers me by 20% well, now that's something but if it takes me from 10% to 5% - I'll be taking a pass.  I want a customized treatment plan for me taking into account my overall excellent health, lifestyle, etc that's all I will be seeing homeopathic doctors after my surgery this wednesday.  I think everyone has to make choices that they are happy with and can live with WITHOUT regret",
      "MessageIndex": 19,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "karen_3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79858/profile",
      "Content": "Mar 2, 2009 09:07PM karen_3 wrote: Thanks everyone for your wonderful insight, no one knows what we are dealing with better than those of you who have been through it! -Until I have my final stats, I'm going to keep my thoughts positive, even if her2+ according to my breast surgeon a low score on the oncotype dx test will mean bypassing chemo, and I will take that chance.  I've mixed feelings about tamoxifin (yes I know the oncotype score assumes you are taking that) and herceptin.  if I had to chose one - it would probably be the tamoxifin - to prohibit the estrogen which is fueling my cancer - when I asked about uterine and endometrial cancer, my oncologist laughed and said she'd just take that out too. I'm still going to opt for the least invasive pathway - and if that means a few percentage points more of risk, I may just go that way. I honestly am in total shock about this, cannot believe how many women are affected with this, it seems COMMON, like some right of passage.  Buy a volvo - get some breast cancer, is this how life welcomes you to middle age? I am so encouraged by everyone's posts and at the same time SO freaking sorry that this is the topic and not some book in Oprah's book club :)",
      "MessageIndex": 24,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "karen_3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79858/profile",
      "Content": "Mar 3, 2009 08:40PM karen_3 wrote: OMG Jaimie - it must be the day - I had a not so nice on the phone today with my oncologist.  She said that because I am her nuetral with the positive receptors that she does not recommend the oncotype dx test which I called to discuss with her.  I said I wanted it anyway - she said the SAME THING that because of my age (4) that she recommends chemo, not even HAVING my final pathology since my bilateral is tomorrow!  then she told me based on the size of my tumor that my nodes are probably positive anyway which would not make me a candidate for the test!  Can you freaking believe that?  there are TONS of ladies on her with a 3CM IDC palpable lump or LARGER that ended up being node negative.  I am trying not to stress now - because of my surgery later - but she is FIRED as far as I'm concerned, I will ask for a new recommendation after my final path report is mailed to me - which I asked her to do. What is with these people - do they get kickbacks for chemo? I told her (not so politely) what she recommends and what I'm going to do are NOT the same thing.  She actually asked me would I consider chemo if the oncotype came back high or had I totally made my mind up about it!  Now I'm thinking she's going to rig the test! positive thoughts ladies .... my bilateral is tomorrow - despite my wayward oncologist I am hoping that I have absolutely NO complications and no nodes affected... wish me luck! Karen ",
      "MessageIndex": 37,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "karen_3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79858/profile",
      "Content": "Feb 28, 2009 02:17PM karen_3 wrote: If I'm node negative the test with a score of 16 or below makes my recurrence rate less than 10%, this would not warrant chemo and it's his idea to have the test which will be covered by my insurance.  The test is performed on my breast tissue removed from next weeks mastectomies. We have not spoke about herceptin. ",
      "MessageIndex": 2,
      "PostDate": "28/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "karen_3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79858/profile",
      "Content": "karen_3 wrote: Hey there, I was diagnosed on 2/6/09 with IDC - bilateral is scheduled for 3/4/09, even though I just have one single lump (as far as MRI is concerned) in my right breast only - I feel that this will be the best decision for me. I'm being positive about this and hoping I have no node involvement, with that being said, after researching many treatment options (radiation/chemo and drugs like Herceptin and Tamoxifin) I want this bilateral to BE my treatment.  I have a great plastic surgeon and trust that he will reconstruct me well.  But I know because of my status (ER+) even if my Oncotype DX score is LOW -- my oncologist will try to get me on tamaxofin... does anyone else feel that some of this is overkill?  If my score on the Oncotype DX is less than 16, I had a chat with God ... and I'm fine with that. I personally believe that putting hormones into my system for 15 consecutive years is what got me into this mess.  I tested neg for BRCA1 and 2 - and have NONE of the lifestyle risks, I'm so healthy it would make anyone sick and now this.  And I just turned 40!  I think there is something STRANGE going on here and I'm not willing to just take anything prescribed, in general I do not believe in pharm - and wish I hadn't been so damn fertile all my life and I could have stopped the pills years ago.... anyone else like me pushing against Tamoxifin...?  ~ Karen ~ Dx 2/6/2009, IDC, 3cm, Stage II, Grade 2, 0/6 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "28/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "karen_3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79858/profile",
      "Content": "karen_3 wrote: Hey there, I was diagnosed on 2/6/09 with IDC - bilateral is scheduled for 3/4/09, even though I just have one single lump (as far as MRI is concerned) in my right breast only - I feel that this will be the best decision for me. I'm being positive about this and hoping I have no node involvement, with that being said, after researching many treatment options (radiation/chemo and drugs like Herceptin and Tamoxifin) I want this bilateral to BE my treatment.  I have a great plastic surgeon and trust that he will reconstruct me well.  But I know because of my status (ER+) even if my Oncotype DX score is LOW -- my oncologist will try to get me on tamaxofin... does anyone else feel that some of this is overkill?  If my score on the Oncotype DX is less than 16, I had a chat with God ... and I'm fine with that. I personally believe that putting hormones into my system for 15 consecutive years is what got me into this mess.  I tested neg for BRCA1 and 2 - and have NONE of the lifestyle risks, I'm so healthy it would make anyone sick and now this.  And I just turned 40!  I think there is something STRANGE going on here and I'm not willing to just take anything prescribed, in general I do not believe in pharm - and wish I hadn't been so damn fertile all my life and I could have stopped the pills years ago.... anyone else like me pushing against Tamoxifin...?  ~ Karen ~ Dx 2/6/2009, IDC, 3cm, Stage II, Grade 2, 0/6 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "28/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    }
  ]
}