{
  "AuthorID": "karenriches…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59641/profile",
  "Posts": [
    {
      "AuthorID": "karenriches…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59641/profile",
      "Content": "Dec 2, 2007 04:27PM karenriches wrote: sandyk: Thank you for adding your recent comment.  Your rationale sounds so much like mine, although I just found out about this on Wed and the surgeon thinks I am taking a very radical approach to something that doesn't require one.  I am going this week to receive a second opinion.  I am still really scared and need constant company and reassurance.  This waiting to resolve this is driving me insane.",
      "MessageIndex": 14,
      "PostDate": "02/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696223",
      "Title": "BRCA test impact on surgery twogirls SandyinSoCal"
    },
    {
      "AuthorID": "karenriches…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59641/profile",
      "Content": "Dec 1, 2007 10:46AM karenriches wrote: This sounds very similar to what I may be facing soon.  Can you guys help me sort through what is happening.  I do not know all the specifics yet, except that I have a stage one mass in my right breast.  There are also 2 areas on the mammo that are suspicious, but they are still very small calcium clusters.  I told the surgeon if the needle biopsy was positive for cancer I wanted both breats off with implants.  He said that is radicial, but would get rid of it.  It has in fact come back as cancer.  He is saying slow down, get genetic analysis, maybe do lump out with radiation.  I can't live with these breast.  Is it crazy to have them removed?  I, too, just want this done NOW!!",
      "MessageIndex": 5,
      "PostDate": "01/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696223",
      "Title": "BRCA test impact on surgery twogirls SandyinSoCal"
    },
    {
      "AuthorID": "karenriches…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59641/profile",
      "Content": "Dec 1, 2007 03:43PM karenriches wrote: If I have the mastectomy, where would the recurrence be?  I am so new to this and this information is so fresh, that I am still having a tough time hearing survival rates and stuff, so I generally don't even discuss that.  It makes me anxious and I have to take medication to function.  In fact, I asked the surgeon if the mastectomy would rid me of breast cancer and give me peace of mind and he said yes.  I feel like this genetic testing stuff and the debate that will follow will just take time and I know I want the bilat mastectomy. It sounds like you are further along in the discussion process with the surgeon, so can you tell me what you think the cons are, other than the obvious of course...major surgery, etc.  Is there anyone that you have encountered on this site that has a similar situation and has had the mastectomy??",
      "MessageIndex": 7,
      "PostDate": "01/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696223",
      "Title": "BRCA test impact on surgery twogirls SandyinSoCal"
    },
    {
      "AuthorID": "karenriches…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59641/profile",
      "Content": "Dec 2, 2007 08:58PM karenriches wrote: twogirls and sandyk...thank you. thank you. i was on here just reading for the first few days debating whether or not to add anything and i am glad i did.  i am meeting with the surgeon tomorrow and i know he will encourage me to slow down, do genetic analysis, and consider the lumpectomy, but i am pretty sure about how i want to go. i think i may start the thread you suggested twogirls. i just have trouble whenever people begin to talk about survival rates, etc. i need to stay focused only on how to fix this asap.",
      "MessageIndex": 17,
      "PostDate": "02/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696223",
      "Title": "BRCA test impact on surgery twogirls SandyinSoCal"
    }
  ]
}