{
  "AuthorID": "Karmha",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218248/profile",
  "Posts": [
    {
      "AuthorID": "Karmha",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218248/profile",
      "Content": "Karmha wrote: Dear all, I just sign up in this forum and I hope you can help to understand the conditions of my dear 36yrs old sister. She lives in Italy while I am in the US. She was diagnosed with a Breast Cancer and after a couple of week she had a lumpectomy. The histologic examination after the surgery gave the following results: (I am translating from Italia so sorry if something is not clear but I do not know all definitions) Invasive Ductal Carcinoma - SBR score 9 ( I believe is Grade 3) with a part of Carcinoma Intra-ductal with high percentage of 15%. The other definitions are I think er+ pr+ her2+ (in Italy they write cERB 2+, I think is the same) So by the end it says: Invasive Ductal Carcinoma - SBR score 9 ( I believe is Grade 3) , ER+ PR+ HER2+ , Stage pT1 N1 Mx Could you please help me to understand more about that and the treatments that normally are adopted for this kind of breast cancer. Thank you in advance Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/833298",
      "Title": "Help Understanding my sister conditions Karmha Karmha"
    },
    {
      "AuthorID": "Karmha",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218248/profile",
      "Content": "Jul 13, 2015 01:57PM Karmha wrote: Thank you kayb for you kind answer. I think my sister got this type of cancer due to the hormones she took during last pregnancies. She had problems having baby and the hormones helped her to have 3 wonderful babies. I read that there is a rate of 75% of probability to get a breast cancer after such cure :( Seems that the doctor in Italy is exactly giving the same cure you mentioned above. Herceptin was introduced in Italy a year ago and I hope will help like you said. In the meantime the doctor asked a bone scintigraphy. After that she should start the cure.  Thank you.  ",
      "MessageIndex": 2,
      "PostDate": "13/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/833298",
      "Title": "Help Understanding my sister conditions Karmha Karmha"
    }
  ]
}