{
  "AuthorID": "karody",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160936/profile",
  "Posts": [
    {
      "AuthorID": "karody",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160936/profile",
      "Content": "Feb 9, 2013 05:15PM karody wrote: I had stereotactic biopsy and I definitely had black ugly bruising that stayed there a long time.",
      "MessageIndex": 6,
      "PostDate": "09/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800221",
      "Title": "Bruising after biopsy aprilmommy0205 FilterLady"
    },
    {
      "AuthorID": "karody",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160936/profile",
      "Content": "Sep 27, 2012 12:20AM karody wrote: I would say the first month I had peach fuzz in an unusual pattern around the back of my head like a creepy professor.  By the second month I began to get thick soft gray (like a mouse)hair coming in all over.  It laid down pretty nice, though I did play with the color a bit since it was so strange anywany.  I think I was a good three moths out before I didn't wear my wig out professionally one day.  Wig was blonde bob razor cut at chin.  Real hair was about 1-2 inches with hilights and was styled.  A nurse exclaimed, \"What did you do to your hair?!?!\"  After a long uncomfortable pause, I smiled looked her in the eye and said, \"Cancer.\"  Oh I realized I could have softened that for her a little, but I bet she never askes anyone \"What did you do to your hair!? again.  And I have had several great laughs over her embarrassment! I am two and a half years out of chemo and my hair is long again, it reaches past where my bra does in the back.",
      "MessageIndex": 17689,
      "PostDate": "27/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "karody",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160936/profile",
      "Content": "Jan 16, 2014 02:55PM karody wrote: I was 35 and had long hair at diagnosis.  Lost every hair on every inch of my body.  My hair didn't start coming back in for about 2 months after finishing dose dense ACT.  It was a good 4 months out before there was enough hair to go without my wig in my sales job...and even then people were a bit shocked.  It was about an inch long and the color of a grey mouse.  The thing I really didn't expect was that my eyelashes and brows didn't really return until about 6 months out.  BUT...now I am four years out and my hair is long again, falls past my shoulder blades :).",
      "MessageIndex": 19901,
      "PostDate": "16/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "karody",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160936/profile",
      "Content": "Feb 10, 2013 10:41PM karody wrote: Your story looks identical to mine!  My daughter was reading over my shoulder and she thought I had written your post :).  So I guess I will celebrate three years right along with you!  I have long hair now and am more thankful for it than I used to be.  I am so happy to be still raising my own kiddos!",
      "MessageIndex": 32,
      "PostDate": "10/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797000",
      "Title": "Grateful! -Celebrating My 3 Year Anniversary as a Survivor CharlotteMe hmh23"
    },
    {
      "AuthorID": "karody",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160936/profile",
      "Content": "karody wrote: My neck is killing me.  But, to be fair, I have pain in my lower back all the time from congenital issues, so we know the spine isn't perfect.  Three weeks ago, I had upper respiratory yuck, then a week and a half ago I fell on the ice and developed a vomiting virus the same day which landed me in the ER for dehydration (CT of head was fine, definitely a virus or food poisoning). Next day my neck started hurting- bad.  After seven full days of vomiting/diarrhea my neck still hurts even worse.  Could be from congenital, fall, virus, ....or is it the devil sneaking up?  And who do I call- my back surgeon, my internist, or my oncologist? Dx 9/10/2009, IDC, 6cm+, Stage IIIA, Grade 2, 4/16 nodes, ER+/PR+, HER2- Chemotherapy 9/21/2009 AC + T (Taxol) Surgery 2/21/2010 Lymph node removal: Right, Sentinel; Mastectomy: Left, Right Surgery 2/22/2010 Lymph node removal: Right, Underarm/Axillary Hormonal Therapy 3/15/2010 Arimidex (anastrozole) Surgery 9/10/2010 Prophylactic ovary removal Surgery 9/20/2010 Reconstruction (left); Reconstruction (right) Radiation Therapy 10/27/2010 Breast, Lymph nodes Surgery 3/20/2011 Reconstruction (left): Nipple reconstruction; Reconstruction (right): Nipple reconstruction Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/816504",
      "Title": "How long do you deal with a new pain before calling the doctor? karody Denise-G"
    },
    {
      "AuthorID": "karody",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160936/profile",
      "Content": "Feb 12, 2013 01:03AM karody wrote: I was stage III and didn't handle chemo very well.  I was horribly anemic and neutropenic and have remainded neutropenic since I ended chemo in Feb 2010 three years ago.  I am on Arimidex and I have a lot of pain.  In spite of that I live a very active lifestlye, but I do get sick frequently because I am so neutropenic.  So what I am saying is I am sick all the time!  I have pain all the time!  How would I know if it were metastatic pain/illness?  I just went to the doc today for respiratory crud I have had a month and he put me on a third antibiotic.  He did order CBC CMP so would that show some major abnormality if there were tumors somewhere?  How would I know?  I don't want to live my life in fear Im going to die (guess what- we all will), I just want to have a grasp on what were other peoples signs or symptoms that led them to the mets, so I can figure out which pains are caused by being in a post menopausal 38 year old body and which ones are concerning. ",
      "MessageIndex": 1118,
      "PostDate": "12/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "karody",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160936/profile",
      "Content": "Feb 20, 2014 10:54AM karody wrote: I am 4 years out.  I still get those crazy nerve pains, too.  Sometimes for no reason, sometimes if my lymphedema is flared up it seems like I get them on my affected side.  Maybe the nerves are just rearranged in a way that they feel things differently.",
      "MessageIndex": 12,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/802784",
      "Title": "Sharp, jabbing zinger pain in reconstructed breast 1openheart Ariom"
    },
    {
      "AuthorID": "karody",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160936/profile",
      "Content": "Sep 13, 2013 03:22AM karody wrote: I have to say, I did find it to be fairly painful.  However, I tend to be difficult to get numb at the dentist and for anything local, so maybe that is why.  It doesn't take them very long.  You will have a golf ball sized bruise around the area where the needle went in and it will be sore for a few days.  All in all it isn't so bad, but the waiting is pure torture!  I am on friendly terms with the ladies at our imaging center and a friend asked me if I wanted to see the tissue they pulled out as I was leaving.  It was gold and lumpy and I knew....but still had to wait until the next day for the doc to call.  Sure enough cancer.  But mine was stage III and treatable with surgery, radiation, and chemo.  I am three and a half years out now, back to normal and have hair down to the middle of my back.  So 80% chance your biopsy will be benign, but if you fall in the 20%, there is still the likelihood that life will be perfectly normal after you get through treatment.  Keep your chin up.",
      "MessageIndex": 10,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/810773",
      "Title": "BIRADS4...Now what? freetobemebc pesky_LB"
    }
  ]
}