{
  "AuthorID": "Karz72",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
  "Posts": [
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Mar 11, 2015 12:34AM Karz72 wrote: Congratulations! Time to celebrate :-)",
      "MessageIndex": 32,
      "PostDate": "11/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829332",
      "Title": "NED!NED!NED! Iwillwinthisbattle steelrose"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Nov 26, 2018 06:43AM - edited Nov 26, 2018 09:52PM by Karz72",
      "MessageIndex": 2204,
      "PostDate": "26/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Jul 22, 2015 02:50AM Karz72 wrote: I think this might be my favourite topic :-) Brandall I get you about the vacation time, I'm taking dd off to visit friends in the Philippines & Australia for 3 weeks in August, & when we get back I will have only 8 vacation days left to get me through Christmas holidays & all the way to end March 2016! At least my credit card will have time to recover :-) Fabulous travel ideas everyone, whether near or far. A weekend getaway 100km away can be as good as 3 weeks of international travel if we look for the wonder.",
      "MessageIndex": 32,
      "PostDate": "22/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833462",
      "Title": "Travel! Please post your plans, photos and details here. starbrightlyshines Karz72"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Jan 9, 2018 08:33AM Karz72 wrote: Hi ladies, I've been on the forum for 3 years, but am a newbie to this thread. After my first round of chemo that was very successful I was back into running and loving my 10km races. Now about 18 months of steady progression while we race through hormone treatment options have severely dented any form of exercise programme! To be fair, the treatments themselves have been easier to bear (I could hardly walk on tamoxifen) but I feel physically and mentally exhausted all the time now, so much so that I pat myself on the back for just getting through a day of work and parenting my 8 yr old dd. A group of my friends have started a social running club, challenging each other to sign up for 5km and 10km races - of course I'm included because they're eternally positive and know how much I loved running before, but for now I'll be cheerleader rather than runner. A quick scan through your posts is inspiring me to keep on planning for getting those running shoes back on! With reference to the skiing & biking discussion, I stopped horse riding after diagnosis of extensive bone mets - figured that with running I'm moving slowly and am closer to the ground, so less chance of injury. As a single mom working full time, I can't add being incapacitated with a full body cast to my list of treatments :-) Horse is now a much loved and cuddled lawn mower and I can't say she's complaining about it. But I miss it a lot so can understand the need to keep on as long as you can. Enjoy!",
      "MessageIndex": 1486,
      "PostDate": "09/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Jan 11, 2018 06:57AM Karz72 wrote: Thanks Zarovka! Child's pose is my favourite yoga position - I'll keep the suggestion in mind ;-) Bloods & scans results are back and I start Carboplatin & Gemzar on Wednesday so will start planning an exercise regime around that. ~K.",
      "MessageIndex": 1490,
      "PostDate": "11/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "May 29, 2015 06:03AM Karz72 wrote: I am so proud of how my little one has coped with the upheaval my diagnosis & treatment has brought to her life! Her school had an outreach programme today with our local government school for underprivileged kids & I volunteered to help. Two good reasons - the feel good factor of feeding & playing with the visiting kids & getting to spend some time in class with my daughter. My work hours can be made up another time. Being only 5 & not understanding cancer, me losing my hair was a very big deal for my princess, so I've been very careful about always wearing my wig to school, especially since I was diagnosed just before she started at a new school & had to go through getting used to a new place & make new friends. Today, one of her little friends said she liked my hair (my wig does get so many compliments!) & Katy happily told her it was a wig because my hair fell out & she told me to show her friends how I can lift it up. They were amazed & she was happily laughing. Sad that this is something that is part of her life, but very happy to be her show-&-tell for the day :-)",
      "MessageIndex": 499,
      "PostDate": "29/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Apr 28, 2015 10:25AM Karz72 wrote: congrats springlakegirl & keep that positivity coming! I'm 4 MONTHS from diagnosis so need all the inspiration I can get - its a long long road ahead of me...",
      "MessageIndex": 6,
      "PostDate": "28/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830810",
      "Title": "4 years since stage 4 diagnosis Springlakegirl stagefree"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Mar 5, 2015 03:43PM Karz72 wrote: thanks Fujimama, good to meet you too :-) So glad to have found this community & expand my support.",
      "MessageIndex": 387,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Mar 27, 2015 01:47AM Karz72 wrote: Nothing like the love of a horse :-) not riding mine but getting lots of kisses. So happy that my daughter has inherited my love for horses & is far more fearless than I am! Kjones I also wish I could buy her her own pony...",
      "MessageIndex": 419,
      "PostDate": "27/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Jul 30, 2015 06:07AM Karz72 wrote: Ann I'm so sorry. Thinking of you & hoping the docs have a good tx plan lined up for you.",
      "MessageIndex": 530,
      "PostDate": "30/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Aug 15, 2018 08:39AM - edited Aug 15, 2018 08:40AM by Karz72 Sue2009 I had HELLP syndrome when pregnant which includes elevated liver function - emergency C section within 4 hours of onset of symptoms, so not much time to evaluate liver pain :-) but it wasn't a sharp pain, more a discomfort and tenderness and a feeling of severe indigestion. I've had liver mets since late 2017 and have felt no pain. Does yours hurt when you press on it or palpitate it? If you have bone mets it could well be a bone met in a lower right rib (same area as liver). When I started chemo when I was first diagnosed I had tumour flare in my bone mets and the sharp pain, hurts to breathe sounds very familiar. I was convinced I had cracked a rib and later scans showed fracture healing. I was put on bisphosphonates from the start too so they did heal relatively quickly.",
      "MessageIndex": 9454,
      "PostDate": "15/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Oct 25, 2018 07:56AM Karz72 wrote: Hi Bubblebeard, I don't have any answers for you. I can only say keep on breathing & keep on believing. I have a 9 year old daughter so I know the panic attacks the fear of leaving our kids brings on. And call your onc if your next appointment is a way away, that's the one \"benefit\" of being stage 4 - no one can accuse you of being a hypochondriac! thinking of you. ~K,",
      "MessageIndex": 10022,
      "PostDate": "25/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Mar 10, 2015 05:03AM Karz72 wrote: My mom has been here for the past 10 weeks helping out but her trip home (2 hours flight) has been booked for the end of the month after we see how I respond to Taxol. Onc has promised it will be easier to cope with than the cytoxan & ellence. Dreading it though, even with her help I have to make such an effort to have the energy for my little girl. I can see I'm going to have to manage my evenings a lot better & make sure school & work lunches & bags are packed else we'll never get out the house in time! I just seem to move so much more slowly. My little girl is wonderful & such a help when I need her to be, but it does make me angry - its not fair that a 5 year old should have to make allowances for a mom who can't do what she should be able to.",
      "MessageIndex": 392,
      "PostDate": "10/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "May 10, 2015 01:47AM Karz72 wrote: happy Mother's Day to all of you. Make memories & remember you're the best moms ever x",
      "MessageIndex": 473,
      "PostDate": "10/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Aug 21, 2018 04:20AM Karz72 wrote: oh Kaption that’s awful - sending love to you and her family.",
      "MessageIndex": 9502,
      "PostDate": "21/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Mar 17, 2015 06:02AM Karz72 wrote: Starbrightlyshines you're right - cuddle time is the best & doesn't require much energy :-) Getting lots of reading done with my little one. Good luck with your teens!",
      "MessageIndex": 401,
      "PostDate": "17/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "May 25, 2015 02:16AM Karz72 wrote: Stage IV from the outset - 6 months now although was probably there for at least a year. Almost done with chemo which is working well & looking forward to many years of maintaining happy stability. Little one is 6 & I want to be a grandmother so I have to stick around for 20 years plus!!",
      "MessageIndex": 47,
      "PostDate": "25/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831838",
      "Title": "How long have you been Stage IV? goldie0827 dormouse"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Mar 4, 2015 02:28AM Karz72 wrote: I'm a single mom of a 5 year old daughter & my biggest fear is missing out on her life & she is my greatest motivation to get to NED. It is so hard trying to explain things to her without frightening her. Life has changed dramatically in 3 months - my mom has moved in with us to help out (a good thing) & my hair has fallen out, I have very little energy for outdoor play, the topic of siblings came up & I had to explain that I wont be able to have any more children (hormone treatment plan is at least 5 years at the moment & I don't intend to start trying for No. 2 at age 48!). Thankfully I am surrounded by the most wonderful friends & family who entertain & distract her & her school has been so supportive. I'm keeping a diary & she will have that to read one day, but I'm far too positive about my prognosis now to start writing letters to her. The only way I know to keep any fear out of her mind is to keep it out of my mind. Here's wishing us all many many more years with our precious children.",
      "MessageIndex": 385,
      "PostDate": "04/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Mar 13, 2015 04:24PM Karz72 wrote: Kjones I understand so well - I feel so guilty about being too tired to play but by the end of the day I sometimes just want to curl up & cry I'm so exhausted. So difficult to find a balance. The beautiful soul of my daughter lights up my life though, can't imagine living without her or being gone from her life. Trying to appreciate every moment while maintaining as normal a life for her as possible. ",
      "MessageIndex": 396,
      "PostDate": "13/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Karz72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212109/profile",
      "Content": "Jun 5, 2015 06:54AM - edited Jun 5, 2015 06:55AM by Karz72 My biggest annoyance - people who shave their heads for the cause. Get over it. Come back to me when your baldness is a necessity to keep a step ahead of what might kill you. While its still a choice & your hair is still growing even as you're shaving, you have no idea what I've gone through. ",
      "MessageIndex": 18,
      "PostDate": "05/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832322",
      "Title": "Improving treatment for Metastatic BC? wiscgalsmile momallthetime"
    }
  ]
}