{
  "AuthorID": "Kasi",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
  "Posts": [
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Apr 16, 2013 04:50PM Kasi wrote: Does this make me #207?",
      "MessageIndex": 258,
      "PostDate": "16/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 1, 2011 10:24AM Kasi wrote: Hi Glenna - I hope you're feeling better! Did you call the on-call doc or your doc to be safe and let them know what's going on? Exchange is the surgery to swap out tissue expanders for saline or silicone implants. ",
      "MessageIndex": 1338,
      "PostDate": "01/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jul 8, 2011 03:51PM Kasi wrote: Hi friends! Nice to have a thread just for us \"noders\". I was SO DISAPPOINTED when I found out this week that there was node involvement. But alas, that is the situation. I had a BMX on June 27th and I've got expanders in. Drains come out Monday. A shower is going to be the best thing since sliced bread. Feeling great...it's weird to feel good but know I have \"the cancer.\" Hahahaha. Hope all you ladies are doing fab and here's to a great weekend! Kasi ",
      "MessageIndex": 1150,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jul 8, 2011 11:15PM Kasi wrote:",
      "MessageIndex": 1156,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 30, 2011 11:57AM Kasi wrote: Chrys - No way would I do the last one. I feel like I read somewhere that people who end up not being able finishing the last round still pretty much got the max benefit as if they did them all. etherize - I had extracapsular extention too so my cancer was prepping to break out (if it hadn't already - scary). CT & Bone Scan were clear but it's still so scary to think about. ",
      "MessageIndex": 1480,
      "PostDate": "30/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 4, 2011 02:34PM Kasi wrote: Michele - I had extracapsular extension in one of the two nodes positive. Freaks me out. But I'm getting aggressive treatment and rads so hopefully if any cancer cells broke out of the node, they are being demolished.",
      "MessageIndex": 1351,
      "PostDate": "04/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 20, 2011 01:32PM Kasi wrote: Pattyanne - I'm sorry about your diagnosis. I was also surprised that I had positive lymph nodes (MRI didn't show anything so the docs were optimistic I was node negative). But I am halfway through my chemo, still working full time, and still feeling somewhat normal. You can do it!",
      "MessageIndex": 1385,
      "PostDate": "20/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 28, 2011 11:12AM Kasi wrote: I had a macromet in one node and a micromet in one node and I am also being given the same treatment as some woment who are triple negative with node involvement. If I didn't have node involvement, I would have had just the 4 rounds of AC. Lucky me, I got to add on an additional 4 rounds of Taxol. It's always interesting to see those who have somewhat similiar stats get different treatment regimens.",
      "MessageIndex": 1455,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jul 8, 2011 05:41PM Kasi wrote:",
      "MessageIndex": 1154,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 4, 2011 07:30PM Kasi wrote: That's what the nodes are supposed to do...catch it!",
      "MessageIndex": 1354,
      "PostDate": "04/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jul 8, 2011 04:14PM Kasi wrote: Thanks Christine! I try to have a good attitude as much as I can - but not always! Ha! All the little worries and what ifs creep in. I don't have my EXACT treatment plan yet. My onc said if nodes were clear and margins were clear I would probably just do 4 rounds of AC but nothing was definite since we didn't have the whole picture. Boy was I PRAYING for that. Margins did end up being clear so I guess I can be positive about that. I'm guessing 4 rounds of AC and 4 rounds of T. But a new wrench has been thrown into the plan. Biopsy path showed HER2- and surgical path showed HER2 equivocal. Awaiting final FISH results. I might end up being triple positive. How are you doing?",
      "MessageIndex": 1152,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jul 14, 2011 11:36PM Kasi wrote: Just throwing this out there. I got two opinions on my treatment when I was diagnosed. Both said that even with a BMX, rads would be recommended for me if nodes were involved. I hoped among all hopes that my nodes were negative, but they weren't. I already have a consult scheduled with an RO on August 2nd and I don't even have a finalized date for starting chemo. I guess they are serious about those rads! Blah. That will be fabulous for my exchange surgery sometime in 2012.",
      "MessageIndex": 1261,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Oct 25, 2011 09:55AM Kasi wrote: TexasRose - Just like CarlyC, my tumor had lymphovascular invasion and one of the 2 positive nodes had extracapsular extension. The nodes were also a surprise. Docs didn't see any enlargement on MRI or US - although it was never a guarantee, I just figured I didn't. Sucked when I got that news. Now I am going in for chemo #7 out of 8 this week and I am fine. Worked full time throughout and I've even started running again after I started Taxol. Hang tight, I know exactly how you feel. ",
      "MessageIndex": 1511,
      "PostDate": "25/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Oct 1, 2011 02:35AM Kasi wrote: MOTC! That is so wonderful! Thank you so much for your post, I so much appreciate it.",
      "MessageIndex": 5,
      "PostDate": "01/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/775747",
      "Title": "Seven years ago today Member_of_the_Club Moderators"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jul 8, 2011 04:24PM Kasi wrote:",
      "MessageIndex": 138,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 3, 2011 08:58PM Kasi wrote:",
      "MessageIndex": 3,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 4, 2011 09:43PM Kasi wrote: Thanks, CoolBreeze, I really appreciate that. The waiting just really sucks and my head is spinning with the fact that most cases under the age of 35 are aggressive. Surgery, chemo, no hair...I'm just not ready for all that. My husband and I have a trip booked to Key West in October and all that I can think about is that we can't go now and I'll be forced to use my vacation time to be sick and having to go to work without any hair and looking terrible. I know this is all so shallow and stupid but I just feel like I was in the happiest place in my life that I've ever been and now it's all going away.",
      "MessageIndex": 9,
      "PostDate": "04/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 13, 2011 08:28AM Kasi wrote: marie5890, Lisa1962, Panmars - Thank you ladies so much! I stayed off the boards over the weekend and tried to keep my mind off of it. My onc nurse emailed me Friday and said to be cancer free this weekend, hee hee. Tried real hard but it crept back in yesterday. Since I only have half of the picture and no treatment plan yet, I am convinced that every ache, pain, or cough I have is mets. Just want all the info!!! Happy Monday to you all, hope you have a great day! ",
      "MessageIndex": 81,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 4, 2011 05:54PM Kasi wrote: Kayak2 I feel like a freak, I am already feeling SEs and it's only been a few hours after I finished my very first AC. I feel like I have the flu: headache, nausea. Taking the meds but what the heck? I didn't think I would be feeling so crappy so soon :-(",
      "MessageIndex": 249,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 11, 2011 06:16AM Kasi wrote: LindaF - I'm so sorry to hear about everything you've been going through :-( I am sending healing energy and thoughts your way!! My blood count check is today, I'm interested to see what comes up. But I can tell you that I am definitely NOT looking forward to my next AC on the 18th. The idea of most foods to me is still yucky and I'm forcing myself to drink raw vegan protein shakes just for sustenance. I've never felt this way about food for such an extended period of time. Madismommy - I am just trying not to think about the WBC and fever thing and hope for the best. As hard as it is. I'm not going to lie, though, I take my temp almost every day just to make sure I don't have a fever! Chava - Good luck tomorrow!! Aimska - Good luck today!!! Thinking of you! Robyn - Sorry you are here but glad you are (does that even make sense?) :-) Is your first treatment tomorrow? Michelle - Thanks for the well wishes! HUGS TO ALL OF YOU!! I hope everyone is well and you are all on my mind. I would write more but I am running late for work!! :-) I think a couple people asked if others are working during chemo. I definitely am but my work is cool and they let me work from home when I need to. I worked from home the Friday and Monday after my infusion and went back into the office this past Tuesday. That will probably be my game plan throughout, fingers crossed that I don't get too sick! Have a great day everyone! ",
      "MessageIndex": 442,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 11, 2011 08:29AM Kasi wrote: Good luck today Roxx, Dianamaps, 46MD, capinva, chava, cupcakies, Justina, Kim, Roxessence, Tsb1 & Aimska!! Michelle, you are wonderful for putting together a master list. I will definitely PM you for it. :-) Glad you had a better sleep! Robyn - Sounds like you are plenty stocked up! I was eating dry toast with a little bit of natural PB, that was the only thing I could stomach. It's also good that you have a variety of drinks - water wasn't cutting it for me afterward. They gave me Ativan in my IV and as a take home med and I heard a chemo nurse say that she knew someone who couldn't even come into see her until he had popped an Ativan beforehand, so you are prob ok to take something like that before.  Chrys23 - I take Claritin  every day for my allergies and I didn't have any side effects from the shot. I also cannot give shots to myself but when the nurse gave it to me last week, it looked really easy. A quick pinch in the upper arm and it was over. vtEllen - I'm so sorry that you are homebound but I got a laugh out of you going around with your Clorox wipes. I'm anxious to see what my counts are today. :-( I hope that yours rebound quickly. Guys, I am so dreading losing my hair. I keep playing with it in the mirror and savoring my last days with it, I love it so much. It's going to take years for it to get back to the length it is right now. Sometimes I second guess my decision to not try the Penguin Cold Caps. I better get EVEN BETTER HAIR growing back after this! ",
      "MessageIndex": 454,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 11, 2011 10:44AM Kasi wrote: Good luck Yvette!!! Hoping and praying for the same for you!!! Question for guys - Are you paying a copay when you get your chemo? When I went for my first treatment last week, they charged me a $30 copay for an office visit. I talked to my insurance and they said it should be considered \"treatment\" and not an \"office visit\". I have to go back today for my bloodwork and I wonder if I have to pay again. If I have to keep paying a copay, that's $120 a month! ",
      "MessageIndex": 474,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 11, 2011 02:48PM - edited Aug 11, 2011 02:49PM by Kasi Well, my WBC is at 1300. Boooo. No fever but now I am paranoid and feeling kind of worn out. I didn't realize that it took a week or so for the Neulasta to kick in. Madismommy - Glad you came to a decision! Personally, I would have done the same thing. Michelle - Hope you feel better soon. Chrys & Yvette - So cool that you guys got to meet each other!  Hugs to all of you!!! ",
      "MessageIndex": 486,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 15, 2011 05:30PM Kasi wrote: Doodlebug & Summergirl - If it helps, my age (31), grade of my tumor (3), and 2 out of 5 positive lymph nodes solidified the fact that I was getting chemo. They said there was no point in me getting the test, chemo is what I would be getting. Michaela, I'm sorry you've been feeling so awful, I am glad you are feeling a bit better! And Summergirl, yes, the PS will go through the same incisions to exchange the turtle shells for the implants. Peachy-pie - I know what you mean. Chemo seems the suckiest to me. I breezed through surgery and I am not worried about radiation. It's the chemo. If it helps, I am working full time although they do let me work from home when I am not feeling up to snuff (2 days after chemo and one day last week when my white blood cell count was low and I didn't want to be around germs). Leighsa - Good luck on the oncotype test!!!  Dogmom - I'm sorry about Hercules. It sounds like he saved your life. Dogs are such angels. Mine are definitely helping me get through this. My girl, Pebbles, is my protector. She did not leave my side when I was laid up from surgery. One day I would definitely love to foster if me or my husband works from home. And definitely get a third dog. That's awesome that you have 3, vtEllen!!!",
      "MessageIndex": 655,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 15, 2011 06:09PM Kasi wrote: Ellen! Is it starting to come out? Are you 13 days out from you first treatment? I am 11 days out and waiting...so far nothing.",
      "MessageIndex": 658,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 16, 2011 10:11AM Kasi wrote: Yes, welcome to our group meholly, mommyx2 and Pamela!  vtEllen - The Biotene is like, too sweet for me or something. I woke up in the middle of the night with dry mouth, went to the bathroom and swished it around and was not happy about the taste. Maybe it's just me? YaYa5 - I have also read that about the ice/frozen veggies for nails. I also read that is can help prevent neuropathy if you have the ice packs on the soles of your feet and palms of your hands, which I am so concerned about when I have to do my Taxol rounds. I mentioned it to the nurse but she acted like she had never heard of that, but I'm still going to do it. Regarding node removal, I had 5 taken from my right side and I can no longer have blood pressure or blood draws on that arm, I guess forever, due to the LE risk. There are just way too many things to worry about with this CRAP! ",
      "MessageIndex": 687,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 17, 2011 09:39AM Kasi wrote: Grimbol - Hee hee! I say we just scrap the whole experience, eh? But I have read the same - it's cumulative so it only goes downhill after the first treatment. As always, though, it's definitely not the same for everyone - that's usually where I hang a lot of my hopes. ",
      "MessageIndex": 741,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 17, 2011 01:52PM Kasi wrote: Mary - Thanks for checking in and letting us know you are after #2. I get AC #2 tomorrow. Feeling kind of headache-y and worn down today. I hope my WBC count rebounded - I kind of feel like I did when it was 1300 last week. And I did have the Neulasta.",
      "MessageIndex": 753,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 18, 2011 07:45PM Kasi wrote: Hi everyone! Finished #2 around 3 pm today. Since I had such a rough go right after my first infusion, we decided to do the Ativan in my IV last (last time, the steroid and all the antinauseas went first). As soon as I got home I took a Zofran. Took my steroid at 6. Took a nap. Happy to report, NO NAUSEA! I just feel kind of tired and heavy. So much better than last time!",
      "MessageIndex": 807,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 1, 2011 08:56AM Kasi wrote: Capinva & Karebear - Good luck today! I'm going for AC #3 this afternoon!  Madismommy- Ahh, yes, the wig. It's been a bit of a process. The one they ordered for me...sucks. It looks very dry and over processed. Like I've never heard of conditioner before. They are ordering me another one which I should have on Wed. Thankfully! It's hard enough to be bald but then walking around with a wig you don't like. No good. I hate people think that I did my hair this way on purpose. LOL. ",
      "MessageIndex": 1247,
      "PostDate": "01/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 2, 2011 08:18PM Kasi wrote: Chrys - Thank you!! #3 went well yesterday, uneventful. 5 more to go!!! Feel somehwhat decent today, did an hour walk with my dogs this morning, worked from home, went for my Neulasta. Took a nap. Aside from the steroid, I didn't need any other pills today! I hope this continues. Hope you're feeling well! isa702 - Thank you so much! So far, so good! We're getting the same regiment! How are you feeling? Diana - I'm sorry that your daughter cried :-( I hope she's doing better now. About the Taxol shortage, I asked my doctor and she said that I will be getting mine, it hasn't affected their supply. Hugs to all of you, I hope you're all doing well!! ",
      "MessageIndex": 1305,
      "PostDate": "02/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 13, 2011 01:43PM Kasi wrote: ukgirl - I'm so sorry that you've been through all these medical issues. But I think this just means that you are an ass-kicker and you will kick BC ass, too! Chrys - You're very welcome! It did work for me, I was so tired of having to go into the doctor's office and give a sample when I KNEW it was a UTI every single time. I wanted to get rid of them for good. I'm so sorry about all these SEs!!!! You made me laugh with \"mother-father\"!!!",
      "MessageIndex": 1510,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 14, 2011 08:00AM Kasi wrote: I HATE WEARING A WIG! That is all. ",
      "MessageIndex": 1533,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 14, 2011 08:59AM Kasi wrote: Hi Sweeney - Thank you so much for the encouragement!! It helps knowing that there is a light at the end of this chemo tunnel! <3",
      "MessageIndex": 1539,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 20, 2011 12:02PM Kasi wrote: Vivie - Hope you're recovering from Weddingpalooza! I agree - whenever I think about chemo or the smell of the hospital or the steroids of anti-nausea meds, I get nauseous. YUCK!!!",
      "MessageIndex": 1699,
      "PostDate": "20/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 26, 2011 02:32PM Kasi wrote: Thank you, Yvette!!!  Yes, you are ALL welcome in my time machine!  ",
      "MessageIndex": 1815,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Oct 5, 2011 02:53PM Kasi wrote: Thanks for making me feel better, you guys! I wish that somehow magically we could all be in the same place while we were going through this! OK, Summergirl, are you kidding me right now with the no spray tan because of lymph nodes removed? What??? Why??? Like, you can't have a technician spray you? Or the spray tan booths? I guess this will be another thing that I will throw caution to the wind to, because I love spray tans! Argh! FUGLY disease is so flippin' right! Jennifer, Michelle & vtEllen - glad I am not the only one with the stupid hyperpigmentation thing. I read online that it could be a side effect. When I whined to my onc about it and complained about how ugly it was, she just kind of looked at me and said \"Hyperpigmentation is a side effect\" and that was the end of that! No sympathy from her, LOL!  Michelle - I'm so sorry about your friend :-( vtEllen - Ugh, I have a hard time biting back the \"Yeah, RIGHT!\"s when people say I look good. Give me a break, I know I don't look good. I know people mean well but... Taylor - The Rad Onc told me that the school of thought on rads with women who have had mastectomies has come back around again. I guess they used to do rads on everyone; then the thought changed and people with mastectomies and only 1-3 positive nodes didn't need it; now it has changed back to the way it was before. He said he would talk over my case with \"the Board\" but felt confident they would all agree for me to have rads, at least 28 with a possible 5 more \"boosters.\" He said with the tissue expanders, he might forego with boosters. But I don't think this is something that is necessarily US vs Canada; all the docs are different. I met another woman on here in the US who went through all of this last year and she was just like me: double mast and 2 positive nodes and she was not given rads. I'm glad to hear that some of you haven't really had nail issues! Hurrah! ",
      "MessageIndex": 1969,
      "PostDate": "05/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jul 26, 2011 05:55PM Kasi wrote: Hi Mary! I had my port put in last Thurs the 21st. I thought I would be starting chemo this week but I think they wanted to wait a bit for the little port surgery to heal. But I have also read that some people had chemo right after the port placement (even the next day) so everyone is different. The port surgery wasn't bad, I was sore for a couple days but 5 days later it's fine. Congrats on your daughter's wedding! Hi Damaris! Sorry you have to join us but happy that you are at the same time!  I am so ready for us to win this battle!",
      "MessageIndex": 12,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jul 27, 2011 06:13AM - edited Jul 27, 2011 06:14AM by Kasi Hi Madismommy! I also my chemo training last week and I felt like I already knew everything from all the research I had been doing. It was kind of a general class and I was the youngest one there and the only one with breast cancer. I asked the nurse who taught the class some specific questions after it was over but she couldn't really answer them fully because she doesn't typically work with breast cancer patients in her rotation and referred me to my MO's nurse. I mean, it was a decent class but I didn't feel like I learned anything.  Good luck on deciding on the clinical trial! I hope you're healing welling from the AND and have a great day! ",
      "MessageIndex": 15,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jul 26, 2011 05:48PM Kasi wrote: If 60 is the \"technical\" administration age, can you still ask your doctor to prescribe it? Even if it's not covered by insurance, I want it! I start chemo next week (and I'm 31).",
      "MessageIndex": 6,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/772124",
      "Title": "SHINGLES!!!!!!!!! vivirasselena gale1525"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jul 27, 2011 06:07AM Kasi wrote: Thanks Michele! I will ask about the Valtrex too, I really appreciate it your response. Have a wonderful day! <3",
      "MessageIndex": 8,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/772124",
      "Title": "SHINGLES!!!!!!!!! vivirasselena gale1525"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 3, 2011 08:40AM Kasi wrote: Ugh, Michele I'm so sorry you have had to go through it. I am so paranoid about getting them now. I start chemo tomorrow. I called last week and asked about getting the vaccine and they said that wasn't usually a standard part of their protocol and that they \"rarely\" see people in my age group come down with it (I'm 31). If it comes on, they will give me stuff to get it under control. But come on, \"rarely\" means nothing to me anymore. All I can do at this point is hope like hell I don't get them. Grrr.",
      "MessageIndex": 17,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/772124",
      "Title": "SHINGLES!!!!!!!!! vivirasselena gale1525"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 3, 2011 08:34AM Kasi wrote: GOOD LUCK TODAY VtEllen and Edyorest! And I hope everyone else is having a great week and anxiety is low! I start tomorrow (Aug 4th) - anyone else that day? Red Devil, here I come! I've been meditating lately and thinking healthy thoughts like \"I am strong\" and \"Chemo won't take me down.\" I hope that it helps. It stinks so much because I feel so healthy and good right now. It's hard to imagine 4 months of not feeling good. I've rarely been sick in my life. ",
      "MessageIndex": 190,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 3, 2011 09:53AM Kasi wrote: michelleo13 - Thanks for the luck! We are getting the same regimen :-) aimska - I'm really glad I decided to go that route for my hair. It's supposedly made for a bald head so that it will look as natural as possible and stay on well. But I know that it will still feel weird. The other sucky thing about it though is that it is EXPENSIVE. My insurance kicked in $500 but that doesn't even cover half. Oh well, I guess having a savings account is overrated :-) ",
      "MessageIndex": 198,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 3, 2011 10:20AM Kasi wrote: aimska - holy CRAP! $3000? Mine is $1200. It's a lot but my husband is so nice, he wants us to pay for whatever is going to make me feel the most comfortable. I would NOT have paid $3000 though, that is for sure. That is insane! Maybe the fact that I'm in Maine keeps the cost down a bit. Yikes. Don't regret your decision, I wouldn't have done it either for $3000. Oh, and thank you for the tip. I am a chapstick junkie. I use Alba organics. I can't wait til this stuff really starts drying my skin out and I'm already dry to begin with! muscialmom - Sorry to hear about what happened yesterday! 6 days doesn't sound too bad, though, so that's a good thing! Good thoughts to have it all behind you by Christmas! ",
      "MessageIndex": 202,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 4, 2011 08:13AM Kasi wrote: Congrats edoyrest and vtellen! Hope you're feeling good today. I'm scheduled for my first round of A/C today at 12:30...",
      "MessageIndex": 226,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 11, 2011 08:36AM Kasi wrote:",
      "MessageIndex": 455,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 12, 2011 08:33PM - edited Aug 12, 2011 08:34PM by Kasi I am so in on a celebration cruise! Go Team August 2011!! We are gonna kick butt!!! :-) Robyn - glad you're doing ok! Yeah, the actual infusion didn't seem like a biggie to me. It's when I got sick that sucked! I think you'll be happy with the Port. I asked for one and I am glad I did. I didn't want to deal with all the needle sticks in my arm. I've had my port for three weeks and I don't even notice it now and it doesn't bother me sleeping or anything. Capinva - That's so great that you had no nausea!!  Michaela - Keep kicking ass, girl! I love it! Justina - How did work go today? I agree about the zombie feeling; the steroids didn't really pep me up either. vtEllen - Just reading your comments about the things your doc said. I agree, I need honesty but not brutal honesty. And that's so cool that you had a store! Do you think you wil reopen at some point? eekwine - Glad it went so well for you and hope you are still feeling good! I'm no longer scared to go and get the chemo, just scared of being sick after :-( Amelie - who knows if what I read is true about the Neulasta. It was on a different board somewhere. :-) I still havent had any specific pain from it and I had it a week ago. I also take Claritin for allergies every day anyway, so maybe that had something to do with it?? This is also my last weekend with hair, sister! Think I'll curl it with hot rollers this weekend... Summergirl - Don't stress too much about your first treatment. Easier said than done, obviously. But it should all go really smoothly for you. You can totally do this! Hugs to you all, have a fabulous weekend, friends! ",
      "MessageIndex": 562,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 14, 2011 06:21PM Kasi wrote: Welcome to the group Mrfielder & IslandGirl5! Summergirl - I'm glad you're feeling better and had a great day today, you deserve it. Sorry about the nerve pain :-(  Man, I feel so good this weekend - other than a little bit of fatigue, I feel like my pre chemo self. I think the neulasta kicked in yesterday, my knees and back were a little achy but no big deal. Ugh, it sucks to feel so good and know that my next treatment is on Thurs. Day 10 from first treatment and my hair is still intact. My appt at the wig place is on Friday. By then it should be coming out at a good clip :-( You're welcome from the info! Got it from chemocare.com and livestrong. :-) Yes! An overnighter and a cruise please! Need some fun things to look forward to.",
      "MessageIndex": 615,
      "PostDate": "14/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 15, 2011 02:18PM Kasi wrote: Dogmom, My husband and I have been thinking about fostering but I'm so afraid that I will get attached and want to keep them. Right now, we really only have time for the two sweeties that we have; we both work full time out of the house, but that may change in the next year. I am always considering Dog #3 though! ",
      "MessageIndex": 642,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 15, 2011 05:35PM Kasi wrote: Grimbol - I had fluids the next day, too. When I went in for my Neulasta, I had the \"a truck just ran over me\" look and they gave me another anti nausea and fluids for a couple hours and I did feel better, although I felt like I had been drinking a ton!",
      "MessageIndex": 656,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 24, 2011 03:31PM Kasi wrote: Hi guys - I'm so sorry I have been so MIA for the last week! I know there are a ton of new great ladies to welcome to the group and well wishes to send out to my fellow warriors going through treatment this week and \"get betters\" to send to the rest of us feeling the aftermath of Hurricane Chemo. LOL. Michelle, I'm so sorry about your friend   So...my hair. It's gone, the hair replacement place shaved it off on Friday. I have taken it really hard. Today is the first day I dared to go to work. The wig is really difficult for me to get used to, as well as the reflection of the bald alien I see in the mirror. I'm not in love with the wig and I feel like it looks really obvious. Le Sigh. ",
      "MessageIndex": 1006,
      "PostDate": "24/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 25, 2011 04:07AM - edited Aug 25, 2011 04:09AM by Kasi Thanks guys for all your support, you are all so nice! Thank you summergirl, you are so sweet! I walked my dogs in the neighborhood this morning for the first time with just a scarf on my head. Granted it was still semi-dark but I am making strides, hahaha! I go in for my blood counts today. I am DRAINED and my nose does not stop running. It is SO ANNOYING!!! Have a great day everyone!!  ",
      "MessageIndex": 1024,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 25, 2011 12:19PM Kasi wrote: Michelle - I hope that you feel better :-( Thanks, Aimska, that is really great advice! LOL :-) ",
      "MessageIndex": 1034,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 30, 2011 11:28AM - edited Aug 30, 2011 11:29AM by Kasi madismommy - Oh, I'm so sorry about your daughter! Poor thing :-(  summergirl - Hi! I am adjusting OK. I am actually getting another wig ordered for me because the one I originally got does not match my hair's texture. Totally wrong. It looks dry and overprocessed so I went back to the wig place and they agreed and have ordered me another one. That was half the problem. But looking at myself in the mirror bald is hella creepy. Taylor - AC is *supposed* to be tougher. They say Taxol is easier but who knows? With Taxol I guess you have to worry about neuropathy. It's in the same family as Taxotere but the side effects are possibly a little different...? vtEllen - Glad you are feeling OK today, minus the early bone pain. That's great that your counts went up on their own!!! Chrys - I know, I am doing the mani/pedis at my own peril. I just can't have every girlie thing taken away from me. I always have nice nails and I will continue to do so :-) I go once my WBC count has rebounded. ",
      "MessageIndex": 1200,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 31, 2011 07:44AM - edited Aug 31, 2011 07:47AM by Kasi Hi Diana - Big HUGS to you!!! I know exactly how you feel. It's such an emotional roller coaster. And chemo is SO DIFFERENT from surgery. Not to jinx myself here, but surgery for me was a breeze (BMX with TEs). I recovered pretty quickly and healed up well. The TEs don't even bother me. But with chemo I don't know what to expect each time. Plus, the hair loss is a constant, physical, visible reminder that we're going through it. I really feel that the hair loss is the hardest part; way more so than my chest. It SUCKS so bad!!! My onc said that the emotions are also a big part of this process. You're doing great, we're all doing great, and we WILL get to the other side of this. We WILL get our lives back. I know it, even if it doesn't seem that way right now. <3 Kasi ",
      "MessageIndex": 1223,
      "PostDate": "31/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 7, 2011 11:55AM Kasi wrote: Hi everyone! I just wanted to say hi and give you all hugs. I wish I had time to respond to everyone individually. I think of you all every day as we go through this journey. It just has to get better, you guys. It has to and it will! That is what I tell myself every day. Love to you all!! <3  ",
      "MessageIndex": 1385,
      "PostDate": "07/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 9, 2011 01:16PM Kasi wrote: ukgirl - yep, we are on the same regime, almost down to the day. My last one is Nov 10th. Cannot get here soon enough! vtellen - Ooh, I'll have to meet you down in York. I don't get down there often enough :) For y'all with the back pain, I got it too but mild - felt like period cramps. I think it's from the Neulasta. If you guys are getting Neulasta I would guess that would the culprit. ",
      "MessageIndex": 1445,
      "PostDate": "09/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 12, 2011 11:48AM Kasi wrote: Welcome Missey29! I think it's great that you've already been wearing your wig - I wish I had been able to do that to mentally prepare myself of what it would feel like to be out in public with a wig. It took awhile for me to get used to and I still don't like it. Dreaming of the days when my long hair is back again, LOL! Hope #2 goes well for you! Mary - We are on kinda similar schedule. AC #4 on Thursday and then Taxol but I am getting it dose dense 4 times. I am going to buy some L-glutamine and B6 complex before Taxol starts. I want to pre-empt any neuropathy. I'll have to see what my onc says about taking them (some say ok, some say no) but I will try to fight for it if she's not on board. All set with numbness in my extremities. vtEllen- So funny you mentioned Grace Potter and the Nocturnals. One of my coworkers was talking about them this morning. I've only heard of them, never heard the music, I'll have to check it out. ",
      "MessageIndex": 1489,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 12, 2011 12:30PM Kasi wrote: lstreett - Thank you, good to know! I am going to ask her next time. What was the dosage your onc recommended for each of them? I am DEFINITELY all about hoping that the Taxol is better than the AC! And we're almost done with the red devil - yay!",
      "MessageIndex": 1491,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 12, 2011 02:31PM Kasi wrote: Thanks lstreett! I will be looking into that. I heard that the l-glutamine is expensive but it's worth it to me. Crystal - So sorry about the UTI, I am glad you are feeling better! OUCH! I used to get UTIs like mad and did the whole antibiotics route with them but they always came back. I found out that antibiotics don't always get all of the bacteria, hence the recurrence. I tried this thing called D-Mannose...it's a natural sugar that washes out any clinging bacteria. I took it after my last UTI, it cleared it up and I never had one again. No joke. My last one was in 2003. Something to think about just in case it comes back (and I hope it doesn't): http://www.amazon.com/Now-Foods-D-Mannose-Powder-3-Ounce/dp/B000HCMK90",
      "MessageIndex": 1495,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 13, 2011 05:16AM Kasi wrote: GOOD LUCK TODAY TAYLOR777 and anyone else going through treatment!!!!!! Hmmm...the sex thing. The hubs and I have had sex a few times since I started chemo. I don't exactly feel attractive (AT ALL. Hi, I'm bald and my chest has lovely scars!) but I love my husband so I just get my mind in it and then I always end up enjoying it after all even though I am hesitant at first. Lube is my friend now.  ",
      "MessageIndex": 1502,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 21, 2011 11:19AM Kasi wrote: Chrys - Your doc saying the next dose of taxotere might be \"problematic\" is, like, the understatement of the year, LOL. In my experience, the red devil has done this to me: MAJOR FATIGUE, sore throat, flu/achy like feeling, nose running 24/7 non-stop (that could be the Cytoxan though), mouth feels \"tight\", most things taste like crap, especially water which I can't even stomach right now, headaches, nausea (Zofran takes care of this for me)... ",
      "MessageIndex": 1729,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 26, 2011 03:35PM Kasi wrote: vtEllen - Thank you so much, you are way too sweet!!! Hop into my time machine, LOL! :-)",
      "MessageIndex": 1817,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jul 26, 2011 12:19PM - edited Jul 26, 2011 12:22PM by Kasi",
      "MessageIndex": 9,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 4, 2011 08:18AM Kasi wrote: Thank you Letlet! I had read that you got them after you were done your chemo and we're pretty much the same age. I was annoyed when the nurse told me that people in our age group rarely get them, because I know it happens. I will definitely be on a diligent lookout for those buggers.",
      "MessageIndex": 23,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/772124",
      "Title": "SHINGLES!!!!!!!!! vivirasselena gale1525"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 5, 2011 03:15PM Kasi wrote: @carpediem - Thank you so much for that! I really need that reminder to stay in the moment and not jump ahead. I've literally ran through every scenario and cried at each one. It's so easy to just crawl into bed and hide but I am trying to be strong and wait for the results and get the plan and then go from there.  @barbe - Thank you, thank you! I'll take all the hugs I can get right now! I hope you've been enjoying your weekend.  @CoolBreeze - Hugs to you, I'm so sorry to hear about your recent news :-( Yes, I need to stop imagining the worst. I've already booked all of our Key West excursions and it's all about the water: parasailing, jet skiing, and snorkeling and I'm like \"How can I possibly go on a trip and do it all without hair?\" I have a flat spot on my head and I look terrible with short hair. Then I get mad at myself for being so silly about something in the grand scheme of it all isn't that important. Thank you so much for your response. @bdavis - You really went to St. John during chemo and all was good? That still gives me hope, thank you. Just trying to get over the vanity factor of it all. And you got promoted at work??? You rock, girl!!!!   @Veda - Thank you for the encouragement snd hugs and good vibes!  I will take them all :-D At the end of this whole thing, a vacation probably will be in order. Working on one hour at a time ",
      "MessageIndex": 16,
      "PostDate": "05/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 6, 2011 10:00AM Kasi wrote: All of you, thank you so much for your kindness, support and encouragement! @CoolBreeze - You are so right, I always have a choice. I got up today and got myself to work - no other choice but to be as normal as possible. I am so grateful for what I do have - an amazing husband who has been so strong for me and absolutely wonderful - he's always been like that for me. And my parents, I don't know what I would do without them and my good friends. I really don't have much to feel sorry for myself for. I was already looking at the Penguin Cold Caps, thanks so much for the tip! Let me know if you do end up trying out the full lace wig. Have a fabulous day! <3 @bdavis - That makes me so hopeful that you didn't have a problem snorkeling or anything like that. We usually end up in the Caribbean or somwhere around there each year and I really don't want to miss it if I don't have to. You are so amazing, thank you so much, Happy Monday! <3 @marie5890 - Your words made me cry, thank you so much! I'm due to shed my vanity anyhow and do hope that I will see the true beauty, I really do. I hope you have a wonderful day! <3 @Lisa - Thank you so much for keeping me in your thoughts and prayers, it means the absolute world to me! All of you have helped me so much already. I hope you have an awesome day! <3 @Mai - The little distractions do help, don't they - even though there is that horrible nagging in the back of your mind. The worst for me is when I wake up in the morning and there's that split second where you don't remember and then it all comes back that you're waiting for the results. Let's keep the distractions going and please keep me posted on your news on Wednesday! <3 @mdg - Thank you so much for your kind words! I am hanging on to hope - but I've always been the type of person to go to the worse case so I can be prepared ahead of time. Not the best personality trait and it's caused a lot of excessive worrying over nothing but I just wanted to read and be more informed this weekend. This board has been tremendous. Thank you so much for saying a prayer for me. I hope that you're having a great day so far and a big hug to you too! <3 ",
      "MessageIndex": 24,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 7, 2011 09:24AM Kasi wrote: Thank you all so, so much for all your kindness and support and helpful information. I will def check out the blogs and links. I would respond to each and every one if you personally but I'm just kind of a wreck right now. I have an MRI scheduled for Thursday and have an appt at the breast cancer center this afternoon to go over the pathology report. My husband and parents are coming with me and I'm getting my questions ready. Love to you all, thank you so, so, so much. <3 <3",
      "MessageIndex": 48,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 10, 2011 09:02AM Kasi wrote: Hi Emaline - Thank you so much reaching out! I'm not sure yet about the cold caps. Will definitely be asking when I meet with the oncologists. The oncology nurse that I did initially ask kind of poo-pooed it so we'll see!  - have a great day! @ lrr4993 & @ cathmg - sent you guys a PM with questions - thanks so much! I hope all of you have a wonderful weekend!!! <3 ",
      "MessageIndex": 77,
      "PostDate": "10/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 13, 2011 03:40PM Kasi wrote: Thank you so much, you guys! You know what's kinda funny? I would definitely get a second opinion no matter what but my insurance actually requires it and they urge people to go to Boston. I have an awesome case worker at my insurance co. who is also a nurse and we've spoken almost every day. So I am so thankful that I have someone helping me coordinate all this stuff without trying to fumble through it on my own. My PCP's office is no help. It wasn't my actual PCP who gave me a verbal confirmation of the dx on the phone (I guess because she didn't actually see me when I got the lump checked - she was busy so I just saw whoever was available that day), it was another doctor in her group. And he said \"Sorry for the bad news...bummer.\" ",
      "MessageIndex": 88,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 22, 2011 08:35AM Kasi wrote: You guys are all so nice and supportive, thank you so much! My BMX surgery is on Monday - yikes! But even though I was freaked out when I went to the PS last week, I am still confident in my decision. I know I don't have to do a double, but might as well have 'em both look messed up than one is my thought. Plus I would be living every day wondering if I would get cancer again in the remaining breast - can't take the agony. I was a hypochondriac as a kid and now it's back in FULL force. I've already had my bone scan and echo this week and I'm heading for my CT in a few minutes. Ah, the joy of trying to work and go to a GAZILLION appointments. Ha! And now that I am going to all these tests, my anxiety level is on high, thinking there is going to be more bad news. Blah. But I love all the positive messages from all of you letting me know that the treatments weren't as bad as you thought they were going to be and you went to work and worked out and all that good stuff. I know I will be that way, too, I just know it. And Patriotic - I had open heart surgery when I was 3 years old because I had a hole in my heart. So I thought I was done with surgeries for the rest of my life. That's why I'm not considering the DIEP or anything similar. I know that the implants won't look as natural but my mind just couldn'go to a longer surgery and all that good stuff. Have a great day everyone! ",
      "MessageIndex": 112,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 3, 2011 08:47AM Kasi wrote: Hi Madismommy719. Good luck tomorrow with the wig shopping! I went to a \"hair replacement\" place and am having a real hair wig made for me to match my current color, texture, and length as much as possible. I am scheduled 2 weeks after my first chemo treatment to go back in and they will shave my hair off, get my wig styled and ready to go, and show me how to take care of it. They told me that when I come in that day, I will walk in with hair and I will walk out with hair. That put me a little more at ease but I still hate the fact that I just can't keep the hair that I have now :-(",
      "MessageIndex": 193,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 11, 2011 08:43AM Kasi wrote: Thank you, Jenn!!! HUGS right back at ya!!! I know it's only hair but...IT'S OUR HAIR! At the risk of sounding super vain, I really do love mine, I loved it even before this whole ordeal. It does what I want it to. It's long. It's got a bit of wave to it and it holds curl really well! *sigh* ",
      "MessageIndex": 457,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 11, 2011 09:31AM Kasi wrote: Thanks you guys for the support on the hair trauma!!! But it grows back...right?!?! Madismommy - I had my first AC last week (Thurs). I went in cocky and figured it wouldn't touch me (well, not quite that cocky!). The actual infusion was completely uneventful. My Mom and best friend were there, we just talked the whole time. I sucked on ice chips. Got home and felt sleepy so I took a nap. I woke up from my nap about 3 hours after my infusion was over and I felt sick as a dog. Headache, nausea, diarrhea. Didn't throw up but I could have; I consciously made myself not so I could keep the meds down. Called the on-call doctor and asked if I should be feeling so sick so soon. He said not usually but everyone is different. Took all my meds and upped the amount of Ativan as the doc suggested. Slept off and on throughout the night. Woke up Friday a bit better but still queasy. Kept taking the meds as I was supposed to. Drove myself and my Mom to get my Neulasta shot. They ended up giving me fluids there because I told them I had diarrhea. I didn't really think I needed fluids because I was drinking so much water. But the fluids made me feel better. Friday night I drove and picked up my bro from the airport. I had no bone pain from the Neulasta. Saturday, Sunday, Monday I was ok. Didn't feel like myself but I wasn't bed bound. I walked the dogs and did yoga each day. Tuesday I felt like myself again. The only thing that is lingering is my distaste for food. Hope that helps! ",
      "MessageIndex": 471,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 11, 2011 03:26PM Kasi wrote: And Robyn - thank you so much for the compliment on my hair! I found out that I will have to pay $30 every week during my chemo because I see the doc or NP each time so that's an \"office visit.\" This treatment stuff cannot be over fast enough. ",
      "MessageIndex": 492,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 12, 2011 11:11AM Kasi wrote: DogMom - glad you feel OK today! ukgirl - That is so funny! Same D-day and same WBC. I thought that the neulasta kicked in right away but my NP said it can take 7-10 days. She said my counts were what they expected them to be at 7 days after treatment. I didn't have any neulasta pain either. I read somewhere online that the neulasta kicks in WHEN your WBC is low and some people would actually feel achy when the shot was doing its work. Who knows???  Disappointed that you didn't have pain with it? That's not cool. I thought only 25% of people experienced discomfort with it, that it wasn't a given. Again, who knows?!?! aimska - I'm so sorry your stomach hurts!!! :-( I hope it feels better soon. And thank you for validating my feelings about the cold caps. It really did not sound appealing to me. I cannot wait for the day that all of this is just a distant memory for all of us. ",
      "MessageIndex": 542,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 13, 2011 12:47PM - edited Aug 13, 2011 12:50PM by Kasi Cupcakies - From what I understand, and I am by no means a doctor or good at biology, different types of chemos do different things. Some chemos physically go right to the cancer cells and kill them. Other chemo drugs mess with the DNA directly so that mutated (cancer cells) cannot grow and reproduce and make them kill themselves. Different chemos attack cells in different phases of their life cycles (all cells are programmed to be born, reproduce, and die. Cancer cells are mutated and do not follow this programmed death, which is why tumors form and the cancer spreads. They don't f*cking die and they reproduce too fast for the immune system to kill them). Time between each treatment allows the healthy cells to regenerate (with the help of the Neulasta or Neupogen shot for the bone marrow) and if the chemo is doing its job, the cancer cells will not regenerate. My guess is that in the first few days of each chemo is when all the \"damage\" is done to the good and bad cells and then comes the aftermath of that damage days later (i.e., hair falling out, low white blood cell count). Here's what the different types of chemos do (taken from various sources): Alkylating agents directly damage DNA to prevent the cancer cell from reproducing. So this is the Cytoxan portion for those of us getting it. Anthracyclines are anti-tumor antibiotics that interfere with enzymes involved in DNA replication. These agents work in all phases of the cell cycle. Thus, they are widely used for a variety of cancers. This group includes the Adriamycin (red devil) for those of us getting it . Carboplatin is also grouped here due to how it functions, although it is a metal salt. Mitotic inhibitors are often plant alkaloids and other compounds derived from natural products. They can stop mitosis or inhibit enzymes from making proteins needed for cell reproduction. These drugs work during the M phase of the cell cycle (the Mitosis phase, when the cell divides and makes more), but can damage cells in all phases. This group includes the taxanes, for those of us getting Taxotere or Taxol. Monoclonal antibodies are a relatively new type of \"targeted\" cancer therapy (and not technically a “chemo”). Antibodies are part of the immune system. Normally, the body creates antibodies in response to an antigen (such as a protein in a germ) entering the body. The antibodies attach to the antigen in order to mark the antigen for destruction by the body's immune system. This is for those of us who are HER2 positive and getting Herceptin; it's helping us get more antibodies to those overexpressing oncogenes (the HER2) and kill them. Hope that helps...??? ",
      "MessageIndex": 580,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 17, 2011 07:37AM Kasi wrote: eekwine - I think they said about 2 weeks from your first treatment, the hair will go. I secretly hoped that mine wouldn't (even though I logically knew it would) but by Day 12, the amount coming out was noticeable. Day 13 for me (today), a TON came out in the shower this morning. Friday is my appt at wig place...buzz, buzz! Glad your hubby can come with you on the 24th. Madismommy - I have heard that emend is the best (I got that in my IV), so if you have that as a take home med, you should be all set. My at home stuff was the stupid steroid, Compazine and Ativan. The compazine did not cut it for me so I asked for Zofran. And even though I felt nauseous, I never threw up. I took all my meds as directed and that's probably why. vtEllen - My plan is to take a Zofran when I leave the infusion to try to combat the nausea from the get-go this time. I was also told that I would be fine for awhile just from what they gave me in the IV, but that did not prove to be true for me either. About the oncotype test, I'm on the fence on whether or not to ask for it, just to know what my number is (even though I have to get chemo). What if the number is high? Then I will worry even more about recurrence. But if it was low, that might give me some peace of mind. Ugh, don't know. Hope all of you are having a fabulous Wednesday!!!!!! ",
      "MessageIndex": 734,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 18, 2011 07:25AM Kasi wrote: Mommyx2 - I did NOT cut my very long hair first and I am now wishing that I had. I am in the \"shedding\" phase right now and it's VERY annoying to have long hairs all over the place. Truenorth - I didn't really have a choice about the chemo in terms of my treatment plan. They said \"You're getting chemo.\" Obviously I didn't have to do it and I did think about not doing it. But I'm only 31 and am in otherwise good health so I want to do everything I can to extend my life. For me, the side effects did not outweigh the benefits. And if the cancer came back and I had refused chemo, I would have wished that I'd done it. Lele - Thanks for popping in, nice to hear what other people have experienced. I will be having 4 rounds of Taxol after the AC and I am worried about neuropathy. Summergirl - That is hilarious! Laughing is good anyway :-) I have my 2nd treatment today, will be thinking about you :-) Good luck! Koalakid- #2 for me today too! Good luck!  Capinva & Chrys - Glad you're feeling a little bit better! Hi to everyone else, I hope you're all feeling good today!! :-)  tldrose - Keep us posted on how the Taxol goes, I start that on September 29th. ",
      "MessageIndex": 784,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 29, 2011 12:47PM Kasi wrote: Hi everyone and welcome to all the new members of our awesome group!! Nails...well, I am still getting my manicures and pedicures. I was never told that I HAD to stop going (due to the risk of infection), but I did have my pink and white gels taken off prior to chemo. So now I am doing pedicures and shellac manicures (the manicures last 2 weeks) when my WBC count has rebounded. This was just something I refused to give up. I am hoping not to lose my nails with the Taxol but we'll see. ",
      "MessageIndex": 1168,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 30, 2011 05:04AM Kasi wrote: Madismommy & Taylor777 & anyone else getting treatment today - GOOD LUCK TODAY! You guys wll be fine. ",
      "MessageIndex": 1183,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 12, 2011 07:29AM Kasi wrote: Mary - Good luck today!!! Is this 4th one your last?",
      "MessageIndex": 1484,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 12, 2011 12:36PM Kasi wrote: Oh, and Mary, YES - Tamox for 5 years. Oh joy. Can't wait to feel the wonderful effects of estrogen suppression at the age of 32. LOL.",
      "MessageIndex": 1492,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 13, 2011 10:54AM Kasi wrote: summergirl - I totally agree! I figure that if my husband is still even interested, well, that makes me feel better. Although I don't think it takes much for men to be \"interested\" - LOL!  Thanks Mary! The reason that I say I am going to ask my onc about the Vit B and L-glutamine is because they tell me EVERY TIME that I have to tell them everything I am taking. But instead of asking I think I am just going to tell her that I am taking these things. What are the parameters of DD treatment? More aggressive tumor? Oh, and the dryness with AC. One side of my mouth is cracked even though I put chapstick on 24-7. But so far, not dry anywhere else. I use emu oil on my face and a really hydrating body moisturizer by Alba Organics. Michelleo - LOL! Falling asleep in the middle! I found that I was tired a lot longer with AC #3. Took 10 days to almost feel normal again. Grimbol -  I think it makes perfect sense that it's hitting you now, since it didn't initially. My onc's NP said that the chemo is a really emotional journey and not to be too surprised when emotions come up. When I was diagnosed, I cried more than I ever have in my LIFE. Cried all the time, major crying jags. I find that I cry less now since I think I got a lot out in the beginning. But I still cry.",
      "MessageIndex": 1507,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 14, 2011 08:56AM Kasi wrote: Grimbol & Madismommy - OMG, the wig is irritating. Mine's not hot and itchy, it's just a pain in my ass. I don't think I look like me. I take it off as soon as I get home, but I just don't have the guts to go to work all day without it. I said at the beginning that there was no way I was going to walk around with short hair when it starts growing back, but I SO am. I can't wait for the day that I don't have to wear this thing anymore!! Never thought I would sport a pixie cut but it's gotta be better than this rug...LOL. Jennifer - I know it must totally suck not to be at work and taking care of your patients. But work has gotta be a total germ-fest, definitely best not to be there right now. Hugs and love to all of you!!! <3 <3 ",
      "MessageIndex": 1538,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 21, 2011 02:59PM - edited Sep 21, 2011 03:01PM by Kasi Jennifer - So sorry to hear about your hubby! I hope that he gets some rest and that he's ok! Glad to hear minimal stuff so far with the Taxol. Chrys - I did not have to take steroids before the Adriamycin. When I went to \"the chair\" they gave me Emend and then Decadron (steroid) in the IV. Then the Adriamycin, then the Cytoxan, and then Ativan last as a push through my port,. I had a scrip for steroids at home that I was to take once every 12 hours starting the night of chemo just just 5 times. My infusions are on Thursdays so the last time I would take a steroid at home was Saturday night. On my 4th AC last week, I didn't even take the final steroid on Sat night, didn't need it. I got my AC every two weeks 4 times and I just finished my 4th last Thursday. On to Taxol, wahoooo! Halfway done. November 10th is going to be one of the best days of my life!!! Mary - TG it's not shingles!!!!! Sorry that it's still uncomfortable though. :-( ",
      "MessageIndex": 1734,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Oct 5, 2011 09:24AM Kasi wrote: I will have either 28 or 33 rounds of Rads - they haven't decided on which. Hoping for 28. Actually I am insisting on 28, LOL. They said it will start 3-4 weeks after chemo (my last one is Nov 10) so I am planning on 3 weeks. I want to get this done and OVER WITH! As it is, I have to wait 6 months after rads to have my implant exchange surgery, so we're talking the end of June 2012! Ugh! Had a mini-meltdown this morning. It now literally takes me 45 minutes to do my makeup and \"hair.\" I have to fill in my brows really well (they are SO SPARSE now), I lost almost all the lower lashes on my left eye and eyelashes are getting sparse, too. NOT COOL. If I was running late, I used to go without makeup. Now I have to spend almost an hour doing it if I want t go out in public just to look passable. And I guess one of the SEs is hyperpigmentation, so my once faded freckles on my face are SUPER dark and I am even getting freckles on my palms. And I put hot rollers in my stupid wig every day so that it looks somewhat decent. I seriously have never felt worse about my looks in my life. When I got my nails done last week, I noticed that the nail beds on my thumbs are a little dark. If I lose my nails because of this, I think I am really going to lose it. Thanks for letting me vent. Had my 1st Taxol last Thursday and it hasn't been so bad. Just the bone pain but it hasn't been anything that a few ibuprofen haven't taken care of. I hope you all are doing well! HUGS! ",
      "MessageIndex": 1958,
      "PostDate": "05/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Oct 6, 2011 08:55AM Kasi wrote: Robyn and anyone else who is almost done with chemo, BRAG AWAY! You have every right to! And I will be here congratulating you!! JMULL - I am definitely not brave enough to go out in public with just a scarf or hat. I work full time, too, with about 150 people so I just can't do it. So I pretty much wear the wig every day unless I know for sure that I'm not going anywhere. I actually don't have any children BUT did you say your daughter turned 12 on the 26th of September? That's my birthday, yay! allformy4 - I have tissue expanders in and I am going to be doing radiation with them. But I have to wait 6 months for my exchange surgery after rads... Chava - I am so hoping for hair regrowth during Taxol. I am also hoping that since I haven't fully last my brows and lashes, that I won't lose anymore (fingers crossed).  Jennifer - I'm so sorry that the Taxol has been worse for you. That is no bueno. ",
      "MessageIndex": 1987,
      "PostDate": "06/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Oct 18, 2011 09:56AM Kasi wrote: Grimbol - I think that the honest truth is that they really have no idea why LE happens to some people and not to others. So they throw a whole bunch of stuff our there about precautions, which is a good thing, but they just really don't know. I read a study a little while ago that said now they don't think LE has to do with the number of nodes removed, but rather how many \"pathways\" were with those nodes. And that is completely individual. Some people just might have more pathways for the lymph to pass, so losing a few nodes isn't a big deal. But someone who has less pathways, even if a few nodes were removed, are at a much greater risk.",
      "MessageIndex": 2179,
      "PostDate": "18/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jul 28, 2011 10:23AM Kasi wrote: I'm so happy that our August 2011 support group is growing, but so sad at the same time that we all have to be here. Ipswichmom, I'm only about 90 minutes north of you in Portland, ME. I'm sorry to hear about the gene but if it makes you feel any better, I did a bilateral with reconstruction even though I am negative for the gene (but my paternal grandmother had BC at age 45). My surgery went just fine and I was back to work full time after two weeks. 46MD - I totally hear you on stressing that the chemo can cause other diseases. Like Leukemia! So, um, you are giving me drugs to treat my cancer that might cause another cancer down the road? It doesn't make sense to me. But I have made my peace with at this point. Michelleo13 - Let us know how the appt goes tomorrow! Good luck!  Yvette - Good luck today! Know that we are all there with you!!! Please let me know about the PCC. I did think strongly about doing them but it was a bit cost prohibitive for me. Leighsa - Hope you don't need chemo!!  Guys, I know we can get through this! I have counted the weeks and if all goes according to plan (fingers crossed), my last chemo will be on November 10th. Then after a month I have to do radiation (6+ weeks most likely). And let's not forget my friend Tamoxifen for 5 years. Gee, I always wanted to go into menopause at age 31  ",
      "MessageIndex": 38,
      "PostDate": "28/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 5, 2011 03:17PM Kasi wrote: Lori - Thank you so much for your response, that is AMAZING! I won't cancel anything yet. I hope that I can be as strong as you and everyone else here.",
      "MessageIndex": 17,
      "PostDate": "05/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 6, 2011 10:11AM Kasi wrote: Thank you so much, Fighter_34 - I am loving all the hugs and thank you so much for your prayers! ((((HUGS)))) right back at you, hope yuo're having a wonderful day! <3",
      "MessageIndex": 26,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 6, 2011 04:48PM Kasi wrote: Well ladies, I got the confirmation. It's cancer and it's IDC. That's all I know so far, I don't have a copy of the pathology report. I'm just sitting here in disbelief.",
      "MessageIndex": 27,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 9, 2011 10:20AM - edited Jun 9, 2011 10:21AM by Kasi Hugs and love to all of you, thank you so much! Are any of you guys kind of avid facebook users like myself? I keep finding myself trying to \"Like\" all of your posts! Hahahahaha! I hope all of you are having a fab Thursday! Headed to my MRI in about an hour. ",
      "MessageIndex": 69,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 9, 2011 08:26PM Kasi wrote:",
      "MessageIndex": 74,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 20, 2011 10:17AM Kasi wrote: Hi ladies! As always, thank you all for your support and kind words! The oncs did sai I could do chemo before if I wanted to, but since I am ditching the boobs, the only advantage would be to see how my tumor reacted to it. I'm gonna be getting the good ole Red Devil for the first 4 rounds and then TC for the last four (I think?? Can't remember). So...went to the PS by myself on Friday. Don't know what I was thinking. I had been doing so much research on the cancer, I hadn't really looked at all the mastectomy/reconstruction stuff. Oops, didn't know that your nipples are gone. I seriously am so dumb, thinking like I was just getting some cool fake boobs. Ugh. it was a hard weekend.",
      "MessageIndex": 107,
      "PostDate": "20/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 23, 2011 08:51AM Kasi wrote: As always, thank you all for your concern and good thoughts and well wishes! They are all so much appreciated and they put a big smile on my face. I hope you're all having a great day!  It's so nice to hear about good experiences, as well as bad ones, but I know that my experience will not be like anyone else's. I am expecting the best possible outcome for myself and I am determined that it will be. I am gonna fight like the dickens. I refuse to let this beat me and get me down! Yes, it totally freaking sucks and I am only just beginning this difficult (understatement!) journey but I can't wallow for too long before I get sick of myself. I have a life to continue to live.  Robyn6464 - Ugh, I am so sorry that you are here! It sounds like we had similar U/S and biopsy experiences. The waiting is the absolute worst. I called them the next business day (Monday) just to see if the results were ready even though they said Tuesday (they were ready on Mon, btw). But I am still holding out hope for you that it's B9!!!!! Please keep me posted on what happens. I am hoping for the best for you. Love, Kasi ",
      "MessageIndex": 120,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jul 8, 2011 03:40PM Kasi wrote:",
      "MessageIndex": 135,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 4, 2011 08:18PM Kasi wrote:",
      "MessageIndex": 7,
      "PostDate": "04/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Kasi wrote: Hi Everyone - This is my first post and I've been reading this board yesterday and today. I'm 31 years old and I felt a sizeable lump in my breast about 3.5 weeks ago. Went to my PCP who felt it and said it seemed pretty mobile and liquid-filled. He figured it was a cyst but ordered an US just to be sure. His parting words to me were \"I'm sure this is nothing to be concerned about.\" And I really didn't give it a second thought. Went to the US yesterday and the radiologist said that I needed to come in to do a core needle biopsy the next day (today). My husband and I asked a lot of questions and she basically said the US ruled out that it is a cyst or a fibroadenoma. She said she was very concerned and is not optimistic that the biopsy will come back benign. She basically gave me a cancer diagnosis right then and there, and reiterated the same thing today at the biopsy. I first had a mammogram on both breasts before the US guided biopsy and she said it doesn't look like there are any other masses - she also said that when she did the US the day before she didn't see node involvement but that can really only be determined by surgery. I should have the results by Tuesday. I feel so devastated and scared, I'm already preparing myself for the bad news. Thanks for reading - it's so nice to know there is a forum out there like this. Lots of bone mets. Dx 6/6/2011, IDC, 4cm, Stage IIB, Grade 3, 2/5 nodes, ER+/PR+, HER2- Dx 7/31/2012, Stage IV, Grade 3, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 7, 2011 10:00PM Kasi wrote: I wish that I could personally hug each and every one of you. Thank you, thank you, thank you. You are all so helpful and it makes me see a glimmer of hope in all of this crap. I'm going hour by hour, either crying or just kind of trying to figure out how I got here. But it is what it is. And michelleg1122, I am so happy for you and your b9 result - that is just great news! :-) So...IDC grade III, estimated to be 4 cm. ER+ & PR+, HER2-. I'm so peeved that I won't be able to take my beloved Seasonale anymore and my lovely 4 periods a year. Ah, the little things that I should have appreciated more. We don't have all the info yet on the tumor that we need and I haven't met with the whole team just yet. Went over the pathology results at the breast care center. When she said that the tumor was an estimated 4 cm I said \"That means I will probably be started on chemo to shrink the tumor.\" Again, we don't have all the info but they said that would be most likely. So not what I wanted. Why do I read about all these celebrities like Christina Applegate and Cynthia Nixon that just get away with a lumpectomy/mastectomy and just rads. No chemo. Grrrrrr. And Suzanne Somsers who refused chemo. The chemo is just really the hardest thing for me to think about right now. I have no doubt that I will kick this cancer's butt and be done with it but the chemo is just making me so depressed...ugh, why does this have to happen during my summer? (I live in Maine and for me, the best time of the year is June, July, & August). Thanks again everyone and HUGE hugs to you all. ",
      "MessageIndex": 57,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Kasi wrote: Hi Everyone - This is my first post and I've been reading this board yesterday and today. I'm 31 years old and I felt a sizeable lump in my breast about 3.5 weeks ago. Went to my PCP who felt it and said it seemed pretty mobile and liquid-filled. He figured it was a cyst but ordered an US just to be sure. His parting words to me were \"I'm sure this is nothing to be concerned about.\" And I really didn't give it a second thought. Went to the US yesterday and the radiologist said that I needed to come in to do a core needle biopsy the next day (today). My husband and I asked a lot of questions and she basically said the US ruled out that it is a cyst or a fibroadenoma. She said she was very concerned and is not optimistic that the biopsy will come back benign. She basically gave me a cancer diagnosis right then and there, and reiterated the same thing today at the biopsy. I first had a mammogram on both breasts before the US guided biopsy and she said it doesn't look like there are any other masses - she also said that when she did the US the day before she didn't see node involvement but that can really only be determined by surgery. I should have the results by Tuesday. I feel so devastated and scared, I'm already preparing myself for the bad news. Thanks for reading - it's so nice to know there is a forum out there like this. Lots of bone mets. Dx 6/6/2011, IDC, 4cm, Stage IIB, Grade 3, 2/5 nodes, ER+/PR+, HER2- Dx 7/31/2012, Stage IV, Grade 3, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 8, 2011 07:58PM Kasi wrote:",
      "MessageIndex": 64,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Kasi wrote: Hi Everyone - This is my first post and I've been reading this board yesterday and today. I'm 31 years old and I felt a sizeable lump in my breast about 3.5 weeks ago. Went to my PCP who felt it and said it seemed pretty mobile and liquid-filled. He figured it was a cyst but ordered an US just to be sure. His parting words to me were \"I'm sure this is nothing to be concerned about.\" And I really didn't give it a second thought. Went to the US yesterday and the radiologist said that I needed to come in to do a core needle biopsy the next day (today). My husband and I asked a lot of questions and she basically said the US ruled out that it is a cyst or a fibroadenoma. She said she was very concerned and is not optimistic that the biopsy will come back benign. She basically gave me a cancer diagnosis right then and there, and reiterated the same thing today at the biopsy. I first had a mammogram on both breasts before the US guided biopsy and she said it doesn't look like there are any other masses - she also said that when she did the US the day before she didn't see node involvement but that can really only be determined by surgery. I should have the results by Tuesday. I feel so devastated and scared, I'm already preparing myself for the bad news. Thanks for reading - it's so nice to know there is a forum out there like this. Lots of bone mets. Dx 6/6/2011, IDC, 4cm, Stage IIB, Grade 3, 2/5 nodes, ER+/PR+, HER2- Dx 7/31/2012, Stage IV, Grade 3, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 14, 2011 03:57PM Kasi wrote: Hi everyone! Thanks so much for the thoughts and prayers! My appt with the BS and onc went pretty well today. The MRI showed another area (aside from the tumor) that is suspicious of DCIS behind the nipple. I can have that other area biopsied just to be sure but if it is positive for DCIS, I am no longer a candidate for a lumpectomy because it would be near impossible to try to get all the cancer and surrounding tissue and be left of a decent looking breast. The team at my city's hospital is leaning toward mastectomy, followed by chemo and rads. They did initially think chemo first in the interest of breast conservation. The MRI did not show any auxiliary lymph node involvement. I know that it does not show microscopic invasion but I am still encouraged by it. I have a CT scan scheduled as well and my blood is being sent out for BRCA testing. Tomorrow I head to Tufts Medical Center in Boston for the 2nd opinion.  Hope everyone is having a great day! ",
      "MessageIndex": 94,
      "PostDate": "14/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 3, 2011 08:53AM Kasi wrote: Hi aimska! Thanks for the encouragement! You and your friend are so right - health is 100% priority at this point! How have you been doing with the chemo so far? I just read a news story in my town that a 3 month old baby was just diagnosed with leukemia. I just don't get it. This stupid beast definitely does not discriminate. ",
      "MessageIndex": 194,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 4, 2011 08:19AM Kasi wrote:",
      "MessageIndex": 228,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 6, 2011 04:51PM Kasi wrote: Hi ladies! Thank you for all the well wishes and I am feeling better. I was hit with the nausea just three hours after my infusion and it wasn't even time for me to take my at-home stuff but I did. They gave me emend through the IV and I have compazine and Ativan for the nausea at home. I was drinking fluids like it was my job. That's why I was so surprised it hit me so hard and so quickly. But I am feeling better. I went to get my Neulasta shot yesterday and they gave me some fluids there and that also helped. I've been walking and napping and eating toast with PB. I think I finally feel hungry right now for the first time since Thurs nite! I will ask about Zofran. Thanks ladies, hope you all are well!",
      "MessageIndex": 287,
      "PostDate": "06/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 6, 2011 05:04PM Kasi wrote: And Madismommy - my nausea was like a hangover. My head hurt and I also had diarrhea. I thought I was going to throw up a couple times but not to the point where my head was in the toilet. The on-call dr told me to up the Ativan. He said to take one then and one an hour later and if I really needed to, I could take 4 in a 6 hour period. I didn't need that many. I woke up on Friday without nausea but a lingering headache. Drove myself and my mom to my shot and also picked up my bro from the airport. So it first felt like it was the repercussions of a bad bender but now I am pretty much fine. And no bone pain from the Neulasta. I asked the on-call dr on Thurs nite if it was normal to get hit so quickly after the infusion and he indicated that it was kind of rare but everyone is different. I think I went in a little too cocky, convinced I would be fine :-)",
      "MessageIndex": 288,
      "PostDate": "06/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 6, 2011 06:42PM Kasi wrote: Thank you, Doodlebug!! I appreciate that so much!",
      "MessageIndex": 292,
      "PostDate": "06/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 9, 2011 10:23AM Kasi wrote: Good luck to everyone starting this week or for those of you who already have started! :-) I am 5 days out from my first AC and finally feeling normal again although I still have to force myself to eat. I even turned down a DONUT from a fabulous local baker this morning when I came into work; didn't even appeal to me. Normally I would have split one with somebody.  I am also doing acupuncture to help alleviate some of the side effects. I had my second appt last night and I felt so much better today. I think it's helping - even if it's a placebo, I don't care :-) Have a great day everyone!!! ",
      "MessageIndex": 363,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 11, 2011 10:57AM Kasi wrote: Thank you, vtEllen, for the info. I'm going in today and ask them about the copay business. Last week I was like \"I am PAYING to get chemo?!\" hahahha. Eating is so not as fun. I pretty much only like pb toast. ",
      "MessageIndex": 477,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 12, 2011 10:47AM - edited Aug 12, 2011 10:48AM by Kasi Welcome Jillejo & edyem! And good luck to Jillejo & Robyn at treatment today. The actual infusions are total non-events. I hope that everyone else who had treatment this week is feeling good! Hugs to all of you! Summergirl - I am going to check out that Facebook group. I think my docs would have been onboard with me doing the cold caps but, honestly, it looked like so much work and I would have had to bring my own \"team\" to help me. Ice, dry ice, switching caps, not getting burned by the dry ice, needing people to help you fasten them on, etc. I mean, I do love my hair but all the work just sounded so exhausting. Did I really want to be hauling around a cooler? I dunno. I go back and forth on the decision every day. But, seeing how tired I am and sick I got those first few days, I couldn't imagine fussing with the caps. Maddismommy - My onc said that I could get fills during chemo. I only wanted to be a B cup (that's my size, didn't want to go bigger) and my TEs were filled halfway at surgery. So I only needed a few more fills and I was done with them before I started chemo. I don't see why, if you get filled the day before your infusions when your counts are at their highest, you can't. But I am not a doctor and they all say different things anyway :-) Aimska - I wish we lived closer too :-( But JFK is just a short Jet Blue plane ride from Portland, ME  Day 8. Hair still not coming out yet. Scalp not feeling funny. Just waiting for that other shoe to drop this coming week... vtEllen & MaryjRN - How are you guys feeling? No fever here. I did decide to work from home today, though - there are 150 people at my company and I did not want to risk the germs. You guys, when all of this is over next year, it would be so cool if we could plan a meetup somewhere. I know we're from all over the place but I think that would just be so neat to meet all of you in person when this stuff is behind us all and we have kicked cancer's BUTT! Have a great day everyone! ",
      "MessageIndex": 538,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 13, 2011 12:59PM Kasi wrote: Welcome tldrose and oldchristine! Robyn - I've done that cruise to Nova Scotia on the Scotia Prince. It's fun but I'm thinking TROPICAL! Warm sunshine and warm ocean water! Grimbol - That's weird that the nurses hadn't heard of Claritin for the Neulasta. My onc asked me if I wanted to be in a trial study to see if it really does help but I already take it every day so that left me ineligible to be in the study.  Theresa - Hope you are feeling better as the day goes on. That's exactly how I felt, too: out of sorts. Not like myself. I had my first AC chemo exactly a week before you and I felt like myself again by the following Tuesday. Hope everyone is having a great weekend! ",
      "MessageIndex": 581,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 15, 2011 12:13PM Kasi wrote: vtEllen - I call my tissue expanders turtle shells. They are really hard! Dogmom - How many dogs do you foster? Do you have your own? My husband and I have two rescues who we love DEARLY. Dogs are the best. Chrys - The heel pain was weird. It hurt then it went away a day or two later. I was wondering if I walked on it funny or if it is some kind of weird side effect.  Koalakid - I had the numb tongue thing too. I actually didn't mind the salt water gargle but I HATE the biotene dry mouth rinse they recommend. I think it tastes disgusting. Justina - Kudos to you for working the next day! I got my treatment on a Thurs and worked from home Friday and Monday. Did not feel more like myself again til Tuesday, so I bet you will feel better tomorrow. Fri, Sat, Sun, and Mon after treatment I felt like a zombie. A zombie with the flu. ",
      "MessageIndex": 640,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 16, 2011 03:11PM Kasi wrote: Ha! The one positive out of all this is that I am saving money since I won't be needing my brazilian waxes for awhile! Aimska - OK, I'm getting back to work now!!!  ",
      "MessageIndex": 708,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 19, 2011 09:00AM Kasi wrote: Madismommy - Today is the big day for me. Going to the wig place to be shaved bald and get my wig styled. I feel ok about it for now. My mom, my hubby, and my best friend are all going with me so I will have enough comic relief there not to feel too bad about it. I'm at the point now where I know it's going to happen and I've accepted it. A couple days ago, I had the windows down in my car and was feeling the wind through my hair and I shed a few tears about that, but then I was better. vtEllen - My drips yesterday went in this order: Aloxi, Emend, Decadron, Adriamycin (red devin), Cytoxan, and Ativan (the Ativan was just a quick push through my port). My takehome drugs are Decadron (I have to take it the first night of chemo and then 4 more times every 12 hours, so the last time I take the steroid is Saturday night), Zofran (which I popped as soon as I got home from the infusion), and Ativan. I take two Ativan at night before I sleep.  Thanks for the well wishes everyone - I still feel SO MUCH better than last time. Went on an hour and 10 minute walk with my Mom and our dogs this morning and now I'm doing some work from home. And the best part is that I am not even going to need fluids this time, just the shot. Yay!! I don't want to jinx myself but I felt so crappy last time that I am so happy right now!  I hope you are all feeling good today and hanging in there! You're all so awesome!  ",
      "MessageIndex": 819,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 8, 2011 06:05PM Kasi wrote: DebinUtah - They do say that the AC (\"red devil\") is the worst, but since I'm currently getting it and then reading about my fellow sisters with the Taxotere, I'm not so sure. I haven't had any terrible aches and pains with the AC at all. Just fatigue. I think it would be safe to say that they are BOTH horrible, LOL. VTellen - I say that you still tie the knot as planned and stop in and see me when you're in Maine. I'm in Portland :-) And congratulations, by the way!!! Jenn - Sounds like you are hanging in, I'm sorry about your mouth and hot flashes. I am a week out from AC #3 and most things still taste like poo. Especially water but I FORCE myself to drink it! Vivie - I hope that you start to feel better soon, I am sorry! And count me in on a trip. When all this shit is done, I am going to start to do everything that I want to do. Screw the finances, they aren't worth worrying about anymore!!! LOL UKgirl - I think you and I are practically on the same schedule. I had AC #3 last Thursday. I am getting 8 total treatments, one more AC and then 4 Taxol, you?? LOVE YOU ALL! Hang in! I'm sorry if I'm forgetting anyone, I don't want you to think I'm ignoring posts. I read them all and think of you all every day!!! ",
      "MessageIndex": 1428,
      "PostDate": "08/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 11, 2011 06:12PM Kasi wrote: What? No tampons? No one told me that. I used them when I had my period after Round 1. I would have done it anyway even if they told me not to; I don't do pads. Yup, I am a rebel.  I'm so sorry for all of you going through shitty side effects right now. I am back on the upswing but that won't last long with AC #4 on Thursday. ",
      "MessageIndex": 1475,
      "PostDate": "11/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 21, 2011 04:22PM Kasi wrote: Madismommy - How was the Wizard today?",
      "MessageIndex": 1737,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 27, 2011 05:01AM Kasi wrote: Summergirl, Michelle, Chrys, Edyem, Deb & Vivie: Thank you so much for the birthday wishes! It was a GREAT day! And Deb, thank you so much for those kind words! The next birthday is gonna be even better! 2012 is our year, girls! Hair growing back and putting this all behind us! Love to you all!! <3 ",
      "MessageIndex": 1828,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Oct 18, 2011 09:37AM Kasi wrote: Hey, congrats Ellen, Chrys and Robyn for finishing! You guys are officially PFC! GREAT JOB! WOO HOO! Two more left for me, baby, two more. Unfortunately, I am starting to get hot flashes at night and it's messing up my sleep. I'm not sweating, I just get really overheated and it wakes me up. So annoying. I lay in bed, half laughing and half crying at the fact that I am 32 and having hot flashes. So not cool. RE: compression sleeve for flying. I asked my radiation onc about it and he said that it's not necessary since the cabin is pressurized. Sorry I haven't been on too much. Taxol has been so much easier for me compared to the AC. No more feeling like I have the flu all the time! My NP said I could get a flu shot and I said I would rather not. I never get flu shots and I don't feel like starting now. I get stuck enough already, LOL. ",
      "MessageIndex": 2176,
      "PostDate": "18/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Oct 25, 2011 09:06AM - edited Oct 25, 2011 09:08AM by Kasi JMULL - I'm sorry that the Taxol wasn't kind to you this weekend. The night after my first Taxol infusion, the palms of my hands turned all red like a sunburn and the skin even felt like it was sunburned. It hurt to close my hands in a fist. It went away in about 48 hours. When I went to my next infusion, they scaled back the Taxol amount by 20% (which I was just fine with). Maybe ask about that to lessen the issues with feet and hands? Missey - You're almost there! Woohoo! To answer your question, I do not consider myself sick. Before I was diagnosed, I was never sick. Didn't even get a cold that winter. People in my office had bronchitis and sinus infections. Didn't get a dang thing. I don't even FEEL sick right now. So far, Taxol has been a dream for me. I'm actually running again. I don't want to jinx this, but other than the hair loss, I almost feel like myself pre-BC (just a little more tired and a non-stop runny nose). I don't want anyone to think of me as \"sick\" just because I have cancer. I'm just dealing with this little setback and looking forward to the days when my treatments are over and my hair is growing back in! ",
      "MessageIndex": 2270,
      "PostDate": "25/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 16, 2011 04:40PM - edited Jun 16, 2011 04:41PM by Kasi You guys are so awesome! Thank you so much for checking in! The second opinion went well. It was basically right on with the first. I am opting for a double mastectomy with reconstruction. Chemo will be 16 weeks. Radiation if the nodes are positive and/or clear margins were difficult to achieve. Ugh. Boston made it seem like if I really wanted to try to save the breast, it could be done with some wizadry. For my peace of mind, I am not interested. Get 'em both off. Chemo is the hardest pill for me to swallow still. But my tumor is grade 3. So chemo it is. I hope you guys are all having a great week! Thank you again!",
      "MessageIndex": 100,
      "PostDate": "16/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Kasi wrote: Hi Everyone - This is my first post and I've been reading this board yesterday and today. I'm 31 years old and I felt a sizeable lump in my breast about 3.5 weeks ago. Went to my PCP who felt it and said it seemed pretty mobile and liquid-filled. He figured it was a cyst but ordered an US just to be sure. His parting words to me were \"I'm sure this is nothing to be concerned about.\" And I really didn't give it a second thought. Went to the US yesterday and the radiologist said that I needed to come in to do a core needle biopsy the next day (today). My husband and I asked a lot of questions and she basically said the US ruled out that it is a cyst or a fibroadenoma. She said she was very concerned and is not optimistic that the biopsy will come back benign. She basically gave me a cancer diagnosis right then and there, and reiterated the same thing today at the biopsy. I first had a mammogram on both breasts before the US guided biopsy and she said it doesn't look like there are any other masses - she also said that when she did the US the day before she didn't see node involvement but that can really only be determined by surgery. I should have the results by Tuesday. I feel so devastated and scared, I'm already preparing myself for the bad news. Thanks for reading - it's so nice to know there is a forum out there like this. Lots of bone mets. Dx 6/6/2011, IDC, 4cm, Stage IIB, Grade 3, 2/5 nodes, ER+/PR+, HER2- Dx 7/31/2012, Stage IV, Grade 3, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 124,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jul 8, 2011 02:20PM Kasi wrote: Hi you guys! Thank you all so much for all your hugs and thoughts and prayers - they worked! The surgery went well, I am healing up great, and my drains come out Monday. My arms feel great, I have a good range of motion but I'm not trying to push it or anything. And the drains are SO ANNOYING. It is so weird to me that I feel so darn good but I have this \"cancer\" thing. Ugh. So weird. Some disappointing news in my surgical path, though. I had 2/5 nodes positive with both angiolymphatic invastion and extracpsular extension present. So apparently that stuff was on the MOVE. Treatment will be aggressive. Not looking forward to it but it is what it is. The other thing that was disappointing is that I was NER2 - on the biopsy but I am now HER2 equivocal. Awaiting final FISH test to see if I'm positive or negative (or equivocal again). Hope you all had a fabulous 4th and that you have a great weekend! Kasi ",
      "MessageIndex": 133,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Kasi wrote: Hi Everyone - This is my first post and I've been reading this board yesterday and today. I'm 31 years old and I felt a sizeable lump in my breast about 3.5 weeks ago. Went to my PCP who felt it and said it seemed pretty mobile and liquid-filled. He figured it was a cyst but ordered an US just to be sure. His parting words to me were \"I'm sure this is nothing to be concerned about.\" And I really didn't give it a second thought. Went to the US yesterday and the radiologist said that I needed to come in to do a core needle biopsy the next day (today). My husband and I asked a lot of questions and she basically said the US ruled out that it is a cyst or a fibroadenoma. She said she was very concerned and is not optimistic that the biopsy will come back benign. She basically gave me a cancer diagnosis right then and there, and reiterated the same thing today at the biopsy. I first had a mammogram on both breasts before the US guided biopsy and she said it doesn't look like there are any other masses - she also said that when she did the US the day before she didn't see node involvement but that can really only be determined by surgery. I should have the results by Tuesday. I feel so devastated and scared, I'm already preparing myself for the bad news. Thanks for reading - it's so nice to know there is a forum out there like this. Lots of bone mets. Dx 6/6/2011, IDC, 4cm, Stage IIB, Grade 3, 2/5 nodes, ER+/PR+, HER2- Dx 7/31/2012, Stage IV, Grade 3, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 3, 2011 09:12PM Kasi wrote: Thanks bdavis - have a wonderful weekend! My parents are coming down while my husband goes to work tomorrow. It will be a really nice distraction.",
      "MessageIndex": 5,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 13, 2011 09:02AM Kasi wrote: Thanks you guys!!  Ugh, Maine is cold and rainy today and was the same this weekend - supposed to be like this through Wed. Hopefully that gorgeous CT weather will get to us at some point. Tomorrow I meet with the BS and Onc at the hospital in my city and will have the results of my MRI. Wednesday I truck down to Boston to Tufts for a second opinion - they have my slides and path report and I am bringing the images from the U/S, mammo, and MRI.",
      "MessageIndex": 84,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 11, 2011 09:36AM Kasi wrote: And if it helps, I don't think I would do the trial - but that's me.",
      "MessageIndex": 472,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 11, 2011 11:39AM - edited Aug 11, 2011 11:42AM by Kasi Thanks for your input everyone. Geesh, I'm sorry Chrys23, I feel foolish for complaining since I do have free parking. WTH? Paying for parking for chemo just seems so wrong. UKgirl - You and I are doing the same chemo regimen and I started just a day after you (last Thurs). I'm glad you are feeling a bit more \"normal,\" although that is now a relative term. Ha! I'm sorry your hair is starting to go. I am waiting for mine. I have an appt next Friday at the hair replacement place and they are going to buzz it off for me and get my wig all spruced up. Frig. I've already said this today, but I love my hair. I just said to my Mom \"This coming weekend is my last weekend with hair.\" And I just noticed that we have the same diagnosis date. ",
      "MessageIndex": 481,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 11, 2011 03:16PM Kasi wrote: HAHAHAHA, vtEllen! Don't you love the things people say? I can't believe they even commented on your hair! My PS, whom I do love dearly and has done a great job, did tell me that my boobs were \"perfect\" prior to my bilateral. Yes, thank you, I know they are perfect and now I have to get them cut off. ",
      "MessageIndex": 491,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 15, 2011 08:17AM - edited Aug 15, 2011 08:20AM by Kasi Good luck to everyone getting treatment today! All those who had treatments last week, I hope you get to feeling better soon. Dreading #2 on Thursday. Islandgirl - I'm 7 weeks out (today, exactly) from my BMX and I sleep on my side. They are kind of uncomfortable but I'm used to them, I think. The bruising is normal. You won't even feel the fills if you go conservative (I had 60 ccs for each fill). Guess it's good that I'm used to these silly turtle shells since I'll have them for almost another year :-( Oh, and the nurses will bring you water, ice, ginger ale juice, whatever you want when you're getting your infusion. Maybe bring a snack? I ate right before so I didn't eat anything during. OH AND...is anyone else's nose running nonstop?? Sometimes if I bend over, it literally drips out of my nose. And I also had heel pain in my right heel for a day last week. So weird. ",
      "MessageIndex": 632,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 16, 2011 02:08PM - edited Aug 16, 2011 02:09PM by Kasi vtEllen & Yaya - I actually think they are told to say \"I've never heard of that.\" I've asked a million questions about side effects I've heard about and things to do to try and alleviate them. For example, according to real people AND books, it's common for your hair to grow back in gray for awhile, even if you weren't gray to start. The color often times come back, but it can come in a yucky gray color. When I asked an onc about this (I think I've asked 2 of them), they both said \"I've never heard of that.\" Grrrrr! Yes, it happens, I wish they would just admit some of this stuff. And the fact that Taxol can cause neuropathy...asked my onc about that and she was like \"No, we would adjust the drugs if that was a side effect, and it's not permanent.\" Yes, it is permanent for some people.  So Chrys - yes, I would think that what you're going through could be SE from the Taxotere. I'm so sorry, I hope that it gets better. I've read that taking L-Glutamine (a supplement) can help. I'm planning on taking it through my Taxol rounds.",
      "MessageIndex": 699,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 16, 2011 02:10PM Kasi wrote: vtEllen - Hee hee! We'll start teams. You're either FOR or AGAINST Biotene. Hahahaha, LOL!",
      "MessageIndex": 700,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 19, 2011 09:01AM Kasi wrote: aimska - your wig does look AWESOME! You can't even tell that it's a wig. I wish they made it easier to post pics on here!!!!",
      "MessageIndex": 820,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Aug 25, 2011 08:38AM Kasi wrote: vtEllen - Hahahahaa! Thank you for making me feel better! I know I never think those thoughts when I see someone in a scarf but I am my own worst critic. Perhaps now is the time to let the vanity die. Or at least be less vain. ha!!!! Chava - Thanks for the links about fasting. I don't know that I dare to attempt it. Me without food is not good and I feel better when I am getting the infusions and I have stuff in my stomach. I am also doing acupuncture, just once a week though. I think that it is really helping me. I don't feel 100% like myself but I am functioning pretty normally without too many SEs. Seriously, the constant faucet of my nose is the only really bad thing (and bald head, lol). Taylor - I had a double mast and I still have to get radiation (2 positive nodes). The way the RO explained it is that the chemo is good insurance against the cancer going to distant sites but not as good in the local area. So the radiation takes care of the possibility of local recurrence. I wasn't happy about having to do the radiation but I am going with it. ",
      "MessageIndex": 1031,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 4, 2011 06:27PM Kasi wrote: A couple weeks ago, I was drinking a bottle of Honest Tea and there was a quote on the bottle from Winston Churchill that said \"When you're going through hell, keep going.\" I think that is so fitting for all of us! I try to keep that in mind every day. Hugs and love to all of you!!!! <3 ",
      "MessageIndex": 1345,
      "PostDate": "04/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 8, 2011 07:33PM Kasi wrote: Vtellen - Promise you'll stop and meet up with me for a few minutes when you do come here, ok?? And good question about how they determine who gets what chemo. My initial HER2 test was equivocal so there was talk that if I was HER2 positive, I would be getting 6 rounds of TCH every three weeks, But when the FISH test came back HER2 negative, it was AC and Taxol. They said that I was going to be treated really aggressively so that's a really aggessive regimen? No clue. I see that some women who are triple negative get the same chemo regimen as me so that's what makes me think it's a really aggressive treatment since TN is considered a very aggressive cancer...? Honestly, no clue. I am probably being over treated but I am fine with that. I have many, many years of living left to do. ",
      "MessageIndex": 1430,
      "PostDate": "08/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 20, 2011 11:58AM Kasi wrote: Ellen - What?!?! As if you don't have enough to worry about!!! But it's B9, I just know it! Sending hugs your way!!! Chrys - I wish that I could take these horrible side effects away from you! I hope your docs get this under control! Tanya - I know what you mean about the hair depression. I wake up every day and my first thought is \"I want my hair back!\"  But I am glad to be waking up; and now sometimes during the day I forget that I don't have hair (sometimes). Great job on taking the bull by the horns! Jen - Congrats on Taxol #1; the end is in sight!!! DebinUtah - Hahaha! I cracked up about the \"recipe\"; no kidding, huh? Is someone cooking this stuff up in their meth labs? LOL.  That does not put me at ease at all. Sheesh. I'm sorry I haven't been keeping up with everyone and commenting directly! Love to you all! Hope everyone is feeling ok and good luck to all getting treatment this week. <3  Madismommy - You're beautiful! Love the pic! Hope the Wizard treats you well today ",
      "MessageIndex": 1698,
      "PostDate": "20/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Sep 26, 2011 12:54PM Kasi wrote: Hi everyone! Hope you are all feeling well today...or as well as we can be, LOL! Hugs to all of you, September is almost over, we are getting there surely (albeit too slowly, hahaha!) The last and final round of AC kicked my patootie. It is Day 11 since that round and I FINALLY FEEL BETTER. No more sore mouth, no more sore throat, no more headache and head pounding when I get up to stand, no more feeling like I have the dang flu. I think it's fitting to finally feel better today because it's my 32nd birthday! This definitely isn't a birthday to go down in the books, LOL. I asked Hubs for a time machine for my birthday  ",
      "MessageIndex": 1811,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Oct 26, 2011 11:39AM Kasi wrote: JMULL - My treatment didn't get pushed back at all. The redness on my hands had gone away after a couple days and when I went for Taxol #2, they decided the scale back the amount I would be getting for the next three. No delays!! Woohoo! Sorry this is short, just wanted to jump on while at work and answer JMULL's question. Love and hugs to you all! :-) ",
      "MessageIndex": 2285,
      "PostDate": "26/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Kasi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130138/profile",
      "Content": "Jun 3, 2011 10:41PM Kasi wrote: Good luck to both of you! I'm also waiting for results next week but the radiologist is not very optimistic that the result will be B9.",
      "MessageIndex": 3,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769847",
      "Title": "results next week rengeko rengeko"
    }
  ]
}