{
  "AuthorID": "kate2011",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
  "Posts": [
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Nov 6, 2011 10:42AM kate2011 wrote: Oh my gosh, waiting is so horrible.  I had to get Xanax and Ambien just to make it through the first few weeks.  (Glad I finally don't need it to get to sleep anymore!) Try to keep busy if you can so you can keep your mind off of it.  You can't do anything about it today. Definitely get on their case about it tomorrow.  10 days is too long to wait. Sorry you are both waiting.  For me, that was really one of the worst parts.  I really just wanted to know what was going on so I could have a plan and feel some control. Sorry for your anxiety today.  Big hugs to you both! ",
      "MessageIndex": 2,
      "PostDate": "06/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/777546",
      "Title": "It's been ten days now miricurt538 dragonfly55"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Dec 21, 2011 01:01PM kate2011 wrote: Did you have any sentinel node removal? I just developed cording and minor LE and I'm 8 months post surgery.  Same arm that I had the SNs removed.  Pain shoots down from my shoulder all the way into my hands.  And my arm & hands feel like they are \"asleep\" frequently! Just started physical therapy and compression. ",
      "MessageIndex": 9,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/767466",
      "Title": "Hand numbness one year after mastectomy momofcuig Shrek4"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Dec 21, 2011 01:31PM kate2011 wrote: Thanks!  That site has been helpful.  I've had some relief from PT, but it looks like it will be stubborn.  Oh well!",
      "MessageIndex": 11,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/767466",
      "Title": "Hand numbness one year after mastectomy momofcuig Shrek4"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Nov 5, 2011 10:41PM kate2011 wrote: Kam, I don't know anything about teaching hospitals.  I can only tell you that I found a center that has a specialty in breast cancer, then I basically interviewed two of every kind of doctor I needed (two surgeons, two oncologists & so forth). I'm so glad I did!  I was very happy with my team.  (And I am glad I didn't pick the other Onco...she was really not the right one for me, but she was my primary care physician's referral!) Looks like there are some breast centers in Oregon.  Celilo Cancer Center in The Dalles, Legacy Breast Health Center in Portland.  Salem Hospital in Salem.  I hope they are close for you. I am not sure why a teaching hospital would be helpful.  My surgeon is really current with her research, still attends all the new seminars & so forth.  My oncologist is amazing.  I wouldn't trade him for anything.  I wish you could just come down here.  I guess I recommend the breast centers because (in my limited experience) I think they have so many resources for you.  I don't know if you would get all of that at a teaching hospital. I had my first mammo at a clinic.  They sent me to the breast center for my second mammo.  My results were discussed with me immediately by the radiologist.  They set up my biopsy for 2 days later.  They had my results in 2 days.  They set up my surgery within a few weeks.  I ended up going with physicians that were on the campus.  They had free counseling, health classes, exercise classes, massage.  They really had a lot of support for cancer patients. Good luck.  Keep me posted! ",
      "MessageIndex": 4,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/777564",
      "Title": "Biopsy on Monday - Lot's of Questions QuinnCat blg"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Nov 6, 2011 11:44PM kate2011 wrote: Good luck, Kam.  Yes, I will definitely keep positive thoughts going for you and that you find out the best possible news...no BC.  Please keep us posted.",
      "MessageIndex": 7,
      "PostDate": "06/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/777564",
      "Title": "Biopsy on Monday - Lot's of Questions QuinnCat blg"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Nov 5, 2011 09:29PM kate2011 wrote: Hi Kam. Wish I could help you.  I don't know the area.  I had my treatment at Hoag.  They are a \"certified quality breast center\".  (I wonder if I have \"quality breasts\" now?) I wish I knew more...there appear to be a few different organizations that certify breast centers.  NCBC.  Nat'l Consortium of Breast Centers.  And NAPBC.  Nat'l Accreditation Program for Breast Centers.  (There could be more, for all I know.) I found one center in Northern California that's certified by NCBC and accredited by NAPBC.  Maybe that's good! John Muir Health Center.  Two locations.  One in Walnut Creek and one in Concord.  Maybe that's a good place to start? The very best advice I could give you is to find a great Oncologist.  He or she will be your quarterback. Sorry you are going through this.  Please keep us posted. ",
      "MessageIndex": 2,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/777564",
      "Title": "Biopsy on Monday - Lot's of Questions QuinnCat blg"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Oct 12, 2011 02:08PM kate2011 wrote: Hi Tiger Blood. I had a great facility near me - Hoag Hospital.  Certified Breast Care center.  I STILL got a second opinion.  I saw two oncologists, two surgeons, etc.  I had every test possible. Try to take some of the emotion out of that part...treat it like a job.  Just my opinion.  You wouldn't buy a car after just looking at one, would you?  You have many important decisions to make, so get as informed as possible.  See as many people as necessary to get comfortable with your decisions. A good doctor will not get offended.  I kept talking to people until I was certain I had the right team, and they were all on the same page.  The first oncologist was not a good match for me, so I'm glad I kept looking. I've heard great things about MD Anderson.  Best of luck to you!!",
      "MessageIndex": 10,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776328",
      "Title": "MD Anderson Tiger_Blood Tiger_Blood"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Nov 8, 2011 03:03PM kate2011 wrote: You know, they also make it sound like if you do self-exams, you will be able to detect cancer if you have it.  False sense of security.  My radiation oncologist told me that my tumor was so small and slow growing that it would have taken 5 more years to feel a lump.  And hey, plenty more time for some cells to spread outside the breast & into other parts unknown. So...yeah, I agree with you.  Pardon my French, but screw them.",
      "MessageIndex": 3,
      "PostDate": "08/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777774",
      "Title": "This kind of thing drives me crazy. lynne248 pbandj"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Jan 16, 2012 08:58AM kate2011 wrote: Hi Linda. You might still have pain from cording.  Sounds like it to me.  You probably have some tissue that is still sticky.  I've had those moments...everything feels fine, then my BF barely touches my arm & I just jump from the unexpected pain. If you can, go back to your LE PT.  She will be able to tell right away if your tissue is sticking again. Keep me posted & good luck! Kate ",
      "MessageIndex": 42,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/778987",
      "Title": "Different Kind of Cord Question Outfield 16Christine"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Jan 16, 2012 12:23AM kate2011 wrote: PinkHeart and Outfield: I saw my oncologist a few weeks ago, and told him about the cording.  He is the greatest oncologist.  But he said \"that is scarring from the surgery\" and dismissed it from the discussion.  (It's not really scarring, by the way!)  I am lucky that my BS is pretty current on research and different problems.  She referred me to a great LE therapist, although she was very surprised that I got cording about 8 months post op. I have found that the LE therapist understands cording the best.  There is almost no research or understanding of cording in the other professionals I have talked to.  I found limited info on the internet.  There are several ladies here that know much more than I found anywhere else. The doctors I have talked to seem to be focused on the cancer, and cording seems to be viewed as a nuisance to them, not really a big concern.  Just my experience. Of course, it's a big concern to me!  I guess I'm not surprised that you've also talked to several people without much progress.  I would not recommend surgery unless you have tried PT with a great LE therapist.  I've had about 10 or 12 sessions so far, and I'm seeing improvement.  I can't see the cords popping out of my arm anymore, although I still have pain.  It gets a little better each time I go to PT. Good luck & keep us posted.  Sending you both big hugs. Kate ",
      "MessageIndex": 40,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/778987",
      "Title": "Different Kind of Cord Question Outfield 16Christine"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "kate2011 wrote: About 2 weeks ago, I started having a shooting pain from my arm pit, down my arm, crosses into the front of my arm after the elbow, goes into my fingers.  Pretty much hurts all the time now, but especially when I move my arm, elbow, wrist. I had really mild swelling & fluid build up after surgery at my lymph node site, but it went away.  I can't see a cord yet, but I think I can feel one.  Physical Therapist hasn't called me back yet. Is this common?  Can it go away with physical therapy? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/779138",
      "Title": "Cords 8 months after surgery? kate2011 kira"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Dec 7, 2011 08:35PM kate2011 wrote: Kira:  Thank you!  Yes, she said downward dog is a bad idea right now, too.  Thanks for the info on the poses I can still do and on the hot/cold situation.  Bummer.  I was hoping to get a little relief tonight, and I'm really going to miss yoga.  Kind of weird how this just popped up on me after almost 8 months.  The other day, my BF touched my arm (softly) and it hurt so bad.  And now it pretty much hurts all the time.  The only difference is how much it hurts...a little or a lot.  The PT is pretty confident though, so that's good news. When did you start having problems with cords?  How much PT did you get?  Has it gone away?  Thanks ",
      "MessageIndex": 6,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/779138",
      "Title": "Cords 8 months after surgery? kate2011 kira"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Dec 6, 2011 10:35PM kate2011 wrote: Kira:  Thank you!  I'm waiting for an appointment with the PT.  I will keep you posted.  Thank you so much!",
      "MessageIndex": 2,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/779138",
      "Title": "Cords 8 months after surgery? kate2011 kira"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Dec 7, 2011 06:59PM kate2011 wrote: I like my PT.  She is a lymphedema expert.  Very nice lady. She said it's cording.  You can feel it all the way down from my armpit to my wrist.  The nerve is swollen.  And I have mild swelling (possibly lymphedema) in my forearm.  Oh well.  PT starts tomorrow!",
      "MessageIndex": 3,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/779138",
      "Title": "Cords 8 months after surgery? kate2011 kira"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Dec 7, 2011 07:04PM kate2011 wrote: No more yoga until it's better. Does ice help with the pain?  I forgot to ask her about that. ",
      "MessageIndex": 4,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/779138",
      "Title": "Cords 8 months after surgery? kate2011 kira"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Dec 20, 2011 04:26PM kate2011 wrote: Just sent you a private message. Hugs. I know it's hard, but one thing at a time.  Don't assume the worst. ",
      "MessageIndex": 2,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779807",
      "Title": "Lord help me, I am so afraid! LilliBell liveit56"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "May 6, 2011 02:56PM kate2011 wrote: God bless you, Sally.  Sorry for your loss.",
      "MessageIndex": 5,
      "PostDate": "06/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/768598",
      "Title": "The 8 Happiest Years of our Lives Together teachersally8467 teachersally8467"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Dec 21, 2011 08:51AM kate2011 wrote: Saw this article and it made me cry.  Very, very sad to lose her or anyone to stupid cancer.",
      "MessageIndex": 10,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779805",
      "Title": "Former miss Venezuelan dies at 28 Amyf Juliebell22"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Oct 12, 2011 10:18AM kate2011 wrote: I'm 6 months out from my lumpectomy.  I had a few areas that were hard for several months.  It finally feels normal now.  My scars are still pretty dark (just around the outside of nipple and in my armpit).  I also have some skin discoloration.  The surgeon used too much Lidocane.  It keeps fading, though.  I'm sure it will go away in time.  I still have an indentation, but it's not as bad as right after the surgery.  I'm sure that will never completely go away. Left breast is noticeably a cup size smaller than the other side now.  Oh well!!  Looks funny to me (size, shape, scars, discoloration), but it doesn't bother anyone else!",
      "MessageIndex": 3,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/776375",
      "Title": "? for Lumpectomy--afterwards tjohnson1971 tjohnson1971"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "May 5, 2011 12:34PM kate2011 wrote: Hi! New to this site.  Sooo glad to have this place. Sandee:  You made me laugh with your comments about the pity party.  So true!  I got irritated with my mom last week and thought \"This is my cancer!  You don't get to tell me how to deal with it!\".  But I really appreciate the support I've gotten here.  It's helps me so much. The ladies here have really given me the push I needed to just tackle this problem, one step at a time.  And when I feel sad, I just feel sad.  It passes.  And I feel better to know that I'm not alone, many great ladies have faced this down before me. love & hugs! ",
      "MessageIndex": 7814,
      "PostDate": "05/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "May 5, 2011 10:45PM kate2011 wrote: Michelle, I'm really sorry for your sadness and troubles right now.  Giving you a big hug.",
      "MessageIndex": 7840,
      "PostDate": "05/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "May 5, 2011 01:50PM kate2011 wrote: Thanks for the welcomes! Speaking of venting and crappy days...I had the lumpectomy last week.  My boyfriend (not long term), pretty much just walked away after that.  The final straw was Tuesday.  LOL.  Sometimes, it's just comical.  Now I just tell people that he wasn't boyfriend material, he was just comic relief.  What will happen next? Sherry: Yes, a vacation from the bills would be great, too.  I've been so wrapped up with doc appts and treatment, I've been letting them stack up.  I'm pretty far behind and totally broke! My life has definitely changed in one short month.  I don't care as much about what other people think of me, I'm less concerned about pleasing other people, and I'm not as worried about money.  Still worried, just less worried. I'm pretty grateful just to wake up and not feel as tired as yesterday. Thanks for the support!  Much appreciation & support for you.",
      "MessageIndex": 7821,
      "PostDate": "05/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Jan 10, 2012 12:26AM kate2011 wrote: Snapping necks & cashing checks!  (I just saw Step Brothers.  I've been using this one lately.) Oh, fun times. I still sometimes get this:  \"Hi, how are you DOING?\" while staring at my chest.  What do you think you are going to see?  Are you trying to figure out if I have breasts or if I have implants or what are you LOOKING AT?!  Cancer doesn't grow on the outside of my shirt!!! I have given up on the family, too.  And I think they used to be sincere when they asked \"how are you doing\".  Tried explaining the cording.  I get the impression they are sick of hearing about my bc ordeal and now they just think I'm making crap up. Some people ask because they care.  Other people ask because they are socially stunted.  I have found that no one really understands unless they have actually had bc.  So, it's nice to at least have ladies here that understand \"how i'm doing\".",
      "MessageIndex": 20,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780733",
      "Title": "oh, hi, how are you? bhd1 bobkat"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Dec 20, 2011 02:49PM kate2011 wrote: Eileenohio: I joined your party a little late, but I want you to know I'm sending you positive thoughts!  I hope your treatment plan goes smoothly. ",
      "MessageIndex": 144,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778488",
      "Title": "biopsy Eileenohio DebConway"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Nov 5, 2011 12:50PM kate2011 wrote: Hi Lamy. Yes, I'm not really looking forward to the holidays either.  I just got a batch of Halloween photos from all my friends with kids.  Thanksgiving & Christmas will be just more of the same.  Just makes me think about how I'm not going to have that happy, married with kids life.  So, I'm here for the pity party!",
      "MessageIndex": 13,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/777346",
      "Title": "Personal Pity Party BlueCowgirl kate2011"
    },
    {
      "AuthorID": "kate2011",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127230/profile",
      "Content": "Dec 20, 2011 02:48PM kate2011 wrote: I believe they did lumpectomy in both breasts and could not get clean margins in either.",
      "MessageIndex": 143,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778488",
      "Title": "biopsy Eileenohio DebConway"
    }
  ]
}