{
  "AuthorID": "kathy43",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70871/profile",
  "Posts": [
    {
      "AuthorID": "kathy43",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70871/profile",
      "Content": "Aug 15, 2008 09:15AM - edited Aug 15, 2008 09:19AM by kathy43 I am so glad that it's not just me, thank you all for posting.  I had a similar problem with my radiation oncologist, when I went back to him for my followup appointment after the radiation I tried to describe my symptoms and he sent me for a gastroscopy which came back normal.  Within a few weeks I also went to Emergency because of breathing problems and chest pains, not as severe as yours but still very worrying.  They told me I had pleurisy and said I should take NSAID's (ibuprofen).  My CT scan, EKG and chest x-ray also showed up normal.  That was about 3 months ago.  I've been taking the NSAID's, taking it easy, and while progress has been very slow, there has been some improvement.   I just saw my radiation oncologist this week for another followup appointment and he disputed the pleurisy diagnosis.  They seem to really downplay the effects of radiation.  It does affect everyone differently and because this is probably fairly rare, they seem to think it doesn't exist which is very upsetting.  Anyway he is sending me to a respirologist.  I don't know what he will say, but from reading all the posts it seems that NSAID's or steroids are the likely treatments. My symptoms are different from yours in that I am more comfortable lying down or leaning back.  I find I can then breathe with my diaphragm and not expand my chest, which is what really hurts. It also hurts when I lean forward, I probably have damage in a slightly different area.  Thanks so much for the information, it is very upsetting when you're made to feel that your symptoms aren't real.  My radiation treatments finished over six months ago, so far I still have a very real problem, but it does seem to be improving.  Good luck everyone.",
      "MessageIndex": 5,
      "PostDate": "15/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/709343",
      "Title": "Radiation-Induced Pleurisy? annac sdianel"
    },
    {
      "AuthorID": "kathy43",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70871/profile",
      "Content": "Aug 19, 2008 06:20AM kathy43 wrote: Shirlann, thanks for putting it so well.  I hope some medical people will read these posts and see how frustrating it is to not be listened to!",
      "MessageIndex": 10,
      "PostDate": "19/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/709343",
      "Title": "Radiation-Induced Pleurisy? annac sdianel"
    }
  ]
}