{
  "AuthorID": "kathy46",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63878/profile",
  "Posts": [
    {
      "AuthorID": "kathy46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63878/profile",
      "Content": "Mar 5, 2008 04:54AM - edited Mar 5, 2008 04:55AM by kathy46 Hi - I am 43 years old and had my first mammo ever in January.  The radiologist called me back for additional views.  Said they thought it was probably a skin fold.  Anyways, after the 5 additional picture I said to the radiologist this can't be good.  While I was there they did an ultrasound which showed up nothing.  The radiologist told me they were concerned about one small area less than 1cm.  She told me that they would have to do a biopsy, however, if a biopsy wasn't possible because the areas of concern was so vague, they would do an MRI, however, an MRI often showed so many false positives that she said the only way to know for sure was to have the biopsy done.  The results came back benign, just fibroid tissue.  I asked the doctor if I had to have more frequent mammograms and she said no, just make sure you come for your annual. The next day I got a phone call from the radiologist saying they were scheduling an MRI.  I told him I was confused, and he said was only reading off the original orders.  I spoke with my doctor and told her I was not having any more test done.  I have no history of breast cancer, and as far as I was concerned, the biopsy was the final answer.  Has anyone else had an MRI after a benign diagnosis?  I mean what if the MRI showed suspicion (it was only that one area and it's already been biopsied).",
      "MessageIndex": 13,
      "PostDate": "05/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/596656",
      "Title": "Results of MRI cemjo3 WinterFlower"
    },
    {
      "AuthorID": "kathy46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63878/profile",
      "Content": "kathy46 wrote: Has anyone had a BIRAD 4 come back benign Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704709",
      "Title": "BIRAD kathy46 Donna1843"
    },
    {
      "AuthorID": "kathy46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63878/profile",
      "Content": "kathy46 wrote: Has anyone had a BIRAD 4 come back benign Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "28/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704709",
      "Title": "BIRAD kathy46 Donna1843"
    },
    {
      "AuthorID": "kathy46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63878/profile",
      "Content": "May 28, 2008 09:11AM kathy46 wrote: Hi - I had a friend of mine who had pretty frequent breast infections and sounds pretty similar to what you are going through.  Antibiotics cleared it up for her.  Usually turned out to be an infected cyst because of a hair follicle. ",
      "MessageIndex": 1,
      "PostDate": "28/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/706286",
      "Title": "MRI? OptimisticWorrier OptimisticWorrier"
    },
    {
      "AuthorID": "kathy46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63878/profile",
      "Content": "Apr 15, 2008 01:38PM kathy46 wrote: My feeling has always been if they didn't mean it they wouldn't say it.   Your surgeon would never say that it looked benign if she thought it looked like cancer.",
      "MessageIndex": 1,
      "PostDate": "15/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704025",
      "Title": "question about what surgeon said--please answer flower123 leaf"
    },
    {
      "AuthorID": "kathy46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63878/profile",
      "Content": "kathy46 wrote: I would like to obtain copies of my pathology and mammography reports to bring to a new doctor.  Does anyone know how I go about this?  I would prefer not to involve my current doctor if possible. Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/702814",
      "Title": "Pathology/Mammography Reports kathy46 leaf"
    },
    {
      "AuthorID": "kathy46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63878/profile",
      "Content": "kathy46 wrote: I am a 43 year old woman who just had my first mammo. in January.  A week later I was told to come back for additional pics.  The tech told me it probably was a skin fold.  After five additional pics, I thought something was up.  They then did an ultrasound which showed nothing at all.  The radiologist told me whatever it was was very vague and she was going to schedule a biopsy, because she did not have a baseline (this was my first). However, if the biopsy could not be done, she would follow up with an MRI.  She told me that she didn't like to do MRI's because of their false/positive ratios. Long story short, I had the stero biopsy and the results were benign, just some fibroid tissue.  When my doctor called and told me this I asked her if I would have to have mammo's more often and she said no, just make sure you come for your annual.  I was thrilled.  The next day the radiologist called and told me that they wanted to schedule me for an MRI.  I told her that this didn't seem right.  There was only one suspicious area and it's been biopsied already.  I realize that they are being cautious, but enough already.  I think this is a mistake.  Has anyone ever had an MRI after a biopsy? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/701606",
      "Title": "MRI after Biopsy kathy46 lewing"
    },
    {
      "AuthorID": "kathy46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63878/profile",
      "Content": "Apr 9, 2008 01:31PM - edited Apr 9, 2008 01:32PM by kathy46 Hi - I work in a medical school and could be completely wrong but I recognize some of the verbage and I'll try to break down as much as I can for you - Ductal hyperplasia - this basically means that there is an increase in cells in the canal areas - hyperplasia actually is an increase in the number of cells under NORMAL regulatory controls, opposed to neoplasia which is an ABNORMAL increase in cells.  With mild atypia - means slight cell change.    Apocrine metaplasia - is another term for fibrocystice disease - a benign condition.   Pappilloma is a wart like lump - sometimes can develop into cancer. Multifocal Microcalcifications can be the result of cell secretions, cell debris, inflammation, trauma, previous radiation or foreign bodies.  I don't know if any of this helps.    Kathy",
      "MessageIndex": 5,
      "PostDate": "09/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703605",
      "Title": "Path rept in - Help! austin2k3 crazydaisy"
    }
  ]
}