{
  "AuthorID": "kathyob",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128240/profile",
  "Posts": [
    {
      "AuthorID": "kathyob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128240/profile",
      "Content": "Jun 3, 2011 07:31AM kathyob wrote: Such a good way to put it GabbyCal...sometimes it floors me when I think of being diagnosed, and everything happening so quickly. Seems like a dream sometimes. It's hard to get back to normal. I feel different, but just now sure how yet:)",
      "MessageIndex": 6,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/768625",
      "Title": "Just finished kathyob edwards750"
    },
    {
      "AuthorID": "kathyob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128240/profile",
      "Content": "kathyob wrote: Hi everyone. I just finished radiation yesterday and have been having some surprising emotions. I felt actually sad leaving there. It felt like a place where people really understood. I am feeling a bit unsettled, and anxious about the future. Anyone else experience this? I also continue to feel pretty fatigued, and am having trouble running and exercising, which I love to do. Thanks ! Dx 1/19/2011, DCIS, 5cm, Stage 0, Grade 2, 0/0 nodes, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/768625",
      "Title": "Just finished kathyob edwards750"
    },
    {
      "AuthorID": "kathyob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128240/profile",
      "Content": "May 28, 2011 07:53PM kathyob wrote: Thank you both for your replies...I felt the same way, protected and supported. It's odd, my family and friends have been absolutely wonderful, but it was great going somewhere where you felt people really understood you. I am three weeks out now, and have more good days than bad but it seems like if I do a lot on one day...like exercise too much or run around after work a lot, I am pretty exhausted the next day.  How are you JBinOK after your masectomy? Are you healing well?  And yes, Raincitygirl...I have to admit to procrastinating with the nasty pills. Going on vacation with my family next week and thought it might be best to hold off til after in case I have SE like the mood swings. I don't want to subject my family to that!! Have you started?",
      "MessageIndex": 2,
      "PostDate": "28/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/768625",
      "Title": "Just finished kathyob edwards750"
    }
  ]
}