{
  "AuthorID": "KatheW",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122148/profile",
  "Posts": [
    {
      "AuthorID": "KatheW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122148/profile",
      "Content": "Aug 18, 2011 05:35PM KatheW wrote: Hi to all, I just read through your posts, and I am sorry for all you are going through! The pain can be bad, but it does subside as you heal. Take your meds, eat well, and get as much sleep as you can; I am sending healing vibes your way! I am also hoping you can give me some advice as I have surgery scheduled for Sep 14. I am not sure there is a forum for that yet, but I really want to hear from you since you are all going through it now. My story: I had a lumpectomy for a 1.5 cm tumer in December; my surgeon said \"probably stage 1.\" Unfortunately, pathology revealed 3 positive nodes. I finished chemo in March, had a mx w/ TE on left side in April, and then had rads over the summer. Now it's time for the other side + diep reconstruction to both sides. I am scared! Recovery from the first mx was very painful --I curse you TE and Alloderm!-- but at least the pain was confined to my left side (2 drains), and I could sleep in bed, on my right side if I took my pain meds and had at least 3 pillows around me. To those of you that just had a bmx and/or bilat reconstructive surgery, my question is: how do you sleep? Do you sleep? How many of you are sleeping in chairs/recliners vs. beds?  (I am wondering if I should invest in a recliner) How do you get up/move? How about getting out of bed/chair to go to bathroom? How do you manage? Please share your suggestions if you have any. Kathe",
      "MessageIndex": 218,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "KatheW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122148/profile",
      "Content": "Aug 18, 2011 09:38PM KatheW wrote: abatellik, Sorry for your pain, but glad to hear you got on top of it with the Vicodin+Ibuprofen. I don't really like to take pain meds, but I took A LOT of them after my mastectomy. You say you only spent 2 nights in the recliner? And you are looking forward to sleeping in your bed? So maybe a recliner isn't so great after all? ",
      "MessageIndex": 224,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "KatheW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122148/profile",
      "Content": "Aug 19, 2011 11:18AM KatheW wrote: Dogeyed, You sound like you are recovering; it does take a while to feel good. I started rads 4 weeks after surgery. I was still in pain, but radiologist said everything looked good and that I should start so I did. Strangely, I continued to recover while getting rads. Not saying it doesn't make you sore and tired, but the deep pain went away. Now, 4 weeks out from that I feel the tissue burning/tightening up again, just in time for some more surgery trauma. Ugh. THanks for your input on the sleeping arrangements. So I see that the feedback to me so far is 1 bed sleeper, 1 recliner sleeper, 1 couch sleeper. To everyone, Thanks for letting me post in your forum. Any feedback regarding sleeping/moving post-surgery is still much appreciated. I had trouble sleeping before BC, and am very worried about sleeping after this surgery. My doctors have emphasized how important sleep is to healing and have given me no less than 4 kinds of sleeping meds! I just don't want to get addicted. Kathe",
      "MessageIndex": 228,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "KatheW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122148/profile",
      "Content": "Aug 21, 2011 10:52PM KatheW wrote: Dixiebell, Sorry you are in so much pain. Can you get more/different pain meds? Axillary node excision can be very painful (and lead to scar tissue formation). I had 14 nodes removed during a lumpectomy +  2 months physical therapy to regain full use of my left arm. In April I had a MX which inflammed the armpit again, so more physical therapy. And now radiation has aggravated it yet again. Thankfully the drains are not bothering you too much. I hope the pain subsides soon! Kathe ",
      "MessageIndex": 253,
      "PostDate": "21/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "KatheW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122148/profile",
      "Content": "Aug 18, 2011 08:58PM KatheW wrote: Blondelawyer, Good to hear you are sleeping and that just the wedge is comfortable! I see you posted about drain amounts. Did your surgeon or the discharge nurse give you guidelines about the amounts/times? Is the total amount/day decreasing; is the fluid getting clearer? I am sure that everyone's recovery experience is unique, but when I had my lumpectomy, I do remember that it was 12 days before the drainage was down to 20cc/day. At that point the surgeon removed the drain. When I had my mastectomy, one drain didn't work well and was removed after 4 days. The other drain was effective and drained lots of fluid, around 100ccs/day initially. I think it was in for around 12 days, too. Hope that helps. Take care of yourself and don't over do it physically; that can increase drainage amounts (and healing time).  Kathe",
      "MessageIndex": 223,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "KatheW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122148/profile",
      "Content": "Aug 23, 2011 10:19PM KatheW wrote: I agree with those above, take your time to decide about MX and BMX. I don't have Kaiser, but I think you can have the lumpectomy right away and then an MX later. Like Giddyup, my tumor was small and estimated to be stage 1. I opted for a lumpectomy for 2 reasons: least amount of trauma (scarring is a concern for me), and quick treatment (I wanted to \"get the cancer out\" right away). Unfortunately, pathology revealed 3 positive nodes; then I knew I wanted a BMX. Had the MX in April and having a PMX in September. Good luck with your treatment whatever you choose!",
      "MessageIndex": 13,
      "PostDate": "23/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773574",
      "Title": "A nearly impossible decision etherize Carola32"
    },
    {
      "AuthorID": "KatheW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122148/profile",
      "Content": "Aug 22, 2011 08:13PM KatheW wrote:",
      "MessageIndex": 5,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773525",
      "Title": "Groan, groan, Really bad meeting with PS tarry dontworrybehappy"
    },
    {
      "AuthorID": "KatheW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122148/profile",
      "Content": "Oct 8, 2011 02:46AM KatheW wrote: I had no nausea with Taxotere and cytoxan, but did have lots of side effects including severe bone pain (from neulasta, mainly the 1st shot), hand foot syndrome, and intenstinal cramps. Hair loss by day 15; lashes and brows gone after round 4. Neuropathy and hand foot syndrome started after round 2; my feet turned red and peeled--I even developed a corn on my big toe. And, I too gained weight. Taxotere wreaks havoc with your metabolism; your body stores every calorie it can. I took all kinds of meds to combat the worst SEs, including high doses of vicodin (bone pain), ativan (anxiety), and donnatal (intestinal cramps). Don't be afraid to ask for what you need. As for the sores, they are likely everywhere in your GI tract, not just your mouth, thus diarrea, heart burn, and rectal irritation, too. The GI lining sloughs off; not much you can do about it. I took calcium and magnesium at night. More calcium with diarrea; more magnesium with constipation. These supplements act like antacids and you can take as much as you like. I also rinsed with h2o and baking soda....biotene tasted too yucky. Now the good part: about 30 days or so after my last infusion, I felt fantastic! Food never tasted so good; nail beds stopped aching; feet looked and felt good; skin looked great! Still no hair and some neuropathy, but nevertheless that was a day to celebrate!  So do the math and figure out what that date will be for you. Write it down on a pretty pink satin ribbon and tie that ribbon around a bottle of champagne (or whatever you fancy). Keep that bottle in the fridge; you will be celebrating before you know it. I wish you all the best.",
      "MessageIndex": 97,
      "PostDate": "08/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/772325",
      "Title": "Docetaxel/Taxotere question rabbit Trisha-Anne"
    },
    {
      "AuthorID": "KatheW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122148/profile",
      "Content": "Nov 8, 2011 02:30PM KatheW wrote: I had MX, alnd, and rads. Like dlb823, I was told the ece (extra capsular extension) in one positive node was the best reason to do rads, although with 3 postitive nodes I already had good reason to do rads. NOt wanting to expose myself to ionizing radiation, I strongly resisted this treatment recommendation, and even found studies to back me up. After long discussions with my radiation oncologist (who also went through bc treatment), however, I was convinced that radiation is an effective and worthwhile treatment. I just wished I hadn't had the ALND which it seems is NEITHER. Going to rads is not fun, but you will get through it, and feel better fast.",
      "MessageIndex": 9,
      "PostDate": "08/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/777758",
      "Title": "Anyone have axillary lymph node dissection AND radiation too? finallynow deep2deep"
    },
    {
      "AuthorID": "KatheW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122148/profile",
      "Content": "Oct 16, 2011 02:09AM KatheW wrote: You are so young to have 5 children-- I had my youngest child at your age! You must be a very strong person to get through treatment and raise a family of 5 at the same time. I think you did the right thing by going with Tamoxifen. I had ovarian surgery +Lupron therapy (chemical castration) when I was 31 and went into instant and complete menopause for 6 months. The surgery was no picnic, but the hot flashes were almost unbearable! I went back to having normal periods, kids, and more periods all the way until I started chemo this year. Since I am 50, I am likely not going to have another period -which is okay with me;-). The hot flashes are back, but they are so much more tolerable now. Mebert - One advantage of Tamoxifen over oophorectomy is that it does not inhibit estrogen production. Estrogen protects you from osteoporosis and heart disease.",
      "MessageIndex": 1496,
      "PostDate": "16/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "KatheW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122148/profile",
      "Content": "Oct 15, 2011 09:18PM KatheW wrote: Mebert - I am assuming you are negative for the BRAC1/2 gene mutation, is that correct? If so you should do some online research about the benefits of oophorectomy. There are studies that indicate removing a woman's ovaries shortens her life span. Apparently even post menopausal ovaries are beneficial in some way! Pegkuj3 -  I am glad you are doing okay with Tamoxifen. I have been on and off it for 6 months and everything seems okay with me, too. I am just wondering if your onc explained how 5 years of Tamoxifen equates to oophorectomy (?). One big difference between them is that oophorectomy results in immediate and permanent sterilization! Isn't that a downside for someone who is 35? Tamoxifen does not cause sterilization. In fact, you are young enough that Aunt Flo may visit you while you are still taking Tamoxifen (and is very likely to visit you when you stop). Why did you consider oophorectomy? Are you trying to get rid of Aunt Flo? ",
      "MessageIndex": 1494,
      "PostDate": "15/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "KatheW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122148/profile",
      "Content": "Sep 16, 2011 10:04AM KatheW wrote: I had ALND and rads, too, 6 months apart. My cording started right after my lumpectomy +  dissection. While the rads undoubtedly aggravated the area, it did not cause the scarring that I have been dealing with for the last 9 months. I didn't want to do rads; I was in a gray area, too, and worried a lot about LE. My RO told me that my risk of LE from rads was 40% due to the ALND! Nevertheless she, MO and BS strongly recommended rads to my axila and breast-- even though I had clean margins and, ultimately, a MX. Breast surgery is imperfect by nature; rads is very effective at destroying small areas of cancer--that's why they offer it to BC patients. My RO adjusted my radiation doses to mimimize the risk of LE.  Yes, rads treatment is inconvenient, and that big machine is downright freaky. I certainly didn't enjoy rads, but it was not bad when compared to surgery and chemo. It was NOTHING compared to the dissection. I have had PT on and off ever since the dissection; talk about inconvenient! I have done more PT sessions than radiation sessions!! ANd someone here mentioned the drain--yes, if you have ALND you will have a drain. I have a large lump of scar tissue just from that drain; it is bigger than the scar/lump from the lumpectomy incision. I could rant and rant about ALND. I wish I had not followed my surgeon's ALND recommendation. If I had researched it first, I would have done chemo, rads, and then a PET scan before agreeing to ALND. I may have avoided it altogether; instead I may be doing PT for the rest of my life. THankfully, I have not developed LE.",
      "MessageIndex": 36,
      "PostDate": "16/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772904",
      "Title": "Axillary node dissection artiecat KatheW"
    },
    {
      "AuthorID": "KatheW",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122148/profile",
      "Content": "Sep 16, 2011 12:17AM KatheW wrote: If I had to do it over, I would do an SNB only, no ALND. My arm is never going to be normal again, and it has nothing to do with cancer. It has everything to do with scarring from the dang dissection. If your SNB is positive, you can always do chemo and rads--both highly effective. And while their side effects are not pleasant, they are temporary. ALND can leave you with permanent damage.",
      "MessageIndex": 32,
      "PostDate": "16/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772904",
      "Title": "Axillary node dissection artiecat KatheW"
    }
  ]
}