{
  "AuthorID": "Kathy_K",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
  "Posts": [
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jun 4, 2008 09:04PM Kathy_K wrote: I found that using one of those squishy micro-pellet pillows did the trick.  No more numb arms!  It was also good when I was ready to sleep on my side but the 'girls' weren't.  I just hugged the pillow to my chest and rolled and they stayed in place and I could sleep.",
      "MessageIndex": 5,
      "PostDate": "04/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706746",
      "Title": "arms fall asleep at night brendar Kathy_K"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 18, 2008 08:01PM Kathy_K wrote: Have you tried 'Goo Gone'? Give yourself some time to heal both physically and emotionally.  You'll start to feel better and better each day.",
      "MessageIndex": 3,
      "PostDate": "18/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698781",
      "Title": "Hi Everyone-It's Jump/I'm back.... Jump07 shrink"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jul 24, 2008 02:45AM Kathy_K wrote: Well, I think it is fairly common.  I had forgotten that I went in pretty regularly but I saw the surgical interns who had been in surgery with me for much of the first month.  I did see my PS at 4 weeks before he went on family leave - his wife had a baby - then again when he got back 6 weeks later.  Anyway, when all things are progessing normally, I think the 'elves' take care of as much as possible when it's things like drain removal and bandage checking in my experience.",
      "MessageIndex": 6,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/709549",
      "Title": "No doctor has seen me since hospital - normal? BustersMom curlieqs"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Nov 10, 2007 01:40PM Kathy_K wrote: Clear margins are a beautiful thing!",
      "MessageIndex": 4,
      "PostDate": "10/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/695208",
      "Title": "Clear margins roxy42 Kathy_K"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Nov 27, 2007 06:07PM Kathy_K wrote: I bet you can't wait for this year to be over, huh?  I know I sure am looking forward to 2008.  A great many things about 2007 I just want to erase from my mind. You'll pull through all this - just give yourself the time you need to do so.  You've been through a lot and there is no timetable you have to stick to.  You and your family need time to heal both physically and emotionally.  It sounds like your family is up to the challenge, though.  I know you will be getting a handle on it all soon. Take care. ",
      "MessageIndex": 2,
      "PostDate": "27/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696045",
      "Title": "Bilateral on 09/14/2007 Unicorn128 Kathy_K"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jun 11, 2009 08:22PM Kathy_K wrote: Nothing like men's-style boxy Hawaiian shirts to cover all the lumps and bumps of drains and bandages.  I used mine each time they really did the trick.  T-shirts don't work for awhile as getting things on and off over the head will be difficult for some time.  Once I could lift my arms over my head to wear the t-shirts, I still wore button-up shirts open over them to disguise the difference in sizes and everything else.  In the early days, though, I wore a lot of zippered hoodies and yoga pants.  Soft and comfy.  A ribbon or even bias tape can go through the loops on the drains and you can wear it from your neck or around your waist.  Good luck!",
      "MessageIndex": 4,
      "PostDate": "11/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735710",
      "Title": "clothing after surgery kathleenk Kathy16"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Apr 27, 2008 02:50PM Kathy_K wrote: I've got to say that I think keeping the original packing on for 48 hours was a great thing.  Once I took off the bandages and showered, there has been no weeping of anything and no crusting either.  My daughter said it is because of all the setbacks I had that I was finally catching a break. Can't wait to see them in a couple of months to see how everything looks then.  ",
      "MessageIndex": 8,
      "PostDate": "27/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/704596",
      "Title": "Could I really be done? Kathy_K lvtwoqlt"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "May 27, 2008 05:05PM Kathy_K wrote: If you wear glasses, bring a little bag to tie onto the railing to keep them in as well as the lip balm and skin lotion.  Mind kept ending up on the opposite end of the bed table every time someone came in to check my vitals. Bring a couple of cute pairs of boxer shorts to wear under your gown.  Won't care who sees them as you scoot to the bathroom. A few mints or hard candies are good to suck on for that dry mouth feeling.  Don't forget the face moisturizer! ",
      "MessageIndex": 2,
      "PostDate": "27/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706219",
      "Title": "My surgical tips/tricks nancyh lvtwoqlt"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Kathy_K wrote: I got my tattoos yesterday and thus finishing what we started last January.  It has been a long journey to get here and I'm happy it is done. I thought that I'd get a look at the color pallette first and would have a strong opinion of the right colors but that didn't happen at all.  Seeing strips of color on a white card and trying to see how those colors translate to a nipple/areola tattoo was impossible.  He pointed to different colors and described where he would be putting them and I realized that it has been so long since I've seen and paid attention to a nipple that I couldn't relate at all.  I just decide \"whatever\" and put on my headphones and zoned out while he did this thing.  I did hear one of the nurse remark to him that they didn't look like tattoos.  Since he chuckled, I assume that was a compliment. He told me to leave the bandages alone for 48 hours and then I could take them off and shower.  I'm quite nervous for the final reveal.  I have pretty high hopes and I think they are reasonable but I just don't know how I'll feel when I see them for the first time.  Will I be, 'huh! looks okay' or will I bawl like a baby from relief?  A little afraid of being disappointed, too.  Anyone else have those feelings before seeing the final product?  Or am I overthinking this as usual? When a woman tells the truth she is creating the possibility for more truth around her. Adrienne Rich Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/704596",
      "Title": "Could I really be done? Kathy_K lvtwoqlt"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Apr 26, 2008 05:23PM Kathy_K wrote: The big reveal is over.  I can only say that they were worth waiting for.  Sure, if you look carefully they aren't perfect but I'd have to say that the originals weren't perfect either.  But the difference the tattoos make to the overall look is totally amazing.  They can put Humpty-Dumpty back together again!  I look like a real live girl again. My PS had slathered lots of antibiotic ointment on them and covered them with XeroForm which kept them moist before sealing them up really well so no worries about them drying out.  Going over the 48 hours might have been dicey but I couldn't wait past 46!  No one else is home this afternoon so they are uncovered at the moment.  Kind of funny to be sitting around the house like this. I am really glad that I decided to go through with these finishing touches.  The new fipples and areolas are just what I needed to feel like I am done!  The icing on the cake and the cherry on top!  Whoo-hoo!!! Who's next?",
      "MessageIndex": 4,
      "PostDate": "26/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/704596",
      "Title": "Could I really be done? Kathy_K lvtwoqlt"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Apr 20, 2008 10:25PM Kathy_K wrote: I've heard that the host site for the areola grafts is the only painful part of the nipple/areola reconstruciton.  My PS just uses skin from the breast to make my nipples and then the tattoos to finish off. I had my nipples made 8 weeks ago using the star flap and while they were huge in the beginning - much like breast-feeding nipples - they have shrunken quite a bit and are now maybe 1/3 the size they were.  One shrunk faster than the other and I was worried that one would be small and the other large.  But, I think they'll be okay.  Suppose to get the tattoos done on Thurs. and then I'll be all done. I think you'll start feeling better in a couple of days so hang in there.",
      "MessageIndex": 3,
      "PostDate": "20/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/704300",
      "Title": "Nipple - Areolar Reconstruction ferrajina candy2007"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jun 20, 2008 05:12AM Kathy_K wrote: My PS used a similar product on me last Sept. and it has worked out beautifully.  DNA-removed cadaver tissue had been used for many years for variouse types of surgery including oral surgery and abdominal surgery.  Using it to make a sling for the implant after a mastectomy was pioneered by a doctor in NYC about 5 years ago with much success.  The advantages of this surgery is that just one surgery is necessary and the recovery is pretty fast.  I went on vacation 3 weeks after surgery even though I still had a drain.  You will have weight-lifting restrictions for the first month or more regardless of the type of reconstruction you have.  With implants under the muscle, it feels weird when you make certain movements.  Pulling motions won't work right away and lifting things like a full laundry basket is not a good thing.  But getting someone else to carry that thing around isn't a bad thing - my husband still does it for me, now. I have heard that once you have implants you should not do push-ups.  Other than that, I haven't noticed any weakness. Since the cadaver material has had all the DNA removed it is ready for your own DNA to take it over.  Very quickly, your body grows cells that take over the material and that includes capillaries to restore blood supply.  I think that as long as your PS uses the proper protocol for handling of the Alloderm and the implant, you will have a very good outcome.  It sounds like he has done this before but I would ask him about his track record with it. Good luck!",
      "MessageIndex": 12,
      "PostDate": "20/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707522",
      "Title": "alloderm ocean_snow lvtwoqlt"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jun 27, 2008 04:42AM Kathy_K wrote: When I had my surgery, I was pleasantly surprised to find that Kaiser didn't have any problem using a cadaver material.  They used DermaMatrix on me. If someone is deciding between paying the $$ for the Alloderm or the cost of the fills and the second surgery for the exchange, you might (?) find that the dollar cost is similar without the lost work time.  Depending on your insurance coverage, of course.  Something to consider, though, when doing research.  Not so good when you find out after the fact.",
      "MessageIndex": 20,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707522",
      "Title": "alloderm ocean_snow lvtwoqlt"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "May 27, 2008 05:05PM Kathy_K wrote: If you wear glasses, bring a little bag to tie onto the railing to keep them in as well as the lip balm and skin lotion.  Mind kept ending up on the opposite end of the bed table every time someone came in to check my vitals. Bring a couple of cute pairs of boxer shorts to wear under your gown.  Won't care who sees them as you scoot to the bathroom. A few mints or hard candies are good to suck on for that dry mouth feeling.  Don't forget the face moisturizer!  Bring a good eye mask if you want to sleep. ",
      "MessageIndex": 3,
      "PostDate": "27/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706219",
      "Title": "My surgical tips/tricks nancyh lvtwoqlt"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Oct 24, 2007 07:52PM Kathy_K wrote: That's the tricky part!!  The first couple of days I needed help getting the feet up - ours has the lever on the side.  You just do what you can.  You may not be able to use a recliner if you are home alone for the first few days.  I did end up just squirming my way out of it sometimes and then just fell back into it.  Very graceful.",
      "MessageIndex": 2,
      "PostDate": "24/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/694338",
      "Title": "Recliner question shrink Erica"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 17, 2008 12:20AM Kathy_K wrote: Don't know what might be the cause of that.  I think it is probably something you need to have checked out by your doctor. Good luck! ",
      "MessageIndex": 1,
      "PostDate": "17/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698664",
      "Title": "New after surgery problem, not sure what it is? Hindsfeet snowyday"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Apr 6, 2008 07:27PM Kathy_K wrote: The first thing upon waking up is that it is amazing that the surgery is all over.  I don't remember even getting into the OR just wheeling down the hall and then 'good night'.  Then I slowly woke up in the recovery room with the beeping of the machines and a new nurse checking things out.  Only slightly disorienting.  Regardless of the type of surgery you are having, the waiting for it is the hardest part!  I swear!  I'm having my tattoos on that day!  I'll be awake and bored out of my mind, though.  At least when you are knocked out the time flies by so quickly. You'll do just fine, I'm sure.",
      "MessageIndex": 1,
      "PostDate": "06/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703502",
      "Title": "Waking up after Surgery maryjaneFL SandyinSoCal"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Oct 27, 2007 02:49PM Kathy_K wrote: My in-laws have an electric chair (not that kind) and it was wonderful!  Too bad they live so far away to do me any good after my tram surgery!",
      "MessageIndex": 6,
      "PostDate": "27/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/694338",
      "Title": "Recliner question shrink Erica"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Dec 23, 2007 12:35PM Kathy_K wrote: Between drainage and other things this year, I found lots of new uses for maxi pads and disposable nursing pads.  The nursing pads are smaller and do a great job of catching stuff, too. And like Shrek says - 'Better out than in!' ",
      "MessageIndex": 5,
      "PostDate": "23/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/697262",
      "Title": "Drainage at Tube Removal Site golfer779 golfer779"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Feb 7, 2008 10:42PM Kathy_K wrote: In early Nov. 06 I had a biopsy to investigate some calcification.  That showed DCIS.  So we did a lumpectomy in early Dec. 06 to make sure there were clear margins.  That showed massive amounts of DCIS with micro-invasion.  My BS was shocked and went to my mammogram pictures to see if he could find them.  He couldn't.  Like Sally, I was offered another lumpectomy.  I felt like the writing was on the wall.  I felt like there was probably more to be found and didn't want to play the game of hide and seek with it.  Didn't want to put myself or my family through even one more and the wait for the pathology report to come.  I went in for a mastectomy with free tram on Jan. 3, 07.  The path report confirmed that I had made the right choice.  I'm glad that it is over and all that DCIS is out of there! Moving on with my life now.",
      "MessageIndex": 9,
      "PostDate": "07/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/699343",
      "Title": "decision making nursenancy95 crazydaisy"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jul 2, 2008 11:39PM Kathy_K wrote: My papers from the  doctor  said that one toenail and one fingernail should be nude so the anethesologist could watch the color.  Wanted to be able to see if they turn blue.  Good luck!",
      "MessageIndex": 8,
      "PostDate": "02/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708439",
      "Title": "Can I wear toenail polish to surgery? BustersMom jdg1"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jun 28, 2008 10:32PM Kathy_K wrote: First, the radiologist will place the wire using another mammogram to locate the site.  That wire guides the surgeon to the right location.  So the scar you will have is just from the lumpectomy.  Not a big deal at all - try not to worry about it too much.  I thought it was funny when they taped a paper cup over the wire so it wouldn't get caught on anything.  I felt like Madonna so I asked for another on for the other side.  They said 'no'.  No sense of humor, I guess.",
      "MessageIndex": 3,
      "PostDate": "28/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708226",
      "Title": "surgical biopsy with needle localization sushi2 sahalie"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Sep 10, 2008 05:30AM Kathy_K wrote: During my 8-hr surgery, my husband did some work on his laptop and took phone calls.  Then he and my son went to a movie and got back just in time to hear that I was in recovery.  I was happy to have missed the guy movie they chose so it was all right with me!",
      "MessageIndex": 2,
      "PostDate": "10/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/720898",
      "Title": "What to do while in the waiting room! Route53 Route53"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Feb 18, 2008 09:51PM Kathy_K wrote: Maybe you were itchy before just just couldn't feel it due to the numbness from the surgery?  Anyway, I'm glad to hear that there was no infection going on there.  Hope you feel better soon.",
      "MessageIndex": 7,
      "PostDate": "18/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/700447",
      "Title": "weird rash along incision site sandilee NST40"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Dec 2, 2007 02:38PM Kathy_K wrote: I think you are very normal to have a pity party.  It sucks!  There is never a good time for it to happen, either.  Last year I was having a lumpectomy this week that lead to knowing I'd have to have a mastectomy in January.  It was a quiet Christmas in my house, too.  The stages of this are similar to mourning - grief, anger, denial.  Then acceptance and after you've done your research and made your decisions, peace.  But the angry warrior is still there working to make sure that everything goes the way it should.  Just try to keep it under contol around people who may be easily wounded - some family members, for instance.  Do you understand what I mean? Remember to take time to breathe!  Don't let this take away your joy and love of life.  Don't give it that power.  You can choose how you will respond.  I chose to surround myself with loving people and used laughter as my medicine and looked for the silver lining in everything.  It worked for me.  You'll find your way to what works for you. Breathe!!  I'll pray for peace for you. Kathy ",
      "MessageIndex": 9,
      "PostDate": "02/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696217",
      "Title": "After all surgery and treatment sarahb iodine"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Feb 6, 2009 11:22PM Kathy_K wrote: Wow, another fallout from the CA budget crisis.  I'm sorry that you got that news.  I think an appeal makes sense especially if you have a family history of breast cancer. Good luck!",
      "MessageIndex": 2,
      "PostDate": "06/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/728596",
      "Title": "I am soooooooo ANGRY!!!!! auroravtj mikita5"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jul 25, 2008 11:43PM Kathy_K wrote: I had to just ride an elevator but I had the dixie cup, too.  Felt a bit like Madonna in her older days.  Think good thoughts!  Good luck!",
      "MessageIndex": 2,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/709669",
      "Title": "breast surgery fuzzypeach CAZ"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Dec 8, 2008 02:58AM Kathy_K wrote: Gettin the pull-over shirts on is pretty easy.  It's getting them off again that is tough!  Make sure they aren't too tight too soon,",
      "MessageIndex": 9,
      "PostDate": "08/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/725566",
      "Title": "when can you wear clothes going on over head? rayhope sunflower45"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Apr 10, 2008 02:12PM Kathy_K wrote: It seems to me that a lot depends upon the type of BS you have.  BS have one thing on their minds - getting the cancer out.  They leave the picking up of the pieces to the PS and many don't talk to them to find out what problems they (the BS ) created by their method of surgery.  The BS may not have any clue that rads cause problems with reconstruction down the line and give their recommendations based on statistics of survival and nothing else. If your BS is in a clinic type setting with a PS, they are more likely to work  together.  I'm with Kaiser and after my BS gave me my bad news, he sent me to his PA who talked to me about my options of reconstruction.  She is the one who set up my appointment with the PS I wanted to use.  Then, the surgery scheduler went to work to find a date that would accomodate both surgeons.  If your BS doesn't work hand-in-hand with a PS, it is really difficult to schedule two doctors to do the immediate reconstruction.  My friend's BS pretty much works on his own.  He did give her a recommendation for a PS but the PS was booked for 4 months.  And even at that, he didn't want to talk to her until 8 weeks after her initial surgery.  Hope this made sense.  CMB, I have no doubt that you will overcome this hurdle and will eventually have an outcome that you will be happy with.",
      "MessageIndex": 11,
      "PostDate": "10/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703666",
      "Title": "I am so pissed! cmb35 LisaSDCA"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "May 16, 2008 11:27PM Kathy_K wrote: I had a weird experience this week, too.  I was told that I have a spot of basal cell carcinoma on my nose.  \"If you are going to get any kind of cancer, this is the best one to get.\"  I told them that they were too late!  I am thinking that the prospect of having surgery on my nose would have been a bigger deal to me 2 years ago but after this last 18 months?  Not so much.",
      "MessageIndex": 2,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/705660",
      "Title": "The \"BEST\" Kind of Breast Cancer!!! canuckintx Skyrat"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Feb 19, 2008 09:42PM Kathy_K wrote: What I have noticed, too, is when I'm cold some nerves are trying to react by tightening the nipples which aren't there.  I'm wondering if I can condition my mind to accept the new nipples and transfer those feeling to them.  Can't hurt to try.  I have also had the feeling like a rubber band snapped inside there somewhere - a nerve firing up or something.  That happened mostly during the early days after surgery.",
      "MessageIndex": 6,
      "PostDate": "19/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/700656",
      "Title": "Phantom feelings from the absent breasts? mke ivy62"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Feb 19, 2008 11:46PM Kathy_K wrote: I have one implant and free tram.  They both react to the cold the same way.  That is pretty weird, actually.  The implant side does decide to spaz out for no particular reason.  I had the one-step implant Sept. 07 so I have hopes that it will eventually calm down more and more.",
      "MessageIndex": 9,
      "PostDate": "19/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/700656",
      "Title": "Phantom feelings from the absent breasts? mke ivy62"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Feb 2, 2008 01:58AM Kathy_K wrote: You just had surgery!  Your friends don't expect to see you with your hair and makeup perfect!  In fact, the better you look the less likely they are to think you might need help or want to have a visit.  Let them come and help you wash and dry your hair until the drain comes out.  It can be a great bonding experience. Meltdowns happen!  We never know when or where they will happen.  Just go with it and get it all out.  You'll feel better for it.  ",
      "MessageIndex": 4,
      "PostDate": "02/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/699603",
      "Title": "post mast meltdown DianeNMil lvtwoqlt"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Feb 19, 2008 09:49PM Kathy_K wrote: Shelly, I'm so sorry you got this news.  It would freak me out, too.  I think you might feel better about making a decision if you had the biopsies and knew for sure what you were dealing with.  Just know that there is no need to rush into a decision.  You need to get more information before you can act. I had a somewhat similar experience and so I understand the feeling of wanting to kick yourself for not going all the way the first time.  But we can't turn back the clock and can only deal with the information we have available to us at the time.  You have new information and you have to deal with that separately from your other surgery before you can move on. Good luck! Kathy ",
      "MessageIndex": 1,
      "PostDate": "19/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/700657",
      "Title": "What should I do ??????.... bermudagem bermudagem"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 11, 2008 12:53AM Kathy_K wrote: Disposable nursing pads are small and work great, too.",
      "MessageIndex": 9,
      "PostDate": "11/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698187",
      "Title": "Drains question mmcp bean4865"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 7, 2009 07:02PM Kathy_K wrote: Think of it as turning in your 'superwoman' cape for a 'princess' crown.  You don't have to do it all at all and certainly not now.  Just pretend that you are the princess and everyone should wait on you.  Of course, you are a gracious princess and not crabby, demanding one.  Remember that the more rest you get the faster you will heal.  Just put your feet up and soak up the love and attention of your family and friends.  They really want to make this all better for you and doing things for you is the best they can do since they can't have the surgery for you or make it all go away.  Smile and say 'thank you'.  It is okay!",
      "MessageIndex": 2,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726929",
      "Title": "How do I let others help me in this time? cajavi5 twirlgirl"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 28, 2009 06:51PM Kathy_K wrote: An interesting case where just one letter makes such a huge difference.  I'm sorry that you have to undergo more surgery.  It is amazing that the typo was discovered, though.  So easy to have missed. I understand your anger.  Good luck!",
      "MessageIndex": 1,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/728145",
      "Title": "Typographical Error on Pathology Report Britt Britt"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 5, 2008 01:01AM Kathy_K wrote: Keep a small pillow over any tender areas as a preventative measure.  It helps. Welcome home!",
      "MessageIndex": 8,
      "PostDate": "05/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/697795",
      "Title": "latissimus flap and expanders mittmott Kathy_K"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Feb 7, 2008 07:51PM Kathy_K wrote: I took a pair of pajama bottoms or boxers to wear under the gown and then didn't worry about exposure.  With flap surgery the keep you pretty warm so I never used my fluffy robe - too hot!  I only used, hand lotion, facial moisturizer, chapstick, iPod with some music and old tyme mystery theater (not that great as it turns out but I didn't mind if I fell asleep and missed any of it),  a good eye mask !!!, a comb and brush and maybe a headband or scrunchee, and their gowns and slipper socks.   Just took along clean underwear and wore the clothes that I came in home.  That makes for a small bag to carry.",
      "MessageIndex": 14,
      "PostDate": "07/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/699835",
      "Title": "Is there a \"packing list\" for surgery? Panchoandlefty lvtwoqlt"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Aug 12, 2008 09:44PM Kathy_K wrote: It is hard to insert a catheter if you are wearing undies!  At one of my surgeries, I think an outpatient one, I was told that if my undies were cotton they could stay on.  Otherwise, they had to come off.  Why couldn't they have told me about that beforehand?  I also took my own socks but I wasn't allowed to wear them as they couldn't confirm that they were sterile enough for the operating room.",
      "MessageIndex": 5,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719370",
      "Title": "HELP! Question before bilat-mast surgery ShariAnn Kathy_K"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Nov 12, 2007 09:47AM Kathy_K wrote: Both times I went in for SNB I was given an injection of lidocaine first and had no problem with the radioactive tracer going in.  The blue dye wasn't injected until I was asleep, though. Kathy ",
      "MessageIndex": 12,
      "PostDate": "12/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/695213",
      "Title": "Surgery bapnkat melody"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jun 23, 2008 01:33AM Kathy_K wrote: My doctor said no showers until the drains come out.  I brought home a bottle of the wash they use in the hospital and that worked pretty well.  Had to have help washing my hair in the kitchen sink til I could shower.  Nothing feels as good as that first shower except maybe for getting those drains out. Kathy ",
      "MessageIndex": 11,
      "PostDate": "23/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706721",
      "Title": "Toilet Items suggestions for after surgery Young79 Iamblessed"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 4, 2009 10:33PM Kathy_K wrote: My downstairs nest included my laptop, a book, some magazines, a knitting project, a crocheting project, the remote, and the telephone.  I found that I had serious A.D.D. the first couple of weeks and was easily bored except for when I was watching a movie. We wrote on the top sides of the medicine bottles the times of day when they were to be taken like 6 - 10 - 2 - 6 - 10 - 2.  I didn't have to think about which one I needed to take when - just matched up the numbers  to the clock.",
      "MessageIndex": 18,
      "PostDate": "04/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726639",
      "Title": "Back home - what will I need help with? ghety ghety"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Apr 21, 2008 07:54PM Kathy_K wrote: With the meds. use a permanent marker and just write the times of day to be taken on the lid.  8-12-2-8-12-2 or whatever your spacing is.  Make it big enough to read without your glasses or bright lights.  No thinking needed - just a grasp on the time of day!  That is enough to handle as it is! Rest, rest, rest!  Remember, naps are our friends.",
      "MessageIndex": 7,
      "PostDate": "21/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/704276",
      "Title": "Surgery May 1st CaseyDoodle CaseyDoodle"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Feb 6, 2008 08:11PM Kathy_K wrote:",
      "MessageIndex": 5,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/699648",
      "Title": "I feel alone worldofdance whoopsiedoodles"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 4, 2008 01:52AM Kathy_K wrote: I worried about my cat getting carried away with the kneading and poke through and puncture my implant.  With the numbness I might not have noticed. You'll be fine and you will feel better once you are home. Kathy ",
      "MessageIndex": 6,
      "PostDate": "04/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/697795",
      "Title": "latissimus flap and expanders mittmott Kathy_K"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Mar 9, 2008 05:22PM - edited Mar 9, 2008 05:23PM by Kathy_K Oh, man, this is quite a subject that I've been dealing with.  I have been up and down so much last year, first with a partial flap failure and the yuckiness involved with that and the problem my tummy incision had.  That was pretty distressing both to deal with as well as how it looked.  Then I got that all revised and a reduction but the PS couldn't close up the incision on the reduced breast due to blood flow issues.  My husband was in the office when he revealed that and it was pretty gross.  So then, I go back in and get that fixed but then was told that my pathology report came back with bad news so I needed to come up with another plan for that side - just when I thought we could get back to a normal life without bandages.  So , with all the things that kept happening, he was a little afraid to look at me.  Fast forward to getting new fipples 2 weeks ago.  Now my DH isn't afraid to look at me as the breasts start once again to look like breasts and less like someone's bad clay reproduction.  He is still trying to get over the fact that I don't feel any pain and it is okay to touch.  As the scars fade and I get closer to being done, I feel more like myself again.  I find that I don't mind a little nipple show-through in t-shirts anymore - I earned the right to show them off! ",
      "MessageIndex": 6,
      "PostDate": "09/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/701875",
      "Title": "Accepting the new you crazydaisy jdg1"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Feb 20, 2008 10:06PM Kathy_K wrote: Are you squeezing out the air from the bulb before closing it up?  It sounds like there isn't any ore enough suction.",
      "MessageIndex": 7,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/700506",
      "Title": "Drains??? immalovinyou BessB"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 2, 2009 10:10PM Kathy_K wrote: I actually found the stairs to be very easy.  I took them slowly, of course, but I did them without any trouble.  Didn't do them very often but did them when necessary.  Move as much of your stuff as possible downstairs.  Set up your area to do the drains in a downstairs bathroom if you have one.  Also move your pillows, blankets, PJs, clean underwear, etc. downstairs, too, so you don't have to go up much.  Make yourself a nice little nest.  My son put a fitted sheet on the recliner and that kept me warmer and it was easier to get in and out of it.",
      "MessageIndex": 11,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726639",
      "Title": "Back home - what will I need help with? ghety ghety"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "May 24, 2008 04:21AM Kathy_K wrote: Sarmcl, don't worry about the delay.  The cancer doesn't grow that fast that a little wait will hurt you.  Whichever reconstruction method you choose, having the mast. and recon done at the same time saves a lot of time and wear and tear on your body and family.  Just getting it all done and waking up from surgery and knowing that you are done makes it all easier to bear.  Last Sept. I had the one-step implant procedure done and that surgery was pretty easy to recover from.  I went on vacation my 3rd week.  I would think that if you are doing expanders, you would feel pretty good by then, too.",
      "MessageIndex": 3,
      "PostDate": "24/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706060",
      "Title": "Mastectomy w/reconstrcution sarmcl Erica"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Feb 21, 2008 12:55AM Kathy_K wrote: Mine was still putting out 60+ a day at 4 weeks but, like yours, my PS felt it was better out than in at that point.  I was concerned but it worked out alright.  Watch to be certain that you aren't using your arm/arms too much.  Too much activity can cause increased output.",
      "MessageIndex": 3,
      "PostDate": "21/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/700729",
      "Title": "Drain Removal CBJ otter"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Feb 2, 2008 06:17AM Kathy_K wrote: I know what you mean Diane but, trust me, your friends are dieing for you to call them and give them a task that they can do for you.  I remember one friend who was in tears when she heard about my diagnosis last year but cheered up immensely when I gave her a job that I needed done - which was to help me research a surgery that I was considering.  Another friend came to wash and dry my hair - my daughter and husband had been doing it but it made her feel good to have something concrete to do.  They'd love a chance to repay some of the favors you have done for them over the years.  It doesn't mean that you are weak or the cancer girl.  I think it means that you care enough to let them in.  And they won't feel like they are always the weak ones. I had a free tram last year on my right side and while I waited for the reduction on the I used shoulder pads to help even out the two sides.",
      "MessageIndex": 12,
      "PostDate": "02/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/699603",
      "Title": "post mast meltdown DianeNMil lvtwoqlt"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Dec 3, 2007 05:01AM Kathy_K wrote: My boss loves to show her gall bladder scar from 10 years ago that she treated with Vit. E oil.  The scar is invisible. Many women swear that they did nothing and just let time take care of their scars and it did.  I figure that doing anything is better than nothing so I can say later that I did try.  I think the oils and massage does make everything feel better. I have heard that honey is good for scars but I can't imagine wearing it on my breasts.  The stickiness would drive me crazy.  ",
      "MessageIndex": 6,
      "PostDate": "03/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696301",
      "Title": "reducing scarring vanchic rubytuesday"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Mar 11, 2008 07:29PM Kathy_K wrote: It WILL get better!!  When you have your Stage 2 your PS can take down some of that extra fullness in your flap breast.  As far as trying to balance things out, try some shoulder pads for now.  I had ones with velcro so they held on to the bra pretty well. I found that while I waited for things to heal and get balanced (for me it was 6 months) I wore a lot of hawaiian print shirts that were somewhat loose.  I was a sagging DD on one side and high and tight C on the other.  So I also stayed away from anything with a horizontal decoration that might draw attention to that fact.  The shoulder pads were worn a little toward the bottom to help disguise it, too. All in all, though, no one but me seemed to notice expect for when I mentioned the problem to a friend and she looked hard and assured me that without my pointing it out, she didn't notice it.  So, don't be hard on yourself.  Put a smile on your face and go out there and do whatever you want to do. FYI, I am 55 and am loving having a smaller bustline - a C now - but trying not to get too carried away and dress too young.  It's tough to find that fine line sometimes.",
      "MessageIndex": 24,
      "PostDate": "11/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/701875",
      "Title": "Accepting the new you crazydaisy jdg1"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jul 4, 2008 07:36PM Kathy_K wrote: I think that no matter what the procedure, the waiting/anticipation is the worst part of it all.",
      "MessageIndex": 5,
      "PostDate": "04/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706884",
      "Title": "SNB and wire localization Yvon1 Kathy_K"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Oct 27, 2007 02:47PM Kathy_K wrote: What type of reconstruction are you going to go for?  I'm sure you have mentioned it before, but I don't remember. Glad to hear that you are feeling well.",
      "MessageIndex": 1,
      "PostDate": "27/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/694520",
      "Title": "waiting after mast for reconstruction jade jade"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Feb 17, 2008 01:07PM Kathy_K wrote: My last surgery sent me home with just one drain but it stayed with me for 4 weeks.  Just kept pumping out the fluid.  I had to go out of town during week 3 and actually made an appointment with a doctor to get it pulled but I had to cancel.  It was still collecting 45ml a day and we were waiting for it to hit 30 or below.  Finally, my doctor decided to pull it anyway - he didn't like my being on antibiotics all that time and more.  Fortunately, it worked out okay.  I may have had a little accumulation but it resolved itself fairly quickly. It would be weird to have them fall out on their own, though.  The stitch holding them in must not have been tied very well.  Mine was holding a little too well by the end. Time will pass and it will feel soooo good to get those drains out that it makes up for all the hassle.  Hang in there! ",
      "MessageIndex": 4,
      "PostDate": "17/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/700506",
      "Title": "Drains??? immalovinyou BessB"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Feb 20, 2008 10:05PM Kathy_K wrote: Are you squeezing out the air from the bulb before closing it up?  It sounds like there isn't any ore enough suction.  My only problem was that my last drain kept draining too much and I had to keep it for 4 weeks.",
      "MessageIndex": 6,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/700506",
      "Title": "Drains??? immalovinyou BessB"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Mar 21, 2008 06:07PM Kathy_K wrote: I had a volunteer visit me in the hospital to see if I needed anything.  I only remember her telling me that there were support groups to go to but she had found them depressing and had only gone to one or two meetings.  That was that.  When I left the hospital I took with me the little slippers, a box of rubber gloves, a spare tummy binder and those generic bedside supplies they bring you (the water pitcher& tub), and the bottle of body cleanser.  I chose to leave that lung exerciser behind.  Oh, and of course, the little measuring cups to measure drain output.  Oh, yeah!  I got a free ride to my car!",
      "MessageIndex": 46,
      "PostDate": "21/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/701875",
      "Title": "Accepting the new you crazydaisy jdg1"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jun 7, 2008 12:33AM Kathy_K wrote: The wire localization was fascinating, I thought.  I went into the mamo. department at the clinic and the plate they used had a rectangular opening in it with grid markers along each side.  A picture was taken and then the radiologist pinpointed the area where the wire should go ( G - 4 ) and that is where the wire was inserted (after numbing the area first).  They took another picture from another angle to confirm that the placement was correct then they covered the end of the wire with a paper cup they taped down to protect it from catching on anything.  I felt a little bit like Madonna and asked for a matching cup on the other side - denied! I had the radioactive dye injected the afternoon before my surgery.  In my case, I was injected with a mixture of the tracer and lidocaine so it didn't really hurt.  For the other side, I had it injected the morning of the surgery so I had to massage that breast to convince the dye to get moving. It isn't really that bad.  You'll be fine, I'm sure.  Good luck!",
      "MessageIndex": 1,
      "PostDate": "07/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706884",
      "Title": "SNB and wire localization Yvon1 Kathy_K"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 13, 2009 05:26AM Kathy_K wrote: Surgical clips are fairly normal.  They don't talk about them as a general rule.  I didn't know about them until my chest x-ray was read and they came and asked me if I'd had surgery.  My PS said that they were indeed in there and not a problem.  At least they didn't set off the metal detectors in the airports.  ",
      "MessageIndex": 4,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727196",
      "Title": "Something left behind in surgery? Leisa1968 AlwaysHope"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Oct 2, 2007 03:13PM Kathy_K wrote: I can't believe that some of you went home after only 2 days!  I didn't go home until the 6th day.  Took me 2 days just to figure out how to get out of bed without hurting myself.  I could have gone home the 5th day but decided not to push it but basically did everything for myself as a test.  I was on a pain med pump for the first 4 days then on to oral meds. I'd say that I didn't start to feel good until the 3rd week and like my old self again at 8 weeks.  All that time I was on lifting restrictions - nothing over 10 lbs.  Pulling doors open will be a challenge and no vacuuming! (what a shame!)  I'd really say to you to lift nothing heavier than a coffee cup.  Oh, yeah, you won't be able to have anything with caffeine for the first 2 weeks - tea, coffee, chocolate.  You'll likely be walking hunched over for the first 2 weeks, too.  You'll notice all the stuff on your floors.  Just ignore it or get someone else to pick it up/mop it up.  Once you start cleaning your house your family members will think that you can do it all and you can't!!!  It's a slippery slope.  You need to rest and recuperate.  That is your only job! You will probably go home with as many as 6 drains which will need to be 'milked', emptied and measured 2xdaily.  You'll feel like you are running some weird science experiment.  That's all I can think of for now. Good Luck! ",
      "MessageIndex": 6,
      "PostDate": "02/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/692988",
      "Title": "request for info on bi-lat mastectomy with TRAM lilpiggy sharebear"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jul 24, 2008 10:51PM Kathy_K wrote: In addition to the above-mentioned items, I couldn't have gotten along without my eye mask.  The nurses kept flipping on the lights all night and I can't take that.  It's also good for getting a nap during the day - it is obvious to everyone that you are trying to sleep.  I also took a facial moisturizer.  I made myself a little cloth bag to hang near my head that held that chapstick and my glasses so I could reach them easily.",
      "MessageIndex": 5,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/709628",
      "Title": "HELP...PLEASE...NEED ADVICE... nourtneybhorn BustersMom"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Oct 13, 2007 01:46PM Kathy_K wrote: If you can't get the IV tubing a piece of ribbon or bias tape will work, too.  You can thread it through the loops on the drains and wear it around your neck or waist.",
      "MessageIndex": 7,
      "PostDate": "13/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/693656",
      "Title": "Getting ready for my surgery AnneW CarolC"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Oct 14, 2007 12:10PM Kathy_K wrote: Well, then, why not just decorate the drains and wear them outside the shirt?  They could even be very funky earrings!  Okay, maybe not!",
      "MessageIndex": 10,
      "PostDate": "14/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/693656",
      "Title": "Getting ready for my surgery AnneW CarolC"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Aug 29, 2008 02:23AM Kathy_K wrote: I feel for you, for sure.  I was lopsided for about 6 months and it was the pits!  I have to say that I don't see how wearing a bra that supports your one side could harm the flattened side.  I used some good sized shoulder pads in mine to help even things out a bit.  I found that for the most part, as long as I didn't wear anything with a horizontal pattern or stripe, it wasn't noticable unless I pointed it out to someone.  Shoulder pads and big-patterened shirts (Hawaiian) were great ways to disguise the size difference.  But, really, morning is right, it is amazing how little anyone looks at our chests!  Even when to us it seems like there is neon light proclaiming that something is wrong. Wear a big smile and forget about it!  I know, easier said than done.  But you will actually get busy at work and not even think about it and neither will anyone else. Kathy",
      "MessageIndex": 3,
      "PostDate": "29/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/720273",
      "Title": "lop sided for 6-8 weeks - help Viktoria vhqh"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Dec 1, 2007 05:31PM Kathy_K wrote: I'd go find a cute pair of silky boxers to wear under your gown.  Then you can get up and move around without finding your robe or mooning everyone.  Helps to slide out of bed, too.  I think I just wore those non-slip socks 24/7 in the hospital so no looking for slippers. I would also add a good eye mask.  I found that nurses turn on lights at the worst times.  I just kept mine on and let them go about their business and pretended to be asleep. Chapstick or a lip balm, hand lotion, and the iPod charger just in case.  Oh, and take a couple of DVDs you like but wouldn't mind sleeping  through.  Good Luck!",
      "MessageIndex": 6,
      "PostDate": "01/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696267",
      "Title": "What to bring to the hospital luvmyself shrink"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 31, 2009 08:55PM Kathy_K wrote: I guess in hindsight that having the PS be so matter-of-fact about this is because he/she has seen it before and knows that while it may suck big time now, he can fix it all later.  When I had my partial failure and was so grossed out and upset, he was very calm about it all.  How could he be so calm about something so terrible!??!  I guess because it isn't personal to him - just a change in the game plan. Hang in there.  The bleeding will stop and you will heal and the PS will be able to fix you up again.  Kinda like Humpty-Dumpty.",
      "MessageIndex": 7,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/728212",
      "Title": "Complications after TRAM revision - Help! pameliza Kathy_K"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 1, 2009 09:45PM Kathy_K wrote: Having someone around to take care of all those things that need being done is a wonderful thing.  I can't tell you how many times I needed someone around to tell me to stop trying to do something I felt needed to be done right now.  One thing about having your tummy tightened and you walk around slightly hunched for the first few days, you see all the dust bunnies and other things that need to be picked up.  I can sweep that up pretty quickly.  No!!!  Let her do the laundry and cooking and cleaning and then watch movies with you when you are awake.  You'll find that you get tired very easily and need naps.  Naps are good - 2-year-olds give them such a bad rap. It is also nice to have someone around to shampoo your hair for you and blow it dry.  You won't be able to raise your arms that high or keep them up for very long.   Get lots of rest and if you feel that you need to take care of something, go take a nap until the urge goes away.  There will plenty of things to do when you are feeling up to it more - like during week 4 or later.  Rest,  rest, rest!",
      "MessageIndex": 4,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726639",
      "Title": "Back home - what will I need help with? ghety ghety"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 3, 2008 07:21PM Kathy_K wrote: What type of reconstruction is she opting for?  She will have the drains for a couple of weeks, typically.  They will need to be emptied and the output measured twice a day.  You will need to keep track of the level of the output - it is an early warning of problems.  Once the output is less than 30cc a day the drain will be removed.  They are a serious pain in the butt but once they are gone - whew! I'm guessing that she will also have an SNB - sentinel node biopsy - during the surgery, too.  She will experience swelling under her arm and it will be quite numb.  It'll feel really odd when she tries to shave under there for quite awhile.  I also found that stick deoderants bugged me so I switched to a gel type. How out of it she is depends largely on the type of reconstruction.  A recliner - electric if possible - will make sleeping at home easier. I can give you more tips after you tell me the type of reconstruciton, okay? She can do this!   ",
      "MessageIndex": 3,
      "PostDate": "03/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/697866",
      "Title": "what should we have on hand? Nova Nova"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jul 4, 2008 06:34PM Kathy_K wrote: When I had my wire-guided biopsy, I was awake and the surgery was done with a local.  But when they went back in to do the lumpectomy, I was told that a local wouldn't work again in the same area. (?)  Anyway, I was out for that one.",
      "MessageIndex": 5,
      "PostDate": "04/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708521",
      "Title": "Are you awake or asleep? snoopygirl karen1956"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 31, 2009 08:34PM Kathy_K wrote: I guess in hindsight that having the PS be so matter-of-fact about this is because he/she has seen it before and knows that while it may suck big time now, he can fix it all later.  When I had my partial failure and was so grossed out and upset, he was very calm about it all.  How could he be so calm about something so terrible!??!  I guess because it isn't personal to him - just a change in the game plan. Hang in there.  The bleeding will stop and you will heal and the PS will be able to fix you up again.",
      "MessageIndex": 6,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/728212",
      "Title": "Complications after TRAM revision - Help! pameliza Kathy_K"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Jan 3, 2008 10:29PM Kathy_K wrote: Since she will be having chemo, will they insert the port during her surgery or wait and do it a little later? Your mom should not be lifting anything over about 5 lbs. for the first 4 weeks.  She will most likely be quite alert the evening of surgery and my stay in the hospital only 1 or 2 nights.  A small pillow to cushion the shoulder strap for the ride home will be helpful.   I found that loose pull-on clothing were the most comfortable.  Pullovers are out for a few weeks.  Stretching overhead is difficult.  If she can get them on, getting them off is impossible by herself.  Zippered hoodies are wonderful with some comfy pants.  For her feet, keep her in slippers when she's at home. For the first several days the drains can be pinned to whatever the doctor uses to bind her.  I found some stretchy leisure bras that fastened up the front to wear later.  They were easy to get into and a place to pin the drains.  Stretchy ones could last awhile while she is getting fills, too.  The ones I bought were by Glamorize and covered B-C-D. I also found that those micro pellet pillows were good during recovery.  She can use them to support her upper arms when sleeping or resting and they won't put her arms to sleep. She'll likely need your help to shampoo her hair until she is allowed in the shower.  My PS said no showers until the drains are out. That's all I can think of right now.",
      "MessageIndex": 5,
      "PostDate": "03/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/697866",
      "Title": "what should we have on hand? Nova Nova"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Nov 27, 2007 08:59PM Kathy_K wrote: My drains pinned to my bra or to my stomach supporter.  Some times I put them in a small fanny pack.  When I went in for follow-up surgery after the middle surgery, I just ran a piece of bias tape through the loop and tied it around my waist since I'd be nekked under the hospital gown before surgery.  It worked well.  Funny thing, though, during surgery they removed the drain and just cut it off the bias tape so it was still tied in a bow around my waist.  It was dark green and I looked like a present.  Well, getting rid of the drain was a present. I learned to loop the long tubes a couple of times in the safety pin to keep them under control a little better.  Kinda nasty if you catch one of those on something - which can happen even when dressed.  Keeps them out of the way when using the  bathroom and redressing, too. ",
      "MessageIndex": 15,
      "PostDate": "27/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696011",
      "Title": "How Long Was Your Drainage Tube In? SueB46 Tina337"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Nov 26, 2007 09:38PM Kathy_K wrote: First time I had 3 drains in for 2 weeks. Slight leakage afterward.  Last time I had one in for 4 weeks and it was still putting out 40-45cc's every 12 hours!  But after 4 weeks, it was decided that enough was enough. And I'd been on antibiotics all that time, too.   Fortunately, I didn't have any big problems afterward - just the stitches didn't want to come out.  Ouch! Kathy ",
      "MessageIndex": 6,
      "PostDate": "26/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696011",
      "Title": "How Long Was Your Drainage Tube In? SueB46 Tina337"
    },
    {
      "AuthorID": "Kathy_K",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45544/profile",
      "Content": "Apr 19, 2008 10:17PM Kathy_K wrote: My wound care center has these things called ABD pads that are like 6 x 9 and are very absorbant.  I used those during the first several weeks before scaling back to maxi pads and then the nursing pads as the incisions grew smaller.  Holding everything in with a bra sure beats taping stuff on all the time.  Poor skin!",
      "MessageIndex": 2,
      "PostDate": "19/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/704263",
      "Title": "Breast incision leakage hint AndreaM4567 Kathy_K"
    }
  ]
}