{
  "AuthorID": "kathleen196…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
  "Posts": [
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 28, 2012 06:58AM kathleen1966 wrote: Abby20, as only the DCIS portion of your cancer was hormone positive, I don't know why they would put you on anti-hormone drugs. I guess it would be preventative wise?  But DCIS is non-invasive.  I think you will know more once you have the genetic test results. You might want to go over to the DCIS area and ask if any women are being given the anti-hormone drugs for their non-invasive DCIS. The invasive part of your cancer is the dangerous part of the cancer (I know you know this). I had a very, very large area (7cm) of high grade DCIS as part of my cancer.  I had all the bad \"markers\" for the DCIS.  And the DCIS showed 10% PR+ but ER-.  I was never put on any anti hormone medication. Maybe I would have been had I shown a higher ER+.  But I always thought that DCIS was treated differently due to it's non invasive component.  I suppose non-invasive doesn't make much sense as clearly it became (as did mine) invasive somewhere in there. But your invasive cancer, like mine was, is ER and PR- and Her2+.  I was treated with the TCH combination.  It has been a little over 2 years for me. I am soo sorry you are going through this with a seven month old!!  I know the worry you are experiencing very well. But really, I am seeing very long term survivors with very bad Her2+ cancers who have gotten Herceptin. There is much more hope than you may realize. You are going to be OK!",
      "MessageIndex": 72,
      "PostDate": "28/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/791017",
      "Title": "I am so scared Abby20 kathleen1966"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Dec 10, 2010 10:17AM kathleen1966 wrote: Also, if you continue to worry about this sore spot, ask for an MRI. I just read the rest of your posts. Sometimes, you have to \"take charge\" of your own diagnosis.  I never went to see any doctor about my inverted nipple/with sore, I just called and asked for a diagnositc mammogram scan from my gynecologist whom I had never met (it was my first mammogram and I had changed gyno's due to insurance change). I'm not exactly proud of this as if I had gone to get this mamogram when I was forty.....but I can't change the past and I DID go in when I saw a problem....Good luck again, it sounds like everthing will be fine for you. I hope that I am right.",
      "MessageIndex": 3,
      "PostDate": "10/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761805",
      "Title": "Pain/discomfort with before breast cancer dx? 22lifeisgood lago"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Dec 10, 2010 10:08AM kathleen1966 wrote: I had pain in my diagnosed breast before my diagnosis.  It was an intermediate type of pain, very sharp and cycling.  It felt like it was deep in the breast.  It was not a skin awareness type of pain, or bruise type of pain.  My sister also has this pain though and her mamogram just came back clear.  She has had cysts tested in the past. Hopefully THIS will reassure you.  When the radiologist saw my tumors there was no doubt in her mind that they were NOT cysts. My pain was not every day but did get worst close to my diagnosis.  I remember sitting in a movie theatre three days before my mammogram and holding this breast because I was getting these deep pains in it. Good luck.  Remember, they do tend to \"over do it\" when they find anything.  Most of the time it is NOT cancer. ",
      "MessageIndex": 2,
      "PostDate": "10/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761805",
      "Title": "Pain/discomfort with before breast cancer dx? 22lifeisgood lago"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "May 18, 2012 10:23AM kathleen1966 wrote: Thanks! I love all of you women!  What would I do without you?",
      "MessageIndex": 3,
      "PostDate": "18/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/787688",
      "Title": "Tumor markers, I know.. but just need to hear it again kathleen1966 gardengumby"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Apr 11, 2011 06:44AM kathleen1966 wrote: What a hottie! ",
      "MessageIndex": 15,
      "PostDate": "11/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/767272",
      "Title": "Photo shoot for newspaper interview everyminute everyminute"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Dec 8, 2010 02:21PM kathleen1966 wrote: Well we have a little bit in common.  Around the same age with young children. I hope that you have received the information by now.  Calcifications, if they are cancer, are usually DCIS.  This is non-invasive cancer and the best kind to get IF you do end up with cancer.  It is not capable of spreading to other parts of the body and is contained in the milk ducts. Be very happy that you went and got your baseline mammogram when you needed to and didn't wait.  I am very positive that if this IS cancer, your cure rate will be 100%.  Good luck and let me know how this works out for you.  I also nursed both of my children, for three years each.  They are now 8 and 5.  I also have no family history of breast cancer (all the women live well into their nineties on both sides).  So I did not rush to get my mammorgram at 40.  In fact, I waited until I was 44 and I had symptoms that brought me in.  Boy do I kick myself now for not taking it more seriously and getting at least an ultrasound at 40 (I was nursing until 42)...and for sitting on a script for a year at 42.  I had just turned 44 when I finally HAD to go in.  Good luck!  The waiting is hard.  While waiting, I just thought I do not have cancer until they call and tell me I do.  Even though I left my mammogram knowing quite sure I did.  The radiologist made quite sure of this. She insisted that this WAS cancer and that she couldn't think of anything it could be OTHER than cancer. Good luck!  It sound like you are in sensitive hands and I have a good feeling about this....reading your post.",
      "MessageIndex": 9,
      "PostDate": "08/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761717",
      "Title": "Frightened - waiting for results - would like any support Marsrover Tundra"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Oct 27, 2011 02:05PM kathleen1966 wrote: This sounds horrible.  I believe Coolbreeze (Ann) also had tremendous pain from her biopsy...this sounds barbaric.  Soo sorry Stephanie had to go through this.  I would be livid if no anesthesia of any kind was used.",
      "MessageIndex": 1,
      "PostDate": "27/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777139",
      "Title": "omg, stephanies biopsy with pet/ct torture.. Travelingpants2 3katz"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "May 25, 2011 07:17AM kathleen1966 wrote: Reading Mama, From the stats you have given, you are either stage IIa or IIb.  If your tumor was larger than 2cm than you are IIb.  You don't have enough nodes for IIIA (stage III starts at 4 nodes).  And you had a complete response to chemo. Congratulations!",
      "MessageIndex": 27,
      "PostDate": "25/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769047",
      "Title": "neoadjuvant chemotherapy and staging ReadingMama Shari0707"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Apr 3, 2012 06:28PM kathleen1966 wrote: I also had the boost.  I have no explanation for why I barely burned and had no blistering with rads.  I am very fair skinned, so this was a bit of a surprise. They weren't going to do it at first, they said my tumor was small and that the chances of me having a local recurrence were low. I then reminded them that I actually had more than this small tumor, and that even though it was \"small\" it managed to go to four lymph nodes.  So they gave me the boost! I have read somewhere (and I don't remember where, it may be in the Susan Love Breast Book) that the boost does help prevent a local recurrence. I had three fields radiated.",
      "MessageIndex": 2,
      "PostDate": "03/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/785153",
      "Title": "To Boost or Not to Boost shelly56 diana50"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 21, 2012 12:15PM kathleen1966 wrote: Dear Barb, I think you really need a peace of mind scan. I don't think thinking about something too much causes it to happen, otherwise I would have won the lottery by now......or I'd have gone back in time and prevented all of this from happening in the first place (like that better)....I know it is very, very hard to continue on with our lives and not worry constantly about every little ache, pain, and morbid thought that comes into our heads.  I think this worry also gets pushed down and pushed down and then seeps up and overflows and this is why we have days of tears at times. There is no doubt...THIS.....IS.....HARD.. work.... I think what you need to tell yourself is A. I will get a scan and feel safe again and B. If there is something wrong, I will fight it, I will deal with it and everything will be ok. Are you a smoker?  Perhaps what is happening in your lungs is from your treatment or smoking...there are a lot of other things it could be other than cancer. And I feel if they REALLY saw something they would have insisted on more scans? I think you are clearly, clearly worried about it and you should just get the scan and go through the process.  You will feel soo much better afterwards.",
      "MessageIndex": 3,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/783006",
      "Title": "I'm Quietly Freaking Out Shanagirl Polyana"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 17, 2012 12:30PM kathleen1966 wrote: I thought it was very powerful, and I liked it.",
      "MessageIndex": 3,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/784285",
      "Title": "Time: a key factor for survival B19 Ruby-"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jul 29, 2011 08:48PM - edited Jul 29, 2011 08:48PM by kathleen1966 Wow, good news with your reduction in nodes and no activity in your breast.  As to your other question, I have not heard of this.  I am Er- and weakly progesterone + (Less than 10 of cells) and I am considered hormone negative.  I do not receive hormone therapy.  I also have not heard of Her2+ 1 getting Herceptin. I don't think Herceptin works if you are not Her2+.  I believe that all breast cancer tumors have some Her2 on the surface, the Her2+ women just have a lot more which makes us Her2+. I'm sure someone will chime in with better facts and figures than I am putting in here but I would recommend a second opinion. It seems that clinically you are a triple negative.",
      "MessageIndex": 3,
      "PostDate": "29/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772395",
      "Title": "Confused-am I triple negative or not? bak94 Bren-2007"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 5, 2011 07:56AM - edited Aug 5, 2011 08:01AM by kathleen1966 Wow Apple, congrats!  I always love reading your warm and helpful posts!",
      "MessageIndex": 19,
      "PostDate": "05/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772696",
      "Title": "proud mama of a 17 yr. old apple Groovywilma"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Oct 10, 2011 04:33PM kathleen1966 wrote: Ok, I don't know how else to put this put hell no you shouldn't wait three months!  This doctor mentioned lobular cancer and then told you to wait three months?  Thank GOD you have enough sense to get that second opinion.  Perhaps this doctor will recommend an MRI for you and if not, I would strongly ask for  one!  I wish you well and hope that you are happier with your second opinion! ",
      "MessageIndex": 3,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776259",
      "Title": "Scared and Confused Holly128 Holly128"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 24, 2012 07:22AM - edited Jan 24, 2012 07:23AM by kathleen1966 I think it must be hard for a celebrity, unless she decides her role will exclusively be to fight for a cure for breast cancer, to make this knowledge public.  I remember watching an episode of the Sarah Jane Adventures (loved it...) and thinking, wow...wouldn't it be wonderful to get to be as \"old\" as Elizabeth Sladen and to look as beautiful as she looks, and to be healthy....turns out she had breast cancer and perished soon afterwards (I assume this is what she had, it is posted no-where what TYPE of cancer she had but the little info I could find made me think this). I couldn't believe it. But had I known she was battling this cancer for years, I may not have seen her this way. It may have defined her...instead of looking at her hair and thinking \"wow, how beautiful\" I may have asked myself \"Is that a wig?\"  But as horrible as it was, it made me feel soo much better to see that ANYONE can get it, even beautiful celebrities and that life with metastatic breast cancer CAN go on and does for many...for years...(it was years for Lis S.)So seeing this makes me feel horrible but also gives me hope. It appears as if she did a good job of living while she could. She had a long remission and that is all I hope for for myself and everyone...",
      "MessageIndex": 9,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781503",
      "Title": "Charla Krupp-Fashion author & commentator-Dies of bc DivineMrsM Fighter_34"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 17, 2012 07:49AM kathleen1966 wrote: Great news!  I hope to one day not be posting as much!  Thanks for the hope today!",
      "MessageIndex": 10,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781155",
      "Title": "4 YEARS!!! DCMom Kay_G"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Nov 13, 2012 02:37PM kathleen1966 wrote: Congratulations Sharon!  This is wonderful news!  May you continue to live in the present and not in the land of what-if's....Soo happy for you!",
      "MessageIndex": 7,
      "PostDate": "13/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/796273",
      "Title": "3 Years Out pupfoster1 Bugs"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 14, 2013 09:38AM kathleen1966 wrote: Thank you!  I was trying to find the name of the piece.  I play piano and so does my 10 year old son.  He is a bit of a prodigy with the piano and I think he would like to learn this piece! It is soo wonderful to be able to see Apple play.",
      "MessageIndex": 11,
      "PostDate": "14/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798835",
      "Title": "Video \"Apple and her Estonia\" on YouTube Skream SeasideMemories"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 29, 2012 04:05PM - edited Jan 29, 2012 04:08PM by kathleen1966",
      "MessageIndex": 18,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781778",
      "Title": "How did you deal with losing your hair? taraw413 lorenar"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jun 20, 2011 06:42PM kathleen1966 wrote: Feel good, still having it but not soo bad. Also finished chemo in January and haven't had a period since November 2010. Not on tamoxifen though. I think my body is trying to get back to normal. I have my next Herceptin this Friday so I will also ask my oncologist. Thanks for your response!",
      "MessageIndex": 7,
      "PostDate": "20/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/770462",
      "Title": "Is my period trying to come back? kathleen1966 kathleen1966"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jun 18, 2011 07:52PM kathleen1966 wrote: Thanks, was hoping for more replies.  I am going to give it one more week and then I will make an appointment with my gynocologist.  I had some bleeding issues early on in treatment (had a period that lasted two months), I had a pelvic ultrasound at this time that showed some thickening but at the end of chemo all was cleared up aside from the technician telling me I was still ovulating.  This ultrasound was about three months ago. I mentioned the wrinkles were gone and this is funny because I got carded today at the liquor store!  I am 45!  While on chemo, someone once asked me if I was retired.  Another time, I was asked if I had asked about the senior discount while shopping!!!",
      "MessageIndex": 3,
      "PostDate": "18/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/770462",
      "Title": "Is my period trying to come back? kathleen1966 kathleen1966"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 9, 2011 08:18PM kathleen1966 wrote: I had the booster radiation and had no problems.  I am very fair, and actually had no burning other than a very small spot near my superclavicular nodes.  I had never heard of these side effects!  I think it is a good idea for fuzzylemon!",
      "MessageIndex": 1,
      "PostDate": "09/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774519",
      "Title": "Posting for Fuzzy Lemon re: Booster Rads pupfoster1 Joanne58"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 9, 2012 06:59PM - edited Aug 9, 2012 07:00PM by kathleen1966 Wow that's just horrible and incredibly arrogant as well. I think I would have been in too much shock to even think of what I could have said. I'm sorry that you had to have this experience. Soo insensitive to you and also to those who are not able to be cured of their cancer by no fault of their own.",
      "MessageIndex": 17,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791773",
      "Title": "I know there's a \"stupid things people say to you\" thread but lanagraves sbelizabeth"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 20, 2012 04:05PM - edited Jan 20, 2012 04:07PM by kathleen1966 All my family lived elsewhere during my treatments. My parents, came for about two treatments.  Yes, they love me.  But having them here would leave me exhausted for days afterwards and the house would be a complete disaster every time they left.  I also had the worst side effects when they where here (the only two times I became horribly constipated was when they came). Though they are not that old, my mother is not in the best of shape and my father needs constant mothering from my mother.  However, I really feel is it hard if not impossible to tell people NOT to come.  I think it is part of the \"horrible\" aspect of treatment.  My best friend from childhood who also lives in another state really wanted to come after I had my surgery.  And that would have been fine.  But she would have brought her husband, who I barely know and her two young children.  I like kids, but didn't want any extra around after surgery.  I told her not to come, that I was not in any position to FEEL I needed to entertain (even though she insisted I didn't NEED to entertain)...the thought of extra kids needing to be disciplined (even if they are perfect) was just too much for me.  I think she should have come on her own. But she didn't.  I just told her no. It sounds as if having this person is going to be too much for you.  But it also seems you have no choice.  I understand. The only advice I will give you is to make sure you sit around and really do nothing.  Don't clean, don't cook...do nothing. Get magazines....books and hide out in your bedroom to avoid all stress (if only we could do this when we're not getting chemo when unwelcome visitors make a call)  Make sure you are sitting and reading and relaxing. The visit will be over before you know it....and please let your husband take care of all the details regarding the visit.  You need to take care of yourself right now.  Good luck!",
      "MessageIndex": 14,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781346",
      "Title": "Venting: She understands it won't be a fun visit... MiniMacsMom myrtle1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jul 26, 2012 01:37PM kathleen1966 wrote: Thanks every minute!  I was doing some form of exercise every other day for well over a year. I did get out of the habit of doing this about four months ago.  Now, I am walking 2 mile walks with a friend twice a week. I would really love to get in the habit of doing this every day. It takes about 45 minutes to do the 2 miles. I was doing the elliptical for 30 minutes every other day during the winter. I think I would stay motivated if I had even seen a slight weight reduction. But really, I think I maybe lost 5 pounds or was at least maintaining my over-weightness. I need to lose 50 pounds!!! I was thin all my life but have had a real struggle with weight for the last 7 years.   But I have never walked every day nor have I exercised daily.  I am happy that you are saying it only takes three weeks to make it a habit. I know it would benefit me tremendously, not only with fatigue but also with depression.",
      "MessageIndex": 2,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791152",
      "Title": "Today is my two year anniversary! kathleen1966 overjoyed4life"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Dec 8, 2011 07:36AM kathleen1966 wrote: I haven't read all the previous comments but I recently read somewhere that they are not really sure if putting a blood pressure device on a lymphedema arm poses that much of a risk. ",
      "MessageIndex": 27,
      "PostDate": "08/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/778992",
      "Title": "What are negative effects of taking BP on lymphedema arm? MrJoseph serenitywisdom"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jul 29, 2011 08:53PM kathleen1966 wrote: I don't really understand the tumor markers.  A year ago, when I was first diagnosed my 15-3 tumor marker was 20.  This was considered in the normal range.  The last blood test had the 15-3 marker at 18.  So it seems it has never been elevated really and hasn't changed much in the past year.   But I have often wondered, shouldn't it be zero? ",
      "MessageIndex": 9,
      "PostDate": "29/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/772386",
      "Title": "Tumor marker Scores Should this be of concern bookgirl bookgirl"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jul 26, 2012 02:44PM kathleen1966 wrote: Yes we do!!!!!",
      "MessageIndex": 4,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791152",
      "Title": "Today is my two year anniversary! kathleen1966 overjoyed4life"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jul 26, 2012 05:29PM kathleen1966 wrote: Thanks Moderators!  I have no real plans, other than to just have a normal day! I would like to go see the new Wes Anderson film!",
      "MessageIndex": 6,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791152",
      "Title": "Today is my two year anniversary! kathleen1966 overjoyed4life"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jul 27, 2012 07:32PM kathleen1966 wrote: Thanks for all your support and well wishes!",
      "MessageIndex": 21,
      "PostDate": "27/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791152",
      "Title": "Today is my two year anniversary! kathleen1966 overjoyed4life"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Dec 9, 2011 05:10AM kathleen1966 wrote: Kira, thanks for the information.  It is scary, but I am not surprised, that they are trying to diminish and debunk possible lymphedema triggers.  It is not considered a disability, though it has been the most disabling aspect of my having had cancer.  I can understand WHY having BP on an arm would trigger lymphedema. But I sometims just get agitated that there are soo many restrictions on this arm.  I was also very worried about flying, but had no issues.  I did wear my sleeve.  For me, the triggers seems to be just not wearing the sleeve, and lifting things (which I do all the time).  I am now considering giving up gardening...tooo much lifting of buckets of weeds and rocks and more worries about dirt and cellulitis. Before I had my surgery, when I was a stage I cancer, I really didn't understand how disabling lyphedema could be. My surgeon told me it was something I did not want to have, that I was still young, that I had young children and that this could be a very disabling condition if I were to get it.  It just didn't register.  Now I get it.",
      "MessageIndex": 32,
      "PostDate": "09/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/778992",
      "Title": "What are negative effects of taking BP on lymphedema arm? MrJoseph serenitywisdom"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Apr 23, 2012 03:39PM kathleen1966 wrote: I would look for this rash on another part of your body, even if it is a smaller version of the same type of rash. I get these types of rashes ALL...THE....TIME....But I look and then I find another one elsewhere.  If this is the ONLY site of the rash than I would have it looked at. Only because it if were to be a local recurrence, you would want to catch it ASAP.  I have heard we can be prone to fungus infections after having radiation.",
      "MessageIndex": 15,
      "PostDate": "23/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/786224",
      "Title": "Red blotch....could it be :( jennyboog pupfoster1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Dec 19, 2011 08:04PM - edited Dec 24, 2011 05:51AM by kathleen1966 I had scans to stage me at the beginning of my cancer \"journey\"...and I was considered a stage I at that time.  I had a PET scan, CT Scan and an MRI of my brain (I asked for it).  I had one lymph node light up on the PET scan, but it appeared benign in the CAT scan and I had a biopsy so they were not concerned.  The insurance company initially denied the PET.  But my oncologist persisted.  I am very sorry to hear that the military hospital is not giving you the best treatment you deserve.  It is good to know where you are from the start, rather than get a \"surprise\" later on and then wonder about not getting this scan. Even if you were stage II, you should get a scan.  You should also get a baseline brain MRI with Her2+. Soo sorry you are having to deal with this BS!!!!",
      "MessageIndex": 39,
      "PostDate": "19/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778072",
      "Title": "Thread I started for HER2 Stage III'ers PlantLover antonia1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Nov 26, 2011 03:49PM kathleen1966 wrote: Hello, I am not a long termer, but will mention the woman at my oncologist office.  Her2+, hormone negative, 25 positive lymph nodes, yes 25! and going on ten years now free of cancer! ",
      "MessageIndex": 14,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778072",
      "Title": "Thread I started for HER2 Stage III'ers PlantLover antonia1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 19, 2011 01:07PM kathleen1966 wrote: Dear Many, I am only a year out with four nodes but my oncologist has a woman who had 25 positive nodes and was also her2+ and she is going on year 10!  I also have a friend who was stage III with many nodes and she is going on year 12 year of being cancer free! Recently, when I had to get another Herceptin treatment, there was a woman sitting next to be who had metastatic breast cancer that had gone to her bones.  She was hormone postiive.  Even though her cancer was metastatic, she was in her 14th year of treatment. ...I hope this helps...",
      "MessageIndex": 4,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773239",
      "Title": "Positive nodes with long term survival many Lily55"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Dec 11, 2011 09:33AM kathleen1966 wrote: Well I think the new studies regarding node removal apply to few nodes.  As in three or under. When I had my surgery, they removed all my nodes after finding four positive (and when I say all, I mean the axillary tail, they can't removed ALL The nodes).  Right afterwards the study came out regarding leaving the nodes in and a success rate equal to removing them by radiating the area.  BUT....I then read that it is still recommended to remove them if there are more than three....and this was stated in the study.  Perhaps they have more information now. ",
      "MessageIndex": 64,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773239",
      "Title": "Positive nodes with long term survival many Lily55"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Apr 10, 2012 11:20PM - edited Apr 10, 2012 11:21PM by kathleen1966 What do you mean it comes back out?  Do you mean it gets smashed in, you take the bra off and then it comes back out on its own.  Look in the mirror with your shirt off, lift your arms, does the nipple go in when you do this.  Now bend over, what does the nipple do when you do this?  Can you grab the nipple and pull it out and does it come out as easily as the nipple on the other breast?  These are all the positions I put myself in when I was trying to figure out if my nipple really was becoming inverted or if it was just sagging from having lost weight. My nipple would not invert when my arms were down, but invert when I lifted my arms up.  And when I bent over, it seemed as if it was inverting, rather than going foreword.  I also was NOT able to pull it out as easily and as much as the other non-inverted nipple. It was almost like it was \"stuck\" on something.  I don't think my inverted nipple had anything to do with my tumor though.  It was not attached to it, and my tumors were small.  I believe it was the extensive DCIS that was causing the inverted nipple.  Let me know how you pass this nipple test.  To answer your question-no, a breast cancer inverted nipple wouldn't necessarily STAY inverted. Mine was subtle. Compare it heavily to your other nipple.",
      "MessageIndex": 3,
      "PostDate": "10/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/785598",
      "Title": "Worried about inverted nipple z0e marie5890"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 1, 2012 04:30PM kathleen1966 wrote: I hope you get some support soon.  Where is the Rotter's node located?  I too go over my pathology reports over and over, hoping to find something in there that says...and you will live to be an old lady....not really sure why I do this, trying to make sure I got everything...",
      "MessageIndex": 1,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781962",
      "Title": "Rotter's Lymphnode MiniMacsMom Grace59"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 1, 2011 07:48AM kathleen1966 wrote: Aside from the herceptin I will get for the rest of the year, I am nearing the end of my treament and I also feel tired. I too think about how I felt at the diagnosis.  Not tired and healthy. Now, after nearly seven months of treatment and still some time to go, I am scarred physically and emotionaly, now have lymphedema and will have to deal with that for the rest of my life, of course have the scars and then have odd guilt because I see my two young kids and know I have to treasure every moment with them but am too tired to do so at the moment.  I hope it changes. And a good friend who helped me through treatment in terms of moral support has been diagnosed with pancreatic cancer and was given weeks to live. She is also my neighbor.  I live at the top of a hill and her house is the view we have when up there. Every time I see the house, I think of my friend dying inside of it. So I guess I don't have any good advice for you but just wanted to let you know that I can relate to how you are feeling.  I assume that time will help and also summer. Winter has been long here and I need some greenery and the option to be outside gardening....this will make me feel better I hope. So I guess in time we will feel better. I know this is not at all helpful and I apologize! ",
      "MessageIndex": 4,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765572",
      "Title": "So Many Questions about Recovery peverson pupfoster1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 15, 2012 01:59PM - edited Jan 15, 2012 02:00PM by kathleen1966 I would like to offer my services as well (free of course).  I am first an illustrator, and second a graphic designer. I am a bit \"rusty\" with my illustration skills at the moment but I have a lot of really good ideas and need some time to execute them...I am also hoping to get some web-design skills in the near future.  Think of a \"golden thread\" web-site with links to the book, jewery, etc...etc...where donations could be made.  All of the proceeds would go towards children who have lost a mother to women's cancers, that being breast, cervical and ovarian cancer...or to research (NOT awareness) pertaining to these types of cancers. I don't know how Breastcancer.org feels about this..",
      "MessageIndex": 81,
      "PostDate": "15/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780801",
      "Title": "a thread of gold apple GatorGal"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 26, 2012 10:36AM - edited Jan 26, 2012 10:37AM by kathleen1966 Here's my run down in a nutshell: Breast symptoms Diagnostic mammogram requested by me and received the next day (never saw any doctor to look at my breast first, just called to get the script and this is what I would recommend to anyone in a position where they feel things are \"not right\") Stereo-tactic biopsy of numerous calcification's that day, and then strong verbal diagnosis of cancer that day Biopsy of numerous tumors the next day with ultrasound, biopsy of one enlarged lymph node (node came back negative) Blood work (15.3 was 22 and is still around that number) PET Scan, CT Scan, MRI of breasts, MRI of brain for staging, no seen evidence of spread Mastectomy one month later, extensive DCIS, numerous tumors but largest 1.6cm (what they go by), four positive nodes. Another month later, chemo TCH six cycles followed by 33 radiation treatments and one year of Herceptin (given with chemo and after chemo) Close to 19 months since diagnosis at this time. RBC is still low and WBC is also a bit low at the moment. Yes, I think it is possible to be stage IV and have no symptoms from the start. I \"felt\" fine while this cancer was growing in my body. I also think its possible to actually be diagnosed at an earlier stage when in fact you are really stage IV if there are no tests to clarify this. I also think its very possible to be a late stage with no visible cancer but also be stage IV because the growth is too small to detect at the time of scans. All any of us can do is hope for a long, long remission that brings us into old age. There is no \"cure\" for breast cancer. There is no cure for cancer.  But most of us will have this long remission into old age. I hope all your scans are clear! ",
      "MessageIndex": 10,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781558",
      "Title": "Diagnostics: CAT, PET, bone density, blood tests .....? dltnhm dltnhm"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 26, 2012 10:41AM kathleen1966 wrote: Oh and you have a wonderful, wonderful attitude! ",
      "MessageIndex": 11,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781558",
      "Title": "Diagnostics: CAT, PET, bone density, blood tests .....? dltnhm dltnhm"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 1, 2011 05:32PM kathleen1966 wrote: Just came back to this post.  Thanks IKC.  It is now about seven months later.  I finished chemo and am on to radiation.  Will continue with Herceptin for the rest of the year.  Now I have lymphedema to add to my pleasures!  I did NOT participate in the Bev trial.  I feel ok.  Where are all the other only Her2+ gals????",
      "MessageIndex": 66,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/752294",
      "Title": "Any Stage 3, HER2+ (only), Node(s) + Girls here? Frankie_ amlg1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 3, 2018 05:11PM kathleen1966 wrote: I also had 4 pesky lymph nodes. Two were larger than any of my multiple tumors. I also started with a scab on my breast, that turned out to be pagets. Although I was not triple positive, I was told the her2+ was the reason for the lymph node involvement and the vascular involvement. When I was diagnosed, my youngest had just turned 5 and my oldest was 8. I walked my youngest to his first day of kindergarten with drains filled with blood stuffed in an empty bra cup from the mastectomy I had three days before school. I was terrified, sad and angry. I want you to know that my kids are now 13 and 16! It has been 8 years since diagnosis for me and I am now in year 9.There is hope for you! Do not despair. ❤️ to you.",
      "MessageIndex": 17,
      "PostDate": "03/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/865822",
      "Title": "Starting my journey... MissNomerz kathleen1966"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Oct 7, 2012 06:42PM kathleen1966 wrote: This is interesting!  Not sure how I found it, it is an old post.  I had a low mitonic rate of 1, which made my cancer a grade 2. I never had the Ki67 test.  Although my entire cancer area was large and I had multiple tumors, the largest was only 1.6cm and so my staging was based on the size of this tumor (in addition to the nodes). My cancer was also Her2, and so the low Mitonic score doesn't make sense.  I also had four positive lymph nodes and LVI invasion. My low mitonic score was the same in three different biopsies. It is the only thing about my cancer which was positive.",
      "MessageIndex": 12,
      "PostDate": "07/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705247",
      "Title": "Ki 67 vs Mitotic Rate ck55 papaska4"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 7, 2010 09:48AM kathleen1966 wrote: Yes, here I am.  Age 44 years old, two young kid 8 and 5 and I just have my mascetomy two weeks ago.  Was Stage II going in but now I am in stage 11b/IIIa due to lumph node involvement.  This came as a surprise.  I am Er-, pr- and Her2+ with only a 1.6 tumor.  Four of my five sentinal nodes tested positive for cancer.  The remaining 11 axillary nodes tested negative.  I am very depressed at the moment. Having a lot of trouble with all of this but it makes me feel really good that there are others on here who are on year five with much more nodes and larger tumors.  Need to research more tirals.  I am being offered a trial of Bef I think it's calle.  Not sure if I will participate.  I as diagnosed on July 26th, 2010",
      "MessageIndex": 64,
      "PostDate": "07/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/752294",
      "Title": "Any Stage 3, HER2+ (only), Node(s) + Girls here? Frankie_ amlg1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Dec 4, 2010 04:41PM kathleen1966 wrote: Thanks soo much, hearing another prespective has helped a lot.  And you are right, the Holidays have something to do with my down mood.  I am usually a Christmas lover.  Thanks for taking the time to write a well thought out response! ",
      "MessageIndex": 3,
      "PostDate": "04/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/761477",
      "Title": "Need emotional support kathleen1966 Gitane"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jul 18, 2011 08:10PM - edited Jul 18, 2011 08:12PM by kathleen1966 My hair is ugly as hell at the moment.  Even my husband says its horrible.  And my hair used to be one of my best features.....I have no idea what to do with it.  I used to have thick straight-ish reddish hair.  Now I have hair that sticks straight up, and has horrbile color, texture, etc....It has now been six months since my last chemo.  It has grown maybe an inch......Still I am just glad to have hair.....tired of my husband telling me how horrible it is though...sometimes he is a bit clueless.  Yes, I can say it is horrible.  But you.....no...... My avatar is the haircut I got right before chemo.....I have to put a lot of product in it just to tame the dried out these are not curls what are they mess.....",
      "MessageIndex": 10398,
      "PostDate": "18/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "May 9, 2011 10:12PM kathleen1966 wrote: It has been four months since my last chemo and I now have almost an inch of hair on my head.  My eyelashes did not fall out through chemo, but fell out as soon as chemo was done, I have no idea why.  They are now almost back.  The brows fell out sometime during chemo but I didn't notice at first (they were thin to begin with).  One day, I noticed I couldn't seem to pencil them in and I looked weird.  It feels really good to have the hair back.  It makes a big difference in how you feel, to have the hair back. Yes, it came back gray.  This was a big disappointment for me.  I will get used to the new me.  The old me is gone really. The me with nice skin and hair that was a wonderful rich reddish color.",
      "MessageIndex": 9183,
      "PostDate": "09/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 2, 2011 09:25AM kathleen1966 wrote: Yes, I agree. The lymphedema is a real pain as it will be for the rest of our lives and always a reminder....I have to wear a glove as well.  With foam in it.  So my hand looks swollen all the time and I can never \"hide\" the issue.  It will be interesting to see what happens this summer.  I am a big gardener and spend a lot of time hauling large loads of dirt etc.... all summer long.  We love on a very steep hill.  I am not going to stop doing this.  I also have two little kids so I am very active with them.....it will be interesting.",
      "MessageIndex": 69,
      "PostDate": "02/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/752294",
      "Title": "Any Stage 3, HER2+ (only), Node(s) + Girls here? Frankie_ amlg1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 12, 2011 08:44PM kathleen1966 wrote: I usually get, \"what is the prognosis\".  I then laugh. Then I say, good but who really knows....then I say I'm just hoping to out live the dog.  The dog is 12.....Yes, this makes people uncomfortable but that is half the fun.  The look on their faces.....well worth it....",
      "MessageIndex": 8,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774678",
      "Title": "How do you answer \"did they catch it early?\" oaktownmom 208sandy"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 30, 2012 01:21PM kathleen1966 wrote:",
      "MessageIndex": 23,
      "PostDate": "30/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781814",
      "Title": "2 Year Cancerversary! jdootoo Gitane"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 15, 2012 12:17AM kathleen1966 wrote: I'm soo glad you found each other and have connected in this way....",
      "MessageIndex": 7,
      "PostDate": "15/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791981",
      "Title": "Sisterhood of the traveling.....uh...sistahs! everyminute NancyD"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 19, 2011 10:50AM kathleen1966 wrote: Wonderful news!",
      "MessageIndex": 21,
      "PostDate": "19/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774248",
      "Title": "SIGNIFICANT FINDING - HELP! Shanagirl SharonMH"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jun 9, 2012 07:31PM kathleen1966 wrote: Yes, me!  I went into surgery a stage I and came out of surgery a stage IIIa, just like you.  At the time I had a four year old and an eight year old. I was 44. I had one node that slightly lit up on a PET scan that looked benign on the CT scan and they attributed this to the recent biopsies.  My tumors on the mammogram looked \"diffused\" as one surgeon put it.  I had nothing really large or popping out. The tumors could not clearly be seen on the mammogram. But there were \"tumors\".  Well I woke up from surgery with two positive nodes and then the next day after pathology, there were two more.  At the time, I felt that because they were the sentinel nodes, this was good but later I realized that the sentinel nodes are really the same as the axillary nodes. I know, it is very horrible to adjust to this news. But you will find ways to cope. It has almost been two years for me.  I know this is not long, it feels like just yesterday to be honest.  I just want to let you know that you are not alone and I know how you feel about worry and young ones.....",
      "MessageIndex": 19,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/788841",
      "Title": "Went into Surgery Stage 2, Came Out 3A teeballmom teeballmom"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jul 28, 2012 12:07PM kathleen1966 wrote:",
      "MessageIndex": 8,
      "PostDate": "28/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791119",
      "Title": "Moving foward. NeedtobeSTRONG lotusbloomsinmud"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 16, 2012 02:05AM - edited Mar 16, 2012 02:08AM by kathleen1966 If you don't mind that everyone in the office will know that you are being treated for MBC, then doing the video could bring some light in terms of understanding what it is like for some (but not all) to live productive lives while being in lifelong treatment for MBC. But if everyone in the office becomes aware of your situation, than you WILL be seen differently and treated differently.I would ask yourself what your reasons are for keeping it secret, and how important this reason is to you.  What I don't like about the video, is that it is being created by the PR department at your company.  WHY are they creating this video?  To help, raise awareness of living with difficult life situations..or to somehow tie this into \"living with difficult situations and staying on course\" as it pertains to working in a corporate environment...etc....WHAT is their motivation?  Who are they trying to get this message to?  Is the message of \"stay the course\" in difficult situations being used to motivate employees?  You said their idea had changed...what was the original idea?  I would really look hard at the motivation behind the video, what the message is in the video and who the message is directed to. It seems that you are protecting yourself in some way by keeping your situation secret because you don't want to be viewed differently. And as they have asked you twice, there is some form of pressure being put on you to be a part of this video. I am getting the impression that you are reluctant to do the video. Another potential con, is that after telling your story and having a massive flood of everyone knowing, that this may be overwhelming for you and that this is not fair to you. I say this only because you seem to have a wish to keep it private from the general population at the office. If everyone already knew, then this would not really be a con if a video came out.  My last question (Sorry, I too am going on an on here and I hope I haven't offended)...are all the stories in the video coming from the office?  If the answer is no...then this would be a very, very large con for me... Something I would like to add....I  was a big fan of the Sarah Jane chronicles.  I remember one time watching it as I was being treated for breast cancer and thinking \"God, wouldn't it be soo nice to be as old as Liz stadlander and look that incredible and be healthy\"  I was simply blown away when I read that she had passed from breast cancer (what I am assuming here, her privacy continued regarding WHAT type of cancer she had, into her death, but I searched hard to try to figure this out and then came to this conclusion).  As shocking as it was to read this, it also gave me great hope. The simple notion of seeing her looking gorgeous, living and working and then hearing she had passed was all I needed to give me great hope for the future. Although I am not stage IV, I think my perspective may help you.  I hope you agree. Good luck with your decision!",
      "MessageIndex": 4,
      "PostDate": "16/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784170",
      "Title": "Would you do this? Thoughts Please! Lynn1 bhd1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Oct 22, 2011 10:41AM kathleen1966 wrote: I am not that far out, only a year but \"hear\" to understand! ",
      "MessageIndex": 10,
      "PostDate": "22/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/776821",
      "Title": "stage 3a breast cancer survivors mariar Icandoallthings"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 10, 2013 04:03PM kathleen1966 wrote: Congratulations!  May you continue to move foreword with health and gratitude! ",
      "MessageIndex": 26,
      "PostDate": "10/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797000",
      "Title": "Grateful! -Celebrating My 3 Year Anniversary as a Survivor CharlotteMe hmh23"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "May 18, 2012 01:27PM kathleen1966 wrote:",
      "MessageIndex": 10,
      "PostDate": "18/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/787697",
      "Title": "PORT REMOVAL many MiniMacsMom"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jun 19, 2011 12:16PM kathleen1966 wrote: I dream of doing exactly the same thing.....I am hoping to plan for something like this when my older son graduates fifth grade.  This is two years from now (hope to still be here, no reason to think otherwise at the moment) but I am thinking as this may be the only graduation I see (again no reason but trying to live like this now), I want to make a big huge deal about it and go on a trip....I want to back pack and stay in hostels....I am soo happy you did this. Perhaps you can give me some tips....Last year was the year I was supposed to attempt to enter back into the work force as both kids were in school. Instead I battled the beast.  so THIS YEAR is the year I am supposed to enter back into the work force in some capacity.  I would love to be a school secretary like coolbreeze. I want to be on the children's schedule. Hopefully I will be able to save for the trip....soo happy for you!",
      "MessageIndex": 9,
      "PostDate": "19/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/770506",
      "Title": "What a feeling!! geewhiz MaxineO"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "May 18, 2012 08:55AM kathleen1966 wrote:",
      "MessageIndex": 1,
      "PostDate": "18/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/787697",
      "Title": "PORT REMOVAL many MiniMacsMom"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 24, 2011 01:16PM kathleen1966 wrote: Such great news, always nice to hear.",
      "MessageIndex": 18,
      "PostDate": "24/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/766559",
      "Title": "Got some great news! Annie62 pupfoster1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 1, 2017 02:18AM kathleen1966 wrote: I am most certainly fat. I am currently in my seventh year of being cancer free, with very poor prognostic factors. Although I don't always eat well, I would not say I eat horribly. My entire family is thin. I was thin my whole life until after I had kids after 35. I have struggled with weight ever since. Interestingly, I had lost 25 pounds right before being diagnosed. I have since gained all of that back + 20 more. Urghhhhhhh. I would love to have the discipline to lose weight as I do worry about this as well. Also because weight can contribute to other health problems and it's just hard to carry extra weight over-all. But I have also seen very many women who are not overweight who have been diagnosed with breast cancer.",
      "MessageIndex": 40,
      "PostDate": "01/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/852747",
      "Title": "Am I too fat to survive BC?! SSInUK SSInUK"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 29, 2011 04:34PM kathleen1966 wrote: I am one of those women who screwed themselves.  I lapsed on my life insurance, was in the process of getting it reinstated when I got breast cancer.  If I end up stage IV and pass away, they will be screwed. We have high debt, with a giant student loan and a not soo giant mortgage (this is our only debt).  I am devastated by my lapsing on this every day.  I had this insurance for 9 years and paid it before having a temporary lapse.  So  I worry about the future.  There is no college fund at the moment.  We struggle....I just never thought I'd get Breast Cancer at 44 years of age with no risk factors and no family history. :(  I stayed home with out young children and planned on going back to work when our youngest started kindergarden. I know I cannot change this now and am trying to just stay positive.  ",
      "MessageIndex": 16,
      "PostDate": "29/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761856",
      "Title": "College funds for our children Fitztwins EnglishMajor"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jul 11, 2011 10:43PM kathleen1966 wrote: I asked my surgeon about this, if breast cancer can skip the nodes in the clavicle and go right for the upper neck.  She said it was unlikely, that it usually follows a pattern.  I asked her because I felt like I was having a pain under my jaw line.  I wasn't sure if the pain was from touching the area soo frequently to check it.  It has been about six months and the pain I thought I had went away.  God I hope you can get peace of mind soon. This cancer just sucks, sucks, sucks.....Are you wearing earrings that you have not worn before?  If I wear any earrings that are not pure gold or silver, I immediately get a bump right below my ear in the node there. Though I haven't worn earrings for years because all I can afford are beautiful yet not pure silver or gold earrings, this used to happen to me...Hope you get this checked out and that you can rest easy soon.....",
      "MessageIndex": 3,
      "PostDate": "11/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/771468",
      "Title": "How far IT can travel in neck lymph nodes??? Karina AnacortesGirl"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Dec 12, 2011 02:17PM kathleen1966 wrote: I hope you get some responses soon from the young moms on here.  I am soo sorry that you are faced with this...it is not fair.  I have a nine year old and a 6 year old. There are numerous moms with young children on the Stage IV forum.  They will be able to help you and bring your hopes up, I'm sure of it.",
      "MessageIndex": 2,
      "PostDate": "12/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/779376",
      "Title": "parenting young children with mets oaklandmama apple"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "May 15, 2012 07:29AM kathleen1966 wrote: I don't' like what I am reading here concerning your breast.  I also nursed two young ones back to back until they were both 3 (Hence the lack of mammograms for me).  I got mastitis with the first one when he was nearly done with breastfeeding.  The breast got large and hard, and red and was very painful.  It cleared up very quickly with antibiotics (thank the Lord above, wish I had a mammo then as I am 100% sure there was cancer there at this time).  What worries me, is that your breast is bruising and that there is a patch.  I think you are right (I am reading your mind perhaps).  You should go back and insist that you don't think this is normal?  Did they give you antibiotics?  Perhaps this could be done to see if it clears up.  It could be an abscess but would this have shown up on the mamo or ultrasound?  I have also had blocked ducts.  They felt like hard lumps and would sometimes hurt, but they did not change the surface of the breast, and they did not look like a bruise.  I hope it is nothing but you should be 100% sure and have peace of mind.",
      "MessageIndex": 6,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787463",
      "Title": "Nothing wrong? Sabrinam CatMac81"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 6, 2011 12:37PM kathleen1966 wrote: Very happy for you Lassman!",
      "MessageIndex": 3,
      "PostDate": "06/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774277",
      "Title": "Brain mets - latest lassman china"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jun 6, 2011 09:42AM kathleen1966 wrote: And I believe this drug is estrogen related so it will not benefit hormone negative cancers? ",
      "MessageIndex": 8,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/769948",
      "Title": "New Drug Prevents Reoccurence by 65%!!!! Pure ktym"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Dec 9, 2012 09:40PM kathleen1966 wrote: I am very sorry about this, it is horrible, not fair, not right.  I hope that you find a treatment plan soon and that it works wonderfully. :(",
      "MessageIndex": 19,
      "PostDate": "09/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797357",
      "Title": "Cancer came back Mamita49 hopefour"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 12, 2013 12:11PM - edited Sep 12, 2013 12:12PM by kathleen1966 Oh congratulations on getting the gift of seven years!  Lets raise a glass of wine to life!!!",
      "MessageIndex": 16,
      "PostDate": "12/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/810712",
      "Title": "Sweeeet Seven SpunkyGirl YATCOMW"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 1, 2012 01:56AM kathleen1966 wrote:",
      "MessageIndex": 5,
      "PostDate": "01/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780266",
      "Title": "It has spead to my brain...... jenn3 lwd"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 9, 2012 02:53PM kathleen1966 wrote:",
      "MessageIndex": 13,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782313",
      "Title": "Any advice would be helpful/very much appreciated sherrbear BikerBabe1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 12, 2012 11:13AM kathleen1966 wrote: This is not the first time I have read of Her2+ cancer showing up in the nodes first.  I am sorry you are in this very frustrating situation.  I hope you hear from someone else who has had a similar issue and is done with treatment and can give you lots of good advice! ",
      "MessageIndex": 2,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782556",
      "Title": "Occult Breast Cancer? JRose10 cs13"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jun 14, 2012 01:06PM kathleen1966 wrote: That is very helpful Anacortes.  Thank you for sharing.  It is a great way to see things.",
      "MessageIndex": 2,
      "PostDate": "14/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/789086",
      "Title": "Scares anyone can share that turned out to be nothing? fondak fondak"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 7, 2015 01:11AM kathleen1966 wrote: Congratultions! and me too!",
      "MessageIndex": 5,
      "PostDate": "07/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/833868",
      "Title": "Five years!!! Karina jennyboog"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 3, 2012 01:01PM - edited Sep 3, 2012 01:02PM by kathleen1966 I read that this only means you are really considered triple negative unless you are also Her2+, and then you will have Herceptin.  The anti-hormone drugs will not be effective so you will not have the benefit of tamoxifen. I read an article on this and thought I had copied it to paste here, but it didn't work.  I didn't like reading worse prognosis in the article though.  I thought it was a bit mis-leading and made it sound like this combination was really bad.  I was told that having ER+ PR+ was the best type of breast cancer to have, as it is slower growing and usually not as aggressive and has the benefit of tamoxifen. This only means that your cancer acts more like a hormone negative cancer, more aggressive.  It doesn't necessarily mean that you have a worst prognosis. It's not good to have hope taken away by reading the words \"worse prognosis\"-not written by you, I am saying reading this in print in research.  Your treatment will just be more aggressive. You chances are as good as an ER+ PR+ cancer in my opinion. So don't lose hope!!! The article also claimed that being ER- and PR+ was clinically not possible and would likely be caused by an error in pathology. I had this (two different pathology reports) and was told that clinically I am PR-.  The article also claimed that the ER+ could also be an error if you are PR-.  I assume this would mean that you are a low ER+. How frustrating this can all be!!!!I will try to locate the article and paste it again!  ",
      "MessageIndex": 3,
      "PostDate": "03/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/792909",
      "Title": "Any er+/pr- out there? Rachel1 ruthbru"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 17, 2011 12:51PM kathleen1966 wrote: Bobbie and family, I am soo very sorry to hear of this news. I have admired your courage/strength and attitude  in handling such a difficult and unfair situation.  You made the absolute best of the time you had together as a family and I hope these memories give you comfort during this time.  ",
      "MessageIndex": 14,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774995",
      "Title": "Spunkygirl (Bobbie) Fitztwins Mamita49"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 29, 2012 06:59PM - edited Aug 29, 2012 07:00PM by kathleen1966",
      "MessageIndex": 1,
      "PostDate": "29/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/792750",
      "Title": "Finally found myself...... Momof2inME ck55"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Nov 24, 2011 04:16AM kathleen1966 wrote:",
      "MessageIndex": 5,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778566",
      "Title": "Herceptin Alone JSB2011 Judy_63"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Apr 9, 2011 11:14PM kathleen1966 wrote: I would say, until you know its cancer, it's not cancer. But I can see why you are worried as the ultrasound report said it was highly suspicious for malignacy. This is a very, very worrisome place to be. I have known women who got this scare (at the same time I had my diagnosis, which was very clear to the radiologist before any biopsy.... soo clear, that I called everyone and let them know I had cancer before I even got the results back), had a surgeon biopsy the suspicious area, and it turned out to be benign.  This has happened numerous, numerous times to many women. You could call the radiologist and ask them what made your lump suspicious for malignancy.  Either way, the end findings will be the same. Take a deep breath, and just wait until you know more.",
      "MessageIndex": 1,
      "PostDate": "09/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/767314",
      "Title": "How Worried should I be? GmaFoley GmaFoley"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jun 21, 2011 11:15AM kathleen1966 wrote: Though the whole picture is bad news, I am very happy that it is only in your liver.  I'm hoping Herceptin will work wonders for you and you will have many years ahead of you. ",
      "MessageIndex": 6,
      "PostDate": "21/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770587",
      "Title": "Starting Navelbine Wednesday and question about veins CoolBreeze Lilah"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 20, 2011 05:14PM kathleen1966 wrote: Hello, Yes I've got the nodes.  Finished chemo six weeks ago.  On to radiation for three and a half more weeks.  At night, while I am in bed, I think of nodes.  When I get up, I think of nodes.  All the time I'm thinking of those damn nodes!   Not sure how they ended up being there when only one lit up ever soo slightly on the PET scan (and then looked benign in the cat scan).  Also not sure how no nodes showed up on the ultrasound or the MRI and the one that they did biopsy came back negative.  But yup, nodes here. I fantasize that it is a mistake and that I am getting the aggressive treatment as if I HAD four nodes. I decided not to get a second opinion.  What if they found five then?  I am feeling and doing very well.  I hope that other node + continue to do well. I also believe each case is unique.Hard not to worry though.",
      "MessageIndex": 934,
      "PostDate": "20/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Nov 3, 2011 09:17PM kathleen1966 wrote: not a stage IV, but I have seen this thread before and just want to say how happy I am for you!  Just soooo, sooo happy to hear this!",
      "MessageIndex": 17,
      "PostDate": "03/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777495",
      "Title": "NED is still loving me!!! :-) JeninMichigan sarah1968uk"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 4, 2011 07:00PM kathleen1966 wrote: Hello Kellie! I have lymphedema. I don't think it presents with sharp pain. It feels more like the skin hurts, not a deep muscle type of pain or a pinched nerve kind of pain. It sounds like you may have pinched a nerve when you moved. I have also done this when gardening and have pain that sounds like what you are experiencing. It took some time for it to go away. I also think that mets are more likely to show up in the upper half of the arm more than the lower portion. If the pain radiates to your neck or jaw, then I would want to rule out having a heart attack as these can be symptoms of a heart attack for women (not trying to scare you). It sounds like you have pulled a muscle or pinched a nerve in the move though. This actually makes sense.",
      "MessageIndex": 3,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772661",
      "Title": "Forearm pain? Arayasunshine69 Binney4"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Dec 9, 2012 08:50PM kathleen1966 wrote: Your wife is not that far out Many.  I remember last year at this time, I had cough after cough after cough.  I even went to Med Express one night and as I got in my car, I said, this is it, I'm going to go get an X-ray and the cancer is in the lungs, I know it. Well I never got the X-ray.  The cough went away, and so did the next one and the next one and the next one.  I was sick all the time when I had never been sick before chemo. I am back to never getting sick now.  It has been a year now since I had a cough. It is going to take time to get back to \"normal\". I think your wife is doing very, very well. I know she had a lot of nodes, but others have had this many nodes and are years out.  Why not your wife?  I hope she feels better soon, it really does sound like a virus. Phlegm is good.",
      "MessageIndex": 5,
      "PostDate": "09/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797344",
      "Title": "Cough many pupfoster1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 2, 2012 11:40PM kathleen1966 wrote: Well it it doesnt, it should!!! (P F...ing chemo!)",
      "MessageIndex": 17,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/792750",
      "Title": "Finally found myself...... Momof2inME ck55"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 10, 2012 11:07AM kathleen1966 wrote:",
      "MessageIndex": 21,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782313",
      "Title": "Any advice would be helpful/very much appreciated sherrbear BikerBabe1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 4, 2012 05:27PM - edited Jan 4, 2012 05:28PM by kathleen1966 Best wishes for benign results....I had pagets (diagnosed at age 44).  Mine showed up as a tiny little sore that wouldn't go away with any creams and my nipple was also inverted. Yes, it is concerning that it is only on one of your nipples. But it is also rare, and you are only 19.  That would be extra rare but still possible.  Good that you are having it looked at and I am very happy that you did not wait any longer.  I hope you get good news on Friday.  Remember, that 86% (around this number) of breast lumps and other breast issues are benign. That is a very large chance that it will be nothing for you. Oh and what a cool name....Molly Woods....!!",
      "MessageIndex": 6,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779513",
      "Title": "I am very worried I have Paget's disease of the nipple MollyWoods Katy_a"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 4, 2011 02:26PM kathleen1966 wrote: I believe I have a bit of truncal lymphedema in addition to lymphedema in my arm and my rib cage area on the \"cancer\" side is/was tender from time to time.  It was very tender during treatment.  I never thought anything of it.  Maybe because it would get all red when I took my prendisone. This told me that it was inflammation. I am a year out now and I have not had this pain for about 5 months...I hope this helps! ",
      "MessageIndex": 1,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/772667",
      "Title": "Need Help ~ Truncal ? CAW Binney4"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Apr 1, 2011 07:15PM kathleen1966 wrote: Hello herekitty24! I wonder if I got my herceptin today because my initial ejection fraction was 55, and 45 was not a significant decrease in this respect.  Either way, I should have received a call about it. I read it while getting my herceptin in my chart.  Now I will wait until Monday to call with my questions.  I have not heard of one person getting their herceptin with a 45 ejection fraction! Now, I don't even know if I should get on the eliptical tonight as I heard the ejection fraction goes down a bit immediately following a herceptin treatment and I'm worried now. I have no idea if this is true though, read it on the internet. Good luck to you!  ",
      "MessageIndex": 3,
      "PostDate": "01/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/766935",
      "Title": "Herceptin side effect: reduced Ejection Fraction herekitty024 marjie"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jul 6, 2012 07:15PM kathleen1966 wrote: I will try to get a couple of my before and afters. I actually lost a little weight with chemo, so I look a bit better than I do now in this regard!  I gained it all back, and then some....:(.  You look great!  My hair is still not the way it was though.  I hate it. It is very, very curly but not in a good way....mostly straight before with just a slight wave...",
      "MessageIndex": 170,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780790",
      "Title": "What a difference a year makes jennyboog Yndorian"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Oct 1, 2011 11:58AM kathleen1966 wrote: Well I keep seeing these posts and I have even seen Her2+ long term survival posts!  This helps soo much and makes us feel that anything is possible for us!  Thank you sooooooo much for thinking of us by posting this!!! ",
      "MessageIndex": 24,
      "PostDate": "01/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/775622",
      "Title": "Marking 8 years since... Trish03 CherylinOhio"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Dec 5, 2010 05:25PM kathleen1966 wrote: I too am feeling down.  I am not as young as you, nor am I stage IV.  I know I can't possibly understand what you are really feeling.  All I can say is that I am in the same place at the moment of facing my mortality (whether this is real or not) and not being able to do so with any form of good feelings about it.  I DON'T WANT TO GO!  I am trying to live in the moment only. This is sometimes hard.  Ok, this is often hard. We are human and all of our emotions are real. You are young, you could live another 10 years with the latest treatments and who knows what is going to happen in those ten years, in those five years, in those three years. A new drug could be found (like herceptin, relatively new, a miracle drug for Her2+) that could extend all of our lives affected by breast cancer.  Perhaps tomorrow you could try to focus on that thought. I can see why you can't relate to your friends similiar in age. You are going through what most women in their 50's, 60's and above go through. I hope you got through your birthday day. I am wishing you well with all of my heart.  Day by Day.....",
      "MessageIndex": 38,
      "PostDate": "05/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761492",
      "Title": "It is my 30th b'day tomorrow HopeToMakeIt HopeToMakeIt"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Oct 12, 2011 07:01PM kathleen1966 wrote: Congratulations!  I remember your story from months ago. Thanks for making us all feel soo good with your good news!",
      "MessageIndex": 6,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/776357",
      "Title": "Cancer-free after 16 months of treatment!!!! LuvRVing Suze35"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 30, 2011 01:14PM kathleen1966 wrote: I too was diagnosed at the first mammogram, which I went in for because I was having physical symptoms...If my life does end up being saved, I will hold my pagets disease as saving me.  It's what brought me in.  And it was a tiny little spot.  Yes, the nipple was slightly inverted and the breast looked wierd.  But I had lost weight and also nursed for a total of six years (so much for that helping)...two kids...diagnosed aged 44...now 45...past my one year mark....one more Herceptin to go...we'll see....",
      "MessageIndex": 673,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "May 1, 2012 10:50AM kathleen1966 wrote: Yes, let it go. You seem to have a a very good relationship with you brother. Clearly, he cares very much about you. He may not understand how breast cancer works.  We will never really be free of the worry as it can come back at any time.  Do you really want him to see it in this true way? We are told to just live our lives and not worry about it coming back. Because if it does, we will realize we wasted all that time worrying when we could have just been living and that worry will not make it any less devastating if it DOES come back. Perhaps \"it's gone\" and \"your cured\" is your brothers way of wanting nothing more than a full life for you. They really don't know any better. Not really always fair to us, but much better for them. I sometimes think there are aspects of this experience that we have no choice but to experience alone. One of them is the worry of a recurrence.",
      "MessageIndex": 6,
      "PostDate": "01/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/786741",
      "Title": "Annoyed, need to let it go... Laurie09 karen1956"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 27, 2012 03:50PM kathleen1966 wrote: Congratulations on this incredible milestone.  I am wondering, did you exercise this much before diagnosis, or was this something you started afterwords to reduce your changes of recurrence or because you just wanted to be healthier.  I am currently exercising every other day.  I'm not sure if this is enough.  But when I am doing it, I envision tiny cells being eradicated from the heat exercise causes..and I feel it puts my mind in a better place. But I think I need to do more. I have to be honest, I hate it.  But still I know it needs to be done. I don't know what I would need to do to get myself out as much as you are getting out but I do agree, it is very helpful. Thanks for inspiring..",
      "MessageIndex": 17,
      "PostDate": "27/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/783260",
      "Title": "Diana50!!!!!! ck55 kimf"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 10, 2011 09:04AM kathleen1966 wrote: Hello Jennyboog, I have lyphedema.  It has not gotten worst in the past year but it is good to go see a lymphedema specialist to keep the swelling in check with compression garmets, etc...Why do you feel it is in your neck?  Do you have pain or swelling there?  I suspect it is in my chest as I sometimes have heaviness there.  When I was taught how to do a lymph massage, I did have to massage a part of my neck to get the \"flow\" going, so I imagine it could back up there.  It seems the surgeons know very little about lymphedema.  The surgeon, oncologist and lymphedema specialist all usually had different ideas about what to lift, when to use my arm, etc....It could get worst if you do not see a specialist to at least have a consultation...",
      "MessageIndex": 1,
      "PostDate": "10/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774537",
      "Title": "LE....in neck too jennyboog jennyboog"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 19, 2012 10:41AM - edited Mar 19, 2012 10:48AM by kathleen1966 Hello, and sorry to meet you here!  If you want the most aggressive treatment then go with AC (adriamycin/cytoxan) every 3 weeks and then 4 cycles of TH with Herceptin.  THAT is the most aggressive regimen.  Now having said that, you are aware of the potential affects that adramycin can have on the heart, and that some oncologist are concerned that using it with Herceptin (which you know also can cause heart issues) is a double whammy for the heart.  Add radiation to this, and that will be three things that could potentially be bad for your heart. Adriamycin also can have the late effect of causing a secondary leukemia in the future, though this is rare. The TCH combo (which I did) is only slightly less effective than the ACTH combo. Taxotere also does not have the same effect on the heart as adriamycin does.I handled it very well with little side effects but others have had more of a hellish experience with Taxotere (not to deter you, but more to say that Taxotere is no walk in the park so you don't see it as less powerful than Adriamycin). I believe the difference is not significant in forms of one being better than the other. But one HAS been shown to be slightly better in terms of recurrence.    As Carboplatin is also an alkylating agent, I believe it could also rarely cause leukemia so doing the TCH does not get you out of this long term very rare occurrence.   I also read  that dose dense chemo is very affective.  I was never given this choice. I had orginally been set to receive the ACTH combo, as it was thought I was going to participate in a clinical trail being offered.  When I decided not to do the trial, I received the TCH combo. At the time, I did worry that I was not getting the most aggressive treatment. I was never included in the decision process. Studies also say that using Herceptin with chemo is most affective.  There are soo many factors to figure in!!! If you do the TCH combo, you will get Herceptin the entire time, if you do the first one, you will not get Herceptin with chemo for four cycles or you will get it in the second leg of your chemo treatments?  When I received radiation at the mastectomy site, I asked about the heart.  They said that they are soo good now at aiming the beams (better equipment) that they are not concerned with the heart or lungs as they used to be.  Despite this, my ejection fraction went down to 45 during radiation.  I still got Herceptin.  I asked if it could have anything to do with the radiation and the oncologist wasn't really sure either way.  But....it went back up to 55 when radiation was over..... Good luck with your decision. How is your heart at the moment?  If you have a low normal ejection fraction, and treatment brings it lower, this could affect your getting Herceptin. I would factor that into your decision as well. Getting the Herceptin is very important in your treament plan.  I think any treatment we have can have a long term impact on our future health.  I have a friend who was treated with adriamycin for stage III breast cancer nine years ago.  She does have congestive heart failure due to this treatment.  She is no longer able to work, but otherwise is leading a full life and has survived her stage III cancer!!!. I have lymphedema which will be life long. The uncommon heart effects from Herceptin are thought to be temporary and go away after treatment. Herceptin is relatively new though and they really don't know the long term effects yet in my opinion (and I'm not a doctor). The uncommon heart effects from adriamycin are permanent but not common.",
      "MessageIndex": 4,
      "PostDate": "19/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/784350",
      "Title": "Choosing AC/TH or TCH chemo regimens Debbie675 Debbie675"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 11, 2011 02:58PM kathleen1966 wrote: Yes, no-one wants to be stage III. I wanted soo bad to be at least stage II after going from Stage I to stage III after surgery, due to one extra lymph node.  But everyone told me staging does determine your treatment. That is what I tell myself, I try not to think of the prognosis factors. It is not helpful.",
      "MessageIndex": 59,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jul 21, 2012 12:30PM kathleen1966 wrote: Hello!  With eight nodes, that would put a person at N2 and not N1.  Four or more nodes is N2.  And this is considered locally advanced. My largets tumor wasn't all that large, but I had four nodes and LVI.  I see that I have replied earlier, but never actually answered the question.  I discovered this information recently, as I thought I was early stage but realized I am not. Some stage IIIa is considered early stage.  That would be possibly a large tumor with no nodes (over 5cm alone will put you in stage IIIa with no nodes) or an over 5cm tumor with under four nodes. Either way, I hope your mother is doing well as your original post was over a year ago!",
      "MessageIndex": 66,
      "PostDate": "21/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 30, 2012 07:12PM kathleen1966 wrote: Oh Pure, this is the best post I've read in a long time!!!!!!  Congratulations on your re-newed birth and new and better life!!!!",
      "MessageIndex": 19,
      "PostDate": "30/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791851",
      "Title": "3 Years Cancer Free Pure Pure"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "May 17, 2012 09:22PM kathleen1966 wrote: I hope we can ALL get this ASAP!",
      "MessageIndex": 4,
      "PostDate": "17/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/787677",
      "Title": "BC vaccine...there is hope! jennyboog ma111"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Oct 4, 2012 10:13AM - edited Oct 4, 2012 10:13AM by kathleen1966 I don't think I would take this option if offered it. I think it is easier for the plastic surgeon to do it this way and that is why they are suggesting it (easier to make the match). I would'nt do it because I wouldn't want to sacrifice the feeling of the only breast I have left.  I feel normal on this side. No numbness, no nerve damage and no lymphedema.  And what if the breast fails?  Then you will still not have good options for that side. Yes, if it comes back on your good side, you won't have the option of taking fat from the belly to make a breast. But only if the cancer is soo advanced you would need a mastectomy.  You could get an implant, and then have an implant on the other side added to look more matched?  I would think that with close screening, a breast cancer will be found in the other breast early and will be dealt with via a lumpectomy.  That is how I see it for me. I hope this helps.  I am also considering the DIEP two years out here. I hope this helps.  What are your worries regarding this decision?",
      "MessageIndex": 2,
      "PostDate": "04/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/794460",
      "Title": "One breast or two? Elizabeth1959 Elizabeth1959"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 22, 2012 11:47AM kathleen1966 wrote:",
      "MessageIndex": 10,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/703743",
      "Title": "Can a Benign Lump Become Malignant Later On? Kim32 marie5890"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Apr 4, 2011 01:25AM kathleen1966 wrote: Wow, this is just plain intetersting.  Wish some of my freckles went away!  I'll have to check to see if any moles I had went away (I have soo many, it's hard to tell)",
      "MessageIndex": 4,
      "PostDate": "04/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/767028",
      "Title": "Skin Cancers Reacting to Chemo? Mimidi Mimidi"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jun 27, 2011 12:35AM kathleen1966 wrote: I will just tell you that I sat next to a woman while getting herceptin two weeks ago that has been treated for bone mets for over 14 years....I see that you are Er+ which is a good thing in terms of treatment?  I have heard that you can live with bone mets in particular for many years.",
      "MessageIndex": 4,
      "PostDate": "27/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770837",
      "Title": "How long have you had bone mets? Foxlairfrm cmhartley"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Oct 24, 2011 10:36AM kathleen1966 wrote: My tumors were deep in the breast.  The numbing medicine had trouble getting that deep.  Still, it was not all that painful...Good luck!",
      "MessageIndex": 5,
      "PostDate": "24/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/776939",
      "Title": "Counting Down - Core Biopsy Painful? LesleyZ jstunme"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 26, 2012 01:54PM kathleen1966 wrote: Hello again, I don't think there is really any way of avoiding lymphedema. But not everyone gets it. There are plenty of women on here who had lots of nodes removed and don't have lymphedema.  You can avoid the lyphedema progressing by wearing a fitted sleeve and glove, but you usually only get these when you end up diagnosed with lymphedema.  I never had a whole body scan.  I assume this is because I had the PET scan initially and if cancer were in my bones, it would have showed up in the PET scan. As you are Her2+, I would also ask for an MRI of your brain for a baseline here.",
      "MessageIndex": 7,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/784350",
      "Title": "Choosing AC/TH or TCH chemo regimens Debbie675 Debbie675"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Dec 30, 2012 02:47PM - edited Dec 30, 2012 02:48PM by kathleen1966 I am one who was constantly sick after chemo for over a year (despite not being sick once while on chemo). I got every bug that blew by my face.... But I haven't been sick once in the past year......and I have gone two seasons now without a flu shot....I was like this before cancer.  I couldn't even remember the last time I had gotten sick.  Here I thought my immune system was an iron horse and then I got cancer.  Maybe my immune system IS an iron horse and that is why I did relatively well during chemo and radiation (I never got even a cold and here I was with young kids in school, oddly this was the only year they also never got sick...was God taking care of me or was it their wonderful teachers making sure everyone washed their hands for me?) and continue to do well now (other than the year of being sick constantly)....knock on wood for saying that just now.... Well that must have been an other thread like this one! I say that I haven't been sick but I don't feel the same.  I ache more now. Look older....not really the same...not really better than before...but well...considering how much worse is could be... I think I may be somewhere earlier in this thread, talking about how sick I've been with low RBC counts and still low WBC counts a year later....these issues have resolved.....",
      "MessageIndex": 4,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/798181",
      "Title": "Colds, Flu, - not me, I had chemo clariceak beth1965"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 19, 2011 01:25PM kathleen1966 wrote: I wrapped to prepare myself for the compresson garmet.  I sometimes wonder if all the therapy actually caused the swelling as I went in with a slightly swollen arm and ended up with a VERY swollen arm.  All worked out regardless.  After over six weeks of wrapping (and it is sooooooooooooooooooo depressing I have to say to have to do this) I finally got  my compression garmet or the arm was down enough to get the garmet.  I wear it every day.  I have been told only to wrap if I notice more swelling than usual. I take it off at night and usually wake up with a less swollen arm.  Right now, I am painting windows and so I took off the glove (I shouldn't be doing this though, taking the glove off).  Lymphedema is a giant pain in the ass. But it can be treated.  No, I don't want to wear this stupid garmet and glove for the rest of my hopefully super long extended life, but I have no choice.  I'm glad there are others to share our experience with. There is really no other way to say it other than it is a very unfortunate side effects of surgery or radiation.  And I have heard that it can show up any time, even years after diagnosis or surgery. Thinking of you! ",
      "MessageIndex": 12,
      "PostDate": "19/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/765434",
      "Title": "Is wrapping always life long thing? nowords sushanna1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 3, 2012 01:41PM kathleen1966 wrote:",
      "MessageIndex": 26,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780329",
      "Title": "Hold Me Up Sistahs pupfoster1 thefuzzylemon"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 11, 2011 03:00PM kathleen1966 wrote: Personally, I think we are all in this together and I don't mind when a stage 1 or 0 posts on the stage III forum.  It is all ok.",
      "MessageIndex": 60,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 16, 2011 03:25AM kathleen1966 wrote: Wow, thanks for sharing, wonderful to see members connecting like this...",
      "MessageIndex": 13,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773140",
      "Title": "Kerry is here! everyminute Mamita49"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 5, 2014 10:07AM kathleen1966 wrote: It would think that that CT scan would have also shown issues in your neck.  Have you been tested for viral meningitis?  It could be a virus of sorts. I would call your regular doctor and have blood work done?",
      "MessageIndex": 1,
      "PostDate": "05/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/816504",
      "Title": "How long do you deal with a new pain before calling the doctor? karody Denise-G"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 8, 2013 01:05AM kathleen1966 wrote: Wow! I finally clicked on this link and I see it is you!!! What wonderful news for you and your family! What a wonderful gift!!!",
      "MessageIndex": 54,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/806012",
      "Title": "In shock for a different reason - PREGNANT! Letlet kathleen1966"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Apr 7, 2011 08:06PM kathleen1966 wrote: Yes, KerryMac, I am loving the new avatar! ",
      "MessageIndex": 7,
      "PostDate": "07/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/767138",
      "Title": "See you in 3 months americanpinay shelly56"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "May 15, 2012 03:31AM kathleen1966 wrote: I had this for about a month and I was never on tamoxifen.  For me, it was my period making a come back.",
      "MessageIndex": 5,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750060",
      "Title": "Clear, Spontaneous Vaginal Discharge - Tamoxifen SE? bejuce BouncingBetties"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jul 12, 2011 01:08PM kathleen1966 wrote: I think you have an excellent point and as lowrider said in the past, she believes that no-one is cured from cancer unless they got IT ALL OUT AT SURGERY, meaning it was an early cancer that had not spread, and actually did NOT spread and they actually did get it all, or all it ever went to were a couple of nodes (sorry, I doubt this usually)..Soo basically I think you are right, that it is a crap shoot. I have no idea why I will go off of Herceptin in September.  We already know it got in the lymph nodes.  Is this \"pre-metastatic\"...likely but also maybe not...again a crap shoot.  There are women on here (coolbreeze comes to mind, hope its ok I used your name!) that had no nodes and ended up with metastatic disease.  So, I suppose it is only 100% curable if it is NOT invasive, that is stage 0, pre-cancer DCIS.  The rest of us, it is a bit of a crap shoot.  I think that chemo is capable of killing microscopic cancer cells (and I am contradicting myself now a bit), because they have not taken hold and grown to large numbers, which then grow into a tumor in an organ, etc....and are than essentially immortal. Because thats was cancer is, immortal. It has the capability to live forever until its host dies if not treated or controlled. I do not mean to offend or hurt by implying that women with metastatic breast cancer are hosts, I am just saying that this is how cancer treats us.  It is a bastard and it doesn't seem to care that we are women with important long lives to live, with children and husbands, dogs we love, gardens we want to plant, grandchildren we want to spoil, places we want to visit...the list goes on and on and on.....  Personally for me, I hope that surgery got all the cancer cells and that chemo was useless for me, as there was no reason.  If this is not the case for me than I expect it to be back at some time and I am just hoping for a long, long remission. When I say long, I mean enough time to see my kids grow up, go to their graduations and weddings, possibly meet a grand child and then have some time to rest and possibly read a book in quiet. So a very long time for me. And maybe a lifetime...that would be a blessing and I would see it as almost a miracle.... I have no idea how this will all end.  I have some idea of how it will end but there is truth in saying none of us knows how long we have. I hear this comment over and over from women being treated for metastatic breast cancer.  In the past year I have been treated for breast cancer I have lost one friend to pancreatic cancer, another friend to a heart attack and a young family member to suicide.  I am still here so you know what I am saying.  We just don't know. I love that you have thought soo deeply about this issue.  And it makes absolute sense what you are feeling and the conclusions that you have come to make perfect sense to me. ",
      "MessageIndex": 283,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 13, 2012 01:16PM kathleen1966 wrote: Yes! Thanks!! ",
      "MessageIndex": 187,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780790",
      "Title": "What a difference a year makes jennyboog Yndorian"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 19, 2012 02:55PM - edited Mar 19, 2012 02:56PM by kathleen1966",
      "MessageIndex": 1,
      "PostDate": "19/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/784365",
      "Title": "What does a mitology score of 1 mean? lanagraves lanagraves"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jan 2, 2013 09:23AM kathleen1966 wrote: Apple, you are my favorite voice on these boards.  I have enjoyed every word of every post you have ever written. All the quirky and interesting stories.  Your dry wit and beautiful children. I know you are struggling with the side effects from your last radiation. I hope these effects go away, that your tumor regains stability and that you have a lot more time here on Earth....you have been much help to many all over these boards during my time here and you are a treasure...",
      "MessageIndex": 44,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798177",
      "Title": "Has anyone heard from Apple? marie5890"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 14, 2011 03:24PM kathleen1966 wrote: I had my first visit with my oncologist since my last chemo treatment (January 7th).  I asked her if she had any long term survivors with nodes.  She said she had many and that one of her patients had 29 positive nodes and is also HER2+ and is going on year nine of remission. This made ME feel good.  I hope it's actually true and not some story she tells women like me who ask that question. LOL...But I hear of others...I have a friend who was diagnosed stage III nine years ago and another who was diagnosed at 27 years of age.  She is now 42.  Hope this helps!  I need these stories as well.",
      "MessageIndex": 41,
      "PostDate": "14/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765601",
      "Title": "Remind me of the hopeful stories elmcity69 thefuzzylemon"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "May 25, 2013 09:13PM kathleen1966 wrote: Wow!  What a cocktail of hope for anyone to read, even someone who has NEVER been diagnosed with cancer.... Congratulations to you and your happy ending!  ",
      "MessageIndex": 9,
      "PostDate": "25/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/805195",
      "Title": "Life really DOES go on! Bugs SpunkyGirl"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 15, 2012 07:13PM kathleen1966 wrote: That sounds very stressful. Especially when everything is going soo well for you. I almost WISH my oncologist would do the same for me though.  Because I will NEVER ask for one but if I had this peace of mind, it would be a tremendous relief.  When I was first diagnosed I had zero scan anxiety.  I was not worried.  Now, I get soo nervous and worried every time I have to have blood drawn. So I'm sorry you have to have this scan anxiety.  I am also from the not wanting to know crowd. But....how nice it would be to get an all clear at the same time.  How else do they really know?  It DOES make sense.  I wish you wonderful clear results and then I will be jealous of the good nights sleep you will have that night!!!",
      "MessageIndex": 2,
      "PostDate": "15/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/792059",
      "Title": "Hi ho, hi ho...it's off to scan I go! jennyboog damazon"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 13, 2013 06:22PM kathleen1966 wrote: It' s soo nice to see you Barb!  congratulations!!!",
      "MessageIndex": 23,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/801582",
      "Title": "4 YEARS ALREADY! Shanagirl lovujja"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jun 2, 2013 04:30AM kathleen1966 wrote: I am not ER+ but if your treated cancer was fueled by estrogen, than I would think that your period returning means that the tamoxifen is not doing its job. I hope someone else can give you better information! ",
      "MessageIndex": 1,
      "PostDate": "02/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/805543",
      "Title": "Stage 3 - Periods have come back, should I take further action? Lillymillie politicomama"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 23, 2011 06:29PM - edited Mar 24, 2011 02:42AM by kathleen1966 I am very sad to hear this.  But I will tell you she was lucky to have such a wonderful and loving/supportive husband as you.  And I know this love you have for Olga and your family will now be \"twice\" wrapped around your two young children. My heart is heavy thinking of them. She was and will always be a beautiful women taken too young.  I hope that if there is a heaven or a place like heaven, that she will be greeted there with the opened arms of countless other mothers who lost their lives to cancer and had no choice but to leave their young children behind.  I hope they embrace Olga and send a burst of strength and courage to earth to embrace all of the children and husbands left behind. I have two boys, the same age. Sooo sad.  I am devastated.",
      "MessageIndex": 63,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766537",
      "Title": "Olga Simkin Z\"L leprechaun Bestbird"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 23, 2011 12:08PM kathleen1966 wrote: I had the TCH plan, which is becoming more common.  But the AC-T plan is slightly more aggressive.  They are now more giving the TCH as A can cause heart damage and so can Herceptin so they are leaning against increasing this heart risk factor by giving both.  Sometimes, I wish I got the stronger one though. The difference between the two in terms of outcome is only slightly in favor of the AC treatment. Normally, they might go in for a second surgery if the margins were not clear but I think its good that they will do this after the chemo. That way, you will know for sure if it worked. Good luck.",
      "MessageIndex": 3,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/766529",
      "Title": "Is my game plan too much???? countrywoman starbeauty"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 8, 2011 04:03PM kathleen1966 wrote: The size of your tumor alone can put you in stage III with no lymph nodes.  I can't remember but it may be either over 3cm or over 5cm.  I had a rather small tumor but it managed to go to four nodes.  And that one extra node (4 instead of 3) put me in stage IIIa.  I hope that you are very, very happy that your tumor has not gone to the nodes! ",
      "MessageIndex": 2,
      "PostDate": "08/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765937",
      "Title": "anybody else stage 111 because of skin penetration? ctm1 mammalou"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 27, 2013 12:09AM - edited Mar 28, 2013 04:57PM by kathleen1966 Hello! Sorry to see you here but I hope I can help! I menstruated for the first three months of chemo, the entire time. It stopped the day they sent me for a pelvic ultrasound to make sure everything was normal as my uterus lit up on a PET scan three months previous. They attributed this uptake to menstruation. Other than some thickening, all was fine. I had no periods for 10 months with all the menopause symptoms. Then my skin started to look nice again and menstruation resumed. And BOY did it come back with heavy, heavy bleeding that was more like hemorrhaging. I ended up needing to have an ablation (and the pathology came back with no issues).  Then I went for a couple of months with no period and then it returned again.  Now it is very, very light and normal. It took a very long time to get to this point. I will never know if things would have evened out without the ablation.  I am 2.8 years out at this point. I was very surprised that my period came back as I will be 47 soon but I was very happy to see it return. I hated how I felt and looked when I got a peek of menopause. But also, I don't think real menopause comes on as suddenly as it does with chemo. So I think that what you are describing is normal. It really takes a long time for EVERYTHING to get back to almost normal.  ",
      "MessageIndex": 1,
      "PostDate": "27/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802396",
      "Title": "Periods TooYoungforThis Babs37"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Apr 1, 2011 03:42PM kathleen1966 wrote: My ejection fraction is also 45 and my herceptin was still a go today.  What was your initial ejection fraction?  Mine was 55.  I am a bit concerned about this but as I was allowed to continue with Herceptin, I will just ask my oncologist about in when I see her in three weeks. ",
      "MessageIndex": 1,
      "PostDate": "01/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/766935",
      "Title": "Herceptin side effect: reduced Ejection Fraction herekitty024 marjie"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 3, 2012 03:28PM kathleen1966 wrote: Anacortes, that is horrifying...wow.  I hope that this new equipment becomes the standard. It was quite amazing to watch.",
      "MessageIndex": 9,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782045",
      "Title": "Hope for Dense Breasts Shanagirl Shanagirl"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 12, 2013 01:37PM kathleen1966 wrote: Loved it!  You all look beautiful!  I hope you thoroughly enjoyed all the pampering!",
      "MessageIndex": 5,
      "PostDate": "12/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/800353",
      "Title": "Survivor photo shoot everyminute pupfoster1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "May 15, 2011 03:01PM kathleen1966 wrote: Wow, I never knew this could happen months or years after surgery!  Good to know. I hope that this is what it is for you!",
      "MessageIndex": 6,
      "PostDate": "15/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/768996",
      "Title": "hmmm, what's this? kimf karen1956"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Oct 5, 2012 06:55AM kathleen1966 wrote: I am curious as to how the DEIP will have a positive effect on the lymphedema?  I also have lymphedema.  I can relate to having trouble getting excited about a surgery when you feel good.  That is one reason I have put the surgery off.  It is soo major!!!",
      "MessageIndex": 5,
      "PostDate": "05/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/794460",
      "Title": "One breast or two? Elizabeth1959 Elizabeth1959"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jun 26, 2011 08:35AM kathleen1966 wrote: It is the same with me, just blood work and a chest X-ray every other year.  My oncologist says, otherwise, she would just be giving me unnecessary radiation....",
      "MessageIndex": 7,
      "PostDate": "26/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/770810",
      "Title": "Blood tests or scans SharonMH Karina"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 8, 2012 09:24PM kathleen1966 wrote: Congrats to all of you!  You give us all soo much hope for our future!",
      "MessageIndex": 21,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782245",
      "Title": "3 years from last treatment everyminute AnacortesGirl"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Nov 6, 2012 10:25PM kathleen1966 wrote: Happy Birthday gorgeous!  I am 46 so we are close in age!",
      "MessageIndex": 17,
      "PostDate": "06/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/795888",
      "Title": "I turned 45 ! Karina kathleen1966"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 2, 2011 12:54PM kathleen1966 wrote:",
      "MessageIndex": 1,
      "PostDate": "02/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774100",
      "Title": "Ok now I feel dumb... Letlet Yanyan"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 24, 2011 03:03PM kathleen1966 wrote: So there is no blood clot?  Are you sure?  Because a blood clot would cause all of these symptoms, I had one. I would want to be certain there was no blood clot in there.....you did have surgery if I am correct? I know they are saying that these symtoms mimic a blood clot, but be sure!!!! I hope you feel better soon. ",
      "MessageIndex": 4,
      "PostDate": "24/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/775424",
      "Title": "POPLITEAL CYST HAS ANYONE HAD THIS ? Shanagirl Shanagirl"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 2, 2012 03:20PM kathleen1966 wrote: I heard at my last oncologist visit that I had dense breasts (news to me, no-one ever said so).  I am getting one yearly mammogram on the remaining breast and zilch on the other side.  It is a digital mammogram but I feel I should be getting and MRI.  I also wonder why they wouldn't want to at least do an ultrasound on the other side to make sure the nodes remain clear.  I had all of my axillary nodes out, but what about the rest.  I really have no idea what to look for. Will look at the link now!",
      "MessageIndex": 2,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782045",
      "Title": "Hope for Dense Breasts Shanagirl Shanagirl"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Apr 13, 2012 11:50PM kathleen1966 wrote: How does your doctor know you don't produce the protein?  I get the 15.3 tumor marker.  Mine has always stayed the same in the 18 to 22 range at the beginning and all through treatment and now...",
      "MessageIndex": 2,
      "PostDate": "13/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/785784",
      "Title": "Tumor Marker ? Rachel1 financegirl"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "May 21, 2011 08:13PM kathleen1966 wrote:",
      "MessageIndex": 16,
      "PostDate": "21/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/769256",
      "Title": "Need encouraging words! Ranting! kathleen1966 duckyb1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Jun 13, 2011 09:36PM kathleen1966 wrote: Well back to the original post, taxotere and fingernails. I was told vinegar and water.  I never needed it.  My fingernails are fine now, though they did seem to slightly separate and looked as if another fingernail was growing underneath them.  Now my eyelashes are another problem.  I seem to have lost them on my left eye.....again....not all of them but enough to make putting on mascara impossible. And I am five months out from chemo here.....",
      "MessageIndex": 23,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769274",
      "Title": "Still losing fingernails -- 2 years after taxotere Texas357 Texas357"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Sep 19, 2012 10:26AM kathleen1966 wrote: Congratulations on making it through the hardest year!!! May next year be a better year, filled with good health, energy, more hair and eyes wide open to life!!!",
      "MessageIndex": 5,
      "PostDate": "19/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/793747",
      "Title": "One year today!!! katyand4 katyand4"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 30, 2013 06:58AM kathleen1966 wrote: Well this just sucks! I am hoping that this is a lymphedema issue or an infection of sorts, all possible. I hate that you are having to suffer through worry...and I hope your weekend is stress free!",
      "MessageIndex": 12,
      "PostDate": "30/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/810121",
      "Title": "More Tests Ugh pupfoster1 lovujja"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Aug 30, 2013 05:09PM kathleen1966 wrote: Yay!!! Not cancer, whatever it is, it is NOT cancer, what joyous words for you to hear!!!! Soo happy for you're good news!!!!!",
      "MessageIndex": 18,
      "PostDate": "30/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/810121",
      "Title": "More Tests Ugh pupfoster1 lovujja"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Apr 8, 2012 01:19AM kathleen1966 wrote: This is just horrible Michelle. I have no idea what to even say. I am soo very sorry that this has happened.",
      "MessageIndex": 16,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785463",
      "Title": "My Sister Passed Away Tonight Curlylocks kaycancer"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "May 11, 2011 07:50PM - edited May 11, 2011 07:52PM by kathleen1966 I had/have a stressful life.  But, my grandmother lost three babies, almost lost a son to polio, my grandfather got polio and was out of work for a year (she did not work) and then he died when she was in her early fifties. She also had a nervous breakdown after losing her third child (she was RH-) and was in bed for nearly a year.  She also lived through the depression and grew up poor.  She is 93 and still going strong.  She had a lot more stress than I do and did not end up with Breast Cancer. In fact, no-one ever in the history of my family has ever had breast cancer and the women generally live to be well into their nineties. I am a family anomaly now.I have met women who are convinced stress played a part in their cancer.  Stress can depress the immune system and we need a good immune system to fight off cancer. So maybe it's not the actual stress but how we handle the stress. I wish they knew why this is happening to women and some men. ",
      "MessageIndex": 12,
      "PostDate": "11/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765345",
      "Title": "Just wondering... jennyboog shelly56"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 28, 2011 11:14AM - edited Mar 1, 2011 07:26PM by kathleen1966",
      "MessageIndex": 86,
      "PostDate": "28/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764313",
      "Title": "Why don't Chinese women get breast cancer? MCTHO"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "May 21, 2011 06:44PM kathleen1966 wrote: Thanks everyone.  Today was a bit better.  Yes, I need to look into my sons issues.  He is also a very thoughtful and loving child.  Gets along with his younger brother very well and is always looking out for him. He also has a lot of friends at school and has had numerous visitors to the house. But he likely has OCD sprinkled with a bit of ADHD and there have been times I worry about Bipolar as well.  It is in the family. We will get through this next hurdle and I know there are others who are going through a lot worst.  The woman on here who's husband has a brain tumor comes to mind and I believe there is another woman on here who battled cancer with a disabled daughter.  Then there are the women battling stage IV.  I admire them all. This is life I suppose.  Thanks!",
      "MessageIndex": 13,
      "PostDate": "21/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/769256",
      "Title": "Need encouraging words! Ranting! kathleen1966 duckyb1"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Feb 28, 2011 11:13AM - edited Mar 1, 2011 07:26PM by kathleen1966",
      "MessageIndex": 85,
      "PostDate": "28/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764313",
      "Title": "Why don't Chinese women get breast cancer? MCTHO"
    },
    {
      "AuthorID": "kathleen196…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106354/profile",
      "Content": "Mar 1, 2011 06:49PM - edited Mar 1, 2011 07:25PM by kathleen1966",
      "MessageIndex": 96,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764313",
      "Title": "Why don't Chinese women get breast cancer? MCTHO"
    }
  ]
}