{
  "AuthorID": "katirob",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68791/profile",
  "Posts": [
    {
      "AuthorID": "katirob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68791/profile",
      "Content": "Jul 29, 2008 03:30PM katirob wrote: Hi Deb -     My experience is mirroring Gina's above, but I've only had one of the 6 TAC treatments I'm scheduled for.  The first one wasn't awful - my anti-nausea regimen was like Gina's - Emend with the tx then Emend for days 2 and 3, plus Zofran and Compazine if needed (I didn't need them).  My tx was also on Wed and I worked (at home, but still all day) the following Monday.  Day 2 was a breeze, day 3 I was a little tired Day 4 I was immobile with fatigue, Day 5 I started bouncing back, and by day 6 I was fine.  My worst SE was constipation - so water and fiber have become my new best friends.  My tumor was only 2.4 cm, no node involvement but high grade 3 - really aggressive.  My onc let me know I could go with a less aggressive treatment but she didn't recommend it.   Because I had a lumpectomy I will have radiation also.       Good luck with your decision.  But don't be afraid of TAC - no chemo is fun, but I don't think this is a much bigger deal than the other options.      Take care,  Kati",
      "MessageIndex": 3,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/714642",
      "Title": "TAC treatment??? Help! Passenger59 BikerChick"
    },
    {
      "AuthorID": "katirob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68791/profile",
      "Content": "Oct 13, 2008 08:52PM katirob wrote: Hi Jose -     I have a real hair wig and you treat it much like your own hair.  You wash them when you think the cap needs it - my wig lady said if I wear it every day, washing every two  weeks was enough.  You just use normal shampoo and conditioner working from crown to ends, but leave some of the conditioner in (rinse lightly - not like you'd do your own hair) since the wig hair doesn't have the benefit of natural oils.  Then hang up to dry.  Better if you don't dry it on the head if you have a styrofoam head.  You can use a hair dryer, curling iron, etc just like your own hair. My husband fixed up a way to put the head in a vice so I could use both hands to style.  It's pretty cool.",
      "MessageIndex": 1,
      "PostDate": "13/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722697",
      "Title": "Real Hair Wigs - maintenance newmex1598 lisasayers"
    }
  ]
}