{
  "AuthorID": "Katielou123",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256929/profile",
  "Posts": [{
    "AuthorID": "Katielou123",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256929/profile",
    "Content": "Katielou123 wrote: Hi I'm new to this forum but wanted to start a new thread about papillomatosis, as I can't find much information about it. I am 38 years old and last December was referred to breast clinic for breast pain and discharge in left breast, where I also have an inversion, but have had this since puberty. A 5cm mass was found on the upper outer area of the breast which was also seen via mammogram. I was asked for a biopsy to take place that same day. It came back benign 1 week later. However was asked to also have an MRI on the area which I had 2 weeks later. The MRI confirmed the large mass and also a smaller one underneath the breast. Again I was asked to have the original mass biopsied again this time using a vacuum biopsy and a fine needle biopsy of the smaller mass. 1 week later, they both came back benign. I asked about removal but was told that they wouldn't remove papillomas as it would cause scar tissue which would make any subsequent cancers difficult to spot on a mammogram. I was told that I would have a mammogram and MRI alternatively every 6 months for 5 years to monitor Any further changes. I was happy with this course of action. However one month later I relocated from Hertfordshire to Devon and after waiting almost 3 months to be introduced to a new breast clinic I was told that they would not offer me this kind of imaging as they did not do it in this county. The new breast clinic didn't even have copies of my old images or biopsy results I was told that if I wanted to continue with the imaging I would have to go back to Hertfordshire. on calling the breast clinic in Hertfordshire I was told that I had been discharged and as I was no longer local I could not have my imaging done there. It left me feeling in limbo. After weeks of making phone calls and trying to get all of my old imaging sent to the new breast clinic they have now finally received it and reviewed it. Yesterday I received a letter saying that they would like to offer me surgical intervention but that this was dependent on my biopsy results. They have now requested my biopsy test you from Hertfordshire to be sent to the breast clinic in Devon to be re-biopsied. This has left me confused one clinic says that they will not remove the papillomas where as the other clinic is suggesting it. I also don't understand why they want to retest the tissue that has already been biopsied what are they retesting it for? I'm so confused nobody is explaining things to me very clearly has anyone else experienced anything similar to this do you think that I should go ahead with the surgery? MAny thanks Katie ( worried and confused Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "29/07/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857430",
    "Title": "Waiting for surgical intervention for papillomatosis Katielou123 Judeshome"
  }]
}