{
  "AuthorID": "katiedaw",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194608/profile",
  "Posts": [
    {
      "AuthorID": "katiedaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194608/profile",
      "Content": "Jan 21, 2014 05:35PM katiedaw wrote: I'm right there with you! I had an excisional biopsy last week for a radial scar, something that's sort of similar to a papilloma. It came back as b9 on a needle biopsy but can hide malignant cells, so they had to surgically remove it to make sure. I'm still in disbelief about how easy the surgery and recovery have been. I've had virtually no pain and haven't even needed tylenol. For me, the needle biopsy was worse. I didn't have any of the nipple and areola removed but today I took off the outer bandage and noticed the incision was right at the base of my areola. The worst part is waiting for results. I keep telling myself that if it's malignant, it was caught early as there are no other signs of cancer, so even the worst news will be \"positive\" in a way. Sounds like you're in a similar early situation at worst, but statistically speaking, it's more likely b9. Best of luck and hang in there!",
      "MessageIndex": 1,
      "PostDate": "21/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817172",
      "Title": "Excision biopsy skrae75 AZ85048"
    },
    {
      "AuthorID": "katiedaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194608/profile",
      "Content": "katiedaw wrote: I'm very new to this all and I'm having a very hard time coping with the waiting and I was hoping someone could offer some advice. I'm 31 and was breastfeeding my 2 year old son until recently. About two months ago I found a lump in my right breast. I went to my ob/gyn first because my husband and I had just started trying to conceive and she said she seriously doubted it was cancer but she sent me for an ultrasound just in case. The radiologist thought it was supsicious enough to biopsy, which got me extremely worried. But during the biopsy the Dr. stopped at only 3 samples instead of the 5 she was intending because the mass decreased in size and changed orientation, so she was pretty convinced it was a blocked duct. So I thought I was in the clear but then two days later I got a call saying it was a radial scar and I had to have it removed because it could become cancer. From the beginning, no one seemed willing or able to answer my questions. All they would say is don't worry, it would be very rare for this to contain cancer cells but it needs to come out. I had to result to researching on my own and it seems like it's not that rare for these things to contain malignant cells. I now have a surgeon and am scheduled for surgery next Friday, but I had to wean my son in preparation for the surgery. Ever since weaning, the lump has almost doubled in size. When I called my surgeon to ask why this might be, she completely blew me off again and when I asked if the pathology results could be wrong, she almost got angry and said their pathology department \"wrote the book on pathology\" and they couldn't be wrong (I'm going to a very large hospital in Manhattan so that may be the case, but still.) I just don't see how they could be so sure with only 3 samples. Now I'm convinced that I either have cancer or they're going to do surgery on a blocked duct. I have so many questions and no one to answer them. What if it is cancer? Since the malignant cells would be \"hiding\" in the radial scar, does that mean it's stage one? If I need radiation or chemo, what will that do to my fertility? And the list goes on... My instinct is to find a new surgeon but I can't deal with any more waiting. I feel like I'm going crazy. How does anyone cope with the stress? Do I have a real reason to be worried or am I just blowing everything out of proportion like my surgeon seems to think? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/816762",
      "Title": "radial scar and very confused katiedaw KTGR"
    }
  ]
}