{
  "AuthorID": "katoMato",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
  "Posts": [
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "Oct 20, 2007 11:42AM katoMato wrote: Thank you Lynn and AlwaysHope, That's good info - both times....(btw Always, that's my favorite verse. Especially the very next sentence.)  Thanks again ",
      "MessageIndex": 3,
      "PostDate": "20/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/694077",
      "Title": "Chosing a Rads Dr. katoMato AlwaysHope"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "Sep 18, 2009 01:35PM katoMato wrote: Hi there, Ladies, I only had a lumpectomy, but I had to respond when I got to the posts that spoke about  \"pain\" during intercourse. I have been there, lived there, and still visit there! There is a thread on this board (or there was a year or so ago) called \"I want my MOJO back!\" It was filled with personal experiences and ideas to try for various situations we - as survivors - encounter.  It was amusing, and very encouraging. The most important thing that i was able to take away from it was that there exists a product called \"Replens\". It appears that during normal and chemo induced menopause one result of the dropping (dropped?!) estrogen level is vaginal dryness. Add some estrogen blockers or AI's and you have the DESIRED effect of NO estrogen. Desireable for BC if your tumor was ER+, but MISERABLE for sex.  I could give you graphic descriptions, but suffice it to say that KY jelly or other \"external, topical\" agents did not help. AT ALL.  Replens is a \"vaginal moisturizer\" that is inserted deep inside the vaginal canal with a tube much the same as treatment for yeast infections, etc. You can use it right before sex, or it says you can use it up to a day or so prior to that. My GYN suggested that I use it twice a week if for no other reason than it keeps things a little more comfortable down there. I still use it about a half hour prior to making love, and it works. Without it, there would be no sex. I would not be able to, period. (I know, I need to send the inventor roses or something, from the two of us!) So if, because of the specifics of your dx you are not able to use hormone based vaginal products, you can get this little God-send from Walgreens, and most other pharmacys, and I've seen it in more than a few grocery stores. We've been married for 30 years as of next week. The sex isn't quite as \"spontaneous\" as it was back in the day, but  then, neither of us are either! It's just as fun to plan...and at least it's still POSSIBLE.",
      "MessageIndex": 16,
      "PostDate": "18/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/740559",
      "Title": "I need help in the bedroom - any advice? Asterix1234 TaminMo"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "katoMato wrote: Anyone have any idea how to choose an oncological radiologist? There are several in my area to choose from - do you go to the \"State of the Art\" equipment? or the Dr themselves? or WHAT? One place boasts that it has the best equipment known to man - that THIS is the machine that everyone else would have if they could. But what about the guy running it...doesn't that matter? Any input would be great. I need to make this decision in a week. Thanks!  Kaye Dx 3/27/2007, IDC, 1cm, Stage IIA, Grade 2, 2/14 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/694077",
      "Title": "Chosing a Rads Dr. katoMato AlwaysHope"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "Aug 26, 2007 08:11AM katoMato wrote:",
      "MessageIndex": 3,
      "PostDate": "26/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/684175",
      "Title": "how to tie scarfs? kidsmom l82jem"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "Oct 10, 2008 12:10PM katoMato wrote: Hi Cristl...big hug to you, my new sister. We've all (well, most of us) been in the same boat - unexpected diagnosis, fear, depression...so take courage in that you're not alone. First of all, a later side effect of ANY surgery can be depression...so that might be making this whole thing more difficult for you. (Not that it's ever EASY...) Secondly, the improvements in treatments due to research and technology in just the last 10 years has been exponentially better. They know SO MUCH MORE now than they did back, even 10 years ago, on how to treat nausea, and any other SE's you might encounter. Thirdly, I note that you are in Houston...are you receiving treatment at MD Anderson? If not, I would use them for a second opinion. My personal experience is this: ALWAYS GO TO A CANCER RESEARCH HOSPITAL IF POSSIBLE. If you are already there, take comfort in that you are at one of the best facilities in the nation, with the most cutting edge technology and support around.  This board is the place to be...there are women here who have gone through what you've gone through, and they're here still - just to support people like you.There is an amazing wealth of information and support here...better than just one doctor BY FAR. You're in the worst part of this \"journey\" right now - the beginning, when everything is new and scary. It gets better. You'll see. If you do have chemo, my suggestion is to read the chemo threads of others who have gone on before you so that you'll know what to expect, and then find or start one for others to join with you so that you'll be going through it together. I was surprised how \"doable\" it all was. Trust God, select your doctors well, then trust them and post often. We care.",
      "MessageIndex": 4,
      "PostDate": "10/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722566",
      "Title": "Chemo is scaring me so badly. Please help me. Mocity nanclee"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "katoMato wrote: Hi, when they put the IV into my forearm for the infusions, the site was fine for a week then became red. It developed little tiny blisters, and became itchy. Neosporin oint does nothing. Onc nurse says to \"watch it\". Anybody have that happen? Kaye Dx 3/27/2007, IDC, 1cm, Stage IIA, Grade 2, 2/14 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/691084",
      "Title": "Red at Infusion Site one week later??? katoMato l82jem"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "Nov 20, 2007 10:12PM katoMato wrote: Hi Mikim - Welcome aboard. I just completed Taxotere/Cytoxan x4 (every 3 weeks) on October 3rd. All in all it was alright. Very \"doable\".  Keeping in mind that everyone is different, my side effects went through a pattern that I could predict pretty much according to how many days \"out\" I was from treatment. For example, The day before, the day of and the day after I was a little hyper from the Decadron (steriod) I had to take. Difficult to get a good night sleep during that period, but boy was my house clean! Days 3 - 5 were uncomfortable, in that I had cold symptoms, bloating, constipation, and a sometimes a headache. For each of those you can take over the counter things and just be patient because they eventually go away, and then I had two good weeks of normal before I went to go do it all over again....drink LOTS of water. My onc said 3 litres a day. Flush that stuff out of you! It's best to not have it sitting in your bladder. The effects were cumulative, in that #2 seemed a little worse than #1 and so on. Oddly however, #4 seemed the easiest. Can't explain that except that my husband prayed specifically that #4 would be easiest. I never was really nauseated. Taxotere is much easier than Adriamycin in that regard. Do not fear - you'll be fine and you'll be done before you know it. Learn as much as you can - this is the best site ever -, and find or start a Chemo-sister group here that you can go through this with. I did (\"Anyone starting chemo in August 07?\") after reading the threads of women who did that before me - going back to 2005! It was a life/sanity saver. I've probably given you too much information - sorry. You'll do fine. I'll be watching for you! ",
      "MessageIndex": 2,
      "PostDate": "20/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/695768",
      "Title": "TC Chemo coming up-please share with me mikim auntienance"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "Sep 3, 2007 02:04PM katoMato wrote:",
      "MessageIndex": 40,
      "PostDate": "03/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/678463",
      "Title": "Starting Chemo in September?? where are you ladies Methusala StillKicking"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "Jan 22, 2008 11:28AM katoMato wrote: Thanks Tender, Anything is possible, of course, but prior to my first T/C, I felt those same tingly things in my sternum, moving up to my clavicle. After my first tx on days 3 & 4 I felt in the same areas as though someone was holding a sparkler inside me, (kind of like those \"pop rocks\" candy that kids eat) at that point, then it went away after a day or two. When I mentioned it to my onc, she said she thought it was indigestion or heartburn from the steriod (no.) and to wait and see what the 2nd tx did.  I noticed the same \"pop rocks\" feeling, in the same area, but much less pronounced with the 2nd tx, and then nothing at all for tx 3 and 4.  It completely disappeared until after rads was over (Dec 14, 07) and now I'm feeling the first feeling again. Not the \"pop rocks\", just tingly, sharp, tiny pricks, except now it's around my collar bone.  I realize I sound like a nut case, (no. I am a nut case.) but I can't help being suspicious. I think if someone had mets to that area they would be able to say; yes, I felt that too. Or, nope. I never felt anything. Arrgh.  Thanks for the response. I HOPE it's temporary esophogitis. (I had thrush after tx #4, but I think it's completely gone away.) I have an appt. at the end of this month to see my onc, so I think I'll ask her then. You are wonderful! Thanks! ",
      "MessageIndex": 2,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698968",
      "Title": "supraclavicular? katoMato badboob67"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "Nov 13, 2007 12:01PM - edited Nov 13, 2007 12:03PM by katoMato Diane, Yes. I have felt like that often – especially this last year. There is good news. It’s never our faith that keeps us going…we are mortal. We stumble, fall and rebel. It’s His faithfulness that supports us. When we can feel it and when we can’t. Trust His faithfulness and listen to what Jesus says: I am the way, the truth and the life. No one comes to the Father but by me. Anyone who comes to me I will not cast out. In this world we will have tribulation, but be of good cheer, I have overcome the world. And other writers have said about him: Not by works of righteousness that we have done, but according to His Mercy, He saved us. He shall feed his flock like a shepherd. He shall gather the lambs in his arm and carry them in his bosom, and shall gently lead those that are with young.   He loves you, and he wants you to love him too.",
      "MessageIndex": 32,
      "PostDate": "13/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/694218",
      "Title": "Has anyone lost their faith? Bendcoles arnica"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "Jun 12, 2008 12:54PM katoMato wrote: Zarowny9 - I'm so sorry to hear what you're going through. If you don't mind me asking, how did you find out you had mets to the supraclavicular? Did you feel it, or was it diagnosed by an onc or show up in a scan? If you felt it, what did it feel like? Sorry to ask what might be irritating questions - but i've had some concerns of my own... Thanks. ",
      "MessageIndex": 232,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702338",
      "Title": "Ladies Please Help Me,I feel Like it's crunch time.. zarowny9 Trevorrolph"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "katoMato wrote: Has anyone been dx'd with mets to the collar bone area? What did it feel like (if anything?) I\"ve done T/C (finished Oct.3 07), Finished 33 rads 12/14/07 now on Arimidex...and I'm feeling strange tingly sharp pokey things around my neckbone and asophogus. (Pretty sure \"strange, tingly, sharp, pokey\" is the medical definition for it! Trying not to think it's anything. But I'd like to know... Thanks.  Kaye Dx 3/27/2007, IDC, 1cm, Stage IIA, Grade 2, 2/14 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698968",
      "Title": "supraclavicular? katoMato badboob67"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "Jan 22, 2008 07:56PM katoMato wrote: Thanks! So far this is sounding like good news!",
      "MessageIndex": 4,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698968",
      "Title": "supraclavicular? katoMato badboob67"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "Nov 30, 2007 12:03AM katoMato wrote: http://www.karinstack.com/images/hair/HS_grid.jpg To my understanding, karin stack is a photographer who had bc, and when her hair started growing back she documented it by weekly photos. Have fun with it!",
      "MessageIndex": 9,
      "PostDate": "30/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696089",
      "Title": "When does the hair come back??? SisterSuewith2 Ggma"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "Oct 17, 2008 06:13PM katoMato wrote: Just for the record - I had some pretty good headaches with my chemo. I wasn't on AC, it was Taxotere/Cytoxin, but they were headaches, and they were from chemo.",
      "MessageIndex": 6,
      "PostDate": "17/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722834",
      "Title": "headaches mybeautifulsister wishiwere"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "Dec 22, 2007 02:22AM - edited Dec 22, 2007 02:24AM by katoMato Hi everyone, I was wandering around and ended up here, and realized that I just had to throw my two cents in about the cough. No one mentioned it to me, i developed it just PRIOR to rads - but the rads definately exacerbated it. The Rad onc and techs insisted that rads weren't to blame, and maybe it is a coincidence, but it existed nonetheless. The GOOD NEWS is that it IS going away (slowly). I'm a week post last rad and don't cough nearly as much anymore. It's definately going away. Did a little research and found that Taxotere can have a cough as a cumulative effect. So we may never know. Have a good Christmas! ",
      "MessageIndex": 25,
      "PostDate": "22/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/697061",
      "Title": "Anyone starting Rads in January? Barbie7 Miss_Lolli"
    },
    {
      "AuthorID": "katoMato",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53778/profile",
      "Content": "Sep 21, 2007 07:31PM katoMato wrote: Pixie's Husband, Yes - My husband and I will be praying. For the wbc to come up, for the antibiotics to work...for the doctors and nurses to have the wisdom they need, and for her to completely heal. And peace for both of you. She is precious to us, too. Thank you for letting us know...please keep us posted on her progress. If she's at Sloan Kettering, she's in very capable hands. One less thing to worry about.",
      "MessageIndex": 11,
      "PostDate": "21/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692481",
      "Title": "Pixie's Husband Here. I Need Your Prayers. PixieDust wackyjackie"
    }
  ]
}