{
  "AuthorID": "katonine",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98325/profile",
  "Posts": [
    {
      "AuthorID": "katonine",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98325/profile",
      "Content": "Mar 1, 2011 10:50PM katonine wrote: also in this group. Dx'd with Hodgkin's 17 yrs ago, DX'd with BC 2 years ago. i opted for bilateral. had DCIS only on left breast but was told the risk of recurrence was high, between 30 and 50% over next 15 years because i had mantle rads for HL when i was 25 yrs old. did breast recon, with implants. a very difficult experience for me. got implants 3 mos ago and still in a lot of pain. I am told that everyone is different and there is no way to predict whether breast recon will be a succes for women who had mantle rads. I would be very interested in learning what the success rate is of breast recon with implants is on Hogkin's survivors. if you have any questions, feel free to PM me. hope all goes well for you and good luck in making decisions.",
      "MessageIndex": 3,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "katonine",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98325/profile",
      "Content": "Mar 5, 2011 12:21PM katonine wrote: Kadyann,  i just read your post and I just wanted to reach out to you and let you know that you are not alone. i know how you feel,..well, not exactly, but dont ever feel like you did anything to deserve this. i know what u mean, why me? again? i am sorry, you have had a very hard time. i was surprised when i read your post that u found BC after mastectomy? i did not even know that was possible..?... i had BL Mx after DCIS in one breast. so i guess it sounds like we are still supposed to be checking for lumps? i am new to all this, secondary cancers and yes, i am scared now. i was like you, never thought Hodgkins or BC would kill me but i am having a horrible time with my implants and i feel like i dont even know if i will make it . i just want them out but the Drs wont let me take them out yet cause too early and i am not strong enough yet for another surgery (have had so many in past 2 yrs). i also had a PS who just didn't hear me,...and i am now trying to find a new one . i am really tired as i write this, and in a lot of pain but i just wanted to tell u that u r not alone, and u didnt do anything to deserve this. for some reason we were picked for this journey of cancers, i really believe there is a reason for all this, and dont worry about having a bad day, i am the same today. can barely type and am so sick of the pain . and you have gone thru it twice now, the BC. you are very strong for even being able to post here. i didnt even have the courage to post on here til a few wks ago. and still can't post too often. how long ago did u finish chemo? and, what is pfc?  hope u r feeling better tomorrow. when i am having a bad day i just give in to it. no point trying to fight it. and then the next day is usually better .",
      "MessageIndex": 11,
      "PostDate": "05/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "katonine",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98325/profile",
      "Content": "Jul 8, 2011 08:50AM katonine wrote: Hi Livsmom, thanks for posting, sorry you have to join us but at the same time it was nice for me to read your post because I totally relate - I have had panic attacks since Hodgkin's!  I worry, worry, then anxiety turns to panic attack. the breast cancer diagnosis just made that worse. I am trying to deal with them through meditation - I just started a course so I am hoping that will help Please keep in touch. and I hope there won't be any more cancer scares for you. I think we have paid our dues! ",
      "MessageIndex": 26,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    }
  ]
}