{
  "AuthorID": "katsie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98750/profile",
  "Posts": [
    {
      "AuthorID": "katsie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98750/profile",
      "Content": "katsie wrote: I chose a bilateral during my 2nd diagnosis for BC. I thought it would stop the cancer from returning. I was wrong. Anyway, I would go without a bra, but the scar is so clearly shown under a t-shirt and a bathing suit, that I won't do it. I also noticed if I don't wear my prosthetics, I tend to hunch. I had big honkers, and the weight was forcing me to stand straight. I hate bras. They all hit right on my scar. I just struggle wearing them, and haven't the courage to go without. I don't go out without my wig, or painting on my eyebrows (3rd BC now at 63), because people really stare, and I think they pity me, and/or are afraid of me, like it's catchy. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/848626",
      "Title": "Bilateral mastectomy at 56, no implants, but... katsie katsie"
    },
    {
      "AuthorID": "katsie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98750/profile",
      "Content": "May 27, 2015 07:20PM katsie wrote: I'm so frustrated with the swimsuits available for us who have had a mastectomy, without reconstruction! I've purchased two, last year. Both are high neck, which works well for me, because my scar is high, in my opinion, and bumpy. Anyway, I wore them both, with lightweight as well as weighted inserts. When I get out of the water, the suits sag so badly, that my prosthetics almost sit on my waist! I've been looking for a new suit, but the tanks are too low, and not one has adjustable straps, which I think we need. I haven't had the courage to go flat, and even if I decided to do so, the scar is high, across my chest, and bumpy and hollow in places, and when I bend down (to pick up my granddaughters at the pool), the suits always pull away from my chest, exposing the ugly scar. I've been to every site possible, on the net. I've tried on so many bathing suits, that I have about given up on finding one that will work well for me. I wish manufacturers would cut them high, and put real support for the prosthetics in the cup area, as well as make the straps sturdy and adjustable! I have one suit, that I bought 15 years ago, before my surgery, but it's the only well-made, supportive suit that I have, and they're not making it any longer. I have been able to use a sports bra, that I modified to accommodate my inserts, underneath this suit. The problem is that none of the suits currently available are cut high enough! I've just about worn it out with swimming at the pool, and the lake. If anybody can offer a link to a nice supportive high-cut suit, please give me a link! I wear a size 16 misses, and most sites that I've checked here, consider a 14 an XL. :(.",
      "MessageIndex": 6,
      "PostDate": "27/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/832084",
      "Title": "Swim suits for women who go flat? Mommy2Six glennie19"
    },
    {
      "AuthorID": "katsie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98750/profile",
      "Content": "Mar 11, 2010 11:19PM - edited Mar 11, 2010 11:25PM by katsie Hi!  I am new here, and wanted to let you all know that it is wonderful to see everybody loving who they are! I had a bilateral mastectomy in November, 2008, and chemo for four months thereafter.  I am on a hormone to counteract the hormone imbalance that caused this tumor.  I had a lumpectomy 15 years ago, differenty type of tumor, and now sturggle with fibro, Sjogren's, CML, and a lot of other weird syndrome's BUT, I have never, ever given up. I was fairly large breasted, and overweight too.  You girls are right, I hope I am not offending anybody, but big boobs are not fun.  I looked really old, not that I am that young, but my figure looked really strange to me with those huge sagging things. I did not have reconstruction, but people kept saying I should have.  The truth is, I like not having to lug those things around anymore.  My friends think I am crazy, but I can lay on my stomach now, and roll on my side while sleeping, and not wake up because I moved the wrong way, and hurt myself.   I would never tell anybody what to do, never, but after reading your posts, I know my decision was the right one for me. I am 57 years old, married for a long time, and 'they' were just not that important to me, to put myself through it. I never wear my bra at home.  I hate those foobies ;), and since I do not work anymore, who cares!  It is very freeing :))). Oh, when I ordered my foobies, I ordered small ones, for the very reasons I stated.  I wanted to look the way I used to look when I was younger, and these little foobies, when I have to wear them, look just fine.  There is life after...and it's good :)))  P.S.  One quick bit of advice, put your foobies and bra in a drawer when you take them off.  I left mine in the bra, and left the bra on my bed.  My grandson, 3 years old, came to visit, last week, and walked into the livingroom wearing my bra-foobies on his head!!! hehe,...He looked like a little mouse :))).  Thankfully, it was only family, but we laughed our heads off!!! :))",
      "MessageIndex": 300,
      "PostDate": "11/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/737036",
      "Title": "Wardrobe pics for boobless days mom2two ShadePink"
    },
    {
      "AuthorID": "katsie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98750/profile",
      "Content": "katsie wrote: I chose a bilateral during my 2nd diagnosis for BC. I thought it would stop the cancer from returning. I was wrong. Anyway, I would go without a bra, but the scar is so clearly shown under a t-shirt and a bathing suit, that I won't do it. I also noticed if I don't wear my prosthetics, I tend to hunch. I had big honkers, and the weight was forcing me to stand straight. I hate bras. They all hit right on my scar. I just struggle wearing them, and haven't the courage to go without. I don't go out without my wig, or painting on my eyebrows (3rd BC now at 63), because people really stare, and I think they pity me, and/or are afraid of me, like it's catchy. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/848627",
      "Title": "Bilateral mastectomy at 56, no implants, but... katsie ravzari"
    }
  ]
}