{
  "AuthorID": "katt88",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248109/profile",
  "Posts": [
    {
      "AuthorID": "katt88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248109/profile",
      "Content": "Mar 6, 2017 07:31PM katt88 wrote: Thank you all for the reassurance! I know it's probably nothing (deep down inside) but I am still a bit anxious about it. Will definitely keep it to myself for now, mustlovepoodles is right once I mention it I can't take it back, and I live in a small town where gossip is a sport lol.",
      "MessageIndex": 4,
      "PostDate": "06/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853236",
      "Title": "Sure it's nothing buuut... katt88 katt88"
    },
    {
      "AuthorID": "katt88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248109/profile",
      "Content": "katt88 wrote: So a little over two months ago I got a sharp pain in my axillary area and there was a lump the size of a pea. I didn't think anything of it, it was sore and I had heard that if it hurt it wasn't cancer... Also, I'm 29 with no familial history so I wasn't really worried. I waited two weeks and it didn't go away although it didn't really hurt anymore. I decided to bring it up to my GP and she felt it and kinda brushed it off probably a node inflamed from infection, told me to keep an eye on it and see if it went away, call again in two weeks if no improvement. Two weeks go by and now the \"node\" feels a bit larger (not rock hard it's firm and underarm is a bit full) so we get blood tests. They are stellar, I'm telling you, healthy as a freaking horse. Ok continue to monitor. The two month mark comes up, \"node\" still palpable. (I guess I should've mentioned that I've been having some pain and odd sensation off and on in the breast on that side and between my shoulder blades and collarbone - I kinda think it hurts because I'm thinking about it). Anyway, back to GP and now she starts asking about family history of BC... decides it's time for US (scheduled for Thursday). Sorry to ramble but I'm kinda freaking out and don't really want to tell anyone because I'm sure its nothing. Shouldn't freak out yet right? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853236",
      "Title": "Sure it's nothing buuut... katt88 katt88"
    },
    {
      "AuthorID": "katt88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248109/profile",
      "Content": "Mar 7, 2017 08:57AM katt88 wrote: Thanks djmammo! I really am feeling much better about the situation :) you guys have been a great help in the freaking out department",
      "MessageIndex": 7,
      "PostDate": "07/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853236",
      "Title": "Sure it's nothing buuut... katt88 katt88"
    }
  ]
}