{
  "AuthorID": "kayakmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266230/profile",
  "Posts": [
    {
      "AuthorID": "kayakmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266230/profile",
      "Content": "Feb 10, 2018 03:19PM kayakmom wrote: I haven't said much. I have good days and less good days. Still skiing almost every day. Have had the usual side effects - constipation , diarrhea, nausea, fecal impaction ( every cycle). I have been on anti virals for mouth sores and Cipro for a persistent UTI. I am terrible at talking to the Triage nurse. Called about 3 different side effects and each time have gotten an unsatisfactory answer . So I have either just contacted nurse son for his insight or this last time I called my urologist ( Triage nurse told me to eat anti oxidants and drink water and talk to the onc in a week - I thought that was terrible advice . I had told her I thought I had a UTI )... Trying to stay positive but I am not doing great at it because I'm getting run down with all the co-infections. I did complain to beloved daughter in law. I said, I was done with the side effects. \" She replied, \"You are done when you are dead\" . I love that girl. ..she doesn't let me get away with my crap.  Genetics test finally set for Wednesday. Last chemo Tuesday.  Sheila",
      "MessageIndex": 345,
      "PostDate": "10/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860443",
      "Title": "Chemo starting December 2017 Swewing Hariry"
    },
    {
      "AuthorID": "kayakmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266230/profile",
      "Content": "Jan 18, 2018 02:50PM kayakmom wrote: I have been lurking on these boards since I was diagnosed in October. I appreciate everyone's wisdom. The tips and tricks have helped me manage the side effects of surgery and chemo. So far I have been very fortunate. I have only had minimal side effects. Some muscle aches, mouth issues ( but not full on open sores ) and constipation ( impaction both times - but I was quicker to recognize the symptoms on round 2 so it was an easier fix). I have cold induced asthma so not surprisingly I ended bronchitis after round 2 but good meds fixed that quickly. The last two winters I have worked as a paid ski patroller. This year I'm volunteering so that I can manage energy better. The National Ski Patrol interviewed me on patrolling while undergoing cancer treatment but I am blocked from posting the You Tube link on this site.  Sheila",
      "MessageIndex": 269,
      "PostDate": "18/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860443",
      "Title": "Chemo starting December 2017 Swewing Hariry"
    },
    {
      "AuthorID": "kayakmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266230/profile",
      "Content": "Jan 21, 2018 03:16AM kayakmom wrote: I was at Ski Patrol school today. Came in for lunch absolutely exhausted after a morning of working on skiing and sled skills. Took off my helmet, parka and mittens. I got in line for the ladies bathroom wearing my black nylon skullcap and purple shirt with flowers on the sleeves. The woman in line in front of me kept staring at me. She was actually one of the trainers and I thought maybe she recognized me from when I was in her group a couple years ago. But no. She spoke to me in a very concerned voice ( like I was a small child) and said, \" Don't you belong in the men's room\". I lost it. I ripped off my skullcap and said, \" I'm sorry if I offend you. I'm bald. I have cancer. But I am female. I still have my boobs - for which I feel very thankful. But since I am clearly offensive I will go on down to the basement bathroom\" Breast cancer or not - who in today's culture would even question what bathroom someone uses. Apparently she did feel fairly mortified by what she said ( another woman told me) but I still feel really uncomfortable - partly because I stooped to rudeness also. ...and I have decide whether to avoid her tomorrow at day 2 of the clinic or apologize for my rudeness too... Who knew. Second time it has happened. Had a police officer call me sir the other day too....guess I have to get over being sensitive.  Sheila  ",
      "MessageIndex": 280,
      "PostDate": "21/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860443",
      "Title": "Chemo starting December 2017 Swewing Hariry"
    },
    {
      "AuthorID": "kayakmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266230/profile",
      "Content": "Jan 20, 2018 01:48AM kayakmom wrote: Char 105 Yes. I am meant to have radiation after chemo. I'm hoping to set an appointment for a consult really soon . I am going to try to fly out to Colorado between chemo and rads to hang out with 2 of my sons, my DIL and my future DIL. They moved out there this fall and I miss them terribly.  If I feel well enough I will ski. Otherwise, I will go to the library, coffee shop, take hot baths, eat good food and let my DIL'S spoil me.  Sheila",
      "MessageIndex": 275,
      "PostDate": "20/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860443",
      "Title": "Chemo starting December 2017 Swewing Hariry"
    },
    {
      "AuthorID": "kayakmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266230/profile",
      "Content": "Jan 19, 2018 12:33PM kayakmom wrote: Hariry, Choosing TC was probably the hardest decision of my life and I still feel like I'm getting \"chemo lite\" and am only playing at having cancer instead of having real cancer that is treated with hard core drugs. I went to 3 different oncologists for opinions. All recommended TC including the onc we saw for a second opinion at Hopkins who actually practices at a regional hospital near me. He is the one we are now seeing. He said he almost always prescribes ATC for triple negative but he felt in my case the risk of CHF or lesser forms of heart damage with Adriamycin was too great. He was concerned about my quality of life if I sustained heart damage since I am so active all the time. In the end he left the choice up to us. I felt like it was an impossible choice. I hope and pray we made the right one. . Sheila",
      "MessageIndex": 271,
      "PostDate": "19/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860443",
      "Title": "Chemo starting December 2017 Swewing Hariry"
    }
  ]
}