{
  "AuthorID": "kayan1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83488/profile",
  "Posts": [
    {
      "AuthorID": "kayan1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83488/profile",
      "Content": "May 8, 2009 09:52PM kayan1 wrote: Thanks WorriedMom98.  I just read your story and I wish you benign results next week.  I tried to focused on being in the 80% benign biopsy rate as I endured each examination and waited for results.  I truly appreciated the thoroughness of each of the doctors I encountered, especially the surgeon.  And you're right, the mass was definitely a mystery to me as I couldn't quite align it with anything I saw online prior to diagnosis.  It's easier to find info online now that I know what I'm looking for.  So there's hope there too.",
      "MessageIndex": 2,
      "PostDate": "08/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733868",
      "Title": "Results: Stromal Fibrosis kayan1 artsci1"
    },
    {
      "AuthorID": "kayan1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83488/profile",
      "Content": "kayan1 wrote: Hi All, I have been leaning on the kind words offered by the women on this site for the past month as I went through test after test.  I just wanted to share my story and results because it was so helpful reading similar experiences.   I'm 32, no children or history of BC in my family.  I found a large palpable lump (3cm) in my right breast last March.  I thought the lump was due to monthly hormonal changes but after my cycle came and went and the lump remained I saw my OB/GYN.  He thought it was a cyst and ordered a mammo and ultrasound.  The radiologist said it was definitely not a cyst but he had no idea what it was due to the density of my breast.  He couldnt see a thing on the mammo but saw the large, shaded irregular shape on the ultrasound.  He told me to see a surgeon and get it biopsied immediately.  The surgeon thought it was a fibroadenoma due to my age and possibly ethnicity (african-americans have a higher occurence) but the core biopsy showed otherwise. The ultrasound core biopsy (nerve-wracking but not horrible) was successfully performed and revealed Benign Fibrosis results but the radiologist was still concerned due to the palpability so she strongly urged a breast MRI.  The breast MRI was the most dreadful because I hate confined spaces and I did not understand why I had to go through this when the pathology revealed b9. Finally, today I met with the surgeon who went over the results and the MRI confirmed the results of the core biopsy diagnosis: Benign Breast Tissue with Nodular Stromal Fibrosis.  Surgeon said I have fibrocystic breast disease and I should be extra vigilant about monitoring for changes.  MRI also revealed a little stromal fibrosis in the left breast too that I do not feel.  I have a followup in 3 months and a repeat MRI in 6 mos to make sure there are no changes.  Just wanted to share and maybe this will bring hope to someone else with similar symptoms who like me, never even heard of stromal fibrosis.  It's basically extra dense connective tissue and is not pre-cancerous.  Hope this helps! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733868",
      "Title": "Results: Stromal Fibrosis kayan1 artsci1"
    }
  ]
}