{
  "AuthorID": "kaycee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
  "Posts": [
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jun 24, 2010 04:49PM kaycee wrote: Have you tried eBay for pre-tied scarves? I bought one from a seller called English Traditions, it was well made and cute. Also I had neglected to tell her till the last minute that I have a George Lopez-sized head, and she rushed to sew me a custom larger size. I think this was around $12 w/free shipping -- pretty good price and it has some dimension around the face. There are a few other sellers with similar products on eBay, too, but I haven't tried them yet. I was so happy with my purchase from this lady that I'm going to buy more.",
      "MessageIndex": 602,
      "PostDate": "24/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jul 10, 2010 11:47AM kaycee wrote: For CEBsMom: I don't blame you for being scared, but try not to panic and do not google Triple Negative  BC. A lot of the information out there is terrifying but out of date. Also, the error could as easily have been by the oncotype test as by your original pathologist, so you may not be triple negative. I am triple negative and am on the exact same chemo regime as you. I notice we are both Stage 1, so perhaps this would have been your course of treatment anyway?  Can you reach your onc on weekends? I think something this unsettling justifies a weekend call.  Hugs, Kaycee",
      "MessageIndex": 986,
      "PostDate": "10/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jul 10, 2010 12:01PM kaycee wrote: DesignerMom: Try the \"Report This Post\" link on any post on the thread. It \"should\" give you an area for explanation, and you can ask your question about contact info there.  ",
      "MessageIndex": 988,
      "PostDate": "10/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jul 17, 2010 02:10PM kaycee wrote: DesignerMom:  I have a glutamine fact sheet/treatment schedule I got from my Onc. You start the glutamine the day FOLLOWING treatment 3 times a day for 3-5 days. The dosage is 3 teaspoons dissolved in warm water or juice (the stuff clumps in cold liquid).  I scanned in the fact sheet but I can't figure out how to attach it to a post here. If anyone would like a copy, pm me with your email address and I'll send it to you that way.",
      "MessageIndex": 1121,
      "PostDate": "17/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jul 18, 2010 01:49PM kaycee wrote: mimi I sent you a PM with my email address, just in case. If you send me an email I'll send the glutamine sheet back return mail.  DesignerMom, thanks for the tip on the copy as plain text. Unfortunately, I scanned the document as a .jpg so I don't have the option to copy now. I'll get the original out as soon as I get organized (ha!) and try to scan as text so I can just copy it here. It would be easier for everyone for sure. :)",
      "MessageIndex": 1131,
      "PostDate": "18/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Aug 26, 2010 07:29PM kaycee wrote: Goodness ladies, I am so sorry to hear so many of us are having treatment side effects and set-backs.We are all soooooo close and any delay now is just major suckage. As for me, I'm still in the hospital, but the good news is that the doctors have figured out what the problem is. I have a klebsiella infection in my bloodstream, and they now know what antibiotics to prescribe. The bad news is that the source of infection is my PortACath, so I'm having surgery tomorrow to take it out.  Arrgggggghhhhhhh! So frustrating!",
      "MessageIndex": 1963,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jan 25, 2013 11:08AM kaycee wrote: Thanks for the reply, Liz! It's good to hear that you are doing well. I wish I was in Arizona on a golf course with you :) I have good news. The path report came back negative on my new lump. The doctor said that the area is a fat necrosis, which probably formed from radiation damage to the area. I knew nothing about fat necrosis, but learned that it's fairly common for breast cancer patients to develop, and that it strongly resembles malignacy on mammos and ultra sound. If it is so common, I wish that my RO or MO had told me about the possibility during treatment. Maybe I would have freaked out (a little) less when I found the lump.  Thanks again, especially for the prayers. Hugs, Kaycee",
      "MessageIndex": 3961,
      "PostDate": "25/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jun 17, 2010 12:52PM kaycee wrote: Hi Ladies! I'm late to the party, as usual. I will be starting my chemo on 6/25. I'm scheduled for TC 4x at 3 week intervals. I'm a little freaked out about the Taxotere, and plan to discuss Taxol as an alternative when I meet with my onc again on 6/21, so \"maybe\" the schedule will change. I had my port placement Tuesday, and it went well with minimal pain. It's on the left side, and is just a little sore when I reach with my left arm or bend over too quickly. Everyone assures me that it will be worth it as chemo burns up little veins pretty badly.  My wonderful postman delivered a wig yesterday (I've been shopping like mad since I just can't see myself Rocking the Bald), and the seller included this poem that I really loved.  What Cancer Cannot Do Cancer is so limited... It cannot cripple love. It cannot shatter hope. It cannot corrode faith. It cannot eat away peace. It cannot destroy confidence. It cannot kill friendship. It cannot shut out memories. It cannot silence courage. It cannot reduce eternal life. It cannot quench the Spirit. ~~Author Unknown God bless all.",
      "MessageIndex": 413,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jun 23, 2010 07:52PM kaycee wrote: The following is taken from a handout on Glutamine my oncologist gave me, for the ladies that asked about the reason for taking glutamine. Glutamine is the most abundant amino acid in the body. It is found in blood and tissue, and primarily formed and stored in skeletal muscle and lungs. It also serves as an essential nutrient required by the mucosal cells of the colon. It enhances nutrient transport and facilitates the enteral absorption of electrolytes. In one study it appeared to be a simple and useful measure to increast the comfort of patients at high risk of developing mouth sores are a consequence of intensive cancer chemotherapy.  Glutamine has recently showed evidence of helping to relieve some of the side effects associated with the following chemotherapy agents. Camptosar-induced diarrhea Mouth sores associated with intensive chemotherapy regimes High does methotrexate induced bowel irritation and inflammation A healthy person does not require supplemental intake of this aminio acid, but certain diseases and medications as above result in a deficiency.A traditional diet contains less than 10 grams per day. During illness or stress to the body, a need for glutamine can increase to 20-40 grams per day. Supplemental intake of glutamine has been found to be very helpful in preventing or easing these symptoms.  Glutamine comes in a powder form and is mixed with juice or water. Avoid mixing in ice-cold liquids. The recommended dosage is 10 grams three times a day, or: 4 teaspoons three times a day for 3-5 days beginning the day after chemo.  No side effects have been reported with the intake of supplemental glutamine. It is not recommended for patients with severe kidney or liver disease.",
      "MessageIndex": 575,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jun 26, 2010 10:22AM kaycee wrote: I had my first TC treatment yesterday afternoon, and came through it with flying colors. The needle stick in the port was surprisingly the worst part of the process (not that it was that bad). I am still feeling fine this morning, although I am a bit waterlogged from trying to push fluids to get the Cytoxan out. My treatment nurse said she felt that if I were going to have side effects, they probably won't kick in until Monday due to the pre-med steriods. I just want to wish all you lovely ladies a great, side-effect free weekend. I'm so thankful for this group. :)  kaycee",
      "MessageIndex": 660,
      "PostDate": "26/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jul 9, 2010 10:33AM kaycee wrote: I'm joining the Hair Club for Chemo Sistahs this morning.  I keep telling myself \"it's only hair\" but so far it ain't working for me lol.  I gave myself an all-over haircut to about 2\" this morning and it doesn't look bad (in front at least, no way am I looking in a mirror at the back!) I think tomorrow will be the day for the big shearing party.  I hope today finds everyone well and as free from SEs as possible. Have a great weekend, Pink Sistahs!",
      "MessageIndex": 970,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jul 27, 2010 11:00AM kaycee wrote: julia, My hair started coming out in big clumps on Day 14 after my first TC treatment. I'm now on Day 12 after my second treatment, and like you, I look like a baby bird. I'm picking up almost no strays with the lint roller anymore, and I think my remaining hair is actually growing. I still have leg and arm hair, too. Eyebrows and lashes still seem pretty normal.  I have no idea if this is normal or not, just wanted you to know you are not alone.",
      "MessageIndex": 1343,
      "PostDate": "27/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Aug 25, 2010 09:43AM kaycee wrote: Hi ladies,  I've been reading along but not posting much. My \"cellulitis\" infection that started back on July 4th has never resolved, despite 10 days of Keflex, 15 days of Doxicycline, and two weeks of IV antibiotics. I know that inflammatory breast cancer is rare, but I finally talked my onc into ordering a punch biopsy to rule out the possibility. That is supposed to happen Monday. I was also having my last chemo this Friday. I never really got back to normal after the last chemo, then yesterday I spiked a fever that landed me in the hospital. Docs are waiting for results of the blood cultures but the thinking is that my port is infected.Oh joy! I hate hate hate that my last chemo is delayed, and am worried the punch biopsy will be put off too. I had to fight long and hard for that! Please forgive typ0os on my netbook and it's LITTLE!  All of you are in my prayers.",
      "MessageIndex": 1926,
      "PostDate": "25/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jun 22, 2010 12:08PM kaycee wrote: julia2,  You asked about glutamine and I just happen to be looking at a handout given to me by Nurse Ratchet (honestly, the woman had a most unfortunate manner) at my pre-treatment meeting yesterday.  It says that glutamine comes in a powder form and is mixed with juice or water. Avoid mixing in ice-cold liquids. The recommended dosage is 10 grams three times a day, or: 4 teaspons three times a day for 3-5 days beginning the day AFTER chemo.",
      "MessageIndex": 540,
      "PostDate": "22/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jun 25, 2010 10:24AM kaycee wrote: Poppalicious -- I am so glad to hear Chemo #1 went  well for you this a.m.! I am set to go at 1 p.m. today for my first time, and hope I do as well as you. Keep us posted on how you feel later please? Carol913 --  In my case (Stage 1, Grade 2, 0/10 nodes), I knew from reading my pathology report that chemo was most likely in my future because my receptor status is triple negative. That means that my tumor was a fast-growing type that isn't sensitive to estrogen, progestrone or HER2. There are medications that can be given post-radiation to receptor-positive women to help keep their cancer at bay, but chemo/rads is the only option currently for triple negs. If you haven't received a copy of your path report, ask for it. There is good guidance on this website in how to interpet what it means, and it might give you a better understanding of what your choices are likely to be. ",
      "MessageIndex": 633,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Sep 6, 2010 02:20PM kaycee wrote: Greetings to all my June chemo sisters!  I've been MIA and haven't had a chance to catch up on all the posts, but hope that everyone is doing better than when I last checked in. I had been home from the hospital for exactly 3 days following the removal of my infected port when I had my first followup appointment. The previous evening, I had run a low grade temp and was experiencing some shortness of breath, so my infectious disease doc decided a chest xray was in order. He didn't like what he saw and called my onc, who promptly ordered me back to the hospital. This was on Tuesday. I had a CT scan Wedneday to rule out blood clots, then nothing much happened besides being dosed round-the-clock with IV antibiotics. On Friday, the pulmonary doc performed a bronchoscopy to try to determine the source of (sorry, I'm going to use the technical medical term here) \"funky looking inflitrates\" that were in my right lung. They took samples for bacterial infections, fungus, viral infections, TB,  and took a sample for pathology to look for lung cancer cells. After 48 hours, none of my cultures were growing anything, and they decided to release me on yet another broad-spectrum antibiotic. I haven't gotten the results of the pathology test yet, so they can't absolutely rule out lung cancer, but the best guess now is that the \"funky looking infiltrates\" may have been caused by one of my chemotherapy drugs, taxotere. Assuming I don't have lung cancer (please God no!), I will be meeting with my oncologist later this week to determine whether or not she thinks I can tolerate the final chemo treatment I was originally scheduled for. I have really mixed feelings about stopping chemo early. While a part of me would love to be done with the icky, sicky part of chemo, I am triple negative and would really REALLY like to feel I've given myself my best chance at avoiding re-occurence. I am anxious to hear what my oncologist thinks.",
      "MessageIndex": 2101,
      "PostDate": "06/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jul 6, 2010 12:35PM kaycee wrote: To Sherry:  I think the mistake in charting your weight could be very significant, Sherry. I was told at my treatment center that my weight/height would be checked every single treatment, because the exact numbers are critical in compounding the correct dosage for treatment. If indeed the pharmacy compounded your treatment for a 271 lb woman while you weigh half that, you could have been overdosed at your first treatment, and that casts your extreme side effects in another light.   Please check into it further.  About me: My right boobage where I had the lumpectomy has turned red. I should NOT google, as it looks exactly like the pics of inflammatory breast cancer. I called my onc's office last week, and they told me to continue with anit-biotics since I had no fever, and I'm scheduled to go in later today. I'm guessing infection (a stitch that didn't dissolve, a pocket from the lumpectomy?) but it is strange that I have no fever. I'll be glad when I find out what the heck is going on. IBC couldn't just show up overnight, could it?",
      "MessageIndex": 874,
      "PostDate": "06/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Sep 21, 2010 09:01AM - edited Aug 20, 2013 02:47AM by kaycee Hi Carol,  My onc took the same approach as your doc #2 -- no Neulasta shot unless my counts dropped too low.   My counts did indeed drop to low. This led to cellulitis in my lumpectomy breast that wouldn't clear with 3 courses of oral antibiotics. After that, I was referred to an infectious disease specialist, and was started on home IV antibiotics. At some point, I picked up a klebseilla infection in my port (probably from all the extra port accesses neccesitated by the IV antibiotics). I spent 5 nights in the hospital and had to have my port removed/a picc line inserted at that point. Three days later, I was readmitted to the hospital for six days, this time with lung inflitrates. At that point, it was decided that despite my triple negative status, further chemo was too dangerous.   I may be an exception to the usual rule, but I do feel that all my problems likely would have been avoided if only I had been given Neulasta after the first chemo treatment. I did have Neulasta after treatments #2 and #3, and my counts never again dropped dangerously, but at that point, the damage was done. I had the same chemo regime that has been prescribed for you. Just my opinion, but if your insurance will cover Neulasta, I would take the shot. Take Clartin and Advil for 4-5 days, I did and had no bone pain to speak of. Even if I had experienced bone pain, it would have been a heck of a lot better that eleven nights in the hospital, emergency surgery, and all the other testing that went along with it. My .02, Kaycee P.S. Waving to all my June sisters! I am now 6 weeks PFC, and I have sprouts on my head. They aren't very long sprouts, but I was sure happy to see them. I hope many of you are sprouting, too! :-)",
      "MessageIndex": 2327,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jul 11, 2010 12:07PM kaycee wrote: Sherry, I'm so sorry to hear you are feeling badly again. Baby yourself all you can.",
      "MessageIndex": 1004,
      "PostDate": "11/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jul 18, 2010 02:53PM kaycee wrote: Apparently I typed this thing out before, so for those interested, the Glutamine handout text from my oncologist: Glutamine is the most abundant amino acid in the body. It is found in blood and tissue, and primarily formed and stored in skeletal muscle and lungs. It also serves as an essential nutrient required by the mucosal cells of the colon. It enhances nutrient transport and facilitates the enteral absorption of electrolytes. In one study it appeared to be a simple and useful measure to increast the comfort of patients at high risk of developing mouth sores are a consequence of intensive cancer chemotherapy. Glutamine has recently showed evidence of helping to relieve some of the side effects associated with the following chemotherapy agents. Taxotere, Taxol, carboplatin and Cisplatinum induced muscle and joint aches as well as the numbness and tingling in the fingers and toes. Camptosar-induced diarrhea Mouth sores associated with intensive chemotherapy regimes High does methotrexate induced bowel irritation and inflammation A healthy person does not require supplemental intake of this aminio acid, but certain diseases and medications as above result in a deficiency.A traditional diet contains less than 10 grams per day. During illness or stress to the body, a need for glutamine can increase to 20-40 grams per day. Supplemental intake of glutamine has been found to be very helpful in preventing or easing these symptoms. Glutamine comes in a powder form and is mixed with juice or water. Avoid mixing in ice-cold liquids. The recommended dosage is 10 grams three times a day, or: 4 teaspoons three times a day for 3-5 days beginning the day after chemo. No side effects have been reported with the intake of supplemental glutamine. It is not recommended for patients with severe kidney or liver disease.",
      "MessageIndex": 1133,
      "PostDate": "18/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jul 7, 2010 01:42PM kaycee wrote: I had my followup today, and it turns out that my \"red boob\" is cellulitis. My absolute neutrophil count was low (0.1 CL) so my oncologist sent me to the treatment room for IV antibiotics, and I'm now taking Keflex. I'm also under orders to stay home and avoid crowds till Sunday.  I'm relieved it is cellulitis. I had half convinced myself it could be inflammatory breast cancer.",
      "MessageIndex": 909,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Aug 3, 2010 02:10PM - edited Aug 3, 2010 02:11PM by kaycee I noticed a couple of posters were looking for and enable to find glutamine powder locally. Look on eBay -- tons of sellers there, some with free shipping.Search \"glutamine powder\" for a list.  I'm ready for Round #3 of TC this coming Friday. Round 2 wasn't bad, but I did have quite a bit of fatigue. I'm hoping it's no worse this time.",
      "MessageIndex": 1510,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jul 15, 2010 04:03PM kaycee wrote: Greeting to all my pink sisters!  I haven't been very chatty the few days because I picked up a computer virus that was the absolute worst ever. I had to wipe my system. I posted something about it in my Facebook status yesterday after I got back up and running, and immediately got several messages concerned about my health. I appreciate the concern but it's obvious everyone just skims, isn't it? I got a good laugh out of that since I much prefer the puter to have a virus instead of getting one myself. ;) My second TC treatment is scheduled for tomorrow. I'm taking my premed steriods and pushing fluids today. I hope I get the treatment (I want this OVER with!) but I'm a bit worried because the cellulitis in my lumpectomy boob hasn't gone away despite the IV antibiotics and a week of twice daily keflex. I will just show up tomorrow and hope for the best. To whoever posted about the free gailia headwear, THANK YOU! I picked a fabric and submitted a request for my free hat only a few days ago, and the most lovely package showed up today. I like it enough that I think I'll order a couple more. Here's to a good, minimal SE weekend for all of the June ladies. Love you all.",
      "MessageIndex": 1084,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jan 18, 2013 11:33AM kaycee wrote: Hi all, I'm just checking in, in need of a little reassurance. I've been feeling fabulous since treatment ended, and have truly been enjoying each day. All my check-ups have been good up till this point. It may be nothing (crosses fingers) but I found a lump in my \"cancer boob\" a week before Christmas. Called my MO who was on vacation due to the holiday, but saw her nurse practioner the same day. The NP sent me off for an ultra sound at one of those stand-alone radiology centers, and the technician there assured me that the lumpy thing didn't look like malignancy to her, and that I would get a call from my MO's office after the radiologist read the test. A couple weeks passed without a call. I figured no news is good news, and it was after all the holiday season when people were off. My dear husband badgered me until I gave up and called the MO's office again. I spoke with the nurse practioner, who apologized profusely and tracked down my results. The report was as expected, but suggested a mammogram follow-up. I was due anyway, so had my mammo appt. yesterday at St. Luke's. I had a 3D scan (new) which is supposed to give the radiologist a better view. I then had another ultra sound, the radiologist came in and double checked the scan, and decided she needed to do a biopsy. Because I am on a low-dose aspirin regime, I have to get that out of my system, so the biopsy is scheduled for next Tuesday.  I know it could be scar tissue and/or that the St. Luke's radiologist is just much more cautious than the first rad doc, but I have to admit the idea of going around with this again has me spooked. I'll report back if anyone is still around this thread after pathology comes back, probably the end of next week.  I must say, I am so happy that I had to scroll eight pages back to find this thread -- it must be that most of the June 2010 gals are doing well and living and loving life. :) Thanks for listening. Just putting it out there makes me feel better.  Hugs, Kaycee",
      "MessageIndex": 3959,
      "PostDate": "18/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Sep 10, 2010 11:15AM kaycee wrote: Hi Ladies, I saw my oncologist yesterday for a hospital follow-up. She believes I have developed pulmonary toxicity to taxotere (docetaxel) and has decided to stop chemo.  Being triple negative, I'm worried about not being able to complete my treatments (I've had 3 of 4 TCs), but my oncologist says skipping the last treatment will only raise my risk of reoccurence 1-2%. I certainly hope she is right about that figure! I will meet with my oncologist and pulmonologist in 2 weeks to see how my right lung is looking. Apparently my radiation will be put off for as long as it takes to clear my lung infiltrates. Yours, in limbo, Kaycee",
      "MessageIndex": 2194,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Jun 30, 2010 02:00PM kaycee wrote: I have only had one round of TC so far, but I also want to chime in and let you all know that it isn't (at least yet) all that bad for everyone.  I have had absolutely no nausea. I have had some bone pain at night, and it is probably caused by the chemo but I can't be sure, because I've had that type of pain from time to time prior to cancer.  My mouth tastes a little weird and metallic, my tongue is white, and I feel like I need to swallow hard a lot, but other than that, I've been amazed at how good I've been feeling.  I like others was pretty much terrified by the TC thread, so I thought I'd chime in with a upbeat tale.  What I have done to help with side effects: I have pushed fluids for a week -- I'm floating, I'm floating ...... I took Glutamine as directed by my oncologist (4 teaspoons dissolved in warm water 3x a day beginning the day after chemo for 5 days).  I am eating a lot of yogurt and take a probiotic. It seems to be working, no constipation or diarrhea so far! My oncologist doesn't routinely give neulasta. Instead, I took a preventative course of antibiotics from Day 5-11. I am wondering if the neulasta causes a lot of the side effects others have experienced? I get my blood drawn next week and hope that my counts are good so that I don't need the shot.",
      "MessageIndex": 17,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753507",
      "Title": "TC Chemo really not bad so far KGBinDC KGBinDC"
    },
    {
      "AuthorID": "kaycee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102284/profile",
      "Content": "Nov 1, 2010 06:31PM kaycee wrote: My radiation after chemo was pushed back by lung inflitrates that I developed during the chemo. The doctors were unwilling to start radiation till the lung was totally clear, so I asked about timeline and effectiveness. The answer I got from my radiation oncologist was that radiation optimally should start within six months following surgery. ",
      "MessageIndex": 5,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/760029",
      "Title": "How Long Before Treatment jw523 kaycee"
    }
  ]
}