{
  "AuthorID": "kaye45",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65511/profile",
  "Posts": [
    {
      "AuthorID": "kaye45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65511/profile",
      "Content": "Apr 21, 2008 10:14AM kaye45 wrote: Thanks everyone for the support, it really has been a big help to me to read everyone's comments. I had my surgery Friday, I was so scared and shaking so much going into the OR that the surgeon and the OR nurse both held my hands as they put me under. I took a shower today but I did not have the courage to look at the bandage.  The home care nurse will be changing it for the next while. I haven't got to the point where I can face looking at it.  The sentinel nodes were negative and I geuss thats good news but I don't know enough about these things to know. Can anyone help me here? ",
      "MessageIndex": 163,
      "PostDate": "21/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/702931",
      "Title": "Anyone having surgery in April?? ottawagirl wahine"
    },
    {
      "AuthorID": "kaye45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65511/profile",
      "Content": "Apr 17, 2008 08:22PM kaye45 wrote: I'm having a mastectomy tomorrow, scared but holding on please please, people tell me how you deat with waking up with no breast ",
      "MessageIndex": 143,
      "PostDate": "17/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/702931",
      "Title": "Anyone having surgery in April?? ottawagirl wahine"
    },
    {
      "AuthorID": "kaye45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65511/profile",
      "Content": "Apr 4, 2010 10:01AM - edited Apr 4, 2010 10:04AM by kaye45 It sound like the doctor is being abundantly cautious. I had a lump removed some years ago, size of a marble and rock solid so it could not be aspirated. Scary stuff but it turned out to be nothing. Most of these things are so your chances of good news is high. Still had to spend 3 days in hospital with a drain, etc, but pain was pretty minimal. You have all the bases covered as far as help so do what my nurse told me after my mastectomy, \"don't lift anything heavier than the remote control\". You may want to sleep sitting up for a while to reduce local swelling.",
      "MessageIndex": 1,
      "PostDate": "04/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750758",
      "Title": "I'm worried and confused about upcoming surgery. Chancesmom awb"
    },
    {
      "AuthorID": "kaye45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65511/profile",
      "Content": "May 18, 2008 10:54AM kaye45 wrote: Ugh, exactly my feeling canuckintex! I went to the surgeon to hear the pathology report results. He was all happy, no invasive cancer, very good news! you can be very happy, etc. And I thought, yeah but, hate to rain on your parade, I still LOST MY ENTIRE BREAST. I can in quiet moments feel very lucky indeed but please, this is not all good news Doctor when I am feeling disfigured.",
      "MessageIndex": 10,
      "PostDate": "18/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/705660",
      "Title": "The \"BEST\" Kind of Breast Cancer!!! canuckintx Skyrat"
    },
    {
      "AuthorID": "kaye45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65511/profile",
      "Content": "Apr 21, 2008 12:01PM kaye45 wrote: Hi everyone, I survived, it's been 3 days. I was so scared and shaking so much going into surgery, my surgeon held my hand while they gave me the anesthesia. I literally could not look down at myself the first day, today I took a shower but I have not looked at the bandage, never mind change it. A home care nurse is coming over today to do that. My goal this week is to be able to look at the bandage. The good news was that the sentinel nodes were all negative. I hope that means no cancer spread.",
      "MessageIndex": 9,
      "PostDate": "21/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703818",
      "Title": "surgery scheduled for next Friday kaye45 southernchick"
    },
    {
      "AuthorID": "kaye45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65511/profile",
      "Content": "Apr 11, 2008 05:22PM kaye45 wrote: what a remarkable coincidence (!), just a minute ago (as you were praying?) my surgeon called me from the OR when she had a break between cases to talk with me, her confidence and competence is reassuring. She answered some questions I had about the MRI I had earlier which was reassuring. I am desparately scared and feel like a failure just for being so scared.",
      "MessageIndex": 2,
      "PostDate": "11/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703818",
      "Title": "surgery scheduled for next Friday kaye45 southernchick"
    },
    {
      "AuthorID": "kaye45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65511/profile",
      "Content": "Jun 4, 2009 12:57AM kaye45 wrote: 51. \"Now you are a real Amazon!\" (well meaning friend) 52. \"This is all your fault for not getting a mamagram sooner\" (dumbass male relative)",
      "MessageIndex": 42,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735274",
      "Title": "100 things never to say to a woman who has had a mastectomy: iwannabefree jillyG"
    },
    {
      "AuthorID": "kaye45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65511/profile",
      "Content": "kaye45 wrote: I am to have a mastectomy next week and I keep crying, feeling like I am facing a guillotine. I know I will be rid of cancer but I am so scared of waking up with a breat missing - I can't get past this, I have nightmares and keep crying. I feel like I will be a freak. How can I begin to face this? I truly do feel like I'm facing an execution rather than a life saving surgery. Please someone tell me how to cope with this. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703818",
      "Title": "surgery scheduled for next Friday kaye45 southernchick"
    },
    {
      "AuthorID": "kaye45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65511/profile",
      "Content": "Apr 12, 2008 05:23PM kaye45 wrote: Thanks to all who answered me, I am still not coping so well but I am trying to find a way to cope. I am scared about seeing the scar/no breast the first time but also scared the cancer could have spread. That I won't know until 2 weeks.  It is all hard to take in. I will keep checking in here for words of encouragement and read others' stories. Thank you Robin, you are an angel.",
      "MessageIndex": 6,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703818",
      "Title": "surgery scheduled for next Friday kaye45 southernchick"
    },
    {
      "AuthorID": "kaye45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65511/profile",
      "Content": "Jun 27, 2010 05:31PM kaye45 wrote: I had the SNB the day before my mastectomy and all they used was a local anesthetic. It was not the worst thing I've been through in this BC journey - that would be being told I needed a mastectomy rather than a lumpectomy - but it was worth it because they only needed to remove 5 lymph nodes during surgery and that saved me problems with lymphodema later. I focussed on a spot on the ceiling and did deep breathing through the procedure and the time flew by. The anxiety is worse than the pain, honestly.",
      "MessageIndex": 8,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754525",
      "Title": "lots of fear kira1234 kira1234"
    },
    {
      "AuthorID": "kaye45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65511/profile",
      "Content": "kaye45 wrote: I'm 3  weeks 3 days past surgery, no more drains, when can I take a bath? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/705463",
      "Title": "after surgery, when can I take a bath? kaye45 AnnNYC"
    }
  ]
}