{
  "AuthorID": "KayG",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126096/profile",
  "Posts": [
    {
      "AuthorID": "KayG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126096/profile",
      "Content": "Oct 9, 2014 10:37AM KayG wrote: I am in Northern VA suburbs and my plastic surgeon is Roberta Gartside. So far very happy. The top PS in DC is Scott Spear, but he is out on some kind of leave at last check.",
      "MessageIndex": 1,
      "PostDate": "09/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/825256",
      "Title": "Need recommendation for surgeon in DC region SallyU2014 SallyU2014"
    },
    {
      "AuthorID": "KayG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126096/profile",
      "Content": "KayG wrote: Hi all - I've been lurking for a few days, but it is time to chime in because I am making myself a little crazy. Background: My mom and her mom both had BC in their 40s. In fact, i am 46, the exact same age my mom was when she was diagnosed. The doctors watch me carefully - mammos yearly, w. ultrasound and there are always a couple of big cysts they asipirate (but  that always grow back). I went for an MRI two weeks ago because it is time to watch me even more carefully, and the MRI came back with BIRADS 4 spots in both breasts, an 11mm growth in the right and a 6mm one in the left, so I am scheduled for an MRI biopsy tomorrow. Has anyone ever had an MRI biopsy? What should I expect? Also, assuming this comes back B9, both my OB GYN and my surgeon say its a good idea to think about a preventative mastectomy. I am seriously considering it. My mother has been tested and does not have the BRACA gene, but there is clearly a genetic link. Does that seem extreme or smart? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766268",
      "Title": "MRI Biopsy tomorrow KayG Lisa1962"
    }
  ]
}