{
  "AuthorID": "kblack",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140330/profile",
  "Posts": [
    {
      "AuthorID": "kblack",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140330/profile",
      "Content": "Jan 25, 2012 10:53AM kblack wrote: Hi everyone! Rachel - I saw one of your posts and realized we are quite close in location.  I work in New Brunswick and live in Bridgewater.  What a small world! Today is Day 13 for me.  No noticeable hair loss yet.  Trying to make it one more day so I can go to a meeting with my boss tomorrow.  Then after my 2nd round of AC tomorrow afternoon, my husband will shave my head either tomorrow night or Friday morning.  I'm dreading the 2nd round.  I didn't know to try Claritin the first time, so will take that tomorrow in advance of the shot on Friday.  Hoping it helps because I had so much lower back pain after the 1st one. I wanted to ask if anyone has found good options for what to do at the gym in terms of hair loss.  I go to a company sponsored gym and work out around people I work with and don't know what I am going to do once my hair is gone.  I have a wig for work, but I'm just imagining it won't be comfortable or practical to wear to work out.  Does anyone have an option that has worked well for them?  Or maybe I can wear the wig, but will need to wash it more when I sweat in it at the gym? Thanks! Kim",
      "MessageIndex": 742,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "kblack",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140330/profile",
      "Content": "Feb 4, 2012 06:08PM kblack wrote: First, I want to thank you all for the recommendations on Claritan. I had heard a little about it before my 1st treatment but when I asked my oncologist about it, she said she hadn't heard about it. So I didn't try it with my first Neulasta and boy, was I in pain for several days. So I did for my 2nd and either the Claritan or the fact that the 2nd one isn't as bad did the trick. Either way, I am so very greatful for all of your posts. So I had my 2nd AC last Thurs, Jan 26. The first 3 days post treatment were incredibly easier than my first treatment. My husband and I both were relieved and thought that those SE's were actually doable. BUT then Monday came. I went back to work for a full day and was exhausted and feeling awful. Tuesday was worse and I only made it half a day. Wound up in the ER on Tues night/Wed morning with a 102 fever. After tests, they determined my white blood was on the low end of normal and sent me home. On Thurs, with fever still persisting, I had my counts retested and then was admitted to the hospital immediately. Been here since then on antiobiotics. Counts dropped more on Friday. Back up a little today but not enough so I will be here at least 1-2 more nights. Tough with 21 month old twins at home. Our schedule was ridiculous before cancer. Anyway, I don't appear to have any serious infections. So it seems just a bad cold which my whole family got obviously hit me hardest. And the best part is that my oncologist said its unlikely they'll postpone #3 which is coming this Thurs. I don't know what to do about work. I just can't be out this much so I guess I have to consider disability. So anyway, everyone at work is sick-there seems to be something going around. I know you all know already but stay on top of your hand sanitizer and take caution when going out. Although my oncologist says people rarely end up on the hospital like this, It can happen, so take care of yourselves!",
      "MessageIndex": 988,
      "PostDate": "04/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "kblack",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140330/profile",
      "Content": "Feb 6, 2012 09:40AM kblack wrote: Momof2inME - good luck with treatment #3.  I am thinking about you and will be right back on Thursday for mine....if I show up.  I have dreams of just driving right past the hospital and continuing all the way down to Naples where my inlaws have a house.  If only escape were that easy!  And I am kidding about the not showing up part.  Its just nice to dream.",
      "MessageIndex": 1022,
      "PostDate": "06/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "kblack",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140330/profile",
      "Content": "Jan 21, 2012 07:28PM kblack wrote: Deb and Laura, Thanks so much for replying and confirming the shakiness.  Although of course, I am sad to hear that others have this SE, it is nice not to feel alone.  I guess I will gear up for it again after my 2nd treatment this Thursday.  I had made the mistake thinking that during my \"down\" time after my 1st treatment, I could possibly catch up on personal e-mails and write the holiday thank you cars, but 6 days of the shakes really made that impossible.  I couldn't write at all and could barely type.  If anyone hears of anything that will help this, please let me know.  I will also ask my nurse when I go in for my 2nd treatment.  Trying to go to work through this and the shakiness makes that so difficult too.  Can't really do one week on and one week off at work.  Hoping that once I finish AC and move to Taxol, this SE will go away.  Ordered a 2nd wig and some caps and hats today.  Hoping to donate my hair next week when we cut/shave it, but not sure its long enough.  Trying to come to acceptance about the hair loss.  My doctor had never heard of Claritin for the bone pain.  But I had terrible lower back pain after the 1st shot.  So I will try it.  Worth a shot - the shakiness and awful back pain were the worst SE's for me.",
      "MessageIndex": 668,
      "PostDate": "21/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "kblack",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140330/profile",
      "Content": "Jan 20, 2012 11:02AM kblack wrote: Hi - adding my stats: 1/12/12, dd 4 x AC, dd 4 x Taxol plus Herceptin for a year (S2 G3 ER+/PR+, HER2+).  I'm 38 with 20 month old twin daughters.  Had a BMW with expanders on 12/14/11.  I found the cancer myself during a self exam.  Hadn't had a baseline mamo yet as I had just finished breastfeeding 8 months ago.  In retrospect, it seems the cancer was growing while I was breastfeeding as I used to get blockage all the time in that breast. I don't know how I will get up the courage to show up for the 2nd treatment.  I'm sure I will find it, but the first one hit me way harder than I anticipated.  I feel like I will just feel about 100% myself again in time for the 2nd treatment.  But my husband reminded me that that is kind of the point.  I haven't had any issues with hair yet, but plan to shave my head proactively (hopefully) the day of the 2nd treatment (Day 14) or the day after.  Did anyone have a SE where they shook?  I basically had the shakes for about 6 days after my first treatment.  I don't know if it was because I couldn't stomach eating very much during that time or if it was all the chemicals in my body, but that was what made the recovery so difficult for me.  Just curious to know if anyone else experienced something similar. Thanks! Kim",
      "MessageIndex": 632,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "kblack",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140330/profile",
      "Content": "Feb 5, 2012 06:28PM kblack wrote: Hi everyone, Back home from the hospital today.  Counts still not in the normal range but headed in the right direction, so the doctor gave me a choice to stay one more night or come home. There's no place like home! Next, how to get motivated for AC #3 this Thursday.  First time around, I had a week of bad SE's and a week of feeling more normal every day.  I didn't get the week of \"normal\" this 2nd treatment.  I will need extra motivation to drag myself in on Thursday:)",
      "MessageIndex": 1009,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "kblack",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140330/profile",
      "Content": "Jan 11, 2012 07:43AM kblack wrote: Hi Everyone, I am so glad I found this group.  I had BMX with immediate reconstruction on Dec 14.  I also start chemo tomorrow - 4 rounds of A/C every other week, then 4 rounds of Taxol every week and a year of Herceptin.  I had the port put in last Friday.  It didn't work after he did it initially so he had to go back in and redo it.  Its been very sore since then.  I scheduled my chemo for Thursdays as someone had advised me that day 2 after chemo was worse than day 1, so I am hopeful that I can go to work on Friday, but am now feeling like maybe I've been in a bit of denial about how hard this will hit me.  I've also got 20 month old twin daughters and am praying that I will find strength somewhere to continue as much of our normal routine as possible. Thanks to all of you who have already started and have been posting your updates.  So helpful!!!!   And good luck to everyone starting tomorrow or later! Thanks, Kim",
      "MessageIndex": 376,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "kblack",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140330/profile",
      "Content": "Feb 4, 2012 06:09PM - edited Feb 4, 2012 06:09PM by kblack",
      "MessageIndex": 989,
      "PostDate": "04/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "kblack",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140330/profile",
      "Content": "Feb 26, 2013 10:43AM kblack wrote: Hi Alicethecat!  I was hospitalized twice during chemo with low white count and fever.  During my second stay, my red count also dropped.  It actually dropped to 4.5 on day 4 and was still dropping and the doctors were still kind of in a wait and see mode.  I elected at that point to have a blood transfusion as the doctors told me even when my red count started to recover, it would take some time without a transfusion.  With 2 1/2 year old twins at home, I just couldn't fathom it taking weeks for my red count to recover to the point where I could function again.  At 4.5, it was all I could do to get out of the hospital bed and go to the bathroom. I didn't understand until I was home and recovering just how severe my situation was.  I know the transfusion was the right decision for me, but I was very scared at the time.  I finish my last Herceptin tomorrow (finished chemo in June 2011 and radiation in August 2011).  My red count still hovers around 9 or 10.  The funny thing is that I saw my primary care doctor for a physical in Sep - she told me I was anemic and put me on iron supplements.  I went back to my next onc appt and my onc laughed and said, well, you can take them, but it won't help you.  You're anemic because of the bone marrow suppression from the chemo.  Anyway, I don't know if that helps at all.  I have no experience with Armidex.  My Dad has stage IV bladder and prostate cancer.  He is undergoing chemo and they monitor his blood counts almost every day and give him procrit shots several times a week following his chemo.  I am not sure if your doctor discussed procrit or if it is an option for you, although it is not without its controversy.  I was offered this also as an alternative to the blood transfusion but again was told the recovery would be slow and I just didn't have the ability to wait.",
      "MessageIndex": 3,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/800968",
      "Title": "Blood transfusion - anyone else? Alicethecat sherry67"
    },
    {
      "AuthorID": "kblack",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140330/profile",
      "Content": "Nov 29, 2011 05:07PM kblack wrote: Hi Everyone!  I am having BMX with expanders on Dec 14th.  I can't believe how fast this is all happening and yet, somehow time seems to stand still while I wait for the surgery.  I found 2 lumps on Nov 7th.  During my biospsy, 2 more were discovered.  All are less than 2cm (the largest measuring in close to 2cm), but the surgeon said this is more concerning than if I had one large lump.  I opted immediately to have a BMX to give myself the best chance because I am 37 and have 18 month old twin daughters.  I am anxious to receive more information from the tests that will be performed on the tumors following the surgery.  I am disappointed by the lack of information in the pathology report from my biopsy.  No hormone receptor tests were done.  Lymphatic invasion was identified so they will do a sentinel node biopsy as well.  I've already been told I will likely need chemo regardless of the sentinel node biopsy results.  I'm trying to limit those thoughts in my head which center around feeling sorry for myself, but I just can't help all of the questions, namely, how did I get here? If anyone has recommendations for things to do following surgery to speed recovery, I would be grateful.  I appreciate being able to read all of your posts.  Its so nice to feel less alone in this. Thanks!  Kim",
      "MessageIndex": 82,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "kblack",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140330/profile",
      "Content": "Feb 26, 2013 11:55AM kblack wrote: Hi concerneddaughter, I saw your post yesterday and started to respond, then decided to wait to talk to my husband.  I have a few different perspectives to share, but I wanted to get his feedback as well. My diagnosis wasn't completely the same.  I was stage II, but small tumors, aggressive cancer and positive nodes.  I did AC and Taxol.  I was hospitalized twice during chemo with low white count and infections.  AC is rough.  Any chemo is rough.  All of our experiences are individual but we can draw on the strength from one another and the things that are common.  I also have a father who has stage IV bladder and prostate cancer.  He is now undergoing his second type of chemo.  I have twin toddlers and am 39.  I can tell you that without a doubt, if not for them and I had a recurrence, I would not do chemo again.  But because of my babies, there would not even be a choice.  I will fight to the very end.  Now that feeling may change should I have a recurrence when they're older.  I felt very strongly when I read your post yesterday that I wanted to respond and tell you that it is your mother's decision, chemo sucks, and you need to support whatever she decides.  And while I do still believe this, after dicussing with my husband, I've come to understand that it is not that simple.  He told me very matter of factly last night that if I had chosen not to do or quit chemo at stage II, he would have been mad as hell at me.  He said it would have been a selfish decision.  But he knows the journey I've been on and continue on.  He knows the pain, the complete and total loss of control, the weakness and vulnerability.  And he acknowledges that he (or me) did not have any clue about this prior to my diagnosis.  But even given what we know now, he still would have been mad as hell. I remember my first chemo very well.  The feeling of these toxic chemicals being put into your body is unimagineable.  Each of us deals with it in our own way, but I don't think anyone would tell you it was easy.  Yes, all of the stats say do the treatment.  But even so, every individual is different and every cancer is different.  And how we respond to treatment, physically and emotionally, is different. My father continues his treatment but has told me that there will come a point where he will not want to fight anymore.  I have the \"luxury\" of having been on the same side of cancer and do not question his feelings or decisions.  But he is stage IV.  Of course, I would want him to fight.  I want him to live long enough to give lasting memories to his grandchildren.  And I do not want to be in a world without him (I lost my mother when I was 12 and do not want to go through that kind of pain again).  But these feelings, I know, are in a way selfish as well.  So to summarize, I completely agree with Athena - every person has their own individual feelings about this and we, as family and caregivers, just don't get to make those decisions for them.  But as Outfield pointed out, you can support your mother in helping her process this information and ensure she has all the information to make the best decision for her.  This stuff is scary.  And the overload of information, yet seemingly lack of reassuring absolute \"this treatment will work\" kind of facts, makes it so difficult to process.  Layer on to that the fact that your mom has actually had at least one chemo treatment now (so she knows at least how her body reacts initially) and you have a huge load to carry.  We want to know that the hell we are going through will be worth it.  But we have no reassurances.  I hope I didn't offend you.  I think it is so thoughtful of you to be on these discussion boards and the love you feel for your mom and the support you want to give her is so evident in your message.  And I don't mean to minimize any of what you're feeling.  Even having had cancer myself, I struggle with what to say to my Dad and how to support him.  I do the same as you and I post here and do a lot of lurking - but its a struggle for me.  I read the Stage IV discussion boards because I know that although I had cancer, I can't possibly know what its like for my Dad and yet, there is a part of me that doesn't want to think about Stage IV because I could be there myself tomorrow.  All of this is so hard and I guess at the end of a lengthy response in which I've probably not said much that is helpful, I can at least say that you are doing exactly what I would be doing in at least your effort to gain perspective.  You're here and asking questions and while we're not all going to be exactly like your mom, maybe something we say resonates and helps you process and helps you support your mom.  And don't underestimate your own need for support.  You are on a journey that many of us cannot understand, although I have a sense given my Dad's condition.  You are legimately frustrated.  Do not carry that weight alone.  You may not feel you can't share all of your thoughts with your mom (or at least that is how I feel with my Dad because how to do you say to someone that you're thinking and trying to prepare for a life without them) - but you should share them with someone. Here, in the caregivers support rooms, a therapist, a friend, whatever works for you.  I cannot emphasize this enough.  Seeking support for yourself does not make you weak.  It will only help you be stronger for your mom. ",
      "MessageIndex": 3,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/800397",
      "Title": "To continue with chemo or not concernedaughter msphil"
    },
    {
      "AuthorID": "kblack",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140330/profile",
      "Content": "Feb 25, 2013 12:00PM kblack wrote: I wanted to share some thoughts on this topic.  I think the most important thing to remember is exactly what has already been said: everyone handles chemo differently.  Unfortunately, that leaves those about to start with little comfort on what to expect or ability to plan. I will share my story as I wished I had found someone with a similar experience before I started.  I had 4 small tumors in my right breast.  I actually found 2 myself and the BS found the other 2 during the biopsy (had never had a mammo at that point - was 37 and had just finished breast feeding 6 months earlier).  I can tell you that at almost every step of this journey, my expectations were set one way and the opposite happened.  I went to my primary care doctor first.  She said it was just a cyst, but sent me for further testing just in case.  The mammo found nothing, but they found abnormalities during the ultrasound.  Then a week later the biopsy uncovered 2 more tumors.  All came back cancer.  I chose to have a BMX (lumpectomy was not an option with 4 tumors and I wanted to minimize future risk).  Right before my BMX in Dec 2011, my BS told me she didn't expect to find anything in the lymph nodes.  That was the first thing I wanted to know when I woke up.  None of the recovery nurses knew anything and they wouldn't let my husband in for some time.  When they finally did, he had the pleasure of telling me that 2 of the nodes were positive and more had been sent out for testing.  It was suggested to me even before the lymph nodes tested positive that I would need chemo.  I started chemo on Jan 12, 2012 with 4 rounds of adriamycin/cytoxan every 2 weeks followed by 12 weeks of Taxol/Herceptin, followed by 9 more months of Herceptin.  I had my port put in the week before.  The surgeon who did my port told me that occassionally they don't work the first time and they have to be redone, but that rarely ever happened to his ports.  Mine didn't work and had to be redone. My onc told me I would do fine with chemo.  I was young and strong and would have no problem working.  She said occasionally, but very infrequently, people would be hospitalized with neutropenic fever (low white count and fever related to some infection), but she assured me that this rarely happened and would definitely not happen to me.  I was referred to others who had worked through chemo with few problems.  So I came back from my surgery ready to do it.  I had my 1st chemo on a Thurs.  I went to work on Friday and by Monday, I was crawling out of my skin - I was shaking non-stop and the bone pain from the Neulasta shot was unbearable. Unfortunately for me, I started chemo right at the height of flu season.  So one week of my 2nd round of chemo, I was in the emergency room.  I was hospitalized for 4 days with neutropenic fever and what was most likely the flu (yes, I had had a flu shot).  Now as a mom of 2 year old twins, I am not going to lie.  There was a part of me that was relieved to be hospitalized so I could rest because my life at home was hectic, work or no work.  But then I realized that the hospital is the last place you want to go if you need rest.  At that point, I had to make the very difficult decision to go out on STD.  Emotionally, that decision was the toughest.  I had certainly not set up expectations with my manager that this is what would happen.  I felt like a failure.  The only people I had talked to prior to starting treatment told me how I would be fine or other people with my same set of circumstances did just great.  But I decided I had to go out for 2 reasons: 1) I had to try to minimize my exposure to infections.  Clearly my body was not reacting well at all to the chemo (or actually it was reacting exactly as it should because the point of chemo is to kill the cancer without killing you).  2) I could not work well in a setting where I was accountable some of the time, but could fall ill and not be able to execute at other points of time. This turned out to be the right decision.  I was hospitalized again after my 1st round of Taxol/Herceptin - this time for 6 days.  I once again had neutropenic fever.  They could not find the source of the infection and ultimately determined it to be a sinus infection because they couldn't figure out what else it could be.  But this hospital stay was worse than the 1st because my red count also dropped to 4.5.  It was continuing to drop and the doctors were kind of cavalier about let's just wait and see, but I chose to have a blood transfusion because my family couldn't function that long without me.  I finished chemo in June 2012.  Then I went back to work and started radiation (also a surprise because the doctors told me I wouldn't need radiation with a BMX and no one told me that if lymph nodes are positive, you will still need radiation until I was about half way through chemo).  This coming Wed will be my last Herceptin.  I had my implant transfer surgery a few weeks ago.  I have one more minor surgery to deal with the nipple on my right side (they were able to save one but not the other) and my PS said he will also remove my port during that surgery if I want.  My onc said it is up to me (anyone have thoughts on when to remove the port after finishing chemo)?  I kind of wish she would make the decision.  On one hand, its a constant reminder and physically uncomfortable with my bra strap, but on the other, you carry an umbrella so it won't rain.  I am probably going to have the port removed, but haven't decided for sure. So that is the summarized version of my story so far.  I share it here because while I certainly don't judge or want to offend anyone in their own choices, I want you to know that your journey will be your own.  If you ultimately choose not to work, this doesn't make you weak.  I wish someone had told me that.  Even my husband, who has been my rock throughout this treatment, was urging me to continue working because he thought it would be better for me mentally.  But ultimately, that just made me feel even more like a failure for getting hospitalized and not being able to work.  What finally gave me comfort in my decision was ultimately something my onc told me.  She said that long ago before they really understood how to monitor blood counts and before the development of neulasta, etc, they used to try to give people just enough chemo to send them into neutropenic fever.  Because again the idea is that you do everything you can to kill the bad cancer cells without actually killing the person.  I chose to believe that this meant the dosage they had me on was a good one, strong enough to kill a lot of my good cells, so hopefully strong enough to kill all the bad ones. Whatever you decide, know that it's ok.  And my heart goes out to those who do not have the choice of whether to work or not during chemo.  To feel so vulnerable and weak was a terrible feeling.  To not have a choice is just inhumane.",
      "MessageIndex": 13,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/800125",
      "Title": "Working Fulltime bhlri rozem"
    }
  ]
}