{
  "AuthorID": "KBP",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153424/profile",
  "Posts": [
    {
      "AuthorID": "KBP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153424/profile",
      "Content": "Oct 27, 2012 08:09AM KBP wrote: Your comprehensive report on radiation causing 'missing skin' is the most refreshing information.  Even my own Rad Onc couldn't explain it that well.  I was very concerned because I'm a redhead, and 'burn' very easily. As it turned out, I had bilateral radiation and babied my skin with cream and kept both covered with a few non-stick telfa pads, which felt good. I had to 'cool' my skin with cream 3-5 x a day. I got through my 7 weeks with redding but not blistered skin. However, I had a lot of sore heated pain and took Advil and Tramadol to get through.  3 years hence, I'm still experiencing tenderness and soreness time to time. I swim to maintain muscle and range of motion.",
      "MessageIndex": 144,
      "PostDate": "27/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "KBP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153424/profile",
      "Content": "Apr 27, 2015 11:39AM KBP wrote: Dear GoodConstitution, I am sorry you are facing another decision. I have found the decision making process to be very anxiety provoking. The feeling of being at a crossroads which will determine my fate. What do I do? How do I make a decision? I am learning to trust myself. To stop trying to control cancer. I ask myself, \"How far will I go with treatment, before I cross the line of expecting a perfect outcome-a cure?\"  The word \"quality of life\" and peace with myself comes to mind. I have been surprised at what I can tolerate, bilateral lumpectomy, rads on both sides, years of PT...but I have to constantly remind myself no matter what I do I cannot guide and determine my fate. Radiation is a serious decision and has its place in cancer treatment in this era. However no treatment is a guarantee or cure.                                         I believe the doctors and medical research are doing their best to give us statistics to help us with these decisions. The false sense of security is relying completely on these stats. Either my cancer will come back or it wont. Going around again for the fourth time, if you can handle another lumpectomy, do it. Can you consult with your medical team, ask questions,  \"Are there any other oncotype tests or gene studies to learn more about my DCIS, for me to weigh my decisions?\" Trust yourself.           ",
      "MessageIndex": 525,
      "PostDate": "27/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "KBP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153424/profile",
      "Content": "Jun 5, 2012 09:21AM KBP wrote: I really appreciate understanding more about the burning..missing skin. It worried me a lot 2 years ago.  I am a very fair skinned red-head and I was very worried about an extreme reaction to radiation.I sunburn badly! I had a bilateral rad treatment for 38 days, with boost at the end-2 years ago. I took care of my skin from the start, see below. Results-very bright red, no peeling, some itching, very sore but managed with Tramadol and Advil. Major fatigue, and general soreness for many months after. 4 months after my energy came back in one day!, Soreness and achy muscles continued. Started physical therapy to get range of motion back-it worked to a degree. BEST!!! Improvement after I started regular pool exercises in the heated therapy pool at the gym, using buoyant dumbells and stretching the arms, slowly. I continue with the pool a few times a week to maintain range of motion and prevent creeping soreness. I've had a some hardening under the left breast but generally my breasts are softer and less lumpy( fibrocystic) than before treatment; even, my onc made a note of the positive change. The hardening has changed and softened a bit, less sore too, since I had a professional massage therapist work my whole body and then my breast areas... amazing difference. I'll now continue massage every 6 wks. I took care of my skin from the start: slatthered on the RX cream given at the clinic right after treatment each day, covered both breasts with a few ex lg non-stick telfa pads to keep the cream from getting on my clothes, tucked in a few cooling Busom Buddies, ( another friend, going through treatment, and I made, 3\" flannel squares, filled with flax seed and lavender-cooled in freezer-we now donate these to our cancer ward) I would re-cream myself about 4-5 x a day, each day; as needed to soothe the burning soreness. It would always soothe and feel better right after new lotion, and a few newly cooled Busom Buddies tucked into my sports bra, or tight cami to hold it all together. innovative and crazy...but I found I could use the Barely There bras, inside out, to prevent the seams from digging in and then backward, to have a lower cut under my arms to prevent sore rubs on my lymph node surgery. Any low under arm cutting sport bra worked. PS  YOU CAN PULL UP YOUR BRA OR CAMI FROM YOUR FEET to prevent bumping the sore breasts.",
      "MessageIndex": 113,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "KBP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153424/profile",
      "Content": "Apr 5, 2015 08:54PM - edited Apr 5, 2015 08:55PM by KBP Fabulous explanation! It makes perfect sense. I have very sensitive fair pink skin being a strawberry blonde with blue eyes. I had bilateral rads for the bilateral lumpectomies.I used Biofine by Neutragena given to me at the rad clinic. I slathered that on all day with non stick pads for cooling comfort, with a band aid comfort feeling. I got through the 7 weeks with sunburned pink, then fiery red skin mostly at the boosts, no blisters, some itching. I showered and removed the cream each morning. I couldn't wait to put it on. It felt so much better each time the heat built up...4 times a day. I kept small 2\"square hand made flannel pillows filled with flax seed in the feeezer and replaced those all day long to cool my sides and help keep my sport bra from touching my skin. Find your way to be comfortable!!! No need to suffer. Ask for pain meds if you are hurting.  Continue to stretch daily to keep your range of motion. I wish I had done more of that but know one suggested it until saw a PT nine months later all jammed up and sore from lack of mobility. Swimming was the answer!!! I got my energy back 3mos after rads. Skin fully recovered in 3mos too. However I needed the swim and stretch for nerve issues. Now virtually cleared up. I am 5years out, still clear, best wishes to all Kirsten from New Hampshire",
      "MessageIndex": 517,
      "PostDate": "05/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "KBP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153424/profile",
      "Content": "Aug 13, 2015 04:34PM KBP wrote: Medicinal honey has worked for a friend.",
      "MessageIndex": 548,
      "PostDate": "13/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "KBP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153424/profile",
      "Content": "Apr 25, 2015 05:52PM KBP wrote: Hi Ann13820, I understand your freak out. I had gobs of questions for my RO being a pink fair skinned freckled strawberry blonde. Just the idea of rads seemed ludicrous since I burn so easily in the sun. I had conformal radiation. The beams came from different angles to target the breast tissue as close as possible. I insisted to see the texhnical data of how much lung and heart were going to be touched since I had rads on both sides each visit for my bilateral for 7 weeks ( 5 days/week with boosts at end) I had a neg sentinel node so I did not do axillary rads.  My fair skin survived really well-got hot,  tender really dark pink, a little itchy, but the cream really soothed the heat and helped my comfort. I ask and got pain meds throughout the treatment-really helped- a non opiate pain reliever. (See earlier post-detail on personal care during rads) Good luck as you heal from surgery and move forward. Reach out to others who have used your clinic nearby.  I also went to a nearby clinic rather than the 2hr trip to Dartmouth Hitchcock Norris Cotton Cancer center.  ",
      "MessageIndex": 521,
      "PostDate": "25/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    }
  ]
}