{
  "AuthorID": "kbt",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
  "Posts": [
    {
      "AuthorID": "kbt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
      "Content": "Feb 1, 2017 06:14PM kbt wrote: Waiting with you and it is the worst! Have my biopsy tomorrow and hoping it goes as easily and as well as you described. Hoping for you that you get your results sooner than later. Sending positive thoughts your way.",
      "MessageIndex": 4,
      "PostDate": "01/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852266",
      "Title": "Waiting on Biopsy Anitacarol73 Trishgri"
    },
    {
      "AuthorID": "kbt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
      "Content": "Nov 9, 2017 04:01AM kbt wrote: Loomisgal, I had major fatique, not \"can barely make it to the bathroom\" but could sleep all day type of exhaustion. I am fighting a double ear infection as well, which may be part of it. I thought for sure I would not feel this tired a week after finishing. Hoping we both get our energy back.",
      "MessageIndex": 1,
      "PostDate": "09/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859884",
      "Title": "Severe fatigue post accelerated partial breast radiation Loomisgal JKL2017"
    },
    {
      "AuthorID": "kbt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
      "Content": "Feb 25, 2017 05:18AM kbt wrote: Jazz123, You may want to join the March 2017 Chemo board. I start 3/9, others are starting 3/2, 3/13, etc. I have an 8cm tumor, chemo first then surgery. We can all ride together and share the journey. My heart goes out to you and the amount of loss you have faced in a short time. Sending you love and light.",
      "MessageIndex": 1,
      "PostDate": "25/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/852954",
      "Title": "Chemo starting 8th March ...journey since 2008 Jazz123 kbt"
    },
    {
      "AuthorID": "kbt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
      "Content": "Feb 6, 2017 04:41PM kbt wrote: I felt my lump, it is 5cm. I was calling to schedule annual preventative mammogram and told them about the lump, they told me to call my doctor for the diagnostic mammogram and ultrasound. ",
      "MessageIndex": 26,
      "PostDate": "06/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852444",
      "Title": "How many of you felt a mass prior to getting tested? Hopefloatsagainandagain Cowboy-Up"
    },
    {
      "AuthorID": "kbt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
      "Content": "Mar 3, 2017 05:44PM kbt wrote: Hello Reba, there is a another March chemo thread that several of us starting in March have joined - come on over to the \"party\". Wishing you well on getting your treatments in before work or getting an extension on your FMLA. Link to the other thread below: https://community.breastcancer.org/forum/69/topics...",
      "MessageIndex": 1,
      "PostDate": "03/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/853112",
      "Title": "Starting Chemo March 2017 Castigame kbt"
    },
    {
      "AuthorID": "kbt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
      "Content": "kbt wrote: Hello and thank you for such a wonderful, informative site. I have a few questions that I have been unable to find answers elsewhere. Hoping someone can help. I will apologize in advance for the long post. On January 6 I went to a PA at my PCP for a follow up after having a bad stomach bug (basically a chat to see if I was ok). At that time she reminded me it was time for my annual mammogram. The scheduler suggested the new 3D mammogram since I have level 4 dense breast, and to call my insurance to see if they would approve. A migraine Mon-Tue kept me from calling until Wednesday, 1/12. I called they approved. While taking a shower I felt a large lump on my left breast around the 1:00 area of my breast, finger width away from my nipple. When I called to schedule I informed the Breast Center and they said I would need to call dr to get them to order diagnostic mammo. I did and mammogram and ultrasound scheduled for 1/24 (earliest available). In meantime breast was warm to touch, had a small pink area around nipple and some skin changes; called to see PCP. Went and she said \"it is probably just a cyst\" but you have the tests scheduled and I will call after with results. Went for appt. and radiologist came in after US tech was finished. He did more US and showed me the mass on the screen. At the time he told me it was a \"suspicious mass with swollen/involved lymph nodes\" wanted to see me for a US guided biopsy the next week. Earliest was 2/9. Biopsy scheduler said dr wasn't done dictating report but that I would get a copy and if any openings came up before 2/9 she would call. No call from PCP (as she said she would after mammo). No call from breast center, so I went to get a copy of the report myself. Report says: Mammogram: \"ill-defined spiculated mass....poorly circumscribed on standard and tomosynthesis images. Also noted are some enlarged lymph nodes just superior to the spiculated mass low in axillary. US: \"shadowing irregular poorly circumscribed mass...from 12-130. Although multiple measurements are provided by tech, the exact size is hard to ascertain due to the poorly circumscribed margins...concerned that it measures up to at least 4-5cm (2in). Again noted are some enlarged low left axillary lymph nodes with cortical thickening. Impression: \"...consistent very concerning for invasive mammary carcinoma...with some involved lymph nodes.... BI-RADS Code 5: Highly Suggestive of Malignancy (that part is all caps). It says again recommend US guided biopsy for diagnosis. And it states I will get a letter reflecting findings (I have yet to receive this letter or a call). I understand the odds of it being malignant and I am hopeful and prayerful I will be in the 5% that it is benign. However, I am also a realist. I have contacted Breast Center and my PCP about an early date for my biopsy to no avail. So I am resigned to the wait. I did get bumped to the 8th, which the scheduler said means I will get results on Fri rather than having to wait until Monday. This is where my questions come: Will the biopsy tell the type of cancer or just yay or nay? Do you know if they can biopsy part of the swollen lymph? How soon after getting report (if positive for malignancy) will I see a specialist? I am prepared to ask these questions day of to the dr...just want an idea or ballpark of others' experiences. I know some had biopsy day of screening (I wish I was one of those, cause the wait is the worst). Thanks again, Worried in NC Dx 2/3/2017, IDC, Left, 6cm+, Stage IIIB, Grade 3, 5/11 nodes, ER+/PR+, HER2- (IHC) Surgery 8/7/2017 Lymph node removal: Left, Underarm/Axillary; Mastectomy: Left Radiation Therapy 9/22/2017 Whole-breast: Breast, Lymph nodes, Chest wall Hormonal Therapy 11/9/2017 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852187",
      "Title": "Awaiting Biopsy - birads 5, newbie w/few questions kbt MinusTwo"
    },
    {
      "AuthorID": "kbt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
      "Content": "Jan 31, 2017 10:04PM kbt wrote: Due to physical changes in my breast: a middle finger wide indentation left of the lump, another dime-size indentation and color change (it looks bruised) north of my nipple. They have moved my biopsy to this Thursday. Glad I'll be getting in sooner. Thank you all for this forum, it has really helped knowing others are in this same waiting game.",
      "MessageIndex": 5,
      "PostDate": "31/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852187",
      "Title": "Awaiting Biopsy - birads 5, newbie w/few questions kbt MinusTwo"
    },
    {
      "AuthorID": "kbt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
      "Content": "Jan 28, 2017 02:55PM kbt wrote: Thank you Marie, yes I have bookmarked that forum page and will be printing it out. It is an excellent reference! Thanks for the positive thoughts as well!",
      "MessageIndex": 4,
      "PostDate": "28/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852187",
      "Title": "Awaiting Biopsy - birads 5, newbie w/few questions kbt MinusTwo"
    },
    {
      "AuthorID": "kbt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
      "Content": "Feb 4, 2017 11:55AM kbt wrote: Mamasha thank you. Seems like we are in similar boats with diagnosis. Praying for a good outcome on your surgery. Just knowing this support is here and the encouraging words from everyone has helped. So far haven't cried, but have a feeling they will come and trying to do like you and only cry at home (but not in front of my son). Virtual hugs to you as well. And again thank you for just being here with a reply. Kimberly ",
      "MessageIndex": 13,
      "PostDate": "04/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852187",
      "Title": "Awaiting Biopsy - birads 5, newbie w/few questions kbt MinusTwo"
    },
    {
      "AuthorID": "kbt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
      "Content": "Feb 3, 2017 10:28PM kbt wrote: The Breast Center nurse coordinator called me this evening. Part of the information I knew, the tumor is 5cm. It is Invasive Ductal Carcinoma, it may be a combination of lobular and ductal carcinoma, only got a partial pathology report. It is HER- and ER/PR+. Don't have a stage or grade yet, but she does suspect that it is in at least 2 lymph nodes. I will get the full report Monday. They will call me Monday with the appointment with the breast surgeon, who will act as my navigator/coordinator. She said he will send me for MRI and possibly other tests (may do lymph node biopsy or wait and do sentinel lymph node biopsy at surgery time), as well as send me to a genetic counselor which will run the genetic testing and speak to me about options regarding genetic tests. She said it may be as long as a week before I see the surgeon. Apparently, I am the 4th diagnosis this week.",
      "MessageIndex": 9,
      "PostDate": "03/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852187",
      "Title": "Awaiting Biopsy - birads 5, newbie w/few questions kbt MinusTwo"
    },
    {
      "AuthorID": "kbt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
      "Content": "Feb 4, 2017 12:08AM kbt wrote: Marie, Thank you. Yes, I am pretty calm right now probably because I suspected the diagnosis. Or heck, I could be in shock....lol! They are going to give a book or something to keep up with all my \"stuff\". And I am printing off the pathology brochure/leaflet provided here, it seems to be a good place to report or write stuff. I also like the binder suggested in the \"Just diagnosed\". This site and the sisterhood here have already been a great help with the useful links and information. All of these have helped me know what to ask and know the lingo. I am quitting smoking and my doctor has given me Wellbutrin which is supposed to help with anxiety too. I friend also gave me two Xanax, which I am saving until I \"really\" need it. Going to take my sister with me to the next appointment to help me remember what all the surgeon says and help me remember to ask my questions. She was awesome at the biopsy, by bringing me a coffee and cinnamon roll and helping me stay calm beforehand.",
      "MessageIndex": 11,
      "PostDate": "04/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852187",
      "Title": "Awaiting Biopsy - birads 5, newbie w/few questions kbt MinusTwo"
    },
    {
      "AuthorID": "kbt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
      "Content": "Jan 28, 2017 02:39PM kbt wrote: Thank you, all your answers helped immensely. I will ask about the node biopsy you mentioned as an addendum to my questions. Will keep everyone posted. :)",
      "MessageIndex": 2,
      "PostDate": "28/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852187",
      "Title": "Awaiting Biopsy - birads 5, newbie w/few questions kbt MinusTwo"
    },
    {
      "AuthorID": "kbt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
      "Content": "Feb 1, 2017 09:06PM kbt wrote: Yes, the waiting is the worst! Thanks Beatmon and Marie! They have promised results by Monday...then I can know what/how to proceed. I am unfortunately not a \"fly by the seat of my pants\" kinda girl, so wanting to plan is almost a compulsion. Again love this group!",
      "MessageIndex": 8,
      "PostDate": "01/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852187",
      "Title": "Awaiting Biopsy - birads 5, newbie w/few questions kbt MinusTwo"
    },
    {
      "AuthorID": "kbt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245696/profile",
      "Content": "Feb 9, 2017 08:55PM kbt wrote: Hello GG31, I had pain in and around my lump and still continue to have pains in the area. I was a BiRADS 5 and was just diagnosed with invasive ductal carcinoma. I have heard both there is no pain with cancer and there is/can be pain. I think we are all different. Here's to good thoughts that your's will be benign. Hoping that you have peace in the waiting time.",
      "MessageIndex": 1,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852573",
      "Title": "pain in area of lump GG31 EpicSquirrel"
    }
  ]
}