{
  "AuthorID": "KCandJsMom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123446/profile",
  "Posts": [
    {
      "AuthorID": "KCandJsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123446/profile",
      "Content": "Mar 6, 2011 10:44AM KCandJsMom wrote: Hi Laureen, Take a trip on down to San Jose and check out Wig'n Out. I just got my wig there and am happy to be able to recommend this shop. Catherine, the owner, is AWESOME! She is super knowledgeable and has quality wigs for great prices. Lots of inventory, too! I am so glad I found her as she made what could have been a horrible experience, fabulous. I love my wig (really!) and hope you are able to make it down because her shop speaks for itself. Maybe you can even call to see if she can get you what you want for a better price. Good luck to you!",
      "MessageIndex": 2,
      "PostDate": "06/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/765628",
      "Title": "Where to buy a good-quality wig in Bay Area, CA? --- exbrnxgrl"
    },
    {
      "AuthorID": "KCandJsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123446/profile",
      "Content": "Oct 23, 2011 12:10PM - edited Oct 23, 2011 12:46PM by KCandJsMom Thank you so much for your post, you took the words right out of my head! I just finished Rads (Fri) and start tomoxafin Monday. I have a 6 and 8 year old and though I worry about always being here for them, I must confess that they were the ones that got me thru treatment (which was not all that bad - especially now that it is behind me!!!). The kids kept me from curling up in a little ball and giving up. I had to MAKE myself \"ok\" when going through my treatments because of them. Because they are always watching.It is tough on those of us with little ones but I wonder if they actually help us to get through? I was so frightened when dx'd but the day that I started chemo was the big earth quake in Japan. I thought of all of those thousands of peope whose lives ended in just a matter of minutes. I realized in that moment how very fortunate I actually am. I was given a second chance, the gift of time, to say and do the things that none of those victims of the quake had a chance to do. I thought I was \"unlucky\" at first, I think I am one of the luck ones now.  I am in a herceptin trial (they've seen some great results in her2 negative gals, not just her2 positive) and though I hope my cancer never returns, I am banking on the fact that my treatments have bought me the gift of more time. I know better treatments/the cure is around the corner. I intend to be here to see that day! I am 9 months down the path but the things I have learned this past year almost outweigh everything I learned the 44 years that preceeded it. Honestly! I read this quote recently and totally agree.   Bill Hemmer: \"You said cancer changes your life, and oftentimes for the better.\" Joel Siegel: \"Yes.... Gilda Radner... said this in her book. What cancer does is, it forces you to focus, to prioritize, and you learn what's important. I mean, I don't sweat the small stuff. I used to get angry at cab drivers. It's not worth it.... And when somebody says you have cancer, you realize it's all small stuff. And what Gilda said is, if it weren't for the downside, everyone would want to have it. But there is a downside.\" ~American Morning, CNN, 13 June 2003  Sorry for rambling!",
      "MessageIndex": 15,
      "PostDate": "23/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/776821",
      "Title": "stage 3a breast cancer survivors mariar Icandoallthings"
    },
    {
      "AuthorID": "KCandJsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123446/profile",
      "Content": "KCandJsMom wrote: 24 rad down, 1 to go (tomorrow). Up until now my skin has held up really well. THEN....my German Shepherd jumped up and accidentally clawed my chest : (. Ripped the skin right off. I have no idea what to do with open skin since I have been so fortunate up until now and never asked that question. I called my docs office, she was gone, as were all the nurses. Another doc who happened to be there said I should put neosporin on it and then check in with the nurses station before radiation in the AM. Any advice? Do I keep moisturizing the other skin? Leave it alone? So bummed, my skin was doing so well... Thank you to my breast cancer sisters for helping me along! Dx 1/20/2011, ILC, 4cm, Stage IIIA, Grade 1, 5/10 nodes, mets, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/776790",
      "Title": "Dog clawed the skin off of my radiated chest. KCandJsMom eileenr56"
    },
    {
      "AuthorID": "KCandJsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123446/profile",
      "Content": "Oct 23, 2011 12:44PM KCandJsMom wrote: Thanks so much everyone! I posted here before calling my rad onc (who was gone as were all the nurses!) and had answers almost instantaneously. What would I do with you girls???? I am a few days out from this mess and still love my puppy dog : ) They went ahead and radiated me, which was my biggest worry. When will the drama ever end.......",
      "MessageIndex": 6,
      "PostDate": "23/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/776790",
      "Title": "Dog clawed the skin off of my radiated chest. KCandJsMom eileenr56"
    },
    {
      "AuthorID": "KCandJsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123446/profile",
      "Content": "KCandJsMom wrote: Hi friends, starting chemo Thurs. and ran across an animal research study (from '08, I think) regarding fasting 48 hours before chemo. Has anyone heard of this???? The theory is that starving your body puts your \"good cells\" into hibernation mode, protecting them from the toxic chemo drugs. Meanwhile the \"bad cancer cells\" just go about their regular business of multiplying. Some self-reported data from a handful of people who fasted before chemo reported far fewer SE so I just wonder.....I suppose I am just nervous and looking for any old way to hedge my bet against chemo and it's side effects. I don't know but it sounds reasonable to me. And I'd be willing to do it. Just can't find much info on this so I thought I would check with you experts : ). Looks like Mayo is doing a study with Lymphoma patients. What do my fellow bc gals think/know? Thank you to my breast cancer sisters for helping me along! Dx 1/20/2011, ILC, 4cm, Stage IIIA, Grade 1, 5/10 nodes, mets, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/765891",
      "Title": "Fasting 2 days before Chemo? KCandJsMom Letlet"
    }
  ]
}