{
  "AuthorID": "kcheval",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86825/profile",
  "Posts": [
    {
      "AuthorID": "kcheval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86825/profile",
      "Content": "Aug 2, 2009 01:35PM kcheval wrote:",
      "MessageIndex": 5,
      "PostDate": "02/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/737998",
      "Title": "Arthritis and compression garments Binney4 kcheval"
    },
    {
      "AuthorID": "kcheval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86825/profile",
      "Content": "Aug 2, 2009 04:52PM kcheval wrote: Please ladies, try this. I had all the lymph nodes removed on my right arm in 06 and had all the swelling problems. Had a sleeve and a massage therapist to keep the swelling at bay. Last year I bought some pinky finger magnets to help me sleep and after a few months realized I didn't have any more swelling. I do hard physical work, remodeling my house, using power tools, painting, moving hay bales for my horse and since the magnets, I don't even think about having arm swelling anymore and it doesn't seem to make any difference how hard I use the arm. I'm trying to let as many people know about this so they can try it. Hopefully others can get the same relief I did. My oncologist was amazed at the results. www.naturalcuresstore.com is one place to get them. Magnets if used properly increase circulation. Don't try to use refrigerator magnets, the polarity is crucial.",
      "MessageIndex": 13,
      "PostDate": "02/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/737723",
      "Title": "Avoiding LE in my state's heat/humidity Artemis kira"
    },
    {
      "AuthorID": "kcheval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86825/profile",
      "Content": "Aug 5, 2009 04:13PM kcheval wrote: I've bought off of both sites. They're basically the same. At least with Alex Chiu's site he gives you instructions on how to make your own. I've also used magnets for a tendon injury on my horse and a friend just told me about the success she's had using magnets for her plantar fascitis. There are a lot of good naturalpathic sites that can give you good information on using them. I researched them extensively before using them and the most impotant thing to know is how to use the polarity. They work a little like Chinese herb therapy where you have warming and cooling herbs and you alway want to use cooling to shrink and warming to stimulate. There are instructions that come with them to show you how to wear them. There are other sites that you can get them from, I just used those.",
      "MessageIndex": 15,
      "PostDate": "05/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/737723",
      "Title": "Avoiding LE in my state's heat/humidity Artemis kira"
    }
  ]
}