{
  "AuthorID": "KCMC",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
  "Posts": [
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "Oct 3, 2018 05:01PM KCMC wrote: Hi, I agree with GreenHarbor, I didn't have a lumpectomy but a Double Mastectomy with immediate DIEP Flap reconstruction. I was also told to wear a bra every day and the Coobie Bra was great, nice and comfortable. And GreenHarbor is right about pulling them up from the feet, this was the only way I was able to get a bra on and off for awhile. My surgery was 17 months ago and the Coobie Bra is now my Bra of choice. They are also reasonable priced. Good luck to your mom!",
      "MessageIndex": 5,
      "PostDate": "03/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867577",
      "Title": "Wearing bra advice Neon55 gb2115"
    },
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "May 3, 2017 12:47PM KCMC wrote: Remall, yes I believe the MRI is helpful, at least in my case. My tumor IDC 1.3 cm showed up on the Mammogram and ultrasound. My Dr. said before I schedule a lumpectomy lets do a MRI. Lo and behold, another tumor 1 cm was hiding that did not show up on the Mammogram and ultrasound. The lumpectomy is now off the table and I am doing a BMX with DIEP reconstruction on May 22nd. Good Luck to you.",
      "MessageIndex": 67,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "May 6, 2018 10:53AM - edited May 6, 2018 12:07PM by KCMC SuiteLisa, I had a few nightmares before my surgery last year and was terribly frightened. I had a double mastectomy with immediate Diep Flap reconstruction. I spoke to my plastic surgeon about my fears and he said to me that I had more of a chance getting into a terrible car accident heading to my surgery than having complications during surgery. Like parachutes, I had a couple of Reiki sessions, I meditated, exercised and asked for a prescription of Klonopin. Good Luck with your surgery, everything will work out fine. I am a year out from my surgery, almost finished my hercpetin/perjeta nfusion treatments and I am doing very well and happy!",
      "MessageIndex": 5,
      "PostDate": "06/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864411",
      "Title": "Presurgery Nightmares FaithsMama mustlovepoodles"
    },
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "Dec 30, 2018 05:21AM KCMC wrote: Yeah! So happy for you great news! Now give those kids a big kiss and enjoy the rest of the holidays :",
      "MessageIndex": 12,
      "PostDate": "30/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868967",
      "Title": "Scared I have inflammatory breast cancer DaisyMum Meow13"
    },
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "Apr 15, 2018 05:15PM KCMC wrote: I had 6 TCHP every 3 weeks. The pharmacist at the oncology center said to keep my finger and toe nails short and painted dark. Never had a problem though they were a little thin.",
      "MessageIndex": 2,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863999",
      "Title": "Fingernails and toenails? Djt mustlovepoodles"
    },
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "Dec 25, 2018 03:51AM KCMC wrote: I’m so sorry, the waiting is the worst part. Once you know for sure you can get a treatment plan in place and you will feel a bit more in control. Samnjb has good advice, I too got a prescription for an anti anxiety meds and it helped a great deal. When I was diagnosed my two boys were 11 and 13. I felt the same way and worried about leaving my boys behind. I now feel differently. Find a team of medical doctors you trust and make decisions that are best for you. This sight is a godsend for that kind of research. I just finished up treatment this past August and I am now on the other end a bit tired and bruise but very happy. Yes, happy and you will be too. Hang in there take a few deep breaths and lean on us for support. Gentle hugs (( )).",
      "MessageIndex": 5,
      "PostDate": "25/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868967",
      "Title": "Scared I have inflammatory breast cancer DaisyMum Meow13"
    },
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "Aug 5, 2017 01:19PM - edited Aug 5, 2017 02:19PM by KCMC I understand how you feel I went from a Double D to an A. I did a double mastectomy with DIEP Flap Reconstruction. My good friend who is a nurse told me that I should take a look at the results before I came home from the hospital. I am glad I did because I think the nurses are also prepared to help you emotionally. Everything around me has changed, I have two young sons one 10 and one 13 and I can't believe how compassionate, brave and understanding they are. My community has been outstanding and so helpful. I have always been just wrapped up in myself because my husband just retired a year ago from 32 years in the military. Despite how I feel about my self image - and I know that will change I am overwhelmed by all the help I am getting. This too was a problem for me I was always self sufficient helping everyone else. I try to focus on all the good around me. Good Luck with your surgery and you will feel better about yourself. I actually am beginning to like my small boobs no more staring lol! Clothes look much better on me. Most importantly I have a different outlook on life and I felt the same way you did at the beginning.",
      "MessageIndex": 6,
      "PostDate": "05/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857674",
      "Title": "Will my dog be the only one who looks at me the same? GreenEyes81 inccmd"
    },
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "Apr 23, 2018 05:45AM KCMC wrote: I guess I am the odd one out. I am HER2 positive and have no port. I have very good veins. I had 6 rounds of TCHP starting last July and Herceptin and Perjeta till beginning of August this year. I drink more than 64 ounces of water a day. Blood draws are never a problem for me. The three days leading up to infusion I make sure I eat something salty, Chinese food or cans of Soup. I wouldn't recommend going my route but it is working for me. I just couldn't put something foreign in my body and have it there for a couple of years.",
      "MessageIndex": 41,
      "PostDate": "23/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863991",
      "Title": "Chemo Port-O-Caths: Did you get one? What was is like? buttercup1 exbrnxgrl"
    },
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "Apr 18, 2018 01:43PM KCMC wrote: Joy and Kim, good luck! Sending good vibes and hugs your way.",
      "MessageIndex": 3,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/864054",
      "Title": "Biopsy Today JoyMrt5 Kimi89"
    },
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "Aug 3, 2017 08:14AM KCMC wrote: I too had a false sense of security. I had my first mammogram at 35, then 37, 39 and 40-47. All at the same location and 2 years ago they received a 3D mammogram. I don't have dense breasts. I go every March for my mammogram and have never missed one in the last 7 years. Lo and behold I felt the tumor myself a month before my scheduled mammogram. Immediately changed my appointment two days following. The mammogram caught the tumor supposedly 1.3 cm. Then went for a sonogram which caught a shadow. Then on to an MRI which showed second tumor 1 cm. When all was said and done I had a double mastectomy and during the pathology they found two more tumors four all together 0.8 and 0.5 cm with DCIS all around. Second Breast was healthy and I opted for a Double Mastectomy with DIEP Flap. So happy to be rid of them. Now in the middle of chemotherapy. Talk about a false sense of security. I was so mad thinking I was doing the right thing. Mammograms are worth SH*T. Still so angry. Thank god no lymph node involvement but triple positive. Also both biopsies came back her2 negative but when all was said and done I am HER2 +.",
      "MessageIndex": 46,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/634136",
      "Title": "Cancer missed by mammogram? joanne_elizabeth HoneyBeaw"
    },
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "Aug 3, 2017 06:27PM KCMC wrote: I was diagnosed back in March with 1.3 cm tumor i found even though I went for mammograms for years. MRI showed 2 tumors lo and behold when I had my double mastectomy they found four tumors. I told my BS right away I wanted a Double. He was a little surprised and said it would only improve my chances by 1 percent. Hey one percent is one percent right? After that he didn't bat an eye they did pathology on the healthy breast and it was fine I don't regret my decision at all. That is how you should feel in the decision you make. Don't let anyone push you around it is your body. I did an immediate DIEP Flap and I don't regret it for a second. This is how you should feel do your research and do what YOU WANT TO DO. It is your body recon no recon unilateral bilateral. I know it is a lot to take in but your Dr. is working for you. I have a friend who had a Uni with no recon and she wears a prosthesis. Happy as can be looks great and has NED for six years. Bottom line is research the boards and do what it right for you :) You will come to a decision and it will be the right one.",
      "MessageIndex": 17,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/857476",
      "Title": "Uni or Bitateral Mastectomy if I'm not planning reconstruction justbeatgeno jeanwash"
    },
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "Aug 5, 2017 05:26PM KCMC wrote: Also, ask your nurses on release day for a go home bag of dressings etc. Mine filled up a huge bag to take home with me.",
      "MessageIndex": 17,
      "PostDate": "05/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857555",
      "Title": "Caring for yourself after bilateral mastecomy georgia67 KCMC"
    },
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "Apr 6, 2018 08:24PM KCMC wrote: Hi, I was diagnosed with PTSD back in 2004, I was directly across the street on 9/11. I waited three years to get help, what a waste of time. I finally went to a therapist who specialized in PTSD and with talk therapy the PTSD, anxiety and panic attacks disappeared. I also started an anti depressant when I started therapy which helped a great deal. Fast forward to 2017 when I was diagnosed with Breast Cancer, PTSD was back, this time I did not wait, I started to see a therapist right away and started to take an anti depressant right away. I also discovered my breast cancer is 9/11 related, so that in itself brought back memories from 9/11. It's such a shame that there is still stigma attached to mental illness. If I were you I would watch out for any symptoms. PTSD is real and should be treated, my husband also sufferes from it. He didn't get help til after he retired from serving 32 years in the military. He also agrees that he should have seeked help sooner. Hopefully your wife won't suffer from it, she is very lucky that she has you and that you are on the lookout for her mental health and that you love her for who she is.",
      "MessageIndex": 12,
      "PostDate": "06/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/863762",
      "Title": "PTSD After Mastectomy? Engine104 Engine104"
    },
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "Aug 5, 2017 05:20PM KCMC wrote: Hi I had a BMX with immediate DIEP flap recon. Pillows are key just like everyone else said lots and lots of them bought them cheap at JC Penney's. Maybe freeze a couple of meals beforehand. I asked the nurses for the mastectomy bras otherwise I don't think I would have been offered them. I kept on asking a few nurses and ended up with 5 all together. They have velcro opening fronts and rings to hang your drains from. I also sewed a couple of pockets into my bathrobe from an old t shirt to put my drains into after showers. A shower chair and walker were invaluable to me. I did need help for showering the first two weeks. Don't forget about dry shampoo and sensitive baby wipes. you may be able to get away without tape my mastectomy bras kept all guaze and compression pads in place without tape, but I did have recon. My underwear keeps my abdominal pads in place. Also a little bit of exercise dr. approved of course a little walking may make surgery easier.  If you are from America Don't be afraid to ask for help from meals on wheels, American Cancer Society. You will be amazed at the help you can receive. Do you belong to any religious affiliations, maybe someone can volunteer to walk your doggy. So lucky to have him he will keep your spirits up! This is the time to ask for help I am sure you have been helping people all your life. Now it is your turn. Good Luck with surgery!",
      "MessageIndex": 16,
      "PostDate": "05/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857555",
      "Title": "Caring for yourself after bilateral mastecomy georgia67 KCMC"
    },
    {
      "AuthorID": "KCMC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247859/profile",
      "Content": "May 13, 2018 06:36PM KCMC wrote: In my bed with my hubby and three cats. We only have a queen size bed. No issues at all. My drains were attached to my \"camisole\" the hospital provided. I did order very large pillows 4 of them before I went into surgery. I had no leakage, though I was worried about that too. They were as you put it very self contained. One tip my hubby set up a small table by my bed with all my meds and a basket to keep on the bed during the day with chapstick, snacks, bottles of water and other things I might have asked for during the day. Good Luck!",
      "MessageIndex": 3,
      "PostDate": "13/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864570",
      "Title": "Where did you sleep in the weeks after BMX? Lea7777 Lea7777"
    }
  ]
}