{
  "AuthorID": "kcmcountry",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255519/profile",
  "Posts": [{
    "AuthorID": "kcmcountry",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255519/profile",
    "Content": "kcmcountry wrote: I had a needle biopsy back on 6/26 and I am still waiting for results. The nurse from my PCP's office has told me yesterday that the samples have been sent to a another lab for a second opinion, which she told me is routine, but it doesn't give me much confidence that the news will be good. Basically she told me I should not expect any results until the end of next week and I shouldn't bother calling again until Monday 7/17. I've been reading these boards a lot over the last couple of weeks. I suppose I decided to finally post now because, after 10+ days of waiting and lonely frustration, I can't bear the thought of going through another 7-10 days alone. I am a single parent, my daughters' father was never in their lives and has since passed away. My family doesn't truly understand what I am going through, other than to try to reassure me that it's probably nothing. I realize the odds would suggest that, but with a mother and grandmother who both had breast cancer (both have long since passed away from other causes), I can't help but feel as though the deck is stacked against me. The nodule was discovered during an annual screening mammogram, and the radiologist ordered the biopsy (after a second mammogram and ultrasound). My PCP signed the order, but he has not called me himself, or personally returned my calls since this whole ordeal always his nurse. And now he seems to have developed a \"don't call us, we'll call you\" attitude. I have called maybe twice a week, so I'm not inundating them with calls. No one seems to share my frustration with the lack of compassion from my doctors or the delay with my results. I am the type of person who prefers to tackle obstacles in my life head on, so the waiting is awful. The loss of control, fighting to get answers and information is frustrating. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "07/07/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/856726",
    "Title": "Waiting and Alone kcmcountry MTwoman"
  }]
}