{
  "AuthorID": "kdking",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
  "Posts": [
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Mar 26, 2012 10:03AM kdking wrote: I start my RADS tomorrow! I had a BMX with immediate DIEP reconstruction last September. I was just informed that they will be radiating four fields?? Not sure if I understand this. I was also told that my new flaps could die....not what I wanted to hear after a 18 hour surgery.",
      "MessageIndex": 86,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Apr 14, 2012 04:21PM kdking wrote: That is great news!! What a relief! I am going for my stress test on Tuesday. If that turns out ok and if the results of my MUGA are ok..we will try the Herceptin again.",
      "MessageIndex": 396,
      "PostDate": "14/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Mar 4, 2012 01:23AM - edited Mar 5, 2012 02:29AM by kdking I live in Orrville...ever heard of it..lol? Wrapping up my chemo treatments here soon. I have three TH to go. Started with twelve. Had a BMX with immediate DIEP flap reconstruction on Sept. 28, 2011. My surgery was done at the Cleveland Clinic main campus and I started chemo at the Wooster specialty center in November. Had 4 AC followed by Neulasta. Needless to say, November and December were very tiring months! Taxol and Herceptin started off a breeze now I am having the nail problems along with some neuropathy too. But with only three more to go...I am determined to finish! Then its off to rads. Nice to see others from the area on here!",
      "MessageIndex": 226,
      "PostDate": "04/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Mar 19, 2012 11:28AM kdking wrote: Thanks Judy! That is very encouraging to hear you went through the same thing and were able to finish your Herceptin. That what scares me the most...not being able to finish it. My onc doesn't have me seeing a cardiologist yet..but he is conferring with one and he is the one who suggested taking a break. My family is plagued with heart problems ( my dad died when he was 45) so I'm hoping this isn't a precursor to something more serious....you are right bc is enough! Thank you! Kerrie",
      "MessageIndex": 306,
      "PostDate": "19/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Mar 30, 2012 03:19AM kdking wrote: You will be happy with your decision Sarah! It makes things so much easier. Chemo is bad..no other way to put it...but you will get through it. I had very few problems. I'm on day four of radiation and actually fear that more than the chemo!",
      "MessageIndex": 348,
      "PostDate": "30/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "May 2, 2012 10:10PM kdking wrote: I started my rads 3 weeks after my last chemo. I had my first boost today. Only four more and I'm done with rads. Next we will concentrate on my heart and starting Herceptin back up hopefully.",
      "MessageIndex": 420,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Mar 6, 2012 02:53AM kdking wrote: Amen to that Titan! Tomorrow is #10 Taxol Herceptin for me! The first day of spring is my last chemo day..aside from the Herceptin every three weeks. It will be a beautiful day...even if it snows! (we are in Ohio)",
      "MessageIndex": 240,
      "PostDate": "06/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Mar 23, 2012 01:21PM kdking wrote: Finally got my water pill today...feeling some relief already. My muscles hurt though and I haven't been doing much. Maybe from Herceptin??",
      "MessageIndex": 320,
      "PostDate": "23/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Mar 27, 2012 12:48PM kdking wrote: Sarah..I've also \"had the book thrown at me\" or so I've been told. GET THE PORT!!!! You will be so glad you dd. I too had 4 AC tx followed by 12 Taxol with Herceptin. (that is put on hold for now). I start my rads tomorrow and am having four fields radiated. Which means they will be doing my back too. All this and I was still told only 1 in ten chance this will work?? Ugh! When I asked why they are going at this so aggressively I was told \"because you are so young\" And yes lumpy me..it was cold this morning...think tomorrow will be worse! Ugh again!",
      "MessageIndex": 331,
      "PostDate": "27/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Mar 5, 2012 02:41AM kdking wrote: Sarah, although my surgery was a little different from yours, trust me..it will look better. I'm five months out and still recovering. It takes time and patience! Just take it easy and it will get better! Wishing you the best!",
      "MessageIndex": 231,
      "PostDate": "05/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Mar 5, 2012 03:06AM kdking wrote: I was just at Triway Highschool last weekend! My daughter competed in a cheer leading comp. there. I am very into sports so I know all about your Triway Titans..lol. It is ironic that we live so close and are posting on these boards. I do see Dr. Masci. He is very nice and I just love all the nurses that do the chemo too. I would love to meet for lunch..Jakes sounds good! Anyone else get a lot of snow this evening? My kids are hoping for a snow day!",
      "MessageIndex": 233,
      "PostDate": "05/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Mar 26, 2012 03:07PM kdking wrote: Thanks for asking Jaytee! Looks like we are back to reality with the weather! I was getting used to the warmer temps...but hating the intense hot flashes that are increasing everyday?? I am wondering if my periods will return or will I just go into menopause?? I am feeling somewhat better with the racy heart..they are going to put a Holden?? Monitor on me for 24 hrs starting Wednesday morning. I was able to get a water pill script from my MO and that has helped the swelling in my hands feet and legs. Starting radiation tomorrow! Will have four fields radiated?? Didn't realize they will be zapping my back too. Can anyone relate to this? I have plenty of Aquaphor and went and bought some men's white tanks...I think this scares me more than the chemo did! Hope everyone has a good week! Munnybunni.... Having a port is a dream! Oh...I am growing some fuzz on my head!! Thick in some spots but very sparse in the bang area..kinda looks like my hubby's hair pattern!",
      "MessageIndex": 326,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Apr 8, 2012 06:13PM kdking wrote: The Neulasta shot is not that bad...just sleep it off..that's what I did. My whole body hurt!! But the first time is the worst. Claritin does help..but I also had to take vicodin to ease the bone pain.",
      "MessageIndex": 383,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Apr 22, 2012 03:41PM kdking wrote: Kelly, so sorry to hear about your sister in law! Glad she is doing better though. I am in my fourth week of rads. I have been pretty tired too! My advice...use the Aquaphor right from the beginning even when you think you don't need it. Drink tons of water, and keep your arm flexible. I have been the same stretches that I did after my BMX and that seems to help. Good luck!",
      "MessageIndex": 399,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Mar 19, 2012 07:29AM kdking wrote: Hello everybody! Hope you all are enjoying the lovely weather! I had a somewhat discouraging week. I had been having some heart issues after my last few Taxol and Herceptin tx. Every evening my heart would just start racing like crazy. So when I went in for my 11th tx..I was told no more chemo. I should be happy right?? So I had an echo the same day and found out that my heart function has decreased since my last one in Jan. so now they tell me.....no more Herceptin! That really scares me. We are going to wait six weeks and do another echo then. And we will see about starting the Herceptin back up then. I've only had 10 weekly tx and have until November to go with the Herceptin. Has anyone else experienced this?",
      "MessageIndex": 304,
      "PostDate": "19/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Mar 22, 2012 01:24PM kdking wrote: Titan...awesome!! I love college basketball! I'm cheering for Ohio U! That's where I went. Hope everyone has been enjoying the weather! I feel like a swollen cow! I don't know what is happening! I'm hoping for a water pill or something. I start my rads Monday!",
      "MessageIndex": 316,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Mar 29, 2012 09:34PM kdking wrote: I was unable to drink anything hot during my AC tx. Grape Crystal lite tasted sooo good. Had to have at least one diet Pepsi each day to kill the caffeine headache. I love coffee!",
      "MessageIndex": 344,
      "PostDate": "29/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Mar 31, 2012 02:40AM kdking wrote: Two weeks did it for me too. My work friends had a benefit for me on Nov. 18 th and my hair started coming out in clumps the next day! I let my girls use the clippers on it at first..they gave me a beautiful Mohawk! I let my DH shave it on thanksgiving. I am now three weeks past my last Taxol and I have a nice Fuzz growing. It is very thick in most places(it was before) and seems to be thin in the bang area. Still wear my scarves everywhere. I never did wear a wig. Losing my hair didn't really bother me like I thought it would....losing my eyebrows and lashes sucked!",
      "MessageIndex": 352,
      "PostDate": "31/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "kdking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137935/profile",
      "Content": "Oct 21, 2011 05:07PM kdking wrote: mariar..I know exactly how you feel.  I have already made it through my BMX and DIEP reconstruction and I am feeling pretty good. My first chemo treatment is Nov. 8th.  Everything you hear about survival is in 5 yr.and 10 yr survival rates.  I am 36 years old with 2 young daughters...I don't want to think about 5 or 10 yrs.  I want to see my family grow.  That is what makes me soo sad.  Its not the fear of chemo or the 17 hour surgery I had..it's the not knowing whats ahead.  I'm glad I'm not the only one who just randomly bursts into tears!",
      "MessageIndex": 1,
      "PostDate": "21/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/776821",
      "Title": "stage 3a breast cancer survivors mariar Icandoallthings"
    }
  ]
}