{
  "AuthorID": "Kds72",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231702/profile",
  "Posts": [
    {
      "AuthorID": "Kds72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231702/profile",
      "Content": "Kds72 wrote: I had a core needle biopsy in December, the results showed a fibroadenoma. That's all that I was told, and I never received any paperwork in the mail showing the results. Here is a little background: I am 43. In December of 2014, I had a mammogram which showed dense breast tissue, and also showed something questionable, so I had an ultrasound. The radiologist told me that he couldn't tell what it was, but that he couldn't be sure that it wasn't malignant. The night after the ultrasound, a lymph node swelled up in my armpit so big that I couldn't lower my arm. Within the next month, I began to have a weird pain, sharp, grabbing, achy, heaviness, in the area where they had seen something. I reported to my PCP, and was referred to a breast surgeon. The surgeon tried unsuccessfully to order an MRI, but the insurance wouldn't pay. Finally, in December of 2015, I was scheduled for the core biopsy. During the entire year, I continued to have the same problems with that spot. It was daily, and almost constant. The biopsy, as I said before, showed a fibroadenoma. Last week, I saw the breast surgeon again, because the pain is still there, and something still doesn't feel right. She admitted that the fibroadenoma is in a spot that they never could feel it well, or couldn't actually see it on any scan. She then assured me that if it were BC, it wouldn't hurt. I am still having recurring swollen nodes in the armpit on that side. My question is, should I just ignore this, or should I push for an excisional biopsy, to make sure that it isn't something serious? Everything that I have read about fibroadenomas mentions nothing about them affecting the lymph nodes. WWYD? Also, sorry for the long post. KSpicer Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/843402",
      "Title": "Fibroadenoma? Or something else? Kds72 Kds72"
    },
    {
      "AuthorID": "Kds72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231702/profile",
      "Content": "Apr 13, 2016 10:39PM Kds72 wrote: Thank you for your reply. I have always had trouble talking to doctors, and am always reluctant to 'rock the boat', so to speak, but this has been bothering me for so long that I finally decided that I needed advice to help me decide what to do.",
      "MessageIndex": 2,
      "PostDate": "13/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/843402",
      "Title": "Fibroadenoma? Or something else? Kds72 Kds72"
    }
  ]
}