{
  "AuthorID": "kdw877",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52860/profile",
  "Posts": [
    {
      "AuthorID": "kdw877",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52860/profile",
      "Content": "kdw877 wrote: Hi all, to those who have helped with words of wisdom and support, I want to say thank you. My doctor's office called and said they wanted me to come in for my Post-Biopsy check-up Monday and she also said my results we B9. She didn't say to much other then Fibrocystic Changes and I'll get the full report monday. I am so happy, that I just started crying, but the worry wart in me still has doubts. I mean my lumps were hard and my breast is larger, so I guess you can't help but wonder, but thank the lord, hopefully no mistake was made and those results are mine. I will continue to come here, as I said before, this experience has changed my life and I will have the full report Monday to share. Thanks for the prayers, it's hard going through a tough time with no support system, but the advice here, helped ease my nerves. Also, I just had my Biopsy done Monday morning, so does two days, seems too early for my results? God Bless To All... Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/662104",
      "Title": "B9 Results kdw877 kdw877"
    },
    {
      "AuthorID": "kdw877",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52860/profile",
      "Content": "Jul 25, 2007 05:07PM kdw877 wrote: I will. I have only had two mammorgrams and two ultrasounds, so I will get the reports from both of those for my records and my path report. Thanks for the advice and the congrats guys, I really appreciate it.",
      "MessageIndex": 6,
      "PostDate": "25/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/662104",
      "Title": "B9 Results kdw877 kdw877"
    },
    {
      "AuthorID": "kdw877",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52860/profile",
      "Content": "Jul 8, 2007 10:39PM kdw877 wrote: Also he is a general surgeon, not a breast surgeon, but is highly recommended and he also done my gallbladder surgery, so I am familiar with him. Should I see a breast surgeon, we live in a crap town, that dosen't even have a cancer treatment place.",
      "MessageIndex": 1,
      "PostDate": "08/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/650337",
      "Title": "Scared To Death kdw877 Valsul"
    },
    {
      "AuthorID": "kdw877",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52860/profile",
      "Content": "Jul 9, 2007 01:18PM kdw877 wrote:",
      "MessageIndex": 6,
      "PostDate": "09/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/650337",
      "Title": "Scared To Death kdw877 Valsul"
    },
    {
      "AuthorID": "kdw877",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52860/profile",
      "Content": "Jul 10, 2007 04:53PM kdw877 wrote: My mother and sisters didn't die from Breast Cancer. They died from other things. The thing with the lymphnode is, it was never discussed with me during my test. I was curious about my report and asked for one and I read on the report that there is a lymhpnode in my Left axillary region. It didn't say if it was swollen or not. They never discussed the report with me, they only sent me a letter teeling me I am Cancer free. What I'm concerned with is the Asymetry of my breast, the lump in it and the lymphnode. That is why I'm freaking out, cause it dosen't look good. I think I will be one of the ones, that M/U sound dosen't pick it up, cause of my dense breast and FBD, but so far, no mention of an MRI. The lump seems firm to me, although, there is more then one. That is what has me so frustrated, cause I don't understand why, if there is a lymphnode present, they wouldn't send me for an MRI.",
      "MessageIndex": 9,
      "PostDate": "10/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/650337",
      "Title": "Scared To Death kdw877 Valsul"
    },
    {
      "AuthorID": "kdw877",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52860/profile",
      "Content": "Jul 12, 2007 06:10PM kdw877 wrote:",
      "MessageIndex": 7,
      "PostDate": "12/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/652093",
      "Title": "I am Pleased to say... ccccccc ccccccc"
    },
    {
      "AuthorID": "kdw877",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52860/profile",
      "Content": "kdw877 wrote: Hi Everyone, a little bit of information about me. I am 29 Years old with an 8 year old son and Two years ago, I found a lump in my breast. I had Mammo/Ultrasound and a clear report and a letter from the radiologist saying it wasn't cancer. My OBGYN said it was a cyst and that I had Fibrosistic Breast Disease, which make my breast lumpy. Nothing else was ever mentioned about the cyst, no needle asp.. nothing. I wasn't told to keep an eye on it. Well a year later went back and it was still felt, but nothing done. Now here it is Two years later and finally I went for a follow up Mamm/Ultrasound, which is confusing to me. I got the report this time, not last time (which I should have) and this one said, There is a moderate density of breast Parenchymal in somewhat asymetrical pattern. There is a lymph node in left axillary region. No abnormal calicifications. Ultrasound recommend - nonspecific asymmetry of breast density. Then my ultrasound only on the place that they lump is felt, he wouldn't do the whole breast, but it says, infeior aspect of breast does not reveal evidence of mass or abnormal fluid collection. Negative Breast Ultrasound. Then I get my certified, no cancer finding letter. So I decided to go to a surgeon, who felt it and said, he does feel it and said to lay off caffeine for two weeks, then come back. I am beyond stressed. I'v been so sick to my stomach, having nightmares that it's breast cancer, and non stop crying, cause it's like all the signs are there, but I overlooked them. For one, my left breast has always been somewhat larger, and I'v put on weight in the past two years, plus got poison oak and had to take steroids for a month and I just thought my breast change was FBD like they said and from gaining weight. He also said the lymph node is common, I am scared to death, cause he acted as if it's nothing and a lymphnode scares me and now, i think my nipple looks different, why didn't I notice before? I know it's cause my age and the fact that my M/U were cleared, that he made me wait, but I really think it's cancer. I don't have a support system, no close friends, no money, no insurance. My mother and both sisters have passed (Not from breast cancer) noone in my family has it, or has had it, but it dosen't look good. I have my son, my boyfriend, and Dad and I am his only kid left and my surgeon, I think he is not wanting an mri done and my dense breast along with FBD makes it hard to get a reading on a M/U dosen't it. Please some advice.. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/650337",
      "Title": "Scared To Death kdw877 Valsul"
    }
  ]
}