{
  "AuthorID": "kel1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52171/profile",
  "Posts": [
    {
      "AuthorID": "kel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52171/profile",
      "Content": "Oct 13, 2010 12:56PM kel1 wrote: Melinda,  You hit the nail on the head...and BonnieK, I'm right there with you. There is no 'blessing' attached to breast cancer.  Let's get real, if we lived the way we are supposed to, we shouldn't need cancer to make us pay attention to our lives!   After 14 years of mammos, one radiologist blew off a 'little suspicious area' that turned out to be nothing until the day I found the 9 cm lump a few months later.  I HATE pink...was diagnosed in April, but yep, after chemo ended up having my Mastectomy in October, no less!  And only 3 weeks before my 50th birthday!  So now, year after year, I have to endure the constant reminder of the pink scourge, and how I continue to work toward a world where pink is once again a reminder of baby girls and valentines...not the 'romanticized' version of an absolutely horrible disease that kills and disfigures way, way too many of us.  Pink schmink... thank you Melinda for writing what I feel each and every October.  If we spent all that $$$ on research and not marketing, on preventative maintenance for all women and not jewelry, on education and not scarves for our bald heads, imagine a world...where women could live without the pain of breast cancer.",
      "MessageIndex": 28,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/759281",
      "Title": "My pink problem Melinda41 daffodil45"
    },
    {
      "AuthorID": "kel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52171/profile",
      "Content": "May 26, 2010 11:49PM kel1 wrote:  I'm 2 years ahead of you with a VERY similar diagnosis...and I still have pain in the ribcage area.  For me, it's the rads SE that have never gone away, just lessened over time.  Some days worse than others.  I have bone scans yearly and have been NED for 3 yrs. now!  Here's praying for a clean scan tomorrow for you.",
      "MessageIndex": 7,
      "PostDate": "26/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/753166",
      "Title": "Pain/discomfort on radiated side (ribs?) when waking up bejuce AnacortesGirl"
    },
    {
      "AuthorID": "kel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52171/profile",
      "Content": "Feb 8, 2009 11:46PM kel1 wrote: Janet, There is a law in place, happened after Pres.Bill Clinton's mother had BC, that ins cos. are obligated to pay for prophylactic mast.  Twists in the law usually require reconstruction on the CA side with mast. on the healthy side so reconstruction will match. Take names, get everything in writing, be prepared to fight...ins cos usually respond well to an informed patient that is reasonable(not crazed & screaming over the phone like me!) Be creative in your approach.  Most of all, stay on them daily...your peace of mind is worth a few days/weeks of 'badgering and begging'.  Keep asking for the next level of decision maker...in short, don't take no for an answer.  And keep your docs working on the requests too.  Every little bit helps!  Good luck...",
      "MessageIndex": 13,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/728596",
      "Title": "I am soooooooo ANGRY!!!!! auroravtj mikita5"
    },
    {
      "AuthorID": "kel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52171/profile",
      "Content": "Nov 18, 2009 05:07PM kel1 wrote: CKA, If I've learned anything in the last 2 years since my treatment, rads, surgery, more treatment...it's been that every day is different.  And sometimes, the longer I'm away from drs. & hospitals, the more vulnerable I feel.  Most days I'm reasonably fine, grateful for making it 2 years.  But some days I'm a mess, grieving for my life, my body, my 'normal'.  When those days come, even 2 years later, I embrace the grief then shed it like an old skin, in order to keep learning and dealing with the 'new normal.'  And I work hard not to live waiting for this horror to return, even though I'm stage 3 & my onc. didn't say if...hr said when.  I work hard just to live fully. If I need to cry, I cry.  If I'm especially tired for no obvious reason, I show myself some grace and even nap. If I get sick of broccoli, I eat ice cream. I don't know if we ever stop dealing with our emotions & the grief from this disease.  I just know we have to keep moving forward. Cammy, I'm praying your surgery goes well.  Be kind to yourself. Kelli ",
      "MessageIndex": 11,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/743773",
      "Title": "Been handling this ... until today cka0706 kel1"
    }
  ]
}