{
  "AuthorID": "Kel823",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111188/profile",
  "Posts": [
    {
      "AuthorID": "Kel823",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111188/profile",
      "Content": "Jan 19, 2011 05:31AM Kel823 wrote: Thanks Marie, I know I shouldn't get my hopes up too much but I'll probably sleep a little easier tonight thinking that the chances are at least good that everything is fine :) I didn't ask for one, didn't know that I could lol. I was completely in a panic though, so I probably wouldn't have even thought of it if I had of known. My doctor should have them no later than next week though, and she's usually pretty good at giving me copies if I request them.",
      "MessageIndex": 2,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/763572",
      "Title": "Mammo + Ultra sound done today Kel823 Kel823"
    },
    {
      "AuthorID": "Kel823",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111188/profile",
      "Content": "Kel823 wrote: Hello everyone! Not sure if anyone remembers me, I posted here a few months ago flipping out because I found a lump right behind the nipple. Well today I had to get the mammograph done, followed by an ultra sound. The mammograph came and went, surprisingly it wasn't that bad. The ultra sound took a little longer because of the location of the lump. It was tough for the technician to get a clear shot at it. I was watching her, but I couldn't tell by the look on her face if she was seeing something worrysome, or just focused on getting the images. Then she says that she is taking them back to the radiologist (sp?) because she's unsure if the pics are clear enough, and the radiologist will probably want to come look for herself. 5 minutes pass, and then the tech comes back and tells me I am free to go and my doctor will have the results in about a week. Is it a good sign that the radiologist didn't need to come look at it? I kind of feel like if it was something serious, she'd want to come get a better look, but on the other hand maybe that doesn't mean anything. Hopefully this is all over next week, it's been 2 months of sheer heck for me :( Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/763572",
      "Title": "Mammo + Ultra sound done today Kel823 Kel823"
    }
  ]
}