{
  "AuthorID": "keldee303",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64393/profile",
  "Posts": [
    {
      "AuthorID": "keldee303",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64393/profile",
      "Content": "keldee303 wrote: I'm brand new here, but I discovered this site because my mom uses it.  She happened to leave a paper on the computer table with the url. She was diagnosed in November and she's just started chemo.  I've been having some problems, but I never paid it much mind until she insisted on monthly breast exams.  I've been feeling a small lump almost under my arm, but closer toward my left breast.  It feels deep, almost undetectable, except that I've noticed that area keeps getting scaly and flaky.  Also...every once in a while I get a sharp stabbing pain from my nipple to my underarm.  Although lately I've been under a ton of stress and that spot and the area around it feel almost like a boil or something.  It doesn't always bother me, but if I press on it my entire underarm area throbs and hurts.  I don't know what it is or what to do about it.  I told my ob-gyn that my mom had just been diagnosed with breast cancer and that I've been having some issues, but she never did a breast exam or paid any mind to it.  She just said that I'd have to start my mammograms at the age of 37 rather than 40.  I'm only 26 now.  I have no insurance and I go to the free clinic as it is.  So I don't have the best medical assistance.  I don't want to add any extra stress to my mom.  She's already going through her own problems, and then her mother (my Mawmaw) had a stroke last week and is still in the hospital.  So no one needs me to suddenly have ...or suddenly address these kinds of problems.  I know I should worry about me, but I'm more worried about them and how much more we can take on our plates this year. What should I do?  Should I just go get it checked and maybe not tell anyone?  And if there is a problem just take care of it without them knowing?  I feel really torn about it. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/702289",
      "Title": "Not sure what to do... keldee303 anniee"
    },
    {
      "AuthorID": "keldee303",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64393/profile",
      "Content": "Mar 17, 2008 10:46AM keldee303 wrote: Thanks.  I'll do that.  I go to the health clinic regularly for other things and they suggested putting me on medicaid.  I may wait for that in case it is something that would require much medical attention.  Cuz then I would get to see my regular OB-GYN...which would make me very happy.  And I told my mom, but I told her that its probably nothing and I read more about signs and symptoms and it does sound more likely to be a cyst, which I've had before in my ovaries and uterus.  I hope so.  I just didn't want to tell her the day that I found it.  It was her birthday.  I can't keep things from her for very long anyway.  She kept seeing me rub that spot and then make an uncomfortable face.  She watches me too close sometimes. lol.",
      "MessageIndex": 4,
      "PostDate": "17/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/702289",
      "Title": "Not sure what to do... keldee303 anniee"
    }
  ]
}