{
  "AuthorID": "Kelly321",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195997/profile",
  "Posts": [
    {
      "AuthorID": "Kelly321",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195997/profile",
      "Content": "Feb 7, 2014 10:12AM Kelly321 wrote: thank you for your replies. I haven't searched the internet because I have been too scared. I have been reading and I feel slightly calmer. The fact that there is two is a good sign right? I have promised myself not to touch the area at all this weekend and see my doctor first thing Monday, I need to overcome my fears, I don't know why I dislike the doctors. After all they are their to help you.  Kelly ",
      "MessageIndex": 7,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817777",
      "Title": "Round lumps Kelly321 Kelly321"
    },
    {
      "AuthorID": "Kelly321",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195997/profile",
      "Content": "Kelly321 wrote: where to start?  I had a lump in May 2013 it was round and squishy, I had an ultrasound and nothing was found. The lump actually went away, i have since been obsessed with checking my breasts everyday and in October found two small round hard balls. And also a smaller one that's not so hard next to them. I have bruised my right breast because I am constantly checking. They do move and are smooth. They are about half a cm? And next to each other. I am suffering with my emotions and I am too scared too see the doctor, I know this sounds crazy but I have panic attacks thinking about it. It's starting to have a huge impact on my life now and I haven't been out of the house for over a month. I try and not touch them but it's become an obsession.  Which leads me here.  I am silly I know I am but I don't know what to do. Kelly  I am 32 years old  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817777",
      "Title": "Round lumps Kelly321 Kelly321"
    },
    {
      "AuthorID": "Kelly321",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195997/profile",
      "Content": "Feb 7, 2014 05:47AM - edited Feb 7, 2014 05:48AM by Kelly321 thank you, I need to see my doctor I know I do. I have four children and my partner has been doing school runs and working full time. I just can't understand how my ultrasound was clear in the May and then in October literally over night two hard lumps appeared.  I will make nw appointment first thing on Monday and see my doctor because I can't keep living like this. ",
      "MessageIndex": 2,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817777",
      "Title": "Round lumps Kelly321 Kelly321"
    },
    {
      "AuthorID": "Kelly321",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195997/profile",
      "Content": "Feb 7, 2014 09:42AM Kelly321 wrote: are cysts hard though? I have had two hard lumps since October and they haven't gone :-(",
      "MessageIndex": 4,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817777",
      "Title": "Round lumps Kelly321 Kelly321"
    },
    {
      "AuthorID": "Kelly321",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195997/profile",
      "Content": "Feb 9, 2014 01:01PM Kelly321 wrote: I just wanted to say the thing has happened to me. Popped up one night did the pesky little things, I have three of them, I have been totally depressed since October and only now going to see my doctor next week, they are like little marbles that move when I touch them. I think they are cysts. ",
      "MessageIndex": 15,
      "PostDate": "09/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817816",
      "Title": "Can cancer lumps suddenly appear overnight? cgood75 ddbaker"
    },
    {
      "AuthorID": "Kelly321",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195997/profile",
      "Content": "Feb 9, 2014 01:22PM Kelly321 wrote: mine are bottom near the sternum. About 0.5 cms? Some days they feel firm and other days rock hard. I had a cyst in September and ultrasound, but it showed nothing. So I don't think a cancerous lump would have grown in one month, when I found them in October. If so at the growth rate in one month then I assume they would be massive right now. I hope your ok :-) and try not to worry about it ",
      "MessageIndex": 17,
      "PostDate": "09/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817816",
      "Title": "Can cancer lumps suddenly appear overnight? cgood75 ddbaker"
    }
  ]
}