{
  "AuthorID": "Keller27",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286188/profile",
  "Posts": [
    {
      "AuthorID": "Keller27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286188/profile",
      "Content": "Keller27 wrote: Hi everyone, My mom had stage 1 TNBC with no lymph node involvement in 2014. Almost 5 years later, we just found out this week that she has reoccurrence stage 4 metastatic to bone and lung. Our family is absolutely devastated. She is completely healthy, 56 and has no symptoms. I am only 25 and do not know what I would do without her. Her oncologist is planning to start her on Tecentriq and abraxane next week. I was wondering if any of you had similar stories with Mets to bone and lung? What your treatments were? Also if any of you have had abraxane and Tecentriq? Any information would be greatly appreciated! Praying for all of you and your families 🙏🏻 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870110",
      "Title": "TNBC METS to lung & bone. Abraxane tecentriq tx Keller27 Moderators"
    },
    {
      "AuthorID": "Keller27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286188/profile",
      "Content": "Mar 2, 2019 10:34PM Keller27 wrote: This is just what a I needed to hear! This gave me some relief.Thank you so much! Yes they did a biopsy of a mass that showed up in the subcutaneous skin of her back (they said it was a very atypical presentation). They also biopsied a new lump found in her breast and that is still pending. How were your side effects for abraxane? I will make sure she has an antiemetic. Thank you again! I truly appreciate it.",
      "MessageIndex": 3,
      "PostDate": "02/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870110",
      "Title": "TNBC METS to lung & bone. Abraxane tecentriq tx Keller27 Moderators"
    },
    {
      "AuthorID": "Keller27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286188/profile",
      "Content": "Mar 2, 2019 10:42PM Keller27 wrote: Hi Pippy, She had a superficial lump in her right lower back since December, which 4 doctors said it was a lipoma. It looked just like one- not their fault at all. And also very atypical location for cancer to pop up. Then just two weeks ago she found a lump in her breast. She saw her doctor and they did a punch biopsy. Then I told her let’s just get that “lipoma” taken out too while we’re at it. Much to our surprise that biopsy came back the very next day as metastatic cancer, triple negative. Then the breast cake back as the same. This past week she’s had a CT and bone scan showing just one mass in her lung but it is 3.4 x 2.7 cm. Pretty big unfortunately. This scares me. The bone scan showed a mass in her femur humerus. They did not provide a size. I am worried about her brain as she complains of some vision symptoms and that has not been scanned. So i insisted on her getting just to be sure just sure. We will find out those results next a week. Hoping and praying for good news 🙏🏻🙏🏻  She has her ups and downs. She is very worried and of course just keeps thinking of us and doesn’t want us to go through this. She is an amazing, selfless person. She has so many people who love and support her. Her oncologist and providers at the scans must think we’re crazy because she has a whole entourage for every appointment. It’s becauae we know she would never miss anything for us and would be there in a heartbeat.",
      "MessageIndex": 4,
      "PostDate": "02/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870110",
      "Title": "TNBC METS to lung & bone. Abraxane tecentriq tx Keller27 Moderators"
    },
    {
      "AuthorID": "Keller27",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286188/profile",
      "Content": "Feb 23, 2019 02:31PM Keller27 wrote: hi there! My mom was diagnosed with TNBC in 2014. She had lumpectomy chemo and radiation. Just this past July (7 months ago) she had a mammo that was perfect and this past August (2018) she was also diagnosed with sjogrens. Then she noticed a bump in her right lower back that all doctors thought was a lipoma. She just had a lump pop up in her breast (not the breast with original cancer) this past week. She had a biopsy of the breast which is pending and the lump from her back removed and sent to path. The lump from her back came back positive as cancer most likely metastasis from her TNBC. We are devastated. Her pet scan isn’t on Monday. Two things: I wonder if sjogrens could be related? What pathways were affected for you? Also was wondering if any of you had red flags in your blood work or any symptoms before you were diagnosed with TNBC metastasis?  Thank you so much  ",
      "MessageIndex": 13,
      "PostDate": "23/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782201",
      "Title": "Metastatic TNBC - any survivors? rahimaw Bestbird"
    }
  ]
}