{
  "AuthorID": "kellyless",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
  "Posts": [
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "Jul 17, 2009 10:28AM kellyless wrote: My first Taxol I had a lot of numbness in my hands, so on Taxol #2 my doc had me put my hands in an ice bath during the infusion - about 2 1/2 hours (don't need to do it during pre-meds, just when they start the Taxol)  and it worked like a CHAMP.  I never had anything more than a slight tingle in my fingers after that, while my feet just kept getting number.  I did the ice bath the last 3 Taxol's and it really worked.  My fingernails continued to come more and more unattached, but never to the point that I lost one, and they never turned black like some folks do.  I highly recommend the ice bath!",
      "MessageIndex": 3,
      "PostDate": "17/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737554",
      "Title": "Suggestions for dealing with Taxotere and my hands wenmazb dlb823"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "May 14, 2009 09:44PM kellyless wrote: Can I get on this list?   Kellyless - 3/06/09 - AC x 4 dd, T x 4 Looks like chrisc433 & Ann-Idiot are right there with me if they've stayed on sked. ",
      "MessageIndex": 2021,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "Jun 3, 2009 03:13AM kellyless wrote: Marshall2000 - I had convinced myself that Taxol would be WAY better than A/C - way to set myself up for utter disappointment and failure!  It is better, but it still SUCKS.  The night of my first treatment the hot flashes started nonstop - with ovary pain.  It's thrown me into to total, instant menapause.  The bone pain is awful for days, between the pain and the flashes I have about 4 or 5 nights after each treatment of lousy sleep.  My hands, feet and face went numb as well.  My onc had me put my hands in an ice bath for Taxol number two for the entire 3 plus hours of the infusion - and it worked!  My feet & face continue to get numb and tingly, but the hands don't.  I only have ONE MORE CHEMO.  I can't wait until I can so NO MORE CHEMO.    My doc put me on the anti-depressant Effexor for my \"mood\", which got dark after the first Taxol, and also to help the hot flashes.  It definately helped lift the black cloud that had decended after about 2 weeks - not so much the hot flashes, tho.",
      "MessageIndex": 2301,
      "PostDate": "03/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "May 12, 2009 10:32AM kellyless wrote: I'm sitting here CRYING reading this.  My buddy started this thread, and sent me the link to look at it.......I was reading from the top and feeling so depressed that everyone said chemo wasn't so bad, that the anticipation was the worst - and thinking - WELL THEN WHATS WRONG WITH ME????  Then I read Katalin's replay and I just started boo-hooing - that's ME.  I've had 4 rounds of AC & one Taxol and I'm so incredibly miserable I could just curl up in my closet in the fetal position and NEVER COME OUT AGAIN.  I was very sick on AC, and constipated beyond belief - until I also found that MOM was the only cure.  I was so hopeful that the Taxol would be \"better\" and that I would just be able to finally just carry on after a treatment.  It was so not so - I'm once again miserable, barely able to function - the AC nausea went away, but I'm wracked with bone pain, tingling fingers, feet & face - my nails are changing colors already.  I feel so detached from the real world I can hardly stand it.  And the hot flashes!  The night I received the Taxol they started, HUGELY.  I'm 45 and was pre-menapausal - and now I'm woken all night with hot flashes - I have them by day as well.  Drenched in sweat and miserable.   I'm taking pain pills and they do help - but they wear off.  I had emailed my doc Monday about the hot flashes and she called me.  She said \"I noticed on Friday that you also seem to be having a problem with your mood?\"  THAT made me laugh (probably bitterly) and I said why yes - all this misery and loss of quality of life is finally affecting me for sure.  She prescribed the anti-depressant Effexor - and it is also supposed to help with the hot flashes.  I've been on it a few days and I think last night I had fewer flashes - but I know I'm still depressed.........or this thread wouldn't have made me burst into tears!",
      "MessageIndex": 9,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/733975",
      "Title": "What we wish we had known about chemo before we started! ddlatt kerry_lamb"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "May 14, 2009 08:56AM kellyless wrote: It helps me enormously to hear that I'm not the only one that feels this way!  I agree - I hate the question \"how do you feel?\"  and I think my husband does, too.  And I ALWAYS get \"well, you look GREAT!\"  That is total bull@#*^   !!  I'm bald, I'm pasty - my eyelashes and 3/4 of my eyebrows are gone - seriously.  I LOVE the analogy \"slug that someone poured salt on\"  So perfect.  And thank you all so much for the Effexor XR feedback - I have my 2nd Taxol tomorrow, and am going to ask my doc to double my dose.  I need some freaking relief!  I am one month away from my final chemo.......that sounds so far away, yet so close when I think of how long this has been going on - FIVE MONTHS of shear, unadulterated hell.  My birthday was yesterday, it was nice that so many people popped up to send emails, phone calls, cards, etc - at least almost all of them said \"I know this is the WORST BIRTHDAY EVER for you, just hang in there - think of next years, it will be worlds better!\"  Hopefully I won't feel this old again on my birthday until I'm 80. ",
      "MessageIndex": 21,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/733975",
      "Title": "What we wish we had known about chemo before we started! ddlatt kerry_lamb"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "May 13, 2009 11:38AM kellyless wrote: First - I'm grateful to my friend Deb that started this thread.  She and I have stayed in close touch since I found her thru our blogs - and I think she's felt me shrinking in on myself...She sent me this link - I'd never been to this site.  When I first found my lump on Xmas eve I started hunting around the internet and communicated with some women on another site, but I stopped shortly after my surgery - when I started my blog - because I was just so overwhelmed indeed.  But I am a person like KMMD - I need information, the more the better.  But somehow I had fooled myself about the Taxol, wishful thinking that I would be \"better\", becauase the A/C was so intensly horrible for me.  Over the last few weeks I've just withdrawn, as my grandma used to say \"chewing my paw\".  I don't want to talk to anyone, I haven't updated my blog since before the Taxol - I read, rest, watch TV and feel detached from the world.   It was actually very good for me to get so worked up yesterday - I hadn't cried in a long time.  I find it hard to describe how I feel - the world BLEAK comes to mind.  I'm aware of it now, but that doesn't mean it changes how I feel.  I have 3 more Taxol every two weeks - this Friday.  It just gets harder and harder to go do it, doesn't it?  It's like killing yourself slowly - and you aren't the least bit suicidal!   THANK YOU MY3GIRLS!  I haven't found anyone I know that has taken Effexor, so I could use some encouragment!  She put me on 37.5 mg's - I feel a slight improvement on the hot flashes, don't know about the depression - but I think that's too low of a dose, I'm going to ask her about it Friday.  I'm certainly willing to try most anything at this point to get myself better, I feel terrible for my husband and teenage son having to live with me!  I feel like a sad sack of worthless nothing.  Since my eyelashes fell out I don't even want to see myself in the mirror, either.  And I swear I'm not a vain preson! UGH - it just feels so overall awful.",
      "MessageIndex": 17,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/733975",
      "Title": "What we wish we had known about chemo before we started! ddlatt kerry_lamb"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "Aug 3, 2009 09:36PM kellyless wrote: found lump 12/24, surgery 1/30, started chemo 3/6.  Your biopsy should have told them the nature of the cancer - most are slow growing, especially hormone positive it seems.  My biopsy failed, so I didn't know until surgery that it was a triple negative, grade 3 aggressive type of tumor - so not slow growing after all.  It was still almost 6 weeks before I started the chemo, which was just the time frame my oncologist wanted. ",
      "MessageIndex": 4,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738091",
      "Title": "is 4 months from find to chemo acceptable? leslie43 ipursuit"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "Jun 2, 2009 10:06PM kellyless wrote: My onc says NO black cohosh, and I'm triple negative.  Someone mentioned birth control pills which are a BIG no-no.  I'm doing the Effexor 75mg as well - for my \"mood\" as well as the flashes.  I don't think I can judge it until I finish my last Taxol - the night of my treatments are non-stop hot flashes, for about 4-5 nights - then they get less as I get further from treatment.  I'm hoping that when I can get more than 2 weeks away from a Taxol treatment they'll continue to wane...here's to hoping!  What a weird experience to be thrown into menapause in one damn day!  I want my hair back so bad, someone said she feels \"trite\" when there are such bigger worries - she voiced my secret thoughts....I'm a petty person worrying about my hair when I'm trying not to DIE here....but DAMN I WANT MY HAIR BACK.  And my eyelashes.  I'm a bit distraught to here they can keep falling out over and over again!",
      "MessageIndex": 2216,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "May 14, 2009 03:53PM kellyless wrote: I covet Suz45's short grayish hair and short eyelashes.  I even want my leg hair back!",
      "MessageIndex": 1928,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "Jul 15, 2009 05:42PM kellyless wrote: My last chemo was 6/12 and I have about 1/4 inch of the mostly colorless fuzz all over.  If you close your eyes and pet it, it feels kind of like a soft gerbil or something.  My goal is to have enough to dye and go hat/scarf/wigless at the first high school football game 8/29 - very ambitious, I know.  I'm in Dallas so it'll probably be 107 degrees that day, so if I just have enough to cover the scalp I'm going for it! The weird eyebrow stubble is just starting to show up as well - thankfully it seems to be dark from the get go, and not this weird colorless stuff that's on my head.  The loss of eyebrows & lashes makes me feel so patient-y.  Kathya0814 - I've not heard of radiation slowing anyone's hair from coming in.  I did my 3rd of 33 treatments today, no one has mentioned it affecting hair growth.  And I showed my fuzz to my radiation onc on Monday - I know she would've said something!",
      "MessageIndex": 2818,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "Jul 17, 2009 01:32PM kellyless wrote: I have that same sort of grayish/colorless baby hair like you have Jamie!  If you dye it let me know how it goes.  I'd like to do that as well, but wonder how this weird fuzzy hair will react to dye.  I'm starting to feel some more brisly hairs popping out amongst the fuzz, hope it's some dark, real hairs.....",
      "MessageIndex": 2834,
      "PostDate": "17/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "Jun 4, 2009 08:03AM kellyless wrote: I would get the BRCA test BEFORE my surgery - if you have the gene you might opt for mastectomy over lumpectomy.  Taking the test is a gift to your family as well, most likely you DO NOT have the gene (most of us don't) so that would put their minds at ease that it's not hereditary.  In the off chance that you do carry it - they can use that information even more, and it might save lives! ",
      "MessageIndex": 4,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/735278",
      "Title": "Getting Close to Surgery and a little anxious BlessedOne2 BlessedOne2"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "Aug 3, 2009 02:15PM kellyless wrote: I used a \"womens\" razor, with blades, before all of this.  Since my pit hair has grown back from chemo ending I've found that my husbands Mach 3 razor works way better on my numb armpit.  I can just gently move it across the area with no pressure and it shaves those hairs right off!  With the womans razor I have to apply some pressure, and that seems like a bad idea.....",
      "MessageIndex": 5,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/737667",
      "Title": "Shaving meganandrileysmom moogie"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "Jun 5, 2009 12:21AM kellyless wrote: Also - my onc says NO VITAMIN E during chemo, she wants me to start taking it when I'm 2 weeks post, final chemo.  There's quite a list she doesn't want me taking during chemo (black cohosh, etc) so don't start any herbs and vitamins without asking first.  She did put me on B6, some peeps take B complex I think. ",
      "MessageIndex": 11,
      "PostDate": "05/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735177",
      "Title": "Does everyone loose their hair during TC chemo myagirl Sharon648"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "Jul 23, 2009 05:33PM kellyless wrote: I think you should speak to the genetist about this as well, since you are BRAC+ - as that may carry some weight in the decision.  Will you be having a hysterectomy, too?  It seems to me the genetist told me if my test had come back positive her recommendation would be mastectomy & hysterectomy due to the ovarian cancer risk.  If you are choosing to not have the hysterectomy, they may want you to have the stronger AC to lesson the ovarian risk?  Just a guess there, but the genetics involved are probably quite an important factor that many of us don't understand because we didn't have to! Choosing your treatment is one of the worst, most stressful times in treatment.  I felt like I was making life or death medical decisions without benefit of medical school!  You have some time, so keep at the questions & research, and I bet the answer will come to you - there will be a time when you start feeling sure of the right answer.  Have faith in yourself!   ",
      "MessageIndex": 6,
      "PostDate": "23/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737864",
      "Title": "Chemotherapy Treatment AC versus TH manue manue"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "Jun 5, 2009 12:17AM kellyless wrote:",
      "MessageIndex": 10,
      "PostDate": "05/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735177",
      "Title": "Does everyone loose their hair during TC chemo myagirl Sharon648"
    },
    {
      "AuthorID": "kellyless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83632/profile",
      "Content": "Jun 4, 2009 04:28PM kellyless wrote: Milkshakes, mac & cheese, chicken pot pies from Boston Market, Pad Thai from my favorite Thai place.  I had a new found love of lemonade - and I drank noncaffiene rasberry iced tea when I couldn't choke down more metal tasting water.  The further you get from A/C the better it gets - hang in there. ",
      "MessageIndex": 15,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735285",
      "Title": "Food Suggestions - Please mln8428 nelia48"
    }
  ]
}