{
  "AuthorID": "Kelownagirl…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
  "Posts": [
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Oct 13, 2007 09:47AM Kelownagirl wrote: LuAnn, what wonderful pictures, it makes my day!  We too are expecting our first grand baby in early Dec. and we already know it is a girl.  Family, it is one of the many reasons I am not ready to give up. I want to take my granddaughter to her first day of school! I don't know who said this, but it is what I believe.  \"I accept the diagnosis but not the prognosis.\" Now I just nee to get my onc to think the same way. thanks again for the pics, take care, Jill M",
      "MessageIndex": 11,
      "PostDate": "13/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693721",
      "Title": "Pictures of New Baby LuAnnH Rocktobermom"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Dec 1, 2007 08:56PM Kelownagirl wrote: ARRRRRGGGGGG! GRRRRRR! **** **** KCUF RECNAC !!! Jill M",
      "MessageIndex": 5,
      "PostDate": "01/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696252",
      "Title": "Panty wad JoyRebecca mke"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Oct 23, 2007 05:05PM Kelownagirl wrote: What beautiful pictures!  I am sending you  big hugs and praying for you, Diane and your entire family. thanks for sharing, Jill M",
      "MessageIndex": 19,
      "PostDate": "23/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694231",
      "Title": "Bimmer & Diane Pix nowheregirl MargaretB"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Dec 3, 2007 03:27PM Kelownagirl wrote: I am so sorry you are having so much pain. There are a number of drugs available to help you and perhaps you haven't found the right one yet.  Before I had rad's late this past summer I was having a lot of pain I just couldn't get under control.  Sometimes something would work but it would wipe me out, not good.  My family Dr. switched me to slow release morphine twice a day and also gave me quick release morphine (5mg)for break though pain.  The dosage is something your Dr or pain management group(hopefully your cancer center has one?)  can help you with.  It took awhile for us to find just the right amount to relieve the pain and not flatten me.  Slow release morphine comes in different strengths too. I have not had liquid morphine but from what I read on the internet, it is a quick release form of morphine  used for breakthough pain.  I hope you can get some answers and help from your family Dr or pain management team.  Life just looks and feels better when you are not in so much pain. Ask your pharmmacist what the difference is between liquid morphine and pill form of morphine (5mg) commonly used for breakthough pain.  I hope you find some relief and are able to have the rad's soon too.  The rad's made a big difference for me and my back problems. take care, hugs.......Jill M",
      "MessageIndex": 1,
      "PostDate": "03/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696364",
      "Title": "Liquid morphine - Any experience? luckywife Fllorik"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Nov 6, 2007 09:21AM Kelownagirl wrote: I know it is difficult but try to be positive until you see the onc and what they have to say.  Please let us know what you find out. take care, Jill M",
      "MessageIndex": 1,
      "PostDate": "06/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694987",
      "Title": "breast ca in situ and bone mets marthahky roseg"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Oct 15, 2007 09:44AM Kelownagirl wrote: I can't comment on how it is decided in the U.S. but here in Canada each provience has it's own cancer board with their own protocol of treatments for various cancers. And yes, the protocols seem to differ from provience to provience. I do know that a protocol can be changed IF you get your onc to agree and then it must be in writing to the board.  I know this because when I was on Taxoter in '06, their protocol in B.C. was every three weeks and my onc wanted me to have a low dose every week for three weeks with one week off. So my list of drugs since dx in '05: 1) Letrozole/Femera April-Aug with bone progression(given in Alberta) 2)Exemestane/Aromasin Aug-Dec (Alberta) liver progression 3) Taxotere-weekly 15 rounds ( moved to B.C.) slight liver progression 4) Exemestane/Aromasin repeated(?) June-Aug '06 liver progression 5)Capcitabin/Xeloda Aug.-Dec. 06 liver progression 6) A/C Jan.-May'07 with small liver progression 7) Letrozole/Femera(repeat?) June and still on it until Dec.  I have asked why she repeated the two drugs, Femera and Aromasin, her answer was , less toxic and to give me a break.  I do know that the U.S. uses more drugs than they do here which I think is good. Canada seems to be very conservative when it comes to using drugs even if they have been tested and used else where. Good luck Debbie with your treatments, take care, Jill M ",
      "MessageIndex": 17,
      "PostDate": "15/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692828",
      "Title": "Order of Chemos received BrandisMom cats_love_me"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Nov 20, 2007 08:48AM Kelownagirl wrote: WOW!  I am so happy for you.  It is always wonderful to hear of someone doing so well.  It lifts my spirts too!! Dance, dance, dance!! take care,  Jill M",
      "MessageIndex": 2,
      "PostDate": "20/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695684",
      "Title": "Dancing with NED!!! tropicmom ozzie2"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Dec 13, 2007 09:05AM Kelownagirl wrote: Ter, just wish I could reach out and give you a real hug......fully understand why you are scared.  I wish there was something more I could do to take away your sadness too...you will be in my thoughts and prayers. Good luck with your results, let us know please.  big hugs to you, Jill M",
      "MessageIndex": 2,
      "PostDate": "13/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696859",
      "Title": "See onc tomorrow Thursday Ter manos"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Oct 23, 2007 10:57AM Kelownagirl wrote: Hana, I am so sorry to hear that you had to join our group.  I am also from Canada , Kelowna,B.C. I too have a lot of bone mets (dx in '05) but I never really had a lot of pain (in 05 & '06) until this summer. I did have some rads to my spine which took most of the pain away.  Before the rads I was taking a lot of short release (5mg)morphine which just kept me gooned all the time.  Then they switched me to slow release,10mg twice a day,with the short release for \"break though\" pain.  After the rads, I went back to the slow release twice a day. For the most part, the pain is now under control.  You said you are in Bahrain for 6 mths.  Will you be able to get another 3 mths supply of morphine to last you until you get home?  Perhaps if you talked to someone at the Canadian Consulate, they could help you get another 3 mths supply? In reagarads to the bone mets, it means the cancer has spread to the bones.  I know it sounds scary but there are a lot of us here who have been living with bone mets for a very long time. For some of us, the drug treatments (Zometa or Pamidronate)help with the pain after a few treatments. When we were living in Alberta, I was on Zometa and I got relief from the pain after the second infusion.  After moving to B.C. they switched me to Pamidronate/Areida as they don't use Zometa very much here. That too seems to help. The Zometa and the other bone strengthening drugs, help to stop and or repair the damage to the bones and does help with some of the pain. Please let us know if you will be able to get more meds while you are there.  I really hope there is someway for you to get pain meds until you get home.  By the way, where is home? take care, Jill M",
      "MessageIndex": 5,
      "PostDate": "23/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694268",
      "Title": "metastatic breast cancer to the bones noon mom2acat"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Oct 5, 2007 07:38PM - edited Oct 5, 2007 07:38PM by Kelownagirl Thanks ladies for the info on abraxane and avastin.  I had a chat with my nurse yesterday when I was having my pamidronate/aredia.  She knows my onc very well and said for me to bring up my concerns/wishes with with her. The nurse said my onc is usually very willing to listen, which if what I have found with her in the past two years.  Guess that's why I was confused/stunned by her response last time I saw her. I know they have just started using abraxane here so maybe she will be willing to give it to me. Our clinic has also started using Falsodex as well.  As far as changing Dr. or hospitals, that really isn't that easy to do here in Canada, even if you have the $$.  We are assigned to a cancer center nearest to where you live.  I could switch to Vancouver which is a very large center, but I would either need a reccomendation from my Dr. or we would need to relocate.  Relocating is not an option for us. Also,each province has it's own protocol it follows for every type of cancer.  I did however, find out how to get a drug that is available in Canada but not on our proviences protocol.  I am going to continue to collect information and any other advise that you gals have and really work on getting my thoughts together before I see her. I am soooo not ready to quit yet.  We are having our first grand baby in Dec.and I really have dreams of taking that little girl to her first day of kindergarten. Thaks again ladies, any other suggestions for chemo/hormones treatment would be very helpful. Jill",
      "MessageIndex": 9,
      "PostDate": "05/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693174",
      "Title": "Abraxane, anyone on it? Kelownagirl Kelownagirl"
    },
    {
      "AuthorID": "Kelownagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Kelownagirl wrote: Hello ladies, I was wondering how many of you are or have been of Abraxane and if you are having side effects from it. Last year I was on weekly Taxotere, 3 weeks on and one off. I was also taking dexamethasone 3 days on and 4 off.  In spite of having the dex, I developed large, severe blisters on my hands and feet so the decision was made to take me of the chemo.  While I was on Taxotere my bone and liver mets did stay stable, but my onc was concerned that staying on the drug longer would only cause more severe reactions.  I recently finished 6 rounds of A/C , the liver mets still progressed. My onc wanted me to have a \"break\" from chemo so she put me back on Letrozole/Femera which I was on in '05 when I was first dx.  Didn't make sense to me to reuse a drug that had failed before but I think it was to just give me \"something\" durning the break, I don't know. I live in Canada, British Columbia so our chemo choices/protocols differ from yours in the U.S.  Canadan has recently approved Abraxane for use here and I was very happy to here that dex was not required with the chemo.  I didn't tolorate the dex very well either. I know, I'm rambling but I guess I am just looking for something to tell my onc when I see her Nov.2  Every time I bring up the question of doing another taxane chemo she reminds me of how sick I was from the dex. I would like to hear the good, bad or ugly from anyone who is or has been on Abraxane.  Are there other taxane type chemos that don't require dex?  I would welcome any imput you have, tks, Jill M Dx 4/9/2005, 2cm, Stage IV, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693174",
      "Title": "Abraxane, anyone on it? Kelownagirl Kelownagirl"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Nov 5, 2007 09:18AM Kelownagirl wrote: I tried the I-P 6  with Inositol for over a month, 6 caps a day.  My tumor markers tripled in the month.  Was it the Inositol? Doubt it but made me stop taking it.  Also it can cause sever stomache problems which I experienced. You just need to be careful what you take if you are ER+ PR+ as a lot of the herbs etc contain natural estrogens which you don't want. I do Qi Gong, an ancient Chineese breathing exercises.  I find it helps and I always did it before chemo. take care, hugs.....Jill M",
      "MessageIndex": 5,
      "PostDate": "05/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694883",
      "Title": "how can you boost your immune system"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Dec 18, 2007 12:58PM Kelownagirl wrote: Dear Bimmer, my is heart breaking for you, your sons and your grandchildren.  I pray now that you and your family will recieve the support you need to get through this very difficult time. I know your love for Diane will live on with you and your sons through all the wonderful memories you have of her. I will keep you and your family in my thoughts and prayers. Please, when you find the time and the strength, keep in touch with us here.  We will all want to know how you are doing. take care of you, with hugs for all of you, Jill  M",
      "MessageIndex": 11,
      "PostDate": "18/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/697113",
      "Title": "Very advanced B.C.: Diane's final gift. Bimmer ilenee"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Dec 8, 2007 10:39AM Kelownagirl wrote: Jill, I am so sorry this is happening.  My girlfriend had brain mets as well...that was last year.  She had rads as well and was switched to Tykerb.  She is doing very well now and I will pray that you do too. Hugs to you, Jill M",
      "MessageIndex": 23,
      "PostDate": "08/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696563",
      "Title": "OMG Brain Mets for me BJW Maya1"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Oct 4, 2007 10:50AM - edited Oct 4, 2007 10:50AM by Kelownagirl Thanks for the response ladies.  My nurse told me they will start using Abraxane at the clinic here soon as the nurses have just finished a training session on the drug. I know my onc is concerned about what to give me that won't cause the kind of reaction I had on Taxotere.  The Dr's here have never seen any thing like it.   I am hoping to convince my onc that we should give Abraxane a go.  My onc seems to think that there isn't much use in giving me any more chemo as, in her words \"you have had so much chemo with little or no results\". Okat she confused me when she said that. Maybe I should recap what I've had: Letrozole/Femera:  April-Aug./05 Exemestane/Aromisin:  Aug-Dec./05 Taxotere-(weekly):  Dec.05-May.06 I was stable on this but very sick Exemestane/Aromisin:  June-Aug.06 Capcitabine/Xeloda: Aug-Dec.06 A/C: Jan.-May.07 Letrozole/Femera: June to now I guess I need to be more assertive with my onc but don't want to piss her off either.  I should have asked her \"what's with repeating two drugs (Letrozole, Exemestane)I have before that failed??\"  I feel like she is tossing me aside and telling me I'm done.  Don't I get to decide when I'm done?  oh geez, I seem to be ranting.  Guess that's been inside of me for awhile, ever since my last visit with her at the end of Aug. I feel very frustrated with her. I just need something to suggest to her without coming on as a nut case.  I should probably go somewhere and let out a good scream, then think logically.  Yeah having a chemo brain, logic comes easy...LOL I do appreciate the info and the space to rant. take care, Jill ",
      "MessageIndex": 5,
      "PostDate": "04/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693174",
      "Title": "Abraxane, anyone on it? Kelownagirl Kelownagirl"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Dec 2, 2007 04:54PM Kelownagirl wrote: Deb, I am so sorry you have  this happen to you and I don't blame you for being scared. The rad's should help  the tumors to shrink so that's good.  I have not had the same thing but this summer they felt I had a pathological fracture at L3 in my back. When I saw the MRI of my back I flipped as it look like there was nothing (bone) left in my back. I had rad's and my problem was fixed with just the rads.  I too have numerous places with bone mets and I really don't have a lot of pain.  What pain I do have is handled with med's. Try to disregard stats.  As most of us here know the stats really don't mean much and most of the time they are very old.  Let the rad's do their thing with the tumors but that  does take time. I hope you can get a second opinion soon and have your mind put at ease. In the mean time, take our hands and come off the ledge.  Stay here with us and post, rant or what ever you need to do to get yourself through this. Sending you big hugs, ((((  ))))))) take care, Jill M",
      "MessageIndex": 2,
      "PostDate": "02/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696308",
      "Title": "Pathological fracture C2, C3 - anyone else heard of this? debman TrudiS"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Dec 8, 2007 11:33AM Kelownagirl wrote: Lali, I am sorry you are going through this and I can imagine how frightening this is for you.  I know it is so hard to wait until they know for sure what it is. I will say prayers for you, take care Jill M",
      "MessageIndex": 3,
      "PostDate": "08/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696599",
      "Title": "Reccurence lali mkl48"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Dec 1, 2007 04:21AM Kelownagirl wrote: I am so sorry for your loss. She sounds like she was an incredible lady. You and your family are in my prayers and thoughts. Jill M",
      "MessageIndex": 9,
      "PostDate": "01/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696254",
      "Title": "Jeannie44 Jeannie44 73gr"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Oct 23, 2007 08:08PM Kelownagirl wrote: Hana, it sounds like you had a better day today and that's great! All of us that have bone mets REALLY understand what you are saying about not being able to do what you use to do.  It is beyond frustrating.  Up until a year ago I went to deep water exercises 5x a week and went to the gym 2x a week.  Just the past two weeks I have been able to go for a real (almost) walk.  It's bloody annoying to see all the folks in our neighbourhood out strolling by at a good clip and they are in their freaking '70's and 80's.........arrg.  The guy that really gets me walks with a walker, walks his little dog, and yup they pass me.  I tell them it's because there is a speed limit here and I don't want to break it ...LOL. Hana and Francesca remember that there are a lot of great drugs and other treatments out there for all of us.  You will find new things to dicover and do.  I was never a great gardener until I had BC in '97.  Now it is my passion and  and it brings me so much joy. And Hana, as far as being strong willed.....what's wrong with that?  It's a + as far as I am concerned! take care, hugs.......Jill M ps Hana my son is in Vancouver, right downtown in English Bay.  How I love Vancouver!",
      "MessageIndex": 11,
      "PostDate": "23/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694268",
      "Title": "metastatic breast cancer to the bones noon mom2acat"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Dec 14, 2007 08:15PM Kelownagirl wrote: Joanne, good to hear that you did get \"some\" good news.  The chemo for Christmas does suck.  As I told my onc,\"chemo again for Christmas?  That's what I had the last two years in a row and I wanted something different!\" Actually for me, I was able to differ chemo until mid Jan. as things are not moving very rapidy. However,  I think you made the right choice to start now as opposed to waiting until the New Year.  I will pray that  it doesn't make you feel too lousy and this new chemo will kick the mets right out of you!  Enjoy your time with your family over the Christmas holidays. By the way,what chemo are you on? take care.......hugs, Jill M",
      "MessageIndex": 7,
      "PostDate": "14/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696929",
      "Title": "Scan Results: \"Stable - more or less\" joanne1428 lisacatq"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Dec 9, 2007 04:36PM Kelownagirl wrote: Joni, I am so sorry your bone mets are causing so much pain.  A lot of us here have been through the same thing and have found ways to help with the pain.  Living in constant pain sucks and is unnecessary too.  I beleive you go to the Tom Baker center in Calgary?  I do know they have a wonderful pain/management clinic.  See if your onc or family doc can get you in ASAP.  As far as the rads go, I had rads to my spine (L2, 3 &4) and hip this summer and it really did help.  It did take awhile for the full effects of the rads to kick in, but until it does, that's where the med's will help. Try to get some action tomorrow from Tom Baker as they are usually very good if they know how much pain you are in. Good luck and let us know what happens with the pain/management team. soft hugs to your poor sore bones, Jill M",
      "MessageIndex": 4,
      "PostDate": "09/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696614",
      "Title": "Pain from Bone Mets jonimb joanne1428"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Nov 21, 2007 10:32PM Kelownagirl wrote: I am so sorry for you. It is always so hard to loose someone you love, especially a parent . You will be in my thoughts and prayers. Jill M",
      "MessageIndex": 9,
      "PostDate": "21/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695828",
      "Title": "My Mom is a Angel Momrita lastminuteD"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Dec 1, 2007 02:17PM Kelownagirl wrote: Horray for your good news!!  Enjoy it, share it and shout it!!  We like to hear good news, gives us hope. YEAH FOR YOU!!! hugs......... Jill M",
      "MessageIndex": 3,
      "PostDate": "01/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696265",
      "Title": "Good news amongst the bad..... mrs_X_Sunneedazee mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Dec 4, 2007 09:22AM Kelownagirl wrote: Luann, we will all be praying for his safe return. I like Madison's idea of us sending him cards to show our support when he is settle. My best friend (also Stage IV) will soon be saying goodbye to her 19 year old son as he is preparing to leave.......I cannot imagine... May your son be surrouned with angles..... hugs and love to all of you.......Jill M",
      "MessageIndex": 14,
      "PostDate": "04/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696377",
      "Title": "Please keep my son in your prayers LuAnnH judyr"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Dec 13, 2007 07:59AM Kelownagirl wrote: Wishing you good luck with your surgery and will be praying for you.  It is good that your doc feels they are catching this early. Let us know how you make out.  You will be in my thoughts and prayers, hugs to you, Jill M",
      "MessageIndex": 1,
      "PostDate": "13/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696868",
      "Title": "ovary update waterlily Fllorik"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Oct 19, 2007 09:42AM Kelownagirl wrote:  Hi Tracy, I was dx in '05 with just bone mets at that time. So my list of drugs since dx in '05: 1) Letrozole/Femera April-Aug with bone progression(given in Alberta) 2)Exemestane/Aromasin Aug-Dec (Alberta) liver progression 3) Taxotere-weekly 15 rounds ( moved to B.C.) slight liver progression 4) Exemestane/Aromasin repeated(?) June-Aug '06 liver progression 5)Capcitabin/Xeloda Aug.-Dec. 06 liver progression 6) A/C Jan.-May'07 with small liver progression 7) Letrozole/Femera(repeated) June and still on it. Scan last week showed no change.  Will it keep working? Geez I can only hope! At least my bone mets are stable. I am sure they will find something that will work for you. hugs......Jill M",
      "MessageIndex": 2,
      "PostDate": "19/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694075",
      "Title": "thread on liver mets? Tracy1964 LuAnnH"
    },
    {
      "AuthorID": "Kelownagirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12279/profile",
      "Content": "Dec 8, 2007 11:41AM Kelownagirl wrote: Bimmer, how difficult this has been for you too.  You are such an amazing man...........may God continue you to give you strength. I wish there was something we could do for you....My thoughts and prayers are with all of you, Jill M",
      "MessageIndex": 24,
      "PostDate": "08/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696562",
      "Title": "Very advanced B.C.: Protecting \"The Prize\". Bimmer jay66"
    }
  ]
}