{
  "AuthorID": "Ker",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126770/profile",
  "Posts": [
    {
      "AuthorID": "Ker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126770/profile",
      "Content": "May 20, 2011 11:55AM Ker wrote: TGIF- one week down.... starting to feel a bit more like a routine. I am pink and slightly sore under my arm. I've been using Miaderm and a bit of Emu oil at night based on a thread I read here months ago. I have Aquaphor atm home from my kids' diaper days-- are you all finding that helping? For those who went through chemopause, are the hot flashes kicking in more frequently again? Also, I read here that some are choosing or not getting those last 5 booster shots. I wondered what went into that decision. I appreciate everyone's helpful tips. Have a GREAT rad free weekend! Ker",
      "MessageIndex": 319,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "Ker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126770/profile",
      "Content": "Ker wrote: I understand some oncologists will not impose a 4th Taxol treatment if neuropathy is particularly profound. My onco mentioned this at my last appt (which was my 3d) and seemed almost non-plussed about #4. I have a friend whose onco stopped her 4th because she was having such trouble with the chemo. Are there studies out there addressing this? It would seem to be a bigger issue. Also, I am new the boards. How would you add your diagnsotic info to the bottom so you all know my history as well? Thanks. Ker Ker Dx 11/23/2010, 2cm, Grade 3, 3/31 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/767930",
      "Title": "3 vs. 4 Taxol Treatments? Ker Huskerkkc"
    },
    {
      "AuthorID": "Ker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126770/profile",
      "Content": "Apr 27, 2011 10:17AM Ker wrote: Hi all- I go in for simulation on May 9th and start rads on the 16th, Will try to post a recap of simulation for those who havn't gone there yet.  Tomorrow is my last Taxol. Expected to be ecstatic, but I'm feeling sick and weepy today. Wish I'd gotten a few days respite before the last hurrah. My tum has been sensitive through out. Glad you are all out there-- nice to know there are people who really get what you are going through.",
      "MessageIndex": 35,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "Ker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126770/profile",
      "Content": "May 16, 2011 01:58PM Ker wrote: Ok, 1 down, 32 to go, but who's counting. They took slides today and did the treatment. I didn't even know I was done. Sang songs from the Sound of Music and closed my eyes. Good luck to everyone who's starting today, there are a few of us.",
      "MessageIndex": 209,
      "PostDate": "16/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "Ker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126770/profile",
      "Content": "Jul 1, 2011 01:28PM Ker wrote: Hi all- I participated some and lurked more, but I finished rads yesterday and wanted to pass along a few things that were helpful to me and that I learned from these boards. I did use Miaderm, right after treatment in the AM, and again around around noon. It seem to calm the burn I would occasionally feel. When I got home from work, I'd add emu oil and aquaphor to the mix at around 6:30 and again before I went to bed. I used fleece under the fold and on the side when I wore a bra. I bought camis with shelf bra from Costco and they made all the difference in the world. MUCH better than any sports bra, I tried. My skin is tan, and reddish at the boost area. But all in all, it went pretty well, so I recommend all of the creams described above. The 6 1/2 weeks did go by much quicker than the chemo counterpart. I also had protein and veggies daily I even add Whey to a smoothie in the AM. Today I tossed all my chemo meds, my onco instructions and put away the turbans and caps. I am moving on (well- with herceptin every 3 weeks!) Good luck to all you on this journey. You are all strong and brave to have gotten this far and you will get to the other side of these treatments.",
      "MessageIndex": 1062,
      "PostDate": "01/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "Ker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126770/profile",
      "Content": "Apr 15, 2011 10:19AM Ker wrote: This is my first post here- but this seem appropriate. I have one Taxol left, and start rads May 16 for 6 1/2 weeks, includes booster. Trying to decide whether to use Calendula alone or Miaderm which I saw on the discussion boards Miaderm has Calendula in it. A bit nervous, but glad chemo is winding down. Looking forward to summer....",
      "MessageIndex": 2,
      "PostDate": "15/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "Ker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126770/profile",
      "Content": "Jun 1, 2011 02:05PM Ker wrote: Gma- I cried through the simulation and brought my best friend for round 1. I sang Sound of Music and I Will Survive throughout the first week. I don't cry now as the process has become routine. That part will get easier. I finished 12/33 today. My skin is ok, but I feel very sore under my arm pit. Is the only remedy the various skin lotions we've discussed? How do they deal with pain? I know this gets worse and I am afraid of more under the skin pain. My friend uses vanilla on all burns (non-radiation). Anyone heard of this? Scares me....",
      "MessageIndex": 568,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    }
  ]
}