{
  "AuthorID": "kerrie389",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106630/profile",
  "Posts": [
    {
      "AuthorID": "kerrie389",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106630/profile",
      "Content": "Jun 16, 2012 02:38AM kerrie389 wrote: Binney thank you so much for that information. I think i definately need some compression camis. So uncomfortable wearing bras with the scar tissue under the breast. And i always feel more comfortable when my sleeve is off too.I think the constriction at the top of my arm causes nerve pain in my breast. Just my theory but who knows! Thanks again for the info. You really are such a wealth of knowledge. ",
      "MessageIndex": 2,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/789183",
      "Title": "Breast Lymphoedema kerrie389 carol57"
    },
    {
      "AuthorID": "kerrie389",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106630/profile",
      "Content": "Jun 19, 2012 04:02PM - edited Jun 19, 2012 04:03PM by kerrie389 Thankyou Hugz4u, You have said exactly what i have been thinking.  Whenever i have constriction at the top of my arm i get a neuralga sort of pain in my arm and breast... feels so aweful and terrifies me,andmy breast seems to swell. I have just started to wear a lymphodiva sleeve and there is no retriction at all at the top of  my arm. I have started towear an ahh bra as the others are too consticting and with the combination of the looser sleeve it all fels so much better. Somtimes i think with compression... in my case anyway... less is best!",
      "MessageIndex": 6,
      "PostDate": "19/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/789183",
      "Title": "Breast Lymphoedema kerrie389 carol57"
    },
    {
      "AuthorID": "kerrie389",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106630/profile",
      "Content": "kerrie389 wrote: Can anyone tell me what breast lymphoedema feels like. I have had a tram flap reconstruction almost 12 months and my new boob feels horrible. I have LO in my arm so guessing it is in my breast as well. The top part of my breast  fells full hard and very uncomfortable. It is the  same area where i had very bad burns from radiotherapy although that was almost 2 years ago now. I have had 2 ultra sounds but nothing sinister shows but this feeling of discomfort just scares the hell out of me. So maybe it's scar tissue... Any advice would be greatly appreciated. Kerrie  DX Oct 2009. 15mm tumour. Grade 2 Stage 2. 2/18 nodes pos. OES/PROG + HER - Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/789183",
      "Title": "Breast Lymphoedema kerrie389 carol57"
    },
    {
      "AuthorID": "kerrie389",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106630/profile",
      "Content": "Apr 4, 2012 05:27PM kerrie389 wrote: Cookie reading your posts with much interest. What are boobie wiggles. I am having issues post tram flap with a swollen breast that i am sure is LO. I have it in my arm so why not my boob! ",
      "MessageIndex": 65,
      "PostDate": "04/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/779993",
      "Title": "am I a dum-dum or a trailblazer? cookiegal cookiegal"
    },
    {
      "AuthorID": "kerrie389",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106630/profile",
      "Content": "Oct 23, 2013 07:40PM kerrie389 wrote: I too have one of those draws where my pathology report quietly lurks. I cannot re read that terrifying chapter of my life. Maybe one day! Loved your post and congratulations on 11 years!",
      "MessageIndex": 13,
      "PostDate": "23/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/813321",
      "Title": "Postcard from the edge...of eleven years out... weesa Fallleaves"
    },
    {
      "AuthorID": "kerrie389",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106630/profile",
      "Content": "Aug 19, 2010 07:16AM - edited Aug 19, 2010 07:20AM by kerrie389",
      "MessageIndex": 691,
      "PostDate": "19/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "kerrie389",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106630/profile",
      "Content": "Feb 17, 2012 03:29AM kerrie389 wrote: Hi mamashelper, The distributer is located in Victoria. Asherah Health P/L. Contact is Dianne Reynolds : 0421778782. She is very helpful.  This forum is great. This is where i discovered this sleeve too. ",
      "MessageIndex": 224,
      "PostDate": "17/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/764107",
      "Title": "New type of LE Garment Journey purple32"
    },
    {
      "AuthorID": "kerrie389",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106630/profile",
      "Content": "Feb 13, 2012 10:32PM kerrie389 wrote: I have just received my Solidea Arm care garment. With Sue's help i was put onto a distributer in Australia. I just love it!. It is so light and comfortable... i am truely amazed. I will start doing some measurements and monitor my arm with this sleeve. Am really hoping for good results... don't want to have to go back to wearing the other sleeves. ",
      "MessageIndex": 222,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/764107",
      "Title": "New type of LE Garment Journey purple32"
    },
    {
      "AuthorID": "kerrie389",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106630/profile",
      "Content": "kerrie389 wrote: Hi Ladies, Wondering if anyone can share their experience in this matter. I'm off to see the PS next week to start the ball rolling with my reconstruction process. I think i will be having a skin sparing mastectomy on my good side and a DIEP reconstruction. My concerns are: Will this surgery make my lymphoedema worse. Will the scar across my abdomen prevent me from doing the self massage and moving fluid down to my inguinal nodes. I have just completed the lymphoedema therapist course. I have no experience at all but i now have all of this new information and i'm wondering if i am doing the right thing by having the surgery. Would really appreciate any feedback . Kerrie  DX Oct 2009. 15mm tumour. Grade 2 Stage 2. 2/18 nodes pos. OES/PROG + HER - Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/768245",
      "Title": "Breast Reconstruction and Lymphoedema kerrie389 NatsFan"
    },
    {
      "AuthorID": "kerrie389",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106630/profile",
      "Content": "Apr 28, 2011 08:24PM kerrie389 wrote: Thank you very much NatsFan and Tina. I will definately be discussing theses issues with my PS. Tina i have never heard of  myofascial therapy. Something more for me to research! Tina you were very fortunate to have a surgeon trained in LO therepy. It just amazes me how the doctors have absolutely no idea about it. I did the course mainly for my own education about my health and am so glad i did. After i have recovered from the surgery i will definately be looking at working in this field to help other people. NatsFan i will be interested as well to hear about the exercises you were given to reduce the scar tissue. ",
      "MessageIndex": 3,
      "PostDate": "28/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/768245",
      "Title": "Breast Reconstruction and Lymphoedema kerrie389 NatsFan"
    },
    {
      "AuthorID": "kerrie389",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106630/profile",
      "Content": "Oct 31, 2010 05:49AM kerrie389 wrote: WOW! I had this this on my path report and it has been freaking me out completely. Feel so much better after reading these posts. Thanks ladies. Kerrie ",
      "MessageIndex": 16,
      "PostDate": "31/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743848",
      "Title": "Extracapsular Extension gfrey jdootoo"
    },
    {
      "AuthorID": "kerrie389",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106630/profile",
      "Content": "Jan 14, 2012 09:25PM kerrie389 wrote: Hi Everyone, I have just been looking at this site and the sleeve looks wonderful. I am curious though as to the measurments. There is no mention about the length of your arm. I am very tall and my sleeves are always too short. Has anyone had issues regarding the length of these sleeves. Also i live in Australia and cannot see that they send OS... has anyone any ideas about this. I have sent an e mail regarding these 2 issues but thought i would ask you girls first. Many thanks. I learn so much from you ladies. ",
      "MessageIndex": 209,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/764107",
      "Title": "New type of LE Garment Journey purple32"
    },
    {
      "AuthorID": "kerrie389",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106630/profile",
      "Content": "kerrie389 wrote: Hi Ladies, Wondering if any of you ladies can help. Have been reading on Mr Google site... big mistake.. and i am not sure but it seems to me that they are saying the benefits of chemotherapy with  hormone positive women are minimal and that it is the hormone therapy that is effective. I always thought that i had a better chance i guess because i had the double benefit of chemo and tamoxifen but now i'm not so sure. I am only ER 40% so now i am wondering if the tamoxifen will be of any benefit and if the chemo was a complete waste of time. Any thoughts would be very much appreciated. Kerrie  DX Oct 2009. 15mm tumour. Grade 2 Stage 2. 2/18 nodes pos. OES/PROG + HER - Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769578",
      "Title": "Chemotherapy with ER+ tumors kerrie389 chrissyb"
    }
  ]
}