{
  "AuthorID": "Keryl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
  "Posts": [
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Oct 8, 2008 08:36PM Keryl wrote: Yes, I have my 2nd round of AC tomorrow. I am on every two weeks for 8 weeks, then taxol every week of 12 weeks. My side effects have basically been exhaustion, a bit of a tummy in the afternoons and some sleep deprevation. My hair is in place, but my scalp itches at times -- am I imagiing that? hoping tomorrow goes ok. I have some lydocane cream for my port, but not sure what to do with it ???? Take care all. ",
      "MessageIndex": 12,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722095",
      "Title": "AC every 2 weeks..? susan13 Keryl"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Sep 5, 2008 08:38PM Keryl wrote: Hi there. I was DX in May 08 with DCIS - Drs. recommended lumpectomy and radiation. I am 49. It was found on a routine mammogram. After the lumpectomy pathology was more complicated than anticipated and I have moved on to Masectomy, and node removal based on those details. I did go ahead with BRCA genetic testing before making the decision to only remove one breast as my BRCA was negative. I too have a 20 year old daughter and really wanted to know about BRCA as my mom had breast cancer too, but no other female relatives even exist that I know of so no more than that to go on....  Based on your info., you might want to definintely consider BRCA testing. I am explaining this to emphsize that things do change along the way as more testing is done and more pathology is done. What I thought was straight forward, turned to be more complicated. While I will get through this, I could not count on initial blush and plans can change with more information, so just know that and be open.  I ended up removing only one breast as there was nothing going on with the healthy breast and I had the BCRA negative. I will be on close watch there though! On a good note, I had immediate reconstruction on my masectomy side in July and it went very well. I am very pleased with my my new breast and I am not even done yet!!   While the most impt. thing is prognosis and health, at least my breast is moving in the right direction!    I wish you the best. We will get through this. Would definitely go for the genetic test and counseling as with a family history, it may tell you a lot and support the decision you make. take care.",
      "MessageIndex": 3,
      "PostDate": "05/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/720712",
      "Title": "Just Diagnosed with DCIS Jo_Ann_K SonCallsMeEarl"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Keryl wrote: This Post was deleted by Keryl. Dx 5/13/2008, IDC, 2cm, Stage II, Grade 3, 4/9 nodes, ER+/PR+, HER2- Surgery 7/29/2008 Lymph node removal: Left, Sentinel, Underarm/Axillary; Mastectomy: Left, Right Chemotherapy 10/1/2008 AC + T (Taxol) Radiation Therapy 3/1/2009 Breast, Lymph nodes Surgery 9/14/2009 Reconstruction (left); Reconstruction (right) Surgery 4/24/2011 Reconstruction (left) Surgery 5/15/2014 Reconstruction (left): Latissimus dorsi flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719554",
      "Title": "Anyone on E5103 trial/ Avasten Keryl Keryl"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Aug 2, 2008 05:07PM Keryl wrote: Microcalcs in May; excisional biopsy and MRI determined DCIS.  Because there were several other suspicious  spots in breast, made decision to go with left mast. and  had the surgery last tuesday. (not that bad) However, waiting for the pathology report on the SNB and balance of the tissue to know whether chemo or rads are advised is very difficult.  In the meantime, starting down the implant reconstruction path and hoping to end up \"whole\".  I have had a clean right breast and negative on the  BCRA so I have only surgically addressed the left side. still wondering about that decision, as I am pretty paranoid, but went with surgeons recommendation.  Hopefully will get a clear path report on the balance and can concentrate on reconstruction. I can do that.  we will get through this. more hugs. ",
      "MessageIndex": 5,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718918",
      "Title": "If microcalcifications AREN'T benign.. newmomto1 trustinchrist"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Aug 16, 2008 08:04AM Keryl wrote: The added bummer is my PET scan showed more node involvement than originally thought; now I will have axilla nodes out on 8/29 so this may or will exacerbate my situation I am sure. At this rate my arm is sure to atrophy as I keep it stationary and close to my side -- other than minimal activity. I did stretching yesterday. ugh.",
      "MessageIndex": 17,
      "PostDate": "16/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719406",
      "Title": "Anyone with severe SNB Pain? Knives in armpit! Keryl morning"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Aug 12, 2008 01:30PM Keryl wrote: I have a call into dr. now. what kind of stretching (what moves) did you use? Today is the first day I can take a full shower since just had drain out. that might help my movement also.  when I was in the hospital the nurse kept putting the heating pad on my arm when I was asleep; then I kept taking it off. I think it was only supposed to be for my breast blood flow stimuli, not on my arm,  and I am wondering if it made the node disruption  incision more sensitive? she wasnt very aware - one time she said- what are you in for? ugh. my best to you.",
      "MessageIndex": 2,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719406",
      "Title": "Anyone with severe SNB Pain? Knives in armpit! Keryl morning"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Aug 13, 2008 06:02PM Keryl wrote: Thanks everyone. today I had a PET scan since my two nodes were positive. I had to hold my arms up over my head (lying down) for 30 minutes - it was very uncomfortable to say the least. Yes, the most minor touch or rub on material feels like raw open skin, almost like sand paper grating on an open wound. (how is that for graphic) Good to know this is not rare or that something isnt wrong.  The drain came out yesterday and that site is really sore too. I dont dare use my left hand driving or reaching.  Yes, think I will use some addtl. pain meds or ibuprof so that I can have some comfort. Today was my first shower! Yay!",
      "MessageIndex": 8,
      "PostDate": "13/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719406",
      "Title": "Anyone with severe SNB Pain? Knives in armpit! Keryl morning"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Aug 14, 2008 10:11PM Keryl wrote: ok, thanks all for your replies. well, I just found out today after PET scan that while the cancer has not metasticized which is awesome news, there are more positive in the lymph. so my chemo now will not begin until mid sept. and I will have addtl. nodes removed on 8/28; Now I am freaked about my arm pit pain, as expect it can only be worse after a second intervention. A \"must\" procedure,  but not looking forward to this.  will definitely need help on this recovery.",
      "MessageIndex": 11,
      "PostDate": "14/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719406",
      "Title": "Anyone with severe SNB Pain? Knives in armpit! Keryl morning"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Keryl wrote: I had mast. on 7/29 - they also took SNB at the time. My breast is healing well - had my second fill yesterday with no issues. However, my armpit and pain is significant from the SNB . My surgeon who says it will get better over time. It is limiting my mobility so much and I can barely ride in the car - hitting bumps is awful. My arm numbness has improved, but the pit pain is the same - it is more than zingers, it is definitely all the time.  Any advice on expectations or remedy? Unfortunately my nodes were positive and they will need to go back in during my exchange and remove all SN and Aux nodes, so now have major fear over that, not to mention the finding.  I start chemo later this month.  Anyone with advice on the pit pain.? Dx 5/13/2008, IDC, 2cm, Stage II, Grade 3, 4/9 nodes, ER+/PR+, HER2- Surgery 7/29/2008 Lymph node removal: Left, Sentinel, Underarm/Axillary; Mastectomy: Left, Right Chemotherapy 10/1/2008 AC + T (Taxol) Radiation Therapy 3/1/2009 Breast, Lymph nodes Surgery 9/14/2009 Reconstruction (left); Reconstruction (right) Surgery 4/24/2011 Reconstruction (left) Surgery 5/15/2014 Reconstruction (left): Latissimus dorsi flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719406",
      "Title": "Anyone with severe SNB Pain? Knives in armpit! Keryl morning"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Aug 2, 2008 05:20PM Keryl wrote: Hi all - just had my left mast. on tuesday 7/29; I agree with those that have reported the mast surgery is not easy, but not that terrible (and I am a wimp) the first few days are groggy and then you will hopefully easily pull out of it. My fear now is the SNB results; hopefully, clear. Want to move on to reconstruction, and health outlook. ITCHY...TOTALLY ITCHY. I do think the reconstruction options are confusing....I had to stop reading on sites about this and put my ultimate cards with my Dr. as there is so much conflicting info. out there, it made me so anxious. I do have great confidence in my medical team.  A side note, both my parents passed away last fall and I have few blood relatives. My kids have been great though they are just teens. Anyone out there felt alone, lonely, sad.... at age 49 still longing for my mommy....what is that about? ",
      "MessageIndex": 30,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/709468",
      "Title": "masectomy - seems like this sucks rseaw22 Mandy1313"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Aug 7, 2008 09:52AM Keryl wrote: I just got the call from surgeon yesterday that my path came back unexpectedly with IDC and node involvement. I meet with oncologist tomorrow. what started out as simple DCIS has become much more than that. I had left masectomy on 7/29, still have drain in (ugh) and have reconstruction with expander underway....now what? more aux. node dissection and expect I'll have chemo and other stuff to consider. My BRCA came back negative, but I still have cancer in family, so not sure that is enough reassurance. Small part of me wishes I had gone bi-lateral. I really feel like I am losing it about all this...I am very emotional and can't get my head around it. My daughter is being really sweet, but I want to appear strong for her, but I dont feel so strong right now. I got mad last night and hid one of my pictures of my parents because I miss them so much.",
      "MessageIndex": 40,
      "PostDate": "07/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/709468",
      "Title": "masectomy - seems like this sucks rseaw22 Mandy1313"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Apr 28, 2009 09:54PM Keryl wrote: I also like Radio Nowhere, by Bruce Srpingsteen.  I know it doesnt exactly fit - but dont you sometimes feel like, hello, hello....anyone out there?",
      "MessageIndex": 59,
      "PostDate": "28/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730432",
      "Title": "What Song Makes You Go Over The Edge? KellyC cp418"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Apr 7, 2009 11:51AM Keryl wrote: I finished rads 3/27. I was great through it all - not even that fatigued. I had one red/raw senstive spot on my clavicle until friday. On friday 3/27 I had two sessions - to finish up. one at 9am ; the other at 4pm; on Sunday my arm, pit, and chest took a turn. Very, very tight, very, very swollen. I was miserale for about 48 hours. Took advil and did the lymph massage that my PT advised to get the swelling down. I must say, it seemed to work, despite the skeptic in me. This week I started swimming again and though tight at first, the xercise really helps loosen it up. my recon. breast is till harder than before, but we'll see if it relaxes..... Took my first tamoxifen daily this week....so I am off and running to next phase....hair is short grey stuble. I do have a few eyebrows coming in........best of all, I am feeling a bit brighter.  I hope you are all doing well. Hang in there!",
      "MessageIndex": 756,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Feb 13, 2009 07:30PM Keryl wrote: Hi all. I start on 2/18. I had my staging appt. with positioning, tatoo marks etc. last week. I have 30 sessions.  I am wonder just what to expect - I did pretty well with chemo - had 4 sessions A/C and 12  sessions of taxol. Some say its no problem, others have a tough time - again, its individual. I do need to drive into SF about 30 miles to each session. The week after I finish I am going to Mission Viejo for the week. Cant wait to decompress.",
      "MessageIndex": 185,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Keryl wrote: I was just diagnosed with DCIS grade 3; I am debating between lumpectomy and masectomy. Am having MRI next week. I am reading all about skin saving masectomy - thinking I might be an easier candidate because of existing implants. Not sure. Two more weeks until I my next consult with surgeon and PS. I cant stand the wait. Trying to focus on work and kids, I think I am in denial. I am ready for action, but have to ignore it all until I get more info. Online is confusing......thanks for listening. Dx 5/13/2008, IDC, 2cm, Stage II, Grade 3, 4/9 nodes, ER+/PR+, HER2- Surgery 7/29/2008 Lymph node removal: Left, Sentinel, Underarm/Axillary; Mastectomy: Left, Right Chemotherapy 10/1/2008 AC + T (Taxol) Radiation Therapy 3/1/2009 Breast, Lymph nodes Surgery 9/14/2009 Reconstruction (left); Reconstruction (right) Surgery 4/24/2011 Reconstruction (left) Surgery 5/15/2014 Reconstruction (left): Latissimus dorsi flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/706525",
      "Title": "Anyone have implants, then get DCIS Keryl Keryl"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "May 16, 2009 03:32PM Keryl wrote: I am considering this also.   I had a single mast in '08; and did have to have chemo and rads ; I will have exchange next year (2010) Between now and then I will decide, but am leaning towared addressing the other breast at the time.  Even though my calcifications are minor in that breast, I want to minimize the risk and never have to have that type of treatment again - my doctor feels recurrance is the bigger concern; not the other breast; but I am seriously thinking about it - - looking forward4more - was your MD in favor or did you have to push for it?  ",
      "MessageIndex": 24,
      "PostDate": "16/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/732028",
      "Title": "contralateral prophylactice mastectomy 2 years later ally2 mythreesons"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Mar 10, 2009 03:42PM Keryl wrote: I have read a lot on these threads and comforted to find out my hair situation tracks....I'm about six weeks out of chemo - odd wispy hair - very inconsistent, unsightly.I was looking to see if anyone shaved their head to see if it would grow back more evenly now that it has started to sprout --  I hate to shave the few stubs that I have, but it seems so odd that I am wondering if it would help to \"level the field\" up there, so to speak. Anyone?",
      "MessageIndex": 1384,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Sep 23, 2008 04:53AM Keryl wrote: I was supposed to start in sept. but due to  a few issues got moved to October. My first chemo will be this friday  9/26 (it's still a sept date, but barely...) I will be having A/C every other week for 8 weeks, then Taxol weekly for 12 weeks. Neulasta after each. I am part of a clinical  trial as well. Radiation will come after chemo. I should lose my hair on just on or about my 50th bday. I have a 20 year old daughter and a 15 year old son. You can see my stats; then had a masectomy 7/29 , then auxilla dissection on 8/29 and here I am. My new breast is doing fine; will have the reconstruction finished down the line. In the meantime, it is time to bear down on the heavy stuff. I will let you know how Friday goes. I had a pedicure today and strangely felt like I was preparing for battle. hang in there everyone.",
      "MessageIndex": 13,
      "PostDate": "23/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Jun 4, 2008 12:01PM Keryl wrote: ok, tell me more. what are these drains? Can you describe more about them and what is needed? As you can tell, I am still in early stages and have not met with surgeon about these details, but they are upcoming so need to know.   ",
      "MessageIndex": 5,
      "PostDate": "04/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706657",
      "Title": "How long will I need FT help at home after surgery? BustersMom Nice_Nichols"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Jan 20, 2009 10:37PM Keryl wrote: Hi. I had unilateral mast with immediate reconstruction (implant) then found out I needed to have axilla nodes out too. 4 of 9 were positive. Had a second surgery.  I finish chemo in 3 weeks and onto radiation. I still plan on having the implant exchange, though I know it isnt ideal. My PS will make me wait one year before the exchange due to the radiated tissue. My questions is -- iss there any other choice at this point? I have the expander implant in already. I am not interested in keeping it as it has a nasty port protruding that is very irritable. I think it is too late for any other reconstruction option due to this radiated skin issue, correct, and exchange of the expander is the best option, though not without concern,  correct? I will have a lift and symmetry surgery on the healthy side, hopefully at the same time. Unless of course any check up  between now and then looks suspicious, then that second breast is outta there. Sometimes I wish I had the bilateral, but here I am...",
      "MessageIndex": 23,
      "PostDate": "20/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/724718",
      "Title": "Chest Wall Radiation and Reconstruction ninel 55andstillalive"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Jun 15, 2008 11:57AM Keryl wrote: I will be having mast. in July with immediate reconstruction. One of the reasons I am opting for this is because of the unknowns due to dense breasts and multifocal grade 3 DCIS. They could not biopsy my node because the questionabe node from the MRI was too close to an artery. (oh great) So, my ultimate patholgy will be from the masectomy. Do you know if the fact that we dont know everything will influence the willingness to do immediate reconstruction? for example, we dont know if rads or chemo nescessary, so how does that change things?",
      "MessageIndex": 25,
      "PostDate": "15/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/706946",
      "Title": "Anyone? Lumpectomy vs. Mastectomy w/No Re-occurance???"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Keryl wrote: I just had my blood test taken last week; about 3 weeks for results. This will determine whether I go unilateral or bilateral. My dr. will not do bilateral unless BCRA positive. Has anyone had the undetermined results? and what does that mean to treatment plans? I have a 21 year old daugther and this complicates things as I am not sure she is ready to handle this info. any advice.? Dx 5/13/2008, IDC, 2cm, Stage II, Grade 3, 4/9 nodes, ER+/PR+, HER2- Surgery 7/29/2008 Lymph node removal: Left, Sentinel, Underarm/Axillary; Mastectomy: Left, Right Chemotherapy 10/1/2008 AC + T (Taxol) Radiation Therapy 3/1/2009 Breast, Lymph nodes Surgery 9/14/2009 Reconstruction (left); Reconstruction (right) Surgery 4/24/2011 Reconstruction (left) Surgery 5/15/2014 Reconstruction (left): Latissimus dorsi flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707784",
      "Title": "BCRA testing Keryl southernchick"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Keryl wrote: I think someone wrote about this earlier, but now distant. I had excision biopsy 3 weeks ago (5/13) steri strips not budging. any advice? Is that ok? I am trying to take more showers to loosen them up. Any better advice or will they just take course? (they do itch!) Dx 5/13/2008, IDC, 2cm, Stage II, Grade 3, 4/9 nodes, ER+/PR+, HER2- Surgery 7/29/2008 Lymph node removal: Left, Sentinel, Underarm/Axillary; Mastectomy: Left, Right Chemotherapy 10/1/2008 AC + T (Taxol) Radiation Therapy 3/1/2009 Breast, Lymph nodes Surgery 9/14/2009 Reconstruction (left); Reconstruction (right) Surgery 4/24/2011 Reconstruction (left) Surgery 5/15/2014 Reconstruction (left): Latissimus dorsi flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706660",
      "Title": "Steri strips after biopsy Keryl NancyD"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Sep 4, 2008 12:10PM Keryl wrote: I had axilla node dissection a week ago. Last night was the first night I slepy lying down completely and not elevating my arm.I also think yesterday was hot, I was helping my daughter pack for college, and I hydrated less that I probaby should have. Today I woke up with significant numbness and tingling on the back side of my affected arm. I think it is swollen, but I could be imagining. my lower arm and hand is fine. I will call the breast center and check into LE prevention and massage. I am lightly massaging today myself, but have no idea what I am doing.    Any other short run advice - use cold, warm shower, how to massage, what?  Does this sound like the start of  LE or am I paranoid?",
      "MessageIndex": 6,
      "PostDate": "04/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/720378",
      "Title": "Is this Lymphedema? JoniB Keryl"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Jun 3, 2008 11:04PM Keryl wrote: ok, I read in the thread that your daughter comes home from college....my daughter is a sophmore and I need her as my friend. I lost both my parents in the last few months, and feeling very weary. It would mean so much to me for her to be my support, but so far, I feel she is evasive. How to handle? Do I let her go and not risk imposing or do I ask her help and tell her how much I need her? Age 20 is so \"in between\"; any advice? ",
      "MessageIndex": 39,
      "PostDate": "03/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/705260",
      "Title": "Surgery in June? carollyn Kymberlyn"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Sep 5, 2008 11:50PM Keryl wrote: Thanks. Great info.; I am going to do all of those things. I did make an appt. to go to a LE education and training course after referral from my physician. It is preventative at this point, but cant hurt. I read up on the sleeves and stopped at a local medical shop about them. It turned out to be a great store with wigs, scarves, bobbles, books, cosmetics, light clothing, support garments, etc. The fitter was so nice and supportive. I know where I will be going in the future as I head into chemo.  Good idea on the body armour type - as I have several and that sound like it might also feel good.  This AND recovery experience is the pits. I feel like I have a cactus firmly planted in my armpit so wouldnt be suprised if it caused me some issue like LE. Not feeling lucky these days.  Yep, my daughter will be a junior in college and only about one hour away, but having a great time living with roomies and on her own. I will miss her dearly, but not too far.  She has been a great support . Have a great weekend.",
      "MessageIndex": 8,
      "PostDate": "05/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/720378",
      "Title": "Is this Lymphedema? JoniB Keryl"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "May 16, 2009 10:21AM Keryl wrote: My situation sounds similar to others, most similar to Pringles1. I had implants and a routine mammo identified microcalcifications. (no lump)  I was put on watch, but by the time they \"changed\" I needed an excisional biopsy which identified DCIS only. From there I had a MRI which indicated some additional suspicious areas, hence, I immediately opted for a masectomy and immediate reconstruction on my left side. The pathology came back with DCIS and IDC and 4 positive nodes. This was not what the MD expected based on the initial mammo & excisional biopsy, but it was there! and only finally determined by the more major action & pathology. My advice - act early and act aggressively. If I had not opted for the masectomy, I am not sure I would have found all of this as quickly....and even so, it was also in my nodes so that was very upsetting; resulting in chemo and radiation. I just had my one year mammo on my \"good\" side; they did find some microcalcifications \"within normal range\" - I am 50 years old. I am now thinking about whether I should have/or should have a prophmasectomy on the right.,  My oncologist is not in favor of it and feels it is not nescessary to remove healthy tissue - BUT based on how quickly things progressed for me, I am re-thinking AND definitely would encourage you to at a minimum, get an extensive biopsy and insure you have as much information about your Dx. Please, please request and/or insist on an excisional biopsy. In my experience, the augmentation had no impact on all of this and MD said so, as well. The only thing that came up was that there are only specific doctors that are best with needle biopsies when implants present. I would go for excisional if microcalcs since it takes a slice of tissue Hope this helps.   ",
      "MessageIndex": 5,
      "PostDate": "16/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/734063",
      "Title": "detecting a lump when you have implants? keljam1 Cris30"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Keryl wrote: I was just diagnosed with DCIS grade 3; I am debating between lumpectomy and masectomy. Am having MRI next week. I am reading all about skin saving masectomy - thinking I might be an easier candidate because of existing implants. Not sure. Two more weeks until I my next consult with surgeon and PS. I cant stand the wait. Trying to focus on work and kids, I think I am in denial. I am ready for action, but have to ignore it all until I get more info. Online is confusing......thanks for listening. Dx 5/13/2008, IDC, 2cm, Stage II, Grade 3, 4/9 nodes, ER+/PR+, HER2- Surgery 7/29/2008 Lymph node removal: Left, Sentinel, Underarm/Axillary; Mastectomy: Left, Right Chemotherapy 10/1/2008 AC + T (Taxol) Radiation Therapy 3/1/2009 Breast, Lymph nodes Surgery 9/14/2009 Reconstruction (left); Reconstruction (right) Surgery 4/24/2011 Reconstruction (left) Surgery 5/15/2014 Reconstruction (left): Latissimus dorsi flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/706527",
      "Title": "Anyone have implants, then get DCIS Keryl LUVmy2girlZ"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Feb 17, 2009 01:24AM Keryl wrote: I had the BRCA testing also and was negative. My dr. had me go for counseling also,as I do have some other cancer in my family on both sides (mother and father) I was told that about 5-10% of all breast cancers have a hereditary component; but another 15% are termed \"familial\" meaning that there is likley a genetic susceptibility within the family.which cannot be specifically identified. Familial breast cancer also involves the presence of environmental contributions or triggers. The counselor will talk to you about your family health history on both sides of your family to see if they think there might be some familial genetic suceptibility based on that info. (though it is hard to quanitfy) I have a 20 year old daughter so I went to counseling to find out more about what she should do ; test 10 years earlier than my onset etc.  It also reinforces frequent testing and monitoring of your situation going forward. I did not have a bilateral,  but unilateral, and this somewhat has influenced me to think about it should anything look even slightly suspicious.  Not sure what your situation is, but that was my experience with the counseling.  The counselor wrote a letter that recapped our discussion and sent it to me and to the oncologist, so on my next appt. will discuss again with him.  He thinks my greatest risk is reoccurance from the first side, not so much to worry the second side. Either way, I worry about both!  I hope it is helpful to you. I am of the opinion that more information is better ....to a point,  and I think the discussion I had with the genetic counselor was a good one.    ",
      "MessageIndex": 1,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/729198",
      "Title": "BRCA1 & 2 testing shelloz1 gfigman"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Feb 21, 2009 04:26PM Keryl wrote: I had what is termed in the materials \"Comprehensive Analysis\" which inlcudes full sequence and large rearrangement analysis of the BRCA 1 & 2 genes. Is that what you refer to as the full test vs. the founders test? I have not heard the founders terminlology in my materials or from the genetic counselor, but sounds like I had the full test.  Thanks.",
      "MessageIndex": 6,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/729198",
      "Title": "BRCA1 & 2 testing shelloz1 gfigman"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Jun 18, 2008 11:38PM Keryl wrote: I am having nipple sparing surgery next month with masectomy on the left side. I will have expander under muscle (saline implant that they enlarge over time ) that I may or may not xchange for silicone once at the desired size/fit.   Dr. said my nipple placement may not be perfect afterwards and I can either leave it or have a lift on either side. I am pleased I have the option of nipple sparing as that was the component most distressing to me. Funny, I have never really liked my nipple, but then in this situation, it is a whole new world. The decision on sparing the nipple should not just be aethetic, but with oncology  considerations.   ",
      "MessageIndex": 9,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707530",
      "Title": "mastectomy nipple vonnie dfleaman"
    },
    {
      "AuthorID": "Keryl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67602/profile",
      "Content": "Apr 13, 2009 11:22PM Keryl wrote: Hi Lynnea. Both my parents a passed in 2007. It was a huge blow. My Mom had been ill with a chronic condition for over 10 years, then my Dad plummeted in her later years, and then quickly thereafter. I spent so much time caring for them, working fulltime,  navigating their issues from health & medical to health benefits to housing to personal belongings to safety to financial to emotional to anger to then to depression  - my parents referred to my outside assistance as the \"jailor\" or being put in the \"slammer\" -- I used to cry (sob) so hard because I was doing the best I could.   While I know it is costly, I tried the best I could for good care and peace of mind. It was worth it --even though I dont think they would be satisfied because they did not live to infinity and beyond....... (ok , but they were age 76 and aged 81)  I have a lot of issues about this, but was jolted into reality with my own diagnosis in May '08. While I am not a blamer, I dont think all of that helped. I miss my parents dearly and sometimes long for their words and their hugs. (I am 50!) I still can hear my Mother's voice during consoling moments and in quite moments I have to reconcile my situation with them. My best friend (who is also a MD) said do what you need to do, do not have regrets......take good care of yourself. I am glad your mammo was benign, but even so, we are still vulnerable - if you are in this situation, take care, get help, eat and exercise well. Remember, you can only do the best you can and even then, it may not be enough.....take care.",
      "MessageIndex": 1,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732425",
      "Title": "Are you a Caregiver for a parent? lynnea lynnea"
    }
  ]
}