{
  "AuthorID": "kestrelgurl…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
  "Posts": [
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Jun 27, 2013 03:33PM kestrelgurl wrote: dfwmom, I completely understand about the waiting and wondering if it could have made a difference. My large tumor appeared seemingly out of nowhere and I went to my ob/gyn who sent me for a mammo/ultrasound. Nothing showed despite a very palpable mass and I was told (still have the letter) that it was benign fibrous tissue and to come back for another check in 6 months. I lasted 4, went in and the by now visible mass still did not show up on screening. Luckily for me, the radiologist went with his gut and did biopsies where they found both ILC and CLL/SLL. I was told the ILC had probably been cooking for 8-10 years......during which I had gotten multiple screenings. Would catching it sooner have made a difference? Most likely. Does stressing over that do anything for me NOW? Not at all. The best thing I have learned from all of this is to stay in the here and now. It's really all that we are guaranteed.....cancer or not.....I don't want to waste it. Sending positive energy to TX. :-)",
      "MessageIndex": 14,
      "PostDate": "27/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/806567",
      "Title": "Not officially diagnosed... dfwmom70 alcb70"
    },
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Aug 29, 2012 10:41AM - edited Aug 29, 2012 10:42AM by kestrelgurl I had my first AFT procedure about a month ago and am planning for 1 or 2 more prior to getting TE's. I do seem to notice that the radiated area feels softer and more pliable. Not to mention there is a thin layer of fat covering my bony chest. PS harvested fat from a small incision in my bellybutton and injected into both sides of my chest - right side to deal with rads damage, left side to work on concavity as it was actually more sunken. I had been told by other PS's that a flap surgery was my only option - Lat or one of the PAP or TUG, which were not something I was willing to do. I was thrilled when my PS suggested AFT as an option as I found it much more palatable. Yes, it will be a long process and will involve numerous moderately invasive procedures, but I feel good about the whole thing. I was small breasted and want to be the same again, even though I am ok with going flat if it doesn't work. PS told me he expected the odds of a positive result to be 80-90%. I spoke to a friend's PS and he was aware of the AFT studies, but liked to stick to things he was familiar with and could count on a good result. He did say that I was a great candidate and that the biggest problem for PS's was finding people willing to take a risk on new procedures. I am excited to be on the cutting edge and would love to provide hope for others with a successful result. Will see PS to schedule AFT #2 in mid-September and will keep you posted.",
      "MessageIndex": 85,
      "PostDate": "29/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Jun 27, 2013 09:28AM kestrelgurl wrote: dfwmom, Sorry to hear that your suspicions were confirmed, however there is generally a huge difference between diagnosis and \"leaving my husband to care for our children alone\".......even though it is hard to believe at the time. The first few weeks are absolutely the worst. Once you have a plan and start treatment, things get easier because you are actively fighting. Definitely ask for anxiety meds if you need them.....no need to be a sleep deprived hero. ;-) Don't google too much; until you know the pathology, it is all a guess anyways and it's easy to scare yourself. Don't borrow trouble. I am about 18 months out and I know it sounds cliche, but this cancer crap has helped (forced) me to make much-needed life changes that have me happier and more content than I have ever been. Hard to imagine, huh? Try to relax......distract yourself.....go see a funny movie (Heat?).....anything to escape for now. Hug your kids.....know things will change. Some for the worse, some actually for the better. You can, and will, do this. :-)",
      "MessageIndex": 10,
      "PostDate": "27/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/806567",
      "Title": "Not officially diagnosed... dfwmom70 alcb70"
    },
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Jul 12, 2012 12:34PM kestrelgurl wrote: bkala, Not to scare you, but I had multiple clear mammograms and ultrasounds in the months and weeks prior to being diagnosed with ILC (one sneaky bugger). I still have the letter from the radiology center telling me that my palpable mass was benign four months before the biopsy made the correct call. If I could do it again, I would demand a biopsy sooner rather than later.",
      "MessageIndex": 18,
      "PostDate": "12/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790039",
      "Title": "palpable mass - negative mammogram bkala SpecialK"
    },
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Apr 7, 2013 11:01AM kestrelgurl wrote: I second the Miaderm suggestion. And maybe some very soft camis or tanks that will feel good against her skin. Some very lounge wear that she can wear around the house, and maybe even out, would also be nice. A little good chocolate might also be a nice touch. :-)",
      "MessageIndex": 2,
      "PostDate": "07/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802912",
      "Title": "Care Pacakge doubleAA danawp"
    },
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Jul 25, 2012 03:44PM kestrelgurl wrote: Not a Stage IV and hope I am not intruding, but I wanted to say \"Congratulations!\" and thank you for starting my day off with a big smile! :-) So happy for you all!",
      "MessageIndex": 6,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791079",
      "Title": "I became a GREAT Grandmother last night!! meima-Bev Karen2012"
    },
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Jun 28, 2012 04:17PM kestrelgurl wrote: mom22ja, I just wanted to let you know that I am sending a virtual hug and all the positive energy I can muster to you. You are not alone.",
      "MessageIndex": 2,
      "PostDate": "28/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789809",
      "Title": "Just picked up my pathology report - OH NO! mom22ja mom22ja"
    },
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Jul 26, 2012 08:13PM kestrelgurl wrote: I used Miaderm during my 28 rad sessions and it worked really well. It wasn't as sticky as Aquaphor and was not all that expensive. I used a total of 3 tubes and did not burn badly at all. It has been 6 months and you can barely see the treated area.",
      "MessageIndex": 4,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789646",
      "Title": "Has amyome used Miaderm? CatFromFL Ulightup"
    },
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Nov 14, 2011 07:42PM kestrelgurl wrote:  Thanks for the positive thoughts! Now that I am able to run (3.5 miles this morning) and ride my bike, I am a LOT happier.  Starting radiation on Thursday and excited to get started. The BMX is healing well and I have much less nerve pain. That helps a lot with sleeping and sleeping improves everything. Have pretty much decided not to worry about reconstruction and, instead, everytime Victoria's Secret has a sale, I will drop $20 in the vacation jar and take my flat chested self on a fabulous trip.",
      "MessageIndex": 6,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/777664",
      "Title": "Dual pathology? kestrelgurl kestrelgurl"
    },
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Nov 9, 2011 07:07PM kestrelgurl wrote: Thank you for the responses. Just back from meeting with both chemical and radiation oncologists. Was set up for radiation treatment which will begin next week. Have been told that it isn't too bad. The will follow up with hormone therapy. The bone marrow biopsy showed that the lymphoma was present, so that makes it officially chronic lymphocytic leukemia (I imagine I will learn how to spell that eventually). Plan is for watchful waiting on that as I am stage 0, symptom free and my blood work looks good. Saw surgeon yesterday and got approval to start working out again, so that should improve my mood immensely. Went for a 30 minute jog this morning. Nervous about this because I don't DO sick, but plan to just keep doing. Gail",
      "MessageIndex": 4,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/777664",
      "Title": "Dual pathology? kestrelgurl kestrelgurl"
    },
    {
      "AuthorID": "kestrelgurl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "kestrelgurl wrote: Apparently breast cancer alone wasn't considered enough of a challenge for me as I have been diagnosed with both invasive lobular carcinoma and small lymphocytic lymphoma.I am a 53 y/o runner/cyclist in what appeared to be excellent health. Grrr..... I am 3-1/2 weeks post bilateral mastectomy (BMX?) w/o reconstruction and am recovering well. The more tests they do and the more I read, the less panicky I am about the BC and the more worrisome the lymphoma becomes. Have had every test in the book. Waiting for bone marrow biospy results this week and should finally get some treatment options. Oncotype score was 15, which was the first speck of \"good\" news in weeks. Has anyone had, or heard of someone who has a similar concurrent pathology? I can't find anything out there that even remotely comes close and would love to find out more. Gail - ILC, CLL/SLL and squamous cell carcinoma? Yeppers, I won the cancer lottery. Dx 9/10/2011, ILC, 6cm+, Stage IIB, Grade 2, 2/3 nodes, ER+/PR+, HER2- Surgery 10/12/2011 Lymph node removal: Right, Sentinel; Mastectomy: Left, Right Radiation Therapy 11/7/2011 Breast Hormonal Therapy 1/1/2012 Surgery 2/11/2013 Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Surgery 6/7/2013 Reconstruction (left); Reconstruction (right) Hormonal Therapy 6/11/2013 Femara (letrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/777664",
      "Title": "Dual pathology? kestrelgurl kestrelgurl"
    },
    {
      "AuthorID": "kestrelgurl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "kestrelgurl wrote: I have been reading a few posts about others who have used taping for pain and LE and thought it might be appropriate to start a thread. I have been \"taped\" by my LMT twice in an attempt to prepare the tissue for begining the reconstruction process (fat grafting --> TE's --> implants). She puts the tape on my scars, and then does LE taping on the right side where I had lymph nodes removed and radiation. While I hope the prep work pays off, I am amazed by the reduction in my nerve pain and skin hypersensitivity when I am taped. All of the burning disappears almost immediately. We assume the taping interrupts the pain pattern sort of like how a TENS unit works. Anyone else have this very welcome side effect? Gail - ILC, CLL/SLL and squamous cell carcinoma? Yeppers, I won the cancer lottery. Dx 9/10/2011, ILC, 6cm+, Stage IIB, Grade 2, 2/3 nodes, ER+/PR+, HER2- Surgery 10/12/2011 Lymph node removal: Right, Sentinel; Mastectomy: Left, Right Radiation Therapy 11/7/2011 Breast Hormonal Therapy 1/1/2012 Surgery 2/11/2013 Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Surgery 6/7/2013 Reconstruction (left); Reconstruction (right) Hormonal Therapy 6/11/2013 Femara (letrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/790875",
      "Title": "Kiniseotape for post-BMX & rad pain kestrelgurl kestrelgurl"
    },
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Aug 24, 2012 05:49PM kestrelgurl wrote: I stood in the shower for about 10 minutes prior to removing the tape. I also found it helped to hold down my skin right at the edge of the tape and just inch it off a bit at a time. Not pleasant, but tolerable.",
      "MessageIndex": 6,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/790875",
      "Title": "Kiniseotape for post-BMX & rad pain kestrelgurl kestrelgurl"
    },
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Aug 30, 2012 12:23PM kestrelgurl wrote: .....riding a roller coaster (actually ALL the roller coasters ) at Disneyland, something I NEVER would have done before BC. I was always afraid of rides, but I guess taking 28 \"rides\" on the radiation table helped me get over that. Went with 4 girlfriends, one who just completed her treatment, and had an absolute BLAST! One of the funnest days ever! I smile whenever I think of it. Now I want to take my kids (24 & 26) for the first time and am planning a girl's trip to Magic Mountain. Whoda thunk it?",
      "MessageIndex": 11,
      "PostDate": "30/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/792750",
      "Title": "Finally found myself...... Momof2inME ck55"
    },
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Jun 9, 2012 01:30PM kestrelgurl wrote: nibbana, I don't think my chest looks \"terrible\", but I am of the mind that a little more muscle might help fill it out. I have been doing a couple of TRX workouts a week and have been getting stronger. I'm not sure that my chest looks any better......well it does in the upper portion; there it pretty much looks as it always did. But my lower chest is now just ribs with a little muscle on top. I was feeling pretty good about it all, and then read some posts about how upper body exercise can prompt or worsen LE. Even said not to do plank which would make it tough to keep the belly toned. Hope someone has insight.....until then I will keep getting stronger.",
      "MessageIndex": 2,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/788853",
      "Title": "Muscle tone for the flat-chested nibbana coraleliz"
    },
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Jun 21, 2012 09:25PM kestrelgurl wrote: Wow! This was great to read. Not that I am happy that everyone has post-BMX pain, but it is nice to know I am not the only one. Like another poster, I didn't get a ton of guidence on activity and left to my own devices I will push myself.....so I do. BS finally did said I was pushing the limit, but didn't tell me exactly what that meant. At 8 months post-surg, I still have tightness and pain at the location someone else described - where my right breast used to sit. My armpit drives me crazy with a weird feeling. All of seems worse when I am fatigued. It's not as bad as the barbed wire bra feeling right after surgery, but it feels like I am wearing an underwire bra that is about 2 sizes too small.",
      "MessageIndex": 14,
      "PostDate": "21/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/787847",
      "Title": "Significant pain three months post -BMX Wrongchick crystalphm"
    },
    {
      "AuthorID": "kestrelgurl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139088/profile",
      "Content": "Jun 8, 2012 06:23PM kestrelgurl wrote: Shayne, I was diagnosed last fall and was prescribed Ativan (.5mg) to help me relax and sleep after I fell apart in the MO's office while they were trying to do a bone marrow biopsy. I generally take one at bedtime, but do try to skip it occasionally. The PA has said repeatedly that sleep is the most important thing and I do feel better physically and emotionally when I am well-rested. With the start of Tamoxifen came the hot flashes (really bad in the AZ summer!) and even more disrupted sleep and fatigue. Then I got laid off and was really struggling. Was given Celexa which helped with the hot flashes and stopped the crying. I worry about taking multiple meds, so I worked up the courage and asked my RO about MMJ and she said it was certainly worth trying. She had done a lot of research on it and said that it could potentially help with sleep, hot flashes and thermoregulation issues. I did get my card, but haven't gotten to a compassion club yet. May just wait for the dispensaries that are supposed to open in the Fall. Even though I grew up in the 70's, I was never a pot smoker. I have no interest in that. My research tells me that infusing oil or butter and baking with an Indica strain is probably the best route for anxiety and sleep, so that will be my first step.",
      "MessageIndex": 28,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/786627",
      "Title": "Help with Anxiety Shayne Shirlann"
    }
  ]
}