{
  "AuthorID": "kgreene16",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255630/profile",
  "Posts": [
    {
      "AuthorID": "kgreene16",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255630/profile",
      "Content": "Oct 4, 2017 08:35PM kgreene16 wrote: How did things go getting chemo while taking care of a newborn? I am so nervous about juggling everything. Any tips for managing? I hard a hard enough time when my 3 year old was a newborn and I wasn't going through any of this....",
      "MessageIndex": 23,
      "PostDate": "04/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/858763",
      "Title": "just diagnosed and pregnant star2017 star2017"
    },
    {
      "AuthorID": "kgreene16",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255630/profile",
      "Content": "Oct 2, 2017 09:07PM kgreene16 wrote: I was diagnosed at 17 weeks pregnant at beginning of July. I had lumpectomy surgery right away, no general anesthesia as it might not be safe for the baby, just spinal block and fentanyl. I just finished 4 rounds of A/C chemo treatment, which is safe for pregnancy, and I tolerated it very well. I will have taxol, herceptin, and radiation starting 1 week after my delivery at 38 weeks. It awful to be diagnosed and treated while pregnant but it is doable. Let me know if you have any questions and good luck!",
      "MessageIndex": 17,
      "PostDate": "02/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/858763",
      "Title": "just diagnosed and pregnant star2017 star2017"
    },
    {
      "AuthorID": "kgreene16",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255630/profile",
      "Content": "Oct 3, 2017 03:28PM kgreene16 wrote: A/C was not as bad as expected. They call it the 'red devil' so I feared the worst, but it was totally doable for me. You take steroids and zofran the day of treatment and for 4 days afterwards which kept the nausea away and gave me a lot of energy. Day 5 I felt a little nauseous and kind of like I was hungover, but you can take more zofran if its bad enough. I usually got an infusion of fluids around day 7 as I was having trouble staying hydrated and got some headaches (chemo can dry out your body and the baby sucked up any hydration I had left) so the fluids really helped me feel better and flush my system. Each round the side effects got a little worse but usually by day 10 I was back to normal. I worked from home a few days but other than that I kept working the whole time. Everyone has a different experience, but hopefully yours goes as well as mine. And, of course my hair fell out about 2 weeks after the first treatment. After a few days of pulling out clumps all day long my hair stylist came over and shaved it. Also, not as traumatic as expected, I was read for the shedding to stop and I had prepared with wigs and hats. Remember it's just hair, it will grow back! It sounds like you will be having A/C after delivery, right? You may want to see if family and friends can help with the baby if possible on the days you don't feel so great so you can rest. I will be having weekly taxol with a newborn which I am very nervous about so I am right there with you! Also, you should check out Hope for Two's website. It's a support group for pregnant women with cancer. They can hook you up with someone who had the same or similar diagnosis as you and can share their experience. I spoke with someone who had the same diagnosis and treatment as me and now is doing well with a healthy 3 year old! They also have a lot of survivor stories on their website which is encouraging. Let me know if I can answer anymore questions!",
      "MessageIndex": 19,
      "PostDate": "03/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/858763",
      "Title": "just diagnosed and pregnant star2017 star2017"
    }
  ]
}