{
  "AuthorID": "Kharro",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215783/profile",
  "Posts": [
    {
      "AuthorID": "Kharro",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215783/profile",
      "Content": "Kharro wrote: Hi all, I'm 28 and a mother of 2. Was told I had lumpy breast at 19 after freaking out when doing my first breast exam and have been diligent in doing them ever since. For quite a few months I have had the occasional clear discharge from my nipple, but as I have PCOS, thought this could be hormonal as per google searches (curse or blessing?) I also developed a very thick vein running down the breast and through areola. A few months ago I also noticed the side of the same breast (left) was harder and tender to touch, and would hurt for some time after being touched, and I also had a lump under and to the side of the areola. It feels like it's either two lumps, or one extended one, like a bubblegum ball under nipple and a thick shoe lace extending from it, tender to palpate but not painful as such. My breast also has this on an off grazed/stinging feeling and is a little fuller and lower than the other. I didn't rush off to the docs, and waited to see if it changed with monthlys. It didn't so saw doc who referred me to breast clinic. Saw them within the 2 week referral. The consultant was rude and abrupt and condescending, but anyhow, he said he couldn't feel the lumps but could feel thickening on side where it had been tender and harder so off to ultrasound. After a quick (maybe 30-60 second) ultrasound of only the areas of concern, I was told nothing to see. No cyst, nothing. Consultant gave me leaflet on breast pain. Said most likely cyclic (it isn't, I've been monitoring and know my own breasts) and sent me on my way. No other screening, no follow up. What am I supposed to think about this. Is this right? Lumps, pain, and spontaneous discharge and sent away due to clear u/s. It didn't sit well with me so I saw a nurse practitioner this morn who can feel everything I feel the lumps but not the thickening, but said that she's felt BC before and this isn't it because the lumps don't feel like rock and aren't tethered, but wants me to see a qualified doc on Wednesday for second opinion. So....what are these lumps/thickening, and why aren't they showing on ultrasound. The only history I have is great grandma died from BC, and great aunt died from leukaemia. My nana did 8cm of breast tissue removed but my mum said this was b9. I would be be great full for any advice/opinions Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/831595",
      "Title": "Lump, pain & discharge but clear/negative ultrasound Kharro Kharro"
    },
    {
      "AuthorID": "Kharro",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215783/profile",
      "Content": "May 19, 2015 06:16AM Kharro wrote: I have an appointment with a doctor tomorrow to discuss my concerns and get a second opinion. I was so sure that it would be a cyst/cysts due to hormone problems I have with PCOS. But since nothing was seen, concerns set in. I just want to know with 100% confidence what it is so that I can clear my head of any worries. And wondering if anyone had similar experiences, I guess to know whether i was worrying too much or if i should keep pursuing it. Thank you for your input so far and I will update tomorrow",
      "MessageIndex": 4,
      "PostDate": "19/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/831595",
      "Title": "Lump, pain & discharge but clear/negative ultrasound Kharro Kharro"
    },
    {
      "AuthorID": "Kharro",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215783/profile",
      "Content": "May 20, 2015 07:46AM Kharro wrote: update..... I saw a different doctor today. I first informed her on my family histort of cancer which I was only made aware of last week, as I don't generally interact with my birth mother. The doctor then examined me, and like everyone I have seen, can feel the areas of concern, and suggested that because the ultrasound didn't show anything, it could just be a normal change in breast tissue. It was at this point I asked her if it was common the changes I have experienced would occur in one breast only. She said not usually but can happen. I then asked her if she could be 100% sure it was nothing to worry about. She said no, and on that basis she said she would refer me for a second opinion. We also noticed that when my hands are on my hips and pushed forward, there is two slight lines of indentation. Looks similar to cellulite. She didn't think it was concerning. So, to sum up, I will go to a different hospital for a second opinion. I appreciate that this is most likely benign changes. But I can't afford to risk going with a \"maybe\", so I am glad that it will be investigated again and hope to get definitive answers this time.  ",
      "MessageIndex": 5,
      "PostDate": "20/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/831595",
      "Title": "Lump, pain & discharge but clear/negative ultrasound Kharro Kharro"
    },
    {
      "AuthorID": "Kharro",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215783/profile",
      "Content": "May 20, 2015 07:58AM Kharro wrote: forgot to mention, the doctor also said it feels as though one of the ducts could be inflamed and has come to the surface. What does that mean? I've never heard of that problem?",
      "MessageIndex": 6,
      "PostDate": "20/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/831595",
      "Title": "Lump, pain & discharge but clear/negative ultrasound Kharro Kharro"
    }
  ]
}