{
  "AuthorID": "khixie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157862/profile",
  "Posts": [{
    "AuthorID": "khixie",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157862/profile",
    "Content": "khixie wrote: Hi all -- I'm newly diagnosed with BC -- specifics below.  I have a 2.5 cm tumor and DCIS which means that I need a mastectomy on my left side.  Some additional background: I am a 43 year old single mother by choice of a beautiful, spunky 3 year old who I adopted and have had since she was born.  Above everything else:  I want to LIVE and raise my girl and see her reach a ripe old age.  I'm basing my treatment choices on that premise above other considerations.   I am large breasted (F cup) and have a stocky build.   I just met with a plastic surgeon who recommended a TE at the time of mastectomy with permanent reconstruction later because there is some chance that I'll need radiation, in addition to chemo.  My inclination prior to seeing her was to do a TRAM flap but after hearing her description of it, I'm not so sure.  It seems complicated with a longish recovery and according to the Plastic Surgeon at least 8 months to a year away.  Additiionally, the breast with the TE is unlikely to match my other breast because of the limit on how much saline can be injected into it.  I was also planning on a reduction on my right breast but it sounds like that wouldn't happen until later in the treatment process.  I'm concerned about being off balance for the better part of a year (with the likely size difference in the TE w/ saline and my other breast) and then the limitations of reconstruction in matching the other breast.   Now I'm considering bilateral MX for the following reasons:  reduction of risk of bc in the right (now healthy) breast, balance in both the short and long term, better chance of a symmetrical outcome with reconstruction (either with a silicon implant or TRAM flap) .  I'm less concerned about the reconstruction at this point but would love to hear from other folks about their decision to have bilateral MX vs a single MX.  I need to make my decision within the next week.  Yikes! Thanks.  Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "03/08/2012",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/791499",
    "Title": "Bilateral MX or Single? What was your experience & thinking? khixie 2FriedEggs"
  }]
}