{
  "AuthorID": "kibbles",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
  "Posts": [
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Jul 16, 2009 10:12AM kibbles wrote: In your age group the most common lump is a fibroadenoma (benign).  Characteristics of fibroadenomas are that they are round, mobile, and have well-defined borders.  I have been diagnosed with three of them in the last year, and I am in my early 30's.  Some fibroadenomas hurt, others do not.  Mine hurt quite a bit.  It's good that you're getting this checked out, but don't worry too much--at your age, fibroadenomas are the most common reasons for solid breast lumps.",
      "MessageIndex": 1,
      "PostDate": "16/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/737511",
      "Title": "25 Years old and Just found a Lump AmyMarie AmyMarie"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "May 23, 2010 10:31PM kibbles wrote: I am in my early 30's and have had four lumps removed this year via excisional biopsy, the most recent two weeks ago.   All four were benign fibroadenomas.  I have to go for ultrasounds every 6 months and it's very stressful.  I don't know why I'm getting so many lumps all at once--before this, I never had any breast problems other than fibrocystic breasts.  This year I also started getting cysts, but they were tiny and did not need to be aspirated.  I see a breast surgeon regualarly b/c of all the lumps.  I still have one more lump that we're just observing b/c it's so tiny and in an inconvenient location to remove.  I am not doing anything diet-wise to contribute to this--I don't smoke, drink, or consume any caffeine at all.  I also eat a very low-fat diet and only consume organic dairy products.  I have never taken birth control pills.  I feel I have some sort of hormone imbalance but I don't know what to do about it. It is very frustrating, and I am hoping that these lumps stop appearing!",
      "MessageIndex": 4,
      "PostDate": "23/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752855",
      "Title": "Can you please answer my questions? flower123 nekk1977"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Aug 18, 2009 05:49PM - edited Aug 18, 2009 05:49PM by kibbles I recently had a mole removed and the biopsy also showed lymphocytes in the path report.  I asked my derm what that meant and he said it is means nothing--but that the pathologist has to document everything that is in the sample, but that it has no negative implications for there to be lymphocytes there.  Not sure if this is the same for a breast biopsy.  Check with your surgeon to make sure. ",
      "MessageIndex": 1,
      "PostDate": "18/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/739158",
      "Title": "Lymphocytes found in biopsy jc268 jc268"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Apr 29, 2009 08:22AM kibbles wrote: I haven't experienced what you're writing about, but I had an excisional biopsy about 5 weeks ago and I have numbness next to the incision site, which I was told usually goes away in 6 months to a year, but could be permanent.  It is highly annoying (about the sie of two half dollars), and clothing on the area is uncomfortable.  Had I known this was a possible complication of the excisional I would have thought twice before heading straight into it and skipping the core needle biopsy.  My mass was benign.  In the future, if I need a biopsy again, I will probably get multiple second opinions and weigh the pros and cons of core needle versus excisional more.",
      "MessageIndex": 1,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733308",
      "Title": "permanent deformity after SCN biopsy fulloflife fulloflife"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Jun 16, 2009 01:47AM kibbles wrote: Hi, I had an excisional biopsy done 2.5 months ago and I also have numbess in the area (there were no lymph nodes taken out; finding was fibroadenoma).  The area of numbness is about the size of two half dollars and is right at the area of incision.  The numbess has gotten a bit better, in the sense that I no longer have the weird feelings there (parathesias) nor do I have the senesation that clothing touching the area feels weird and painful, as it did for the first month or so.  But I was told that feeling may or may not return, and that it could take 6 months to a year for it to do so, if it returns. At first, the numbness was really bothersome, but now I think I'm getting used to it, and the fact that the parathesias are gone helped a lot too.  I hope feeling returns soon for you!",
      "MessageIndex": 2,
      "PostDate": "16/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/735938",
      "Title": "I am feeling anxious and I'm Waiting for Test Results Zepher kibbles"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Jun 15, 2009 10:09AM - edited Jun 15, 2009 10:10AM by kibbles I had a surgical biopsy performed two months ago.  It wasn't too bad, I had IV sedation and had no pain at all afterwards.  I had my results one week later, got them at my post-op appointment when my breast surgeon checked to see that the incision was healing okay.  My results were fibroadenoma.  It's been two months, and the incision looks good.  I am hoping for the best for you.  I know this must be a scary time.  One thing you could do is go for a second opinion to another breast surgeon in the meantime before your scheduled surgery date, someone hopefully who you can discuss your concerns with.  That way you could have another opinion.  The other thing you could do is see if the surgeon could do a frozen section on the lump so that you could know preliminary results before you leave that day from the hospital. I discussed with my surgeon before my surgery what he would do if while removing it it looked cancerous.  If it looked cancerous I wanted him to do a frozen section and remove a big margin.  You could go back to your surgeon for another appointment before your surgery and discuss this further.  I went back for another appointment to discuss things further before my surgery with my surgeon.  I think often between the appointment where they confirm the lump and tell you you need it removed and your surgery date, you think of new questions/concerns that you want to discuss with the surgeon, and so making an additional appointment is a good way to discuss those.",
      "MessageIndex": 6,
      "PostDate": "15/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/735876",
      "Title": "Surgical biopsy scheduled and scared Firedancer BlessedOne2"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "May 23, 2010 10:24PM - edited May 23, 2010 10:26PM by kibbles I have had four lumps removed via excisional biopsy, all were benign fibroadenomas.  My most recent excisional biopsy was two weeks ago.  I recommend the excisional over the core needle biopsy.  I was given a choice between either option, but chose the excisionals each time because the advantages seemed to far outweigh the disadvantages.  For me, I did not want to keep getting follow up imaging to check up on the lump after a core needle biopsy.  Also, there is always the chance that the core needle will miss the bad parts of the lump, especially if the lump is large (mine were mainly large).  Additionally, I liked the fact that the excisional is the gold standard in terms of a path report.  I didn't want to have any lingering doubt in my mind about what the lump was.  Also, my surgeon said if the lump I had core needle biopsied continued to grow, it would have to be removed anyway.  Finally, most of my lumps also caused pain, so getting them removed made the most sense anyway regarding that.  Yes, surgery is stressful but I felt that a core needle biopsy would be just as stressful for me as surgery.  (Though I've never had a core needle biopsy).  I think having the sedation drugs on hand with the excisionals made me feel more comforted than doing the core needle biopsy with no drugs at all.  My four excisional biospies were a piece of cake.  The recovery time was quick (they all healed in about 3 days).  My last excisional, which was 2 weeks ago, was amazingly quick recovery time.  My surgery was in the afternoon, and in the evening my hubby and I went out for dinner.  The next day I took off, but went shopping and out for lunch.  By the third post-op day, I felt that the incision was healed already.  I normally don't wear a bra, and the incision felt comfortable enough that at day 4 post-op I went back to not wearing a bra.  The second and third days post-op I had some mild, occasional discomfort in the incision, but I never took anything to take away the pain.   My experience with 4 excisional biopsies has led me to conclude that the breast is not as painful an area to have an incision as other parts of the body.  This year I had a wide excision for a suspicious mole, and that was far more painful, in terms of healing, that any of my excisional biopsies.  ",
      "MessageIndex": 5,
      "PostDate": "23/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752994",
      "Title": "Excisional biopsy vs needle..... catwood kibbles"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Jun 13, 2009 10:16AM kibbles wrote: I found a 2 cm. lump that my breast surgeon believed was a fibroadenoma.  However, he did not think I should get a core needle biopsy because he said the lump was so large that the core needle biopsy may not be able to get samples of all areas equally and might miss the bad parts, if there were any.  Additionally, he said if the lump grew at the 6 month re-check then I'd need another biopsy.  I didn't want to do all those biopsies.  He recommended excision, which I did, and it was indeed a fibroadenoma.  I felt better just having the whole thing removed.  Additionally, on the ultrasound, the lump was moving around so much that I wondered how it would stay still in order to get the core needle biopsy done successfully. ",
      "MessageIndex": 10,
      "PostDate": "13/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/735776",
      "Title": "Can a core needle biopsy actually miss a lump? ghety ghety"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "kibbles wrote: I'm confused about something here regarding the BRCA test.  My breast surgeon told me that if I get tested the results may not mean anything because the relatives in my family with breast/ovarian cancer did not get tested (because they are deceased or refuse to be tested).  After further researching this, it appears that if I am the only person in my family who gets tested, and I get a negative result, that negative result may not mean much if no one else in my family who has breast/ovarian cancer gets tested.  Can someone explain this further?  It sounded like my breast surgeon was saying there wasn't much of a point for me to get tested, since no one else in my family has been/will get tested.  My mother was told the same thing when she went for genetic counseling, and she did not get tested.  I am confused. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/735571",
      "Title": "Getting BRCA test when no one else in family is tested kibbles Mutd"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Apr 21, 2009 10:34AM kibbles wrote: I had three fibroadenomas, and I found that the one that I could feel would fluctuate with my monthly cycle.  It would enlarge (to the point where I could feel it with the lightest touch) in the week before my period.  Then it would get a lot smaller to the point where I could not feel it easily.  It would also get tender at the same time as it enlarged.  I had it biopsied and the result was benign fibroadenoma.  Mine also went through a period where it hurt quite significantly for about 5 months.  An MRI is anohter option for figuring out what it is, as is consultation with a breast surgeon for further guidance.",
      "MessageIndex": 8,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732725",
      "Title": "Cyst or not, comes and goes someoneinaz kibbles"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "May 7, 2009 08:58AM - edited May 7, 2009 09:00AM by kibbles Hi there,  I understand your concern, but keep in mind that the most common solid breast lump for women in their 20's and early 30's is called a fibroadenoma.  It's completely benign, is hard, smooth, (but usually mobile).  That's why your doctor wanted to see if it moved.  They can tell on ultrasound pretty well if it's a fibroadenoma.  However, fibroadenomas can have unusual characteristics but still be benign fibroanomas.  I am 30 and have had three of them.  My last one, which was recently removed via open excisional biopsy, came up out of nowehere (my breast exam was a month before I found it) and it was not there at the exam, and it was 2 cm. when they I found it.  So they can grow rapidly.  Mine also had the unusual characteristic of being very lobulated, whereas they're usually smooth and round, but it was removed in its entirety and found to be a benign fibroadenoma. Anyhow, I have never had a mammogram, just ultrasounds.  This whole process is super scary, I know.  My gyn found my first two lumps a year ago, then I found one myself just two months ago.  It's very uncommon for someone in their early 20's to get breast cancer.  But it's important to get this checked out ASAP so you can limit the time you have to worry.  Try to find a breast surgeon for an evaluation.",
      "MessageIndex": 1,
      "PostDate": "07/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733791",
      "Title": "Freaking out... Dlw TFrye"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Jun 27, 2009 11:35PM kibbles wrote: Yes, Beesie, I think you explained what my surgeon was trying to say very well.  Because the relatives who had the breast cancer cannot/refuse to be tested, my results won't be as informative.  I was confused about this but your explanation makes perfect sense.  My mother went for genetic counseling on this very issue and was told not to get tested for the reason you described--because a negative test would not be informative.  However, despite all the breast/ovarian cancer in the family, my mother was told she was at low risk for the BRCA mutation.  I am still deciding whether or not to be tested.  Maybe in a few years.",
      "MessageIndex": 17,
      "PostDate": "27/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/735571",
      "Title": "Getting BRCA test when no one else in family is tested kibbles Mutd"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Jun 28, 2009 11:24AM - edited Jun 28, 2009 11:27AM by kibbles Thank you for your post, Tweekerbeeker.  Like your family history, my family history is also full of unusual, seemingly unrelated cancers.  Pancreatic, kidney, lung (several times), ovarian, uterine, leukemia, thyroid, prostate, melanoma.  This includes family members on both sides.  Some family members have had two cancers.  I figure there is probably some genetic thing going on here, but I was counseled by my top breast surgeon that I am very low risk for BRCA, and my mother was counseled by a certified genetic counselor that she too was very low risk for BRCA.  I don't think I am ready to get tested, though I may.  However, due to the explanations above, a negative test might not mean much for me, since I would be the first in my family to get tested.  I am particularly concerned about getting pregnant and the effects of BRCA on that.  I am not ready to get pregnant, but I may get tested before I do.  In the meantime, I am doing everything possible to do as much surveillance for cancer as I can.  I get exams from my breast surgeon 3 times a year.  I have had whole breast ultrasound.  I have had two excisional biopsies for suspicious masses (benign).  I am not sure what else I can do at this point.  Mammograms are not recommended for me due to dense breasts and my age (31).  My mother has never had breast cancer.  She has, however, had similar breast problems to me. ",
      "MessageIndex": 19,
      "PostDate": "28/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/735571",
      "Title": "Getting BRCA test when no one else in family is tested kibbles Mutd"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "kibbles wrote: I'm confused about something here regarding the BRCA test.  My breast surgeon told me that if I get tested the results may not mean anything because the relatives in my family with breast/ovarian cancer did not get tested (because they are deceased or refuse to be tested).  After further researching this, it appears that if I am the only person in my family who gets tested, and I get a negative result, that negative result may not mean much if no one else in my family who has breast/ovarian cancer gets tested.  Can someone explain this further?  It sounded like my breast surgeon was saying there wasn't much of a point for me to get tested, since no one else in my family has been/will get tested.  My mother was told the same thing when she went for genetic counseling, and she did not get tested.  I am confused. Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "09/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/735571",
      "Title": "Getting BRCA test when no one else in family is tested kibbles Mutd"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Jul 15, 2009 06:57AM kibbles wrote: I had to have a biopsy, and my rating was BIRADS-3.  I think my breast surgeon is just super cautious.  I had an excisional biopsy.  It turned out to be a fibroadenoma.",
      "MessageIndex": 10,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/737254",
      "Title": "BI-RAD of 4-5 - Biopsy on Monday Sunshine1958 beacon800"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Oct 21, 2009 03:44AM - edited Oct 21, 2009 03:47AM by kibbles I read about the bra theory and breast cancer link a few years ago.  It made sense to me, so I decided to stop wearing all underwire bras.  I only started wearing a very loose, no underwire camisole type thing, instead of a bra.  Or I go braless completely 80% of the time.  Anyway, I've been doing this for about 4 years.  Well, ironically, in the last two years I have had many breast problems--I never had any breast problems before.  In the last 2 years I have developed 6 breast lumps, and have had two removed.  They were benign.  So in my case, I don't think not wearing a bra is helping me any, but I will continue to go braless or wear just a loose camisole if I need more support.  Personally, the theory makes a lot of sense to me, in terms of not restricting lymphatic flow, so I will keep doing it.  However, doing this has not helped my problems any.  Personally, I think my breast lumps are related to intake of dairy products (I don't consume any caffeine and haven't for 10 years).  So I am trying to reduce dairy intake and so far I've noticed a lot of improvement.  In terms of the quadrants of the breast which tends to get cancers, for me it's been all over the place in terms of which quadrants have had the lumps.  The concept of deoderants and upper outer quadrant links worries me, so about 3 years ago I switched to organic deoderants.  Again, doesn't seem to have helped my problems. ",
      "MessageIndex": 4,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742418",
      "Title": "link between bras and breast cancer MayRunner RunswithScissors"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Jul 16, 2009 01:10PM kibbles wrote: It sounds like the next step would be to see a breast surgeon.  If they can feel a lump they will most likely want to biopsy it.  I have had two excisional biopsies on lumps, both were found to be benign fibroadenomas.  I wouldn't wait the six months--go see a breast surgeon who can give you more information about what this might be.",
      "MessageIndex": 1,
      "PostDate": "16/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/737512",
      "Title": "Lump is actually breast tissue? Shannon-GA Shannon-GA"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Apr 10, 2009 08:41AM - edited Apr 10, 2009 09:37AM by kibbles Hi, Your story sounds very similar to my story.  About a month ago I found a new lump in my breast.  I already had two lumps--probable fibroadenomas--that were being monitored via ultrasound.  Fibroadenomas are benign lumps that commonly occur in women in their 20's and early 30's.  They are smooth, round, mobile and Dr.'s can tell pretty well by exam what they are, b/c they feel different than cancer, but they always follow up with imaging studies and often a biopsy to confim. Anyhow, I found this lump in my breast and freaked out because it was big--I would later learn 2 cm--and I had just been for my breast exam just a month before, so I was super freaked out--because nothing was found on exam. Went to my gyn, he said it felt like fibroadenoma--just like my other two lumps.  Went for ultrasound, they said the same thing.  My Dr. asked me--did you recently lose weight?  And yes, I did recently lose weight.  He said that that's probably why I found the lump so suddenly--and it wasn't found on exam--because I lost about 6 pounds and it came off my breasts (which were tiny to begin with).   Anyhow, I went to my breast surgeon who recommended excisional biopsy, which I did, and it turned out to be another fibroadenoma. So in my case, losing the weight led me to find the lump, which my Dr. said probably had been there for a long time, and only became apparent when I lost the breast tissue and was able to find it myself.  But because it was a new finding and seemed to come out of nowhere, given that my last exam was so recent, my surgeon recommended a biopsy, and said that the excisional would be the better choice b/c if we did the core needle biopsy and it grew later on, we'd need to biopsy it again.  I just wanted to be done with it, so I had it removed entirely. Anyhow, hopefully yours is also a fibroadenoma, which is likely given that 80% of all breast biopsies turn out to be benign, and also because you're in the peak age group for fibroadenomas.  My first two were discovered by my gyn when I was 30. Hang in there!  I've been there too! Hugs! ",
      "MessageIndex": 3,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732252",
      "Title": "3 cm lump in left breast mandymonkey nanapat6225"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Apr 10, 2009 07:03PM kibbles wrote: I would also like to add that I was given the choice between a core needle biopsy and an excisional biopsy.  But my surgeon explained that b/c of the large size of my mass, the core needle might miss part of it, and thus the diagnosis might be incorrect, or if we did the core and it grew in 6 months, we'd have to re-biopsy.  Plus if we did the core we'd need to monitor by ultrasound in 6 months, and every 6 months for 2 years to establish stability.  I decided all that was just too much to deal with, so I opted for the excisional biopsy.  Even though it was daunting to have surgery (my first surgery) I'm glad I did it.  It was fibroadenoma, it's out of there, and no more ultrasound monitoring to see if it's growing!  Plus the surgery wasn't bad at all.  I had no pain whatsoever.",
      "MessageIndex": 6,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732252",
      "Title": "3 cm lump in left breast mandymonkey nanapat6225"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Apr 24, 2009 11:47AM - edited Apr 24, 2009 11:49AM by kibbles I did this--found a new lump myself about 6 weeks ago, surgeon said it needed to be biopsied or come out.  I chose the excisional biopsy and skipped the core needle biopsy.  I did it for several reasons.  First, the core needle biopsy sounded almost as bad as the excisional biopsy--but I'd have sedation for the excisional.  Second, the surgeon said that the core needle biopsy can miss the bad parts of the lump and only get the benign parts.  Also because my mass was large he said it was more likely that the core needle could miss the bad parts.  Third, he said that if we do core needle and it grows, in 6 months we will need to re-biopsy--that sounded awful!  The stress that I experienced around finding this lump and up until the surgery was overwhelming--I did not want to go through that again if possible!  And fourth, the lump was tender and was causing pain.  And it seemed to be growing rapidly, so the bigger it got the more pain I thought it would cause.  So for those reasons I decided to go straight to the excisional.  It was a fibroadenoma--totally benign.   However, unfortunately, I got a complication from the excisional: I am left with an area of numbness next to the incision that is incredibly annoying.  It's about the size of two half-dollars.  It's numb and clothing on the area is somewhat uncomfortable.  I was told this can take up to 6 months to a year to resolve, if it ever resolves (could be permanent).  I am now somewhat regretting my decision to head right into the excisional.  I don't think I will rush into any more excisionals without getting a couple other opinions.",
      "MessageIndex": 7,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732928",
      "Title": "skip biopsy and remove lump dlogan momo3esb"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Nov 3, 2009 04:57AM kibbles wrote: I have/had 6 fibroadenomas (two were removed; we're monitoring the others right now).  I am in my early 30's.  One of the fibros that was removed hurt severely.  The pain would be associated with my fibrocystic pain with my cycle, and would be aggravated by the usual fibrocystic triggers.  But this fibro ached and felt heavy.  It felt like a burning, aching pain.  I couldn't touch it and wearing a bra around the area hurt.  It was like this for 5 months, and then the pain went away.  A few months later I had it removed because it grew in size slightly.  Turned out to be a benign fibroadenoma.  Another fibro was very tender but did not have the kind of pain this one did.  Now my remaining 4 don't hurt at all.  I have found immense reduction of my breast pain by cutting out all caffeine and eating very little dairy products.  Dairy products are a huge breast pain trigger for me.  Dairy affected my fibros too.  ",
      "MessageIndex": 3,
      "PostDate": "03/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/742964",
      "Title": "Can Fibroadenoma be really painful? Meaniejr missypie882"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "May 1, 2009 05:54PM kibbles wrote: I have fibrocystic breasts so I've always had breast pain (usually cyclical but sometimes not cyclical) in both breasts, for at least 2 weeks of the month.  However, for a number of years I had severe, focal pain in two areas of my breasts.  I had plenty of exams and u/s there, nothing was found until I developed two fibroadenomas right in those areas.  I thought it was interesting that in the two areas where I had severe pain for years (often non-cyclical) I developed a fibroadenoma in each area.  I had them removed by excisional biopsy.",
      "MessageIndex": 6,
      "PostDate": "01/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732984",
      "Title": "Breast pain ATLgigi Maybe484"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Apr 24, 2009 07:54PM kibbles wrote: I also had two lumps in one breast, one in the other.  Now two are gone (excisional biopsy) and I only have one tiny one remaining (that we're going to continue to monitor).  Both of the excised lumps were benign fibroadenomas.  Both were quite large, both were tender, and one changed with my menstrual cycle (I could actually tell that it would get larger prior to my period, and it would start to hurt.  Then it would get much smaller.)  My gyn found one lump, ultrasound found another, and then one year later I found a third.  So in the span of one year, I had three fibroadenomas. ",
      "MessageIndex": 3,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732993",
      "Title": "2 lumps in one breast... lil_rach Moderators"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Apr 8, 2009 11:00AM kibbles wrote: I cut out all caffeine about 10 years ago--I have the occasional tiny bit of chocolate, but that's it.  Cutting out the caffeine helped immensely with my cyclical fibrocystic pain--got rid of nearly all of it!",
      "MessageIndex": 4,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732109",
      "Title": "Are you doing anything to reduce your breast cancer risk? kibbles lexislove"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Mar 30, 2009 04:45PM kibbles wrote: Thanks for all your responses.  My main concern, actually, is with the cat scan I got--because I've read that one cat scan is the equivalent of like 500 chest x-rays.  So that worries me a lot.  I have always been worried about this and whether or not it will lead to cancer of some type.",
      "MessageIndex": 5,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/731610",
      "Title": "I feel I am high risk due to radiation exposure as teen kibbles AnnNYC"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "May 16, 2009 09:40PM kibbles wrote: I found a new lump just a month after a clinical breast exam by my gyn.  The lump was already 2 cm. when I found it, so it wasn't small.  I could not believe it when I found it, since I had just had the exam--it really freaked me out.  I found it accidentally, when my hand brushed against it by chance.  Went to breast surgeon the next day after I found it, he said it felt like fibroadenoma, had ultrasound, radiologist said the same thing.  Two weeks later had it removed by open excisional biopsy, since it was concerning how it just came up out of nowhere like that and was so large when it was found (since it wasn't there the month before at my gyn exam).  Pathology confirmed it was a fibroadenoma.  They can grow very quickly and get large very quickly.  I'm hoping your lump is benign!",
      "MessageIndex": 9,
      "PostDate": "16/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/734290",
      "Title": "What is considered to be \"early detection\"? tobyholic lvtwoqlt"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "kibbles wrote: I have a patch of skin a little bigger than a silver dollar next to the incision that is completely numb.  It is not over the incision, but next to it.  It is a very odd sensation; I find it very troubling.  Has anyone else experienced something like this with an excisional breast biopsy? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732128",
      "Title": "numbness after excisional biopsy? kibbles barbe1958"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Apr 8, 2009 10:20PM kibbles wrote: Thanks for your replies.  I just had an excisional biopsy--no nodes removed.  The area of numbness also has little muscle spasms of my pec under it; not sure if this is related to the numbness or not.  I think it is improving a little day by day; I had a recent excisional biopsy.  How long have others' experienced the numbness?",
      "MessageIndex": 4,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732128",
      "Title": "numbness after excisional biopsy? kibbles barbe1958"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Apr 16, 2009 11:30AM kibbles wrote: Hi Mandy, Glad to hear you got great news and that it's just a fibroadenoma.  I'm 30 and my gyn discovered a fibro in one breast at my annual exam.  I freaked out, b/c I had never had any kind of breast lump before.  He sent me for ultrasound, the radiologist said fibroadenoma, and they also found a second one while they did the ultrasound that was non-palpable.  They gave me two choices: have a biopsy to confirm or do monitoring every 6 months.  I chose the monitoring, and was monitored for 1.5 years--the two fibroadenomas did not change in size at all (though they can grow and it's not cause for alam, it's just that they tend to biopsy any mass that shows growth, even though fibroadenomas can grow).  Then I found a new lump in my own breast about a month ago, and went for the ultrasound, they said fibroadenoma again, but because this one just showed up all of a sudden, they wanted me to get it biopsied.  So my point is that it's entirely possible that your fibro won't grow at all and will be fine to leave in there, as I did for a year and a half, with ultrasound monitoring every 6 months.  However, one of mine eventually did start causing me pain, though the pain went away after about 5 months.  I also found that my larger fibroadenoma (about 1.5 cm) caused me cyclical pain--it would get tender in the week before my period.",
      "MessageIndex": 15,
      "PostDate": "16/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732252",
      "Title": "3 cm lump in left breast mandymonkey nanapat6225"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "kibbles wrote: Hi,  I have several probable fibroadenomas, all of which have been monitored by imaging for over a year and have shown to be stable.  Two are going to be coming out by excisional biopsy.  One of them was not there on my last exam (which unfortunately was just 2 months ago).  I found it myself and immediately went to see my Dr.  It ended up being quite large when I found it, and that's why it's coming out--because it was not there on exam 2 months ago, or at least not palpable.  The radiologist said it is BIRADS 3, but my surgeon wants it out b/c of the fact that it seemed to pop up out of nowhere.  I am quite worried about it, even though exam and ultrasounds show it to be probable fibroadenoma.  Anyone else have a fibro that seemed to show up out of nowhere or get very large in a short amount of time?  I feel like I do everything I can to prevent these (my mother had one).  I don't smoke or drink, I'm a vegetarian, I consume very little fat in my diet, and I don't consume any caffeine.  I also don't wear a bra.  So I'm wondering why am I still getting these?  There are probably more to come, as I seem to be prone to them.  Anyone have any theories on why women get these?   Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731651",
      "Title": "Experiences with fibroadenomas--worried about mine kibbles Beesie"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "kibbles wrote: I often wonder about the things I can do to decrease my breast cancer risk.  I already do the basics: I don't smoke, don't drink, am at a normal weight for my height, and eat a low fat diet.  I also go for complete breast exams every 6 months to a breast surgeon and also get ultrasounds every 6 months to monitor a few benign lumps.  I am too young for mammograms and my surgeon doesn't recommend them for me.  I have a very distant family history of breast cancer.  However, I wonder what else I can be doing.  Additionally I'm a vegetarian.  I've read a few articles that said that not wearing an underwire/constricting bra can be helpful in preventing lumps because these kinds of bras can constrict lymph movement in the breast area--so I decided to stop wearing bas entirely, and have not worn a bra in about 3 years--however this didn't help me at all as I still keep getting breast lumps.  I've had a number of breast lumps and I have found the whole process of finding them, getting imaging studies done, and excisional biopsies extremely distressing.  What else are others doing to reduce their risk? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732109",
      "Title": "Are you doing anything to reduce your breast cancer risk? kibbles lexislove"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "kibbles wrote: Hi there,  I have long been worried about increased breast cancer risk due to a chest cat scan and multiple (10 at least) chest x-rays when I was 16 due to an infection.  I have read several journal articles stating that radiation exposure of this type as a child or teen can increase a woman's breast cancer rate.   Any thoughts about this? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/731610",
      "Title": "I feel I am high risk due to radiation exposure as teen kibbles AnnNYC"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Jun 1, 2009 07:20PM - edited Jun 1, 2009 07:20PM by kibbles Hi,  I am 31 and had a fibroadenoma removed 2 months ago.  My gyn found 2 fibros a year ago; they were monitored by ultrasound and found not to have changed in a year, so they said I could leave them in since they didn't grow.  Then I found a new lump myself 2.5 months ago--i was terrified!  Went to my breast surgeon, he said it feels like a fibroadenoma, ultrasound also showed fibroadenoma (BIRADS 3), but my breast surgeon felt it should come out since it was a new finding, it was big (2 cm.), and it showed up out of nowhere (I had my clinical breast exam one month before finding this lump myself--it was not there at the time of my exam and it was already 2 cm when it was found so it was growing fast).  So because this was a new finding and because it seemed to show up out of nowhere, and was also quite large, he recommended exicision. I had the excisional biopsy under IV sedation.  It went well.  I was really scared of this surgery as this was my first surgery--I spent the few weeks up until the surgery as a complete and total basketcase.  I could not do anything but worry about the lump and the surgery.  However, it went well.  I would recommend this type of sedation very highly--it is not general anesthesia.  I was given an IV with versed in it and that's pretty much the last thing I remember until I woke up in recovery.  I had absolutely no pain, no redness, no swelling and no issues at all with the excision.  I woke up with big bandages on it that I removed a few days later and just had a steri strip on the incision that fell off on its own.  I didn't even take any pain meds.  I was in the recovery room for one hour after the surgery, went home, took a short nap, and then went out to dinner with my husband.  The next day I took off from work and went out for lunch and to a movie.  I felt great and healed quickly.  Now, the scar looks pretty good two months out. However, the excision has left me with a numb area on top of the incision--I have no feeling there at all, and the size of the numb area is about the size of two half dollars.  At first I had weird sensations there also in addition to the numbness, but those went away after about 3 weeks.  My surgeon thought that just getting it removed would be better, since it was big and the core needle could miss part of it, also, he said if it grew after the core needle biopsy I'd need to have another biopsy.  So that sounded awful.  However, because of the numbness I'm not 100% sure I would have another excisional without thinking more about it.  The numbness may or may not be permanent.    I am going to continue to monitor the other fibroadenomas.  I have had three diagnosed within the last year--I worry about how many more fibroadenomas are going to show up. My fibroadenomas were/are painful, and the pain is cyclical with my period.  ",
      "MessageIndex": 2,
      "PostDate": "01/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/735140",
      "Title": "Fibroadenoma in left/suspicious ultrasound on right breast!! micmash kristie78"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Jun 16, 2009 09:23PM kibbles wrote: Smooth, oval-shaped, mobile lumps are often characteristic of benign fibroadenomas.  I have been diagnosed with three of these within the last year.  My lumps felt to my breast surgeon to be smooth, oval and freely moveable, though the last one I found did not feel freely moveable to me.  Ultrasound also showed smooth, oval, mobile masses.  While fibroadenomas are most commonly found in the 20's and 30's older women can also get them, in my understanding.  My mother had one in her late 30's.  Breast surgeons generally can give you an idea of whether a lump is worrisome to them by the feel, though they generally want imaging tests and a biopsy to confirm.  I had two of my lumps surgically removed, and they were found to be fibroadenomas.   Wishing you benign results!",
      "MessageIndex": 3,
      "PostDate": "16/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/735999",
      "Title": "mobile lump CherylAnn beacon800"
    },
    {
      "AuthorID": "kibbles",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81610/profile",
      "Content": "Apr 10, 2009 03:46PM kibbles wrote: Just wanted to respond to the people who were looking for more info on the excisional biopsy; I had one recently--it was not too bad.  I had IV sedation, which went fine (I was very nervous about it, but I didn't have any negative side effects and just minimal grogginess for the hour in recovery).  I had absolutely no pain at all after the surgery--which I was very surprised about.  A tiny amount of tenderness if I bumped the incision, but that's it.  I did not take any pain meds, not even a tylenol--I didn't need it.  I took the next day off to take it easy and that was enough.   My incision is about an inch long as well; it is still covered by the steri-strip so I haven't seen how it looks yet.  But overall, this was an easy surgery.  I stressed about it like you wouldn't believe; I was a total stress case in the weeks after finding the lump and the surgery.  But everything turned out great; it was benign.   Hugs!",
      "MessageIndex": 18,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    }
  ]
}