{
  "AuthorID": "kieraann",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148412/profile",
  "Posts": [
    {
      "AuthorID": "kieraann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148412/profile",
      "Content": "kieraann wrote: Hello everyone  I'm writing this because I'm at work, but due in the breast clinic in two hours.  Three weeks ago I found a lump, and so I'm in the first phase of investigations.   However there is something a bit unusual about this: work for me is cancer screening policy -  so I know the procedures and all the reassuring stats.  For instance, I know that 90% of lumps are benign, that most women at my age (34) have fibroadenomas not breast cancer, etc. etc. etc. I know how mammograms work, I know what types of biopsy are used, and I've been to pathology labs and watched slides prepared and even mastectomies take place. So you'd think I'd be reassured, right?  No!   Despite all my best attempts to rationalize, I have a nagging worry in my head - what if? what if?  And it's getting louder towards the appointment.  I can't concentrate on anything this morning - I'm worse than useless! I keep flitting from one thing to another, making a cup of tea then leaving it half drunk, starting a task, then abandoning it half way through.  I just want to know!  I just want someone to say - it's OK, it's benign!  Go home and get on with life as normal.  At the same time, I know that many women don't get that diagnosis - and my heart goes out to them like never before.  I went into this field because I wanted to help (my mother and my grandmother have both had breast cancer) and I now feel more committed to that than ever.  I haven't told many people in my life about the scare, but I feel like I really need just to let it out: AAAAAARGH!  Despite everything I know about tests and stats and prognosis... THIS IS STILL REALLY SCARY!!  Thanks for listening!  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/785225",
      "Title": "Despite everything... this is scary! kieraann Blessings2011"
    },
    {
      "AuthorID": "kieraann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148412/profile",
      "Content": "Apr 4, 2012 07:42AM kieraann wrote: Hi Lottielou! First things first - being in pain, and worried, is really horrible.  HUGS FOR YOU! Secondly, I think your doc probably told you to come back because of the phase of your menstrual cycle.  Boobs are lumpy old things, and sometimes these lumps resolve spontaneously after a period (there's no point putting you through unnecessary ultrasound or x-raying if you don't need it - for your own sake!).  That said, I know how you feel about the wait, because exactly the same thing just happened to me - I went to my GP, and because I'm still quite young for breast cancer (though a bit older than you, alas! I'm 34), she told me to wait and see whether it was still there after my period.  It was, so I was then referred.  Though I know it's highly unlikely to be anything malign, it's still been on my mind for weeks!  If the lump is still there after your period, head straight back to your GP and they should send you on to the breast clinic.  You will be referred on a 2 week wait pathway, so you should not wait very long for an appointment... don't go to A&E unless the pain is unbearable as they'll have you wait for hours!  Thirdly, the fact that it hurts is a good sign, believe it or not - pain is not usually a symptom of breast cancer!  I would put money on it being a benign fibroadenoma or an inflamed cyst - nothing to worry about in cancer terms, but annoying all the same.  Fibroadenomas are the most usual cause of lumps in women of your age.    I don't know about the abdominal pain - but remember that there are LOTS of causes of gastrointestinal discomfort, including acute anxiety!     Take care of yourself, and try to keep your chin up!  I know only too well how anxious you feel, but keep reminding yourself that it's HIGHLY unlikely to be anything untoward! Big hugs. x ",
      "MessageIndex": 5,
      "PostDate": "04/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/785194",
      "Title": "New... Lottielou Lottielou"
    }
  ]
}