{
  "AuthorID": "kika2013",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
  "Posts": [
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "Jan 10, 2014 09:19AM kika2013 wrote: Swissmiss-- I was diagnosed in early June and didn't have surgery until almost the end of July. Until I had surgery, I didn't know anything about the hormone status or anything else because my biopsy didn't catch enough cells to test. So it took me about 2 months before I even really knew what was going on. However, my cancer was small and various people (surgeons, etc) reassured me throughout that there was no immediate rush to do surgery. If you were in an emergency situation, you would know it. They all assured me that there was time, and the time I had allowed for an MRI to make sure there was no more cancer elsewhere in my breasts, BRCA testing, and also allowed me time to process what was happening and make a surgery decision that was ultimately the right one for me. I even had one surgeon say he thought no one should be making a decision about how much surgery to have, if given the choice, anywhere near time of diagnosis, because the fear is so great. So though I COMPLETELY understand the urge to just get moving and get it over with, etc. etc., if you can, try to reframe it for yourself and think that you are fortunate to have time, to be able to go through a thorough process of getting information, and to then use that information to make the choices that are best for you. I, too, remember feeling like I was just sitting around waiting all the time (and I had a nice little add-on after I finished radiation trying to work out my hormone therapy--more tests! And waiting!). You will look back someday and see that the path you took was as long as it had to be, and you will be here writing to someone else about trying to patience, sharing your wisdom. Hang in there.",
      "MessageIndex": 2,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/816714",
      "Title": "Diagnosed a week ago... Swissmiss edwards750"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "Aug 16, 2013 06:43PM kika2013 wrote: jennylee--I'm dropping in to say that I was in your exact position--unsure of which way to go, MRI showed a larger area of cancer than ultrasound (like you, it was mostly DCIS and in fact once my tumor was out, it was just about the size both sono and MRI saw), and I had a surgeon tell me that due to the larger area that needed to come out and the very small size of my breast, it was not going to go well for me aesthetically with a lumpectomy (though she would do it and medically, it was fine). I was in right then for a mastectomy, made it a double, but somehow as the days before surgery passed, I became really uncertain even though I kept hearing what the surgeon had said in my head. I had a second conversation with the plastic surgeon I'd met who was to do the reconstruction, and she was very frank with me and said she thought, having met me, that I might be fine with the results of a lumpectomy. That got me thinking. Then due to a series of things that had nothing to do with anything but logistics and geography, I ended up meeting another surgeon (in another state!) who said she thought a) if I was that uncertain I should have a lumpectomy and see how I felt later--I could always do more and b) she thought she could do a lumpectomy on me with a very good result. In addition, because of the location of my tumor, she thought she could get it, the DCIS, and the sentinel nodes all through one incision under my arm. That last part was a totally new concept. I had her do the surgery mid-July, and indeed, everything she said was true. I have one small incision under my arm, she got everything out with great margins plus the sentinel nodes, and my breast looks really pretty amazing considering. There is no second incision on it, so it looks \"whole\" and she said she did a little bit of reconstruction while she was in there, though I have no idea what that really means! But the end result is just a little sort of shadow/indentation on one side that I think anyone but me would not notice. So now I have options in front of me and can make a decision about more surgery or not without the panic of still needing to get the cancer out. I tell you this only to illustrate the fact that just because one surgeon says they can't do something, doesn't mean another one won't be able to. This had never occurred to me, probably because I had no experience at all with surgeons prior to having breast cancer, but in my case it has made a HUGE difference in my peace of mind and my understanding of how to work with doctors. You have time. Don't rush. You can always do more later but you can't do less. I wish you all the best.",
      "MessageIndex": 30,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/808846",
      "Title": "How did you decide on lumpectomy or mastectomy/ livingwithit IrishDancingMom"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "kika2013 wrote: Hi everyone. I am grappling with the mastectomy vs. lumpectomy decision and changing my mind every hour or so! My situation is this: I have IDC, fortunately a slow-growing kind, original tumor was thought to be 8mm but an MRI showed a 2.5cm \"area\" though they are unable to tell me if that's more invasive cancer, DCIS, swelling from the biopsy or what. The good news is the rest of the MRI was clear. The confusing news is that due to the size of the lumpectomy the surgeon would have to do now, I don't have enough breast tissue to have a great aesthetic outcome. She says she would still do it, it's my decision, but that my small breasts make it less than optimal. Also because of this issue, I am considering a double mastectomy so that my breasts will look the same after it's all over. Added to this is my confusion about recurrence rates. She had told me 25-30% chance of recurrence in a breast if I do lumpectomy vs. mastectomy, but I am not seeing this rate anywhere. I'm reading things like there's a 1% chance of getting it in the other breast, not a 25-30% chance. Overall, I'm just very confused about the decision and worried I'll make a rash choice in this moment of panic. I know I can handle a double mastectomy if need be, not afraid of surgery and not really attached to my breasts (since, as mentioned, they are rather small anyway!), but looking for any advice you can offer. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/806452",
      "Title": "having real trouble w/ mastectomy vs. lumpectomy choice kika2013 slv58"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "kika2013 wrote: Hi all, I am trying to make a decision between BMX, which has been my thought for a while now, and UMX, which would require an implant in the other breast to make them equal (I have REALLY small breasts....). I was going to go with BMX, but yesterday heard that I am BRCA negative and am now wondering if it's really necessary to remove the other breast (no cancer found in it). On the one hand, I like the idea of not having to do monitoring. On the other hand, I also like the idea of having a breast that still has feeling. I would have to do the implant, so there would still be surgery on both sides, so another part of my reasoning was that if they were cutting into the other breast anyway I might as well just have mastectomy (I am having a skin and nipple sparing procedure). I keep going back and forth about all of this and wonder if anyone has any thoughts they could share. Thanks so much. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807194",
      "Title": "BMX vs. UMX with implant on other side kika2013 BayouBabe"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "kika2013 wrote: Hi everyone. I've been diagnosed with IDC that was seen as 8mm on a sonogram, then had a biopsy to confirm it was cancer, then had an MRI to make sure this was the only site. It was, but the MRI showed the area to be about 2.5cm, 3 times larger than the original size. The person who called with results told me this may be because of swelling/scar tissue from the biopsy to that area, but there is no way to now. The surgeon I spoke to says she is assuming it's cancer and will need to remove the entire area. Anyone have any experience with this? I am of course hoping it was swelling but not sure what to make of the whole thing. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/806610",
      "Title": "MRI results--confused. kika2013 fifthyear"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "Jan 17, 2014 10:21PM kika2013 wrote: MinaBee-- Being here is a great start to getting help! I think I learned more and squashed my fear more by reading these boards than any other way. I am like you--really not inclined to ask for help or to make a big deal out of things. Unlike you, I'm married and I have two young children, and I felt a lot of pressure to seem \"fine\" for them especially. My husband is wonderful, but took on a lot of the household/child responsibilities during diagnosis and treatment and so I found myself in a strange new land of needing to a) tell people I was not fine and b) asking them for favors left, right and center, especially favors that had to do with getting my children places and taking care of them. It was overwhelming, but because I obviously couldn't leave my 3 year old standing out on a sidewalk at 6pm when no one came to get him, I did it. And I learned, along the way, that people want to help and were glad to do it whenever they could. I was humbled by the support from my friends, and especially from my 21 year old babysitter who, having not much life experience of her own but being a really wonderful person, made herself totally available to me. (I am embarrassed to say I once called her half-naked from the radiation changing room in a panic because I was 2 hours delayed and needed her to drop everything to pick up one of my sons from school. Guess what? She didn't bat an eye and she did it!). Let your sister help you, and as you go on, you will have a feel for who to rely on. And they will amaze you. Breast cancer is just plain no good, but it has the power to show you how strong people who care about you are, and that is some small consolation. I wish you the best of luck. Your diagnosis so far sounds very manageable and I hope it continues that way.",
      "MessageIndex": 7,
      "PostDate": "17/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/817033",
      "Title": "How to ask for help when going through BC on your own MinaBee msphil"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "kika2013 wrote: I had a lumpectomy and sentinel node biopsy on Friday, all went really well, no suprises according to the surgeon and I'm recovering incredibly easily. And all I can think about is my lymph nodes! Before surgery the surgeon said there was a 20% chance of involvement (my stats are an 8mm tumor, low-grade, plus an area around it that showed on the MRI which she assumed to be cancer as well but then after being in there thought might possibly just be dense breast tissue). After surgery she didn't say, though she did say things looked good. She told me to focus on the 80% chance they're clean as opposed to the 20% chance they're not, but of course having listened to everyone say that 80-90% of lumps are benign after biopsy and failing that test, I can't quite do it. I would love to hear how you got through this phase, or your story, or just anything. I need to stop obsessing--what's done is done. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/808099",
      "Title": "had lumpectomy, waiting for results. going nuts! kika2013 Beesie"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "kika2013 wrote: Hi all--I posted this elsewhere but am now seeing maybe this is the right thread for it. I have (had?) stage 1a IDC which may or may not be tubular carcinoma (got a 1 on the Nottingham score, and my original biopsy path report called it IDC with tubular features, but surgery was done elsewhere and just says \"IDC\"--no way to know if it's just different terminology). My tumor was 8mm, and a 4 overall on the Nottingham Grade. I also had some DCIS with it that was low-grade. My surgeon told me at follow-up that the oncologist she consulted said it was not even worth sending the tumor for the oncotype test as there was no way chemo would be recommended. While this of course makes me happy, I also wonder if it wouldn't be good to have it done to know recurrence rates? Has anyone had this scenario? I will be taking tamoxifen for sure, but just wondering if anyone else had not had an oncotype for this reason. Thanks. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/808731",
      "Title": "anyone not get an oncotype test? kika2013 Cathymck"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "kika2013 wrote: Hi all--I posted this elsewhere but am now seeing maybe this is the right thread for it. I have (had?) stage 1a IDC which may or may not be tubular carcinoma (got a 1 on the Nottingham score, and my original biopsy path report called it IDC with tubular features, but surgery was done elsewhere and just says \"IDC\"--no way to know if it's just different terminology). My tumor was 8mm, and a 4 overall on the Nottingham Grade. I also had some DCIS with it that was low-grade. My surgeon told me at follow-up that the oncologist she consulted said it was not even worth sending the tumor for the oncotype test as there was no way chemo would be recommended. While this of course makes me happy, I also wonder if it wouldn't be good to have it done to know recurrence rates? Has anyone had this scenario? I will be taking tamoxifen for sure, but just wondering if anyone else had not had an oncotype for this reason. Thanks. Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "03/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/808731",
      "Title": "anyone not get an oncotype test? kika2013 Cathymck"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "Jan 8, 2014 03:40PM kika2013 wrote: Hi--I just wanted to chime in and a) agree with the other posters about what they think will be recommended and what will happen b) say again that 4mm is very tiny, so that's great news and c) tell you that my tumor, which was 6mm, was also very close to the chest wall. This was noted on the MRI they gave me after my biopsy, which was used to check and see if there was anything in the other breast or anything in the cancer breast they had not seen on mammo/sono. My MRI note also said that in spite of its location, there was no evidence of any invasion into the chest wall, and in fact this turned out to be true. It was just that: the location. So try not to worry too much about that unless someone tells you to. I don't know that they would be able to see that on a mammogram. Also, just to make you feel a bit better, I didn't know anything at all about my cancer until after surgery. They didn't get enough of it in the biopsy to test for hormones, etc. so I was totally in the dark and I know how the waiting is just terrible. The other good news is that my tumor was originally seen as 8mm, but turned out to be 6mm in reality. This doesn't always happen, but it can. If what your doctor meant by two kinds of cancer is that it is DCIS and IDC, well, that's not so awful. DCIS would be preferable, of course, because it means nothing was invasive, but it is very very common for IDC to be accompanied by DCIS. Again, the great news is that of whatever amount of DCIS you have, only that very tiny amount became invasive before you caught it. Good luck. Come here often. Everyone understands.",
      "MessageIndex": 5,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/816627",
      "Title": "Will I need more tests? KLJ KLJ"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "Sep 24, 2013 01:40PM kika2013 wrote: I was diganosed in early June and I don't come here all that often any more, even now. The reason for that is, as everyone will tell you, it becomes more manageable day by day. Yes, there are challenges ahead and yes, it is frightening, but the unknowing and the lack of a plan are the worst of it. My anxiety level today compared to two months ago is almost non-existent, and I am about to start radiation. Please remember also that there are many possibilities as far as your specific cancer goes. It is not necessarily a death sentence or even anything that can't be dealt with fairly simply. That turned out to be the case for me, much to my surprise, and as you will also hear a lot here, most of the people who stay on the boards are here because they need and deserve long-term support. That doesn't mean there aren't people for whom their diagnosis and treatment turn out to be fairly straightforward. I am one of those people and I feel like it's important to know that this is a possibility. No matter what comes next, these boards are wonderful for information, laughs, venting, and anything else. Had I not found them I would not have been nearly as equipped to ask questions and make choices. Good luck. You will be fine.",
      "MessageIndex": 3,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/811564",
      "Title": "In Total Shock!!!!!!! carissabforlife Kiko"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "Aug 22, 2013 09:23PM kika2013 wrote: I had lumpectomy with wire localization about 5 weeks ago and none of it was bad at all. I agree with all advice to just NOT LOOK! (I did this when I had amnios during my pregnancies, too--works for me!). They will bandage you up afterwards and that will stay on until surgery. If you are awake when the surgeon removes it (I was), again--don't look! As someone says above, the idea is far worse than the reality and I really think not having a visual to go with the idea makes it much easier to just move on and forget about it. As for the surgery itself, it was no big deal. I took no pain meds after at all and was at the beach with my kids the next day. There will be some discomfort, I'm sure, but in my case it was totally manageable and I wasn't being a hero at all. I had percoset but never even took Tylenol, only because I didn't need to. You will be fine. Take a deep breath and know you're moving forward and this will go smoothly. Remember: to your surgeon this is a routine procedure he or she has done many times. Good luck!",
      "MessageIndex": 16,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809670",
      "Title": "Lumpectomy Told different stories about wire localization IrishDancingMom dogsandjogs"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "kika2013 wrote: Hi everyone. I have been off these boards for some time, hoping to move on with life after bc last summer, radiation all fall, etc. I was doing so well until this week I had my 1 year scans--a mammo and a breast MRI. I got the call today that the mammo was clear and the MRI showed my breasts were clear BUT MRI also saw something in my right arm pit, near the chest wall, that radiology says could be a lymph node but they aren't sure. So now I need a sonogram and now I am, naturally, terrified. I got all of this in a voicemail so no chance to ask questions. Has anyone experienced something like this and had it turn out okay. I feel like I've gone back in time and so many of you were SO helpful to me a year ago. I am hoping for some wisdom and some reason when I have none myself. Thanks. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/822650",
      "Title": "Something seen on 1 yr follow-up MRI. Terrified... kika2013 kika2013"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "kika2013 wrote: I can't figure out where to post this question but the people on the just diagnosed board were so helpful to me when I was just diagnosed with breast cancer this summer, and I know many of us drop in here to respond to others long after we are \"just diagnosed\" so am hoping someone will have some experience with this issue or could point me to a better thread. I had a stage 1b breast cancer this past summer, had surgery, radiation, still figuring out the hormone therapy. Meanwhile, being a good patient, I went to see the doctor who has done two colonoscopies on me in the last 7 years, after my father died of colon cancer. He was 79 when was he diagnosed with stage 4 and died soon after, but there is no other cancer of any kind in his family or mine, or my mother's. At my last colonoscopy, when I was 40, they found a benign polyp that was pre-cancerous (so, the kind that can turn into cancer), which was apparently not a huge red flag at the time, especially since I was getting screened every 3 years anyway. So I went to the doctor when I finished radiation about a month ago just to tell her about the breast cancer, and she immediately started in about how I'd had a polyp at a young age and now breast cancer at a young age (42) and could very well be at genetic risk for all kinds of cancer. Needless to say, I wasn't expecting this and was terrified. I've managed to calm down some since then, and I have a colonoscopy next week, but meanwhile I also saw a new gynecologist who said the same thing and now wants me to have 2x annually transvaginal sonograms as she also feels I could be at risk for ovarian and uterine cancer based on the polyp and the breast cancer. Has anyone been in a similar situation? I have no idea how at risk I actually am, and can't figure out why no one at either of the major NCI cancer centers where I was treated (surgery, medical oncology, radiation, etc) seemed to think colon cancer was an issue even though I told them about my father, but now these other doctors are raising giant red flags and requesting major screening. I would appreciate any thoughts--feeling pretty confused and just when I thought I was reaching the end of my cancer path, at least for now, I am thrown back into this nightmare of testing and constant screening and fear. I was so lucky with my bc diagnosis but now feel doomed to die young of some other cancer. Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815402",
      "Title": "Not sure where to post this? Breast cancer/colon cancer kika2013 DiveCat"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "Jun 26, 2013 07:14PM kika2013 wrote: Hi DMarie--I'm a little further along than you, but haven't yet had surgery. However, I have decided to do the nipple-sparing mastectomy (both sides) with immediate reconstruction, also going with a fantastic surgeon in NYC. I was also offered the choice between mastectomy and lumpectomy, but in my case I have very small breasts and while the original sonogram imaging showed a very small mass (8mm), and MRI showed the mass with some enhancement around it that is probably DCIS (though I'm still holding out hope it might just be bleeding from the biopsy!), so the lumpectomy size would be pretty large in relation to my breast size. My doctor basically told me that it wasn't a medical decision so much as a psychological decision--ie, did I think I could handle years of screening, biopsies, etc. or would it work better for me to just be done with that. I know myself well and chose the latter. For me, being able to do NSM was part of it--while I'm not wild about the idea of having fake breasts with no feeling in them, knowing they'll still look like \"me\" is comforting. In my case, they'll even be a bit bigger, even with the smallest implants. Im sure that will take some getting used to but some people might argue it's a plus! I'm just a few weeks past my diagnosis and I can tell you that it gets a bit easier every day. I basically spent the first few days crying every 15 minutes or so just out of shock. That has long passed. Hang in there.",
      "MessageIndex": 1,
      "PostDate": "26/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/806764",
      "Title": "Nipple sparing w/immediate reconstruction? DMarie24 mags20487"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "Sep 26, 2013 01:32PM kika2013 wrote: Hi cookiegal and thanks for your reply. I did end up asking for it (the MO I actually saw at the same place wanted it--who knows why he felt differently, but I was glad he did!). It came back a 5, a HUGE relief to me. Best to you and hope you are well.",
      "MessageIndex": 18,
      "PostDate": "26/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/808731",
      "Title": "anyone not get an oncotype test? kika2013 Cathymck"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "Jun 11, 2013 09:45PM kika2013 wrote: Hi--I don't have very complete information yet, just trying to get a handle on what I know. Also, having not seen a breast surgeon yet I am confused by one thing noted on the path report, which is that the total mass is 8mm, but the invasive portion is only 1.5mm and that is is \"not present on deeper sections\" of the biopsy. But the report also says there is no DCIS. So what is making up the rest of the mass? Don't get it. Beyond that I know that the cells are well-differentiated and have tubular features.  Any insight? And thank you!",
      "MessageIndex": 2,
      "PostDate": "11/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/805989",
      "Title": "newly diagnosed, could use some help interpreting kika2013 Moderators"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "Aug 2, 2013 03:23PM kika2013 wrote: Thanks. I think I am going to push for the test. You seem to have had a very similar diagnosis to mine. I'm not sure why they're saying this, but I also haven't talked to the oncologist myself yet so we'll see what he says, too.",
      "MessageIndex": 2,
      "PostDate": "02/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/808731",
      "Title": "anyone not get an oncotype test? kika2013 Cathymck"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "kika2013 wrote: Hi all--I've been lurking here since Saturday after learning Friday I have IDC. The total panic is lifting (a little!) and I got a bit more information today and am just wondering if anyone can help me sort it out. I seem to go from believing I must have more cancer in me that hasn't been found yet to thinking it's not going to be that bad and I'll be lucky with my diagnosis. Roller-coaster. I am so impressed by all of you. For someone like me, just to see the process of people getting through this in real time by reading 6 months of posts is truly, truly inspiring. Thanks. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/805989",
      "Title": "newly diagnosed, could use some help interpreting kika2013 Moderators"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "Jun 27, 2013 04:03AM kika2013 wrote: Hi again--yes, I'm having the same kind--incision under the breast. I will also have a small scar under each arm because they're taking one lymph node on each side. Also, I will be doing direct to implant, meaning the mastectomy and the permanent implants will be done all at the same time (they tell me about 4 hours of surgery). This is possible only if you're not particularly large-breasted and if you aren't interested in going up in size, both of which are true in my case. My particular surgeon has been doing this approach for some time, so I don't think it's new but I do think it's done more by surgeons who are involved in latest techniques, minimally invasive surgery, etc. From what I've been told the surgery isn't horrible--but then again, I'm comparing it to c-sections, of which I've had two. But they don't cut muscle so I think that makes it easier.",
      "MessageIndex": 9,
      "PostDate": "27/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/806764",
      "Title": "Nipple sparing w/immediate reconstruction? DMarie24 mags20487"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "kika2013 wrote: Hi all, I've been on here off and on for weeks as I get through my various treatment decisions. I have so appreciated all the advice and support I've gotten. I now have a question about oncotype tests (that, yes, I should have asked the med oncologist who called with the results but it didn't occur to me at the time). Does oncotype score/recurrence rate assume any therapy other than Tamoxifen (assuming you're ER positive, which I am)? I am wondering if the recurrence rate given by the score is further reduced by radiation therapy if one has a lumpectomy. Any thoughts/knowledge would be great. Hope you are all well and getting through your days with peace and hope. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/810095",
      "Title": "does oncotype score take rads into account or just tamox? kika2013 lekker"
    },
    {
      "AuthorID": "kika2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181461/profile",
      "Content": "Aug 28, 2013 07:09PM kika2013 wrote: Thanks, lekker. So lumpectomy/rads/tamoxifen = the score I was given, correct? I notice you said mastectomy/tamoxifen but left it off the lumpectomy treatment plan.",
      "MessageIndex": 2,
      "PostDate": "28/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/810095",
      "Title": "does oncotype score take rads into account or just tamox? kika2013 lekker"
    }
  ]
}