{
  "AuthorID": "KillerBunny",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263026/profile",
  "Posts": [
    {
      "AuthorID": "KillerBunny…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263026/profile",
      "Content": "Dec 2, 2017 10:59AM KillerBunny wrote: cycling9210, I'm so sorry you haven't heard. I was actually coming bsck to check on you. I got the sane response from the nurse at my doctor's office. I threatened to show up in the waiting room and sit there until they had a walk in spot for me to see a doctor to get my results. They took me seriously, LOL and I got a call back. That said, the nurse did tell me that if it's urgent (although I did feel my results were exactly that) the doctor would prioritize calling the patient. While not the words I wanted, the doctor not being pressed to call worked out in my favor.",
      "MessageIndex": 57,
      "PostDate": "02/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860291",
      "Title": "Biopsies the week after Thanksgiving anyone? DagnyT DagnyT"
    },
    {
      "AuthorID": "KillerBunny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263026/profile",
      "Content": "KillerBunny wrote: This Post was deleted by KillerBunny. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860514",
      "Title": "Odd (I think) Post Biopsy Questions- Help. :) KillerBunny KillerBunny"
    },
    {
      "AuthorID": "KillerBunny…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263026/profile",
      "Content": "Nov 28, 2017 07:37PM KillerBunny wrote: Silly Question.... There isn't anything else that would behave like this, right? If it goes completely away when popped, it is definitely a cyst? ",
      "MessageIndex": 5,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860478",
      "Title": "Cyst Burst During Biopsy KillerBunny KillerBunny"
    },
    {
      "AuthorID": "KillerBunny…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263026/profile",
      "Content": "Nov 28, 2017 07:13PM KillerBunny wrote: Benign, of course, is my absolute favorite part of your reply. I know there is always a chance that it will be cancer, but going from the 30% of Birads 4 are cancer to less than 1% chance, well, I like that.",
      "MessageIndex": 4,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860478",
      "Title": "Cyst Burst During Biopsy KillerBunny KillerBunny"
    },
    {
      "AuthorID": "KillerBunny…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263026/profile",
      "Content": "Nov 28, 2017 06:57PM KillerBunny wrote: Hi MelissaDallas, This seemed like the best possible outcome. The doctor said the area looked like a cyst to her with some debris in it. But that she was confident it was a cyst...and this was before it burst during the biopsy procedure. So, I am feeling relieved...but still a little nervous.",
      "MessageIndex": 2,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860478",
      "Title": "Cyst Burst During Biopsy KillerBunny KillerBunny"
    },
    {
      "AuthorID": "KillerBunny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263026/profile",
      "Content": "KillerBunny wrote: I was sent to a biopsy to rule out a cyst vs. a cystic tumor. The original ultrasound was an anechoic mass with irregular borders. Both the tech and the radiologist thought they looked like cysts (it turned out the irregularity, as best as they were able to guess, was that there were 2 cysts together) and told me not to be too worried. Sure, LOL They used the vacuum guided core biopsy and I didn't watch the first but I did second... the dark area was there, I saw the needle getting close, I heard the vacuum noise and then the dark area was gone. Literally just gone. So, with this being what happened, how likely is it that the biopsy will be benign? I'm guessing high, as the lump is no longer there. But, is this normal? But, I'm still worried. I'm comforted that the tech and rafiologist said not to worry... they wouldn't just say that, right? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860478",
      "Title": "Cyst Burst During Biopsy KillerBunny KillerBunny"
    },
    {
      "AuthorID": "KillerBunny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263026/profile",
      "Content": "KillerBunny wrote: There were a couple of cysts and also a mass that was solid and I have been referred for a biopsy. The 1st mammogram was on 11-9 and the 2nd was on 11-10. The radiologist noted that the mass on the films looks different. Which is freaking me out. It was 24 hours and it changed??? And, if it's changing like this, why isn't it at 5 instead of a 4? Anyway, because of this, the radiologist and my doctor both recommend a surgical biopsy. I'm guessing someone here has been through this, what's the recovery like? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860140",
      "Title": "BI-RADS 4 Diagnostic Mammogram KillerBunny KillerBunny"
    },
    {
      "AuthorID": "KillerBunny…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263026/profile",
      "Content": "Nov 14, 2017 06:33PM KillerBunny wrote: Hi Lenamir Yes, it was visible. The ultrasound findings: Imaging of the left breast showed evidence of dilated ducts in retroaeolar location. Multiple large cysts at 1, 3 and 10o'clock. 12 o'clock position, 1.4 cm irregular contoured anechoic area. There was no abnormal calcifications seen. The breast architecture was not distorted. There was auxiliary lymph nodes with the largest measuring 1.3 cm in size. IMPRESSION: 12 O' Clock position 1.4 CM irregular contoured lesion R/O cyst versus cystic tumor. Suggest biopsy for further evaluation. RECOMMENDATIONS: Surgical biopsy left breast. CONCLUSION: There has been change from the previous mammogram dated 11-9-17. Left breast suspicious looking asymmetry. My understanding is the fact that it changed from one day, literally, to the next is the reason for the recommendation for the surgical biopsy. And, while I know it is surgery, I can't lie, there is a part of me that feels waiting for the biopsy results while knowing it isn't still hanging out in there will almost be easier.",
      "MessageIndex": 2,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860140",
      "Title": "BI-RADS 4 Diagnostic Mammogram KillerBunny KillerBunny"
    },
    {
      "AuthorID": "KillerBunny…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263026/profile",
      "Content": "Nov 14, 2017 07:03PM KillerBunny wrote: Hi djmammo, No. At this point, there seems to be concern that there was noteable change to the area in 24 hours and the recommendation seems to be to remove it now and talk about it later.",
      "MessageIndex": 4,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860140",
      "Title": "BI-RADS 4 Diagnostic Mammogram KillerBunny KillerBunny"
    },
    {
      "AuthorID": "KillerBunny…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263026/profile",
      "Content": "Nov 30, 2017 05:35PM KillerBunny wrote: Just coming by to update....I just got the all clear from my doctor. No evidence of atypical cells or malignancy.  It's all good and fingers crossed for anyone who ever has this happen to them!",
      "MessageIndex": 5,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860140",
      "Title": "BI-RADS 4 Diagnostic Mammogram KillerBunny KillerBunny"
    }
  ]
}