{
  "AuthorID": "Kim1966",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146767/profile",
  "Posts": [
    {
      "AuthorID": "Kim1966",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146767/profile",
      "Content": "Mar 17, 2012 02:22PM Kim1966 wrote: No I wasn't told to come back and neither said anyting about what it could be.  However did did say that he would send a report to my family dr so maybe it will come up then but I am thinking what he saw he is sure it isn't cancer might be something else but that I will deal with if it comes up my main concern was cancer. Thank you both for your imput. Kim",
      "MessageIndex": 3,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/784227",
      "Title": "SHould I still be worried? Kim1966 Kim1966"
    },
    {
      "AuthorID": "Kim1966",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146767/profile",
      "Content": "Mar 21, 2012 05:18PM Kim1966 wrote: Well got a call this morning I have to go back for a MRI now!!!!   WTF!!!!  I kinda was thinking good thoughts and now this apparently there are minor changes from the mammo I had about 5 years ago.  Could they still be checking for cancer?",
      "MessageIndex": 7,
      "PostDate": "21/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/784227",
      "Title": "SHould I still be worried? Kim1966 Kim1966"
    },
    {
      "AuthorID": "Kim1966",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146767/profile",
      "Content": "Kim1966 wrote: I had a routine mammo Feb 21st, my DR office called on March 12 that they needed another one of my left breat only as the first one was undefined?   Still not 100% sure what that ment but then today I go for my 2nd mammo this morning, she told me she was going to take 2 images including a \"cone\" image.  She does one and says let me ask him if this is enough, she coems back and they want the 2nd image.  So after waiting about 15 mins she says they now require a ultrasound.   The girl does the ultrasound and I did see a black oval mass, she tells me to wait and make she the radiologiest has allhe needs.   Wellhe comes back in with her and does it as well,   He says to her I can't find what you did so she tells him 1o'clock and he finds it but doesn't spend alot of time onit does a few more angles and tells me he is done.  I asked him if he could please tell me something.  He said it was unexciting.  I looked confused and he said that is good.  So I repeated....exciting and both of them said unexciting.  However,  I know there was mas cause she measured it and he did find it.   I am trying to think positively cause he did say unexciting but still kinda worried about what it could be.  Any ideas? Thank youl Kim Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/784227",
      "Title": "SHould I still be worried? Kim1966 Kim1966"
    },
    {
      "AuthorID": "Kim1966",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146767/profile",
      "Content": "Mar 21, 2012 05:57PM Kim1966 wrote: Not sure yet I should know this afternoon or tomorrow.  Thanks i am just beyond scared.  I know I am not alone but I was kinda thinking all was ok and now this.",
      "MessageIndex": 9,
      "PostDate": "21/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/784227",
      "Title": "SHould I still be worried? Kim1966 Kim1966"
    }
  ]
}