{
  "AuthorID": "Kim53",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156885/profile",
  "Posts": [
    {
      "AuthorID": "Kim53",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156885/profile",
      "Content": "Jul 25, 2012 04:00AM Kim53 wrote: Jestea, Can your doctor rule out  Paget's disease?  I read you can have symptoms for 6-8 months before diagnosis and can be an alert for underlying ductal cancer.  You should investigate further and switch doctor's until one of them listens to you.  Keep me posted please and God Bless you! Kim ",
      "MessageIndex": 6,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789730",
      "Title": "Clean Imaging, BUT..... Jestea Jestea"
    },
    {
      "AuthorID": "Kim53",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156885/profile",
      "Content": "Jul 21, 2012 05:53AM Kim53 wrote: Barsco, I will probably get the results on Monday.  I was reviewing your diagnosis and felt a bit overwhelmed with what all you have had to endure.  Bless your heart!!  Can I ask your age and how long it had been before last mammo when you found out?  Was it a lump or did they find it on the mammo? I am not sure how to see all your posts on here to see the progression of treatment, etc.  Thank you for responding to my post.  It is theraputic to have a group to connect with.",
      "MessageIndex": 2,
      "PostDate": "21/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790893",
      "Title": "Waiting for results Kim53 Jestea"
    },
    {
      "AuthorID": "Kim53",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156885/profile",
      "Content": "Kim53 wrote: This is my first time posting.  I am 52 (don't know why I put 53 behind my name but oh well...lol) just recently had an incomplete mammo that shows two areas of loosely grouped microcalcifications  in right breast and scattered micros on both breasts.  I am not worried about the scattered as that should be normal for my age.  The loosely grouped have me a bit anxious.  My grandmother, mother, and two sisters had breast cancer.  One sister diagnosed at 48, the other at 52.  I had a follow up MRI a couple days ago and so I am waiting for the results.  We were unable to get the previous records because they were bought by another company and very unorganized so I switched imaging centers.  I had implants in 1986 so possibly from leakage??  Anyone else have implants and if I need a biopsy, what is the best way to go with implants (behind the muscle).  I feel a bit anxious and don't want to talk about it to my family yet and my husband says \"everything will be fine\" to reassure me and I just said \"I know\" but am holding it in.  One step at a time is the only choice but it is hard not to think the worst with my family history. Good news is that if it is something, it is caught early enough because I had a mammo last year and they didn't say anything. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790893",
      "Title": "Waiting for results Kim53 Jestea"
    },
    {
      "AuthorID": "Kim53",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156885/profile",
      "Content": "Jul 25, 2012 03:31AM Kim53 wrote: I got my results back and had to have an MRI to further evaluate.  It was a birads 3 with another MRI in 6 months.  Findings were 2 fibroadenomas in right breast and (1) POSSIBLY .5mm intramammary lymph node or something else in left breast.  So I am in the wait and see category.  Anyone have an intrammary node? I am assuming I am in this category because they don't usually biopsy nodes if that is what it is.  Anyone have one of these and can comment?  I know that women can get them but also saw only 5% have them and they can be/turn cancerous and then spread agressively.  Do I wait the 6 months?",
      "MessageIndex": 3,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790893",
      "Title": "Waiting for results Kim53 Jestea"
    }
  ]
}