{
  "AuthorID": "Kimberli43",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205177/profile",
  "Posts": [
    {
      "AuthorID": "Kimberli43",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205177/profile",
      "Content": "Nov 23, 2014 09:14PM Kimberli43 wrote: Hi Ladies! I'm starting chemo tomorrow 11/24. It is the first of six treatments over 18 weeks. I've been reading all of your posts and am so thankful for the advice. I'm starting to freak out about how I'm going to feel and what side effects will affect me. I guess I'll know soon enough. A question about the Claritin...when do you take it? I get the nuelesta shot on Tuesday. I live in San Diego but grew up in Florida. I am married to a very supportive husband and have a 3 year old son. I went to ungrad at FSU...so I also remain a Seminole. I look forward to getting to know everyone while we take this crazy journey together.  Kimberli",
      "MessageIndex": 399,
      "PostDate": "23/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Kimberli43",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205177/profile",
      "Content": "Nov 29, 2014 05:53PM Kimberli43 wrote: Mrshq1 - A gator married to a Seminole?! I didn't know that was allowed. That must make game day really fun. We have gators and Seminoles in my family too. I did teach my 3 year old the FSU fight song which he sings for me throughout the game. It is game day.....I would be interested in a friendly wager. What do you have in mind? I am on day 6 and finally feeling better. The extreme exhaustion and body pain did me in. I was dizzy and felt spaced out. Day 3 I wasn't able to get out of bed. It was terrible. I was trying to drink lots of water but it was tough. I was able to drink ginger ale. Do you think that's just as good? I don't think I took enough Claritin. Next time more fluids and more Claritin. Any advice for next time? How are you dealing with the fatigue? Any supplements? I can't believe I have to do this 5 more times. Hope everyone is feeling ok. Bonnie - I sent you a message on FB to add me to the secret group. Kimberli",
      "MessageIndex": 493,
      "PostDate": "29/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Kimberli43",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205177/profile",
      "Content": "Dec 16, 2014 08:35PM Kimberli43 wrote: Hi everyone! I'm on day 2 of round 2. So far a little nausea, fatigue and heartburn. Last time day 3-5 was the worst. I started the Claritin earlier this time and will continue to take it for 5 days. Hopefully that will help this time. Last round the bone pain was pretty bad. My hair is still falling out. I haven't shaved it yet. I think it's coming soon. Last time I experienced a lot of foggieness. Everything felt so thick. I couldn't read, watch TV and didn't really want to talk. It seemed to pass by day 6. I had a total breakdown Sunday night before chemo. My anxiety about having to do it again and losing my hair really got to me. I'm better now. I have 6 treatments and still feel overwhelmed that I won't be finished until March. I just want my life back. Anyway.... I hope everyone is doing ok. Praying for minimal SE's.",
      "MessageIndex": 724,
      "PostDate": "16/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Kimberli43",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205177/profile",
      "Content": "Dec 26, 2014 06:11PM Kimberli43 wrote: Erica - I'm so sorry for your loss. I lost my grandfather last year and understand how you feel. Cookies - the cancer center where I get treatment offers free counseling. I've never done counseling before but it has really helped to talk to someone. I don't want to talk to my family about how I feel because they are going through their own stuff with my diagnosis. It might be worth looking into. Also, someone posted on the FB group about a service that will come clean your house while you are going through treatment. I have a question for the ladies who shaved their head...how do you take care of your bald head? Do you use shampoo or regular body soap? Lotion? I did get a wig and a hat wig. My wig is human hair and I feel like it needs to trimmed. Has anyone else had their wig cut? I love my hat wig and wear it every day. Hope everyone had a great Christmas and is feeling good. My second round was better than the first. I took Claritin for 5 days which seemed to help with the bone pain",
      "MessageIndex": 750,
      "PostDate": "26/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    }
  ]
}