{
  "AuthorID": "kimby",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84850/profile",
  "Posts": [
    {
      "AuthorID": "kimby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84850/profile",
      "Content": "Jul 25, 2010 07:26AM kimby wrote: Hi Sweeney,  I did 4 rounds this time last year. It was doable. I followed all the instructions i.e. steroids 3 days before, laxatives to avoid constipation, painkillers etc. In fact I felt so good after the first round i ate some chilly. What a mistake! I ended up with terrible mouth sores. So advice - avoid spicy food. Apart from that I had minor bone aches, twitching eyes and felt tired after day 3. I got lots of rest which helped. Drank lots of water too. My other 3 cycles were very uneventful. Lost all body hair day 18 after 1st cycle. Very traumatic emotionally but I had already selected a wig so that eased the blow. I saw more side effects after treatment had finished. I lost nails on both big toes, they became tender then loose then I noticed a new nail growing underneath so just removed the dead nail on top. Not painful though. My fingernails were also tender and had ridges. they came loose approx. halfway down the nailbed. More irritating and ugly than anything else. Still losing eyelashes periodically. My eyebrows are not back to pre-chemo yet.  I think that is it! Honestly it is not bad. Just follow instructions and you'll be fine. I followed the TC thread and it was very helpful to know that what I was experiencing was normal. You can do it! ",
      "MessageIndex": 4,
      "PostDate": "25/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755819",
      "Title": "TC chemo- what can i expect? sweeney Anna2017"
    },
    {
      "AuthorID": "kimby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84850/profile",
      "Content": "Nov 16, 2009 02:42AM - edited Nov 16, 2009 02:42AM by kimby Hi WickedFran, I had terrible mouthsores. One or two areas appeared on a Friday and progressed horribly over the weekend. When my Onc saw me on the Mon she was shocked. I couldn't even drink water without pain. She prescribed Levaquin - anti biotics - pretty high dose one a day. They kicked in quickly. She also prescribed Xyloxylin which deadened the pain, Carafate  to coat the mouth - which I had already been using, Nystatin for Oral Thrush which I also had. It took about three days for the sores to really calm down. The key is to act quickly before it gets really bad. Get something from your Onc asap.  Good luck!",
      "MessageIndex": 3,
      "PostDate": "16/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/743927",
      "Title": "Major Mouth Sores/Sore Throat wickedfran kimby"
    },
    {
      "AuthorID": "kimby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84850/profile",
      "Content": "Jul 27, 2009 10:27PM kimby wrote: I love this thread. It is so positive I'm glad I found it. I did my first treatment 24th July with minimal side effects. So far just a little tingling in the bones not painful at all. I didn't have a port which was a relief. I'm not sure what to do about the hair - whether to buzz it or not. I guess I should just watch it and see. Wishing everyone minimal SEs. ",
      "MessageIndex": 14,
      "PostDate": "27/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737293",
      "Title": "TC X 4 Solarbeam Solarbeam"
    },
    {
      "AuthorID": "kimby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84850/profile",
      "Content": "Aug 9, 2009 08:59PM - edited Aug 9, 2009 09:00PM by kimby Hi Marie, My hair started thinning on day 14. I happily shaved it off this morning which is day 17. Don't worry if and when it starts thinning you'll be strong enough to deal with it. I was surprised how easy it was. ",
      "MessageIndex": 34,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737293",
      "Title": "TC X 4 Solarbeam Solarbeam"
    },
    {
      "AuthorID": "kimby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84850/profile",
      "Content": "Jul 29, 2009 04:48AM kimby wrote: Hi Janet,Welcome to the discussion. Sorry to meet you under these circumstances but I hope you'll sail through and have minimal SEs with your treatment. For me the C drug is Cytoxan.  Does anyone have any suggestions for getting rid of oral thrush? Came on yesterday and over night. My tongue is completely white. I hope I haven't grossed you out. I have Carafate mouth rinse that was prescribed in case of mouth sores and indigestion. Do you think that'll help clear it up? ",
      "MessageIndex": 16,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737293",
      "Title": "TC X 4 Solarbeam Solarbeam"
    },
    {
      "AuthorID": "kimby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84850/profile",
      "Content": "Aug 6, 2009 12:07PM kimby wrote: Thanks kmmd. It got pretty bad and then progressed to mouth sores. It was so painful. My cheeks were actually swollen. The inside of my mouth was raw. I finally got it under control with Nystatin. The Dr. also prescribed antibiotics Levaquin. Xyloxylin mouthwash for pain and the Carafate mouthwash to promote healing. It didn't affect any other areas. Once i got the meds it took 2 days to get relief. At it's worst water felt like acid in my mouth. Thank Goodness. I think I brought the mouth sores on by eating some spicy food. I certainly will not make that mistake again. I've been through a few new toothbrushes over the last couple of days. ",
      "MessageIndex": 32,
      "PostDate": "06/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737293",
      "Title": "TC X 4 Solarbeam Solarbeam"
    },
    {
      "AuthorID": "kimby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84850/profile",
      "Content": "Nov 20, 2009 04:33PM kimby wrote: Hi All, I have severe burns under my arm also. The skin is raw. I've been washing as usual in the shower with Dove. I have Silverdene which I use on the raw bits and Biafine which I use on the rest of the burns. The nurse told me I would be able to reuse the Mepilex a couple of times but I can't because the wound keeps oozing green/yellow discharge. When does the discharge stop and when does the healing start? Am I applying too much Silverdene? HELP!",
      "MessageIndex": 38,
      "PostDate": "20/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736027",
      "Title": "Severe radiation burns to the breast RCindy"
    },
    {
      "AuthorID": "kimby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84850/profile",
      "Content": "Sep 24, 2009 11:04PM kimby wrote: Hi Ladies, I start rads on 12 Oct can't wait to get onto the next step. My final chemo tx is tomorrow. Praying that all goes well. I've been reading all your posts. V. helpful. I hope as we go through this next step of our journey that we can all be of help and support to one another.   ",
      "MessageIndex": 46,
      "PostDate": "24/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "kimby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84850/profile",
      "Content": "Dec 1, 2009 03:36PM kimby wrote: Hi Ladies, I finished rads on 20th Nov.  I suffered pretty bad skin breakdown under my armpit which started on the last 3 days of full breast radiation and got progressively worse through my boosts. I ended up with a raw ring around my entire breast. My last boost was on 20th Nov and the boost area is still red and raw, the restof my breast is more or less \"healed\". New skin has formed. I am sill using Silverdene on the raw boost area. Since it worked to clear up the other areas I am not overly concerned yet but I am due to start taking Tamoxifen today and I was wondering whether the Tamox would have a negative effect on the healing. I don't want anything to slow down the healing process. Anyone have any thoughts on this?",
      "MessageIndex": 566,
      "PostDate": "01/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    }
  ]
}