{
  "AuthorID": "KiminJax",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
  "Posts": [
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jul 12, 2008 02:18AM KiminJax wrote: Hi Amber, I'm sorry you have to go through this.  Asking about alternatives to Taxol is a good idea.  Also, There have been a couple of times in my treatment when I have asked the doc what the risks are if I wait two or four weeks (or however long) to begin a new treatment.  Usually a short period of time does not make a big difference.  Perhaps you could wait until the kids are back in school allowing you to enjoy the rest of the summer and then get back on some form of chemo.  Good luck.  Kim",
      "MessageIndex": 18,
      "PostDate": "12/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708891",
      "Title": "Progression for me :o( What to do, what to do???? mrs_X_Sunneedazee Barb-FightingBC"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 10, 2008 07:23AM KiminJax wrote: Hi Jill,  I don't understand either.  I believe there is an epidemic of brain mets on this board.  It seems like every day someone new is diagnosed.  Once you know your treatment plan let us know.  My treatment included 15 rounds whole brain radiation, anti-siezure meds (for at least one year), steroids (off them now) and then back to my regular weekly chemo.  God bless and I'm sorry. ",
      "MessageIndex": 16,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724133",
      "Title": "Meningeal carcinomatosis BJW KiminJax"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 16, 2008 02:39AM KiminJax wrote: I have prayed for Brenda.  I always asked the Lord for a healing miracle.  I am glad that she has a friend like you who willl ask for prayer and then be there for her as she takes this next step.  God bless you both.",
      "MessageIndex": 5,
      "PostDate": "16/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722855",
      "Title": "Keep My Neighbor in Your Thoughts and Prayers eag011 LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 3, 2008 03:56PM KiminJax wrote: Hi Annie - I just started the xeloda about 12 days ago.  That is great news!  Kim",
      "MessageIndex": 9,
      "PostDate": "03/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699545",
      "Title": "Xeloda working for me!! AO44 Roja1955"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 31, 2008 08:33AM KiminJax wrote: Ganga, I have had many different chemos and whole brain radiation and never had a reaction like that.  Someone told me once that if you're having a lot of problems with nausea that someone is doing something wrong because there are so many remedies for that.  I don't know what to tell you.  It sounds to me you could use a 2nd opinion here.  Someone should be intervening to help her. ",
      "MessageIndex": 3,
      "PostDate": "31/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723679",
      "Title": "sister in law-urgent ganga ganga"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 5, 2008 11:46AM KiminJax wrote: I am sorry about your 27 year old daughter.  That is so young - not that it's ever a good age to get cancer.  I am BRCA2 positive and my now 25 year old daughter got tested last year.  She is also positive.  While it does create an extra burden for her to know she has an 80% chance of getting the cancer, she is also more diligent with her preventive measures.  She sees a breast health specialist every six months and will have breast MRI's done once each year.  I told her that I never want her to go through what I am going through if she can prevent it.  She knows she wants children and would like to breast feed so her plan is to have her kids and then she will have propholactic surgery.  We just try to have a sense of humor about it (like her breasts will still be pointing to the sky when she's sixty).  My grandmother on my mother's side had breast cancer, my mother had ovarian and breast cancer, I was diagnosed at 47.  It's in the cards and I'm glad she can have more control over her future than I did.  I hope you will reconsider having this knowledge a sword.  I wish she had been negative but since she isn't she can make choices that I couldn't make for myself because I did not know.  Good luck to you and your daughter.  I know it's hard.",
      "MessageIndex": 9,
      "PostDate": "05/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719039",
      "Title": "family and cancer mpieterse LumiPojo"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 30, 2008 02:34AM KiminJax wrote: Holly,  I pray for a speedy diagnosis and treatment plan for your mum and that she can be back home again soon.  God bless.  Kim",
      "MessageIndex": 6,
      "PostDate": "30/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722002",
      "Title": "Mum in hospital Holly01 Holly01"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 18, 2008 08:31AM KiminJax wrote: Hi Bernice,  I'm on Navelbine as we speak.  Everyone reacts individually but I, like Kasey, have found it the easiest chemo I have ever done.  I could do Navelbine forever if it would keep working.  I get it once a week - no breaks.  The only premed I get are fluids because we use a port.  No steroids or anything.  My only SE's are a little heartburn when I leave but it is gone by end of day.  I do take neupogen (self-inject) for four days following but I have done that forever with all my chemos.  The good news is that I had scans last Tuesday and all my tumors reduced in size.  It's the first time I haven't had progression in ages so right now, the Navelbine is working for me.  I really hope you can tackle the SE's.  Take care.  Kim",
      "MessageIndex": 5,
      "PostDate": "18/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719661",
      "Title": "Progression...Navelbine Quest Maya1 Maya1"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 14, 2008 02:38AM KiminJax wrote: Awesome thread.  We have all this in common.  It's always awkward to respond to the \"how long will you do chemo\" question - I hate to make them feel bad but, ummm till it all stops working.  They just don't know.  And I love the take me off the pedestal thing.  I'm tired of being an inspiration.  This really does suck.  I don't want this shit.  I want to be healed but the pattern is set.  So, let's get on like we used to for as long as I can and put the cancer on the shelf.  I'll deal with it as needed and won't hesitate to ask for help.  I love the housecleaning idea!  Hmmmm, I'll have to find a good time to use that one!  Love you all!  Kim",
      "MessageIndex": 22,
      "PostDate": "14/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722715",
      "Title": "people keep asking hezzy nixieschaos"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 22, 2009 11:09AM KiminJax wrote: Stephie, It sounds like you're having a problem free recovery.  It's okay to be scared.  Speaking for myself, I'm scared all the time anymore.  I see a psyc the week but I'm also going to try and let my faith and trust in God surface again as my main source of strength.  Can you imagine the plans He (God) must have for all of us considering how much pain and suffering we have?  I know He loves us and  He says that He has a plan for good for those love him.  God Bless You.",
      "MessageIndex": 21,
      "PostDate": "22/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729407",
      "Title": "Ovaries removed tommorrow -Scared Stefanie MargaretB"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 23, 2008 11:15PM KiminJax wrote: Kelly - one more thing.  When I said I was doing the Abraxane and Avastin in the first phase, keep in mind that I don't know and neither does my doctor if I was really getting the Avastin or not.  When I had the progression and went on the Gemzar and Cisplatin - at that point I was guaranteed to be getting Avastin.  BTW, I started the Gemzar, Cisplatin and Avastin 07/07/2007 and my notes indicate I started a new chemo (thus progression in the meantime) on 01/22/2008 so I had progression within 5 - 6 months.  Kim",
      "MessageIndex": 10,
      "PostDate": "23/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723271",
      "Title": "Opinions Please KellyC saint"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 23, 2008 08:19PM KiminJax wrote: Hi Kelly,  I know it's a difficult decision to make and I can't help you with your decision.  I can share my experience though.  I was in a double blind avastin study called the \"ribbon one\" study.  Neither me or my doctor knew for sure whether I was on it.  However, I was told that if I had progression on the study and I was not getting the avastin before that I would be guaranteed to get it after progression.  I can't remember how long before we checked (3 months or 3 rounds?) but I did have progression and so then was put into the mode of being given it for sure and I hate to tell you this but I still had progression so then was taken off the study and given a whole new chemo.  Similar to the side effects above the blood pressure sky rocketed.  I didn't have any bloody nose but did need to be put on blood pressure medication.  During the first half of the study believe it or not I kept hoping my BP would go up because I knew that was a common side effect and I was really hoping I was getting the avastin.  We know that each woman is different so that is why we have the trials - to see what works with whom and what doesn't.  And, you do get all that special monitoring too - lots of scans.  The only thing my insurance paid for was the drug itself.  It did not pay for the scans and all the extra stuff that went along with it.  Good luck with your decision.  It's a personal choice that only you can make.  I would go on another study in a heartbeat because you never know when one of the studies will result in a cure.  I hope to be around to see it. ",
      "MessageIndex": 4,
      "PostDate": "23/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723271",
      "Title": "Opinions Please KellyC saint"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 23, 2008 11:11PM KiminJax wrote: Kelly,  I'm so glad you are going on your trip with your husband.  If you can, try to put the cancer on a shelf and just have plain old fun.  To answer your question you need to understand what sweetmamma said above.  Avastin is not chemotherapy - it enhances chemotherapy.  So, I pulled out my old notes and in the initial phase I was doing Avastin with Abraxane and after the progression I was doing Avastin with Gemzar and Cisplatin.  So, you will be doing some type of chemo at the same time you are doing the Avastin. One more thing, I was going to Mayo Clinic (still am) and even though the Avastin had been approved by some sort of governing body I called and asked them to give me the Avastin off trial and they would not do it.  I felt so cornered and so angry.  They would not do it off trial - I had to go on the trial if I wanted to get it.  My understanding is that since that time the FDA has approved Avastin for breast cancer so it seems to me you should be able to get it off trial but I don't know.  Man that pissed me off though - I really felt angry (I guess I still am).  Anyway, best of luck to you as you make this decision.  You're the only one that can decide and whatever decision you make is the right one for you.  There are plenty of chemos out there and they'll be plenty of trials in the future (hopefully) if you decide not to do it now.  Good luck and don't let anyone judge whatever decision you make.  It will be the right one for you.  Kim",
      "MessageIndex": 9,
      "PostDate": "23/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723271",
      "Title": "Opinions Please KellyC saint"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 1, 2008 08:52AM KiminJax wrote: Fitz, Maria, all, I share your anger.  I'm going on two solid years of chemo since getting my mets (anniversary on 9/6).  I've been through a long list of chemos that don't work very long before progression.  For two years I put on the \"mask\" and did the \"aren't I remarkable\" thing and really gave everyone the false impression that I'm doing just fine.  BTW, my daughter told me once that when the response is \"oh I'm fine\" that \"fine\" means f-ed up, insane, neurotic, and emotional. I too am going through a period where I'm pissed as hell at this disease.  I'm angry about the chemo, the pills, the s/e's, people that call me on the phone to check on me (rather than do something with me), a husband that doesn't know what to do with me.  I just found out last week that my insurance company, Aetna, has terminated their relationship with Mayo Clinic where I have been going for two years and now I have to find a new oncologist, new facility, everything.   I'm pretty sure my onc told me that the Navelbine I'm on now is my last chemotherapy available outside of clinical trial drugs.  I felt pretty secure at Mayo being leading edge with trials - now I have to find some place completely new.  I'm angry about it all.  We have a right to bitch.  I don't know if we go through seasons where we feel down when we're going through this but we have a right to feel our feelings.  God bless each and every one of us for our endurance.  I think it's okay if once in a while we lose our patience and bitch, cry, moan, rant, scream, and stomp our feet.  It ain't fair.  Kim",
      "MessageIndex": 8,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720432",
      "Title": "Depression, Anxiety and Mets oh my! Fitztwins Fitztwins"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jan 7, 2009 08:55AM KiminJax wrote: I just wrote a whole bunch and it disappeared so I'll suffice it to say \"yea!\" ",
      "MessageIndex": 13,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726887",
      "Title": "Komen announcement PeaceCat Maryiz"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 6, 2008 02:47AM KiminJax wrote: Sending prayers your way Maria for a reasonable and treatable explanation for the d/c.  Don't put the cart before the horse.  Let's assume it's not cancer.  How wonderful that you have this appointment today.  Keep us posted.  Kim",
      "MessageIndex": 1,
      "PostDate": "06/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722329",
      "Title": "another worry? jerseymaria pinkpig"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Apr 29, 2008 01:00PM KiminJax wrote: Congratulations Brenda!  Kim",
      "MessageIndex": 5,
      "PostDate": "29/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704768",
      "Title": "Yeessssss! chemo break!!! Analemma LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 4, 2009 07:14AM KiminJax wrote: I agree with everyone here.  She needs an advocate, someone she trusts that can speak for her wishes.  This is so confusing to us I can't imagine being elderly and trying.  There may be many truths is all of this but someone needs to sort it out.  I agree that a 2nd opinion is impertative.  I don't know that everyone should have to be there but at least two trusted members of the family with ability to understand the medical terminology.  Best of luck because she needs you all at this time.  Love,  kIM",
      "MessageIndex": 14,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730036",
      "Title": "I need your support and advice kisersassy LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 10, 2008 06:47AM KiminJax wrote: If you're feeling chest pain or tightness I would see someone today about it.  Kim",
      "MessageIndex": 1,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724192",
      "Title": "Chest Pain tzane LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Dec 29, 2008 03:11PM KiminJax wrote: Dear Robin,  I also believe that miracles happen all the time and ours is not to ask why or why not but to go with God's will in our lives.  I would discard any number a doctor gave you.  You're on the right track to keep investigating and having such a \"never say die\" attitude.  Best of luck.  You're an inspiration.  Kim",
      "MessageIndex": 5,
      "PostDate": "29/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726511",
      "Title": "I don't plan on going down without a fight freeariesonline LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 7, 2008 04:10AM KiminJax wrote: I pray that if Obama can influence this that he does it sooner than later.  All our lives are depending on it.  I like the idea of a march on Washington.  Kim",
      "MessageIndex": 1,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724017",
      "Title": "Cancer Funding Has Flatlined?! Lesley1 ihatesnowihatesnow"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 3, 2008 06:56AM KiminJax wrote: God bless you in your surgery.  Please let us know how it goes.  Kim",
      "MessageIndex": 11,
      "PostDate": "03/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701425",
      "Title": "Surgery tomorrow! sazylazzy KiminJax"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 19, 2008 02:38PM KiminJax wrote: God bless you Deb for all you have been through.  It sounds like the cranial port will be much more comfortable.  Let's hope all the chemo does the trip.  Love and peace,  Kim",
      "MessageIndex": 151,
      "PostDate": "19/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719376",
      "Title": "OK...the docs have a plan. AlaskaDeb LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 11, 2008 05:10PM KiminJax wrote: Hi Deb, it sounds like a good plan.  Keep us posted and know we're thinking about you and praying for you.  Kim",
      "MessageIndex": 16,
      "PostDate": "11/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719376",
      "Title": "OK...the docs have a plan. AlaskaDeb LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "KiminJax wrote: Hi Everyone,  I just want to share. I am so proud of my 25 (just 25) year old daughter.  The backstory is that I was dx'ed at 47 with the garden variety stage II BC.  My recurrance was in 2006.  In between I was tested for BRCA because my mom is an ovarian cancer survivor and her mother had breast cancer.  Low & behold I came back with the BRCAII mutation.  At first, my daughter didn't want to have anything to do with being tested.  But, when she saw her ob/gyn for an annual the gyn convinced her she really should.  She had the genetic counseling done first and prepared for her test.  Her test came back with the exact same mutation I have.  I explained to her how grateful I am that she has this data and can make choices about her lifestyle, monitoring, etc.  Had I know during my life, I may have made choices to prevent too.  Anyway, yesterday she had her first visit with the breast health clinic and they did a mamogram, and ultra sound.  The clinic will have her come back in six months for an MRI.  Then, her routine will be 6 mths mammy, 6 months later MRI.  Praise the Lord!  Early detection saves lives.  As for profolactic surgery, the doctor does not think it is necessary at this time.  After all, she wants to have babies one day and breast feed. Here's the rub.  The doctor is recommending she go on Tamoxifen for five years.  I know Tamoxifen through me into menopause.  The doctor told her that with young girls it will not do this, they will still have periods and when she is ready to have babies it will take about a year to get the Tami out of her body and then she can become pregnant.  Does anyone have experience with this on the boards?  Taking tami and then having babies?  Just curious. Mostly, I am just so proud of her to face the music at this early age.  But, if she can avoid going through what I've gone through it will be totally worth it.  Kim Dx'ed in September 2004, mets to lungs in September 2006, mets to brain in September 2008. Mets to liver & Spine Nov 08. BRCA2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700680",
      "Title": "Just sharing about BRCAII & Daughter KiminJax deb3girls"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 13, 2009 10:57AM KiminJax wrote: VickiG,  I was just talking to a friend yesterday that I need to have that conversation with my husband letting him know it will be okay to move on.  Then it dawned on me I need to also have that conversation with my adult daughter who might feel like he is abandoning me and her if she moves on.  I've thought about the music I'll have, the scripture that will be read.  I don't think that's abnormal.  I guess we have one last bit of control at the end if we decde these thing. Everyone, If you haven't seen \"The Five Wishes\" I encourage you to look at it.  I got my forms at te hospital but I think they have a website.  The forms should be free  It gave me a lot of peace to complete it.  I'll go back to it again and again I'm sure.  Kim",
      "MessageIndex": 45,
      "PostDate": "13/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730432",
      "Title": "What Song Makes You Go Over The Edge? KellyC cp418"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 15, 2008 05:41PM KiminJax wrote: Wonderful news Joy!  Stay up on cloud nine as long as you can.  Kim",
      "MessageIndex": 8,
      "PostDate": "15/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700455",
      "Title": "If you can believe it JoyRebecca JoyRebecca"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 22, 2008 04:31AM KiminJax wrote: Stephanie, I'm praying for you.  I use your phrase now, \"God is able\" too.  I hope you don't mind.  I cannot imagine this journey without him.  Your faith inspires me.  I pray your pain will be managed soon.  Let the neighbors take care of you and the kids.  God bless your journey and I pray you are more mobile and in less paid soon.  Kim",
      "MessageIndex": 55,
      "PostDate": "22/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721550",
      "Title": "Morphine all day everyday - Things are getting serious TripleNeg lewisfamily503"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 12, 2008 11:38AM KiminJax wrote: Joy, I am so sorry about this progression.  I will be thinking positive thoughts about an effective treatment plan and I will pray for complete healing.  Keep us posted on next steps.  Kim",
      "MessageIndex": 9,
      "PostDate": "12/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700196",
      "Title": "Oh Nooooooo JoyRebecca Dorathy"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 20, 2008 03:32PM KiminJax wrote: Anita,  You're right - we need more miracles!  I can't imagine being a young mom and going through this.  God bless you.  Kim",
      "MessageIndex": 15,
      "PostDate": "20/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702536",
      "Title": "And the hits just keep on coming... Anita1969 MissShapen"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 8, 2008 05:33PM KiminJax wrote: Janis,  Just have fun and don't worry about it.  Have a spare if it flies off and if the spare flies off maybe it was meant to be.  You deserve not to have to worry about it.  Just let that little bald head and those little hairs you have just fly in the wind. ",
      "MessageIndex": 22,
      "PostDate": "08/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720827",
      "Title": "Here is a fluff question I hope you can help me with Fitztwins pinkpig"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 20, 2008 06:50AM KiminJax wrote: Hi Annie,  I start my second round of Xeloda today.  I am also two weeks on and one week off.  I have diligently used creams on my hands and feet everyday.  At night I use \"bag balm\" cover in socks and gloves.  During the day I use Goldbalm ultimate healing because it is not so greasy.  Thus far I haven't had foot problems and only slight drying and tightness in hands.  Of course, I'm just starting off.  but, I will say I am diligent with the creams.  No slacking off.  I heard too many horror stories.  Keep us posted.  Kim",
      "MessageIndex": 1,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700676",
      "Title": "Xeloda---Hand and Foot Syn. AO44 GoldenEyes"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 25, 2008 09:33AM KiminJax wrote: I'm with you for the day Janis - this sucks and I'm sick of playing.  But, you gotta hang in there and I will too.  I love the kick you off the team remark.  Perfect!",
      "MessageIndex": 26,
      "PostDate": "25/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721737",
      "Title": "I quit... Fitztwins ozzie2"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 16, 2008 04:41PM KiminJax wrote: Thank you so much for your prayers and inspiration.  I've had family in this week thank God and now feel a bit lonely as they have all left.  Hubby on way home from work.  Thank God for my church friends who are arranging for driving for me to radiation.  I have 4 down and 11 more to go and then will go back on chemo at some point.  I'm very fatigued and sleep a lot but feel it is healng.  Prayer works and God is able.  Thank you my dear sister friends for your your support.  Love,  Kim",
      "MessageIndex": 32,
      "PostDate": "16/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721221",
      "Title": "requesting your prayers and insight KiminJax TripleNeg"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "KiminJax wrote: Hi Eveyone, Please forgive mispsellings as I'm just out of hopsitla. I was admitted to the ER on Wednesday becase my lungs mets has moved to my brain and I was having seizures while driving.  Discharged yesterday.  Requesting your prayers.  Am I still living iwth cancer or dying from cancer?  I think about Lance Armstrong and this is the path his took and his doing well.  I look to him for inspirtation.  Is there someone out there to look too also?  I'll update you with imore details later.  Love, Kim in Jax. Dx'ed in September 2004, mets to lungs in September 2006, mets to brain in September 2008. Mets to liver & Spine Nov 08. BRCA2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721221",
      "Title": "requesting your prayers and insight KiminJax TripleNeg"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "KiminJax wrote: Hi Eveyone, Please forgive mispsellings as I'm just out of hopsitla. I was admitted to the ER on Wednesday becase my lungs mets has moved to my brain and I was having seizures while driving.  Discharged yesterday.  Requesting your prayers.  Am I still living iwth cancer or dying from cancer?  I think about Lance Armstrong and this is the path his took and his doing well.  I look to him for inspirtation.  Is there someone out there to look too also?  I'll update you with imore details later.  Love, Kim in Jax. Dx'ed in September 2004, mets to lungs in September 2006, mets to brain in September 2008. Mets to liver & Spine Nov 08. BRCA2+ Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "15/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721221",
      "Title": "requesting your prayers and insight KiminJax TripleNeg"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 6, 2008 03:57PM KiminJax wrote: I was initially diagnosed stage II, no node involvement, clear margins, 4 cm.   I had lumpectomy, 4 rounds A/C, 4 rounds Taxol, 7 weeks of radiation.  NED for 1.5 years when it metastisized to lungs.  I would recommend being as aggressive as necessary and doing everything the doc tells you today (assuming you trust the doc).  Kim",
      "MessageIndex": 7,
      "PostDate": "06/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701670",
      "Title": "Informal Poll re:recurrences SISKimberly SISKimberly"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 20, 2008 03:24PM KiminJax wrote: My prayers are with you.  I am so sorry.  Kim",
      "MessageIndex": 76,
      "PostDate": "20/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702566",
      "Title": "Fare Thee Well Love.... joannes_brother lewisfamily503"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 12, 2008 03:52PM KiminJax wrote: Thanks for all of the prayers and the inspiring stories.  I've spent today on the pitty pot but it too shall pass.  I'm really excited about the positive things regarding femara.  Thanks everyone!  Kim",
      "MessageIndex": 9,
      "PostDate": "12/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702033",
      "Title": "kiminjax results KiminJax mom2acat"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 25, 2008 11:47AM KiminJax wrote: Dear Lord, I lay my \"virtual\" hand on Stephanie and pray that you will give her strength, hope, encouragement, and peace as she ponders the question we all ask ourselves.  Lord, help us all to have hearts that are opened enough that we know when it's You calling us home so that we can peacefully make the decision that is so very very difficult.  Lord, I just pray for Stephanie to be renewed, she is your loving servant and I know you must be well pleased already.  I pray you will give her more time here on this earth, but I faithfully and trustfully know that we will all be joined together again one of these days, with You.  And Lord, I pray that all forms of cancer would be eradicated from the face of this earth.  In your Son's precious name I pray, Amen.",
      "MessageIndex": 28,
      "PostDate": "25/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723339",
      "Title": "How long will you fight? TripleNeg pinkpig"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 29, 2008 01:17AM KiminJax wrote: Ahhh, the kindness of strangers and the love of family.  What would we do without them?  I'm learning to let others do for me (such as your hay guy) because I truly believe God works on their heart to do it and it is good for both of us.  I agree, I don't know what I would do without this forum.  I've been posting for a couple of years (I think) but increasingly now and truly get my security and hope here.  I am among friends and am not alone here.  I don't know what I would do without the advice and example of all of you my sisters.  I've learned it's okay to take off the mask as needed and just hate this disease.  I've learned to never lose hope.  I know I'll get through this whole brain radiation thing and be fine.  I'll live with the brain mets and if it turns into someething else I'll live with that too.  But, I can't imagine going through this without all of you.  Thank you sisters.  Love,  Kim",
      "MessageIndex": 15,
      "PostDate": "29/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721895",
      "Title": "whole brain radiation vhqh vhqh"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 19, 2008 10:48AM KiminJax wrote:",
      "MessageIndex": 37,
      "PostDate": "19/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700523",
      "Title": "Your Furry Buddy JoyRebecca heatherpalmerton"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 24, 2008 04:44AM KiminJax wrote: Irina,  She is so cute.  At first I wasn't sure what she was other than a great ball of fur.  Too sweet. ",
      "MessageIndex": 382,
      "PostDate": "24/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700523",
      "Title": "Your Furry Buddy JoyRebecca heatherpalmerton"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 19, 2008 10:51AM KiminJax wrote:",
      "MessageIndex": 38,
      "PostDate": "19/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700523",
      "Title": "Your Furry Buddy JoyRebecca heatherpalmerton"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 18, 2008 08:22AM KiminJax wrote: Hi Yue,   Hope is good for you and for your mom.  I hope she gets good information in Beijing and a treatment plan.  Keep us posted. ",
      "MessageIndex": 20,
      "PostDate": "18/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719408",
      "Title": "rare symptom, HELP! shengyue527 LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 28, 2008 03:50AM KiminJax wrote: Hi vhgh,  I'm newly dx'ed with the brain mets (also have lung mets).  I had a seizure while driving and thank God I did not hurt anyone.  I'm going to finish WBR on October 1.  I think I will have completed 15 rounds.  I am a little concerned that you won't be able to accomplish all of your activities during this time.  My experience is that the radiation is very fatiguing.  I now enjoy sitting in my recliner with my eyes closed most of the time.  I'm not really sleeping but just sitting.  I trust that this will go away once done and I'll have a little energy back.  I do get dizzy and I choose to use a walker temporarily for my own safety.  I have been told I cannot drive until I have gone six months seizure free and I'm supposed to report this so the clock starts ticking to the DMV.  I've also been advised not to report it in case I feel I can drive sooner.  You will need help getting to your appointments for a little while for sure.  I used to be a driver for the ACS Road to Recovery program and I plan to call them once my routine daily visits end on 10/1.  My friends have been great but I can only go so long before feeling a little like a nuisance.  I agree with the others that it is a good time to reach out to neighbors, kids, and get the help you need with your animals.  I've never cared for large animals but this does sound challenging.  Even if someone is there with you to keep an eye on your balance, strenghth, etc.  Good luck and please keep us posted.  This brain stuff is new to me too and I'm still learning through my cyber sisters how to take the next steps.  Love to you,  Kim",
      "MessageIndex": 5,
      "PostDate": "28/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721895",
      "Title": "whole brain radiation vhqh vhqh"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 28, 2008 03:53AM KiminJax wrote:",
      "MessageIndex": 6,
      "PostDate": "28/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721895",
      "Title": "whole brain radiation vhqh vhqh"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 25, 2008 09:01AM KiminJax wrote: Heather, I'm sending positive thoughts that all will be well for your daughter tomorrow.  I'm so glad they will get you the results urgently.  Please keep us posted.  Kim",
      "MessageIndex": 4,
      "PostDate": "25/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720058",
      "Title": "\"STRESSED\" 3 MO scans for me and mammo for 19 yr old daughter. heatherpalmerton heatherpalmerton"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "KiminJax wrote: Well, I had hoped for better.  After two cycles of the xeloda and ixempra my tumors in the lungs are growing again.  Very dissapointing.  I feel like I'm going throught treatments at too rapid a pace.  Since starting treatment for the mets in the fall of 2006 I have used abraxane, avastin, cisplatin, gemzar, xeloda and iexmpra.  I have now been put on femara.  I think they want to give me a chemo break.  While overall I am still hopeful, today I am down.  I took a good old lorezapam to help me through the rest of the day.  DV is staying home from work with me.  I would appreciate your continued prayers.  Also, if there is any \"heads up\" I should no on the side effects of femara I really appreciate it.  Love, Kim Dx'ed in September 2004, mets to lungs in September 2006, mets to brain in September 2008. Mets to liver & Spine Nov 08. BRCA2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702033",
      "Title": "kiminjax results KiminJax mom2acat"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 14, 2008 04:09AM KiminJax wrote: I'm doing Navelbine and (I can't believe I'm saying this) it's my favorite chemo so far.  I've been on several.  It's quick and easy - less than one hour.  I get fluids for about 15 minutes, the Navelbine titrates for 10 minutes and then fluids for another few minutes.  I'm in and out of the chair in less than one hour.  My only side effect is a feeling of heartburn that goes away.  Oddly, I've had progression on Navelbine but he wants me to stay on it.  It is one of the few chemos that can get past the brain/blood barrier. I'm very interested in stem cell transplant.  Is that an option for any of us?  I know a lady who had a stem cell transplant 10 years ago.  She had mets to her liver.  She is still doing great and is cancer free.  I have no knowledge of this procedure though.  Good luck and keep us posted.",
      "MessageIndex": 12,
      "PostDate": "14/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722575",
      "Title": "Waiting stinks... VickiG Maryiz"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Dec 17, 2008 01:11PM KiminJax wrote: I do not have anyone at the hospital I go to but I do have a case manager with Aetna. ",
      "MessageIndex": 7,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726022",
      "Title": "Gathering all the facts looking4answers Judiiiii"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 24, 2008 11:10AM KiminJax wrote: I've never even heard of this until today.  Maryiz - I joined armyofwomen yesterday!  Kim",
      "MessageIndex": 10,
      "PostDate": "24/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723282",
      "Title": "er + link to Parabens ? riverinerabbit riverinerabbit"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 12, 2008 06:40PM KiminJax wrote: Dear Pat, I'm so sorry you're back in the club no one wants to join.  The good news is, we're here for you.  I hope your treatment plan is tolerable and that you can get started too.  You are not alone - I hate this thing called cancer and so does everyone else here.  Good luck sweetie.  Come back often.  Kim",
      "MessageIndex": 1,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719433",
      "Title": "Trip Neg Recurrance....warning long post! wayover20 wayover20"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 8, 2008 09:10AM KiminJax wrote: Alice Jane, that picture is beautiful.  It could be a postcard.  What a sweet dog and a lovely space.  Kim",
      "MessageIndex": 176,
      "PostDate": "08/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700523",
      "Title": "Your Furry Buddy JoyRebecca heatherpalmerton"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 20, 2008 07:03AM KiminJax wrote: Hi Everyone!  I love this thread.  It is the best ever.  I love my little one, buddy, I posted above - the cairn/bassett mix.  We've only had him a little while but seeing all the two and three dog familys makes me want to go back to the HS and get another one.  My cat would kill me though.  I love the little poem about \"If it's broken, it's yours\".  I plan to come back to this thread daily for more pics.  I love you all!  Kim",
      "MessageIndex": 54,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700523",
      "Title": "Your Furry Buddy JoyRebecca heatherpalmerton"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jan 7, 2009 05:27PM KiminJax wrote: Hi Everyone,  I've had I think two rounds of Doxil now.  I too get that heartburn feeling and the instant nausea.  I've thrown up more on Doxil than any other chemo so far.  I'm excited though because it's just once a month and if it works, that's great for me.  Before this I was getting chemo once a week and self-injecting meds 5 days following.  The other se I've been getting is a I wake up with super dry mouth (can barely open it) and so I'm going to try the salt rinse three times a day.  Betsey, it's funny - I lost my hair during whole brain radiation and was told it would probably never grow back again.  It fell out half way through and I have no aspirations of ever seeing it again.  However, the hair on my lets is growing like gangbusters!  No fair!  I can barely bend to shave my legs and it's growing like crazy!  Oh well.... I guess it goes with the territory.  Good luck to y'all.  Kim",
      "MessageIndex": 26,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725478",
      "Title": "Are you (Doxil) Experienced? kelly1215 Bmarie"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 10, 2008 08:51AM KiminJax wrote: Hi Deb, I'm catching up from a few days away and want you to know I am praying for you.  It must be so frustrating to not be able to pinpoint the dx when your symptoms are so scary.  I'm glad you're at home this weekend with family.  Keep us posted.  I'm glad you find comfort in these posts and know you are among friends who are praying for you.  Kim",
      "MessageIndex": 207,
      "PostDate": "10/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719214",
      "Title": "I'm in the hospital AlaskaDeb spar2"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 12, 2008 04:55PM KiminJax wrote: Yue, I have no information for you.  Sometimes there is a lady on our site called Tender is our Might that is knowledgeable.  You and your mom are in my prayers.  I pray you get your visa soon so that you can go.  God Bless.  Kim",
      "MessageIndex": 2,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719408",
      "Title": "rare symptom, HELP! shengyue527 LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 25, 2008 04:57PM KiminJax wrote: Snooch, I applaud your wanting to get active even as a stage IV cancer patient in treatment.  It sounds like you have a lot going on physically that could cause the symptoms you're experiencing.  I just want to throw my 2 cents in and just suggest a lower aerobic routine.  For example, yoga is an excellent way to stay fit, balanced, toned and is in no way an easy workout but is effective without the same strain.  Walking is better on your knees than running.  Swimming is excellent and keeps you cool at the same time.  I really admire your desire.  I am an avid bicycle rider.  I used to run but just lost interest since my diagnosis.  Biking has filled the gap for me.  I take great pride in riding between 50 and 70 miles a week and undergoing treatment on a weekly basis.  I squeeze in yoga when I can just because I love it.  Whenever I finish I bike ride I'm hot, sweaty, a little fatigued (depending) and damn happy because I feel like I'm kicking cancer's butt.  I encourage anyone that is able to stay active doing something so that the cancer can't win.  At least not yet.  Love & Hugs,  Kim",
      "MessageIndex": 5,
      "PostDate": "25/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720003",
      "Title": "Shortness of Breath, Exertion and Hot Flashes DragonGirl DragonGirl"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 30, 2008 07:09PM KiminJax wrote: What great news!  Congratulations. ",
      "MessageIndex": 8,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723634",
      "Title": "Still Dancing mthomp2020 saint"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jul 29, 2008 06:11PM KiminJax wrote: Hi Dana,  I'm keeping my fingers crossed for your mom.  Kim",
      "MessageIndex": 3,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709846",
      "Title": "my mom's update hutspa mimi1030"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Dec 6, 2008 01:29PM KiminJax wrote: Count me in too.  I had my first infusion on Thursday and then went back for neulasta shot yesterday.  They give me decadron and aloxi via my port too.  We shall see.  So far, no bad side effects.  My back really hurts but that may be the neulasta.  I have already done the other chemos you listed.  One of the gals here told me her doctor says that Doxil is the best thing to come down in ages for liver mets.  It made my day to hear that.  Good luck everyone.",
      "MessageIndex": 4,
      "PostDate": "06/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725478",
      "Title": "Are you (Doxil) Experienced? kelly1215 Bmarie"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Dec 10, 2008 11:05PM KiminJax wrote: Kelly & Betsey (and anyone else for that matter)!  I really enjoy Jax and Florida.  I'm originally from Michigan and don't miss the cold one bit!  If you're ever in the area let me know so we can get together for coffee or something. I've had the one injection of Doxil and so far so good except for severe back pain.  I think that may be the neulasta?   Kim",
      "MessageIndex": 10,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725478",
      "Title": "Are you (Doxil) Experienced? kelly1215 Bmarie"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Dec 16, 2008 05:30AM KiminJax wrote: Go Wats!  I wish you the very best outcomes from this trial.  Thanks for carving a path for the rest of us.  Kim",
      "MessageIndex": 28,
      "PostDate": "16/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725936",
      "Title": "Started New Clinical Trial Watson hipchik47"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 20, 2008 06:32AM KiminJax wrote: Congratulations Susan!  I would have had the same question about stable.  There is a sense of security in continuing chemo so I understand the uncertainty.  I hope as the watch and learn that you continue to be stable for years to come and enjoy this time while your body can heal itself.  Kim",
      "MessageIndex": 19,
      "PostDate": "20/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724724",
      "Title": "Results in- can I celebrate this? SunshineSmiles pinkpig"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "KiminJax wrote: Hi Everyone!  I have tried to go to the chat rooms a few times but there is never anyone in the two rooms.  I just tried - no one there and that has been true for me.  Is it my time zone?  Am I doing it wrong?  Thanks,  Kim Dx'ed in September 2004, mets to lungs in September 2006, mets to brain in September 2008. Mets to liver & Spine Nov 08. BRCA2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726946",
      "Title": "chat room question KiminJax Watson"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 3, 2009 04:52PM KiminJax wrote: Thank you too Stephaie.  God is able. ",
      "MessageIndex": 12,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728443",
      "Title": "I'm blue too KiminJax LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 4, 2009 07:48AM KiminJax wrote: Hi Everyone,  Thank you for your prayers - I feel them.  Based on my visit with the onc yesterday and the feedback from everyone here I am convinced it's the oxiocotin.  My onc was shocked at how much my rad onc had prescribed.  He prescribed 20 mg twice a day that it timed released plus 5 mg for break through pain.  I'm going to stop taking them immediately and watch for withdrawl symptoms.  My daughter is here so she can watch me too to make sure I'm not coming off too fast.  They'll be time enough for pain in the future but right now I'm not in so much pain that I need to go through this paranoia.  Thank you ladies.  I don't know what I would do without knowing you are here.  I love you all.  Kim",
      "MessageIndex": 16,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728443",
      "Title": "I'm blue too KiminJax LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jan 26, 2008 04:17PM KiminJax wrote: Hi Laurie - You are not alone.  You are part of a big community of loving support.  I have metastic breast cancer in my lungs.  I was diagnosed in Fall 2006 after about 10 months of remission from my first diagnosis.  I've done several different chemos at this point.  I'm her2- so I'm not a candidate for Herceptin.  I know from these boards there are lots of options so I never feel like I have run out of options.  I come to these boards frequently for inspiration.  I know this is hard but you are not alone.  Kim",
      "MessageIndex": 14,
      "PostDate": "26/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699181",
      "Title": "Help! Looking for someone who has been through the same thing! lburchfi lburchfi"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Apr 10, 2008 01:27PM KiminJax wrote: Hi Wats from a fellow xelodian with crap results.  I think you and I started about the same time and it didn't work for me either.  I got raging hand and foot syndrome along with progression!  I am so sorry it didn't work for you and am surprised that it didn't work for a lot of us!  I'm taking a little chemo break after 18 months and six different types and I'm on Femara.  Who knows - maybe it will surprise everyone and work!  Please keep us posted.  Love,  Kim",
      "MessageIndex": 45,
      "PostDate": "10/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703664",
      "Title": "Xeloda Crappola Watson Watson"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "KiminJax wrote: I didn't want to take away from our other metser that is feeling blue today so I captianed mine different.  Maybe someone can give me some advice.  I have bc mets to the lungs, liver, bones, brain.  I take kepra twice a day, effexor twice a day (total150), I've had lots of back pain so am getting my 3rd spinal tap today.  I do Doxil for chemo, arasept, etc. I have typical GI SE's with horrid constapation.  However, in the last few days I've been feeling what I can only describe as paranoia.  My neighbor thinks its from the oxicoton I've been taking.  I was king 20mg cr twice a day with 5 mg for break through.  I'll be these horrid chills across my arms and chest.  I got these same chills when I was hospitalized with siezures but not before or since.  Now it's the last several days and I become terribly affraid.  Not that I would act out but it scares me to death.  I can''t imagine if I was alone.   Thankfully my daughter is with me right now.  Can anyone help me?  Do you what this is?  I'm scared to death.  And I think I'm afraid of dying but I'm not sure that is what it is.  Please help.  Thanksyou.  Kim Dx'ed in September 2004, mets to lungs in September 2006, mets to brain in September 2008. Mets to liver & Spine Nov 08. BRCA2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728443",
      "Title": "I'm blue too KiminJax LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 1, 2008 05:51PM KiminJax wrote: Liz, I want to put a plug in for needing to develop some type of innoculation or vaccine to prevent this cancer from forming.  I want a cure for myself but my daughter is BRAC positive.  I hate to say it but she is pretty much doomed as her mom (me) has breast ca w/ mets to lung and brains, my mother is a breast and ovarian cancer survivor, and her mom had breast cancer.  My 25 year old daughter cannot get an MRI breast exam paid for by her insurance and I'm not sure they'll pay for a mammo at this time.  Again, if she could get a vaccine that would prevent her from getting cancer it would be my dream.  Now she is settling with the option of having propholactic surgery before mamms or MRI because insurance will probably pay for that.  I was impressed with the Applegate interview.  Who among us wasn't optimistic and brave at first?  Who among us didn't think of ourselves as a fighter, survivor, winner, beater of cancer?  I need my daughters breasts removed (and everything else if I can talk her into it) because I never ever want her to go through this.  Right now it's her best option.  That's just my opinion - heck I could be wrong.  I just love her so much and I'm not optimistic about her future right now. ",
      "MessageIndex": 33,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722024",
      "Title": "Christina Applegate my new hero KiminJax Daffodil"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 5, 2008 07:34AM KiminJax wrote: Hi Jennifer and welcome to the best support group ever.  I'm sorry you're having to join us but you are among friends and you are not alone. ",
      "MessageIndex": 6,
      "PostDate": "05/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722280",
      "Title": "newbie with neck lumps & bone mets cherub LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jul 24, 2008 02:17PM KiminJax wrote: Hi Oz,  Still no symptoms and it's like everything with cancer, the chemo is the only thing that causes problems!  Unfortunately, the various chemos I have had in the last year and a half have only worked for a little while before progression. I am now getting navelbine and my next scans are August 11.  I pray that the navelbine is working.  Kim",
      "MessageIndex": 5,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709600",
      "Title": "Lung mets what r the symptoms ozzie2 ozzie2"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 17, 2008 05:41AM KiminJax wrote: Glad you are back Tender.  Kim",
      "MessageIndex": 44,
      "PostDate": "17/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702319",
      "Title": "Where is Tender ? riverinerabbit Gitane"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 28, 2008 10:33AM KiminJax wrote: Hi Janmarie,  I do not have liver or spleen mets but I do have lung and brain mets and believe there are many reasons to be hopeful.  Honestly, I've not heard a lot about spleen mets but Lord knows someone on this site probably has.  The Xeloda is a good chemo and has been used by many of us here.  I hope someone will come along soon with information about spleen mets that can help you more than I can.  Kim",
      "MessageIndex": 1,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723487",
      "Title": "I need help janmarie deb711"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 6, 2008 05:54PM KiminJax wrote: Hi Crystal,  It was tough for me.  I just finished last week after 15 rounds and it really knocked me off my feet with fatigue.  I'm talking harder fatigue than I have had with chemo.  However, I had no headache or stomach pain.  Simply fatigue, dizziness, some eye floaties.  I'm sure each patient is different but definitely call the doctor for peace of mind.  Good luck.  Kim",
      "MessageIndex": 20,
      "PostDate": "06/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722063",
      "Title": "MOM NOW HAS BRAIN METS! cneal318 TripleNeg"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "May 19, 2008 08:18PM KiminJax wrote: I have the powerport and have never had a problem with yoga, bike riding (20 miles in one trip this week and 32 last week), and aerobic exercise.  I do use light weights though never more than 5 - 8 pounds.  I personally have never had a problem with the port.  I worried at first but once I tried new things - a little at a time - I got more confident that I wasn't harming myself.  Kim",
      "MessageIndex": 6,
      "PostDate": "19/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705709",
      "Title": "Ports & Work-Outs - Any Suggestions?! CalGal lewing"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 28, 2008 02:57AM KiminJax wrote: Deb!  Prayers for continued healing and positive response to the surgery.  Praying for the turn around you need for strength to fight the battlle.  Love,  Kim",
      "MessageIndex": 226,
      "PostDate": "28/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 8, 2008 02:25AM KiminJax wrote: Deb, I'm finally getting a chance to catch up and am so glad you're on the mend.  This thread has lifted my spirits so high today.  I can't wait to try the drunken monkey.  I too think we must have shared some classes together!   Take care and continue on the road to recovery with all your humor in tact!  Love Kim",
      "MessageIndex": 312,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 10, 2009 04:42PM KiminJax wrote: I'm on SSDI in Florida and didn't have too much trouble.  However, I had paid into the system for probably 35 years.  If you are married I think you may be able to claim on your husband's contribution. Kim",
      "MessageIndex": 3,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730449",
      "Title": "Disability ? phoenix9873 LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 7, 2008 05:39AM KiminJax wrote: Hi Crystal,  I hope she is feeling better by now.  The steroids are really hard too I just didn't have the problem with the stomach aches.  However, I'm just now starting to get my pooper back.  Constipation has been a problem for me throughout all of this.  I am taking a lot of meds but I make sure I have a full stomach.  I half my meal first, take the pills and then finish my meals.  I have not had a problem with appetite so this works for me.  Thankfully with the brain rads, there is an end in site.  I visit the onc today and am hoping I can stop the steroids soon.  They have been weaning me off on a weekly basis by cutting the amount in half.  I'm now down to half a pill twice a day.  Moms in my prayers and you too.  Kim",
      "MessageIndex": 27,
      "PostDate": "07/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722063",
      "Title": "MOM NOW HAS BRAIN METS! cneal318 TripleNeg"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 3, 2009 08:19PM KiminJax wrote: Cheryl,  I'm so sorry you are going through this,it isn't fair we should all have screaming fits for each other.  I am not trying to push anything but what I'l trying to work on now is acceptance and faith.  I have cancer, I'll probably neve to to remission though I pray to.  I'm trying to try really hard on praying to go just to let me feel has presence protecting me and to experience peace of mind.  I don't understand what I am so scared of or why I'm going through it but I have to beieve it is in his plan and will and the he works all things for the better for all those who love him.  I choose to love and trust him to protect me and even if this chemo/cancer never goes away, I must trust he has an unbelievable plan for,  I have to.  I have no choice, I Trust In Him.  Love you and God loves you too.",
      "MessageIndex": 13,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728440",
      "Title": "So \"blue\" and trying to push through it mason204 Fitztwins"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 1, 2008 06:00PM KiminJax wrote: Hi Crystal,  I was dx'ed with brain mets a few weeks ago.  I agree with everything Stephanie has said.  Dry mouth has been aided by gaterade for sure.  I was put on steroids but have never had a burst of energy.  My most serious se has been unbelievable fatigue.  I seriously can't keep my eyes open.  But, I had my last WBR today!   Yea!  I had 15 rounds and I've been told I'll still be fatigued for about two weeks and then should start to have more energy.  My hair fell out pretty quick but it's the 3rd or 4th time for me so that may be why.  The doc said it may never grow back this time.  The most satisfying food that I eat has been fresh fruit.  Good luck.  There are many of us living with brain mets and I plan to for a long time.  Love,  Kim",
      "MessageIndex": 15,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722063",
      "Title": "MOM NOW HAS BRAIN METS! cneal318 TripleNeg"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 1, 2008 02:34PM KiminJax wrote: Lung mets here too.  I've been through a lot of chemos like the others.  Navelbine has been the easiest for me.  Good luck.  Kim",
      "MessageIndex": 5,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722098",
      "Title": "Treatment options for Lung Mets, please. Traci-----TripNeg Traci-----TripNeg"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jan 30, 2008 04:45AM KiminJax wrote: I really struggle with the diet thing because there is no clear path.  The Cancer Project insists that a veggie lifestyle is important to no cancer and then I went to a seminar that said the low/no carb lifestyle was essential.  In that one, they didn't even want you to eat grain-fed meat - only grass fed.  It can get so confusing.  And, personally for me, I don't want to deny myself things I enjoy at this stage in my life.  I just wish there was a clear path.  Keep us posted.",
      "MessageIndex": 7,
      "PostDate": "30/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699382",
      "Title": "Low carb diet for metastatic BC? Analemma Irina"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 3, 2009 04:50PM KiminJax wrote: You really are helping but reminding me I'm not alonewith these insane symptoms.  Thank you for your compassion.  Could anyone up to it, please pray for   me and peace of mind and to be ever aware that my saviour lives and carries me.  God bless you all.  Kim",
      "MessageIndex": 11,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728443",
      "Title": "I'm blue too KiminJax LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 3, 2008 06:47AM KiminJax wrote: Hi Deb,  It is tough to deal with the news and it is always in my head.  But, I do find it helpful to remember that we are now treating my mets as a chronic disease, similar to diabetics or people with HIV.  It's a partnership.  I'm the good patient and do what they tell me to do and they give me meds to keep me going.  After reading all of the threads and staying connected here, I know that living with cancer is the new mantra.  There are many women on here that have been living with it for years and years.  I plan to do the same.  Then, since life is a roller coaster, when I feel panicked I know I can also come here for comfort.  Good luck to you.  You are among friends.  Kim",
      "MessageIndex": 10,
      "PostDate": "03/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701460",
      "Title": "How do I cope with mets...anyone want to teach the 101 class?? AlaskaDeb slonedeb"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jul 24, 2008 08:35AM KiminJax wrote: Hi Oz,  I had no symptoms when I was diagnosed via CT scan. It came as a complete surprise (or should I say shock).  No cough, no SOB, no nothin.  Kim",
      "MessageIndex": 1,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709600",
      "Title": "Lung mets what r the symptoms ozzie2 ozzie2"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 26, 2008 02:08AM KiminJax wrote: Crystal, As I read your post I thought of my own daughter, 25.  I worry about her because I know she worries about me.  Every once in a while a chemo break is good for the soul.  You just need to be away from it for a cycle.  I think of it as additional healing time believe it or not - or recovery time for my body.  You sound like a wonderful daughter.  Mom will be okay missing a cycle.  I know it must be so hard for you to watch.  God bless your fight.  Kim",
      "MessageIndex": 7,
      "PostDate": "26/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721739",
      "Title": "I HATE THIS DISEASE! I DO! I DO! cneal318 KiminJax"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 26, 2008 03:31PM KiminJax wrote: I've got a powerport for about a year and a half now.  It has the three dots.  I had mine installed at Mayo though in Florida. ",
      "MessageIndex": 8,
      "PostDate": "26/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701074",
      "Title": "Power Port EstherCA KiminJax"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 21, 2008 08:37PM KiminJax wrote: I'm sorry I don't have the RFA expereince. I have had many different chemos though and there are still many to try so don't lose hope. ",
      "MessageIndex": 5,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723116",
      "Title": "Hello All - My mom's update sarika_for_mama KiminJax"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "KiminJax wrote: Hi Everybody, I hope it's okay to advertise but Christina Applegate is going to be on Oprah today.  I carry the BRACII mutation and so does my 25 year old daughter.  She and I have talked about how I NEVER want her to go through this if she can prevent it.  With my latest mets to brain it's become even more urgent to me.  Her insurance company is fighting her need for digital MRI breast exams.  I'm not even sure they would pay for a mamm.  Anyway, we had always talked about her having her babies (she wants to breastfeed) and then propho surgery.  Again, since the new mets, I've told her breastfeeding is over rated and millions of babies have thrived on formula.  I just don't want her to ever have to go through this (or have a child go through what she's going through) if it can be prevented.  Anyway, I applaud young women like Christina who will tell their story in such a public and frank way and not allow her beauty or fame to get in the way of her long-term health.  She is influencing my daughter and I am grateful for that.  Love to all.  Kim Dx'ed in September 2004, mets to lungs in September 2006, mets to brain in September 2008. Mets to liver & Spine Nov 08. BRCA2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722024",
      "Title": "Christina Applegate my new hero KiminJax Daffodil"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "KiminJax wrote: Hi Everybody, I hope it's okay to advertise but Christina Applegate is going to be on Oprah today.  I carry the BRACII mutation and so does my 25 year old daughter.  She and I have talked about how I NEVER want her to go through this if she can prevent it.  With my latest mets to brain it's become even more urgent to me.  Her insurance company is fighting her need for digital MRI breast exams.  I'm not even sure they would pay for a mamm.  Anyway, we had always talked about her having her babies (she wants to breastfeed) and then propho surgery.  Again, since the new mets, I've told her breastfeeding is over rated and millions of babies have thrived on formula.  I just don't want her to ever have to go through this (or have a child go through what she's going through) if it can be prevented.  Anyway, I applaud young women like Christina who will tell their story in such a public and frank way and not allow her beauty or fame to get in the way of her long-term health.  She is influencing my daughter and I am grateful for that.  Love to all.  Kim Dx'ed in September 2004, mets to lungs in September 2006, mets to brain in September 2008. Mets to liver & Spine Nov 08. BRCA2+ Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "30/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722024",
      "Title": "Christina Applegate my new hero KiminJax Daffodil"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 21, 2008 11:21AM KiminJax wrote: I'm not familiar with the veneralabine unless it has a friendly name.  I wouldn't do anything without my port though.  Totally worth it.  No long term side effects.  Good luck.  Kim",
      "MessageIndex": 3,
      "PostDate": "21/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724813",
      "Title": "vinorelbine and port placement YHong YHong"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Apr 22, 2008 09:33PM KiminJax wrote: Oh Stephanie - I am so happy the fluid is clear.  You have such a faithful attitude.  I know for sure you're going to radiate and chemo the hell out of those mets.  God bless you.  Kim",
      "MessageIndex": 138,
      "PostDate": "22/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704020",
      "Title": "Dx with Brain Mets Today TripleNeg snowyday"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 12, 2008 11:54PM KiminJax wrote: Praise the Lord!  What a friend!",
      "MessageIndex": 14,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724304",
      "Title": "Totally Great News! luvtotravel JerseyMom"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 26, 2008 04:59AM KiminJax wrote: Mason,  I hate that they make you make a medical decision about treatment when they have received all the medical training.  Our healthcare system sucks (along with cancer) and you're baring it now.  I have no advice except to find a new provider.  There is ALWAYS hope and if you can tolerate the treatments with an acceptable qol I hope you will consider doing whatever needs to be done, including the oomph, so that you can have more time.  God bless you and your fight.  The physician and hospital response is unacceptable.  Kim",
      "MessageIndex": 9,
      "PostDate": "26/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721804",
      "Title": "Where do I go from here??? mason204 Diana_B"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 4, 2008 01:19PM KiminJax wrote: Hi, Best of luck to your friend.  I have lung mets too and know there are many treatment options.  Like the others have already said, there is no reason to think your friend won't gain strength and feel better soon.  Best of luck and keep us posted. ",
      "MessageIndex": 3,
      "PostDate": "04/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699624",
      "Title": "stage IV diagnosis allmans KiminJax"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 19, 2008 05:31PM KiminJax wrote: Hi Robin,  I'm a lung mets patient too and also got my recent scans.  The three that we follow (I have subcentimeter tumors everywhere) are 3.0x1.5 cm, 3.5x2.1 cm, and 1.1x0.7cm.  Believe it or not, this was great news to me because each of these had reduced in size!  I am presently doing Navelbine and these were my first scans since starting Navelbine and it's working for me.  It had been a long time since I got good news.  I am like you.  I feel great most of the time, I go for long bicycle rides, I'm completely asymptomatic except for these freaking tumors!  I pray they will go away one of these days.  Hang in there. It's amazing how resilient our bodies are even with all of these problems.  Love and hugs,  Kim",
      "MessageIndex": 6,
      "PostDate": "19/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719722",
      "Title": "Now I'm really scared.... got a look at my scan reports RobinWendy RobinWendy"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 13, 2008 07:31PM KiminJax wrote: If I knew then what I knew now I wish I would have had a double mastectomy.  I had the lumpectomy and have mets to lungs and brain.  I would take radical steps to minimize any chance and in retrospect would have gone for the works.  I know it doesn't guarantee that you won't have mets but again, it mitigates it. ",
      "MessageIndex": 3,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724379",
      "Title": "Masectomy after lumpectomy ShellyJo ShellyJo"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 14, 2008 04:35PM KiminJax wrote: Hi ShellyJo,  The influential data that I did not have included the attitude that my surgeon told me I had \"the garden variety\" breast cancer and he led me to believe that this would easily be beaten.  I'm glad he had a positive attitude but I had no knowledge of metastatic BC.  The other more telling information is that I found out I was BRCA2 positive about two weeks before I received the word that it had spread to my lungs.  Having that info sooner than later would have cinched it for me.  My 25 year old daughter has been tested and is also BRCA2 positive so as difficult as it is to make these types of decisions, she can decide about propholactic surgery. ",
      "MessageIndex": 10,
      "PostDate": "14/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724379",
      "Title": "Masectomy after lumpectomy ShellyJo ShellyJo"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jul 25, 2008 10:27PM KiminJax wrote: Stephanie, I just read the most recent message above.  I know you are afraid.  Please please call your doctor and get seen.  Try to be assertive, I know they can be difficult sometimes but remember, the onc works for you.  I too feel full a lot but I assume it is related to the plethera of drugs I get on a weekly basis.  Stay on top of the diahrea meaning keep pushing the fluids so that you don't get dehydrated.  But please call as soon as you can and tell them you need to be seen ASAP to look at your immediate symptoms of fullness and diarhea.  Also, I hope I'm not overstepping my bounds but this disease can be very scary and depressing.  I personally take Effexor each day and Lorazepam as needed as an anti anxiety.  We are faithful women and I turn to the Lord for my strength and I try to give all this up to Him but He knows me and sometimes I just can't handle it all.  I figure the Lord put the brains into the scientists that have given us these medications to ease our minds and to calm our nerves.  He knows I love Him, I turn to Him, I pray to Him, and I worship Him and I am not ashamed to say I still need the Effexor and the Lorazepam to also get me through.  My point is, if you're not already on something you may want to ask about something like this to help you on your really bad days.  I love you and you are not alone and we'll pray you through this.  Kim ",
      "MessageIndex": 30,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709616",
      "Title": "Protruding Chest Nodule: Please pray TripleNeg Felicia"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 17, 2009 08:28PM KiminJax wrote: Hi Rusty, I had wbr for about 30 straight days ending in the beginning of November.  During that time I fell UP the stairs on two occassions.  My symptoms were exactly the same as yours.  As time has passed my equilibrium seems to have come back.  The WBR really took a toll on me. ",
      "MessageIndex": 13,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729215",
      "Title": "KIND OF FREAKED OUT HERE!!!! rooni LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 4, 2009 09:54AM KiminJax wrote: I decided to look at this one again this morning and it is appalling that so many of us (majority) were dx'ed around lat 40 - 50.  That is way too young.  Even though we know that cancer doesn't really discriminate based on age, we need to learn what is permiating our lives now to cause onset of this disease so much earlier in just one or two generations.  My grandma was in her 70's my mom late 60's, me at 47 and we know my daughter is braca2.  It seems like there is more that we could do as an advocacy group than just running/walking for money.  I don't have the answer but I'm not really sure we have the attention we need from the NIH, etc.  Good luck to everyone in your jouney and thank goodness for this blog.  Kim",
      "MessageIndex": 161,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 27, 2009 07:14PM KiminJax wrote: Hi times3, I was 47 at first diagnosis and have been living with it and mets for six plus years now.  I had my daughter tested (she was 24 at the time and she is BRCAII positive.  I cannot put into words enough how grateful I am to know now (sooner) rather than too late.  At this time she is planning to get propholactic surgery as soon possible after she has her babies.  My doctor also recommended she get mammos 10 years sooner than my onset but changed her mind once we knew we were both positive.  Now my daughter has had a baseline MRI digital mammo and she'll get them annually from now on.  Good luck. ",
      "MessageIndex": 142,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 6, 2009 09:23AM KiminJax wrote: I'm praying for you slonedeb.  Kim",
      "MessageIndex": 5,
      "PostDate": "06/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730236",
      "Title": "Slonedeb sending out prayers! LuAnnH VickiG"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 17, 2008 06:48AM KiminJax wrote: Stephanie - I was just looking at this thread for the first time and got the biggest kick out of your sentence, \"I still wake, shower, snack, surf, and sleep every 6 hours. \"  Surf?  Really.  You're amazing.  I'm still so fatigued from WBR I can barely keep my eyes open.  LuAnn suggested I look for one of your postings about ears.  My right ear feels so plugged up I can barely hear and it's getting more and more painful from the pressure.  Mostly though I just wanted to let you know you've lifted my day up just thinking about you surfing.  You go girl!  Kim",
      "MessageIndex": 3,
      "PostDate": "17/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722682",
      "Title": "Why do I sleep 20 hours a day? TripleNeg LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 17, 2008 09:07AM KiminJax wrote: Aha!  That makes more sense!  I too love to surf  day and night (especially since I can't get a good night's sleep). ",
      "MessageIndex": 6,
      "PostDate": "17/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722682",
      "Title": "Why do I sleep 20 hours a day? TripleNeg LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Apr 15, 2008 04:40PM KiminJax wrote: Stephanie, I am so sorry to hear that you have brain mets.  It sounds like you have a strong faith and I hope you will feel our prayers lifting you up.  I will pray for a speedy plan, pain under control, and peace of mind for you and your family.  God bless.  Kim",
      "MessageIndex": 24,
      "PostDate": "15/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704020",
      "Title": "Dx with Brain Mets Today TripleNeg snowyday"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Apr 14, 2008 08:23PM KiminJax wrote: That is great news!  Kim",
      "MessageIndex": 7,
      "PostDate": "14/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703984",
      "Title": "The Scanxiety is over mthomp2020 badboob67"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jul 3, 2008 04:05PM KiminJax wrote: I am so sorry to hear this.  Prayers for peace and understanding for her family.  She will be missed.  Kim",
      "MessageIndex": 8,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708474",
      "Title": "Kari is our latest Angel djd Rocktobermom"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 21, 2008 08:10AM KiminJax wrote: Hi Donna, I am just starting my second round of Xeloda taking exactly the same routine as your sis.  They plan to test me after two cycles.  That will be in about 3 weeks.  I'll let you know how that turns out.  I've heard so many positive outcomes with xeloda I'm a little leary that 2 cycles is too soon.  So, regardless of the outcome I plan to keep the faith.  Please keep us posted on your sister.  Kim",
      "MessageIndex": 3,
      "PostDate": "21/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700726",
      "Title": "TIMEFRAME FOR XELODA TO WORK sisterlove Marls"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Apr 11, 2008 05:49AM KiminJax wrote: Sue,  I'm thinking positive thoughts and I will pray that your scan results are positive.  Please keep us posted.  I've been through six different chemos in the past 18 months and I understand how it feels to think you may be running out of options.  One of the oncologists where I go has a motto that \"there's always options!\"  so I'm hanging on that.  Keep us posted.  Kim",
      "MessageIndex": 5,
      "PostDate": "11/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703750",
      "Title": "Fingers crossed for me...... suecco luckywife"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 9, 2008 09:58AM KiminJax wrote: You go Kateva!  I'm really happy for you and please keep us posted on how it is going.  God Bless!  Kim",
      "MessageIndex": 15,
      "PostDate": "09/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720783",
      "Title": "I can put you in remission! kateva17 gpawelski"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "May 4, 2008 03:21AM KiminJax wrote: Hi Tender,  I had no idea about the cruciform veggies and I'm on Femara.  Ahhhhhh!  Don't our oncologists know this stuff?  It seems like they would pass this type of information along.  I don't know anything about this stuff.  It sounds so complicated.  Out with the veggies!  Thanks for the information Tender.  Kim",
      "MessageIndex": 6,
      "PostDate": "04/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704956",
      "Title": "Zoloft interferes with all hormonals? Lesley1 saluki"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 11, 2008 11:24PM KiminJax wrote: Dear Second Twin - you inspire me!  Kim",
      "MessageIndex": 28,
      "PostDate": "11/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701475",
      "Title": "Anyone else do Xeloda by itself? Watson luckywife"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 21, 2008 08:12AM KiminJax wrote: Hi Brenda,  Just come home and drop on the couch  or in bed and get the rest you need.  Kim",
      "MessageIndex": 10,
      "PostDate": "21/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700713",
      "Title": "Busy tomorrow, port, genetics, and chemo in one day Analemma waterlily"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 21, 2008 08:25PM KiminJax wrote: I knew within one week after my first dose of Navelbine I was no longer wheezng like I was.  It's the only time I could physically tell that something was different. ",
      "MessageIndex": 25,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722986",
      "Title": "Avastin Questions KellyC KellyC"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 26, 2008 04:58AM KiminJax wrote: Love and prayers for her family to find peace in the memories of what appears to be a very exciting life together.  God bless her soul.  Kim",
      "MessageIndex": 21,
      "PostDate": "26/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723347",
      "Title": "Joni Maya1 MissShapen"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Apr 24, 2008 07:06AM KiminJax wrote: I pray this same prayer for Irina and all of us survivors.  God hear our prayer.  Amen.",
      "MessageIndex": 2,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704426",
      "Title": "Prayer Irina WendyV"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 21, 2008 12:09PM KiminJax wrote: I have a lot of experience with absesses and I know how very painful they can be.  They can also be deadly if left untreated.  I have also noticed that my new dentist (I had moved) didn't seem to want to treat me and I think my cancer scared him half to death.  If you have a dentist make an appointment immediately.  If you have to, keep working with your treatment team to get the infection under control.  They can be so painful so ask for pain meds if you need them.  I hope you feel better soon.Kim",
      "MessageIndex": 5,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723033",
      "Title": "abcess tooth kbugmom KiminJax"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 14, 2008 03:35PM KiminJax wrote: Stay strong Tracy.  This is so hard and it would be so wonderful to have it just go away.  You're going through a rough time but please don't think of it as the end.  You are not alone.  We are all here with you and praying for you.  I hope the taxol works as well for you as it did for Michelle and Dianne's mom.  Hugs,  Kim",
      "MessageIndex": 3,
      "PostDate": "14/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719527",
      "Title": "i am scared Tracy1964 LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 22, 2008 06:36PM KiminJax wrote: I did not have any symptoms of my lung mets two years ago.  I was going along fine and was schocked to learn of mets to lungs when I had felt so good.  It was found during routine CT scan. Don't worry too much until you get a scan or something. ",
      "MessageIndex": 1,
      "PostDate": "22/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724890",
      "Title": "Symptoms of Lung mets? curlieqs principito7"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 10, 2008 12:00PM KiminJax wrote: I have the same experience as you but have learned to live with it.  I appreciate what Rose said and will keep that in mind.  My onc treats only cancer related stuff.  I have to go to my General Pract for everything else.  At first it was disheartening but now I just call the Gen Prac first to rule out everything else.  I just view my onc as the cancer expert.  I only see him when I get scans otherwise I see the ARNP.  I go to Mayo which is research oriented so I think they are even more distant.  But, that's okay as long as I get the chemos that are going to help. ",
      "MessageIndex": 5,
      "PostDate": "10/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719321",
      "Title": "How do you feel about your Onc? sunrizes2 OneBadBoob"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 3, 2008 06:33AM KiminJax wrote: I had problems with my plates during avastin and would get the red spots and easy bruising.  It also sky rocketed my bp.  It also stopped working for me.  Don't wait to call the doctor.  They should check your counts again.  Good luck.",
      "MessageIndex": 2,
      "PostDate": "03/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722212",
      "Title": "Another Avastin question sftfemme65 AliceJean"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jul 29, 2008 01:19PM KiminJax wrote: Hi Cathi,  The waiting is so hard.  August 5 is right around the corner.  Praying for B9 results for you.  Kim",
      "MessageIndex": 9,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709820",
      "Title": "Did you just know your BC had come back before DX 1Cathi 1Cathi"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jan 27, 2009 03:44PM KiminJax wrote: God bless John and his family and all of us.  Deb is a big loss.  I hate this disease and how it slowly takes everything away.  But, Deb was \"up\" until the end.  I pray that her family will be comforted know her spirit will be with them always.  God bless.",
      "MessageIndex": 226,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jul 22, 2008 02:59PM KiminJax wrote: Yue, I have nothing to add I just want you to know I'm thinking of you and will pray for your mom to find a sense of calm and peace until you can get to here and that your visa will be handled extremely fast.  God speed.  Kim",
      "MessageIndex": 5,
      "PostDate": "22/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709473",
      "Title": "My mom is so depressed today :( shengyue527 LumiPojo"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Apr 18, 2008 09:49PM KiminJax wrote: Hi Sofeemay!  Don't despair.  The doctor told me there was no cure too but what you need to know is that living with breast cancer is the new thing.  I was diagnosed with mets to both lungs in September 2006 almost two years to the day after my first diagnosis.  My quality of life is great.  I just took a 10 day trip to Israel!  While it is not always easy, you do learn to live with it.  Please come back to this site for support.  I don't know what I would do without it.  You are not alone.  I taped that cancer show on PBS and now I can't wait to watch it if the person living the longest is a BC lung mets patient.  We're here for you Sofee.  Kim",
      "MessageIndex": 23,
      "PostDate": "18/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704117",
      "Title": "Just diagnosised with metastic cancer- sofeemay hezzy"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 8, 2008 07:45PM KiminJax wrote: I am currently on Ixempra and Xeloda but have only had one cycle of the Ixempra.  I was a bit achy - but no pain.  I had diahrea for 24 hours about 48 hours after dose but I don't know if that was the Xeloda or the Ixempra.  I've not had any GI problems since.  I still have my hair!  I'm hoping for the best for both of us.  Let us know how you do.  Kim",
      "MessageIndex": 5,
      "PostDate": "08/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699997",
      "Title": "ixempra 3survivor KiminJax"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 14, 2008 05:23AM KiminJax wrote: Amy, I'm sorry to hear about the progression.  Let us know what clin trial drug you get on.  I'm praying that it will work for you.  I hate this freaking disease too.  Keep us posted.",
      "MessageIndex": 10,
      "PostDate": "14/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722709",
      "Title": "Crappy scan results lv2cmp Bren-2007"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 9, 2008 11:09AM KiminJax wrote: Hi Watson!  Fellow Xelodian here. I have finished my first cycle and am having my first off week.  I do 3 500mg in the morn and 3 in the evening.  So far, it is the easiest chemo I have done.  I've a tinge of the hand sydrome but the feet are okay.  No GI problems.  I combine the Xeloda with Ixempra every three weeks.  Hoping for the best for both of us.  I've heard great things about this chemo.  Kim",
      "MessageIndex": 22,
      "PostDate": "09/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699949",
      "Title": "Fellow Xelodians please read Watson sueco"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Dec 2, 2008 07:14PM KiminJax wrote: Hi Lynn,  I believe I feel very close to you today. I just received the news that mine is now mets to liver (already lungs and brains).  I was not expecting this.  I had no clue.  Now I'm just angry, disappointed and mad as hell. ",
      "MessageIndex": 6,
      "PostDate": "02/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725345",
      "Title": "Feeling like I'm going down hill LynnW Mabledw"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 15, 2008 02:34PM KiminJax wrote: Hi Jdash!  I developed TMJ after I completed my initial chemo back in 2004.  I later read that jaw problems were a possible side effect of chemotherapy.  I can't remember where I read this.  I've always assumed that the chemo contributed along with the stress that naturally comes with cancer.  I've just lived with it ever since.  Kim",
      "MessageIndex": 2,
      "PostDate": "15/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700389",
      "Title": "jaw pain jdash jdash"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 16, 2008 12:21PM KiminJax wrote: Hi Jdash - definitely my jaw is tight and my bite is definitely off.  It's like the top and bottom are no longer in alignment.  It doesn't cause me pain but can be awkard because when I chew there is a clicking sound with every chew.  It is audible to others because I've asked my husband if he can hear it.  Since I'm not in pain I'm just living with it.  Kim",
      "MessageIndex": 4,
      "PostDate": "16/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700389",
      "Title": "jaw pain jdash jdash"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 19, 2008 06:08AM KiminJax wrote: Hi Kelly,  I did the Avastin and it worked for a little while for me.  The girls are all right - this targeted therapy enhances the chemo or hormonal you will take by cutting off the blood supply.  It spiked my bp so high I had to go on bp meds.  It also led to some platelet problems but I never had to have a transfusion.  It is really working well for many people.  It just didn't work for me.  I'm her2-.",
      "MessageIndex": 11,
      "PostDate": "19/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722986",
      "Title": "Avastin Questions KellyC KellyC"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 9, 2009 02:50PM KiminJax wrote: It is a beautiful day here in Jacksonville and I had my Mom & Dad, my bio-daugther and her boyfriend, my step-daughter, my first husband all here this weekend to visit.  I am grateful that my daughters' dad and my current husband are able to come together so that she has the best possible experience while her mom is still here.  Two of the best men I know.  I'm so glad I still have Mom (ovarian, breast, and colon cancer survivior) and my dad.  I made it past 50 no matter what the outcome of this.  I am loved and forgiven!  Life is good.  Kim",
      "MessageIndex": 16,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728749",
      "Title": "Everyday I try to... luvtotravel EWB"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 24, 2008 07:10AM KiminJax wrote: I had never heard of megace before today so went to look it up and it says it's a synthetic form of progesterone.  So, would that be a problem for some of us hormone positive ladies?  Just curious.",
      "MessageIndex": 15,
      "PostDate": "24/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724926",
      "Title": "Weight and Appetite Loss TripleNeg curlieqs"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 24, 2008 04:27PM KiminJax wrote: Heavenly Father, I lift up Stephanie to you and call on Your promise to always provide what we need.  She is a faithful servant in need of Food and help with daily activities.  Please provide for her a means to getting tasty nourishment and help with her home and family.  I pray her ex-husband and children would show more compassion.  Soften their hearts Lord.  And please, provide for Stephanie who knows as we all do that God is able.  In your name I pray, Amen. Stephanie - this may sound wild and out of the blue but has your ex-husband remarried?  If so, would his wife be more compassionate than he has been?  Just a thought.  I pray for you to have some help soon.  Kim",
      "MessageIndex": 25,
      "PostDate": "24/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724926",
      "Title": "Weight and Appetite Loss TripleNeg curlieqs"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "May 20, 2008 08:20PM KiminJax wrote: God bless you Arc.  I can't imagine how hard this must be on your family and how you help your daughter cope with the circumstances.   I am so sorry.  This shouldn't happen to one family.  KIm",
      "MessageIndex": 13,
      "PostDate": "20/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705804",
      "Title": "I can't be the only one, can I? Hubby & I both Stage IV arc229 jinan22"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 17, 2008 06:28AM KiminJax wrote: I'm surprised the onc is not having you do the neupogen.  When my white count is low, even though I can't have the chemo he still has me do the neupogen.  You may want to ask abou that.  I've had the TPA a couple of times and while it works,  it's annoying to spend the extra hour.  I have found a routine that will give a blood return everytime.  Before leaving for the onc's office I put a heating pad on the area.  Then, while I'm in the shower I keep a warm wet cloth on the port the whole time.  Then, on the ride to the onc's office I have a hand held vibrator (it's not what you think girls) called knuckles.  I massage the port and my neck on the way in.  I have not had a problem with my port returning blood since.  It's kind of a pain to go through all that but my chemo (Navelbine) is whats called a vesicant and if they don't get a blood return I don't get my chemo so it's important to me.  Again, wet heat, dry heat, and massage work ever time. ",
      "MessageIndex": 6,
      "PostDate": "17/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722901",
      "Title": "Couldn't do Chemo Today - Bummed Out TripleNeg Fllorik"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 3, 2008 07:51PM KiminJax wrote: I'm xeloda with Ixempra.  Kim",
      "MessageIndex": 3,
      "PostDate": "03/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701475",
      "Title": "Anyone else do Xeloda by itself? Watson luckywife"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 21, 2009 02:52PM KiminJax wrote: Hi Judi,   Your progression is much like my own.  I think being in a funk is okay and to be epxected.  I hope the etoposide works for you.  I've heard of it but not had it yet.  Kim",
      "MessageIndex": 10,
      "PostDate": "21/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730898",
      "Title": "Etoposide? Judiiiii KiminJax"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 26, 2008 05:28PM KiminJax wrote: I was on a clinical trial with Abraxane and Avastin.  It was a double blind study so no one knew if I was getting Avastin or not.  My mets progressed so then, based on the clincial trial contract, I was put on Avastin for sure along with Gemzar, and Cisplatin.  My mets still progressed and the Avastin gave me super high blood pressure.  I'm off it now.  When I was put on it, I had already had chemo for my initial onset.  Kim",
      "MessageIndex": 9,
      "PostDate": "26/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701020",
      "Title": "Clarification on Avastin - please advise sarika_for_mama KiminJax"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 12, 2009 06:15PM KiminJax wrote: Hi Hopeful1, I can't help you because I haven't found anything that works yet.  I believe someone will come along soon to give you their input.  In the meantime, be strong and come back here often.  Kim",
      "MessageIndex": 1,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730625",
      "Title": "Need HELP! Hopeful101 wayover20"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 7, 2008 06:39PM KiminJax wrote: Where does your aunt live? ",
      "MessageIndex": 3,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724049",
      "Title": "Immediate 2nd opinions for nonresponsive metastatic disease? subinthapa Hopeful101"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 5, 2009 11:58AM KiminJax wrote: Hi Amber, I'm so glad to read you are on the upswing.  LuAnn said something about this month just being full of the blues for so many of us and it's true.  Maybe it's a post holiday thing.  Hang in there girl.  For whatever unexplainalbe reason we all have been put to the test with BC mets.  But we must fight on for our daughters, their daughters.  You are not alone.  You are a wonderful mother, wife, woman.  Reach out as much as needed for encouragement because this race is not going to get easier.  Love,  Kim",
      "MessageIndex": 60,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727168",
      "Title": "I am ready to quit.... mrs_X_Sunneedazee lovinmomma"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 4, 2008 05:40PM KiminJax wrote: Elaine, I'm sorry you received this news.  It's always disappointing to have progression.  Still, I'm glad to hear your onc say there are plenty of other drugs to try.  It's true - I've been on plenty and they are not all bad.  Some are easier than others.  I hope you have a positive experience with this new treatment plan.  Kim",
      "MessageIndex": 3,
      "PostDate": "04/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723868",
      "Title": "Stable didn't last for long ElaineD KLynn"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 28, 2008 04:43PM KiminJax wrote: Hi Yolanda,  You may want to contact your doctor to ask him if you can get a simple xray or some other diagnostic procedure just to ease you mind.  We do have a tedancy to think the worse when something new comes up.  Having this checked out might help you to put it out of your mind.  Kim",
      "MessageIndex": 5,
      "PostDate": "28/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701237",
      "Title": "Breast cancer - now lung cancer? Footsox6 KiminJax"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 23, 2008 07:12AM KiminJax wrote: Hi Lisa, I'm new to brain mets having been dx'ed last week after a siezure.  I've been treated for lung mets for two years and now this.  I am getting wbr daily and I think I will have a total of 15 radiations.  Please keep us posted and know that you are not alone.  Love,  Kim",
      "MessageIndex": 9,
      "PostDate": "23/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721459",
      "Title": "Brain Mets - No Plan lisacatq KiminJax"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 28, 2009 01:06PM KiminJax wrote: Hi Rusty,  I  took Abraxane and avastin (trial drug) for almost one year beore it stopped working.  I remember the avastin being hard on me but not the abraxane?  Different strokes...",
      "MessageIndex": 4,
      "PostDate": "28/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729888",
      "Title": "ABRAXANE=nuepogen rooni bourscheid"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 3, 2008 03:27PM KiminJax wrote: Wow!  All of you have cute adorable children.  I can't imagine the additional challenges you must face every day with little ones.  Mine are all grown and gone.  Kudos to you ladies with the little ones and you manage to be a loving parent and give your kids all they need and go through chemo, etc. at the same time. ",
      "MessageIndex": 26,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723722",
      "Title": "Halloween pictures Fitztwins tooyoungtohavebc"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Dec 29, 2008 10:56AM KiminJax wrote: Hattie - you're not alone.  We're right in there with you.  I know for me, my emotions ebb and flow.  I'm trying really focus on living with a chronic disease now.  It's easy to fall into the trap of negativity but pull yourself out.  You have a faith in God, you have good doctors and meds, so lets assume they are all going to work.  Come back here often for support.",
      "MessageIndex": 5,
      "PostDate": "29/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726419",
      "Title": "Stage 4 / Grade 1..Er/Pr +/ Her2 - does it make a difference ? Godsgal Janice54"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 17, 2008 10:58AM KiminJax wrote: Jazzy, you described the pain really well.  I've had this too for years.  I had my lumpectomy in 2004 and I always assumed it was just phantom pain but not recurrance.  But, it's good to know all these other women have experienced it too.  I've had plenty of scans and it has never come up I just assume it's phantom and nothing to worry about. ",
      "MessageIndex": 4,
      "PostDate": "17/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724593",
      "Title": "Hpw do you know when pain = recurrence jazzydog2 ozzie2"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "May 2, 2008 01:46PM KiminJax wrote: Stephanie, Those are such important steps for your kids and your peace of mind.  I'm glad you have someone you can trust like that.  Stay strong.  I'm praying for you.  Kim",
      "MessageIndex": 17,
      "PostDate": "02/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704890",
      "Title": "Test Results - Still Need Prayers TripleNeg 2timer"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 11, 2008 09:11AM KiminJax wrote: I just finished my first round of Xeloda and have not experienced the fatigue.  But, I think it is cumulative so it may be too soon for me to judge.  Good luck to you Annie.  Kim",
      "MessageIndex": 1,
      "PostDate": "11/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700116",
      "Title": "Xeloda and Fatigue AO44 pinkdove"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 6, 2008 11:05AM KiminJax wrote: Dear Oz,  I've only been living with this since 2004.  When I read that you have been living with this for 12 years it gives me so much hope for my future.  My pattern has been every two years I have progression to a new organ (breast first, lungs and then brain).  I want 12 years so bad.  I don't know when I'll know.  I just want you to know that I honor your battle and whatever decisions you make I honor and I will pray for your strength and discernment.  I hope you keep fighting but I have no rights or influence to your decision.  Please keep us posted and know there are an army of warriors out here sending you prayers and positive thoughts as you go through this process.  Love,  Kim",
      "MessageIndex": 2,
      "PostDate": "06/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722336",
      "Title": "I have had enough.. ozzie2 AusAla"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 7, 2008 08:28PM KiminJax wrote: Okay - now I'm not sure what to do.  I put two pink \"survivor\" ribbons on my car because I was initially dx'd in 2004 and then mets to lungs in 2006.  When I was initially dx'd with lung mets I was desperate to talk with anyone that was a survivor.  I was scared.  I didn't know about this recurrance website and was beside myself emotionally.  I decided to put two \"survivor\" stickers on my car to give anyone else that had been dx'd and driving by hope and inspiration to know you can get through this thing twice.  That was the only reason I put these on my car.  I wanted to send the message to some woman out there that felt alone that she could make it.  Now I'm wondering if I should take them off?  I really don't want to send the wrong message.  Kim",
      "MessageIndex": 43,
      "PostDate": "07/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701634",
      "Title": "I hate pink ribbons, but.......... Watson Fitztwins"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "May 1, 2008 05:07PM KiminJax wrote: Hi LuAnn,  That sounds like a very complicated procedure and you have good reason to be restless.  I'm sure the doctor has done it a million times before and it's old hat to him, but it's never easy to be the patient.  I just know it will be fine.  Please let us know how you're doing after tomorrow.  God Bless.  Kim",
      "MessageIndex": 37,
      "PostDate": "01/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704826",
      "Title": "Send some good thoughts, outpatient surgery tomorrow LuAnnH djd"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 10, 2008 08:59AM KiminJax wrote: Good to know.  I was told but have done no research that Navelbine can also cross the blood brain barrier.   Kim",
      "MessageIndex": 1,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724189",
      "Title": "Xeloda for brain mets HeatherBLocklear VickiG"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Apr 15, 2008 02:53PM KiminJax wrote: Dear Donna,  I am so sorry that your sister has passed.  I know you fought hard for her and that you were her strongest advocate.  I pray for your peace and comfort during this time.  Kim",
      "MessageIndex": 20,
      "PostDate": "15/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704009",
      "Title": "MY SISTER IS AN ANGEL sisterlove ozzie2"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jul 22, 2008 01:54PM KiminJax wrote: When people ask me how long I will be on chemo I tell them that we now treat my kind of cancer (metastatic) like a chronic disease such as diabetes or high blood pressure and that I will most likely be on chemo for the rest of my life.  That's all I say.  That usually causes them to stop asking questions.  I've actually been thinking lately maybe there should be five stages.  Stage four are the people like me that will likely never go into remission but am living with cancer with a good quality of life.  But then if we did that, stage five would look a little bleak.  I guess we should just keep it as is!  If I sound wishy washy I just got home from chemo and took an adavan.  Kim :)",
      "MessageIndex": 2,
      "PostDate": "22/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709490",
      "Title": "Do you bother with going into detail? Fitztwins EWB"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Dec 4, 2008 07:37PM KiminJax wrote: Kasey,  God bless you.  LuAnn said it best, I feel so helpless and wish there was something I could do.  Please come back to the site and let us know how you are doing and remember we aer praying for you. He will carry you through.  K im",
      "MessageIndex": 5,
      "PostDate": "04/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725446",
      "Title": "Now under Hospice/Palliative care Kasey RobinWendy"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 9, 2008 01:54AM KiminJax wrote: Hi, I was on Gemzar along with cisplatin and avastin for several months.  I would take compazine for the nausea the first night but would do okay after that.  I had problems with my platelate counts frequently but I'm not sure which of the three caused that.  Good luck with the Gemzar.  I too am blowing through the options.  I'm now on my 3rd chemo combo since my mets was diagnosed about 15 months ago.  All the best.  Kim",
      "MessageIndex": 7,
      "PostDate": "09/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699983",
      "Title": "Gemzar Bonnie46 KiminJax"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jul 14, 2008 05:08PM KiminJax wrote: Hi LuAnn, I pray you are feeling stronger and better soon.  Like some of the others have already stated, please make sure you have a \"spotter\" for your next shower.  I had that same feeling of blacking out when I was put on too high a dose of blood pressure meds.  It can be very scary.  Also, try some of the boost or ensure just to keep the nutrition coming.  Like Fitz said, take baby steps and don't try to do too much.  Us moms can be guilty of trying to accomplish too much too soon.  Just take your time.  Kim",
      "MessageIndex": 8,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709056",
      "Title": "Help, having a hard time recovering from surgery LuAnnH ozzie2"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 19, 2008 05:38PM KiminJax wrote: Great hobbies!  I want to join the bugging caravan.  You can pick me up here in Jacksonville and we'll spend some time at the beach before moving on!  I want to learn how to knit.  I knitted in high school 30+ years ago but can't remember anything now.  I need to find some lessons.  My hobbie that I love is road bike riding.  My husband and I both have bikes and we love to ride.  Before my most recent mets event I would ride 30 - 50 miles a week.  We were both training for the Livestrong ride in Austin when I was hositalized.  I plan to get back on my bike again soon.  That's the beauty of living in the south is that you can ride all year long. ",
      "MessageIndex": 22,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724685",
      "Title": "Just for fun-- Let's talk hobbies SunshineSmiles saint"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 24, 2008 12:24PM KiminJax wrote: Hi Wats!  I'm sorry you're going through this.  I had a bad cough for a period of time and it was related to the blood pressure medicine I had been put on.  You and I are just about in the same place re: Xeloda - I'm a week ahead of you I think.  I've had achy type pains but they are all over.  Not just my back.  Please keep us posted.  Kim",
      "MessageIndex": 5,
      "PostDate": "24/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701002",
      "Title": "Lung Mets NOW starting pain on chemo? Watson Mena"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "May 2, 2008 01:48PM KiminJax wrote: Hi LuAnn,  I'm glad they were able to get your port right again.  I can't imagine being awake for it but it sounds like it wasn't too bad.  I hope you feel better soon.  Kim",
      "MessageIndex": 52,
      "PostDate": "02/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704826",
      "Title": "Send some good thoughts, outpatient surgery tomorrow LuAnnH djd"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jul 25, 2008 10:16PM KiminJax wrote: Abba Father hear my prayer that Stephanie's fears will be calmed and that she will have discernment as to how to proceed.  Stephanie is your good and faithful servant Lord.  She knows You and she feels your presence.  You are a great and powerful God and You are the ultimate physician.  Please Lord, give us all peace, and give Stephanie peace now.  Heavenly Father I also pray for the erradication of cancer from the face of this earth.  In Your Name I pray, Amen.",
      "MessageIndex": 29,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709616",
      "Title": "Protruding Chest Nodule: Please pray TripleNeg Felicia"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 1, 2008 05:30PM KiminJax wrote: Hi Sister!  I'm with the others.  I am among many hundreds on this site that have stage IV cancer that has spread to one or more areas and have all kinds of hope.  I've been living with it for two years and plan to keep going.  I hope your sister is able to find a new oncologist in a new facility as quickly as possible.  She needs to dump her doctor now and get someone new.  Kim",
      "MessageIndex": 3,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720450",
      "Title": "Stage IV - any hope? FormysisterT artistatheart"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 19, 2008 12:46PM KiminJax wrote: Time for her to find a new onc.  I've lived with lung mets for two years now.  There are many different chemos she can take.  Best of luck. ",
      "MessageIndex": 10,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724671",
      "Title": "Lung Mets DragonladyTina kenzie57"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 16, 2008 06:44PM KiminJax wrote:",
      "MessageIndex": 11,
      "PostDate": "16/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719571",
      "Title": "Is anyone getting help from Komen? pinkpig fire"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jan 13, 2008 12:42PM KiminJax wrote: Hi Lorenzo, I have just prayed for Rosalba and her daughter for her bleeding to stop, for peace and for the doctors to discern next steps to help her overcome this terrible disease.   ",
      "MessageIndex": 2,
      "PostDate": "13/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698413",
      "Title": "Please pray for my friend Rosalba!!!! 73gr fd411"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 20, 2008 01:01PM KiminJax wrote: Amy,  good luck with your surgery. Kim",
      "MessageIndex": 3,
      "PostDate": "20/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719784",
      "Title": "Port being removed this week arc229 Fitztwins"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 26, 2008 05:37PM KiminJax wrote: Hi There - I am also ER+, PR- and HER2- like your mom.  I have lung mets.  I've tried many different chemos and am still looking for the right combo and I am expecting to be NED one of these days.  I agree with the other posters.  Be the good patient and follow what the onc tells you to do.  It is a matter of trying different combos to see what will work.  I've always been under the impression that hormonals are an option for me, especially if I need a chemo break.  Except for the tamoxifen I have not tried those yet because I want to be as aggressive as possible.  Thus far, the chemos aren't wearing me down.  I hope your mom might consider joining our group.  We are all survivors.  We have our good and bad days and are here for each other when needed.  Give her big hugs from us and let her know she is not alone.  It is scary at first but once you start learning all the survival stories out there, it can become very inspirational.  Good luck with your mom.  Kim",
      "MessageIndex": 4,
      "PostDate": "26/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701110",
      "Title": "Hormonal treatment for ER+/PR- HER- sarika_for_mama Carmelle"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 28, 2008 12:20PM KiminJax wrote: Hi Carmen and welcome.  You'll come here a lot if you're like me.  This is the only place I know of where we have so much in common.  I'm not HER2+ so no herceptin here but otherwise I've been on probably a half dozen different chemos, rads, etc.  Come here anytime for support.  Kim",
      "MessageIndex": 15,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723457",
      "Title": "New to this forum! CarmenA AusAla"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 19, 2008 11:51AM KiminJax wrote: Happy Birthday River!  Kim",
      "MessageIndex": 33,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724583",
      "Title": "Riverinerabbit is 50 Nov 18!!!! saint faithandfifty"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 10, 2008 04:07AM KiminJax wrote: Lisa, Ega, Calgal, me, What is happening with the brain mets?  I've been on this site for ages but don't remember this type of upswing in a particular type of mets in a while.  Lisa,  I'll be praying for you and everyone else on the site.  The good news is (I guess) that I hear a lot of success stories about treatment.  The scary thing is, it's usually third hand from someone without brain mets.  But, I do hear good things.  I pray for the erradication of all forms of cancer from the face of the earth.  Kim",
      "MessageIndex": 47,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724122",
      "Title": "Me, too LisaSDCA EGAL"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 23, 2008 02:51AM KiminJax wrote: Egal and LuAnn - it's ggod to hear there may still be some residual during the scan.  I too am getting my brain MRI on Deceber 2.  Wishing you much luck and no progression.  God Bless.",
      "MessageIndex": 95,
      "PostDate": "23/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724122",
      "Title": "Me, too LisaSDCA EGAL"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 28, 2008 12:05PM KiminJax wrote: Dear Laura,  I am so sorry to hear about your loss.  I believe that Val is in a better place where there is no pain or suffering and that you will see her again one day.  I hope your good memories provide you comfort forever.  Love,  Kim",
      "MessageIndex": 19,
      "PostDate": "28/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721900",
      "Title": "My Val feeval ozzie2"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jan 29, 2008 05:07PM KiminJax wrote: Bonnie  - I'm on board with everyone else.  Just ignore the prognosis your doc gave you.  How rude.  There is no way he can predict how long you will live.  My doc did something similar and through counseling I realized that his words-which I heard at this most vulnerable time-literally brainwashed me.  Through counseling I learned to counter his words with positive thoughts.  I put on my mirror postive affirmations to remind me on a daily basis that I can beat this.  KLynn - Thank you for your post.  Your post has given me further inspiration.  I've been battling my lung mets now for 1 year and 5 months and from time to time it can get tiring.  Hearing that you are in remission after two years of fighting will also go up on my mirror!  Thank you for sharing your story.  Kim",
      "MessageIndex": 10,
      "PostDate": "29/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699314",
      "Title": "my reoccurrence bonnieh sdurantmd"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 3, 2008 04:15PM KiminJax wrote: Amazingly stupid and insensitive person.  ",
      "MessageIndex": 2,
      "PostDate": "03/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722222",
      "Title": "Survivor Dinner VickiG Fllorik"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jul 29, 2008 01:24PM KiminJax wrote: I am so happy for you!!!!!   Keep doing what you're doing because it's working!  Congratulations!  Kim",
      "MessageIndex": 8,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709839",
      "Title": "Still NED!!! Analemma Barb-FightingBC"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 8, 2008 07:41PM KiminJax wrote: Hi Carrie - Lung mets here too.  I just celebrated two years of fighting the mets on September 6!  I've been through a lot of chemos and am now on Navelbine.  I'm kind of glad to hear you're' starting on it because for the first time in a long time something is working for me.  My lung tumors did shrink on the Navelbine.  I continue to take it.  The only side effect I've had is a little heart burn that lasts only a few hours.  Otherwise, it is the easiest chemo I have taken yet!  I could take it for years and years if it keeps working.  I go one a week, no breaks.  I do self-inject neupogen once a day for four days after the chemo.  One neulasa shot would do the same thing but I can't take the neulasta.  Occassionally I have arenesp too.  But really, it's been so easy for me.  I did the Avastin a while ago and it really spiked my blood pressure.  I'm glad to be off it.  God bless you and please know you are among friends here.  You are not alone.  Love and best wishes.  Kim",
      "MessageIndex": 10,
      "PostDate": "08/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720788",
      "Title": "Just diagonsed Friday with lung mets CarrieJ LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 17, 2008 08:49PM KiminJax wrote: Michelle, It's nice to see you back on the boards. Kim",
      "MessageIndex": 4,
      "PostDate": "17/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722948",
      "Title": "Living Proof Movie mimi1030 LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 19, 2008 05:54AM KiminJax wrote: Hi Denny,  Thanks for the inspiration.  Sometimes I wish I was HER2+ because so many positive things are happening for them with the herceptin and the tykerb.  Still, there is reason for hope for us negative girls.  I pray for your continued success.  Kim",
      "MessageIndex": 19,
      "PostDate": "19/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722948",
      "Title": "Living Proof Movie mimi1030 LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jan 28, 2008 05:21PM KiminJax wrote: Hi Everyone!  I started taking xeloda 6 days ago and have a question about exhaustion.  I'm finding myself short  of breath, dizzy, if I exert any energy at all.  Tried to go to the grocery store this morning and thought I would pass out.  I can hardly walk across the room.  I'm taking 3 500mg pills in the morning and 3 50mg pills in the afternoon.  It sounds like I may need to cut back.  I'm scheduled to take this dose for two weeks on and one week off.  Should I try to get through this first two weeks before consulting doctor?  Does it get better after a while?  Thank you.  Kim",
      "MessageIndex": 6,
      "PostDate": "28/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699043",
      "Title": "XELODA GoldenEyes LoriFL"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 26, 2009 01:19PM KiminJax wrote: The only time I ever had a symptom was when I first found my own llump in my left breast.  Since then I've met'sed bunches and never had one symptom.  All mets have been found by scans. ",
      "MessageIndex": 7,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729701",
      "Title": "Scans Results kim40 RetrieverMomNancy"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 6, 2008 05:44PM KiminJax wrote: I've heard good things about Moffitt.  My mom has been treated there.  I don't know any physicians by name though.  Good luck. ",
      "MessageIndex": 5,
      "PostDate": "06/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719151",
      "Title": "DOCTORS IN CLEARWATER FLA. 1Cathi Ka-Loni"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 27, 2008 09:04AM KiminJax wrote: Amber, what a beautiful family!  I pray you can get through this difficult time and that you'll feel better soon.  Kim",
      "MessageIndex": 8,
      "PostDate": "27/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723418",
      "Title": "Mrs_X_Sunneedazee LuAnnH Fitztwins"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Sep 28, 2008 05:23AM KiminJax wrote: Dear Lord, I'm praying for a cure and I'm praying for an innoculation that will prevent and irradicate breast cancer from the face of the earth.  I pray that providers who make a living treating breast cancer will find lucrative substitutes so that the men and women of the world who live with this disease can be healed and nmove on from the disease and that this plague become an historical memory.  You Lord have the power to change our world.  Thank you for your grace and mercy on each of us.  Thank you for loving us and hearing our prayer.  Amen Lord.",
      "MessageIndex": 5,
      "PostDate": "28/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721694",
      "Title": "Prayer Warriors Needed.Praying for a Cure GrammyNancy Maryiz"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 22, 2008 06:13AM KiminJax wrote: I know a lady who had prophalactic (sp?) double mastectomy and cancer was found years later.  I believe it was going to be easier to manage under the circumstances but I don't have details.",
      "MessageIndex": 2,
      "PostDate": "22/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723191",
      "Title": "Questions mpieterse Member_of_the_Club"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Aug 24, 2008 03:13PM KiminJax wrote: Hi Allmans, I will never understand this disease.  I am so sorry that your sister is suffering.  I hope they are giving her good pain medications.  I will be thinking of you and praying for you both.  Kim",
      "MessageIndex": 2,
      "PostDate": "24/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720031",
      "Title": "My sister allmans LuAnnH"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 6, 2009 11:00AM KiminJax wrote: I use the ativan here too.  I take 1 mg and it helps immensely.  Something I'm also trying to do just because it makes sense, is to convince myself that all this shit is going to work.  I get chemo once a month.  I've been getting different chemo's for four + years.  I have friends praying for me everywhere, What if all this actually works?  It could - right!  So then I try to visualize holding those grandbabies someday.  It may be reality.  And, it it never turns out - well I fought the good fight.  About  the sleep though - that's so important - ativan.  Kim",
      "MessageIndex": 9,
      "PostDate": "06/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728601",
      "Title": "Midnight Demons SunshineSmiles NYCarol"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jan 11, 2008 05:39PM KiminJax wrote: Hi Oz, I start Ixempra with Xeloda on Monday.  I'm new to communicating here.  I'm inspired by what I've read just in this thread to know there are still more options.  I'm stage IV with mets to the lungs.  I've done Abraxane then Abraxane with Avastin, then Cysplatin, Gemzar and Avastin and now will do the Ixempra with Xeloda.  I've been afraid to go on the AI's as they just don't sound as aggressive.  My doctor said they are out there when I'm ready to take a break from the chemo.   But, I'm scared to take a break.  My pattern is about 6 months and the chemo stops working.  It's comforting to know you all are out there.  My name is Kim.  I'll let you know how the Ixempra goes Oz.",
      "MessageIndex": 5,
      "PostDate": "11/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698299",
      "Title": "If AI's stop working ... ozzie2 ozzie2"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 7, 2008 06:21PM KiminJax wrote: I've had to miss several over the years too.  I look at it as LuAnn does, it's just my own body saying I need more time for healing.  It happens, it's disappointng but your counts will come up and you'll get your chemo again.  Good luck.  Kim",
      "MessageIndex": 3,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724085",
      "Title": "Neutropenia greta Watson"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Nov 11, 2008 05:22PM KiminJax wrote: after completing 15 rounds of WBR I went back on weekly Navelbine.  My understanding is that Navelbine (given via IV) does break through the BBB.  Good luck.  Kim",
      "MessageIndex": 5,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724248",
      "Title": "Those with Brain Mets (ER+/PR+), Pls share me your treatment... lemon_acosta lemon_acosta"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 1, 2008 03:27PM KiminJax wrote: I agree - it's any number of factors combined that may contribute.  Our focus needs to be on a cure for us and innoculations to prevent for our kids and grandkids.",
      "MessageIndex": 7,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722111",
      "Title": "Yesterday's Oprah- Confused ck55 koshka1"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jul 6, 2008 03:35PM KiminJax wrote: Heavenly Father, I pray that you will keep Stephanie safe and guide her physicians to identify the root of her current problem.  I pray that this will be under control and that she will be back home quickly.  In Your name I pray. Amen",
      "MessageIndex": 54,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708563",
      "Title": "Can't Walk.... Headed to ER TripleNeg booklady"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Feb 22, 2008 04:42PM KiminJax wrote: Hi Liz,  I had low counts on Gemzar too and would need to miss my chemos from time to time.  I would just consider it necessary recovery time.  My body saying, \"wait\".  Good luck to your mom.  Kim",
      "MessageIndex": 3,
      "PostDate": "22/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700835",
      "Title": "Gemzar every other week? liz35 KiminJax"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Jun 23, 2008 04:23PM KiminJax wrote: Great article - very inspiring.  I like the \"hitchhiker\" idea.  It's what I'm doing and describes it well.  Now, let's just keep the new drugs and therapies coming!  Kim",
      "MessageIndex": 3,
      "PostDate": "23/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707780",
      "Title": "Encouraging article... katie11 katie11"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 15, 2008 03:22AM KiminJax wrote: What wonderful news!  I am rejoicing with you!  Kim",
      "MessageIndex": 10,
      "PostDate": "15/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722796",
      "Title": "Scans in...ixempra worked.. YEAH! tooyoungtohavebc NYCarol"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Mar 10, 2008 02:46PM KiminJax wrote: I'm currently on Xeloda and not having stomach problems.  However, on my previous treatment I did have stomach problems and the compazine worked best for me.  Kim",
      "MessageIndex": 4,
      "PostDate": "10/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701911",
      "Title": "anti nausea meds-suggestions? BJW luckywife"
    },
    {
      "AuthorID": "KiminJax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/36842/profile",
      "Content": "Oct 21, 2008 05:27PM KiminJax wrote: Congratulations Waterlily!   What a beautful baby.  He's beautiful!",
      "MessageIndex": 20,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723132",
      "Title": "New grandbaby! waterlily Gitane"
    }
  ]
}