{
  "AuthorID": "kimmie44",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130057/profile",
  "Posts": [
    {
      "AuthorID": "kimmie44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130057/profile",
      "Content": "kimmie44 wrote: I had my stereotatic biopsy today and I have to say it was not bad at all! They said that the cluster of micro calcifications were close to the chest wall and difficult to get but thankfully, it worked! They did the marker also which attached itself right away.  I have to say before going in, I was 99% certain that it is NOT cancer. But afterward I am not as certain anymore. They talked about the shape and pattern of the cluster being more of a U shape which makes it more suspicious. Good news is that I thought I would have to wait until my appointment with the surgeon on Monday, which would have been torture but they said the results should be here on Wednesday or Thursday. I am glad this is over with and a least the journey to answer has began!  Kim  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/770275",
      "Title": "Biopsy today now the WAIT!! kimmie44 nanadeb"
    },
    {
      "AuthorID": "kimmie44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130057/profile",
      "Content": "Jun 21, 2011 10:23AM kimmie44 wrote: Today is my appointment with the surgeon and so I will be asking those questions!!",
      "MessageIndex": 12,
      "PostDate": "21/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/770275",
      "Title": "Biopsy today now the WAIT!! kimmie44 nanadeb"
    },
    {
      "AuthorID": "kimmie44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130057/profile",
      "Content": "Jun 13, 2011 09:32PM kimmie44 wrote: Thanks for the encouragement!  that is awful that you have to wait so long for the results! My surgeon appointment is scheduled for next Monday at 2:00 but today I asked to be contacted as soon as the results come in!  Its really weird but my very dear friend also had her stereotastic today for micro calcs and should find out her results on Wednesday, tonight she can over and we just laid in bed with our ice packs just talking and laughing and facing our fears! In the past 8 months I have been diagnosed with diabetes as well as many heart issues including heart failure, so this scare is another blow to face. My brother is also battling advanced stage 4 head/neck cancer with huge amounts of chemo and radiation so I worry about my family and their well being right now.  ",
      "MessageIndex": 3,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/770275",
      "Title": "Biopsy today now the WAIT!! kimmie44 nanadeb"
    },
    {
      "AuthorID": "kimmie44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130057/profile",
      "Content": "Jun 14, 2011 09:29PM kimmie44 wrote: My friend got her results today by phone! Benign! I was hoping to get my call but it didn't happen, fingers crossed for a good call tomorrow!!",
      "MessageIndex": 5,
      "PostDate": "14/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/770275",
      "Title": "Biopsy today now the WAIT!! kimmie44 nanadeb"
    },
    {
      "AuthorID": "kimmie44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130057/profile",
      "Content": "Jun 17, 2011 01:25PM kimmie44 wrote: What a ride the last few days have been! My friend got her benign call on Tuesday so I called on Wednesday with no results in the am. then about 4:15 I got a call from the hospital pathology department! the doc said that the biospy results looks alarming, but there is a condition that mimics invasive breast cancer  called sclerosing adenosis, she said that the cells are all blurred borders with jagged edges. She copntacted another lab and sent the pictures. So a very sleepless night and a few tears! Then in the morning I called the hospital myself to give some of the background and medications and what not. Again she said that the other patholigists all thought that it looked pretty definate for invasive breast cancer. the only difinative answer would be a stain test?? She said the slides had been overnighted to another facility and that the other patholigist would look at them and then \"more then likely\" order the stain test which would push the results back a day or so. I was fine with this as I understood this to be the only for sure way to distinguish between the 2. Anyway they called abck in about an hour saying that the other guy looked at it and determined the sample to be benign and no stain sample. So here is the official, (I went and got my own pathology report) Complex Fibroadenoma,  focal Sclerosing adenosis and focal micro calcifications. I am thrilled but of course wondering do I need a second opinion? Why wouldn't they just do the stain test and be done with it? Am I just being a spaz? I am more confused then ever!!!!  And what is mild proliferation of the epitelium?? AGGGGGGGG~ So confusing! But if it is B9, I am elated!!!",
      "MessageIndex": 8,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/770275",
      "Title": "Biopsy today now the WAIT!! kimmie44 nanadeb"
    }
  ]
}