{
  "AuthorID": "KimMosley",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/257613/profile",
  "Posts": [
    {
      "AuthorID": "KimMosley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/257613/profile",
      "Content": "May 22, 2019 01:41PM KimMosley wrote: I am 2 years out from 7 wks of radiation. My breast still hurts & I have red irritation spots. Some days, in 1 small area, it looks like my pores are huge. I have been telling my radiation oncologist as well as my medical oncologist and they have seen it. My radiation oncologist put me on antibiotics for 2 months thinking that maybe there was an infection. There is no infection. The antibiotics did nothing at all. Now it's a touch where the redness is doesn't hurt to touch it it hurts on the inside. My radiation oncologist insist that it has absolutely nothing to do with radiation because I am too far out from it. And I continue to tell her that's a bunch of crap. I've never in my life had issues like this ever. I know it's the radiation.",
      "MessageIndex": 3,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871141",
      "Title": "After radiation grandmaadams KimMosley"
    },
    {
      "AuthorID": "KimMosley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/257613/profile",
      "Content": "May 22, 2019 01:44PM KimMosley wrote: I am 2 years out from 7 wks of radiation. My breast still hurts & I have red irritation spots. Some days, in 1 small area, it looks like my pores are huge. I have been telling my radiation oncologist as well as my medical oncologist and they have seen it. My radiation oncologist put me on antibiotics for 2 months thinking that maybe there was an infection. There is no infection. The antibiotics did nothing at all. Now it's a touch where the redness is, doesn't hurt . It hurts on the inside. My radiation oncologist insist that it has absolutely nothing to do with radiation because I am too far out from it. And I continue to tell her that's a bunch of crap. I've never in my life had issues like this ever. I know it's the radiation.",
      "MessageIndex": 4,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871141",
      "Title": "After radiation grandmaadams KimMosley"
    }
  ]
}