{
  "AuthorID": "kimmie68",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
  "Posts": [
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "kimmie68 wrote: Hi, I was diagnosed in January '10 with BC.  I decided to enter a trial that was 16 wks of Taxol and Tykerb.  The taxol was tolerable, the Tykerb, not so much towads the end.  I finish this in June, had surgery in July and will be starting the AC round of my chemo next week.  Im scared, I have heard so many bad things about it.  I worked through the first round of chemo, I keep reading that others couldnt work with the AC.  I dont want to freak out and get sick from the worry and make it worse.  Anyone out there that didnt have bad SE's with AC. Or should I just try to prepare myself that it is gonna be bad.  I just wish this was over. Dx 1/20/2010, IDC, 4cm, Stage IIB, Grade 3, 1/23 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/757028",
      "Title": "Scared of Next Round of Chemo kimmie68 kimmie68"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 26, 2010 12:40AM kimmie68 wrote: Thanks, I will go and look it up. ",
      "MessageIndex": 3,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/757028",
      "Title": "Scared of Next Round of Chemo kimmie68 kimmie68"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 26, 2010 08:26AM - edited Aug 26, 2010 08:33AM by kimmie68 It was recommended to me to post here instead of just a general post, so here I am.  I was diagnosed in January.  I joined a trial that was taxol and tykerb every week for 16 wks.  I finished that at the end of June.  Anyone have any questions about those two, I can help a little.  I had my surgery in July, surgery went great, tumors all but gone, but pesky axillary lymph didnt get better, it actually got worse.  So I am off to start AC (Friday) x 4 every other wk.  Im a bit scared.  I have heard such nasty things about it.  I wont start my Herceptin (12 months worth) till after the AC, cause both the A and the Herceptin cause heart isues.  After the AC is complete, I will get rads for 5x/wk for 6wks.  Not sure how I am gonna swing that with work yet, but will find out. If anyone has done AC or is currently doing AC that would be great, I would love to hear from anyone. Thanks Kim",
      "MessageIndex": 920,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 28, 2010 02:59AM - edited Aug 28, 2010 03:04AM by kimmie68 Well, I am back from my first AC tx.  I got light headed during the C and they had to slow it down.  I got Decadron, Emend and something else for the nausea before the tx started.  I have Emend, Decadron, and the Neulasta for after.  I have heard a lot of ladies talk about the Emend and how it is the best.  We shall see how it works.  The whole process was pretty quick and I was outta there earlier than I expected.  Went to the grocery store, came home, had a sammich, and bammm, I now feel like crap.  Not sure how to even explain it.  I feel sorta light headed, but its not like during the C of the tx.  My stomach is trying soo hard to revolt, but Im ignoring it \"Mind over Stomach\"... I am willing it to calm down.  Oh, yeah and when they say your urine will be red... hehe no doubt it is red. Now for something funny, I apologize if anyone gets offended now, but its not that bad.  One of the older gentlemen going thru stuff here started laughing like a school girl, and he brought over the paper for me to read.  Hope you get a kick outta it too. \"Driving While Inappropriate\"    An Ohio police officer who stopped a car for having illegally tinted windows received a bit of a shock when the driver rolled down the window.    Officer Ross Gilbert said he saw the driver, Colondra Hamilton, sitting with her pants unzipped and a sex toy in her lap.    Hamiton, 36, admitted that she was driving while watching porn on a laptop computer.    She was charged with \"driving with inappropriate alertness\" and having illegally tinted windows.",
      "MessageIndex": 984,
      "PostDate": "28/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 28, 2010 07:55AM kimmie68 wrote: Calamtykel - thanks for the greats words, I am starting to feel nausous again.  I think the smell of dinner is doing it, suppose to have tacos, sigh and it was my idea.  Now I dont know if I should even try to eat anything.  I would take the aches to being nausous, I hate it so.  I wonder if I can take the compazene the dr gave me for when I was on the trial.  LoL I keep sneezing too, and everytime I sneeze the nausea lessons, then about 10 min later starts to come back, how silly is that. Wherria - I am sorry to hear you are feeling so down.  Im sure your BF meant well, I just dont think all people understand unless they have gone through it themselves.  And Onemonga is right, maybe you need to be alittle more explicit with her.  I hope that things work out, I am sorry about your dog, on top of everything else, definitely something you did not need.  Hugs",
      "MessageIndex": 997,
      "PostDate": "28/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 28, 2010 08:00AM kimmie68 wrote: Calamtykel - WOW... im just not sure what else to say.  I dont know how you held it together, but you did and you and your children are safe.  WOW... what a jerk he was, and I found ironic that he says he was being a good driver... hahahaha..... he sure did prove how wrong he was.  Im glad you and your children are safe.  HUGS",
      "MessageIndex": 998,
      "PostDate": "28/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 28, 2010 11:39PM kimmie68 wrote: ckptry - they gave me zofran before the tx.  But nothing to take home. So I will call my doc on Monday and tell him how I did this weekend and have him add something, cause I definitely will not be able to work feeling like I am gonna be sick all the time, and with what I do (work in an Adult Day Center for mentally and physically disabled), there is no way I will not get sick.  Between the diaper changes, drool, spit, smells, and then those that like to bring there food up again.  I had enough problems with smells before this round, ugh.  They only gave me the Emend and Decadron. Nothing for long lasting after Monday.  But I will get that fixed ASAP. Wherria - Friends have problems too, and sometimes there problems seem huge to them like our BC feels huge to us.  Gingerbrew - Wow that you could say that to your friend, but that only means you guys must have a wonderful relationship. Its great that you have that one person that you can be so frank with and they dont get upset. Well, woke up this morning feeling like poo, took all my meds except my shot, gonna do that now, and I feel worse now that I have taken the meds, I wonder if I am having a reaction to one of the meds.  Maybe the Emend, I havent ever taken that before, but all the rest I have.  Who knows.  Anyways, gonna take my compazene now and just chill out for the day. Hope everyone has a good day/weekend. Hugs to all! ",
      "MessageIndex": 1025,
      "PostDate": "28/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 31, 2010 08:33PM kimmie68 wrote: DebJ - I hope tappering the steroids/drugs helps you not bottom out, I have heard them do this before and it definintely works for some.  I hope this works out for you.  As far as the port goes, I know that they talk about the skin thinning on the port, but not with only having used the port only 3x's.  I was given a little tube of emla (sp) cream and some bandages to hold it in place and told to use it about an hour before each treatment so it would be good and numb.  Which after the first couple I didnt use it anymore cause the skin had kinda formed some scaring, and it didnt really hurt much anymore, and I would also forget to put it on.  I am not sure why you couldnt even ice it, maybe someone else has heard more about this.  Maybe they are just being causous.  I would ask more though, just in case.  I have found that even each one of the Chemo nurses has their \"own\" way of doing things.  Ginger - Animals can be such a soothing essence for the soul.  I used to have dog that would curl up with me whenever I cried and I know she took my tears away.  I hope you have the best of times with your grandaughter.  I am so looking forward to my first grandchild in January.  I cant wait to spoil her/him or both (yep could be 2) then.  I am also pretty impressed that your dr got you in so quick after finding the lump.  I couldnt be seen for almost 3wks.  Let me tell you the waiting was not pleasant. Hope everyone has a wonderful day.  Off to getting ready for work.  Woo Hoo.",
      "MessageIndex": 1111,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Sep 1, 2010 08:18AM kimmie68 wrote: Wherria - that is just to funny. Most definitely Chemo Brain, and dont let anyone else tell you otherwise.  I guess 3 pairs under your pants are better than 3 pairs over your pants :P Put a call into the doc today.  I have still been nausous and they are possibly looking at giving me a shot instead of the emend next time.  I have also been dizzy, which could also contribute to the nausousness.  They want me to moniter my blood pressure.  Luckily I have nurses at work that will help me.  I told the nurse that it is like when you get outta bed too quick, and your equilibrium is off.  She said that it sounded like my bp was taking a dip whenever I moved too fast.  Or she thought I was dehydrated, but I have been getting up 2-3 x per night to potty, and I dont usually do that, so I am not sure if that is the case.  Anyways, I thank you all for being so wonderful and open with all your daily trials and joys, it helps so much to know that even though we are all not going through exactly the same thing, we are not alone with what we are going through. Hugs to all.... Kim",
      "MessageIndex": 1131,
      "PostDate": "01/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Sep 5, 2010 09:07AM kimmie68 wrote: I found this link in the September Chemo thread... might be helpful for those not to lose hair and for those on the Taxol concerned about neuropothy. http://www.elastogel.com/category_details.php?category_id=14&page=1  http://www.msc-worldwide.com/ Hope it helps someone.",
      "MessageIndex": 1322,
      "PostDate": "05/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Sep 23, 2010 06:08PM kimmie68 wrote: Chemopause....I am 41.  This is my 2nd round of chemo. My first round of chemo started in March and ended in June. My last period was February.... and I havent had one since.  My second round didnt start back up until the end of August.... nothing in between either.  So, I guess the question is once I am done with my last two tx, will I get it back.... honestly, I hope not, I dont miss it, dont need it, and the hot flashes are pretty much 1 or 2x a month now... before they were pretty regular.  Although sometimes I feel like Im getting crampy, but I dont know if I am confusing that with the pains in my back and hips from the neulasta shots. Neulasta - my first one was more manageable, my second was much worse.  Will have to see how the third one goes.  My wbc counts have been fine... it was my liver enzyme tests that were a bit off, but not enough to make the dr's panic.  Will have to see how they are tomorrow. Bad Breath - I had this problem with my first round of chemo, never had problems before it, and not having issues now.  Im guessing it was just the Taxol/Tykerb(lapatnib) combo that was causing it. ",
      "MessageIndex": 1916,
      "PostDate": "23/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Oct 22, 2010 04:46PM kimmie68 wrote: Went to the rad onc yesterday.... recommending 33 tx... basically what I had thought they were gonna recommend 6-7 wks 5x per wk.  The thing I hate most is that it will all fall over both the Thanksgiving and Christmas/New Year holidays. Had my MUGA as well, that didnt turn out so good.  Onc called me today with results, told me he is postponing all my treatments for 3 wks because the numbers dropped significantly and he wants me to get another one in 3 wks and then we will talk about starting the Herceptin.  Yeah for the SE's of AC... sigh.  Hope that the numbers are better for the next one, and this isnt anything permanent. Wherria - you made a good choice... I have been told time and time again that I have to have peace with whatever it is I am receiving, and I think you have finally gotten that. Lisa - I hope you have an absolutely fabulous time at the concert, you deserve it. Zenith - I do alot of lurking and reading, dont post often, but everyone is in my thoughts and prayers.  So dont worry, like everyone has said just being here is support for everyone. Hope everyone has a wonderful weekend. ",
      "MessageIndex": 2550,
      "PostDate": "22/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 26, 2010 09:30AM - edited Aug 26, 2010 09:32AM by kimmie68 Zenith - I dont know how old you are, but I do know that the chemo does some very nasty things to our emotions.  I havent had a period since February (right before I started chemo).. They told me that it will mess with our hormones and put us into early menopause... which could be temporary or permanent... ohhh yeah for us... one more thing to have to deal with.  You deserve to cry, and honestly I think that our crying breakdowns are great for us.. they are not pity parties, although we are entitled to those too, its cleansing for us, all those worries, doubts, and fears are being released leaving us alittle more cleansed and not so weighed down.  Allowing us to carry on and move through another day.  Oh yeah and crying isnt a sign of weakness, no matter what anyone says. And you know, yes I am only 41 but I have a 23 yr old daughter and she and her husband are expecting their first child in January.... I am so excited.  I do this for her and my grandbabies, I do this for my 15 yr old son, I do this for those around me that see that I WILL NOT LET THIS BRING ME DOWN.  I am a strong woman and we can do anything we set our minds to. Omaz - thank you so much, I look forward to meeting everyone.",
      "MessageIndex": 926,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 29, 2010 05:11AM kimmie68 wrote: Took my neulasta shot, not too bad so far, although I gotta say I can handle the achies better than the nausousness.  Having the pains in the same areas I did before, hips and down.... will see how the rest of the weekend goes.   Nap time !!!!",
      "MessageIndex": 1041,
      "PostDate": "29/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 30, 2010 05:03AM kimmie68 wrote: Just checking in, Im still here.  Started getting heart burn last night and that didnt help the nausousness.  Drinking milk every few hours though is definitely helping both.  Had to get school work done this morning or I woulda posted sooner.  Then ended up taking a nap.  I am so glad the decadron isnt keeping me up at night.  It must be a lower dose than the IV kind I had during my first round of chemo.  I am not looking forward to going to work tomorrow, but will put on my big girl panties and do what needs to be done.  I hope everyone is having a great day, and the weather here in MD is soo nice, I wish I could go out and sit in the sun. I loved reading about everyone, and finding things we all have in common makes it so much more bareable and that I am not alone in this journey. lisasinglem - I wish I could answer you completely.  I would talk to your dr about it, just to be sure.  I did a trial before my surgery in July.  Was on Taxol/Tykerb for 16 wks.  I had my last period in February, started the chemo rounds in March... havent had a period since.  It is possible that because this one is closer to the last one, that it is pushing you into early menopause and you wont have one after this one. Mine were already all over the place, one of the reasons I had gone to the dr's to find out what was going on with me.  Found out that the cancer can cause periods to do funny things to, and in my case it caused my hormones to go nuts, I even had multiple positive pregnancy tests, which wasnt even possible.  If you are concerned I would definitely talk to your doc though.  I hope this helped even alittle bit. libraylil - I love Law and Order too, I also have become addicted to Criminal Minds, and Rissole and Isles. Chemo Brain there was a study done on this and someone linked it somewhere, not sure if it was in this thread or not.  But I did go out and read it and they have actually images of how the brain changes when we are on chemo, I just hope that it isnt a permanent status.  I cant handle feeling like I cant remember things and trying to concentrate.  I make up notes for myself and then end up losing them too, or misplacing them.  So I went out and bought myself a Marble Notebook, this helps me to keep track of my bills and such. ",
      "MessageIndex": 1063,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 30, 2010 07:00AM - edited Aug 30, 2010 07:03AM by kimmie68 Calamtykel - I completely agree with you. Research has come along way.  My mom had BC back 14 yrs ago.  I know she went through worse SE's than I have.  They gave such higher doses of meds back then, along with the Rads too.  They have fine tuned so many things over the years, and yes they will continue to do so.  I was told to be very careful where I went to get information.  There is soo much negative out on the internet and so much of it doesnt apply any longer.  Oh and the Taxol is way more easier to handle than the AC.  I am hating it so much more than the Taxol. KatherineNaomi - I believe that the rosey cheeks are definitely from the steroids.  I have it now as we speak.  I also had it back when I had my first round of chemo, and the decadron is the only common medicine I have from then to now.  It will go away in a few days.  At least mine did during the first round of chemo.  Chemo on Fridays, rosey cheeks gone by Tuesday. I would just wipe my face with a warm towel and it would cool down some.  I did it a few times a day.  Made it more tolerable.  I do have to say that the hot flashes and night sweats stink.  I have been having them for the past 4-5 months and the Onc told me that it is cause I have gone into the early menopause.  Oh the joys!  He did also mention that it may not last and I may actually start up again after everything is said and done.  Not sure which I want more that time of the month or sticking with the hot flashes.  I honestly can say I dont miss Mother Nature's Gift.  Oh and my brother came home earlier today and is running a temp and is feeling like crap.  I will be staying well away from him.  Although, he did take me to my appt on friday for my first tx.  LOL, hope it isnt contangious.",
      "MessageIndex": 1068,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 30, 2010 09:15PM kimmie68 wrote: Well wish me luck, off to work I go.  Big girl panties on, just hope I dont get a wedgy.  Feeling tired and a little queasy, but still better than the past 3 days.  Hope everyone has a great day and lots of laughing to lift the soul. Hugs to all Kim",
      "MessageIndex": 1083,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 31, 2010 05:17AM kimmie68 wrote: Calamtykel - somewhere on this site, and I so wish I remembered where, there is a post about the ports and placement in the arm so that it doesnt rub against the bra.  If anyone else has seen it, please post so it can be of help to those that still need to get the port.  I found that my underwire on my good side rubbed alittle bit against it and took a little getting used to.  In the post they talked about using a marker to show the surgeon where the bra lays etc.  Some surgeons will be nice and help you out with this.  Anyways, just a suggestion.  I am so sorry that you had problems, but the port will be wonderful. I am a very difficult stick and couldnt have done this without it.  They had to stick me 4x just for the IV for the surgery for the port, if that tells you anything. For all those doing chemo this week - thoughts and prays are with you all that everything goes smoothly and that there are no issues with SE's etc.  Lots of hugs coming your way. First day of work done after chemo, handled it pretty good, girls I worked with were great with me, made sure I didnt have to change anyone that was stinky, that helped lots and lots.  Have a call into the nurse/oncologist to find out about what to do with the rest of the time I am nausous, I only have the compazene now, and it only works \"ok\".  If I keep drinking so much milk to help with it, I'm gonna turn into a cow with one udder. ",
      "MessageIndex": 1101,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Sep 23, 2010 09:06AM kimmie68 wrote: Lady - yeah I have told them, I have Prilosec for the heartburn, colace and something else to help with the constipation, and went out and bought benefiber chewy things also, lots of water.  But still had the constipation.  I was told one of the \"more prominent\" SE's was the constipation. Taxol - someone was talking about starting this soon, I apologize for not remember who, but I had 16 wks of weekly Taxol and found it more manageable than this AC crap.  The SE's I had on the taxol was some neuropathy in hands and feet (which is better now and I have been off of the Taxol since end of June), heartburn (which I am not sure was caused by the taxol or the steroids), and bone aches (mostly lower body). ",
      "MessageIndex": 1878,
      "PostDate": "23/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Oct 9, 2010 01:05PM kimmie68 wrote: Wow.. remind me next time never to miss so many days of reading over our thread.  Im still trying to catch up. Last chemo AC was Thursday... woots woots!!!!   3rd one kicked my butt in tiredness, but otherwise the SE's were much better than before.  I had some heart palps and dizziness with #4, they had to slow down the drip and the push for the AC.  I have noticed that because they slowed it down, my SE's havent been as bad as before.  Kinda makes me wonder. I start Herceptin on October 25th.  Unless my muga (Oct. 21) comes back different from the others.  Have also an appt with the rad onc on the 21st, to discuss my options.  They are recommending the radiation, but I really dont wanna do it.  I wanna know the whys to it all.  One LN positive, and it was encapsulated, and taken out during surgery.  I hope they can give me good reasons.  One thing I do remember with all the reading I have done is the post by Sweeney, about listening to the body and such.  I had gone and had my normal routine female appt in 2007, she had put in a mammo for me at the same time.  She didnt feel any lumps then, but then again she may not have been able to with my dense breasts.  As it turned out this was the same year that all hell broke loose in my house with my now EX.  So I never made it to my appt for the mammo.  It makes me wonder if they would have found something then.  I try not to beat myself up about it.  They had told me with the size of my lumps that it had been there for a while... what is a while?  Anyways, we can play these what if games all the time if we want. I hope u guys have a good weekend.  Gonna go finish reading the posts. Hugs to all. ",
      "MessageIndex": 2311,
      "PostDate": "09/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Oct 20, 2010 11:55AM kimmie68 wrote: Finally caught up on all the reading.  Been busy between work and college classes.   I hope everyone is feeling better from their colds and coping with the SE's.  Im finally feeling more normal now that the AC is completed.  Taxol... I had it for 16 wks, every week and the bone pain was awful at times.  It kind of reminded me of when I was younger (you know like 8 or 10 young), and I would get pains in my legs, and my mother always told me they were growing pains.  My dr's gave me Tylenol 3's and then percocets.  I go on Thursday for my consult with the rad onc.  I am hoping that they give me the right answers and pray for no radiation.  But I know that my onc has told me already that they are recommending I have it, because of my ONE lymph node.  I have a MUGA after that appt cause of some heart flutters and then it speeds up afterwards.  Worried that the AC caused some heart issues. I get my first Herceptin on Monday, Oct. 25th, unless there was a drop in the results on my MUGA.  Then they may make me wait till the results get better.  Hope everyone was a wonderful week with no SE's. Hugs. Kim",
      "MessageIndex": 2491,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 26, 2010 09:16AM - edited Aug 26, 2010 09:19AM by kimmie68 Lizzy thanks for the welcome, feel much better, I have tried posting in many places, but received very very limited responses, and was starting to feel like I had the plague along with the BC. Zenith with the AC are you working?  I work at an adult day center for the mentally and physically disabled.  They come into the center always sick, you name it, they have it.  I was told I would prolly get the neulasta shot, just not sure how I feel about giving myself a shot.  Nausea and vomiting.... ewwwww.... I am nausous on a regular basis as it is, that is not something I look forward to, and hope the meds they give for it work. Now the Taxol... the biggest thing for me was the neuropathy and the aches in my lower body.  The worst of the neuropathy was my fingers going pretty numb from the tip to just about the 2nd knuckle and my feet up to about mid calf, but it was more of a tingly feeling with lowered sensation.  My onc reduced my taxol when I told him that I could only feel the steering wheel in the palm of my hand.  My onc did not want me to not be able to drive, once the taxol was reduced, the neuropathy lessoned, and I was good to go.  My nails on my hands are still recovering, I did not lose them, they just died lower down about half way down the \"pinkish\" part of the nail.  And once they grow out, they will be as good as new. There was some discoloring... kinda brownish/mustard like color.  The aches were mainly in my lower body, hips and legs.  I ended up taking tramadol since the tylenol wasnt working like it had at the beginning.  Unfortunately, the SE's are cumulative.  I did have some heartburn, but that was mostly for the first day or so after each treatment, and I was given Prilosec for that.  Overall, Taxol is very very manageable.  If you read in other places about it, I have found many people said that it was one of the easier chemo's that they had been given.  Oh yeahh... hehe dont forget the hair, but I dont think that will matter much with you already having the AC.  It took me like 6 wks to lose my hair.  Its now growing back after being off the chemo since June... but its coming back in a interesting shade of silver and white.... IM ONLY 41, blah... I guess thats why they make dye.  Although, if I lose it again with the AC, I wonder what color it will come in then.... hmm.",
      "MessageIndex": 924,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 25, 2010 09:48PM kimmie68 wrote: I understand the stress at work issues, I havent been at my job a year, do not have FMLA yet.  I was told if i was out too long from my surgery they would have asked me to step down or released from my job.  What the heck does \"released\" mean... fired... I was out for 4 wks.  I have been lucky so far, that they have worked with me.  I do understand that they have a business to run, but damn to threaten to fire us when we try so hard to do what we need to, like that will make the BC go away faster.  Sorry this is a pet peeve for me, I didnt appreciate being threatened with losing my job while going through my first round of chemo and getting ready for surgery. I didnt need to have to worry about whether I would have a job to go back to while I was trying to recover.  I know that there are answers out there, I just wish I knew what they all were.  I am already on a form of Cobra.  I am newly divorced (April).  So, when the divorce was final I lost my military benefits. Was in the middle of my trial chemo run at Walter Reed and wondering what the hell I was gonna do.  I pay 331/mo for my healthcare.  My job offers healthcare, but I was worried with going with it in the middle of this mess. I felt that the peace of mind was better than the lower cost of my jobs healthcare, so I stuck with the Cobra.  Maybe in the next couple of years, the current administrations health plan proposals will be all in effect and we wont have to worry.  But I am not gonna hold my breath.",
      "MessageIndex": 934,
      "PostDate": "25/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 28, 2010 09:59AM - edited Aug 28, 2010 10:01AM by kimmie68 Lizzy -  worrying definitely doesnt help, but I know its sometimes difficult not to.  You seem to have good attitude about it, and I am thinking positive thoughts for you.  I have been sucking down lots of water, hoping to keep the nausous away, it seems to be working, but Im getting kinda a bloated feeling... blah.  Oh well, hope I sleep through the night. Texas - that is wonderful, keep up the great progress.",
      "MessageIndex": 1005,
      "PostDate": "28/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Sep 5, 2010 08:04AM kimmie68 wrote: I found this while looking up stuff on Neulasta, that you guys would find it... overboard. http://community.breastcancer.org/forum/6/topic/723025?page=1 Katherine- thank you for posting that again...Aloxi - that is what the research nurse said they were going to give me before my next chemo to keep the nauseousness away.  I have to write that down in my book.",
      "MessageIndex": 1319,
      "PostDate": "05/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Sep 9, 2010 10:02AM kimmie68 wrote: Lizzy - I see my Onc or the on-call Onc (Onc of the Day) every time I get a treatment, especially if there are any questions or concerns about me not getting the treatment.  It allows you to tell them everything that your feeling (physically, mentally, emotionally)... and they can do their job and make sure we are getting through it by prescribing us meds :P     Sorry bad humor, but they do want to make sure that there isnt something that was overlooked by anyone.  It always made me feel better that my Onc was paying attention to my labs and my SE's.",
      "MessageIndex": 1433,
      "PostDate": "09/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Sep 23, 2010 07:44AM kimmie68 wrote: Lizzy - I think the red sauce might be cause of the acidity with mouth sores and heartburn like others have said. And I love my salmon, I am not sure I want to know if they are petri or not... blind is bliss?  ugh.  Believe it or not Salmon was the only thing that I have eaten through both rounds of chemo (taxol and AC) that still tastes the same.  Lisasinglem - I'll have to try the Senna.  Havent tried that yet.  And hemerroids hurt more than I want to think about.  I was afraid I was gonna have to go to the ER last week.  But I was gonna try everything I could think of first before having to go and tell some unknown ER doc that I cant poo.  I am also hoping that with all the bleeding that I didnt mess up my counts for tomorrow's chemo. I noticed some were having problems with hot foods, anyone having problems with cold bothering their teeth?  Anything liquid from the frig is cold enough to make my teeth hurt.  Another reason not to eat, unless its lukewarm, blah.",
      "MessageIndex": 1898,
      "PostDate": "23/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Sep 24, 2010 08:13PM kimmie68 wrote: 3rd AC down... 1 more to go.... They gave me Olanzapine (Zyprexa) for the nausea this time instead of the Aloxi. The dr I saw today said the Aloxi was almost the same as the zophran and wouldnt do me any good.  Well I do have to disagree so far.  Nausea started about 5 hrs ago.  Will have to take the ativan soon to help, but not ready for bed.  Otherwise just tired. Lizzy - Please dont quote me, chemo brain is kicking in, and I only remember bits and pieces of this conversation.  I was told that if I went into permanent menopause I would get tamoxifen, but if I didnt I would get something else.  I am HER2 +.  The being thrown into early menopause makes us higher risk for getting BC again.  I will have to ask again.  Also, I had a question about your getting your foob replaced and then getting radiation.  Have you looked into this.  I have heard from many women that you should have the radiation first, then have your recon and such.  They say that it can effect the recon and also cause it to shrink up.  Not trying to scare you, but was just something that I had heard and didnt want you to have any issues later on with another surgery.  If nothing else it is something you can ask about again. Lisa - I am sorry you had to leave your show, but Lizzy is right.  You have one body and you need it.  Your not a weak woman, I think you are very smart to listen to what your body is saying and took the rest.  Texas - glad your back. I had to ask about butter tarts and beavertails on my game.  We have a few Canadians in our guild.  They were like omg they are the best pastries ever.  And then we got into a discussion of Canadian Bacon and what it really is, and whether it is really from canada...   go figure.",
      "MessageIndex": 1951,
      "PostDate": "24/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 25, 2010 08:09PM - edited Aug 25, 2010 08:10PM by kimmie68 Zenith - I was on STD for my surgery, I still have like 22 wks left before I would have to use the LTD.  I really want to try to work through this.  I only missed a few days during the other chemo round.  Financially I cant afford to be out on STD, they only pay 60% of my pay.  Oh well, I will have to see how it goes and decide from there. Its good to be proactive, the compazine worked great.  Also, how often are u getting the taxol?  I got mine every week, so it was in a lower dose than every other or every 3 wks.  That could also make a difference.  You will do great, and I am around on here a bit reading if you ever need to talk.  Hugs..",
      "MessageIndex": 931,
      "PostDate": "25/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 28, 2010 06:21AM kimmie68 wrote: Onemonga - agreed but still found it humerous. Well, I took a nap, feeling a little better and my son is making me some tea.  Head still feels weird, and body is achy, think all that is making my stomach feel like revolting.  I hope I can eat dinner in a few, cause not eating isnt good either.  I tried drinking water before I slept and it made my stomach feel worse... sigh.  Hope those that did chemo today are doing better and are not feeling a thing.",
      "MessageIndex": 989,
      "PostDate": "28/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 28, 2010 10:20AM kimmie68 wrote: Calamtykel - they didnt give me compazene around the clock.  They have giving me Emend 80mg for the next 2 days and then decadron 4mg 2x/day for the next 3 days, and of course the neulasta shot for tomorrow.  Im thinking, im just gonna take the compazene I have regardless, and make sure I keep taking my colace so I dont get constipated.  Thanks for being so helpful, I hate feeling like I am complaining.  I guess I just wasnt expecting to feel the nausea with the 3 meds they gave me today before the treatment, and it happened so fast afterwards (only a couple hours).  As a matter a fact, I stopped typing this just to go take it.  I did eat alittle bit of the tacoes, took me like 30 min and ate little bites while drinking water after. And yes smells just killed me in my 1st trimester of pregnancy... ugh",
      "MessageIndex": 1008,
      "PostDate": "28/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 29, 2010 12:04AM kimmie68 wrote: Sweeney great idea.  I had to actually stop and think about who I am outside of this.  I had been having difficulties doing this even before the BC, maybe it was like a mid-life crisis thing.  I kinda got lost in my kids, husband and our business and forgot who I was.  I'll have to think more before I actually post a little list. JSW its awesome your doing well after your first.  Im gonna try the eating small meals thing, the problem is with the nausea, I dont feel like eating anything because I am afraid I will just not keep it down.  But I guess if I dont try, I wont know.  I hate these darn steroids, I slept fine last night, but I am overly hot with them, and that makes me even more irritable with the nausousness. I guess everyone reacts differently to the same meds.  I didnt have this many issues at the beginning with the Taxol and Tykerb, only after having the first 12 wks did I seem to get really bad.  Well hopefully it will all get better. Thanks everyone for the encouragement and great advice.   ",
      "MessageIndex": 1028,
      "PostDate": "29/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Aug 29, 2010 11:02AM kimmie68 wrote: I have 3 children 23, 20, and 15.  My 15 yr old lives with me, my 20 with his dad, and my 23 yr old with her husband (expecting first child in January).  Homeschooling is so much fun.  I did my oldest from grade 3 thru 8th.  I was extremely intimidated to try highschool.  But the homeschooling paid off.  She went into all Honors and AP courses in the 9th grade and as on deans list the entire time in high school.  She ended up with scholorship offers to many colleges. I wanted to school my youngest, but he was so head strong and independent in a bad way.  He didnt listen for crap, figured it was a Mom syndrome and decided others more qualified would do better.  Now I wonder, he has been bored for years and after barely passing the last 3 yrs in a row (he is 15 and in 10th) wanted me to sign off on a AP Psycology class.  He told me he needed a challenge and felt as if this would do it.  I hate to think that I gave up to easy with him and not schooling him... sigh... cant take back the ifs. I am currently going to college to get my degree in Graphic Arts.  Gave up finishing my degree to stay home and take care of my children.  So after 18 yrs of being home, I have ventured out into the work force and into college again, what a wake up call. My middle child has cerebral palsy and after taking care of him for almost 18 yrs I was wiped out, lost myself, and had a breakdown of sorts.  My husband (ex now) had a heart attack and stroke at age 40, and in the process of his recovery we pretty much lost our business.  Everything kinda went down hill from there. My ex and I finalized our divorce in April, right in the middle of this mess of my health issues.  He is already engaged to someone else and is due to be married next April.  Kinda ironic, wonder if they made it the day our divorce was actually finalized. I love to read.  I have a Kindle and download my books to there.  It is great.  I read anything from sci fi to romance and love anything mystery... Agatha Christie to Terri Gerritsen, and the guy who did Di Vinci Code (his name excapes me at the moment). I play WoW with my son... World of Warcraft.  Its fun and allows me to meet new people, since I am kinda homebody.  Believe it or not I am an introvert as well. I love all other kinds of games as well. I am kind, compassionate and giving.  I have a somewhat tenuous relationship with God at the moment.  With everything that I have gone thru over the last 3.5 yrs, I am very angry.  He and I still talk, I just feel like he abandoned me, which I know deep down is not the case, but its just been so difficult.  I am Pentacostal and I do still pray, but my church going has been sporadic.  Feeling tired and ill doesnt help much. I stink at keeping house now that I am divorced, it was such a demand when I was married that now, I dont care.  Well sorta dont care... it does drive me crazy at times, and then I go into a frenzy of cleaning and drive my son crazy. I guess that is plenty.  I didnt realize I had typed so much.  Sorry to be so long winded.",
      "MessageIndex": 1049,
      "PostDate": "29/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Sep 4, 2010 12:21PM kimmie68 wrote: Sorry havent posted in a few days, been coming home from work, doing school work, eating dinner and going to bed.  Started coughing and hacking Tuesday, and was worried I was gonna get pneumonia when I started coughing up yucky stuffs.  But It seems that all that coughing helped eliminate it, but left me feeling sore in the rib area.  I have been falling asleep early, but then wake up every few hours for whatever reason, toss and turn and then finally fall back asleep.  Not sure what keeps waking me up, but I am tempted to just take my Tylenol 3 to knock me out this weekend so I can get a full 8 hours of sleep.  I have still been a bit dizzy when I move to quickly, and I really think its my blood pressure.  The research nurse I speak with told me that they will prolly give me a shot for the nausea instead of the emend and that the compazine I was taking may have been also causing my blood pressure to go wonky.  Someone actually posted the name of it somewhere here, but now I cant seem to find it, started with an A. I love the research nurses I talk to, they both have been thru this and know exactly what its like.  So when I explain this is how I am feeling, they dont look at me like I have 3 heads.   I have been reading and keeping up on how everyone is doing, and praying for all of you.  I noticed alot of you have been having the pains with the Neulasta, and was curious at where everyone was getting there shot.  LadyinBama and I both did the tummy (yes I have extra too), and neither one of us has had too many SE's from it.  Could it just be our bodies, luck of the draw or coincidence.  Lets see where your getting your shots and compare.  Its just a thought.  I also take the claritin daily regardless of the shots because when I started my first chemo in March I ended up with a perpectual runny nose.  YoungMom - I am so sorry to hear about your surgery healing.  I cant even imagine how it must feel.  I pray for speedy recovery and peace of mind. Lizzy - I am curious as to why the ct scan is needed before you start chemo.  Will they change what chemo you get if something is showing up or do something differently?  I know that the waiting and is driving you crazy, but I would imagine that the dr's have a good reason... or at last I hope they do for extending the timeline for you.  I hope you get the answers you need fast and that the tests show nothing at all.",
      "MessageIndex": 1291,
      "PostDate": "04/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Sep 4, 2010 01:12PM kimmie68 wrote: Lizzy - dont give up hope, cause like you have said many times already, you have had some injuries back there and it could just be from that.  I hope the time goes quickly for you, keep yourself busy, sometimes that helps.",
      "MessageIndex": 1293,
      "PostDate": "04/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Sep 9, 2010 08:41AM kimmie68 wrote: I had a few friends that I was very close to.  His family and mine did a lot together.  We spent time together prolly 2-3x per month.  Him, his wife, and kids live an hour away, so it wasnt like it was always easy to get together.  When I found out I had BC they cried, and told me that they would be there for me when I had surgery, and help me whenever they could.  I have talked to them maybe 2x since January and have not seen them at all.  Not even a how are you doing, nothing.  I have to say I was totally devistated.  It wasnt something I expected.  We had been through so much together, good and bad, and for them to totally just up and stop talking to me was in some ways almost as unbelievable as the BC. Its unfortunate that I had to find out what kind of friends they truly were when push came to shove.  And it has been amazing to find that the couple of girls that I work with have been more and done more for me than I could have imagined.  Do they hear the big \"C\" word and think, omg your gonna die, lets cut and run now so it doesnt hurt?  I wish I could know what when through their minds when I told them, and what made them decide to turn tail and run.  Believe me if they were scared, I can understand, arent we all.... especially when we are going through all the things that we are going through.  I just cant fathom doing that to anyone that is going through what I am.  That isnt the type of friend I am.  Oh well, I guess s*** happens. Calamtykel - my prayes and thoughts are with you tomorrow when you get your port.  I hope you have a peace that can only come from God.  57Colleen - I hope you get the rest you need to get stronger and everything goes well with your tx. Lizzy - Hope your scan goes well tomorrow (I think you said it was tomorrow)... I keep scrolling up and down trying to find stuff I read, I should prolly keep notes as I read instead of waiting until I have caught up. Zenith - Im glad your feeling better, hope your up for your tx tomorrow and it doesnt have to be postponed. JSW - It is a great site, I havent ordered anything from there as of yet.  I have a few scarves I bought and that were given to me as gifts.  The problem I have is that my head gets so hot and I start to sweat or I get a lovely hot flash in the middle of my work day so I end up taking it off anyways.  Everyone has gotten so used to me going \"bald\" or \"nearly hairless\" for so long, they would prolly wonder why I was hiding it under a hat or scarf now.  But I am so glad I have them for when it gets colder, not sure how my head will handle that. To everyone getting tx this week, I wish you all SE free weekends and lots of energy.  I am not looking forward to mine.. blah. ",
      "MessageIndex": 1428,
      "PostDate": "09/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Sep 23, 2010 08:24AM kimmie68 wrote: I have been lurking in the corner reading how everyone is doing.  Really havent felt up to responding, but have been thinking about everyone, and sending out prayers.  My 2nd chemo was worse than the 1st, and I just dont want to go Friday for my 3rd.  Im tired of feeling like I have been run over multiple times.  Barely have the energy to drag myself to work everyday and home and then do school work.  Everything I eat feels like it is just not being digested and floating around in my bloated stomach.  I was so constipated this past week, that I had to give myself a enima.  And wanted to scream everytime I went to the bathroom for days after. Yeah how fun is that.  And yes I have stuff to help keep me regular, and have been eating foods to help, but they didnt work.  Better now, but I am leary on eating anything.  The heartburn and indigestion on top of it makes me want to be sick.  And smells are killing me.  And to top it all off, literally, I went and took a shower Friday (yes I take them regularly) and didnt pay any attention to the shower, just was enjoying the hot water.  Got out, dried off, and low and behold, all the hair on the top of my head and I mean just the top of my head was gone.  I had hair on the sides and back, but nothing on top.  So I ended up having to shave what little bit of hair I had left off.  Thanks for letting me rant. JSW - have you asked the dr's about Aloxi... they gave it to me at my 2nd chemo and it helped with the nausea some, they also gave me Ativan.  This was all on top of the decadron, zophran (think that was wha it was), and the Emend.  Lizzy - yes the constant tasting of food to find something that tastes anything like it is suppose to sucks.  Oh yeah also, the nails growing... could it be that you are taking in more calcium than you had before.  More milk, the protein powder, boost, etc?  I know that makes my nails grow like crazy and also makes them stronger. Wherria - I was very glad to hear that you went to your concert, I can just imagine all those people there with their white flags waving, sounded like a wonderful time. Calamtykel - I have not had pain up that high with the Neulasta shots, mine has been mostly lower back, hip, and legs.  Definitely call the dr. Lisaattheshore - I have asked and was told not to worry too much right now, since I still have to see the rad onc dr, and go through a year of Herceptin.  Alot of people get full body scans and all sorts of other things, I was told I prolly wouldnt get those.  I was kinda worried about not cause of the lymph node involvement, but then again, I am trusting that they know what is best.  Texas - I agree with everyone's advice, get off Facebook or however it is that you are getting this information.  You dont need the stress, anxiety, mental battle that you are being put through.  You have more important things to do then give what energy you have to that situation.  I am soo sorry that you are having to deal with it though. Well I wish you all SE free days.  I'll hop back on later and lurk.  Hugs to all.",
      "MessageIndex": 1874,
      "PostDate": "23/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "kimmie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104176/profile",
      "Content": "Jun 27, 2010 09:45AM kimmie68 wrote: Thank you so much for this post.  It made me laugh and know that I am not the only that has been thru this particular experience. Its funny how I could work all day and not have a problem and the minute I would get into my car to go home, I would be like oh my damn... hurry hurry hurry, go go go, turn green, move faster.... and I only live about 4 minutes from work... and still wouldnt always make it home.  I am currenly on my last week of 16 wks of Taxol/Tykerb regimen.  That Tykerb does some nasty stuff to your tummy.",
      "MessageIndex": 22,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754407",
      "Title": "WARNING: Tykerb and Pineapple juice does not mix!! Fitztwins kimmie68"
    }
  ]
}