{
  "AuthorID": "kimmymacbu",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45212/profile",
  "Posts": [
    {
      "AuthorID": "kimmymacbu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45212/profile",
      "Content": "May 16, 2007 05:39PM kimmymacbu wrote:",
      "MessageIndex": 29,
      "PostDate": "16/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/454789",
      "Title": "Found: Inexpensive Gel Prosthesis LauraGTO apple"
    },
    {
      "AuthorID": "kimmymacbu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45212/profile",
      "Content": "Sep 26, 2007 05:47AM kimmymacbu wrote: Okay - I liked the Crazy Sexy Cancer book and movie.  Way before I ever heard of it, during my chemo and rads last year, I saw a kineseologist who recommended a largely alkaline diet.  She gave me a list of foods and said try for an 80/20 or so balance.  Most of the recommendations were sensible, but others (avoid lentils, garbonzo beans, etc.) I took with a grain of salt.  The main thing I took away was stay away from white sugar, white flour, and white rice (the Oprah diet by the way) and alcohol and lots of dairy.  I've also read that you can't change your body's pH -- so I wouldn't call it a miracle.  It's a healthy way to eat regardless.  Just my 2 cents (and yeah, I still drink white wine and the occaisional Diet Coke w/ lime and I don't think it'll cause liver cancer either.)  --Kim B. Stage 3C, dx 9/06",
      "MessageIndex": 4,
      "PostDate": "26/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/686503",
      "Title": "Crazy, Sexy, Cancer Naomi kimmymacbu"
    },
    {
      "AuthorID": "kimmymacbu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45212/profile",
      "Content": "May 19, 2007 06:54PM kimmymacbu wrote: Some days I spend a lot of time sculpting my puff so that it resembles my remaining breast. This involves smushing the puff a lot. I wear the long side horizontal. My puffs are all loose, also from removing about 1/2 the filling -- I just push the filling to the bottom, leaving the cover in its original shape. Am. Cancer Society gave me a couple varieties. My mom tells me most people don't look at my chest. I don't really buy that, but lately I just kinda feel -- who cares? Yeah, I have cancer. Good luck -- just play with the puffs and you'll get used to what works. -- kim b.",
      "MessageIndex": 2,
      "PostDate": "19/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/613509",
      "Title": "Resizing fiberfill inserts susrichmond tos"
    }
  ]
}