{
  "AuthorID": "kinde5069",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
  "Posts": [
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jun 12, 2008 09:12PM kinde5069 wrote: Embarassed is the right way to express the feeling of having to let others do the giving. I had to work over tonight, trying to tie up all the loose ends. I seem to get tired so easy any more. Today my left breast was burning so bad, I could hardly stand it. Hope this makes you smile. We sure can use the smiling. I went to see a 94 yr old man and he had the biggest smile when I came through the door. He said \" you shouldn't take my blood pressure now, it always goes up when you walk in.\" He made my day. I was feeling a little green around the gills, with it being so hot. He will never know how much he lifted my spirits. Funny how God sends someone in to do his work. Hope you all have a good night. I am headed to bed. Huggs Toni",
      "MessageIndex": 17,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jun 13, 2008 09:24PM kinde5069 wrote: Thank you everyone. You are all very kind. I see the Oncologist on Monday and will have my list of question ready. Tomorrow I am having a BBQ with family and friends. Then I have to get my nose to the grind stone. I HAVE to have all this paper work done for Monday. I talked to my boys Dad today and he said he is going to try to be at the hospital during surgery as support for the boys. The second ex is avoiding the whole thing. I know sounds strange, but both ex's and I have learned to be friends over the years. I am doing ok today. Worked late again, came home and took a nap and now ready to do some house work. I hope everyone is doing ok and has a nice weekend. I hope you all know that you are special. Thank you for being such a great support system. Huggs Toni",
      "MessageIndex": 21,
      "PostDate": "13/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "kinde5069 wrote: I got my dx on 5/30. I cried that day, but have been fine since. Until yesterday, surgery is being set up for next week. A modified rad mastectomy. Now I am scared and the tears won't stop. I am not sure what I am feeling except scared and angery. And I don't have anyone to be mad at. My Mom passed from COPD 3 years ago and I have yelled at her for not being here. I don't feel like I can talk to my sister, she is doing everything she can not to show her feelings. My adult son's, one is supportive and the other is so scared he is being a jerk. My poor dog had to be put on antidepression meds. He is a super Mommys boy. I am worried how the house note is going to be made, if I am not working. If have never felt so alone. And I know I am not. God has blessed me with so many wonderful friends. I know it is my own fault that I feel alone and scared, I don't want to upset anyone with letting on how scared I am. I am not good at being on the recieving end. I am the caregiver and I don't know how to let someone else do the work. Thanks for letting me go on and on. Toni Believe in Magic Dx 5/30/2008, IDC, 5cm, Stage IIB, Grade 2, 3/15 nodes, mets, ER-/PR- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "10/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jun 22, 2008 01:42AM kinde5069 wrote: I am home from surgery. I am so very sore. The port site hurts far more the mast site. I woke up about 3am as the hospital in a dead scare, full blown panic attack. I jumped right out of the bed, IV and all. Scared the poor little aide, she went running for help. I was just standing there like a jerk, screaming, \"I don't want to die, I know I am suppost to be doing something, but I don't know what.\" The nurse had to get a one time order for Ativan. You see, what we thought was IDC stage 2 with mets to lymph nodes turns out to be IDC stage 3 B with mets to lymph nodes. The doctor says the only change to the plan of care is that the chemo will run longer now. That I have to be on a low fat diet, no smoking, exercise 30 min a day 3 to 4 times a week. I have to have a bx of the thyroid as the right side is hugh and still get the Muga scan done. So my sister and son have removed my smokes from the house. I will have patches Monday to help giving over smoking. I hope it helps. I have always been on a low fat diet. But we are going to start walking 30 min a day. I am headed to bed, as I am falling asleep as I am typing. Thank you all, your the best. Jaly I will write you sometime tomorrow. Huggs Toni",
      "MessageIndex": 37,
      "PostDate": "22/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "kinde5069 wrote: I have been reading the posting and have not seen numbness addressed. They removed a tumor that was 5cm and 15 lymph nodes. I have two drains. The left side of my chest around to the back and my upper left arm is numb. I am starting to get some sensation back and it feels like I have something crawling on me. Also as the sensations comes back I am starting to have increased pain levels and alot of burning sensations. Along with severe swelling at night. I have given up sleeping in bed and have moved to the sofa. Is this numbness normal, or should I call the doctor right away. Huggs Toni Believe in Magic Dx 5/30/2008, IDC, 5cm, Stage IIB, Grade 2, 3/15 nodes, mets, ER-/PR- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707995",
      "Title": "Had Mod Rad Mastectomy 6/20 kinde5069 Firelady"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jun 25, 2008 05:36PM kinde5069 wrote: Thanks. I still have both drains and I am getting around 50cc to 100 cc aday, The swelling is more under the arm. I will call the surgeon tomorrow. I have appt to see her on July 1st., so I will see if she wants to see me before that. Huggs Toni",
      "MessageIndex": 5,
      "PostDate": "25/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707995",
      "Title": "Had Mod Rad Mastectomy 6/20 kinde5069 Firelady"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jun 30, 2008 03:24PM kinde5069 wrote: Friday night 5/26 I went to ER, the swelling got so bad that I just couldn't stand the pain. They said there was no infection, gave me some pain shots, changed my pain pills and sent me home. I see the surgeon tomorrow morning and praying for some relief. The pain is bearable. But the swelling is so bad in the arm pit area that it is interferring with mobility of the arm. Huggs Toni",
      "MessageIndex": 8,
      "PostDate": "30/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707995",
      "Title": "Had Mod Rad Mastectomy 6/20 kinde5069 Firelady"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "kinde5069 wrote: I got my dx on 5/30. I cried that day, but have been fine since. Until yesterday, surgery is being set up for next week. A modified rad mastectomy. Now I am scared and the tears won't stop. I am not sure what I am feeling except scared and angery. And I don't have anyone to be mad at. My Mom passed from COPD 3 years ago and I have yelled at her for not being here. I don't feel like I can talk to my sister, she is doing everything she can not to show her feelings. My adult son's, one is supportive and the other is so scared he is being a jerk. My poor dog had to be put on antidepression meds. He is a super Mommys boy. I am worried how the house note is going to be made, if I am not working. If have never felt so alone. And I know I am not. God has blessed me with so many wonderful friends. I know it is my own fault that I feel alone and scared, I don't want to upset anyone with letting on how scared I am. I am not good at being on the recieving end. I am the caregiver and I don't know how to let someone else do the work. Thanks for letting me go on and on. Toni Believe in Magic Dx 5/30/2008, IDC, 5cm, Stage IIB, Grade 2, 3/15 nodes, mets, ER-/PR- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jun 23, 2008 12:11AM kinde5069 wrote: I did real good not smoking until tonight. I was getting undressed to get ready for bed and there was blood. I am like OMG. So here I am looking for some place that the blood is coming from and I find a hole in my stomach and it is now just draining. Well I got scared and told my son Kevin I want a smoke and BS about it. Called a nurse friend to see if she could come over with the pt/inr machine to check my levels. She was not at home. the draining has almost stopped, and I now have a sore in my mouth. Damn I have not even started chemo yet and am falling apart. So Yes I had 2 smokes. Tomorrow I get the Chantix and will be fine I hope. I walked to the down to the next corner twice today. And am more sore today then yesterday. The incission is starting to feel a bit funny. And I am still very tired. Headed to bed. God Bless all of you. Toni",
      "MessageIndex": 40,
      "PostDate": "23/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jun 23, 2008 07:07AM kinde5069 wrote: Thanks for holding my hand Jaly. It (what ever it is ) is draining, so I will call the doctor today. The sore in my mouth is better.  I just want to sleep for 24 hours. Doesn't that sound nice. I am going to try and work on some art. I do digital art and think I am going to work on something today.Today is starting out ok. Praying that it stays that way. Huggs Toni",
      "MessageIndex": 42,
      "PostDate": "23/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jun 11, 2008 06:09AM kinde5069 wrote: Thank you very much. I am sorry I did not come back in yesterday. I just sat here in my pc room and had a super melt down. Shirlann, I do expect to recover from this. Yes I am scared of the surgery, how is my body going to handle radiation and chemo, and losing my hair. Will they get it all. How sick am I going to be from the treatment. My biggest thing is  not losing my home, that scares me the most. When I left my husband right after my Mom's passing, I left with only the things I could carry and my dog. We were in a very tiny appartment for a year. I worked hard, long hours so we could get a house. And I did. Well it looks like for at least a few months I don't have to worry about my home. I found out yesterday that one of the companies I worked for is putting together a fund riser to try and help me with the bills. God Bless them. I did not go to work yesterday since I had more CT's, Xrays and ultra sounds and was not able to control the tears. Again I got very ill from the the crap you have to drink for the CT's, so I was not able to work after everything was done either. All of your hugs, support and words of advice must have clicked a small light on for me. I do feel better. That was my first melt down and I am sure not the last. This is the first time in 20 years I have had so many friends that are kind caring people. For the first time, I am not allowing anyone in my life that is in any way, shape or form of an abuser. When I left my husband, I left all mean people behind. So you see people being kind is really a new thing for me. Jaly, my oldest son finally unloaded on me. He was not very nice, but I let him talk (yell) without saying a word. Now he has it out of his system and at least for now, he is ready to face this. He finally asked what can he help with. He did make my youngest mad, but he keep his mouth closed also, and just let him get it out of his system. And they are planning on spending the day together Sat and go do guy things. My oldest son has been through alot this past year, his wife was dx with bipolar and it has been a real roller coaster ride for them. My youngest is a wounded vet, so he has been going through a world of crap too. It is a never ending battle to stay on top of him getting proper medical care. Thank you all sooooooooooooo very much. God Bless and protect all of you. I have another MRI to do today and a ton of paper work to get done for work before the weekend. Huggs Toni",
      "MessageIndex": 7,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jun 18, 2008 06:02AM kinde5069 wrote: Jaly, Thank you, they are soooooooooooooooooo Beautiful!!!!!! They really are beautiful. Yesterday was not a good day, the tears were right there all day. I guess getting closer to the surgery day and the weight gain, being tired all the time and just not enough time to get everything done was to much for me yesterday. My sister and I walked about 3/4 of a mile to try and get that blasted fluid moving. I will try to walk again today. I was so edgey that I finally broke down and took an Ativan that the doctor had given me. I don't know what I have been saving them for. I am getting scared now. I want to run as far away as I can. But I know it will do no good. GOD, I HATE ALL OF THIS. Right now it is so hard to remember the good that is coming out of this. Such as I had no ideal how many people care, how kind strangers can be, meeting so many new people. Damn it I want my Mom. I yelled at her again last night that she shouldn't have passed, because we need her. How unfair was that to say to her. A very close friend called yesterday telling me about a old boyfriend that just came back in his life to ask him to go to Spain with him. I told him he was a fool if he did not at least try. But in my head I was yelling, No then you won't be here to make me laugh. I was so ashamed for thinking selfish. My head is just all over the place. I feel like everything is spinning out of control. And I am right dead center of the spinning. I am so sorry, I know there are some one you ladies that are having a harder time, and I should be looking for your posting to try to say something nice to you. I am going to go take a long hot shower. Huggs Toni",
      "MessageIndex": 27,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jun 16, 2008 10:11PM kinde5069 wrote: I had my first meeting with the Oncologist today. She said that it is IDC stage 2 with mets to lymph nodes, which I knew from other doctor. She then said T2 N1-2 M0. The 3rd week of July I am to have a Muga Scan to make sure my heart is working properly. Then the 4th week of July we start (if heart is ok) with Adriamycin and Cytoxan every 3 weeks x 4, Taxotere every week x 12 and if the extra test on the Her2 is ok another drug for 1 year (can't read her writing). She said radiation will start after the chemo. I told her the only way I would agree to Adriamycin is if a port was put in. So during surgery they will put one in. My poor sister finally broke down at the Oncologist office. I think I am still denying this, sometimes denial is a great place to be, hehehe. I was very upset over the fact that in 3 weeks I have gained over 30 lbs., no clue why that happened. I am not eating any more than before. So that is where we are for now. Hope everyone is doing well. Huggs Toni",
      "MessageIndex": 22,
      "PostDate": "16/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jun 17, 2008 07:46AM kinde5069 wrote: Thank you both. I love that Courage tag. You may be right Jaly, I am having a problem with swelling in my feet and legs. A nurse friend was just telling me that same thing. I still don't like adding more weight. Crap I am big enough. Well got to run, going to get my EKG and blood work done for surgery. Then after that I have to see some patients. Huggs Toni",
      "MessageIndex": 25,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jun 24, 2008 07:01AM kinde5069 wrote: First Bearbear, sorry to meet you this way.  But glad you found this site. I am very sorry for the heartache you and your family are going through. It sucks for all of us, everyone here knows just how much it sucks. When you work your way through all the angier you will see all the blesses that are there. This site and these beautiful women are a true blessing. I don't know what I would be doing with out these kind women. For me I would never have known how blessing I have with so many kind and caring people around me, with out dealing with this crap. For now it is bring my family closer together! I am not saying that I have not been angery, I have. I have also not been able to move, just sat in my pc room crying for 24 hours. But staying in these neg moods will only hurt me. I am hurt enough by the cancer, I am not going to help the blasted crap out by staying neg. So I have to be positive, for me being a smart a## and telling jokes is my positive place. So grab your bra straps, jump in and we will all go on this uninvited ride together. I know I couldn't do this one alone. Now as for me, my sister looked at the stomach sore and thinks it may be a herprin injection site. Whatever it is, the drainage has stopped. The sore in my mouth is gone, my mouth just feels raw. I was able to get an appt to see the doctor on Friday morning.  I am still sleeping alot, but not at night. I only sleep about 4 hours at a time. I am doing ok with not smoking. Got the Chantix and took my second dose a few min ago. I am not up to doing any art yet. I can't set for very long before my feet and legs start to swell. Maybe in a day or two. How you doing Jaly? I will be back later. Huggs Toni",
      "MessageIndex": 51,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jun 11, 2008 05:49PM kinde5069 wrote: Jaly, Terry and Sue Thank you. I went to do the MRI today and total lost it. Had a panic attach. I can not do small enclosed spaces. But I gave it a try. Letting people help me will be a big thing for me. Not only am I the care giver in the family, but I am an RN. So I really am a care giver. hehe Sue I pray I get back to work that fast. I know I can not be out and about with patients, but I should be able to do office work. Jaly, I feel that connection too. I am doing better now. And I have a ton of work to get done for tomorrow. Thank you everyone for your support. You guys are great!!!! Huggs Toni",
      "MessageIndex": 11,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jun 12, 2008 07:46AM kinde5069 wrote: Your right Shirlann, sometimes knowing a little can be not so good. I worked this field 15 years. It was not a good place to work back then. I know things have changed alot, so my knowledge does not count at this point. And I never worked the beginning stages. Where I was, the patients were end stage. And I am working very hard not to think about that, since things have improved so much. Most of my nursing days has been with end stage of life or Neuro. I am now doing Home Care, I got fed up with the bs of the hospitals. Sandy, I to am very sorry to meet everyone due to cancer. But I am glad to be meeting so many wonderful people. From what I have been reading you guys are great! Thank you so much. I am going to work today. My surgery is Friday, June 20th and I met with the Oncologist on Monday. I am not working Thursday next week. So I only have 4 days to get things wrapped up. I have to hire a nurse today to cover my Detroit patients. Meet with the nurse I hired to cover my Down river patients. Get all my paperwork in order. And try to remember to BREATH. The vet had to put my poor Shepherd on an antidepressant. Harley is such a mommy's boy and he has been doing double duty with standing watch over me. He won't let anyone come near me, I can't even go to the bathroom alone. So I have to give him some extra time. Lord, I am going to be late. I hope you all have a wonderful day. Huggs Toni",
      "MessageIndex": 14,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "kinde5069 wrote: Both drains popped links so I called the doctor and since I am a RN got the ok for the drains to come out. It felt so good to get rid of them. The problem is stabbing and burning pain about mid way of the left chest. It is getting worse every day.My surgery was on 6/20.  I see the Oncologist Monday (I should get my sch for chemo then) any suggestion on what works the best for this. I was thinking Neurontin for the burning. The burning pain is pretty much non stop. The stabbing pain comes and goes. And the swelling in the arm pit is bad. I tryed to go to work the other day, there for 4 hours and having my arm down that short of time it took me 2 days to get the swelling and pain under control. Please any suggestions would be of great help. Huggs Toni Believe in Magic Dx 5/30/2008, IDC, 5cm, Stage IIB, Grade 2, 3/15 nodes, mets, ER-/PR- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708574",
      "Title": "After surgery Help Please kinde5069 kinde5069"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jul 6, 2008 08:34PM kinde5069 wrote: The pain meds takes the edge off but that is about it. The doc said the swelling was Seroma and it would take care of it's self. But the pain is causing the pain. I can't use my arm even just at the pc for more than an hour and the armpit area starts to swelling, than I play the price to try and get the swelling and increase pain under control again. I sure don't want to think about them having to draw the fluid out, that makes my hair stand on end. Thanks for the advice Toni",
      "MessageIndex": 5,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708574",
      "Title": "After surgery Help Please kinde5069 kinde5069"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jul 9, 2008 05:38PM kinde5069 wrote: Thanks Binney, I will check out those sites right after this. I had the nuclear scan of the thyroid yesterday, finished it up today and the bx of the thyroid today. I DO NOT ever want another bx. In all fairest it was not as bad as the bx of the breast, but still there were some high risk. Just don't want to do that again. I was so exhausted yesterday I slept for 11 hours.  This from the girl that never sleeps more thatn 5 hours. I seen the  Oncologist Monday and she  started me on the Nuerontin for buring pain Lord does that help. Her office will call to let me know when I start chemo. She said it will be in 2 weeks. She did leave me on the Ativan since I am still having really strange dreams and occ panic attacks.She was upset that the surgery said I could return back to work, so she said any problems she will put me back on no work status.  She did tell us that there were  4 additional spots of cancer that were seen when they did the mastectomy. I could have done without hearing that. My poor sister just about came out of ther skin. It took me a couple of mins before everything worked into my head and I was about to tell my sister it is ok the breast is gone so the cancer is gone. Yesterday I woke scare to death. There was no reason to be scared but I was. On the way to the hospital I started crying, my sister asked why and all I could say was I don't know. So I took an Ativan, helped a bit but I was at the edge of crying all day. It was a consist fight to hang on to my emotions.  Today I am fine.  Now I am done with all the test, I hope. I am going into the office for a few hours tomorrow and Friday. I am setting up thing to work from home. Getting all the forms from work, arranging my office to do more than digital graphics. That way I can work at my pace. My employer has been so great, it is unbelievable. Thanks for listening and Binney I am going to check out those sites now Toni",
      "MessageIndex": 7,
      "PostDate": "09/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708574",
      "Title": "After surgery Help Please kinde5069 kinde5069"
    },
    {
      "AuthorID": "kinde5069",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67611/profile",
      "Content": "Jul 6, 2008 01:07PM kinde5069 wrote: Thank you. I figured it was nerve pain. It just seems like with the burning, the stabbing and the swelling I am not making any progress forward. Glad you are doing better. Thank you again. Toni",
      "MessageIndex": 2,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708574",
      "Title": "After surgery Help Please kinde5069 kinde5069"
    }
  ]
}