{
  "AuthorID": "kingcour",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157933/profile",
  "Posts": [
    {
      "AuthorID": "kingcour",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157933/profile",
      "Content": "Apr 16, 2013 08:39PM - edited Apr 16, 2013 08:40PM by kingcour 211!",
      "MessageIndex": 262,
      "PostDate": "16/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "kingcour",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157933/profile",
      "Content": "Aug 5, 2012 08:08AM kingcour wrote: Thank you for sharing! I was diagnosed April 25, 2012, stage IV from the beginning! I am 37 with four children. I started TCH on May 7, but just started the new Pertuzumab in place of the Carbo this week. I had mets to bone and liver. However, this week my CA 27-29 was down to 18! I am in the gym working with a trainer, eating healthier than ever, and most importantly, praying like crazy! My youngest is almost 6 months. I am determined to raise him AND to rock his babies! Keep the positives coming!",
      "MessageIndex": 5,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791556",
      "Title": "Can we start a thread of positive stories? Karen2012 nicole0714"
    },
    {
      "AuthorID": "kingcour",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157933/profile",
      "Content": "Aug 5, 2012 05:56PM kingcour wrote: So inspiring to read this JeninMichigan! Can I ask how you have changed your diet or of you do any holistic routines in addition to your current meds? So excited to read this! God bless you! Praying for continued NED!!!!",
      "MessageIndex": 8,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791556",
      "Title": "Can we start a thread of positive stories? Karen2012 nicole0714"
    },
    {
      "AuthorID": "kingcour",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157933/profile",
      "Content": "Mar 13, 2013 02:02PM kingcour wrote: I am so happy to hear this!!! I hope you get headache relief soon. I get my PET scan results tomorrow.  Say a prayer that it is all clear.",
      "MessageIndex": 25,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801747",
      "Title": "Brain MRI - Negative :-) JeninMichigan Leah_S"
    },
    {
      "AuthorID": "kingcour",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157933/profile",
      "Content": "Feb 6, 2013 07:14PM kingcour wrote: Don't let cancer steal your joy! I have four kids, and my youngest will be 1 on Valentine's Day. I was too young for a mammogram, and I found the lump while breast feeding. I was diagnosed Stage IV out of the gate, with extensive mets to bones and liver. One of my liver lesions was 7 cm...twice as big ad my breast tumor! I started chemo May 7. After I was first diagnosed, all I could think about was not being there for my kids. I will go for my last chemo treatment on March 21 because I am now all clear! I will continue on Herceptin and Pertuzumab (targeted therapies), but will be blessed to have a chemo break after 10 months. There are many treatments out there for you. Pray for your body to respond properly to the chemo, keep your head held high, an tell yourself that you will be with your baby for a LONG time. That's what I do, plus I go to the gym at least 3 times a week and try to get in all of my fruits and veggies. Every little bit helps! Praying for you!",
      "MessageIndex": 18,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800064",
      "Title": "Bad scan. Need prayers Evans1128 Cafelovr"
    }
  ]
}