{
  "AuthorID": "kishana",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157036/profile",
  "Posts": [
    {
      "AuthorID": "kishana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157036/profile",
      "Content": "Jul 23, 2012 06:56PM kishana wrote: Hi Autism Mom, Your symptoms are eerily similar to mine,including the disappearing aerola. I had a mammogram and ultrasound that came back negative. I am suspecting possible IBC. If you get a diagnosis would you please let me know. I am terribly worried about what is going on with me as well and I am now awaiting an MRI and was told it might be a month  before they even get back to me with an appointment.kishana",
      "MessageIndex": 18,
      "PostDate": "23/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790196",
      "Title": "Got a problem...how long can I wait? autism_mom Paintingmywaythru"
    },
    {
      "AuthorID": "kishana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157036/profile",
      "Content": "Jul 24, 2012 03:47AM kishana wrote: Autism mom, I have had my symptoms since about January.Usually IBC is only in one breast but if it metasisizes quickly it could go to the other breast. Wouldn't you think. I do not have a gyn but I went to the breast center at the hospital for the mammo and ultra but when they came back negative it seemed they were done with me. I went back to my GP, and he is the one who ordered the MRI. His office is extremely inefficient though. I called the office and asked if he could speed things up. I don't know if he can do anything. I live in Ontario and we have long MRI wait times. Maybe it isn't IBC but the symptoms are certainly that of. I just want to know what it is. I am sure you feel the same way, and if you are anything like me really worried. kishana",
      "MessageIndex": 22,
      "PostDate": "24/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790196",
      "Title": "Got a problem...how long can I wait? autism_mom Paintingmywaythru"
    },
    {
      "AuthorID": "kishana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157036/profile",
      "Content": "Jul 27, 2012 05:24PM kishana wrote: Autism mom, Aren't you lucky. The hospital still hasn't called me about my MRI, and it has been a week and a half since the req from the doc was supposed to have gone in. Unbelievable! kishana",
      "MessageIndex": 40,
      "PostDate": "27/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790196",
      "Title": "Got a problem...how long can I wait? autism_mom Paintingmywaythru"
    },
    {
      "AuthorID": "kishana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157036/profile",
      "Content": "Jul 24, 2012 09:00AM kishana wrote: autism mom Everything here has to be referred by a doctor, with the exception of a mammo. I was reading about cognitive restructuring this morning as a way to deal with stress but I don't think it will work for this type of situation. It is a help to talk to someone like you who is going through the same fears. kishana",
      "MessageIndex": 24,
      "PostDate": "24/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790196",
      "Title": "Got a problem...how long can I wait? autism_mom Paintingmywaythru"
    },
    {
      "AuthorID": "kishana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157036/profile",
      "Content": "Jul 25, 2012 05:41AM kishana wrote: Autism mom, I am really glad  for you that your biopsy didn't show cancer. It sounds like you are getting things looked after, and have a good team on your side. kishana",
      "MessageIndex": 28,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790196",
      "Title": "Got a problem...how long can I wait? autism_mom Paintingmywaythru"
    },
    {
      "AuthorID": "kishana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157036/profile",
      "Content": "kishana wrote: My doc said he sent the req in for an MRI, but he didn't tell me it took him two weeks.(or maybe it was his staff) I was going to give it two weeks and if the hospital hadn't called me by then with an appt I was going to call them. Then I got a nasty bacterial infection and had to deal with that for about two weeks.I then called the hospital to see about an appt and they told me they didn't have a req for me. So I called the doc's office and their records showed that they had sent it in on July 25th. I called the hospital back and they said that they still didn't have one but to have the doc's office send a second req. So I called the doc's back and gave them the fax number and they said they would send it right out. So I waited a day and called hospital back,they said they didn't have it. called doc back and they said it had been sent. GO FIGURE??? Talked again to a girl at the hospital and she said to have them send it again along with report of mammo and ultra, and ATTENTN her name. So I willl do that Mon.Can u believe this!!!kishana Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/792156",
      "Title": "This is unfathomable, and I am so mad kishana liefie"
    },
    {
      "AuthorID": "kishana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157036/profile",
      "Content": "Oct 2, 2012 04:15PM kishana wrote: amberzazz, Try not to worry. When I was much younger my doctor felt something during a breast exam. It turned out to be nothing. Also, Fibrocystic breasts feel lumpy. I wish you all the best, and will cross my fingers for you. kishana",
      "MessageIndex": 15,
      "PostDate": "02/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/794244",
      "Title": "This is me! amberzas jhuffman172003"
    },
    {
      "AuthorID": "kishana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157036/profile",
      "Content": "Sep 29, 2012 01:07AM kishana wrote: Life's tough eh. I am sorry you and your daughter aren't talking right now. She is probably scared too. I have read many posts on this site about pain/or no pain. A lot of these women have said they had pain, so don't assume anything on that basis. Is there not somewhere you can go that accepts people with a low income for a mammo? I hope things work out for you, and all the best. Kishana",
      "MessageIndex": 4,
      "PostDate": "29/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/794143",
      "Title": "Uninsured Not Diagnosed but Scared Twodigit67 Moderators"
    },
    {
      "AuthorID": "kishana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157036/profile",
      "Content": "Aug 17, 2012 01:31PM kishana wrote: mommaof3boys, What do u mean?",
      "MessageIndex": 2,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/792122",
      "Title": "Not sure if it's IBC,but what else could it be? kishana flash"
    },
    {
      "AuthorID": "kishana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157036/profile",
      "Content": "Aug 17, 2012 05:45PM kishana wrote: morningperson, I guess I am not too swift today. Thanks,kishana",
      "MessageIndex": 4,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/792122",
      "Title": "Not sure if it's IBC,but what else could it be? kishana flash"
    },
    {
      "AuthorID": "kishana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157036/profile",
      "Content": "kishana wrote: I have been having symptoms since Jan. It started as white discolouration of my breasts and real tenderness. Then a couple of months later I started seeing some pink/red marks on right breast. Then suddenly my breasts got bigger,especially the right one. Then some bruising, and change in texture,and part of the aerola seems to be disappearing. I had a mammo and ultra and came back neg but I know that don't usually detect it. I don't know what to think. What else could it be? I have been waiting a long time to get an appt for a MRI. Can anyone help? kishana Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/792122",
      "Title": "Not sure if it's IBC,but what else could it be? kishana flash"
    }
  ]
}