{
  "AuthorID": "Kiso20",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278358/profile",
  "Posts": [{
    "AuthorID": "Kiso20",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278358/profile",
    "Content": "Aug 13, 2018 11:48PM Kiso20 wrote: Agh this is the toughest part. I can't really tell you how to tell your friends and family but I can tell you how I told them. Maybe that will help? I'm 32, single with stage 1 IDC. I was officially diagnosed a month ago but I had been waiting to get a biopsy for months. When my MRI showed the mass I only told a couple of my friends. I'm a nurse and so are most of my friends so it was easy talking to them and asking for advise before my diagnosis. I didn't want to tell my family until the results came back. After I got my official diagnosis I told my mom and it was the hardest thing. My mom is in the medical field as well and her first reaction was to take me to all the oncologists she knows (she knew quiet a few of them). As annoying as that was I knew it was her way of coping and I wanted her to feel like she did everything in her power to help. She still will call me every day and tell of a new treatment she heard about or a new diet. I just listen since I know she's really scared. I let my mom tell my dad and of course they were heartbroken. I've lost my aunt to breast cancer a few years back so this is terrifying for them. I'm a very private person and only share my personal problems with very few people. After my diagnosis I would come home from work and just stay in. I stopped seeing my friends, going out and even texting anyone. After two weeks I realized that’s not healthy and I started telling one person at a time. It was the best decision I made. It feels so much better talking to people. I'm still breaking the news to some of my friends and still haven't gotten the heart to tell my sister (she's very fragile and lives far so I don't want to worry her yet). Anyway, however you tell them it's going to be tough but after you're done with it, you can move past it and start caring for yourself.",
    "MessageIndex": 4,
    "PostDate": "13/08/2018",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/866574",
    "Title": "Advice on telling family Dani444 WC3"
  }]
}