{
  "AuthorID": "kiwikid",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
  "Posts": [
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Apr 24, 2016 01:34AM kiwikid wrote: I'm also pregnant and having breast changes too. How are you getting on? As I only have one breast I have nothing to compare but it doesn't feel right. I've been on antibiotics for two weeks as I presented with redness and an ultrasound showed skin thickening. Over the two weeks I think it has worsened. It feels full of fluid under the skin and I'm seeing the orange skin if I look really closely. I started another thread which you can find by looking at my profile, but I've also found a few threads with breast changes during pregnancy that turn out to be unsolvable mysteries which disappear after baby is born. Hoping we're all in that boat. Xx kk",
      "MessageIndex": 7,
      "PostDate": "24/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/843484",
      "Title": "I just don't know what i should do! Long... Ali81"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Dec 12, 2012 02:16PM kiwikid wrote: Wow our situations are SOOO similar, but our recommendations are so different. My surgeon has told me that chemo and rads would kill the dcis on the margin, the MO can't guarantee that. I've been told I won't need radiation or an ax clearance as 3 of my 4 nodes were absolutely clear. How many nodes did they take from you? Are they talking about chemo? My ki67 was 18% and I didn't have oncotyoe, so that's where we differ, and I think my MO is more cautious due to my age he thinks aggression could be hiding. To add you details go to your profile and there's an option in there the tick it to make it public. Glad you are able to talk about it now and thanks for posting. Xx kk",
      "MessageIndex": 4,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/797553",
      "Title": "Diagnosed in September but new to the board... elleredux Moderators"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "May 11, 2013 05:19PM kiwikid wrote: I've just read through this thread and it's really interesting. chrissie you are amazing for everyone here. I have had pain in my left rib, under, ie closer to the ground when standing, where my left breast is / was. It's under my bra but seems to be worse from a tighter bra. It arrived about a month after my lumpectomy, before Christmas. I went to my gp and she ordered an ultrasound of my organs, which was all good. I mentioned it to my MO and he had a prod around and said he thought it was muscular skeletal. It seems to be symmetrical but much worse on my left side, I can only feel it on my right if I poke at it. Since my mastectomy with recon a few weeks ago, it has stuck around longer than any other pain and it is much worse than before. I mentioned it to the surgeon and he said hmmm it shouldn't hurt down there we didn't do anything there, but it could be gravity... Anyway, I've finally decided that I'm going to ask for a scan to find out what it isn't! I want to stop thinking about cancer and to get on with my life without this fear. I feel like if I can get the peace of mind that it isn't mets it will be much easier for me to move on from this horrible episode. I'm due to see the MO in a month so whatever it is can wait till then, or should i discuss it when i see the aurgeon this week for a fill? I'm shit scared but I think I won't tell my family. I mentioned it to DH and he said it was way too soon after dx for mets to show up, especially since I only had a micro met. That made me feel better for a few days. Xx kk",
      "MessageIndex": 1397,
      "PostDate": "11/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Dec 29, 2012 10:22AM kiwikid wrote: Hi everyone Well done on getting through this crazy hectic week, I've been swimming and lazing around at the beach and have just got back to the city for treatment. Hi Sophia how did you get on? I am going in about 8 hours for mine and I'm hoping your first one went well. Lets hope for micro side effects alright! I love the buzz cut for New Years idea, whoever said that, I might do it too. Xx kk",
      "MessageIndex": 725,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Dec 30, 2012 06:56PM kiwikid wrote: Volleymom that sounds awful, I don't know what you can do but ring your MO and tell them because you shouldn't have to feel that way. Dan1 welcome to the group no one wants to join. Everyone here is really kind, you should start a thread on the just diagnosed board, and lots of support and information will come your way. Day 2 today and I'm feeling ok though I needed a sleeping pill last night as I was hyper from the steroid. The worst side effects seem to be a dull headache, a sore throat, sore legs when I stand for more than ten minutes and marginal nausea. If it was a work day I wouldn't be going. I'm going to get a short haircut today. Looking forward to having the relief that I hear goes with losing the lot. Xx kk",
      "MessageIndex": 773,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 13, 2013 11:28AM kiwikid wrote: sophia, if you do meet someone in 2013, he will be very special and not just a fling, that's something to be excited about! Im also at the start of day 16, my southern hair has gone further south, mostly down the drain, and my head hair is hanging on, though I have an appt with my hairdresser, who had chemo a year ago for BC, to buzz it this morning. Not sure if I should just go anyway, it is coming out as I check it with my fingers...",
      "MessageIndex": 1064,
      "PostDate": "13/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 16, 2013 02:45AM kiwikid wrote: It seems the anxiety builds as chemo approaches. Good luck to everyone going in this week. I had a meeting with the RO today. He is recommending radiation over mx. I asked if he would do the same for his wife or daughter, he said yes, unless it was a grade 3 or a large tumour. Grade 3 being aggressive.... BUT THEN he said how surprised they were at my grade 1 being ki67 of 18% and said there are only 5% of grade ones which are aggressive like that. He said ki67 indicated likelihood of travelling, hence chemo. Anyway, I'm confused about him not recommending mx as its not aggressive, but me getting chemo as it is. Hmmm",
      "MessageIndex": 1109,
      "PostDate": "16/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 16, 2013 08:55PM kiwikid wrote: Yes Nicole I got really puffed. I thought I'd like to go for a run about day 8 last time and only made it to the end of the street, I was puffed and my legs were exhausted! I think it is to do with the cell counts, not our hearts. X",
      "MessageIndex": 1119,
      "PostDate": "16/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 17, 2013 08:20AM kiwikid wrote: Yes I have losec, I guess it's the same thing, but haven't been taking it as my stomach acid has been fine. :) The problem is actually getting the food beyond my mouth, like it seems to get stuck at the back of my mouth and activates my gag reflex, it's quite awful!",
      "MessageIndex": 1134,
      "PostDate": "17/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 21, 2013 08:38PM kiwikid wrote: Bahaha Nicole, intimate with a seal. We have seals here and they are smooth but they smell so bad, hopefully your husband has never been within 100m of a real seal, so he won't know! Thanks for your info. Yes I had a grade 1, the score was only 4, but my proliferation rate graded by ki67 was 18% which is considered int/high depending on who you ask. Tumor was only 1.8 but it had travelled, a micromet to a node .6mm. The RO said that the travelling is explained by the ki67, as low grades don't usually behave like that. So I'm not sure if Grade 1 is an accurate identification of the tumor I HAD. Yes the oncotype here is not done, but the ki67 is one of the tests done within that to make it up. Can a satellite nodule be dcis? I had that about 4cm away in the margins! Round two day two today, worst se so far SORE FEET! I'm going to get some ugly crocs to hopefully let me stand for longer. Kia kaha Kiwi kid",
      "MessageIndex": 1205,
      "PostDate": "21/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Mar 6, 2013 08:54AM kiwikid wrote: Thanks everyone It feels good but I feel terrible too, just through the wringer you know. I have had dry skin, lol snakey, and yucky mouth. Oil pulling with coconut oil has done wonders for my mouth, google it, I think I'll do it forever now. I'm going to have surgery where the surgeon goes in through my areola edge scar, removes breast tissue, cuts muscle and places a permanent silicone implant with a permanent saline expander under that. The saline amounts can be changed over time. Exciting times! Wishing you all the best weeks. Xx",
      "MessageIndex": 1542,
      "PostDate": "06/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Mar 13, 2013 07:02PM kiwikid wrote: Nicole we have a national program which gives every diagnosed woman a pack that includes an info booklet, a diary and a journal. The diary has different sections for treatment, surgery, specialist appointments etc etc. here's a link if you're interested, it's one of the best things www.breastcancer.org.nz/AboutB... Xx kk",
      "MessageIndex": 1565,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Dec 27, 2012 04:11AM kiwikid wrote: Lol gwen, that is funny! Thanks mfml. My regime is zofran once a day, motilium as needed up to 8 a day (this is a drug not allowed in USA for some reason but is a powerful antiemetic) and emend once a day for 3 days. I have also been scripted dexamethasone twice a day for 3 days. I'd like to avoid it if I can, has anyone else avoided their steroids? The side effect list is ugly to say the least! Xx kk",
      "MessageIndex": 650,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Dec 30, 2012 05:49AM kiwikid wrote: I just changed my pic via the iPad, if its the wrong way up for people on pcs then we have a cause :) I know we all love solutions too Xx kk",
      "MessageIndex": 761,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 2, 2013 11:18AM kiwikid wrote: I had a .6mm micromet in my sentinel node and I've just started 4rounds of AC. The tumor was 1.8cm and my ki67 was 18%. My MO told me it was the ki67 that pushed me into chemo. Feeling very jet lagged on day 4 ;)",
      "MessageIndex": 810,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 14, 2013 06:54PM kiwikid wrote: I'm going to go back and try to write down how I felt after my first chemo so I know what to expect next week. Didn't imagine this annoying pain as my hair falls out. Day 17, I just took the new profile pic, so it's still there but falling fast. xx",
      "MessageIndex": 1081,
      "PostDate": "14/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 17, 2013 08:13AM kiwikid wrote: Mfml, why do you or might you need rads after mx? Were margins close? Dawn, I had hiccuping, burping and a few times I had a mouthful of food and really struggled to swallow, like I thought I was going to spontaneously vomit without feeling sick, just my throat wouldn't take the food down, it was weird. It has only just stopped actually, probably my longest se. Day 19, hair follicles hurting like hell, going forthe proper shave tomorrow morning. Not looking forward to round two but it's closer to the finish line so all good. Xx kk",
      "MessageIndex": 1132,
      "PostDate": "17/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Dec 30, 2012 01:09AM kiwikid wrote: Soteria you look good to me! I'm viewing from my iPad if that's any help. Also, my onc said that my lowest immunity would be 10 to 14 days after chemo, so I'll be staying away from school kids the end of the second week! I just had my first ac this morning then went shopping with mum. The public toilets at the mall sent my nose into a spin and we had to come home, via the DVD shop. I'm feeling a bit groggy and heavy but wondering about going out to get my hair cut short, we are only in the city for the night then heading back to resume our holiday! Anyway, Sophia I'm glad you have had it better Than expected too. Xx kk",
      "MessageIndex": 747,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Dec 30, 2012 04:55AM kiwikid wrote: How long does chemo brain take to start? I feel foggy as, but still think I'm seeing you the right way up on the iPad! Take care everyone, first chemo today and I don't want to jinx it but i feel ok ATM. Xx Kk",
      "MessageIndex": 758,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 8, 2013 10:30PM kiwikid wrote: Yeah right, I think some people don't want to think about what we're going through they just want to see us smiling and faking that its all ok. I had that sneaky micromet but the surgeon told me I won't need radiation for my armpit. They took 4 nodes during surgery and found only the .6mm in the first node, so were happy that there was no more cancer in my armpit. However, I have not had my appointment with the radiation oncologist yet so he may say otherwise. My surgery reasons are more complex. My surgeon took clear margins but then did an extra shaving and right at the edge they found 4mm of adh/dcis (pathologist could not agree on what it was). The surgeon told me any other surgeon in the city would not have done that and I would not have know about it! He thinks he has got it all but I don't feel happy radiating it when there could still be cancer in there. If it came back and I needed recon after rads it would be a mess. He has offered to do a nipple sparing mx after my chemo, and says the local recurrence rate would then be 3% (as opposed to 5% if I have rads). So I think that's where I will go. I will still meet with the RO to discuss armpit rads but the surgeon thought that was out of the question. Any one else have any input about radiation to the armpit? Thanks Xxxx",
      "MessageIndex": 987,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 8, 2013 11:18PM kiwikid wrote: Peggy I hope you get it cleared up, ASAP! leeA you're a dark horse, what is this other message board? I have a conspiracy theory aunt who sends me links to big pharma videos and long things to read about chem trails, I believe she has valid points but I have told her that I do no have a choice about chemo. If I was in my 70s that might be a different story, but I'm not, and going down the rabbit hole will not help me! Sophia perhaps your aunt could bake carrots into those beetroot cookies?! MOUTH ULCERS cure here... I have always had ulcers pop up until about a year ago I found that taking lysine can prevent them. I found this while trawling the Internet for a cure that must be better than salt! Now to get lysine you have to buy a big ugly bottle of pills that says to everyone in the store \"I have cold sores\", because lysine is the amino acid which works against the herpes virus. It also works against mouth ulcers, which seem to be of elusive origin in the medical community. I take losing everyday and have had one small ulcer in the last year, and it only lasted a few days. I have always had the worst ulcers that have stopped me eating and knocked me around, probably for one week a month, so I can vouch for lysine, and it's cheap. I am taking 3grams a day at the moment and I haven't had a mouth ulcer yet, and if anyone will get one, its me! I told the onc when I listed my medication and he didn't blink, so it won't interfere with chemo as far as ai know. It's also natural and only found in food, so can't really do much harm. I really hope that helps someone. Xx kk",
      "MessageIndex": 990,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 19, 2013 11:45AM kiwikid wrote: Hi everyone, hope you are having a nice weekend! I have decide I want a mx and will ask for a bmx and see if my insurance and surgeon will do it. When I look into a future with rads all I see is black anxiety. I don't know what that means but I don't want to find out, so mx is the only way. Chemo 2 will be done in 36 hours, I'm actually looking forward to the rest! Xx kk",
      "MessageIndex": 1168,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Feb 14, 2013 04:36AM kiwikid wrote: I've really enjoyed reading the last few pages on here. Thank you all for posting and sharing your experiences. I'm quiet, day 4 of round 3, feeling crappy and sorry for myself. DH wants to get a dog this weekend, one just past the chewy puppy stage, to look after future babies, wtf!? I think he deserves a special friend and now i know we could sure use another focus in our lives. I too tried to journal but know I won't be interested in it later so decided to stop. Nicole I hope you're feeling better, I have read that any mucosal membranes struggle during chemo, that's stomach, mouth and vagina, as the cells divide and reproduce so quickly. I hope that's some consolation. DH working nights so having him here during the day has been a blessing and I can relax on my own in the evenings. It's good, we can sleep in too which is nice, I don't like waking up alone when I'm feeling bad. Wishing you all the best. Xx kk",
      "MessageIndex": 1428,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Dec 27, 2012 01:34AM kiwikid wrote: Hi everyone. I'm starting AC on Sunday, what a great way to end the year! Just wondering about steroids, what are they called and what are they for? I have a bunch of what I thought were anti nausea meds that I have to take, will one of them be a steroid? Ugh! Thanks and happy holidays Xx kk",
      "MessageIndex": 643,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 5, 2013 08:58AM kiwikid wrote: Thanks LeeA yeah the ocean is amazing. Went out to an Indian restaurant tonight, I have def got my taste buds back, yummo! Welcome vas4554 hopefully with the help of the wonderful women here you will find this time easier than you would if you we're alone. Xx kk",
      "MessageIndex": 903,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 13, 2013 02:04AM kiwikid wrote: I agree Julie, it is barbaric, but it is what it is, and at least we have a choice! It's hard to be positive all the time and usually our SO sees the side of us that we save for home, the side that can't put on the brave positive face all the time. I have a friend who tried to cheer me up in the first week after chemo by suggesting I do more and stop sitting around. I told him I was actually really happy being me till cancer came along, but he knows how active I was and associates my cancer grump with my inactivity. I can't wait to get me back, after more chemo and surgery and maybe radiation, but at the moment I'm only climbing metaphorical mountains. What makes me angry is the cancer, not people thinking I should be climbing mountains, but if I shout at them and not the cancer, its because they are there and they love me, and they can handle it, and I need them! Rant aside it's a hot muggy day in the city. We have been out for lunch and I'm feeling really good. One week till chemo 2. My hair comes out in my fingers whenever I check to see if its still there though! I hope you are all feeling as good as you can. And feel free to shout at someone who loves you when they try to help and they miss the mark by miles, they know you're really shouting at the cancer. Xx kk",
      "MessageIndex": 1051,
      "PostDate": "13/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 18, 2013 05:38AM kiwikid wrote: Thanks Dawn, I will start my losec tonight. I'm preparing for chemo now, going back in two days for round 2. My partner has had to go away for work for two weeks so I'm going to be staying with my parents. Unfortunately mum has the flu and dad has to move his mum into a rest home this weekend, and we have mums 60th birthday champagne brunch. I hope she is well by then or I won't want to go! On that, I have had two visitors this week who have only told me they were sick (one even used the word toxic) when they arrived at my house! I'd prefer people told me first and let me decide rather than decide on my behalf that they aren't catchy. Hmmm I'm comfortable saying no hugs now, but no sick visitors should really go without saying! Wishing you all well. Xx kk",
      "MessageIndex": 1151,
      "PostDate": "18/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 25, 2013 09:47AM kiwikid wrote: Thanks everyone for your posts. I'm really enjoying reading and want to reply to you all but the fog has got the better of me. Day 5 after ac 2 and after sleeping all day I I think I'm coming out of it. Much more tired than round 1 and Nicole, you describe the persistent low level sadness, which I can relate to. Last night I had nightmares about bc popping up in all of my remaining breast tissue. it was awful. I woke up to think it was a sign the mx is the right decision. I hope you are all doing ok. It's a journey that's for sure. Xx holly",
      "MessageIndex": 1250,
      "PostDate": "25/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Mar 2, 2013 08:34AM - edited Mar 2, 2013 08:35AM by kiwikid Well done everyone, we are nearly there! I have my final ac on Monday and that's it! Then ill have surgery, don't want rads, and tamoxifen... Nicole I'm sorry about your pants, but I'm glad the new ones are comfortable I haven't gained any weight since ac 3 so that's a bonus, and I wore the same pants to see my surgeon yesterday that I was wearing at my first ultrasound on November 12, so I'm quite happy, though I have gained about 6 kg since surgery, I lost 3 of that in the week prior due to anxiety. Actually I didn't do the top button up on my pants yesterday lol! May chemo be kind to everyone this week. Xx",
      "MessageIndex": 1526,
      "PostDate": "02/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Mar 5, 2013 07:06PM kiwikid wrote: Hi ladies Paula we are 18 hours ahead of you, but the easier way to work it out is 6 hours behind then add a day! I'm sorry you're not sleeping well. I take a sleeping pill during the first few nights after chemo to balance out the steroids then I go back to melatonin after about 5 days. Melatonin does the trick usually. It's day 3 today, I've thrown the emend box in the trash for good, I'm so glad chemo is over, now to start feeling well enough to do things. We are going to a medical counselling appointment this morning to make the final decision about surgery or radiation. It's nice to be moving into the next phase. I hope you are all well. Xx Holly",
      "MessageIndex": 1535,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Apr 26, 2016 02:07PM kiwikid wrote: How are you feeling about it now? I hope you're relaxing and preparing for baby? I'm not seeing any improvement either and I'm really hoping this is a pregnancy thing for both of us Xx kk",
      "MessageIndex": 6,
      "PostDate": "26/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/842462",
      "Title": "Pregnant with IBC symptoms B126 B126"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Dec 27, 2012 10:26PM kiwikid wrote: Hi everyone Is anyone else starting on 30th? Sophia? Because we are a day ahead I guess it's the 29th in the rest of the world. As the day gets nearer I find I am grumpier and snappier and my sleep is broken. I guess that once I start treatment I'll start to feel better, like I'm actually doing something to improve my odds, but in the meantime the wait is no fun. Thanks everyone for sharing your stories, it is so helpful to read through the posts and know that I'm not alone. I wish everyone the best for their treatments this week. Xx kk",
      "MessageIndex": 683,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 5, 2013 05:28AM kiwikid wrote: Sophiafred I love your description of your dream. The thoughts we have about our breasts now will never be the same and that feeds into our subconscious. Mum asked me how I felt yesterday, I listed... Pissed off, ripped off, tired, grumpy, sore, angry, left out... Etc etc. today after a walk on the beach and a swim in the ocean I felt a lot better, and a bit of sunburn on my legs will be upping my vitamin d.... Does anyone hurt, like, it hurts my back and neck when people touch me. It feel like muscle pain but I haven't exercised, wondering if it's 'normal'. It's day 7 now and I got cabin fever after my swim and ventured into town and met a friend for a coffee, I also wanted to scope out a barber in this holiday town as I know the shave is merely days away... I think I'm past the worst of the side effects and the view of the ocean and sound of the surf just meters from my bed is pure heaven. I hope you are all having lovely days. Xx kk",
      "MessageIndex": 895,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 7, 2013 09:11PM - edited Jan 7, 2013 09:15PM by kiwikid Hi ladies Day ten here, about to watch a movie... A friend lent me her collection and yesterday I watched When Harry Met Sally for the first time, and started on the box set of murder she wrote... I think I'll watch a box set of rom coms then start on mad men season 4. When I get home I'll be able to access films on demand via Apple TV, until then I'm stuck with this pile... Slept for 11 hours last night, bf and parents have gone for a couple of days so it's just me at the beach house for a couple of nights, bliss! Lol Sophia about your cats, ours is in the cattery and he is going to be super grumpy when we pick him up after 3 weeks, I don't think he'll feel like vacuuming either! My hair has not started to fall out yet Hooray What is the neulasta thing you are all talking about? We don't have that here in New Zealand, it doesn't sound like we're missing much, it sounds awful. Happy relaxing Xx kk",
      "MessageIndex": 952,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 8, 2013 10:00PM kiwikid wrote: Sophia you crack me up. It's the same here, people say the dumbest stuff, like, last time I saw so and so he was having chemo and it really took it out of him, he died just before Christmas blah blah blah. Or this one from my uncle... uncle sam and chris (both dead now) used to go to chemo together and they had the best time! I'm actually rude about it now when I see it coming, I say, \"I'm sorry but I don't want to hear a story about another person who went through something awful, my situation is enough for me at the moment, thanks\". That usually shuts them up. I'm also quite big on the response I have generated to \"poor old so and so is in hospital with whatever\". My response is something like, \"at twice my age I'd be happy to be in hospital for that, old people should complain less about being old, they're bloody lucky to have lived so long\". That also usually shuts people up. Ok, gripe over. Memoirs of a geisha was yesterday's DVD and it was depressing, the book was much better. Friend gwen I'm thinking ill have more surgery, partly to avoid radiation, but I'm not like your brother in law! If I had no choice I would definitely do it. Xx kk",
      "MessageIndex": 985,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 8, 2013 11:58PM kiwikid wrote: Lol, breastcancer makes breakups look easy! Yes Sophia, lumpectomy... They took the size of a peach to remove a tumor the size of a grape, so now my lopsided breasts are even! The incision was across the nipple in a circle so the scar has blended in nicely. I'm happy cosmetically but looking good wont keep me alive! adh is pre dcis, and the surgeon said about 50% of adh will develop into dcis. Not knowing if it was dcis or adh is inconsequential really, it's abnormal cells and I want them all gone! Since it was right at the margin the surgeon said he thinks its all gone but I am the one who wakes up with the fear or recurrence every day, not him! Not one woman I've spoken to think I'm unwise to go for the mastectomy and recon. Men seem to think differently, but that's just their caveman speaking. No breasts, no hair, no babies, I suppose I better get used to it! How's your hair Sophia? Mine is still hanging in there, today is day 11 counting chemo as day 1. Xx",
      "MessageIndex": 994,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 9, 2013 12:19AM kiwikid wrote: If its any consolation my MO told me that after two years on tamoxifen a break to have a baby has the same benefits as being on the drug, so I guess there is some hope down the track for us er youngsters. I had not yet wanted children but I was not ready to have that choice ripped away from me either. Sneaky shitty cancer. My scalp is scratchy too! Have your cats fund the vacuum yet? Xx",
      "MessageIndex": 996,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 21, 2013 05:42AM kiwikid wrote: LeeA yes, sore patches! Yes everyone work and school. I'm a teacher so can I say I do both!? I'm planning a week off after each one but my boss has been great and given me only morning classes till April, so if I can go I will. But school is still out for summer this week so I can relax in peace. AC number two today. They put it in my hand and it popped the vein and my hand got all fat full of saline that was leaking out of the vein. Aargh! I looked at the people with ports and felt a bit jealous, but not for long, the ports are awful too. She went in the side of my wrist and it was fine. Nicole I see your path was similar to mine, did you get ki67 tested? I'm booked in for a second opinion with a more aggressive oncologist so I may soon be adding a T to my signature. Kia kaha warrior wahines (stay strong warrior women) Xx",
      "MessageIndex": 1200,
      "PostDate": "21/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 23, 2013 05:40PM kiwikid wrote: Grannyj3 I hope you feel better soon. Scaryola, I too woke in the night with palpitations. Did not attribute it to steroids but I hope that's what it was. Im also having dexamethasone! I'm on Day 4 of round two. What chemo are you having? My MO told me I wouldn't have scans as its so unlikely the cancer had spread, I can't remember if I read that scans can be bad for us and actually cause little mets? Anyway, he said they wouldn't bother scanning without symptoms and I'm happy with that. Hope everyone is going ok, I'm stuck in the jet lag hangover stage. Stay strong holly",
      "MessageIndex": 1228,
      "PostDate": "23/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jan 27, 2013 05:00AM kiwikid wrote: Hi everyone I'm on day 7 after AC number 2 and my boobs are feeling sore and heavy, especially the one which was mutilated in nov. I'm wondering if anyone else has experienced this? I did have a period between Christmas and New Years so it could be hormonal but it's quite disconcerting. I was able to sleep on my stomach a few weeks ago and the last couple of nights I've been aware of this just sleeping on my side. I had a dream the bc was coming back all through both breasts, what a misery! I am generally feeling aches from the ac but just wondering if anyone else has anything they can add? Thanks Xx kk",
      "MessageIndex": 1275,
      "PostDate": "27/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Mar 6, 2013 07:18PM kiwikid wrote: Hi Nicole I'm only having to wait 5 weeks till my surgery, I guess because it is relatively simple, only one small incision and no moving around other tissue. What kind of recon are you having? Thanks for the congrats, I'm looking forward to emerging from this journey for spring time, around September, as a new flower :) Xx holly",
      "MessageIndex": 1544,
      "PostDate": "06/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Apr 24, 2016 02:41AM kiwikid wrote: Hi How is the steroid cream working? I replied to you on my very similar 'pregnant and symptoms' type thread. I've started 1% hydrocortisone today after two weeks of antibiotics which I should've just thrown in the trash! Xx kk",
      "MessageIndex": 4,
      "PostDate": "24/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/842462",
      "Title": "Pregnant with IBC symptoms B126 B126"
    },
    {
      "AuthorID": "kiwikid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164574/profile",
      "Content": "Jun 24, 2016 10:57PM kiwikid wrote: hey just checking in, you've probably had baby by now, how is everything especially the boob? I'm 27 weeks now and mines not changed much in the past month, except slightly more swollen. Would love an update and hoping that you're well Xx kk",
      "MessageIndex": 8,
      "PostDate": "24/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/842462",
      "Title": "Pregnant with IBC symptoms B126 B126"
    }
  ]
}