{
  "AuthorID": "KiwiDiana",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41861/profile",
  "Posts": [
    {
      "AuthorID": "KiwiDiana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41861/profile",
      "Content": "KiwiDiana wrote: This Post was deleted by KiwiDiana. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/780133",
      "Title": "February 2012 Rad Sisters KiwiDiana KiwiDiana"
    },
    {
      "AuthorID": "KiwiDiana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41861/profile",
      "Content": "Dec 23, 2011 01:08PM - edited Dec 23, 2011 01:14PM by KiwiDiana Hi to all my fellow cancer fighters!  I had a Wide Local Excision last Monday (19th) with SNB.  The 9mm lump was at  6 o'clock. Surgeon removed 1/4 of my breast tissue, including skin below my nipple, ( stretch marks all gone!) so now my lefty matches my righty in volume! (She had DCIS 2006/7) 10 metal staples in armpit, 10 metal staples in breast. Breast swollen and a rainbow of colours: yellow, purple, green and a nice turquoise patch from the Patent dye. My armpit is paining me, my breast not.  Moved a little too fast yesterday and hope I didn't do any damage, cos my boob hurt for ages! :( When I had the hookwire for the DCIS in my righty with a small excision, with underskin-stitiching. I was up and about and fine the next day.  it was the  third and last op, being a quadrantectomy which knocked me back, developing into a haematoma, though still had underskin stitching in the same site as the other two.  No haemotoma seems to be developing this time though! yay! Histology report is in my signature, plus there was miles of clear margins except for 5mm at the back, because lump was close to chest wall. Start radiation therapy beginning of February.   Chemo would only give me 1% more of a 10 year survival prediction, (1% of 120 months is 1.2 months/5 weeks?) so not need to go down that road.  My \"Bucket List\" has me looking for an automatic Mazda Miata!  I'll be 'zoom zoom' zooming around my home town!  And hope to be playing tennis again by end of March. Life is good! Happpy Holidays Everyone!",
      "MessageIndex": 10,
      "PostDate": "23/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/779745",
      "Title": "Wheres your lumpectomy Site and how was recovery? mommy23kids mommy23kids"
    },
    {
      "AuthorID": "KiwiDiana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41861/profile",
      "Content": "Jan 4, 2012 08:36PM KiwiDiana wrote: Hello girls,  I had a large lumpectomy, with 2 sentinel nodes removed on 19 Dec. The only bra I can wear irritates my SNB site, so as I have lots of old-fashioned soft cotton handkerchiefs, they are doing duty as my arm-pit protector.  I fold them into triangles, so they will have 'give', line them up under my arm and tuck them into my bra to hold them - Instant relief! I haven't tried to shave my pits yet, but they are needing it now.  The SNB scar is below the 'hairline', so I'll give it a go this morning.  I've only ever nicked myself when I first began shaving, 40 odd years ago. Once was enough! There is also hair-removal creme? My get-well cards and flowers have stopped too. I too am getting used to the 'new body' I've got, including all the  things I will have to think of for the rest of my life. Initally having the cancer is not a problem, it's what they do to you to get it out which causes the suffering :( Big Hugs to you Lyn. Diana",
      "MessageIndex": 13,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/780431",
      "Title": "processing what just happened lynliz mebmarj"
    },
    {
      "AuthorID": "KiwiDiana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41861/profile",
      "Content": "Jan 8, 2012 08:46PM KiwiDiana wrote: Good Luck Kelley!    Wishing you the best of luck and gentle cyber hugs from Down Under. ",
      "MessageIndex": 6,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/780333",
      "Title": "Breast Pain Kelley33 JanetM"
    },
    {
      "AuthorID": "KiwiDiana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41861/profile",
      "Content": "Jan 8, 2012 07:00AM - edited Jan 8, 2012 07:01AM by KiwiDiana The Mammogram Office Breast Nurse called around with the results.  Patients receive the news at their own home in this small town.  The local hospital has a surgeon and I saw him at the hospital to arrange the date for surgery.",
      "MessageIndex": 111,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780533",
      "Title": "How did you hear biopsy results--phone or appt? frazzledmom schoolmom"
    },
    {
      "AuthorID": "KiwiDiana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41861/profile",
      "Content": "Jan 15, 2012 11:33AM KiwiDiana wrote: I had rads for high grade DCIS on my right side, and 5 years later I'm going to have it again for low grade IDC on my left side.  My righty doesn't put on weight, and indeed, seems to have shrunk a little, (atrophied) which is a side effect not spoken about much. I've also been warned about the risk of  brittle ribs which will only get more brittle in the coming years.   I will have a brittle chest after this. :( But so far so good on the right side, cancer free after 5 years!  and no sore ribs. Am sad about the left side letting me down. But I've decided that this risk is the only side effect I will tolerate from cancer treatment..  I AIN\"T doing the hormone therapy thing!  No way! Kaara,   I don't understand something:  if the original biopsy diagnosed DCIS Low grade, why did they have to remove a lymph node?  Big hugs from down under.",
      "MessageIndex": 10,
      "PostDate": "15/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/781063",
      "Title": "Radiation Therapy for early stage Kaara mimikitty"
    }
  ]
}