{
  "AuthorID": "KiwiCatMom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
  "Posts": [
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Oct 4, 2015 12:57AM KiwiCatMom wrote: Ok...I'm not fond of puketober either, but here in NZ, it's not as overdone as it is in the US and there is still a need for education about mammograms, etc., especially among the Pacifica population. And they are doing some positive \"pink\" things - like donating funds raised directly to Stage IV research and/or support. I had forgotten how over the top it is in the US; this thread has made me laugh and almost cry and shake my head in disbelief. :) So thanks! And I appreciate the links of where to find out where your money is going; will pass those on to friends on Facebook. One of the pet rescue places has a pic of dogs with pink balloon \"boobs\". I almost gagged. But then I saw what they wrote below: October is breast cancer awareness month. We support this awareness for women as well as our pets! Mammary tumors in dogs are malignant 50% of the time and 80% in cats. Spaying by four to five months will decrease the chance of mammary cancer by 98%. So maybe we can use pink to help our pets! Hugs to all, Terre",
      "MessageIndex": 118,
      "PostDate": "04/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823831",
      "Title": "First Puketober sitings! surfdreams sas-schatzi"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Oct 16, 2015 04:21PM KiwiCatMom wrote: This is a good post. Hopefully the link works! https://www.facebook.com/photo.php?fbid=1049237498444417&set=a.302849413083233.77066.100000745292377&type=3&theater",
      "MessageIndex": 128,
      "PostDate": "16/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823831",
      "Title": "First Puketober sitings! surfdreams sas-schatzi"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jun 28, 2014 03:21AM KiwiCatMom wrote: Welcome to the thread, Judy.  Sorry you're here but glad you found us.  Sending hugs your way. Terre",
      "MessageIndex": 24,
      "PostDate": "28/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/821908",
      "Title": "New to stage IV...feels like I was hit with a one, two punch. Jaytee RonnieKay"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Sep 22, 2015 01:27AM KiwiCatMom wrote: Hooray! Erbu and Skylotus both back! I've missed you ladies. Erbu - you are stunning. And I love the blue hair. Sorry you had to give up driving but glad your pain is under control. Terre",
      "MessageIndex": 44,
      "PostDate": "22/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/835096",
      "Title": "Ebru is back \\ o / :))))) stagefree stagefree"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Apr 20, 2013 01:30AM KiwiCatMom wrote: I guess that makes me 238!  I haven't been on for a bit; still coming to terms with this all.  Diagnosed with bone mets (hip, femur, rib, T11 spine).  Had radiation treatments (1 hip/femur, 5 spine), am on Zolodex, Zometa, and Femara.  I had a pin put in from my hip to my knee as my femur was ready to shatter.  Just got approval to go to zero crutches part-time (use one part-time).  I'm still a bit emotionally fragile, but I'm sure being tossed into instant menopause isn't helping that aspect. Mostly positive with moments of sheer terror and abject depression.  The good news with menopause is that it's coming onto winter in New Zealand, so the hot flashes are a bonus! Thanks for doing this Ms M! ",
      "MessageIndex": 304,
      "PostDate": "20/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jul 25, 2013 07:54PM KiwiCatMom wrote: I was diagnosed in February, after being told 6 years ago that I had a less than 5% chance of recurrence.  So it was shock and awe and abject terror.  I'm an American, but I've lived in New Zealand for 5 years so that was a bit scary too - navigating the medical system here - and it added to my anxiety.  But what everyone here has said is (in my limited experience) completely correct.  You can choose to live the rest of your life in fear, waiting to die, or you can find ways to manage the fear.  I had a friend advise me to ask myself \"am I ok right now?\" when the fear threatens to overwhelm me.  And living in the moment is great, but for me, much easier said than done.  The two other things that helped me were a friend who told me her mother in law had just died.  I expressed sympathy and the friend said, \"well, she's been planning to die for 10 years, ever since she was diagnosed with cancer.\"  The friend went on to say how said it was that the mother in law had let fear and negativity and waiting to die rule the way she lived - and she lived for 10 years that way!  I decided that wasn't how I wanted to spend my time.  The other thing that happened may sound cold and nasty, but it wasn't.  The counsellor we see asked my husband how he felt about my having cancer and he said, \"at the risk of sounding cold, shit happens, and you just need to deal with it and get on with things and not buy into the statistics.\"  I'm still scared sometimes and have depression, anxiety, tears, etc., but I have more good times than bad and this challenge is teaching me to really appreciate the things I do have. All the best to you and your wife - you're in my thoughts and prayers. Terre",
      "MessageIndex": 7,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/808180",
      "Title": "Anxiety and fear MikeJohn KiwiCatMom"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jun 28, 2014 05:20AM KiwiCatMom wrote: Soar with the angels, Teri.   Thanks for investigating and sorting this out Caryn.",
      "MessageIndex": 33,
      "PostDate": "28/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822310",
      "Title": "A disturbing mystery exbrnxgrl KiwiCatMom"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jun 7, 2015 01:21AM KiwiCatMom wrote: I've shared it on facebook with my friends and with all the groups I'm in. And shared it with my coworkers. And on my LinkedIn page. I said \"everyone asks if they can do something for me\" and I usually say \"no\". But now I'm asking for help - for all of us Stage IV people - please watch and share this and push for a cure. It is absolutely the best video I've ever seen on this topic and so reflects the reality of the disease. Thank you a million times over for doing it, Holley! And the link to it on YouTube is: https://www.youtube.com/watch?v=-mztliwYyLs  ",
      "MessageIndex": 11,
      "PostDate": "07/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832375",
      "Title": "Powerful mbc Video by Holley Rothell Kitchen DivineMrsM RonnieKay"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Oct 26, 2014 04:05PM KiwiCatMom wrote: I went through similar with rads to lower spine...nausea, vomiting, etc.  Wasn't fun, but pretty much better within a week after finishing.  I was tired for about a month or two, which I guess is normal.  But hearing that the cancer in my spine is inactive and necrotic made it worthwhile for me.  Hope you feel better soon! Hugs to all, Terre",
      "MessageIndex": 25,
      "PostDate": "26/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825343",
      "Title": "Radiation on Spine Iamstronger KiwiCatMom"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Feb 6, 2014 10:13PM KiwiCatMom wrote: So happy to have found this page!  I've been told I don't treat my BC seriously enough.  But I live my life by something I saw on a fridge magnet (seriously!) that said \"if you can laugh at it, you can live with it.\"  And it's my way of coping.  And I've always had a rather sarcastic sense of humour.  My friend Stacey had rectal cancer.  She's a health physicist, specialising in radiation.  When she asked the tech about the dose and he told her, she said, \"That's a butt full of radiation!\"  We were considering writing a book about our cancer journey.  She wanted to call it \"Every journey is your own\", I wanted to subtitle it \"tits and ass\".  :)  (hope that's not too offensive to anyone).   My oncologist has a great sense of humour too.  The original oncologist (David) told me to plan for hospice and that I'd have maybe 2 or 3 years.  The new one says he thinks 10 to 15 is a reasonable expectation.  When I saw him before Christmas and my scans were good, he said, \"Do me a favour.  Send David a Christmas card every year and tell him 'I'm still here!'\"   I was talking to 3 friends and they were wondering how I was, etc., and we were discussing cancer.  And one said, \"It's everywhere...do you know that one in four of us is likely going to die of cancer?\"  And I said, \"well, I guess that would be me - so glad I can take one for the team!\"  The person who said it was a bit embarassed, but we all cracked up laughing. Keep smiling everyone!",
      "MessageIndex": 162,
      "PostDate": "06/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jun 20, 2014 08:29AM KiwiCatMom wrote: Ok, this has long been one of my all time favourite comedy routines. My mother, grandmother, and great-grandmother were librarians.  The two most frequently used sentences at our house were: look it up in the dictionary, and look it up in the thesaurus.  Closely followed by look it up in the encyclopedia and look it up in the card catalog.  So I am a bit of a thesaurus junkie.  I think I want this played at my memorial service.  Hope it gives you a grin. http://www.yourememberthat.com/media/10197/Johnny_... Hugs to all Terre",
      "MessageIndex": 289,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jan 27, 2016 11:17PM KiwiCatMom wrote: haven't participated but am following the research",
      "MessageIndex": 1,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/840687",
      "Title": "copper depletion to prevent BC ANY INFO? ANYONE TRIED THIS? Hopefulr 4everStrong"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jun 21, 2014 12:11AM KiwiCatMom wrote: Nel - my husband alternated between ignoring me, looking at me like I'd lost the plot and glaring.  I saw it years ago and it stuck with me due to the thesaurus connection.  Glad it made you laugh.   It is hard to lose our sisters here and the pain is real although we've never met.  And some days, it's just too hard to be here.  But the support keeps me coming back.  And the hope that I get from the people here makes it worthwhile. All we can do is take it one day at a time.  I wrote an article that was in the newspaper here and the line they picked up on was \"I look death in the face every day and laugh\".  If I didn't laugh, I'd go stark raving mad - it's my coping mechanism.  So coming to this particular part of the discussion board and seeing that there are others who share my sometimes warped sense of humour really helps! Hugs to all, Terre",
      "MessageIndex": 292,
      "PostDate": "21/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jun 28, 2014 11:27AM KiwiCatMom wrote: Love both of your recent posts Surfdreams.  Hot flash indeed. My friend Stacey had rectal cancer.  She got radiation for it.  When the tech told her how much, she said, \"wow!  That's a butt load of radiation!\"  I may have to steal your box picture and send it to her!",
      "MessageIndex": 301,
      "PostDate": "28/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "May 25, 2014 02:50AM KiwiCatMom wrote: Hi all.  Decided to quit lurking and participate a bit in this thread.  Kite - so sorry you're in hospital.  SusaninSF - so well stated.   I think a lot of it boils down to people a) not knowing what to say, b) people being uncomfortable because they don't know what to say, and c) people not being willing to discuss death.   One of the most inappropriate, but in the end funny, comments made was when I was discussing my cancer with two coworkers.  One of them said, \"Well, statistics say that one out of every three people die of cancer.\" Then he clamped his mouth shut as he realised what he had just said.  He and the other guy looked at me and I said, \"well, I guess that's me so you guys are off the hook!\" And we did all laugh.  He said it meaning to be comforting, so I didn't take offense. As to other things - most of them have already been posted.  I will admit to laughing out loud at some of them because the comments are just so outrageous (colonoscopy next week comes to mind...) and almost tearing up at others because people are insensitive to the point of being mean.   Worst thing said to me was just after diagnosis.  I'm from the US but live in New Zealand.  One of my US friends said \"well, I'd better come visit soon as I've always wanted to see New Zealand and I won't have a free place to stay much longer\" (because I'll be dead).  It's her universe but we're welcome to share a small insignificant portion of it. :) Take care and hugs to all, Terre",
      "MessageIndex": 989,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jun 28, 2014 11:47AM KiwiCatMom wrote: What a great read this thread is.  I've really enjoyed reading the various opinions.  I concur that people should be allowed (and not judged) for telling what they want to tell.  But I also agree that I'm a bit tired of the three B's - brave, battling, and beautiful celebs dumbing things down and making this out to be an easy disease.  Get diagnosed early, go through a brief \"battle\" and go on to be glamorous and lead a long successfulyl happy life.  Sure wish it did work that way!  I loved the blog post you shared Mrs.M...will be putting that on my Facebook page.   Thanks for starting the thread!",
      "MessageIndex": 43,
      "PostDate": "28/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822255",
      "Title": "Joan Lunden \"Battling\" breast cancer DivineMrsM Annette_U"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jul 3, 2014 05:43AM KiwiCatMom wrote: Just read some of the comments on the People magazine article.  The level of ignorance is staggering, and not just about BC.  I don't know that anyone, celeb or not, could get through to some of these people. I'm stunned about your boss, softness, but something I seem to see a lot is denial.  People see us going through this and want to come up with \"excuses\" as to why it couldn't happen to them.  I think that's where some of the comments on the People article come from; i.e., they rationalise that if Joan did something \"stupid\" then that's why she got cancer..and since I'm not \"stupid\", I won't get it. I have friends who refuse to get mammograms because they \"don't want to know\" or other various reason.   Lintrollerderby - I have Nitro, a flame point himalayan (amongst others) and lots of black clothes so we should have stock in lint roller companies.  The baby in my pic is Frida (due to the moustache (Frida Kahlo reference here).  We also have Turbo the tabby, Romeo the fluffy tabby, GC (gray cat), and her fat little sister Lucypurr (black kitty).  It's cat hair haven. I had a golden retriever years ago - lovely dogs.  Lots of hair. :)  GC tripped me in the kitchen and I strained my hip, which got me to the doctor and got my cancer diagnosed.  Nitro and Turbo hung with me after my surgery to have the pin put in my leg.  And Frida keeps me laughin.",
      "MessageIndex": 76,
      "PostDate": "03/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822255",
      "Title": "Joan Lunden \"Battling\" breast cancer DivineMrsM Annette_U"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jun 20, 2014 04:26AM KiwiCatMom wrote: Thanks for the post!  amazing stories.",
      "MessageIndex": 4,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822070",
      "Title": "Pinterest and metastatic breast cancer DivineMrsM exbrnxgrl"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jun 29, 2014 12:26AM KiwiCatMom wrote: Lintrollerderby - I lover your \"name\" -with six cats, that should be my name! :)  Loved your post as well.   I agree that no one has the obligation to educate about BC, it's a personal choice.  But using it as a self-serving publicity stunt is a rather galling.  Love the sex tape comparison; quite true.  Back in the \"old days\", breast cancer was a career killer for women, now it's almost an obligatory badge of courage.  And as Wrenn said, it's a long way away from my reality. Mrs M - I reposted the blog post you shared onto Facebook. It's been shared 40 times so far - in under 24 hours.   At the risk of being intrusive with others, I think it's worth all of us posting on other social media.  Most of the people sharing it from my FB page are asking their friends to share and saying \"We need to get research and attention for this\".   Totally off-topic, but funny and hopefully will make you smile:  When I was going for permanent residency in New Zealand, I got a call from Immigration asking for \"evidence\" that my husband and I are actually married.  I asked what \"evidence\" was required, and she told me I needed something that proved we have a bona fide marriage. She was quite stern and insisted that we must have photos of us together or something showing us being affectionate with one another. I said, \"like what? our sex tapes?\"  She cracked up laughing (which was my goal) and lightened up a lot, agreeing that I could write a letter about our life together.  And I got my permanent residency. For the record, we have no sex tapes.  But I do have BC, so perhaps that gives me celebrity status?  I reckon that if I have to have BC, at least I should look as good as Angelina Jolie!  (I'm being sarcastic here).  I wish Joan Lunden all the best; this isn't fun no matter what stage you're in.  Since she apparently agreed to have Dr Gupta share info about her BC (triple negative, etc.) I thought perhaps I could reach out to her and thank her for at least allowing some detail to get out?  Maybe some positive reinforcement along with asking her to not forget her Stage IV sisters would be worth doing?  So, I'm doing it and I'll let you know how I go. :)",
      "MessageIndex": 51,
      "PostDate": "29/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822255",
      "Title": "Joan Lunden \"Battling\" breast cancer DivineMrsM Annette_U"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jun 29, 2014 12:49AM KiwiCatMom wrote: Well said, Brandi! Sorry to hear of your diagnosis; that sucks!  I get the same questions and also have taken it on as my personal mission to educate people.  But it's a very personal decision for each of us to make for ourselves. I had \"early detection\" (Stage I, no lymph node involvement, low Oncotype score, etc.).  And six years later, Stage VI.  So, the early detection probably bought me six years of feeling cancer free, which is a bonus.  And I concur that if the pink ribbon stuff gets at least one person to have a lump investigated, then it's worth it.  I do remember in the 1980s, BC was something no one talked about. Now it's out in the open, so that's a good thing.  The next step is to get people talking about Stage IV BC - let's not take 30 years to do it!   ",
      "MessageIndex": 53,
      "PostDate": "29/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822255",
      "Title": "Joan Lunden \"Battling\" breast cancer DivineMrsM Annette_U"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jan 26, 2014 03:53AM KiwiCatMom wrote: Very sorry for the loss of Jen.  Heart goes out to friends and family.",
      "MessageIndex": 29,
      "PostDate": "26/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817298",
      "Title": "Sweetangel/Jen is now a true angel. 3littlegirls Leah_S"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jan 18, 2015 09:39AM KiwiCatMom wrote: Catastrophic longevity. Good grief. Sounds like insurance! So grateful for free health care here. One less battle to fight. Good luck!",
      "MessageIndex": 324,
      "PostDate": "18/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Feb 15, 2015 01:55AM KiwiCatMom wrote: So very sorry to lose Diana. Deepest condolences to you and her family.",
      "MessageIndex": 36,
      "PostDate": "15/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828448",
      "Title": "Heartbreaking News - Diana Payne solange49 dlb823"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Aug 2, 2014 11:42AM KiwiCatMom wrote: Love the responses above and concur with donate to rabbit rescue rumour, trust fund, letting her know the SIL will get nothing, so no need to worry, etc.  However, immature being that I am, this is my contribution  - sending her a virtual flying bitch slap.  Sorry you're going through this. I had a similar experience when my mother passed with my step-father and his family stealing things out of the house and raiding my trust fund, etc.  Some people are just despicable irritating jerks, and it sounds like she fits the category.",
      "MessageIndex": 35,
      "PostDate": "02/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822952",
      "Title": "I'm FUMING!!!!! springwatch Moderators"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Oct 25, 2014 11:37PM KiwiCatMom wrote: This thread has been mighty quiet lately.  However, I absolutely have to share this somewhere and this seems like the best place.  My mother and I had a running joke about Hello Kitty, so I'm quite fond of Hello Kitty as it reminds me of laughing with Mom.  I am also a HUGE Douglas Adams fan (Hitchhiker's Guide to the Galaxy and so on...).  Someone posted this on their facebook page and I instantly fell in love with it.  Made me laugh out loud.  Of course, given my diagnosis, no one else will laugh at it with me.  At any rate, I may have changed my  mind on not having some form of headstone somewhere. ",
      "MessageIndex": 307,
      "PostDate": "25/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jun 18, 2014 10:50AM KiwiCatMom wrote: Hi all, Haven't been to this board for a bit; lots of work and business travel have kept me somewhat quiet.  I love love love Hyperbole and a Half's blog.  I hadn't seen the pain chart one before  My favourite one is her blog about moving with her dogs.  When I need a good laugh, I go back and re-read it.  It's beyond funny.  She also has one on depression that is the best description of depression I've ever read.  Not funny perhaps, but a good read nonetheless. Cami - love RESPECT and your camera crew!  Thanks for making me laugh! Was reading a page of quotes with dark humour and loved this one: Only two things in life are certain, death and that twinkies will out last you. - Mark Franklin",
      "MessageIndex": 281,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Jun 21, 2014 09:23AM KiwiCatMom wrote: Brendatrue - Love that Buffett line too and so true for me! SophieJean - LOL!  Moss Muffins indeed.  I hope to grow mushrooms myself. :)",
      "MessageIndex": 295,
      "PostDate": "21/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Nov 1, 2014 10:02AM KiwiCatMom wrote: Nel - too funny, and not funny all at the same time.  Surf - don't \"fix\" your filter. Nothing wrong with it.   I think we need to take a page from Richard Feynman's book:  \"What do you care what other people think?\"  You can listen of YouTube.  He was a brilliant physicist with a wonderful sense of humour.  He was dealing with cancer when he wrote the book. So I've kind of subscribed to his philosophy - what do I care what other people think?  When someone \"knows\" what I'm thinking, they're usually about 100% wrong. :)     http://www.youtube.com/watch?v=HmbTbtWoWwY Glad you liked the Hello Kitty / Douglas Adams headstone.  When I've mentioned it to others, they just squirm.  Pre-Stage IV dx, they would have laughed, but now it just makes them squirm. My husband finally said what he wants on his headstone:  \"The End\".",
      "MessageIndex": 314,
      "PostDate": "01/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "Feb 6, 2014 08:35PM KiwiCatMom wrote: Someone sent me something today - a sign that said, \"I need to ask people 'how stupid can you be' because they keep taking me up on it.\"  Sounds like this lady was having one of those \"take me up on it moments.\"  This woman was insensitive, ignorant, and a jerk.  Definitely call the doctor's office and let them know.  ",
      "MessageIndex": 17,
      "PostDate": "06/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817744",
      "Title": "Can't believe what someone said at Dr's office reader123 LuAnnH"
    },
    {
      "AuthorID": "KiwiCatMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170884/profile",
      "Content": "May 23, 2017 06:13AM KiwiCatMom wrote: Heartbroken. Beyond sad to say goodbye to such an amazing woman.",
      "MessageIndex": 18,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/855169",
      "Title": "Tribute to LovesMaltese (Carol) dlb823 annieoakley"
    }
  ]
}