{
  "AuthorID": "kjam",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240672/profile",
  "Posts": [
    {
      "AuthorID": "kjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240672/profile",
      "Content": "Oct 17, 2016 01:29PM kjam wrote: So sorry that you are having to deal with this during a time that is supposed to be full of joy and happiness.   I'm not a doctor, but my understanding is that the decision to biopsy is based on the results of the mammo (and ultrasound if applicable).   A biopsy is typically only done when these tests reveal certain malignant features on the lump or lesion.  Perhaps the malignant markers didn't show up at the time during the preliminary tests, so it wasn't a suspected malignancy?   I agree with Moderators - sounds like you need to have a conversation with the doctors.",
      "MessageIndex": 4,
      "PostDate": "17/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/849046",
      "Title": "Could have been detected earlier! OnBehalfofMyLove kjam"
    },
    {
      "AuthorID": "kjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240672/profile",
      "Content": "Oct 26, 2016 03:57PM kjam wrote: I had a suspicious mass that after mammo and ultrasound was categorized as Birad 5 \"malignant unless proven otherwise\" (>95% change of malignancy).    It was hypoechoic, ill-defined with shadowing.  I feel like I lost two weeks of my life worrying like crazy while I waited for my biopsy appointment - I was certain that it was cancer.   At the end of the day, it was fibrous tissue.   I was so fortunate.  I know it's extremely hard, but try to assume that it's benign until proven otherwise.   Best wishes.",
      "MessageIndex": 6,
      "PostDate": "26/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849184",
      "Title": "Time frame to diagnosis, worried. strength80 kjam"
    },
    {
      "AuthorID": "kjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240672/profile",
      "Content": "Oct 20, 2016 02:42PM kjam wrote: Biopsy result today!  Benign!",
      "MessageIndex": 2,
      "PostDate": "20/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849091",
      "Title": "Bi-rad 5 recharacterized to Bi-rad 4a kjam kjam"
    },
    {
      "AuthorID": "kjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240672/profile",
      "Content": "kjam wrote: I went for my biopsy today at the breast clinic. I saw two doctors - the first seemed to be more junior and agreed with the original report that the lesion showed signs of malignancy. A more senior doctor then came in and said that he is almost certain that the lump is the result of fibrocystic changes with a Bi-rad of 4a. Since the doctors didn't agree, they went ahead with the biopsy. I just point this out because it's important for people to realize that the Bi-rad classification depends heavily on the ultrasound operator and the interpretation of the doctor reviewing the results. I was sure that the lesion was cancerous based on the first ultrasound report. I'm feeling so much more positive now. I find out the results of the biopsy on Thursday. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849091",
      "Title": "Bi-rad 5 recharacterized to Bi-rad 4a kjam kjam"
    }
  ]
}