{
  "AuthorID": "Kkmay",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286039/profile",
  "Posts": [
    {
      "AuthorID": "Kkmay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286039/profile",
      "Content": "Feb 21, 2019 12:19AM Kkmay wrote: Thank you ladies for sharing your experiences! My mother who is 66 years old was recently diagnosed with stage 3 breast cancer in her left breast. Her tummor is huge (around 7 CM) ER-/PR - still pathology did not release the state of HER. The treatment plan is chemotherpy (4AC + 12 T), probably followed by surgery later. Just wondering how long typically for large tumors to see improvement on chemo? Please share your experiences :)",
      "MessageIndex": 55,
      "PostDate": "21/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/845339",
      "Title": "Large tumour survivors LM070917 Mumoftwo416"
    },
    {
      "AuthorID": "Kkmay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286039/profile",
      "Content": "Apr 4, 2019 07:20PM Kkmay wrote: Hi Ladies! Any of the large tumor survivors achieved Pathological Complete Response (PCR)?",
      "MessageIndex": 63,
      "PostDate": "04/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/845339",
      "Title": "Large tumour survivors LM070917 Mumoftwo416"
    },
    {
      "AuthorID": "Kkmay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286039/profile",
      "Content": "Apr 6, 2019 05:36PM Kkmay wrote: Thank you ladies for sharing! Wishing you the best luck in your journeys! As of the size of the tumor, I read somewhere in the community that a MO told her patient it doesn’t matter how large your tumor is or how many nodes are involved. What truely matters is your response to treatment! You could have a huge tumor and many nodes involved, yet responsd very well to treatment.",
      "MessageIndex": 66,
      "PostDate": "06/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/845339",
      "Title": "Large tumour survivors LM070917 Mumoftwo416"
    },
    {
      "AuthorID": "Kkmay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286039/profile",
      "Content": "Kkmay wrote: A few seconds ago Kkmay wrote: Hi, today was my mom's 4th AC session. Her MO said that her tumor has \"lessened in intensity\" and \"changed in color\" However, he seemed unhappy with the result and told us that he doesn't expect it to fully disappear! What the &$@&!! She still has 12 taxol to go after today's AC. He decided to add something called \" carbon\" or \"carbo\" to her upcoming taxol sessions. I think it’s a type of chemo.His reaction made me really anxious. I thought my mom was reacting well to chemo. I'm really scared now. I read somewhere here that the some tumors flat out, while others collapse in a ball. I don't know how true is that. Has anybody been in a similar situation? Dx 1/22/2019, IDC, Left, 6cm+, Stage IIIB, Grade 2, ER-/PR-, HER2- (FISH) Chemotherapy 2/16/2019 AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/870725",
      "Title": "How to assess if chemotherpy is working? Kkmay Trishyla"
    },
    {
      "AuthorID": "Kkmay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286039/profile",
      "Content": "Mar 10, 2019 03:59PM - edited Mar 10, 2019 03:59PM by Kkmay my mother is on biweekly AC but weekly taxol afterwar",
      "MessageIndex": 1,
      "PostDate": "10/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/870270",
      "Title": "Bi weekly AC followed by biweekly Taxol Mncteach Kkmay"
    },
    {
      "AuthorID": "Kkmay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286039/profile",
      "Content": "Feb 22, 2019 01:44PM Kkmay wrote: My mom is exactly the same. She thought chemo means death. She actually had a meltdown at the hospital at her first chemo appointment although I spent many days telling her about the wonderful stories of the survivors in this amazing community, and other friends and co-workers. I think you should do the same. Explain to her that chemo is doable, actually some people have very few side-effects with the current medications. Tell her that if you knew chemo will “kill” her, you woun’t let her have it. Also, always be with her, go to hospital appointments with her, have “calming” conversations with her. She needs your support now more than ever. It’s a long journey, take it day by day. Wish you and your mom all the best!",
      "MessageIndex": 4,
      "PostDate": "22/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869985",
      "Title": "My mom has a deep fear for chemo and refuses chemo maryds Runrcrb"
    },
    {
      "AuthorID": "Kkmay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286039/profile",
      "Content": "Feb 20, 2019 11:16AM Kkmay wrote: Thank you guys for your responses! And congratulations on the pCRs! Just wondering did you guys take any other supplements that probably contributed to getting a pCR? Do you have any advice/recommendations? Can pCR happen during chemotherapy? Or is it determined after finishing the whole set of chemo sessions? I’m really worried about my mom and I want her to get rid of this illness as soon as possible",
      "MessageIndex": 3,
      "PostDate": "20/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869952",
      "Title": "Vitamin D3 supplementation during chemotherapy? Kkmay nanette7fl"
    },
    {
      "AuthorID": "Kkmay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286039/profile",
      "Content": "Feb 22, 2019 10:07AM Kkmay wrote: Thank you ladies for sharing your experiences! It gave me hope that my mom will get cured from stage III breast cancer. My mom’s tumor is HUGE 7cm x 7cm x 5.5 cm ER-/PR- HER+. She has just started chemotherpy. Hopefully, she’ll get fully cured and I get to share her story here",
      "MessageIndex": 487,
      "PostDate": "22/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "Kkmay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286039/profile",
      "Content": "Kkmay wrote: Hi My mother who is 66 years old was recently diagnosed with stage 3 breast cancer in her left breast. Her tummor is huge (around 7 CM) ER-/PR - still pathology did not release the state of HER. The treatment plan is chemotherpy (4AC + 12 T), probably followed by surgery later. I have read several research papers online of the importance of vitamin d supplemtation and how it increased the probability of pCR by approximately threefold. However, I'm worried that this will interfere with the effectiveness of chemo. Has anyone tried supplementing with vitamin D3 during chemo and what was it helpful? Thanking you in advance, Dx 1/22/2019, IDC, Left, 6cm+, Stage IIIB, Grade 2, ER-/PR-, HER2- (FISH) Chemotherapy 2/16/2019 AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869952",
      "Title": "Vitamin D3 supplementation during chemotherapy? Kkmay nanette7fl"
    },
    {
      "AuthorID": "Kkmay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286039/profile",
      "Content": "Mar 26, 2019 09:54AM Kkmay wrote: My mom is on day 9 after AC#3 which hit her hard. She is still fatigue, does not eat much and her throat hurts her when she swallows anything all the way down to her stomach. She has AC every 14 days. I think the result of the chemo is cumulative because she is having the strongest side effects with this round. Hopefully she will not feel that bad on AC# 4 *fingers crossed* Her MO will put her on 12 rounds of weekly taxol afterwards.",
      "MessageIndex": 111,
      "PostDate": "26/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867853",
      "Title": "AC treatment yellowb brittandherboobs"
    },
    {
      "AuthorID": "Kkmay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286039/profile",
      "Content": "Mar 29, 2019 03:51AM Kkmay wrote: UCFknights- don’t worry! My mom had STARTED losing her hair after 14 days of her first AC treatment. After six weeks of her first treatment, she lost about %95 of her hair. She is still not completely bald after her third AC. Some hairs on the sides are still holding up. She doesn’t want to shave it though LOL. Her MO told us that some people just don’t lose their hair (although most patients do), but it’s nothing to worry about!",
      "MessageIndex": 119,
      "PostDate": "29/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867853",
      "Title": "AC treatment yellowb brittandherboobs"
    },
    {
      "AuthorID": "Kkmay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286039/profile",
      "Content": "Feb 25, 2019 09:15AM Kkmay wrote: Thank you ladies for sharing your experiences! My mom just started AC. I’m just wondering how did you know if your chemo is working? And when did you assess that? Towards the very end? Or midway",
      "MessageIndex": 105,
      "PostDate": "25/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867853",
      "Title": "AC treatment yellowb brittandherboobs"
    }
  ]
}