{
  "AuthorID": "Klassyklaws…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108633/profile",
  "Posts": [
    {
      "AuthorID": "Klassyklaws…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108633/profile",
      "Content": "Sep 6, 2010 04:02AM Klassyklaws wrote: Thank you so much, I am in Australia and struggling after a preventative bi-lateral mastectomy 10 weeks ago, i have huge truncal swelling and mild left arm and chronic right arm LE. I have just purchased a sleeve and am about to be fitted for a full garment. Your photos prove without a doubt I am not imagining whats happened to me. Thank you again..",
      "MessageIndex": 96,
      "PostDate": "06/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751566",
      "Title": "VISIBLE SIGNS OF LYMPHEDEMA - A PICTORIAL LindaLou53 glennie19"
    },
    {
      "AuthorID": "Klassyklaws…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108633/profile",
      "Content": "Sep 11, 2010 03:25AM Klassyklaws wrote: Hey all, I have all my lymph nodes and LE after bi-lateral mastectomy. I had the pleasure yesterday of attending a wonderful clinic here in Sydney. The lady marked my arms and legs and intervals and then did various treatments measuring along the way. By massaging me and emptying and unclogging my neck and chest nodes in 1 hour my right arm was 4.5cms smaller than at the start. My legs came down 3cms esch as well. My right hand and elbow area responded amazing and I again have tendons in the hand !! Woo hoo. So 3 hour workup session $300AU and hand held laser to manage my dreadful wounds $575Au, some special anti bac cream, a specific diet, and a product called Lymphodran and I am feeling fabulous. I have been to the gym today and my arms stayed down and my belly went down even further. I am happy that I fished about and found her, but wrap this up with what she said about my LE, I have it for life, and must manage it daily. She is also keeping records on us girls that \"aren't supposed to get that\" as she said we do. She was also adament that I am not to have drips, BP and the like in my dominant arm where possible. Good luck to everyone I will repost how I go over the next 4 weeks. Cheers Kell.",
      "MessageIndex": 11,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/757575",
      "Title": "stay away from that arm? imblessed2 lovemyfamilysomuch"
    },
    {
      "AuthorID": "Klassyklaws…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108633/profile",
      "Content": "Sep 11, 2010 06:33AM Klassyklaws wrote: hi hanami, have you been shown how to squish you own belly with breathing to get that fluid out. I suffer badky and look six months pregnant with it 11 weeks post bilateral mastectomy. I had huge seromas drained for 8 weeks. But now I place my hand on belly under rib breath right in and fill up and push with right hand against it. Then divide the rest of you belly into quadrants and repeat it. It works and can be done 2-3 times a day laying down. Also lay on the floor arms by your side, take a big breath in and as you exhale bring up your arms and cross them over your body and breath out forcefully. This gets out the fluid that is trapped in the centreline of your drainage/ Good luck with it all, I hate how I look when it gets bad but this is working a treat. Kell",
      "MessageIndex": 9,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/757864",
      "Title": "Soft movable lumpy area around lower egde of ribcage hanami Klassyklaws"
    }
  ]
}