{
  "AuthorID": "Klm0221",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166267/profile",
  "Posts": [
    {
      "AuthorID": "Klm0221",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166267/profile",
      "Content": "Klm0221 wrote: I will try to offer the abbreviated version of my frustration: Dec.10th - call back after mammogram; follow-up mammo, ultrasound, and biopsy.      1 cm intraductal papilloma \"completely removed\" during biopsy - everything biopsied was benign; referral to breast surgeon to  excise the tissue surrounding it.  Jan 4th - met with breast surgeon.  I asked why surgery when it was all benign.  She said the \"standard of care\" keeps changing with papillomas and currently it's surgery - some years it's an MRI.  I said I wanted an MRI first and she wrote a letter to BCBS - took 5 months to find it out it went to the wrong BCBS office! May 7th (a week ago) - MRI done.  They said report would be faxed to Dr in 2 days. I called on Friday (test was done on Tuesday early) and Dr's office said report not received.  Called MRI office today and found out the Dr's office had the report the DAY AFTER the MRI (last Wednesday). In January, they scheduled me for a visit in JUNE with the nurse practitioner.  So I asked today why I was seeing the nurse practitioner.  I need to know if I NEED excisional surgery. I am beyond frustrated . . . don't know what to do and no one seems to care.  The nurse is a pill and doesn't show any compassion at all.  My PCP referred me to this breast surgeon and he speaks highly of her.  Don't know what to do.  Today we left it at the nurse saying she would show the breast surgeon my MRI results tomorrow and ask her what todo next.   I got off the phone and just cried!  Scarey to think what would have happened if there was a fast-growing malignancy lurking in there. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/804663",
      "Title": "Beyond fed up! Klm0221 armymom99"
    },
    {
      "AuthorID": "Klm0221",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166267/profile",
      "Content": "Klm0221 wrote: Hello! I am 57 and was recently diagnosed with a 5mm intraductal papilloma - no diagnostic sign of malignancy.  I am somewhat confused because the report states that they removed the tumor \"completely\" when they did the core needle biopsy YET I am being referred to a surgeon for excision.  I did ask the PA at the imaging facility about this and she said that the margins need to be examined.  I have read that cancer can be lurking near a papilloma, so I am becoming increasingly concerned that there is more of a concern that there is cancer than I am being told. I have an appointment with a surgeon on January 9th but each day I become more anxious about this.  I don't want to have any needless surgery but I am also concerned that they will go in and wind up finding more than just this papilloma.  I will meet with the surgeon but, based on just the reports from the biopsy, I don't understand why I need this surgery. I know no one has an answer to this but I am interested in hearing other women's experience with papillomas. Thanks and God Bless! K Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797868",
      "Title": "Newly diagnosed - intrductal papilloma Klm0221 Klm0221"
    },
    {
      "AuthorID": "Klm0221",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166267/profile",
      "Content": "Jan 13, 2013 03:31PM Klm0221 wrote: Thank you for sharing your experience!  I did meet with a general surgeon my PCP recommended.  I am pushing for an MRI but insurance will pay for excisional surgery and not an MRI.  The Dr said she would write a letter but she is on the board and knows the guidelines do not include MRIs for papillomas.  I have an appt with the surgeons' Nurse Practitioner in mid-June and will have a another mammo before that appt.  I am getting so discouraged about this process that I feel like just getting the surgery. Thanks again! Kathy",
      "MessageIndex": 5,
      "PostDate": "13/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797868",
      "Title": "Newly diagnosed - intrductal papilloma Klm0221 Klm0221"
    },
    {
      "AuthorID": "Klm0221",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166267/profile",
      "Content": "Jan 13, 2013 03:28PM - edited Jan 13, 2013 03:32PM by Klm0221",
      "MessageIndex": 4,
      "PostDate": "13/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797868",
      "Title": "Newly diagnosed - intrductal papilloma Klm0221 Klm0221"
    },
    {
      "AuthorID": "Klm0221",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166267/profile",
      "Content": "Jan 9, 2013 07:56PM Klm0221 wrote: I had a suspicious nodule too - about a month ago.  I had a cone needle biopsy and the removed a 5mm intraductal papilloma.  It is not very common - it's like a polyp in the milk duct.  It is a benign tumor but the \"standard of care\" is to have them removed by excisional surgery.   I found comfort in knowing that 80% of breast biopsies are benign.  Wishing you the best as you await the results!  Keep positive! Kathy",
      "MessageIndex": 5,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798510",
      "Title": "Having Biospy done today nanna5 Klm0221"
    }
  ]
}