{
  "AuthorID": "klt5817",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
  "Posts": [
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jun 26, 2017 10:33PM klt5817 wrote: Hi Wendeez, I'm doing fine now.  I say I'm 99% back to my pre-chemo day.  MO did warn me about the bone pain & histamine due to Nuelasta.  I was really afraid of the nausea/vomiting which thankfully I did not have (I used Ginger patch).  You can get them in the Pharmacy at your infusion center.  I drank lot of water daily, but added V8 juice & Adult Pedialyte after day 2 because I started to get muscle cramp (from too much water I think).  The Nurse Practitioner who gave me a Chemo 101 class 3 days prior to first infusion gave me a \"must have items\" list and what to take for what problem and when to call MO so that was a big help.  I will try to scan them in and post them later. You'll be okay.  But do not afraid to ask questions (to your medical team).  Post them here and I'm sure one of us will be able to help.",
      "MessageIndex": 325,
      "PostDate": "26/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Aug 12, 2017 09:55AM klt5817 wrote: I was also warned by my MO that Taxotere may cause neuropathy & was told to take 100mg of Vitamin B6, twice a day, throughout treatment.  I do feel occasional numbness/tingling on my hand but it went away after some yoga stretching and walking.  However, I found the following link from the Dana-Farber Cancer Institute very good read.  Apparently, vision change is also a chemo-induce-neuropathy. http://www.dana-farber.org/Health-Library/Tips-for-Managing-Neuropathy.aspx Have a good weekend ladies.",
      "MessageIndex": 812,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jun 26, 2017 04:36PM klt5817 wrote:  Hello Ladies,  I'm in awe after reading all of your trials & triumphs during this chemo phase of our life. I had the first of four TC sessions on Thursday June 15th. I only had general weakness, constipation, dry mouth, achy joints during the first four days post chemo; totally manageable. However, on the evening of the 4th day, that Nuelasta med must have kicked into 6th gear suddenly because my body felt like someone taken a baseball bat and hit me all over (I did take Claritin 10mg/day since day 1). The bone pain did went down on day 5th but then my ears' drums started to hurt due to loads of histamine that the drug caused fluid to accumulated. I quickly double Claritin's dose to 20mg and had to take Mucinex D to drain the sinus as well. After bloodwork last week, my MO told me my lymphocytes count was so good that he will lower my Nuelasta dose in ½ to help with the bone pain and reduce histamine. However, I do have to come in to the infusion center to get the shot 24hr after chemo, because the dose of auto-injection device cannot be adjusted. I'll let you know how that works out after my 2nd chemo on July 6th.  As I was curled up in a fetal position on my sofa on the eve of day 4, my 19 yrs-old son read me the following poem. He said it helped him during his basic cadet training at the Airforce Academy last year. It inspired me as well. So, I would like to share it with you, my virtual sisters:  “Invictus” by William Henley    ",
      "MessageIndex": 318,
      "PostDate": "26/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jun 28, 2017 09:58AM klt5817 wrote: Hi Wendeez,  good for you to ask your hubby to help.  After all, We did take the vowel \"in sickness and in health\", right? And tonight, if your MO gave you Xanax or Ativan, take it so you can sleep peacefully instead of worrying about tomorrow.   I'll be thinking of you tomorrow.  God Bless! Hugs",
      "MessageIndex": 347,
      "PostDate": "28/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jul 8, 2017 07:32AM klt5817 wrote: Hi Pink, make sure your MO recalculates your CM dose now that you're 8 lbs lighter.  It supposes to be less drug.  As for hairs, I was born with a full head of dark baby hairs (Mom still has picture to proved it).  So, it was eerie at first to touch my bald velco liked head but I was tire of them falling around my house, into my food, my neck, back etc... I have chemo hat & wig ready, 2 more hats on the way from Headcovers.com.  Check this website out ladies, it was found by Mom (BC patient) & Daughter team with lot of choices. C'est la vie! Qui.  Beside, what am I gona do?  Complaint to City Hall !",
      "MessageIndex": 452,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jul 16, 2017 12:57PM klt5817 wrote:  Susie & Kim, you two are my hero (for your courage to post your non-hair pics on social media & by doing so spreading awareness of BC). You look beautiful. I'm not there yet as I am an introvert & carefully guarding my privacy. I do agree that BC is not all happy cutely pink shirt and ribbons. Too many women had and will succumb to this “despicable” disease as Pink put it. Sometime I think the cure is worse than the cancer as each of us has experienced its side effect first hand. I'm praying for science to advance quickly so that our daughters/granddaughters will not suffer as we did. ",
      "MessageIndex": 587,
      "PostDate": "16/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jul 20, 2017 02:22AM klt5817 wrote: Ditto with Kim & CurlyN about hypersensitive to smell; I think our brain is trying to compensate for the lost of taste by heighten our olfactory nerve.  And yes, please do use artificial tear without preservative such as \"Refresh Plus\"; Taxol is notorious for causing dry eye due to excessive tear.",
      "MessageIndex": 615,
      "PostDate": "20/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Aug 6, 2017 02:26AM klt5817 wrote: Hi JuliaZazz,  you and I have the same chemo treatment, 4 rounds of TC.  My 4th round will be August 17th.  And boy, although I'm weaker now, August 17th doesn't come soon enough for me.  I just want to face the devil one last time and get on with my life.  I, too, had some bad moments when I was soooo fatigue, feverish on the 5th night of round 3.  I told my husband that I hated my life, I want to say NO to round 4, I don't care what he or my MO will say, it's my body blah, blah, blah... But the next day clear head returned, reading all your posts gave me strength and courage to face on.  On the topic of hormonal therapy, this link is an article about Dr Angela Brody who passed away last month.  She discovered the Aromatase inhibitor.  Her dedication & perseverance helped save many women lives.   https://www.washingtonpost.com/local/obituaries/angela-brodie-scientist-who-helped-make-major-advances-in-breast-cancer-treatment-dies-at-82/2017/06/08/b3729a48-4c4e-11e7-a186-60c031eab644_story.html?utm_term=.cbe67526b64a Hugs to all,",
      "MessageIndex": 785,
      "PostDate": "06/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jul 8, 2017 02:17AM klt5817 wrote: Went in for my 2nd TC round yesterday; will come back for Nuelasta shot this afternoon but with 1/2 dose compared to the auto-injection device.  MO told me the auto-injection dose is a one-size fit all weight, and I'm 122 lbs so 1/2 dose should work fine.  I hope that would deplete some bone pain & histamine that Nuelasta done me in round 1.  \"PeachyJeanie\", Claritin helps to relieve symptoms from the histamine such as sinus pressure, ear pressure etc, not bone pain so much. My DH gave me a buzzed cut last Monday, first few seconds was hard as there were my tears mixing with the falling salt/pepper hairs; but I did strengthen my resolve, said a few prayers and remember the inspired \"Invictus\" poem.  On the positive side, I now use less H2O for washing..LOL, saving the planet 1 droplet at a time.... Here is my 1/2 head shot, at least my eyebrows are still in tact for now, and DH said I have a strong forehead (I said it was due to deep thinking on my part).  ",
      "MessageIndex": 445,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jul 29, 2017 01:48PM klt5817 wrote: From what I've read, weekly taxol (paclitaxel) is less toxic than every 3-week taxol (taxotere) because the dose is less.  But every one of us is unique, and the SEs affects us differently.  It could be that after the AC runs, your body strength is depleting, less gas in the tank per se, so the SEs multiply.  I hope you can take comfort in knowing that the drug is doing it jobs by wiping out those microcells that could have/would have deposit in our bones.  Hugs to all!",
      "MessageIndex": 728,
      "PostDate": "29/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jul 8, 2017 11:59PM klt5817 wrote: Hello my virtual sisters, Here is another poem that is somewhat applicable to us.  I think it'll sound better if I replace \"men\" with \"women\" when reading it.                                      Do not go gentle into that good night, Old age should burn and rave at close of day; Rage, rage against the dying of the light. Though wise men at their end know dark is right, Because their words had forked no lightning they Do not go gentle into that good night. Good men, the last wave by, crying how bright Their frail deeds might have danced in a green bay, Rage, rage against the dying of the light. Wild men who caught and sang the sun in flight, And learn, too late, they grieved it on its way, Do not go gentle into that good night. Grave men, near death, who see with blinding sight Blind eyes could blaze like meteors and be gay, Rage, rage against the dying of the light. And you, my father, there on the sad height, Curse, bless, me now with your fierce tears, I pray. Do not go gentle into that good night. Rage, rage against the dying of the light. ",
      "MessageIndex": 462,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jul 14, 2017 07:47AM klt5817 wrote:  It has been a week from my 2nd TC round (2 down, 2 more to go). I came in for blood work today and happy to know that white blood cell counts are up and up even with ½ dose of Nuelasta. I've managed side effects of this second round better but my strength is less (not sure if that makes sense!). And new SE such as hot flashes, lower blood pressure make their present known to me.  On the human side, I'm 51 and live in Texas for 27 years. Married to my DH who is 5 yrs older than me, for 27 years; one 23 yrs old daughter and a 19 yrs old son. I used to work as Network Engineer for 13 yrs; got burn out; took time off to carpool my kids; switched to medical field and has been a MRI Technologist for 9 yrs. As of July 2016, we are officially empty nesters (my son went off to college) so I have since worked part-time and volunteered as GED Math Tutor at local libraries. DH is a RF/wireless engineer for 30 years. With God's willing, I hope to be around to play with my future grand kids & spoil them rotten. My daughter is heading to the Northeast this fall to start her PhD program in Neuro-Psychology. I told her to make friends with researchers in the Medical School & let me know if someone is working on chemo drugs that target cancer cells ONLY, & I'll make $$ contribution (so our SE can be eliminated).  ",
      "MessageIndex": 544,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jul 24, 2017 10:23AM klt5817 wrote: Hi Ladies, I don't have headache but top of my skull hurt/achiness sometime during the day.  I touch it and it seems tender compared to other area of the skull.  This may be due to the hair loss.  I have a dark spot on the nail of my right thumb (noticed it 2 weeks post round 1).  Couple dark spots on the gums of my teeth too.  Anyone has persistent sinus pressure?  I'm 17 days post round 2 of TC (round 3 will be this Thursday), but my sinus still feel wonky; Walking on treadmill just with speed just 3 miles/hour make me dizzy so I have to slow it down to 2.7.  My head feels like a bobble head doll.  This is the part that I hate most about chemo.  My body just seems to slip out of my control.  ",
      "MessageIndex": 679,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jul 24, 2017 09:49PM klt5817 wrote: KimPossible, thank you for your encouragement.  I will try to remember this too shall pass; it's temporary but I'll remember August 17th for the rest of my life as it'll be the 4th and hopefully the last of chemo for the rest of my life.  DH & I will be flying to Air Force Academy on August 31st to attend Parent Weekend.  And if I can walk (even at 1 mile/hr speed), I'm going.  My eyebrow are still 99% intact as well as my eye lasses so I hope Taxol will be kind to your too. Hhuey, weekly Taxol will be taxing for sure; and I think being a lunch lady you'll have to be on your feet the whole time right?  You may try just 2 or 3 days a week to see how it goes if your boss allows.  Mastectomy will require you not lifting or carrying anything heavier than 1 gallon of milk on the mastectomy side for at least 2-3 weeks, so working in your position would not be possible. ",
      "MessageIndex": 685,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jul 28, 2017 09:50AM klt5817 wrote: Hello Ladies, Had my 3rd TC round yesterday.  I'm coming back today for Neulasta shot and IV fluid infusion.  I'm feeling okay now because I'm still high on the steroid, but just want extra IV fluid heading to the weekend to hopefully ward off the BP drop.  On my round 2 three weeks ago, my BP dropped to 90/50 on Sunday despite drinking 2 liters/day of water.  My MO though that the Taxol killed off more intestine cells that time causing less absorption, go figure!  Also, MO said more sinus problem could be caused by nose hairs falling off too, so there're less of them to prevent/trap the grass & weed pollens (that I'm allergic to) to go into the sinus.  So, I'm wearing nasal mask in 100 degree heat while going outside. I saw these quotations in one of the MO's exam room & thinking some of us can relate to them.  Enjoy and hope every will have a good weekend!  BTW, the quote \"Never Give Up\" is by \"Winston Churchill\".   The clip covers the word \"to\" on the left sign.  ",
      "MessageIndex": 708,
      "PostDate": "28/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jun 27, 2017 01:35PM klt5817 wrote: Hi Wendeez, I know you feel like a freight train is coming straight to you right now & you can't move out of the way but just take slow deep breaths, imaging a year from now you'll be at a paradise beach somewhere with a glass of best margarita you ever had.  Remember \"  You're the master of your fate & soul\".  And please, if you have someone who can help with the chemo shopping list, ask them to do it for you. You need your health/strength at their max on days prior to chemo.  I find Amazon prime (one of the few best things that my dear hubby spent) is my best friend as most items I can get it within a day.  Many hugs!  KLT",
      "MessageIndex": 330,
      "PostDate": "27/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jun 27, 2017 07:38PM klt5817 wrote: Hi Susie, Try mixing 1/2 teaspoon of baking soda, 1/4 teaspoon of salt, with 2 cups of warm water.  You can half that with one cup of water but I hate measure 1/8 tsp of salt so I double the amount.  Take a mouthful of the solution, swish it around then spit it out.  Take a mouthful of clear water after that then swish it around.  My RN told me to do that every 3 hrs and it helped a lot.  I did not have any mouth sore & it relieve some dryness.  Cover the cup with plastic wrap then you can use it for several days so you don't have to make it many times. Hugs, KLT  ",
      "MessageIndex": 335,
      "PostDate": "27/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jun 30, 2017 05:46PM klt5817 wrote: Hi LTWJ, Did you try protein powder mix with a liquid of your choice?  I used Whey protein chocolate flavor, alternate with Vegan protein chocolate flavor.  I mixed them with a cup of Almond milk or Gatorate.  Up to 7 days after my first round chemo on June 15, my gum was so tender that chewing hurt in addition to dried mouth.  So I drank protein solutions twice a day & ate soft food in small portion. Hugs, KLT",
      "MessageIndex": 379,
      "PostDate": "30/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jul 14, 2017 12:22PM klt5817 wrote: Hi Kim, The Nuelasta auto-injector device is a full-dose or 1 size fit-all-patient dose.  That device cannot be adjusted to reduce the amount of drug going into your body.  For me, that dose caused too much histamine in my body which hurt my ear drums.  So, this 2nd round, I opted to come back to the oncology center the next day & the nurse injected 1/2 the amount (of the auto-injector) into my arm.  It was worth the trip.  I saw a piece about IBM Watson computer helping oncologists at the North Carolina University Medical Center by reading thousands pieces of research that human MD don't have time to read then recommend treatment tailor to patient dx (on 60 minutes program I believe).  Hopefully, not too far in the future, some whiz programmer can direct Watson to simulate chemo drug that can target cancer cells only.  That would convince drug makers to sponsor human trial.  KLT",
      "MessageIndex": 555,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jul 21, 2017 11:18PM klt5817 wrote: Ah, seeing pictures of you guys best furry friends sure make me smile.  They are so cute and adorable! Hi PeachyJeanny, I understand the surgery (lumpectomy versus mastectomy) is a difficult one & has pro/con with each of them.  But I can say definitely for myself that compared to chemo, my mastectomy is a \"piece of cake\". ",
      "MessageIndex": 648,
      "PostDate": "21/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Jul 21, 2017 12:29PM klt5817 wrote: Hi Tpralph, Your border collie pic in the canoe should be on a calendar.  He/she reminded me of another border collie that was on the \"America Got Talent\" show last Tuesday.  His name was Hero. His act passed the \"Judges cut\" and onto the 3rd round.",
      "MessageIndex": 654,
      "PostDate": "21/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Aug 18, 2017 11:20PM klt5817 wrote: I bring my own rectangular plastic container, fill it with ices at the infusion center, put on gloves for my hands (I used the gloves that the nurses use when they start IV) then dip them in my container.  For feet, the center have bags that they use for head contusion, so my DH fill them with ice (one for each foot) then wrap them around the foot (sock on)  using Coban tape (tape that nurses use to wrap the IV site when they took the IV out).  I iced fingers/feet few minutes prior and after Taxotere.  It's cold but tolerable for 1 hr; I did take hands out out the ice and flexed fingers for few seconds at 30 minutes point.  Each of us will have different experience.  My nails have some discolorations but so far are still strong and growing.  Hope everyone will have a good, restful weekend.  My last/final round chemo was yesterday, Hallelujah!",
      "MessageIndex": 857,
      "PostDate": "18/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "klt5817",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250740/profile",
      "Content": "Sep 10, 2017 04:32AM klt5817 wrote:  Hello Ladies,  It has been 23 days since my 4th & final TC round. My strength is slowly returning. I saw my MO yesterday. My RBC is still 12% below normal range so he said to take it easy, light to moderate exercise only. He said it may take 3 to 6 months for my strength to return to pre-chemo day.  DH and I went to Colorado Springs last weekend to see our son. So my legs' muscles are still sore from walking up the hills. However, I was rewarded with such a sweet FB post from my son that include a quotation so I would like to share it with you, my virtual sisters:  “Hey mom! Thank you so much for coming out. I know it wasn't the easiest thing physically to fly out here, and I'm sorry I couldn't be there for most of your treatment. But you have been and always will be the greatest inspiration to me! I just want to share a few words from a neat little book, an old gift from my 7th grade humanities teacher.  \"And someday, in eighty years, when your a hundred and I'm a hundred and thirty-four, and we're both so kind and loving we're nearly unbearable, drop me a line, let me know how your life has been. I hope you will say:  It has been so wonderful.\" -George Saunders  Love ya mom! And by the way, you look absolutely gorgeous!”  I continue to read your posts and keep you in my daily prayers. Wishing all of you peace, strength, and happiness. ",
      "MessageIndex": 993,
      "PostDate": "10/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    }
  ]
}