{
  "AuthorID": "KLynn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
  "Posts": [
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "May 28, 2009 07:26AM KLynn wrote: Oh Lynn I so get what you are saying....I tried to explain to my husband ( who sometimes really annoys me with his cheerleader attitude bull crap)..that taking chemo (right now I'm having a hard time  on tykerb) taking the pills is like he was feeling great everyday, and then there were these pills for him to take, and they gave him the flu..full on, straight up FLU...and he would feel like crap feel like he was dying..Then he would have to do it the next day, and the next day and so on...Well he stopped his cheering me on for a bit...Hey way to go, you should be glad at least there are drugs available now..the nausea meds are so much better...blah blah blah...oh shut up....!!!!! I too feel the cancer will \"get me\", but I'm sure as hell gonna live while I'm here, and if it means stopping drugs for a bit then so be it...I remember thinking..\"I don' t have time to be sick, this is so stupid...\" I think we all go through the ups and downs emotionally, it's a good thing we don't all do it at the same time..LOL this way there is always someone here to pick us up ..For some reason I find it easier to get the push, and the \"way to go's \" from here, knowing you all understand me.. I really hate getting it from extended family that doesn't get it... How about when someone asks you...\"So you're alright now???  The cancer is gone ..right??? \" It doesn't matter how many time you explain, that it isn't going away EVER... Hope you wake tomorrow feeling a little bit of the weight off of you shoulders by letting it out here, that's what we're all here for... Hugs KLynn",
      "MessageIndex": 4,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734893",
      "Title": "Scans say stable. I say big deal. LynnW Dollyd"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 12, 2007 05:22PM KLynn wrote: Hi LuAnn, Wow your grandson is beautiful, boy how babies make you smile!!!!Your son still looks like a baby himself what a cute face. Best wishes to you and your family, keep the pictures coming, brightens my day, Take Care KLynn",
      "MessageIndex": 4,
      "PostDate": "12/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693721",
      "Title": "Pictures of New Baby LuAnnH Rocktobermom"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Aug 12, 2009 04:44PM KLynn wrote: Thanks Abby ...I CAN DO BEETS........I'm going to try it for my next herceptin and see if they are higher too...we'll so our own experiments here..lol...mine haven't been too low, but it never hurts to raise them...thanks for sharing your good news..KLynn",
      "MessageIndex": 2,
      "PostDate": "12/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738853",
      "Title": "only you guys would understand abbyglp pitanga"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 7, 2007 04:10PM KLynn wrote: Hey Kasey,   Sorry to hear you're having problems with your treatments. My doc told me to take vit b6 while on the xeloda to help with the hand/foot syndrome, and I never had a problem with them. I also used tons of lotion at night, which you're probably doing already. I did have terrible diarrhea though, needed to have my doses reduced many times. I lasted 7 months on xeloda before asking for a break, he then switched me to Gemzar. Hope you feel better. Take care , thinking of you ---KLynn",
      "MessageIndex": 4,
      "PostDate": "07/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695017",
      "Title": "Called the Onc... Kasey AliceJean"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 28, 2009 08:01AM KLynn wrote: Ohh Janis you look great in your wig..I love it ...It's styled beautifully..That coming from a hairdresser.great color on you too, I don't know how close it is to you own color but that looks great..Love the glasses too..I just started wearing mine more and more, the contacts just don't feel good any longer, I guess with all the drugs and herc. my eyes are either VERY dry or tearing constantly if that makes sense..Never normal any more... Susan, I'm so sorry you have to lose it again..And I feel just the same about wanting my life back, all of it..I want to just have\" normal \" again for a few years...I want to \"want\" my hubby again the way we did a few years ago..I was just saying at a recent get toether that b/c doesn't just take your breasts, it takes so much more, your sex drive, your ability to buy the clothes you want, shopping sucks now, your hair, your skin, yourfun in the sun, and don't even start me on a bathing suit uuughhhh..The aches and pains..Sorry now I'm ranting..It's been a rough morning.. Hey there  Robin..so nice to meet you the other day, by the way ladies, Robin has an adorable short haircut, it looks great on her...She's a tiny little package of smiles.... Huggles KLynn xoxo ",
      "MessageIndex": 11,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728101",
      "Title": "Goodbye to hair... again SunshineSmiles heatherpalmerton"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 7, 2007 04:14PM KLynn wrote: Hey Kasey   Me again, I also read here awhile back that some docs in NYC were treating the hand/foot syndrome with a low dose nicotine patch, don't know much about it, but you may want to try googling it. I'll try too. Hope this helps---hugs KLynn",
      "MessageIndex": 5,
      "PostDate": "07/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695017",
      "Title": "Called the Onc... Kasey AliceJean"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jul 17, 2009 05:36PM KLynn wrote: Hey LuAnn Well you certainly sound like you are on top of all of this, I agree minimal is best at this point..I think in the beginning we hit hard with everything we have, hoping to never have to do any of this again...Then if it does come back, I think we need to just try and stay ahead of it as best as we can...I personally want to take as little as I can these days..I am so tired of all the side effects...I just recently had some progression in the lung nodules that were already there, doc said we could just wait 3 months for new scans, or we could start with something slow, and if we have to then add more..Yep that's the way I want to go..much slower these days...Like Beth said\" try and save the big guns.\" and you can always go back to some of the drugs that didn't fail you..Since you've had such good results with some of the areas already, I think I would talk about more  rads..Thinking of you and hoping doc has a  plan ready  for you..Huggles KLynn",
      "MessageIndex": 23,
      "PostDate": "17/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737534",
      "Title": "Progression on scans - need advice LuAnnH mom2acat"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jun 11, 2008 08:46AM KLynn wrote: Hey  Fitz,     I'm so sorry to read this.....BUT until you get the biopsy drink your wine (all of it)  and eat all the hamburgers you want..Then if it is the ugly monster again , Have them hook up that herceptin by the bag fulls ....I have been on it for over 2 1/2 years again this time, gotta love the herceptin....Of course I had some chemo along the way with it but I truly believe the Herceptin is making all the difference with me..I'm on the three week plan right now, I was getting it weekly but that was really a pain in the a$$ with trying to get back to a \" normal \" life again..So my friend. I wish you the best of course but if you have to face this again, I say hook up the herceptin and try to get back to living, don't let this monster take another day from you, and remember how many women you have here praying for and with you.....Hugs and prayers KLynn...     ps- I have been in remission for about 10 months now ..getting herc. every 3 weeks probably for life..lets hope they have enough to last me the next 30 yrs.. ",
      "MessageIndex": 95,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/706997",
      "Title": "not good you guys Fitztwins Lindaip"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 13, 2007 07:10AM KLynn wrote: Love the puppy pictures, what beautiful dogs you have. I love my yellow lab so very much, even thought of getting a labradoodle to keep her company, one here in the pet store that no one would take, but last time I went in the store she was gone.  Good luck with all the pups Keep the pictures coming . Take care KLynn",
      "MessageIndex": 6,
      "PostDate": "13/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693698",
      "Title": "New puppy pictures ForTheMoment Kasey"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 28, 2008 10:33AM KLynn wrote: Steph,      Praying for all this crap to find someone else to bother......( like some rotten criminal) .You have had MORE than your share,  you can always come here for comfort, it's  not complaining at all.... Hugs Klynn",
      "MessageIndex": 12,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723489",
      "Title": "Thrush...... Yuk! TripleNeg lemonld"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 20, 2009 05:16PM KLynn wrote: Crap Bonnie..just crap...  So sorry to hear this... Is this kind of rare???I don' t think I have heard of many getting a recur to the stomach muscles..Lets pray that it is one of the areas that is very treatable....I don't know anything about this, I\"m always amazed at the news of a new recur...and the places that these little buggers show up.......Will be praying for you, hope the doc has a ton of tricks up his sleeve for you.... Hugs KLynn...",
      "MessageIndex": 23,
      "PostDate": "20/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732667",
      "Title": "Pet Results not good Bonnielv getwell"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 30, 2009 12:32AM KLynn wrote: HAPPY HAPPY BIRTHDAY TO YOU..U..U..U.......ROBIN.......XOXO KLynn....",
      "MessageIndex": 15,
      "PostDate": "30/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733277",
      "Title": "Happy Birthday RobinWendy! KellyC luvtotravel"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 26, 2009 03:15PM KLynn wrote: No not ready at all  Elaine...Glad to hear you got some good news,,sorry about the bad news, hopefully they will figure something out for you...Seeing him every other month will eventually turn into every 6 months...Be well..KLynn",
      "MessageIndex": 102,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727033",
      "Title": "This is the \"What Would You Like To Bring to the Pahtay\" Thread KellyC AnnNYC"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 27, 2009 04:11PM KLynn wrote: OHHHHH yeahhhhh Patti....You finally found us.....Going to check out the Angel you're talking about...BUT I'm not getting a tattoo...no matter how many of you go..LOL.. Talk to you soon..Love ya KLynn xoxoxo",
      "MessageIndex": 120,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727033",
      "Title": "This is the \"What Would You Like To Bring to the Pahtay\" Thread KellyC AnnNYC"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 15, 2009 08:38PM KLynn wrote: Kelly I will definately bring some soda bottles, and will be bringing some kind of munchie, not sure yet what it will be. I'll be back on the 21st from vacation, so I'll think about it then..I can also do a dessert...Can't wait to meet everyone...I'm flying out of JFK tomorrow, lets hope it doesn't land in the Hudson like todays plane did...Those poor people, I can't even imagine how cold that water was..Ughhhhh.. Thank God the pilot was so good..They are really praising him as a hero..Talk  to you all when I get back..This is so exciting..Hugs KLynn",
      "MessageIndex": 18,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727033",
      "Title": "This is the \"What Would You Like To Bring to the Pahtay\" Thread KellyC AnnNYC"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 24, 2009 08:51PM KLynn wrote: What a great night......Kelly really out did herself...So much food, beautiful home and GREAT company...There were 19 of us, but the bar room was so big it didn't even seem like it...It really was so nice to meet everyone, it's amazing how nice it is to put a face to the names of these ladies that you talk to for over a yr or two..It would be nice to continue these kind of get togethers, some of the ladies really traveled from far away, what a  pleasure to finally meet them..Thank you Kelly .. and thank you everyone that was there..Hugs KLynn",
      "MessageIndex": 65,
      "PostDate": "24/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727033",
      "Title": "This is the \"What Would You Like To Bring to the Pahtay\" Thread KellyC AnnNYC"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 25, 2009 05:32PM KLynn wrote: Hey has anyone heard from our friends that had to travel back today???? Hope they had a safe trip..Ladies check in and let us know you made it home safely...How nice it was to have you come from so far away... Kelly sorry to hear about the hangover, maybe it was that pomegrante seed you swallowed by mistake,lol...Thanks again, I've been smiling all day thinking about last night..Your friends from LI are delightful, hope they decide to post here and become part of the boards..and Kelly sorry about the \"spill\"....omg, nice first impression... Next time we need to fly--\" to\"- the ladies in the warmer weather....I don't think Bethie ever warmed up, her bones aren't use to this cold weather, brrrrrrr...I tried to warn you guys about how cold it was...Hope  you are thawing out by now.. hugs Klynn xoxox ",
      "MessageIndex": 86,
      "PostDate": "25/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727033",
      "Title": "This is the \"What Would You Like To Bring to the Pahtay\" Thread KellyC AnnNYC"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 26, 2009 03:54PM KLynn wrote: Ohhhhh WELCOME Crissy !!!!!!!! So glad you found us all here.... It was a pleasure meeting you...Kelly has really nice friends out in LI....You all are very lucky to have each other..Hope to talk to you often, and we will let you know when we have the next NJ get together, we'll have to start combining them into NY/NJ get togethers from now on..Be well and good luck with your decissions..Hugs KLynn ...",
      "MessageIndex": 106,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727033",
      "Title": "This is the \"What Would You Like To Bring to the Pahtay\" Thread KellyC AnnNYC"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 7, 2009 04:52PM KLynn wrote: Bump...good idea Analemma.....Didn't think to bump this before.....KLynn...",
      "MessageIndex": 137,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727033",
      "Title": "This is the \"What Would You Like To Bring to the Pahtay\" Thread KellyC AnnNYC"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 31, 2009 04:51PM KLynn wrote: Hey Bethie, Missing you too...It's still darn cold here. LOL .I have to agree with you ---about the group being pretty darn good looking, we certainly don't look like \"sick cancer patients \" ..I guess I always feel crappy on the inside so I think that everyone always knows that I\"m  sick..The sad part of it is how young everyone is...Crissy and Graceann (in their picture) look like they could be on an Ivory soap commercial, they are so young,  clean and fresh looking.. I hope you can make it back up this way again soon. The shore is beautiful in the summer here..I'm only about 15 minutes away from the beach.. .Wishing ahead for warmer weather.. Hugs back at ya..Love ya KLynn xo",
      "MessageIndex": 129,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727033",
      "Title": "This is the \"What Would You Like To Bring to the Pahtay\" Thread KellyC AnnNYC"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Dec 28, 2014 01:32PM KLynn wrote: wonderful news...hoping all clears up and you start the New Year off the best way...K..",
      "MessageIndex": 70,
      "PostDate": "28/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827136",
      "Title": "Say a little prayer for me... Kjones13 KLynn"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 9, 2008 11:21AM - edited Apr 9, 2008 11:49AM by KLynn Hey Watson,     Sorry about your newest news...i really am..I quit xeloda, it was just too hard on my body after 7 months, and quite frankly didn't seem to be working fast enough for me. Thats when I went on Gemzar (I didn't have Avastin) and it took awhile to work but it did. It kicked butt in my lung mets, I just had my reg. scans done and a chest x-ray (for another surgery-the foot) and all is still clear.Thank God..I wish the same success with Gemzar if thats the route MD Anderson takes you. Clearing your head around all of this is not easy to do...I never tryed the cheetos method though, I'll have to try that one. Best wishes and prayers with all thats ahead of you. Hugs KLynn",
      "MessageIndex": 2,
      "PostDate": "09/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703664",
      "Title": "Xeloda Crappola Watson Watson"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 25, 2008 04:35PM KLynn wrote: YESSSSSS, I'm ready to quit too...Just too tiring all the time, s/e's, blood tests scans, treatments, doc appointments,  thinking and dreaming about it everyday, you name it I'm tired of it...It's been a long 8 yrs.Then again what the alternative???? I do thank God everyday for each day I get, BUT I'm still TIRED and SORE...I long for the days before I had b/c.....Hugs to all my b/c sisters...Hang in there...KLynn",
      "MessageIndex": 34,
      "PostDate": "25/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721737",
      "Title": "I quit... Fitztwins ozzie2"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 21, 2008 01:17PM KLynn wrote: Stephaine,  I said a prayer for you today in Church...I lite a candle....I know God heard me, I will coontinue to pray for you...Praying the pain will subside, and you can get some peaceful rest..Be strong..Hugs to you Klynn",
      "MessageIndex": 29,
      "PostDate": "21/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721550",
      "Title": "Morphine all day everyday - Things are getting serious TripleNeg lewisfamily503"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Mar 19, 2008 10:33PM KLynn wrote: OH ..     I'm so very sorry for your loss. There are no words any longer. Prayers to JoAnnes family and friends. We have lost another beautiful lady. The tears just seem to keep coming. God Bless you  ...She truly loved her family and was so very generous here with her support and advice. JoAnne will be missed very much . Hugs Klynn",
      "MessageIndex": 2,
      "PostDate": "19/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702566",
      "Title": "Fare Thee Well Love.... joannes_brother lewisfamily503"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jul 14, 2009 12:52PM KLynn wrote: Fantastic Janis.... this was the news we were waiting for....Stable is good.......Now try and relax and enjoy the next 3 months until the next scans, it's the best we can do for ourselves...by then summer wil be over and you wil have had a nice break.....AWESOME....KLynn...xo",
      "MessageIndex": 22,
      "PostDate": "14/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737391",
      "Title": "STABLE!! Fitztwins MJLToday"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jun 17, 2008 10:37AM KLynn wrote: Hey there Kara,     Don't know where you are in Jersey, but I'm also a hairdresser, (well not working in a salon anymore, bu always a hairdresser)....You can put the ASH blonde temp. through your hair now, it will cut some of the red... The temp colors don't last long, but it will last a few shampoos, then you can have perm.. colorput through in about 6 weeks..How this helps, if you're close I'd take a look at it for you,, You could also ty a color mousse for special occasions, if you don't want to color yet, just don't get caught out in the rain LOL ...Hugs to you, Klynn",
      "MessageIndex": 6,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707368",
      "Title": "Hair Color Mistake Kara Kara"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 22, 2015 05:37PM KLynn wrote: Hi ladies....I have a question have any of you had cyber knife on any of your lung tumor mets....I have a consolation tomorrow with a new rad/onc. ... One of my tumor sis 5.2 x 2.2 cm and my doc feels it might just be time to get rid of this one...I still have a few other smaller rumors, but this one is the one he is concerned about....I had RFA of my other lung back a few years ago...and it worked ..nothing has lit up in that area since..only problem with RFA is where the tumor is located...I also had to stay an extra night because I had a small leak...but otherwise it was an easy procedure....much more so than most things I have had done...AND I'm with GatorGal, I had my lung only drain once, it was last March, and it was the most painful thing I have ever had done..I had pockets of fluid so they had to put in leads into the two different spaces...they think they must have rested one on a nerve, because when it started to drain I got such stabbing pain that I couldn't stand it...they gave me all kinds of pain meds, to which I vomited on top of all that pain...I had the sweetest intern that stayed by my bed for 5 hours...he was afraid to leave me...I will NOT have that done again...I I will do everything I have to to prevent any plural effusion again..including this cyber knife if he thinks it will help...and of course my fluid from the plural effusion came back positive for more cancer cells...I can't seem to catch a break...I have been on the boards for years now...taking a break at times..but I have been doing this a very long time..141/2 years since original dx, and 9 years of it being stage 4 ....I'm so tired....anyway...any thoughts on the cyber knife on the lung would be helpful...thanks..K....",
      "MessageIndex": 1342,
      "PostDate": "22/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 28, 2008 09:17AM KLynn wrote: Hey Steph, Thinking of you and hoping you are have a few good days...Post when you feel up to it, would love to hear from you...Hugs KLynn ",
      "MessageIndex": 52,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723339",
      "Title": "How long will you fight? TripleNeg pinkpig"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 15, 2007 12:26PM - edited Oct 15, 2007 12:30PM by KLynn Hi I was first dx in 2000                                                                          Mets to lungs in 2005                                                                     1) Taxotere and Herceptin for 3 months-- markers still rising  2) Xeloda and Herceptin for 7 months good but slow results, I asked doc to take me off after too many se's and  many dose reductions 3) Gemzar and Herceptin for 1yr now , great results but again slow results, Its been a total of almost 2 yrs on chemo again this time, hoping to come off of chemo soon and stay only on Herceptin. I am trip. positive  I also had hercptin besides other chemos for 1 yr. back in 2000. Take Care KLynn",
      "MessageIndex": 19,
      "PostDate": "15/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692828",
      "Title": "Order of Chemos received BrandisMom cats_love_me"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 25, 2008 06:15PM KLynn wrote: Hi Steph, So sorry you have to even think about this at all.....You have always been such an inspiration to everyone here, even in all of the pain you are in, you still manage to comfort and care for others...You are so amazing, I hate to think of you in so much pain.My heart hurts for you... Hoping the headaches subside soon...I'm with Fitz on this, I think you will just know when it is enough..I also have days that I think about just stopping treatment, but like you I push on for my boys...I can say that my mother fought harder than anyone I know, she was afraid to die, and I didn't think she would ever stop fighting. She did say enough was enough, she was just too tired. And I think that is what will happen to each of us, but not yet.So if you have the strength keep fighting,  please know that you are such a valued member here, and many look forward to your postings..I will light another candle for you in church tomorrow, because you are sooooo right GOD is Able....Thank you for being you...And thank you for reminding us that faith is what matters...Hugs dear friend KLynn xoxo",
      "MessageIndex": 37,
      "PostDate": "25/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723339",
      "Title": "How long will you fight? TripleNeg pinkpig"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jun 18, 2009 07:47PM KLynn wrote: Good  no GREAT healing vibes coming your way..... I just saw this,  I will keep you in my thoughts, hoping for a quick hospital visit, and home to recover with no problems.....be comfortable and rest up....strawberry jam soundyummy this time of year...Hugs Klynn",
      "MessageIndex": 18,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736081",
      "Title": "WendyV needs our support katie11 heatherpalmerton"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 8, 2009 08:24AM KLynn wrote: My condolences to Maya's family...Rest in Peace new angel..KLynn",
      "MessageIndex": 2,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732108",
      "Title": "Maya1 is also gone ICanDoThis ElaineD"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Dec 23, 2008 06:04PM KLynn wrote: Hi Kasey,  Yes it makes so much sense to me..I tried so hard to explain that feeling to my nurses and no one ever understood me..The only way I could explain it was that I wanted to get out of my skin and body..I get the same way, and no one ever knew what it was, first they thought the benydryl, then the hercp., They rushed me in the office from treatment to do an EKG, but I had told them it wasn't my heart, and it wasn't racing, it was just this AWFUL feeling, and you're right it drives you crazy..I now think it was the steriods all along..I found that if I slept when I came home from my treatment, it would make it worse. I was better if I walked it off, or worked off the steriods..I would flip and flop around in the bed like a fish out of water, tring to get comfortable..I now  take benydryl at home before I go for my treatment, not in the iv..I still get the steriods in the iv, and get that feeling from time to time still..I also found that if I don't eat much that day it isHope  better, which isn't easy to do with all the steriods..Then there is the flush face all day the next day...grrrrrr....I have to say I do get a splurge of energy  the next day, and seem to get a lot of cleaning done.Hope you find some relief,  xanax seems to help alittle too. Happy holidays to you and your family...Hugs KLynn",
      "MessageIndex": 3,
      "PostDate": "23/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726303",
      "Title": "Need some quick advise please Kasey lovinmomma"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "KLynn wrote: Hello everyone, I received a message yesterday from Patty4-(-Patricia A. Finnegan) husband that Patty had passed away on 3/26.... He said it was very sudden,  that she had extremely aggressive and rapid progression to the liver.It was very rare to be so rapid..Her family is still in shock over her death.Patty was only 42 yrs old... She leaves behind her husband Martin, and 4 young children.Please pray for their healing at this difficult time... A quick note about Patty, I had the privilege to meet Patty at Kelly's house back in Jan..She was so lovely, friendly , happy and all smiles...She truly had a beautiful soul..She talked about her children , and her concerns for them.. .You can see a picture of Patty on the---This is the \" What would you like to bring to the Pahtay\" thread...She is on page 4 in the 7th large picture, she is wearing a white blouse..You can she her beautiful smile..... You can view her obituary on legacy.com -search Patricia A. Finnegan God Bless Patty, and please watch over her children and family.... Patty will be added to the \"In Memory\" of list.. My condolences to all who will miss her ...KLynn  How lucky I was to have known someone, that was so hard to say goodbye to.... Dx Stage IV, 6/17 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732097",
      "Title": "Our Newest Beautiful Angel--Patty4 KLynn badboob67"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 8, 2009 04:54PM - edited Jan 8, 2009 05:03PM by KLynn Luann, First of all A BIG HUGE HUG to you strong sister..Then another for your wonderful son, fighting for all of us, and coming home safe....Truely wonderful..You can't always put on the happy face, even if it is good for the facial muscles to keep you young looking, sometimes even those muscles get tired and need to rest...So let the face rest awhile and NO frowning, not good for the facelfting..LOL. As far as the get together in NY, I wish you were coming too, I would love to finally met you, but I promise I will have a big summer bash at my new home...I just had a few friends here before the hoidays, the house is coming along, but by summer we should have a pool, and I intend on hosting and giving Kelly  a break..You will be missed on the 24th but we will lift a glass to all the sisters who couldn't make it this time..Your doc sounds like he is really caring and wants to do whats best for you, that's the most impotant thing right now...Your health should come first, then your son and grandbabies, and don't worry about the dil (her loss- to loose such a wonderful family).My bet is she will come back begging for forgiveness from you and your son..Doesn't seem very fair for him to be fighting for your country and have to come home to this, but I'm sure he is a strong young man, and will find the support he needs from you..Praying the tumor markers are out of whack, and that the cancer has come to a halt..Praying for a safe trip home for your son. And praying for his happiness in the future. Please pm me is you need to talk more, remember no pouty faces.. Much love  and hugs KLynn",
      "MessageIndex": 7,
      "PostDate": "08/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727024",
      "Title": "Frustrated and Blue LuAnnH Isabella4"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 9, 2009 04:51PM KLynn wrote: Hey Luann,  Glad to hear you are feeling better today....Go out and get some of that fresh air you wanted, but bundle up, it's darn cold here...Glad you were able to find your big girl panties, I was thinking of doing the same, cleaning out my undie draw, I only have granny panties,  they really are pityful..I don't even know when it happened..One day I had beautiful bras and panties, even sexy ones. Now I have old white granny panties, ughhhhh..I think it happened one night after they took my boobies away but for the life of me  and my chemo head I can't remember..I think I'll take your advice and get some fresh air, and go to the mall for new undies..My husband will fall to the floor if he sees me in anything  else, heheeeheh  Still need ones that will hold in those extra chemo pounds I have though..Feel better friend, and get ready for that wonderful son..Hugs KLynn",
      "MessageIndex": 39,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727024",
      "Title": "Frustrated and Blue LuAnnH Isabella4"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 7, 2009 12:26PM KLynn wrote: I forgot to say that I have Patty's address if anyone would like to send a card...Just send me a message and I will send it to you... KLynn...",
      "MessageIndex": 3,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732097",
      "Title": "Our Newest Beautiful Angel--Patty4 KLynn badboob67"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 19, 2008 07:34PM KLynn wrote: LuAnn,  I like it...Doing the stable boy, not bad at all....LOL  sounds better than NED to me Hugs Klynn",
      "MessageIndex": 15,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724724",
      "Title": "Results in- can I celebrate this? SunshineSmiles pinkpig"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 19, 2008 06:00PM KLynn wrote: Hey Susan, I was also affraid to come off of chemo, but boy did I need the break after 2yrs. of chemo for recur...I was also told STABLE,  never NED....My mets were to my lungs, so I guess they always see something there, but no progress..I still have spots or whatever they call it there, but it's been 1 yr now and I just had my scans, still stable was my report..The onc, said that the radiologist called himself he was so happy with my scans..But there are still \"things\" floating in my lungs. I don't know, I don't really get it, BUT I really trust my doc, and that's what matters most. So I have been happy for the last year to only be getting my herc, treatments and my lupron shots... Remission was also a word used, I guess that's the best I get at this point.. I would take the break if the doc is comforable with that.. Build yourself up strong again, in case you need to restart..I don't think it willl grow out of control in the short time until new scans.. Hey, I actually like the word stable..there aren't too many people in my family that are stable (if you know what I mean LOL)... Hugs to you and I hope you get to enjoy your break...Klynn  ",
      "MessageIndex": 13,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724724",
      "Title": "Results in- can I celebrate this? SunshineSmiles pinkpig"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Feb 29, 2008 07:52AM KLynn wrote: Hey Ruth,     Wow, I can't believe I just read this, I'm having something very similiar happening right now. I just went for my 3 month scans (I'm also stage 4, in remission at the present time) All scans came back okay except for something going on with my urteres (both sides). Doc says it isn't cancer not to worry but I have an app. for an ultra sound, cat scan, and to see the urologist. They are saying that there is some kind of blockage, but they don't know what, it doesn't look like tumors or stones. (So I'm thinking scar tissue as you have) I have also have some pain with this almost like a UTI, but I had a test and it was neg. I was also on Cipro for a week with no relief.     Now for my history I have not had any raditation to the sternum or ribs, but had radiation 71/2 yrs ago to the right breast area. I was on Gemzar  (besides other chemo drugs) for over a year between 2006 and 2007. I also get herceptin every 3 weeks , I've had many yrs of herc. Just wondering if the Gemzar is the cause of this blockage, and that it builds up in the urteres after time. I know after reading your post I will not be getting a stint thats for sure. I have bleeding problems already and that just doesn't seem  the way to go.      Well, hope all works out for you and you find some relief and comfort. How annoying is this with everything else we go through? My mother had kidney failure due to some of her chemo drugs (also bc) and she had to endure 3 yrs of dyalisis besides going through chemo. I have already told docs I'm not going that route,  believe it or not dyalisis is soooo much worse than going through chemo. That's when I stop all treatments and save the kidneys. Hopefully it doesn't come to that, they say the kidneys look good and plump and normal shape. I'll keep you posted as to what happens with the urologist, which is next week some time. Take care of yourself and hugs to you-------- KLynn",
      "MessageIndex": 3,
      "PostDate": "29/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700569",
      "Title": "Side effect from Radiation?? Ruth1 snowyday"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jun 23, 2009 04:55PM KLynn wrote: Thanks so much everyone...one of my other friends from here called me peevish...hmmm guess so..I think she is right...quite testy...... lol.... Heres the latest up date, went to onc. today for yet another clearance, and he didn't like the fact that I feel so crappy, and that I 'm black and blue all over, and my hemoglobin was 10.2 hmmmm. So off to the hospital for more blood tests, looking for something with my platelets  and timing..may have to treat me with something first before surgery, or said something about surgeon having the right stuff in the or.OR....great....I'm getting the feeling that surgery may be pushed back...Or they could just give me back my blood and leave me alone.....I have a headache, and shortness of breath, I think all from low counts... Thanks for the early Birthday wishes....KLynn  talk to you all soon..xo",
      "MessageIndex": 19,
      "PostDate": "23/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736324",
      "Title": "So here's the scoop about me this week coming...ughh. KLynn Marple"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 27, 2009 11:15PM KLynn wrote: My last suggestion would be to have your hubby fan your bottom all night lol.....good luck KLynn xo",
      "MessageIndex": 12,
      "PostDate": "27/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733216",
      "Title": "UTI? KellyC lillysmom"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 27, 2009 11:02PM KLynn wrote: funny thing is mine came on quickly too, and when I mentioned it to the doc, ...of course they say it has nothing to do with the drugs...yeah ..right.....KLynn xoox",
      "MessageIndex": 6,
      "PostDate": "27/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733216",
      "Title": "UTI? KellyC lillysmom"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 27, 2009 11:10PM KLynn wrote: Not your kidneys, just your resistance down, and the germs take over...little f**kers.... I hate the feeling of having to go, and you sit there, tinkle ... nothing... try to stand up..and the pain starts..then you sit back down...nothing..and up again..ughhhh..I feel for you sweetie.. just another side effect we live with..it's not fair...IT\"S NOT FAIR... try not to worry , it will pass but the in between really stinks...KLynn xoxoxo",
      "MessageIndex": 10,
      "PostDate": "27/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733216",
      "Title": "UTI? KellyC lillysmom"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 28, 2009 04:07PM KLynn wrote: Kel I'm still thinking it is the Lupron, we have the same common denominator....I'm telling you stick with the cranberry pills...I feel so much better since starting them... love ya..feel better...K....",
      "MessageIndex": 27,
      "PostDate": "28/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733216",
      "Title": "UTI? KellyC lillysmom"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Dec 28, 2014 04:28PM KLynn wrote: I miss my friend Kelly every day..she was bigger than life...a spirit like no one else I have ever met...we talked almost every day, she truly made me laugh through very tough times...We met through this forum, and I am thankful every day for it...I could go on and on about her,...xoxo...K...",
      "MessageIndex": 30,
      "PostDate": "28/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824157",
      "Title": "Kelly C is an Angel dmacw bhd1"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 26, 2008 06:21PM KLynn wrote: Deb Thinking about you !!!!!!! Hope everything is getting worked out.....Hugs KLynn xoxox ",
      "MessageIndex": 172,
      "PostDate": "26/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 3, 2008 09:41PM KLynn wrote:  Deb good to see you posting.....Hoping each day is bringing you closer to healing...That double vision crap has got to be getting old...Keep your spirits up, you are so special to everyone here..Hugs Klynn",
      "MessageIndex": 285,
      "PostDate": "03/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 27, 2008 08:42AM KLynn wrote: Fantastic news Deb, so happy to hear there is already improvement.. That has to be a good sign...I admire you for getting rid of the anger, for your own health and peace of mind, you are truly one incredible woman ( hear you roar !!!l lol) I pray with each day you have huge leaps of recovery..God Bless you dear friend..Hugs KLynn",
      "MessageIndex": 195,
      "PostDate": "27/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 10, 2008 08:01PM KLynn wrote: Hey Robin,     Sorry about your news today. I'm not sure about the time results on Gemzar, I've never heard that before.. I can tell you that Taxol didn't work for me on my lung mets, then Xeloda didn't seem to be doing the trick either, if it was working, it was very slow and just a terrible drug for me..Then I started on Gemzar, I took it for almost a year.It did work and I have been off of it for about 6 months, I still get herc. every 3 weeks. I just had all of my scans and so far so good, no one really knows for how long I will be in remission, but it sure is nice to come off of chemo after 2 yrs. There were days that I never thought I would be off of chemo again, the Gemzar was really not too bad as far as the chemo drugs go..Some sinus problems, alittle surgery...     I hope that you find the same results with Gemzar, or whichever drug you get next. I will be praying for you, if you need to anything please pm me. Any questions, I'd like to help.  Best wishes KLynn",
      "MessageIndex": 16,
      "PostDate": "10/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703755",
      "Title": "To coin a phrase from Watson... taxol crapall RobinWendy Maya1"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "KLynn wrote: Hey ladies.... I know I've been a bit quiet here lately, I just seem to not have any extra time on my hands lately...I'm having more surgery on this Friday coming...tried to avoid it at all costs but it seems to be the logical answer at this point...Finally having my ovaries and tubes removed..not sure about the uterus yet (waiting to hear what test results showed)..and probably won't know that until I wake up....Had all my pre-op stuff done last week, and had to go and give my own blood ahead of time just in case...yep, just in case I bleed to near death as I usually do with surgery...They weren't really sure they should take two bags of blood the other day, iron was only at 12.5..so the second bag may not be able to be used, if the iron shows to low anyway..Won't know that until the hospital either...Hoping to not have to use it either way...but some of you may remember, I tend to bleed ( for no reason --other than I pump my blood very hard and very fast)...That would be why I tried to avoid the surgery in the first place, and put up with having lupron for over 3 1/2 yrs.....BUT...last scans showed some slight change in the nodules in my lungs...nothing much but  still change, meaning that the estrogen just isn't stopping enough...After all those shots one would think  I'd be done with estrogen...Only thing we could think of was to get them out finally, oh and start on the tykerb...which has been horrible..down to 2 pills a day instead of 4 because of the side effects...I've had a few days off of the tykerb because of the surgery, and my body feels so much better off than on.... In general I feel kind of crappy since giving my blood the other day, not sure if the iron is just too low, I have black and blue marks all over the place....Seeing my oncologist tomorrow, see what he has to say...Oh...forgot to mention that they sent me for my first bone density test before the surgery, and of course the lupron and probably all the other drugs has put me into osteopenia....Fracture risk moderate for spine, hips and femur...hmmm.....so after all of this we have to address that part of it...I'm sure my bones would be much worse off if my estrogen hadn't been so  high..It's all such a vicious cycle...I'd like to get off this merry go round for a bit, but I guess that's not really the option I want..... Say an extra pray for me tonight that I have any easy surgery, but then again I figure if  I don't wake up from surgery I probably don't even know it..huh ???? Surgery is Friday, my birthday Sat. what the heck was I I thinking when I planned this..??? Oh I know, July starts the beginning of the year with all the new deductibles and co-pays, amazing the things we try to keep straight...and save a few bucks...I'll keep you all up-dated on my results, hey I wonder how much the ovaries and tubes weigh ??? I could be lighter when I get done, dropping a few pounds...Hmmm  Take Care KLynn....xoxox How lucky I was to have known someone, that was so hard to say goodbye to.... Dx Stage IV, 6/17 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736324",
      "Title": "So here's the scoop about me this week coming...ughh. KLynn Marple"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jun 27, 2009 08:20PM KLynn wrote: Thanks Friends for all your thoughts and prayers... I think they worked better than anything else....No bleeding problems this time, surgery went pretty easy...although I forgot that feeling of being hit by a bus when you first wake up...Felt very much like my c sections....Incisions not bad at all, in fact tiny, without stitches, just glue..lol....OHHHH but the air...the air that they pump in there...what the heck ??? Did they think they were filling a blimp ???? The pain from the gas now is what is really bad...doesn't want to move...feels almost like it is up in my chest, the pressure s*cks...Moving around as much as I can to get it out.....I think it will be days before it budges with all the pain meds they gave me....oh well...it too will pass....ahahahaaa.... On another note just wanted to say, I had a visit from one of our \"sisters\"   here, she brough me the best paella I've ever had.... The friends that I've met here, in person and online are some of the nicest people I know...Love and kisses...Thanks again...KLynnxo",
      "MessageIndex": 36,
      "PostDate": "27/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736324",
      "Title": "So here's the scoop about me this week coming...ughh. KLynn Marple"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 20, 2008 09:42PM KLynn wrote: Deb......So happy to see you posting....You continue to amaze me..Hugs KLynn xoxo",
      "MessageIndex": 60,
      "PostDate": "20/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "KLynn wrote: Hey ladies.... I know I've been a bit quiet here lately, I just seem to not have any extra time on my hands lately...I'm having more surgery on this Friday coming...tried to avoid it at all costs but it seems to be the logical answer at this point...Finally having my ovaries and tubes removed..not sure about the uterus yet (waiting to hear what test results showed)..and probably won't know that until I wake up....Had all my pre-op stuff done last week, and had to go and give my own blood ahead of time just in case...yep, just in case I bleed to near death as I usually do with surgery...They weren't really sure they should take two bags of blood the other day, iron was only at 12.5..so the second bag may not be able to be used, if the iron shows to low anyway..Won't know that until the hospital either...Hoping to not have to use it either way...but some of you may remember, I tend to bleed ( for no reason --other than I pump my blood very hard and very fast)...That would be why I tried to avoid the surgery in the first place, and put up with having lupron for over 3 1/2 yrs.....BUT...last scans showed some slight change in the nodules in my lungs...nothing much but  still change, meaning that the estrogen just isn't stopping enough...After all those shots one would think  I'd be done with estrogen...Only thing we could think of was to get them out finally, oh and start on the tykerb...which has been horrible..down to 2 pills a day instead of 4 because of the side effects...I've had a few days off of the tykerb because of the surgery, and my body feels so much better off than on.... In general I feel kind of crappy since giving my blood the other day, not sure if the iron is just too low, I have black and blue marks all over the place....Seeing my oncologist tomorrow, see what he has to say...Oh...forgot to mention that they sent me for my first bone density test before the surgery, and of course the lupron and probably all the other drugs has put me into osteopenia....Fracture risk moderate for spine, hips and femur...hmmm.....so after all of this we have to address that part of it...I'm sure my bones would be much worse off if my estrogen hadn't been so  high..It's all such a vicious cycle...I'd like to get off this merry go round for a bit, but I guess that's not really the option I want..... Say an extra pray for me tonight that I have any easy surgery, but then again I figure if  I don't wake up from surgery I probably don't even know it..huh ???? Surgery is Friday, my birthday Sat. what the heck was I I thinking when I planned this..??? Oh I know, July starts the beginning of the year with all the new deductibles and co-pays, amazing the things we try to keep straight...and save a few bucks...I'll keep you all up-dated on my results, hey I wonder how much the ovaries and tubes weigh ??? I could be lighter when I get done, dropping a few pounds...Hmmm  Take Care KLynn....xoxox How lucky I was to have known someone, that was so hard to say goodbye to.... Dx Stage IV, 6/17 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "22/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736324",
      "Title": "So here's the scoop about me this week coming...ughh. KLynn Marple"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Dec 7, 2012 01:48PM KLynn wrote: Hey Janis...THAT IS GREAT NEWS....,!,!!!! Slow and steady, right...?? It gets annoying, just every once in a while waiting to see your doc get excited about something...my doc is the same...but slow and steady works great for us....!!..I also had regression in all but ONE stinking' spot in the lungs last time...hmmmm maybe there is a glitch on the scan machine, the PET scan is mobile after all....ha...My doctor wasn't really concerned over the one spot either, but thought it was odd...My numbers keep coming down, so I'm wishing the same for you with all the holidays ahead of us, MAY your Holiday present be a sound and steady stable report for the whole year ahead...!! I remember reading my biopsy reports way back with my initial dx...and it also said that my breasts were \" non impressive\" and \" unremarkable\" which I thought...how dare they...!!! They were quite remarkable thank you very much...!!!..I wasn't happy with their terms...lol...They really need to phrase that differently....Happy Holidays to you...!! KLynn......",
      "MessageIndex": 32,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797323",
      "Title": "So after my PET/CT scan my doctor said he was \"not impressed\" Fitztwins KLynn"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 19, 2008 06:04PM KLynn wrote: LuAnn, Heheee...Me too, very tired.... Hugs KLynn..... ",
      "MessageIndex": 16,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721482",
      "Title": "Long, but need your opinion LuAnnH mom2acat"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 19, 2008 05:29PM KLynn wrote: So Very True LuAnn !!!!!! I'd like to make a copy of your letter to give to most of my extended family (not my husband or children--they get it) but the rest of the family that keeps telling me not to talk that way, 'I'll be fine\" ---------I hate those words more than anything  else now... Does the rest of the world not understand what stage 4 cancer is,or do they just stick their heads in the sand??? Do they understand that stage 4 cancer IS terminal ??? Do they get it that there is NO cure for us??? Do they understand that we don't want to always put on the HAPPY face and pretend that everything is okay with us???? We don't want people to sit and wallow in sorrow for us , BUT for gosh sakes stop pretending that we will BE FINE....If one more person tells me I look great, I'm going to really let them see what I look like without spending 45 minutes in the bathroom before leaving the house, that would  really show them .....     LuAnn you couldn't have said it better... Thanks KLynn  Hugs to you.....",
      "MessageIndex": 14,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721482",
      "Title": "Long, but need your opinion LuAnnH mom2acat"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 27, 2009 10:59PM KLynn wrote: Hey Kel, I just started having them over the last few months, it can be really painful...with spot bleeding.. I've been to the urologist and all that crap too..Just what we need is another doctor..LOL.. I did start taking cranberry juice concentrate pills every morning and it really seems to be helping..The nurses recommended it, but I would check with your doc first..I haven't had the problem since..The chemo and the hercptin have really made my tract sensitive..I think the lupron and starting menopause adds to it..I drink tons of water too...I never found anything to help when the pain started though, maybe just sitting in a tub for a bit...I was in and out ot the bathroom all night on the bad nights...Good luck, hugs Klynn xoxo",
      "MessageIndex": 5,
      "PostDate": "27/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733216",
      "Title": "UTI? KellyC lillysmom"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 27, 2009 11:05PM KLynn wrote: No it isn't , and I hate to tell you , but you probably won't get any sleep tonight...I was in so much pain  that I thought about going to the er one night...Your best bet is to take something to make you sleep, maybe when you wake up in the morning it will be alittle better...I'm telling you if  you can have hubby go to the store NOW and get the cranberry pills..Not the drink..the pills...and then sleep..Love ya KLynn",
      "MessageIndex": 8,
      "PostDate": "27/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733216",
      "Title": "UTI? KellyC lillysmom"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 16, 2008 08:15AM KLynn wrote: HI Marietie,  I'm sorry for your loss,  I wish I had a good answer for  you..I lost my mother (my very best friend) in May of 2006 to B/C. I was at the time fighting my own recour of stage iv b/c...The holidays that year were hard , really hard.. I remember trying to get into the shopping mood, for my children, trying to make it SEEM like Christmas for them. I was in a store, and I don't know what came over me, I looked around and people were laughing and smiling, music, was playing throughout the stoe,  and in through the door came a beautiful mother and daughter holding hands (somewhenre around 50 yr and 25 yrs old). I just couldn't handle it. I wanted to scream \"What is the matter with all you people, don't you know we have lost such an improtant  part of this world??? \" I thought it best to leave...So I put everything down, and walked out, had mysself the hardest, longest cry one could have...I didn't feel much better that day, BUT I was able to have a nice hooliday with my family and remember her at my own time.. Thinking I would have a better holiday last year, I lost my father in law in Sept.(He was like my own dad--I have known him since I was 16) . So two years in a row of losing parent has been rough,and last year wasn't much better. My point being, not to make you sadder, or this hard for you, But to let you know, that you will have break downs, and days are going to be really hard. It just hits you at the most unexpected times. TAKE THE TIME FOR YOU TO GRIEVE AND DON'T TRY TO PUSH IT AWAY.  Don't apologize to anyone if you need to walk away and have a private cry. In the long run you will get through this.I hope you can find some special, happy times these holidays. I can't even imagine losing a child, my heart aches for you .....My mother was 65 when she passed, i was 45 at that time.I was dx at 38 way too young to have b/c. But your daughter she was only a baby..If you ever need to talk just pm me. Remember all the special times with her, go through pictures and videos, it does help..Hugs and my prayers to you KLynn  I hope this helps some...",
      "MessageIndex": 3,
      "PostDate": "16/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722867",
      "Title": "christmas and special days mpieterse VickiG"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 28, 2009 09:26PM KLynn wrote: Hey Kel,   Just a bit of a warning, if you wear contacts, the meds that cause your urine to be orange, will also stain your tears, and your contacts, so if you wear them (not sure if you do)..you may want to leave them out for a few days...So much to think about these days......ughhhhh xoxo KLynn...",
      "MessageIndex": 34,
      "PostDate": "28/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733216",
      "Title": "UTI? KellyC lillysmom"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "May 9, 2008 04:53PM KLynn wrote: Congratulations in advance LuAnn!!!!!!!     Praying the birth goes smoothly....Such wonderful news !! It may be hectic but nothing like those first few days of new life.. Best of all to you and your family.. Hugs all around KLynn",
      "MessageIndex": 12,
      "PostDate": "09/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705291",
      "Title": "Exciting News - Countdown to Grandson LuAnnH LumiPojo"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jul 1, 2008 07:36PM KLynn wrote: Hey Watson, I haven't talked to you in awhile,  sorry to hear about the lung mets...After a few different drugs onver the first year, I then swithched to to gemzar with my hercetpin..I was on it for almost a year together when I went into remission..So far so good and I have been off for about 9 months now , getting only herceptin every 3 weeks. If you have any questions you can pm me, I'd be happy to help answer if I can. I am very strongly her2 +, but I can't see why even being slightly her2+ wouldn't benifit from the herceptin. I think I will be on it for life, as long as I don't change my her2 status.Who knows what will happen when the lupron shots finally kick in, which I have been getting for 2 yrs and 9 months now.Not that it should change it, but my body has always reacted differenty to everything I've gotten. LOL..I hope you have great success with the gemzar and herceptin combo..Hope you're feeling good while on it, I handled them together much better than most of the drugs, mostly tireness.Take care and also keeping all fingers and toes crossed for you. Klynn",
      "MessageIndex": 11,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708373",
      "Title": "New Options Watson mthomp2020"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Dec 29, 2014 10:59AM KLynn wrote: bhd1, I don't mean to correct you, but you must have misunderstood her condition...Kelly may have been \" stable\" in her situation she was going through at the time...\" In the hospital\" ...but she hadn't been stable or in remission for a very long time...she fought for a very long time a very tough battle....She laughed and smiled her way through some tough treatments....Always keeping a great front for her beautiful children....She never complained, so I don't think many people realized how sick she really was....I just don't want anyone to think that one minute you get great reports, and next week you are gone....hope that clears it up a little....K.....",
      "MessageIndex": 34,
      "PostDate": "29/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824157",
      "Title": "Kelly C is an Angel dmacw bhd1"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 20, 2008 09:50AM KLynn wrote: OHHHHHH Deb     I am so sorry you have to go through all this \"extra needless crap\"....My heart just breaks for you and your family. I just can't even think about how much you have endured, it makes me cry..I will continue praying for you along with all of your wonderful sisters here that love you so very much...I know you have the strength to get through this, and kick some\" sorry nerosurgeon ass.\" They better hold on when you heal and come back fighting.....With you in heart and spirit, wish I could be there to help in some way..You hang in there and let your family help with the docs..Hugs KLynn xoxoxoxo",
      "MessageIndex": 10,
      "PostDate": "20/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 30, 2008 04:00PM KLynn wrote: DEB THINKING ABOUT YOU !!!!!!!!!! Hope you; are feeling better Hugs KLynn",
      "MessageIndex": 259,
      "PostDate": "30/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jul 7, 2008 06:36PM KLynn wrote: Hey Tracy,   I'm right along with you about being pissed off....And I don't have an answer for you as to when we get a break with this,,, enough already...I will be thinking of you , and praying for your markers to start going in REVERSE..This really gets to be old doesn't it, the tests, the scans the blood work, treatment after treatment, new drugs after new drugs...I wish I could just reach out and hug you, because I really know just how you are feeling, it gets hard trying to stay positive all the time, when you are just physically exhausted from all of this. Please know that I think of you often, and hope you will stabilize and get some time away from this every day.. If you want to talk, I am here, just pm me...Warm hugs for you ..KLynn",
      "MessageIndex": 8,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708393",
      "Title": "markers again Tracy1964 Irina"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jun 28, 2009 09:14PM KLynn wrote: Hey Jennifer.... I only started tykerb in May, and have been off of it for the last 2 weeks due to surgery BUT...and I mean a BIG  BUT...I have had friends tell me that they have splitting of the skin on the finger tips..I asked the doctor's office and they said they never heard of it, only if there is Xeloda added to it....Every time I ask them about different s/e's I have, they always say that it's not one of them..It's never the drugs ..right ??? I was on tykerb for about 7 days (4 pills a day) and then had to reduce to 2 pills a day because of tummy issues...I did start to have some sensitivity on the finger tips, and started using tons of creams at night...The skin on the side on my nails got infected in a few spots too...very tender...I wrapped them and put on neosporen...I have one black toe nail right not too...I didn't think about it being the tykerb until now, and I don't remember hurting or banging it...It got sensitive when I was taking one of my walks one day, and has now turned colors, about to fall off...eeeewwww I know..I have never in my life had a discolored toe nail until now...And now it's time to start the tykerb again in a week or so..yippy....I too want this to work so will put up with this crap..I get herceptin every 3 weeks too...good luck, I'll keep watching for your  up dates, and let you know what other side effects I get....take care KLynn",
      "MessageIndex": 1,
      "PostDate": "28/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736640",
      "Title": "Tykerb causing me huge nail/finger issues JeninMichigan AusAla"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jun 5, 2012 01:04PM KLynn wrote: ",
      "MessageIndex": 47,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788587",
      "Title": "I wish some of you knew Fitztwins Iwillwinthisbattle"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 15, 2008 12:42PM KLynn wrote: Hi Stephanie,     I'm so sorry to hear about your latest dx. I've have always enjoyed your positive posts and positive attitude. You are one of the strongest women I have come across here. I know this is not going to be easy for you. I hope your strong connection with God and all of your family and friends is what it takes to gently guide you through this set back. You will have so many of us here praying for you. Lets nip this right now, and get you back to feeling good again. As a very smart lady said--\"God is able\" oh that was you..Heheehehe. I do believe God is able, and have gone to your saying many times.With so  many prayers coming your way, I know he'll hear us all. Hugs KLynn",
      "MessageIndex": 5,
      "PostDate": "15/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704020",
      "Title": "Dx with Brain Mets Today TripleNeg snowyday"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 22, 2008 10:32PM KLynn wrote: OH Stephaine......     I am so thrilled with the news of the clear spinal fluid...You are such a strong person...I will continue to keep you in my prayers throughout your raditation and whatever treatments they may throw your way..Your faith is such an inspiration to so many here, truly makes you believe in the power of prayer. With much love , I pray for you ...Hugs Klynn ",
      "MessageIndex": 143,
      "PostDate": "22/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704020",
      "Title": "Dx with Brain Mets Today TripleNeg snowyday"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Aug 4, 2012 08:22PM KLynn wrote: Older Italian man sitting next to me is chemo room......\" where do you have cancer...??? You look so good, you can't be that sick.\" me....\" I have breast cancer\" Older man....\" Oh, well you can have one removed and still have one left for your husband, he only needs one..\" me...\" I've had both removed...\" older man...\" Oh,\" and precedes to look at my chest...I wear prosthetics.. Notice I didn't say older GENTLEMAN....LOL.. I honestly wanted to say, well, he can play with my fake ones any time he wants..I can just hand them to him....BUT I was still so amazed at his ignorance.... Another time, my mother in law was telling a story of her car that they had years ago, a wood panel station wagon, and said to me, \" yeah, it wasn't a good car though it rusted and rotted away like cancer....\"....SERIOUSLY...????...my poor father in law turned white then grey...Poor guy.... I also get, \" just pray, just pray, it will help, and stay positive\" from my mother in law.....really..??? Ya think I'm not doing that everyday...??? Every treatment, every test, every time I hear of another woman with BC...or when another passes here....ughhhh.... I guess we have all heard our share...I guess we should just laugh at the craziness....!!! KLynn...<3.....",
      "MessageIndex": 139,
      "PostDate": "04/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Aug 10, 2009 11:42AM KLynn wrote: Ohhhh Heidi, First off I'd like to say I'm so sorry for what you are going through....I don't have any experience with any of the brain area mets, but would like to offer you some support...My mother had so many areas of b/c and my mets are to the lungs, I feel like I know so much, much more than I ever wanted to know, but I don't really have any experience with brain mets...It is my biggest fear...I read here about so many of our friends facing it, going through surgery so bravely, and doing really good...I don't know if faced with it if I could do it...I'm not as brave as these ladies... I;m happy to hear you have so much more fight in you..Our children are certainly a strong pull for us...If you are feelling that you need a week off first, maybe you should take it..This way you can have one really good week with the kids before the big fight starts again, it just may be good for your whole overall being...I will be thinking of you and praying for you, and will be here for you if you need to vent...Best thoughts for you and I hope someone with more views on all of this can help you more than I did...Hugs KLynn..",
      "MessageIndex": 1,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 3, 2008 07:56PM KLynn wrote: Hey Kasey, Good luck with the scans, will be thinking of you tomorrow...That time sure seems to creep up fast doesn't it????  When do you see the doc for results??? Hopefully you won't have to wait too long..Hugs KLynn",
      "MessageIndex": 3,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723849",
      "Title": "Scan Time Kasey LuAnnH"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 5, 2008 12:20PM KLynn wrote: Hey Kasey Thinking of you..... Hoping you get good results today, good idea to call in, I usually wait until I see the doc and that can be really nerve wracking..Hope this lifts your spirits, getting goood results makes fighting the fight all worth it... May this be a good day....KLynn xoxoxo",
      "MessageIndex": 14,
      "PostDate": "05/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723849",
      "Title": "Scan Time Kasey LuAnnH"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 5, 2008 09:29AM KLynn wrote: Hi Molly,  Sending positive vibes your way for a clear mri....Hopefully you have a sinus headache, and a good does of antibiotics will get you cleared up..Every ache , every pain is so scary,  it's hard not to think the worst, but hang in there, prayers are being said for you.. Hugs Klynn",
      "MessageIndex": 7,
      "PostDate": "05/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722270",
      "Title": "Scared that I have brain mets mollyboc ilovemysweetmomma"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 7, 2008 02:18PM KLynn wrote: Hey Kasey,  I'm going with everyone else on this one......The Doc would have called you if it were bad news....Thats the story and we're sticking to it LOL !!!!!!  It still urks the crap out of me that they can't just get on the darn phone when you have called over and over again, I know they are ALWAYS busy, but its not like you need them everyday, just every once in awhile, so today should be your turn....darn them... .I think its a great idea to take time off every once in awhile, when you're \"LIFERS\" like we are, there's just no end to this, we need to listen to our own bodies and take a rest..I don't think the cancer is going to go on a frenzy and get out of control in just a few weeks, and that few weeks does the heart and soul soooo good...Have a good break, and find something fun to do...Hugs KLynn",
      "MessageIndex": 28,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723849",
      "Title": "Scan Time Kasey LuAnnH"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 27, 2007 09:06PM KLynn wrote: Congratulations Ausborn he's beautiful!!!!  Ahhhhh the smell of newborn babies, theres nothing like the smell of their little heads. Boy do I miss those days of holding a newborn for hours, watching them breathe and sleep so peacefully. Hugs to you and your family . You put a smile on my face , thanks KLYnn",
      "MessageIndex": 6,
      "PostDate": "27/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692857",
      "Title": "More Off Topic 'Fun' News AusAla jacqniel"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 17, 2008 01:07AM - edited Apr 17, 2008 01:08AM by KLynn Steph,     I'm so sorry again,  the news really hits hard...Will be praying for you and thinking of you when you go for the spinal tap.     Please God we need you  to guide, hold and heal our dearest friend Stephaine, she is a woman of such strong faith, she is in your hands......     Forever Faithful..Klynn ",
      "MessageIndex": 85,
      "PostDate": "17/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704020",
      "Title": "Dx with Brain Mets Today TripleNeg snowyday"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Dec 17, 2008 10:52AM KLynn wrote: Hey there Janis, I haven't  been on in the last few days, so I just saw this, wishing you a speedy recovery and a very UNevenful surgery...Let's make sure you are home and resting for the holidays...Keeping you in my prayers and will be thinking of you tomorrow all day..Come back to us with really good news....Love and hugs KLynn xo ",
      "MessageIndex": 28,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725990",
      "Title": "I will be offline for a few days.. Fitztwins LuAnnH"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 15, 2009 08:46PM KLynn wrote: Nope Flalady not much dairy at all...I hate milk, only use a little in my tea or coffee.( funny thing is that when I was pregnant with my kids I forced myself to drink it, I had to put it in the freezer until it was so cold, and then I could get it down..).No ice cream too fattening, and as far a cheese, not that much either...My hubby is doing Atkins so there is enough cheese in the house to feed an army, I like it but again too fattening..I just may try the detox thing, I'll have to look around for some info , thanks... funny thing is I eat a ton of grapefruit, it was suppose to help the metabolism, and all that crap, until all the reports came out about grapefruit and breast cancer....oh well ..can't give up everything.. Hugs KLynn",
      "MessageIndex": 8,
      "PostDate": "15/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732534",
      "Title": "Need help with Stage 4 and diets..Jenny/WW ??? KLynn KLynn"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 10, 2011 10:59PM KLynn wrote: Hey ladies....Over 11 yrs. Since originally dx...and dx in 2006 with mets to the lungs..that's over 5 1/2 yrs with mets...keeping them contained to the lungs so far....haven't been Ned...but stable at different points...right now I'm on the progression side, so I'm waiting to start a new trial....going strong and living my life.. I refuse to give up ... And have great faith in my doctor and the valuable information from the women here....best wishes to all....KLynn....",
      "MessageIndex": 42,
      "PostDate": "10/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774391",
      "Title": "How long since your stage 4 diagnosis? Iwillwinthisbattle harvey"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Aug 16, 2009 02:12PM KLynn wrote: Hey Heidi..Thinking about you today, hoping you are settleing in with all you have to think about and all that is ahead of you...Not sure that any of it gets any easier, but maybe all the scary stuff in your head is worse thinking about that it actually is going through with each treatment....Just hoping things get easier, and you have some relief..Strength...feel better sweet sister...Hugs KLynn",
      "MessageIndex": 96,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Dec 14, 2007 09:17PM KLynn wrote: Geeta, Shrinkage is a wonderful word!!!! ( well maybe not to men Hehehe) Very happy to hear your good news, and yes you have been missed here. Hope you have wonderful holidays, will be looking for your posts when you are ready again, Take care of yourself, Hugs KLynn",
      "MessageIndex": 9,
      "PostDate": "14/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696878",
      "Title": "Where's Geeta? momtothree katie11"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 27, 2007 02:21AM KLynn wrote: Erin, Now that's a wonderful site!!!! Who doesn't love puppies. Congratulations on your new additions. I  have a wonderful yellow lab , she is just 2 and is the sweetest dog ever. If I lived closer I might just consider another dog. I can't believe i just said that , remembering those first few puppy months uhhhhhh, and on chemo. You have a beautiful liter there , good luck with them. Take care and hugs to you and mommy doodle. KLynn",
      "MessageIndex": 1,
      "PostDate": "27/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692766",
      "Title": "Fun (non cancer related) news ForTheMoment ForTheMoment"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 16, 2007 12:09PM KLynn wrote: Hang in there Carol,    The waiting is always the hardest part, I see the doc tomorrow. This has been going on for the last month or so, finally glad to see him . Keep in touch and let us know how you're doing, even before you see him if you need some ears to listen as it gets harder each day until you see the oncologist. Always nice to meet someone here, there are so many caring friends here that have been through the different things we have to indure during our way back to health. Feel better and hope to talk to you soon. Take Care KLynn",
      "MessageIndex": 14,
      "PostDate": "16/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693731",
      "Title": "Diagnosed yesterday with BC tumor spread to lungs NYCarol bellywelly"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 17, 2007 03:29PM KLynn wrote: Well Ladies,   The word is REMISSION as of today. I just saw doc and have been told no more chemo.Yahoooooey,  I will be getting my herceptin every 3 weeks if I can tolerate it , if not back to weekly herceptin, either way the chemo did its job, no more mets to the lungs. After almost 2 yrs time I am in need of a break, it couldn't have come at a better time. The holidays will be in no time and it will be nice to  not be planning everything around my chemo and its se's. i will continue to pray for all of you , as i believe that prayers,(from all of my friends here and family and friends at home)  strong drugs and a fabulous doctor have gotten me here. Hugs and kisses KLynn time to celebrate!!!!",
      "MessageIndex": 20,
      "PostDate": "17/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693731",
      "Title": "Diagnosed yesterday with BC tumor spread to lungs NYCarol bellywelly"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 17, 2007 03:30PM KLynn wrote: Tracy , I'm thinking and praying for you hon. Take care KLynn",
      "MessageIndex": 21,
      "PostDate": "17/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693731",
      "Title": "Diagnosed yesterday with BC tumor spread to lungs NYCarol bellywelly"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 5, 2009 08:36PM KLynn wrote: Hi Dana, Yep, another lung mets lady here..I was dx in 2006 with lung mets. Original dx in 2000. I didn't have any symptoms, other than being alittle more tired than usual..I was on a few different chemos over the next 2yrs, with herceptin all along. I had too many spots for any surgery, and didn't do  any rads for the lungs. I have been in remission for about a yr and 3 months now..Only receiving herceptin every 3 weeks now for the last yr and 3 months. I will be on herc. for life as I see it. I don't know how  long this remission will last, and most days I feel really tired, so I think hmmmmmmmm????? But I get my scans done every three months or so, and blood work regularly. Everything seems to be going okay..Keeping fingers crossed. My doc  has always been very aggressive with my treatments..Wishing you the best.. Hugs KLynn  if you have any questions just pm me..Happy to help a sister any day...",
      "MessageIndex": 17,
      "PostDate": "05/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726633",
      "Title": "Looking for my \"Lung Mets\" sisters.... WingsofHope grammadebbie"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 6, 2015 12:12PM KLynn wrote: I just had to have my port removed after 81/2 years.....They replaced it with a power port...I've only had one chemo infusion with it so far....I guess when scan times come around, we'll see how much of a \" power port\" it really is...lol....K....",
      "MessageIndex": 1,
      "PostDate": "06/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827397",
      "Title": "port rengeko exbrnxgrl"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 5, 2008 10:04PM KLynn wrote: So happy to hear Deb in doing well, been thinking about her all day....Thanks John for keeping all of us informed. Debs such a fighter, she will be back here in no time, telling us yet another funny story..I look forward to hearing from her. Keeping  Deb in my prayers..Hugs all Klynn",
      "MessageIndex": 215,
      "PostDate": "05/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720346",
      "Title": "Dear Lord, I just scheduled brain surgery AlaskaDeb heymoose"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Feb 9, 2009 09:20PM KLynn wrote: Great topic..It's working already: 1. I just came back from a great vacation to the Cayman Islands..with my two boys... 2. I just met some of the wonderful sisters from here  at Kelly's house..Great fun, great food, great people.. 3. I drove to the party with another great friend from the boards and got to spend 2 hrs each way with her talking and talking..A new special  friendship, one I never thought I would make at this point of my life. 4. I have the best darn oncologist, and he is  keeping a good eye on me.. 5, I'm  very happy Travel, I'm happy to hear about your husband surgery, best wishes to him... Huggles KLynn....",
      "MessageIndex": 23,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728749",
      "Title": "Everyday I try to... luvtotravel EWB"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jul 24, 2009 12:15PM KLynn wrote: Hey there Joani, I just had the surgery 4 weeks ago...I had my ovaries and tubes removed, left the uterus alone...I too felt the same way about loosing more female parts, and good ones at that...nothing wrong with them...I was happy too be be getting off of the lupron shots, I had been getting them for over 3 yrs now, and yes the bone pain is constant... The surgery wasn't too bad, the incisons very small, and healled very easy..I was worried a bit about the healing, I don' seem to heal as well, with all the drugs in my body as I use to..The worse part was the gas afterwards...One word of advice--- don't lay flat  for a few days when you get home..make sure you have your pillows propped up, it may not be as comfortable to sleep  but I'm telling you you don't want the gas up under your rib cage..I thought I was having a heart attack the one night...It takes a long time for the body to absorb the gas, it doesn't come out the way you would think.... When I first woke up, ( I won't lie to you ) I had the \" oh my gosh what happened to me\" feeling, everything hurt...but some really good drugs in the hospital took care of that..and I needed a lot of meds at first, I guess I have built up a tolerance to the pain meds after all these years...I went home the same day, they said I could stay , but I really wanted to go home..Felt much better the next day... You have to be smart and not try to do too much for a couple of weeks..don't push yourself...I am really glad it is done and over with...Hoping it really makes a difference with the estrogen feeding my b/c...We'll seewith the next set of scans...I hd to come off of my tykerb, and held off on one of my herceptin treatment, but was back on everything 2 weeks after the surgery.. Good luck, and yes I have felt that way,,...but I do have to say I am still very much a girly girl ..lol..... Hugs KLynn",
      "MessageIndex": 2,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737914",
      "Title": "partial hysterectomy on Mon. joaniji lovinmomma"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Mar 14, 2009 09:58PM KLynn wrote: This is all very disappointing.....and upsetting... Hugs Nicki..hoping whatever treatment is ahead of you-   you go through with little s/e's and much success...I will seek you out on the other forum for updates..(((((HUGS)))))))))).......KLynn",
      "MessageIndex": 80,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730557",
      "Title": "New stage 4 here"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 27, 2009 04:15PM KLynn wrote: 'EMPTINESS' That is the best way to express how everyone is feeling today...Deb certainly filled an enormaous amount of space here on all the threads, and in the chat room with humor, fun, compassion and love...The dark hole feels like its just sucking me in...I can't get this feeling out of my soul today..she will be missed so very much..What a beautiful soul she has...A very special woman indeed..With tears still..Hugs Klynn ",
      "MessageIndex": 228,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 28, 2009 06:34PM KLynn wrote: OHhhh GSG thanks so much,, I couldn't find it, and I knew that after we posted that night we went into the chat room and the stories continued...I justed laughed all over again reading those posts..She had me in tears that night..I really will miss her and her humor.. Hugs..Klynn Not sure thats how she would want to be remembered, but all of us that were talking that night will certainly remember that..LOL ",
      "MessageIndex": 288,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 18, 2008 02:36AM KLynn wrote: Hi Jeanette,     Another no reconstruction here, my story is alittle different, I had my bilateral in 2000, not as many women were doing bilaterals then. My mohter had bc 5 yrs prior, and had only the bc breast removed, so I quess I had time to think about it, and knew I would remove both. I also saw a ps before I had the bilat. but chose not to do it at the same time.Worked out better that way, I had some complications with surgery, and wouldn't have gotten the ps anyway, I would have been so dissappointed if I had finally decided to go that way. Anyway, I never did go for the new breasts, once I healed from the bilat, I figured, I just didn't ever want to have to go under the knife again. I have read so many horror stories about reconstruction and boy there are alot out there. On the other side though, there are women out there with beautiful new healthy breasts. I have never regretted not going for the ps, I where prosteises (sp?)  and most people that know don't even remember, they look so good. Hope this helps some. The site breast free is very good, and very helpful, but if you also go to another site started by one of the ladies here ( Beth - she is very knowledgable) it is breastreconstruction.org I think. It has great information there. Good luck and be healthy...Hugs KLynn",
      "MessageIndex": 5,
      "PostDate": "18/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/698638",
      "Title": "Confused: Reconstruction or NOT?? jeanette51 Sparkle2"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 18, 2008 11:59PM KLynn wrote: Hi Dawn,      Thinking about you ,if you feel like talking pm me, anythime.... LuAnn, I loved your story of  Dani's posting ...Thank you for sharing..Something to think about for sure, I'd LIKE to walk happily , not sure if thats going to happen, BUT if you think about our birth into this world, we come in quiet peacefully, until the doctor slaps us, making our new arrivlal a crying ,screaming experience.(Actually our birthing process is suppose to be very painful, we just don't remember it)..Then we are handed off into the arms of our mothers, everything is better, and we are given everything we need..Love, nurturing, and a lifetime of wonderful days..So walking down that path my be hard, and we may be crying , but at the end  I'd like to think that there will be arms to comfort me, Gods and my mothers....And we won't even remember any of the suffering we've experienced along the way.    I am also stage iv, and have may difficult days, these boards help so very much, knowing that people here understand more than anywhere else..Thanks..Hugs to all KLynn",
      "MessageIndex": 127,
      "PostDate": "18/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702338",
      "Title": "Ladies Please Help Me,I feel Like it's crunch time.. zarowny9 Trevorrolph"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Mar 17, 2008 10:10AM KLynn wrote: Hi Zar,     Hey we have talked many times before but its been awhile. I wish I had the answers for you, if you remember I'm trip +, so our situations are different, but with that I can tell you that I really had great success with Gemzar, after other chemos failing me. I didn't have it with anything else at the time except for Herceptin, which I know is not an option for you.  Have you asked the doc about the side effects of the rads to the neck area?? That may help with your decision some. I've only had my initial rads to the breast area, because with my lung mets there were too many spots to raditate. I would just worry about the effects on the throat area, with swallowing, you don't need more problems than you already have. Then again if its the best option, you may need to go that way. I'm really sorry you're having so many problems , and I wish I had the answers but please know that I will be thinking of you and praying for you. Hoping your decisions come easy for you... Hugs KLynn",
      "MessageIndex": 1,
      "PostDate": "17/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702338",
      "Title": "Ladies Please Help Me,I feel Like it's crunch time.. zarowny9 Trevorrolph"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 8, 2008 12:08PM KLynn wrote: Hi Zar,     Haven't been here in awhile, didn't know you were going through rads. Hope they do the trick!!! Hope they go quickly and without any se's. Will be thinking of you  and counting down with you.     Good luck   Hugs KLynn ",
      "MessageIndex": 73,
      "PostDate": "08/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702338",
      "Title": "Ladies Please Help Me,I feel Like it's crunch time.. zarowny9 Trevorrolph"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "May 13, 2008 10:15PM KLynn wrote: Hey Dawn,     My husband's computer also crashed about 2 yrs ago, same thing lost very important work information, all of our pictures from the past 5 yrs. or so. He was able to have it fixed but it was very expensive. He retrieved everything that was lost..So depends how much you need your information back, he used Drive Savers their # is 800 440-1904 . He was very happy with their results, hope this helps...Sorry to hear about all your troubles lately, will be keeping you in my thoughts.. Hugs KLynn",
      "MessageIndex": 173,
      "PostDate": "13/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702338",
      "Title": "Ladies Please Help Me,I feel Like it's crunch time.. zarowny9 Trevorrolph"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 26, 2009 08:58PM KLynn wrote: Oh nooooo....I am aleady crying...I can' t even think about how much our beautiful friend has gone through...I can't even think, I never expected to see this tonight..God bless her and her family..An Angel yes, a beautiful angel...KLynn",
      "MessageIndex": 12,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 26, 2009 09:39PM KLynn wrote: the pictures are wonderful...they show the happy, funny, lovable Deb at her best, please keep them coming...God Bless everyone who loved her and will miss her.. ",
      "MessageIndex": 39,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 28, 2009 05:18PM KLynn wrote: That may have been the same night that we had the conversation about a \"certain BONE\" of the bear, that was carved and used for walking sticks or canes...Or was that a moose??? OH now I can't remember either...Well we all laughed our a$$es off as she tried to explain it to us..You can imiagine hoe the rest of that conversation went..She had to explain to each person that came in and had no idea what we were talking about..She even managed to describe the shape and size..Man she had us roaring...She was one funny lady..And a great stroy teller at that...These are the stories that made her so loved.. Hugs KLynn",
      "MessageIndex": 286,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 8, 2008 07:22PM KLynn wrote: Hey Deb, Glad to hear you are home... Rest those eyes and come back here when you are up to it.. You may just need a few more days for the swelling to go down, hopefullly things will be better by the end of the week. Thinking about you and keeping you in my prayers. Big gentle hugs Klynn",
      "MessageIndex": 264,
      "PostDate": "08/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720346",
      "Title": "Dear Lord, I just scheduled brain surgery AlaskaDeb heymoose"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 29, 2009 04:53PM KLynn wrote: Oh Janis that is Freakin'  Fantastic........ Kick ass at that job.....love that the onc. is happy and love the word \"STABLE\"......Great news...Hugs KLynn.....",
      "MessageIndex": 2,
      "PostDate": "29/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741197",
      "Title": "Stable and some shrinkage.. Fitztwins sushanna1"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Feb 20, 2009 12:06AM KLynn wrote: oh LuAnn this rocks..I'm so happy for the good news.. Hugs to you  KLynn",
      "MessageIndex": 36,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729384",
      "Title": "Got Excellent News Today!!!! LuAnnH Calico"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jul 24, 2009 01:57PM KLynn wrote: Good luck Joani... .Oh and remember to pack a pad or two, you don't really bleed, but you do have some spotting at first from the blood that pools up in the uterus during surgery..It's not much but you can't use tampons (who even has them anymore after yrs of lupron)..and to ask at the hospital for them, they give you those long mattresses to fit between your legs..lol....you only need thin ones...I spotted for a couple of days, and then when I walked 5 miles the first time...hmm talking about over doing it..huh????  Oh the things we have to do..and go through...I had to ask my nurse for one before I left of course\" HE\"  was  tall, dark and handsome,very  young, very good looking and I totally through him off for the day...hehehe....if you have any questions just pm me, I also had it done laproscopically....two very small incisions and one tiny tiny one in the belly button..They didn't even use stitches or staples, they glued it closed...nice huh..no removal of anything..healed nice...KLynn..",
      "MessageIndex": 5,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737914",
      "Title": "partial hysterectomy on Mon. joaniji lovinmomma"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jul 11, 2011 05:48PM KLynn wrote: OH Nana....you shouldn't have to be worring about him...37 yrs. is  long time to be with someone, but one more day of living with a cheater, a liar, and down right bast*rd is  wrong....You need to take care of  you and you alone.... \"I'm in agreement with most here, and really agree with  grannydukes....I don't forgive either ..it must be a Jersey thing...lol.I say get yourself a GREAT lawyer, and make sure that your husband has to pay all of your insurance for the rest of your life....have it put into the divorce settlement, that it has to be provided for you NO MATTER WHAT....there is no reason you should have to worry about insurance and coverage, after all the years you were together...Let his 'new' wife worry about how much money is going out to you, and that he will always have you to take care of in some way...that you aren't just going away...but that you don't need him for anything,..other than taking everything you can get that in entitled to you... I am so sorry that you have to go through this at this time, he doesn't deserve one more minute of your time... I will pray for you to have the strength to heal, and move on with you life without him in it...that your health will keep you strong, and that the rest of your family will have the strength to see you through....your focus needs to be on YOU....and your health...my heart  too hurts for you...these wonderful ladies here always have great advice.....<3....KLynn...",
      "MessageIndex": 68,
      "PostDate": "11/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769466",
      "Title": "Cheating Husband teamnana car2tenn"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "May 2, 2008 02:17PM - edited May 2, 2008 02:18PM by KLynn Stephanie,     Thinking of, and praying for you friend...     I'm happy you have someone so special in your like that you trust with  your children, what a blessing.You must be very special to him.. I had alot of problems with my sinuses when I was on Gemzar and Herceptin        together, I don't think the oncologist even knew that there were so many of us having problems with the sinuses as s/e's..I was so packed that that       there wasn't a bit of air in the cavity. The mri should it as solid..They tried antibiotics at first, with no help. I ended up having sinuplasty to relieve the pressure..It wasn't fun, but at least it worked..I haven't had a headache since, no sore throats or infections through out the winter. I hope they find something similiar .. You're so very strong..              Gentle Hugs KLynn ",
      "MessageIndex": 19,
      "PostDate": "02/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704890",
      "Title": "Test Results - Still Need Prayers TripleNeg 2timer"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 15, 2007 12:13PM KLynn wrote: Hi Carol, I 'm just around the corner from you in many ways. In NJ. and with lung mets. I was originally dx in 2000. Same thing, had my chemo rads hercpt. surg. you name it I had it. I'm a little younger than you but that doesn't matter much , also her2 ++, and er/pr++. I was feeling fine with no symptoms at all when dx in 2005 with lung mets, just a routine check-up showing rising tumor markers. Doc was on top of it right away (love my doc), I was put back on herceptin again with taxotere, after 3 months no change in spots and markers still slghtly rising. Doc  said time for a change, changed to Xeloda (pills), and I was on that for about 7 months but the se's for me were just too much, I quit the Xeloda even though it was starting to work. Next doc put me on Gemzar (IV) which I've been on now for about 1 yr, with great results, tumor markers have been normal for about 6 months now.  Had all my scans and everything is looking good, still have a few spots that doc thinks are dead cells.Just had PETscan and see doc about that this week, hoping to be coming off of the chemo and only staying on the herceptin. It has been a long journey this time fighting the mets( almost 2 yrs)  the little buggers were a little more stuborn than I would have liked, but if they are gone for now and I get some time off I will be very happy. I wish you luck with your treatments and  a faster recovery, there are many many drugs out there if one doesn't work go on to the next is my point. I'm still here and too busy to not be here, lol. We are here for you .  Hugs and wishes to you KLynn (keep us posted on your journey back to health)",
      "MessageIndex": 11,
      "PostDate": "15/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693731",
      "Title": "Diagnosed yesterday with BC tumor spread to lungs NYCarol bellywelly"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 7, 2008 05:09PM KLynn wrote: Hi Carol,  Those darn unexplained pangs and pains-------they will absolutely drive us all crazy...You may not like my answer, BUT it could just be age....agghhhhhh did I say age???? Sorry, I know that is such a bummer, but I found since I turned 45ish, I have all kinds of wierd things happening..Of course because I am stage 4 I always go there, but truth be told I never felt any pain or effects of my long mets,.I have been in remission for about a yr now, and have more pangs and tweeks then ever before..GRRRRRRRR Hoping all is well for you , and that maybe all the extra stress is causing the pains..Maybe you just need a really good Thanksgiving dinner to stop those hunger  cramps lol...Not sure where you are in NJ but I'm sure I'm not far if you need to talk..Hugs KLynn",
      "MessageIndex": 4,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/724056",
      "Title": "Please calm me down (again) caaclark SpunkyGirl"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 23, 2009 02:55PM KLynn wrote: Hey LuAnn what a beautiful family you have..Your son is very handsome ---looks like a baby himself.....Just got back from vacation to see these..I am sooo very happy you were able to make the trip to greet him.....KLynn xoxo",
      "MessageIndex": 50,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727727",
      "Title": "Thanks to Everyone LuAnnH luvtotravel"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jun 14, 2009 11:50PM KLynn wrote: Fantastic Denise (Denny)... Just the best news EVER....keep the years coming.....gotta love the herceptin...Hugs KLynn",
      "MessageIndex": 29,
      "PostDate": "14/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735777",
      "Title": "5 Years Remission of Stage 4!!! Denny123 dreamwriter"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Dec 18, 2007 07:32PM KLynn wrote: Dear Bimmer and Sons, My heart breaks for you and your family. Your story was truely a wonderful love story, that breast cancer could not destroy.You will all be in my prayers, May Diane be in the arms of past loved ones, watching over you and your family. Very sorry for your deep loss. Hugs KLynn",
      "MessageIndex": 77,
      "PostDate": "18/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/697113",
      "Title": "Very advanced B.C.: Diane's final gift. Bimmer ilenee"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 28, 2007 11:30AM KLynn wrote: Hey Joni thanks for sharing this, We did the same and put our family in the little elf faces. Way too fun, my hubby also put his executive co-workers into the elf faces, and passed it on. I can't tell you how funny this came off.If you can't laugh at this, you really have to be a stiff, this is so light hearted and fun. Makes me laugh everytime I see it.Thanks again and have a nice holiday season. Hope you are feeling well. Hugs KLynn",
      "MessageIndex": 4,
      "PostDate": "28/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696051",
      "Title": "Elf Yourself.....Something Fun jonimb KLynn"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 3, 2009 06:10AM KLynn wrote: Oh thanks Gina,  so much for the up-date, I have been thinking about Deb everyday, looking for something here...How wonderful to hear that she is feeling better, man she is one tough lady..Such an inspiration to so many here..I really miss her funny stories, can't wait for her to post again..Such good news, yippppeeee...Thanks again, Huggles KLynn",
      "MessageIndex": 4,
      "PostDate": "03/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726695",
      "Title": "Deb C Update nosurrender LuAnnH"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 20, 2009 12:46AM KLynn wrote: Lil Bro and Heidi's Family... Please know that we are all thinking about you, and what you are facing right now...Put on some soft music, and whisper beautiful  thoughts to  sweet Heidi...She sounds like she is ready and has had  the support of her family...Tell her to go..to go where she will be painfree...I am so very sorry for you.... you will have the pain of missing her..but she is headed to a better place without pain...Bless your family and friends..may you have peace and healing.. Hugs KLynn...",
      "MessageIndex": 482,
      "PostDate": "20/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 26, 2009 10:16AM KLynn wrote: Hey Janis... Nice....way to let people see that b/c has REAL faces, and real ladies....Did you do the interview yet?????..is it  typed or is it going to be live..????..Reason for the question...I know...I'm nuts..but how about sending a shout out to all of your friends here, with a small sign...Maybe touch to tip of your nose ..or rub your eyebrow...we'll know it's for us...LOL....No raising your middle finger though....I know how you feel about Cancer....By the way which trial is it??? wondering if I can get into it..???Looking forward to seeing it, so I hope you are going to post it out here....... It's amazing how many ladies here are being interview and spot lighted in magazines....One of the Jersey girls here was featured in a new magaize here with her sister...Very Nice .....Kisses KLynn....",
      "MessageIndex": 1,
      "PostDate": "26/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740974",
      "Title": "15 minutes of Fame Fitztwins LRM216"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 6, 2008 10:47PM KLynn wrote: Elaine thinking about you, you'll need to rest as much as you can on Xeloda...There were days and days that I didn't even get out of my pj's...I found it very hard on my body..But it did start the healing process for me..Hoping it works for you...And yes we are absolutely here for you...Hugs KLynn",
      "MessageIndex": 24,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723868",
      "Title": "Stable didn't last for long ElaineD KLynn"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 15, 2009 04:01AM KLynn wrote: Thank you Liz for your beautiful words..... this post made me smile.... your daughters toast so lovely..I think adults should think more like children at times...... Heidi touched many hearts here... Hugs KLynn...",
      "MessageIndex": 33,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742066",
      "Title": "Heidi's Memorial Service - October 12, 2009 elizzim AnnaM"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 26, 2008 01:08PM KLynn wrote:  So very sorry to hear of Joni's passing..My prayers are with her family and all of her friends here...It was nice to hear that she had such a good time in Vegas, even with being so sick..It's amazing how the body can manage to hang in there when the mind and heart have other plans, she wanted to be there with all of the other ladies. Bless Joni, may she rest in peace..She will be missed..Klynn",
      "MessageIndex": 30,
      "PostDate": "26/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723347",
      "Title": "Joni Maya1 MissShapen"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 14, 2009 01:31PM KLynn wrote: Hey Heather, Sorry to hear about the new progression...Hugs to you .. Adriamycin is one tough drug, lets hope it kicks a&& on the cancer..Unfortunately hair loss (if I remember correctly) starts about the 14th day after 1st treatment...Ohhh you'll know, your scalp will get this weird tingling feeling, (almost like when you were a kid and your mom put you hair up in on of those high ponytails--you know after hours and hours and you let it down)...When you get that feeling and  it starts to come out, your best bet is to buzz your hair short..I waited, and what a mistake, I looked like the crypt keeper (my son's description)  for a few days before I finally buzzed it.. Take it slow, and give yourself some time to rest ..Hope you have minimal s/e's ..Hugs KLynn",
      "MessageIndex": 24,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732268",
      "Title": "Back on Chemo heatherpalmerton heatherpalmerton"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 23, 2009 01:45PM KLynn wrote: Thinking of you today....you remain in my prayers...hugs KLynn...",
      "MessageIndex": 528,
      "PostDate": "23/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "May 10, 2008 07:18PM KLynn wrote: Hey Steph,     Hoping to hear from you soon, just like the other ladies, I wanted you to know that I am still thinking of and praying for you..Hope you are resting and getting stronger..Many many hugs coming your way..Love KLynn",
      "MessageIndex": 34,
      "PostDate": "10/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704890",
      "Title": "Test Results - Still Need Prayers TripleNeg 2timer"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 5, 2008 12:16PM KLynn wrote: Elaine, I'm so sorry, this just sucks.....Progression is so hard to hear... Get yourself ready mentally for the fight again, there are plenty of drugs still out there for you... We are all here for you,  please know how much we all care.. Hugs KLynn",
      "MessageIndex": 12,
      "PostDate": "05/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723868",
      "Title": "Stable didn't last for long ElaineD KLynn"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 18, 2008 08:21PM KLynn wrote: Hi Tina, NO NO NO !!!!!!!  Heres my story short version..I also had very aggressive trip +++ b/c6 of 17 nodes positve ..I was only 38 so they hit me as hard as they could with everything.Chemo,ACand Taxol, then 30 or so raditation treatments, 1 yr. of herceptin trial (back in 2000) and almost 5 yrs.of Tamox...Thats when I had my recur with lung mets.....Doing nothing was never an option... That was Jan 2005, I first recieved 3 months of Taxotere, with no improvement. switched to Xeloda for 7 months but really had a hard time, with allergic reactions, and s/e's..Had dose lowered too many times for it to be effective, but it did start to work on the mets, but very slowly..I asked to switch drugs, and was then given Gemzar. I was on Gemzar for almost a yr, when my scans finally came back, putting  with me into remission. All along during that time I was getting herceptin, and lupron shots. I still get the herc. and lupron but haven't had chemo drugs in almost 1 yr...My lung mets were in both lungs and considered to be many many tiny spots, no tumors of size..I didn't have any signs of the mets, only showed up with my tumor markers.. There are definately drugs available for you, don't let anyone tell you anything other...Do not give up...If you have any question just pm me, I'd be more than happy to help ..If you're not happy with your doc, find another, I don't know what area you live in, but there are many ladies here from all over the world, maybe someone can help you find a good doc..Hugs KLynn ",
      "MessageIndex": 7,
      "PostDate": "18/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724671",
      "Title": "Lung Mets DragonladyTina kenzie57"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jun 14, 2009 10:41AM KLynn wrote: Hey there Heartbroken, I'm going through something similar right now...Ughhhh...another thing to think about.... I just went for my first bone density test, believe it or not... I am stage 4 already, but no bone mets ..so far.. My bd test showed loss, and put me into the ospeopenia category..loss at hip , and spine, fracture risk moderate...I haven't been to my onc.yet (got the results early) but I know he was talking about one of the drugs working for bd also...I'm not crazy about the Zometa, since it was one of the drugs that shut my mothers kidneys down...She had bone mets, and was given Zometa monthly, so I'm hoping getting it every 6 months may not effect the kidneys..Have to talk this one over with him... I've been getting lupron shots for over 3 1/2 yrs, now , which I'm sure is the cause of the bone loss.. I'm going in next week to have my ovaries finally removed.which I know will make the situation worse..uggg..My body just keeps producing estrogen no matter what they do..I guess my bones would be a hell of a lot worse it they weren't still producing the esto. It just seems like it is a vicious cycle, one that never stops... I see my  onc next week, so I'll let you know what he thinks, and I see the gyno/onc, (the one removing the ovaries ) next week too, so he may have a different thought..I'll keep you posted... Good luck Klynn",
      "MessageIndex": 2,
      "PostDate": "14/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/735854",
      "Title": "ZOMETA FOR Low Bone Density heartbroken8 hrf"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Aug 14, 2011 01:48PM KLynn wrote: Hey there Tina.....I've had lings mets since Jan of 06....I had too many , and too tiny to do anything about in both lungs for some time...chemo would clear up some of them for a bit, then there would be some progression...I've never really been 'clear' at any point, but down to a few  spots being watched....... QOL not too bad....with all of the tiny spots under control, and only a few growing , they decided to try the RFA about a yr. and a half ago....I only had one spot done, since it was the only one big enough to reach....I, of course had to be a bit of a problem, and had a bleed with that spot...had to stay over night to watch it...but all in all it was a pretty easy procedure compared to most...that spot seems to be stable with no new growth since the rfa...shows up as scar tissue I guess in my scans...since the rfa kills the tumor from the inside out, it leaves a small shell there....Just recent my scans have showed more growth in a few of the spots they have been watching...hmmm...I did go for a consult for the rfa again...he doesn't want to touch them, seems they are in a hard place to get,and still pretty small ... frankly I think I just scare him....with my bleeding....then I went for a consult for cyberknife...again, he feels that adding more radiation, and taking the risk of damaging the lung further isn't worth it, with still having so many tiny spots floating around..he feels it isn't really solving the problem, and thinks chemo meds are the answer...I really feel he is right, at this point I don't really have any effects of the mets in the lungs, no shortness of breath, no infections, so I don't want to damage the lungs anymore than I have to...BUT he said if one or two get too big,causing problems, then he may deal with them....Soooo...I'm getting into a new trial in the middle of Sept....seems to be a drug that is causing 'a big stir\"..not sure what drug it is yet ( somehow I think it has to be tdm-1 but not sure)...I have been excepted...but don't know the details yet...all I know is that my doc, is part of some 250 doctors involved in the trials, and has been told that the lung mets are melting away....lets hope so...I'll keep you updated....right now I'm just on my Herceptin, ( which I've been on for over 5yrs. now) and a lower amount of Tykerb....take care...KLynn...hope this helps some..",
      "MessageIndex": 2,
      "PostDate": "14/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/773128",
      "Title": "Surgery to Remove Lung Mestastases Tina2 rkt"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Aug 3, 2009 11:00PM KLynn wrote: Hey Joani,  The gas will take a few weeks to fully move along on it's way....The body has to absorb it..It took me about 3 weeks to really feel better as far as the gas...The incisions healed quicker...Moving  around and WALKING seemed to make things feel better believe it or not...glad things went well...feel better...KLynn",
      "MessageIndex": 17,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737914",
      "Title": "partial hysterectomy on Mon. joaniji lovinmomma"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Aug 11, 2009 06:17PM KLynn wrote: KBUG-Susan.... Sorry to hear you are having setbacks...  This  darn cancer just doesn' t want to behave itself...I just had some slight progression with the lung mets with the last scans..started tykerb...Not sure if you can benefit from tykerb or not, but maybe it's worth a try...I haven't had any scans since starting the tykerb I think I'm due at the end of Aug..we'll see how  if its working...Hope your doctors' appointment is a good one, make him sit down and spend enough time with you until you get the answers you want..Let us know what he decides to put you on..Good luck..KLynn...",
      "MessageIndex": 8,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738762",
      "Title": "petscan results back not good kbugmom jader"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Dec 4, 2008 03:16PM KLynn wrote: Kasey, I was waiting to hear from you, and this is not what I expected..You are in my heart sweetie, I have been thinking about you..My heart is so saddened, I just want you  to get a break from the pain and treatments..I know the days ahead of you are going to be hard with talking to your girls, but you are strong and you are still fighting...Please know that you are in our thoughts and that we care so very much for you..Hugs Hugs Hugs and more Hugs, I don't know what else to say...God bless you, and  please let us know what we can do for you...Hugs again..KLynn xoxox ",
      "MessageIndex": 33,
      "PostDate": "04/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725446",
      "Title": "Now under Hospice/Palliative care Kasey RobinWendy"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 7, 2009 09:45PM KLynn wrote: I am so sorry for your loss, this seems to be a tough day...May your mother be at peace and in a place of comfort and love.....It is so very hard to loose a mother....My prayers are with you.. Hugs KLynn",
      "MessageIndex": 8,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732116",
      "Title": "My mom is an angel now YHong luvtotravel"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 28, 2008 08:02PM KLynn wrote: Welcome Bonnie,     I'm sorry to hear of your recurrence. May I ask where you had the recur to?? I also had a recur, 2yrs. ago to my lungs, after almost 5 yrs. from first dx. I was treated with taxotere and hercpetin for  3 months, no changes then Xeloda and herc, for 7 months but had to change because of side effects, then finally Gemzar and herc. for almost 1 yr. I just came off of chemo in Oct or Nov.(can't remember) but my point is that it took almost 2 yrs to get rid of the mets. I thought it would never end, but there is always hope. My doc has never given me a time limit either. He always felt I would go into remission. I am er/pr+++++and her2+++. with very aggressive breast cancer, there are many drugs out there, do not give up     I agree with Wishwere---I think it is time to get another opinion, or have a good heart to heart with this one.      Are you still taking Gemzar??? How long have you been on it?? It took me a full year for it to work fully so hang in there. Nice to meet you, I will be checking in to see how you are doing. Stay healthy and active, you know 61 is the new 51 hehehe.     Hugs to you KLynn ",
      "MessageIndex": 2,
      "PostDate": "28/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699314",
      "Title": "my reoccurrence bonnieh sdurantmd"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 29, 2008 07:14PM KLynn wrote: You are very welcome Kim,     It does get very  tiring, the unknown of knowing when you will finish up treatment can get very hard to handle at times. The first time you have a plan , you have dates of treatment , and you have an end of treatment date. Not so with the dx of mets, it really takes its toll on you , BUT hang in there. You will also go into remission and get a break , and boy it just seems to come when you need it, and feel like giving up with treatments. I wish you luck and will be praying for you to go into remission. Keep us posted, look forward to hearing your good news soon. Hugs to you KLynn",
      "MessageIndex": 11,
      "PostDate": "29/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699314",
      "Title": "my reoccurrence bonnieh sdurantmd"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 4, 2009 09:27PM KLynn wrote: Oh Luann,  How wonderful....What a great way to start off the new year..Thats the best news I've heard so far this year, lets keep it coming..Is he coming home for good??? Fantastic..Hugs to you and your brave son..Hugs KLynn",
      "MessageIndex": 35,
      "PostDate": "04/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726595",
      "Title": "BethNY My New Friend KellyC KLynn"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 26, 2008 06:43PM - edited Nov 26, 2008 06:44PM by KLynn Hey Bethie, I looked around and all I could find was titanium replacement ribs..I think they are only used on children with early bone disease..Not sure if there is anything else for adults..Still looking..Hugs to you KLynn xoxo wish I could hug you in person.....Want to come  to NJ after the holidays for a visit????????",
      "MessageIndex": 24,
      "PostDate": "26/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725018",
      "Title": "That Dreaded Word...Progression AusAla faithandfifty"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 15, 2009 07:46PM - edited Apr 15, 2009 07:48PM by KLynn Thanks  Ladies, Fitz you are right about the foods with JC.I just met with a rep at JC, I explained all the details of my b/c.....Guess what????  Just about all  of their packaged food has soy and soy protein in them..They have pages of foods and all have soy and soy products..Uggghhhhh..There was about 10 products that don't...So No  Jenny  Craig for me,,,I'm estro + and don't see the point of going for lupron shots to suppress the estro. just to be eating 3 meals of estro a day...Looks like WW will probably be the best, making my own food...It's just that I am so tired of measuring and preparing the food...I always did Lean line on my own at home, (our version of WW years ago here)..It gets so old..fast.... After talking to the JC rep, I think we realized that I don't eat enough calories, believe it or not..I try to stay low with calories, but I guess I'm not getting enough to give me enough energy, looks like a trip to check out the gyms tomorrow is in order .I guess I can save the bucks on the food and put it towards a personal trainer..I'll keep you updated.. Flaldy, I think I'll try cutting out sugar.and some bread...Those are my weak areas...I eat very little red meats, mostly chicken and fish..I eat a ton of veggies, and fruits...No fried foods and never fast food...ohhhh but I do love pizza.... Thanks for your ooinions..Hugs KLynn",
      "MessageIndex": 6,
      "PostDate": "15/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732534",
      "Title": "Need help with Stage 4 and diets..Jenny/WW ??? KLynn KLynn"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Feb 17, 2009 10:01PM KLynn wrote: I'm still not posting anywhere until you come back...sooooooo where are you??lol DO YOU KNOW HOW HARD THIS IS FOR ME  ???????? Brats unite and get our Steph back... I'm going to have to come over and find out who upset you and kick some cyber butt...If I bring Kelly we will be quite a team,  you don't want to piss off N Jersey/N  York ladies...so whom ever upset Steph better apologize NOW.. All kinding aside, we miss you ..be well..Huggles KLynn xo",
      "MessageIndex": 111,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729109",
      "Title": "I'm Done TripleNeg AliceJean"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jun 14, 2011 12:17AM KLynn wrote: ..(((((( Janis)))))))... I don't think you are selfish either..not at all....I agree with Sandy.....It hits all of us hard, and in diffferent ways, at different times...You know I don't post here much anymore, but I had to come on and post for you....yep...I just had my 11 yr. anniversary in the end of May...5 and 1/2 of which being stage 4....I'm still on the herceptin and tykerb...still have never been NED either, but just trudge along, doing what I have to do...It's never easy, none of it...but I've seen my boys graduate highschool, AND now college...I never thought I would..I pray for you to make those same mile stones....Now I wait to see and meet grandchildren SOME day...small steps, big dreams.... Be well, and try not to let the saddness last too long...On those days, when I start to think too deeply, I look through pictures and think of what a wonderful life I have already had...and pray for more..... 11 years and going strong....(well....maybe not that strong...lol..but I can pretend...)  KLynn...<3...",
      "MessageIndex": 21,
      "PostDate": "14/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770281",
      "Title": "You think you get used to it... Fitztwins lorieg"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "May 19, 2008 09:18PM KLynn wrote: Arc,     You may want to reach out to\" Livestrong \"  she is on the boards here almost everyday. She is in a similar situation, and may be of some comfort to you. She is very friendly and compassionate. She is also very easy to talk to. I'm sorry that you were just dx, and you're right its not fair...It's not fair for one of you , neverless the two of you...I can't imagine how hard it is on you both,  I will be praying for you both..Best wishes to you and your family..     Hugs KLynn",
      "MessageIndex": 3,
      "PostDate": "19/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705804",
      "Title": "I can't be the only one, can I? Hubby & I both Stage IV arc229 jinan22"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jan 25, 2008 05:35AM KLynn wrote: Hi Donna,     Like Buzz and Anne said, there are so many drugs on the list if xeloda is just too much for you. I can tell you that I was on Xeloda and herceptin together for 7 months and just could not take the side effects any longer. It was just too much, I stayed in my pjs for days at a time, so tired and sick with stomach problems. I didn't have the hand and foot syndrome though. My doc was able to switch me to Gemzar, which meant back to infusions instead of pills, but I found it easier to take the se's. I was on that for about 1yr. with the herceptin, and for now I am in remission, only getting the herceptin every 3 weeks. Hope it works out for you  Hugs KLynn",
      "MessageIndex": 3,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699043",
      "Title": "XELODA GoldenEyes LoriFL"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 6, 2011 11:41PM KLynn wrote: I am so sorry for the loss of your mother...May your loving memories bring you peace and help you heal...Bless you in your time of need..Klynn....",
      "MessageIndex": 22,
      "PostDate": "06/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776066",
      "Title": "JoyRebecca is an angel tjgraham Danie"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 20, 2009 12:13PM KLynn wrote: Thanks Becky I just skimmed through the site..I will read the whole thing later, thanks again it looks like  there is really great info there...Hugs KLynn",
      "MessageIndex": 19,
      "PostDate": "20/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732534",
      "Title": "Need help with Stage 4 and diets..Jenny/WW ??? KLynn KLynn"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jul 3, 2008 11:55PM KLynn wrote: Wow, I just logged on to see this, don't really know what to say either....My prayers to her family, children, friends, and sisters here at bc org....She will be missed so very much here. a true loss to everyone who loved and knew her...With sadden heart..KLynn.",
      "MessageIndex": 75,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708474",
      "Title": "Kari is our latest Angel djd Rocktobermom"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "May 29, 2015 05:32PM KLynn wrote: hello ladies... I just hit my 15 years since dx.. Dx in May of 2000 Then in Jan of 2006 as stage 4.. That makes me 91/2 years as stage 4 ......it's been a long battle, but happy to be here every day...!!...Klynn...",
      "MessageIndex": 73,
      "PostDate": "29/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831838",
      "Title": "How long have you been Stage IV? goldie0827 dormouse"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "May 27, 2009 12:35AM KLynn wrote: Great News......those are the kind of reports we all wait for....Yaaahhhooo...",
      "MessageIndex": 3,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734823",
      "Title": "scan results kbugmom bourscheid"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 25, 2008 09:23PM KLynn wrote: Hey Bethie, I'm so sorry to hear about the rib progression...It just seems like we can't get any good news here lately...It makes me so angry...I don't really know that much about rib bone mets, my mother had some but they only treated her for them with radiation, she quickly had other problems to deal with..Is there any kind of surgery (I know thats not a great option) but is there some way to replace the rib bone ---as they do knees and hips???? If you are clear everywhere else, and the problem is one rib, (which is so painful), why can't they remove and replace with a plastic rib??? I would think it wouldn't work for everyone, but in your case it may be better to get the rib out, and rid of the cancer in that rib..Don't know if this is even an option, but worth asking about..The thought of all the drugs again, and starting to play with the different combos can be so over whelming..Sending you very very gentle hugs, thinking about you and your daughter..Wish there was something I could do for you..Hugs friend...KLynn xoxo",
      "MessageIndex": 8,
      "PostDate": "25/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725018",
      "Title": "That Dreaded Word...Progression AusAla faithandfifty"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Feb 16, 2009 06:53PM KLynn wrote: Okay so I didn't start my strike  yet..as you can tell it's hard for me not to talk here LOL.. Of course LuAnn you can join in the brattiness with Kelly and me... I'm stomping and pouting and even sulking some...so STEPH please read these... I too was thrown for a loop once here, very early on , when I was in the chat room, something so hurtful was said to me, I don't go in there much anymore, although I left a really great group of ladies, and miss some of them,,The good news was I got to meet some of those great ladies not too long ago.. I tried not to judge, thinking maybe that person was in pain herself, but still it was hard.. Steph post away sweetie....Hugs Klynn Brats welcomed...",
      "MessageIndex": 96,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729109",
      "Title": "I'm Done TripleNeg AliceJean"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "KLynn wrote: Hello  Stage 4 ladies, I have a question and hope maybe some of you have \"tried\" to lose some weight on one of  the commercial diets... If I don't lose some weight before this summer I think I may not leave the house...So..Has anyone tried any of these diets, Jenny Craig, Weight Watcher, Nutria/System? I'm asking stage 4er's because it does make a difference, with whats going on inside, with treatment, meds and never having a break from the drugs... I was always on the thin side, until of course the original dx and the 30 lb gain then...I gained very fast with the first set of treatments, and never was able to get down my weight again..5 yrs. of Tamox didn't help either..I was dx with recur 3 yrs ago, and now really can't lose any weight..Monthly lupron and herceptin doesn't help much... So now that I want to \"try\" again for the 10th time, I think I'd like to go to a diet center for help..Just not sure which is safe with all of our problems..I'm afraid of too much sodium, too much sulfites, not sure how \"their \" food will work with the drugs and not feeling good most of the time..I'm too tired most days to even think about dieting, but what the heck I'll give it another try..I know most diets are portion control, and that is not a problem for me, I tend to eat very small meals already.. So.. does anyone have any in-put on any of these diets??? What should I stay away from?? I'm trip +++ and don't want to mess with the estogen levels...I know it will be a one pound a week loss, ughhhh..I was never one to drop quickly, most weeks only a lb or two... I need to lose about  35 lbs. but would be happy with even 25... Thinking about joining a gym too, but thats another  whole  story..I really don't think I have the energy to go and be committed to working out anymore..walking is about the most exercise I get..oh and climbing all these stupid stairs in my new house...what the heck was I thinking??? Thanks for your help.. I always know where to come..hugs KLynn How lucky I was to have known someone, that was so hard to say goodbye to.... Dx Stage IV, 6/17 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732534",
      "Title": "Need help with Stage 4 and diets..Jenny/WW ??? KLynn KLynn"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 15, 2009 10:43PM KLynn wrote: Thanks Renee, I wonder if all the plans with prepared meals will be the same with the soy... Looks like I'm going to have to hire me a full time chef in the house..Hehehehee  (maybe he'll even clean  for me, oh and do foodshopping....) I  think I may be pushing it now...LOL.. Gonna check  out two gyms and a Hospital wellness center gym tomorrow, hopefully that works out better...Hugs KLynn",
      "MessageIndex": 10,
      "PostDate": "15/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732534",
      "Title": "Need help with Stage 4 and diets..Jenny/WW ??? KLynn KLynn"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Nov 7, 2007 03:04AM KLynn wrote: Hi Bimmer, I've been reading your posts for some time now,and pray for you and your wife Diane. I am a stage 4 , just recently going into remission.Only God knows for how long, but I'll take it. I recently lost my mother to bc, and I understand the pain you are in as I took care of my mother  during her long fight,and at my house the last few days of her life. I see you have Diane on the patch now, I'm not a nurse but from what I saw with my mother, was that once you have the pain under contol it is best to keep her that way. Don't let the patch wear off, it should be changed every 3 days, but don't take her off of them, they also come in 75 , 50's and 25's. My oncologist told us that the pain is easier to keep under control with constant meds, if you let the pain start again it is much harder to get back under control.I hope that makes sense, I tried not to babble.  I know how hard this on you both, and you are lucky to have each other. I also have a wonderful husband that I worry about all of the time.Diane will worry about you each day shes here, as you do for her. Prayers for you and your family.Blessings-- KLynn",
      "MessageIndex": 9,
      "PostDate": "07/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694995",
      "Title": "Very advanced breast cancer. Bimmer Bimmer"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 21, 2008 12:33PM KLynn wrote: Hi ladies,     I missed the movie the first two nights but finally caught it last night...I think it was great, and Harry C Jr. did an excellent job..Wow did that hit home...Dr. Slamon is truly my HERO, I didn;t know his side of the herceptin story, and I've been doing Herc. since 2000..I should have taken the time to learn more about him, I guess I was so wrapped up in the fight, I forgot to learn more about the drug. He really did sacrafice many years to the dedication of this drug. I know how hard it is on our side of this fight, but you forget how hard it must be on the doctors, everyday fighting to save the lives of their patients..I for one just adore my doc, and I think the next time I see him I'll just give him the biggest hug ever..He already thinks I'm nuts LOL. I would love to email Dr. Slamon, and thank him , I think Michele is right about after this weekend him having many many emails...We all have to have HOPE,  in our doctors, in the research, and in the new drugs coming on the market for us, its one of the  things that keeps us fighting this ugly disease.      I didn't realize how much Revlon was invovled in herceptin either, I guess I'll be wearing Revlon make-up from now on....Time to go shopping and ditch the old stuff.. Hugs to all--KLynn xoxo ",
      "MessageIndex": 25,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722948",
      "Title": "Living Proof Movie mimi1030 LuAnnH"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Feb 16, 2009 05:22PM - edited Feb 16, 2009 06:46PM by KLynn Hey Steph,    You get your \"tiny little hinnie back here\"...Do you hear me?...You would be so missed here..Don't let anyone do this to you..When you are ready and feel up to it, we would love to see your posts again. .I'm with Kelly , I may just start whining too...If that doesn't work than I will start a picket-line, and not post until you do again,  so there...     Kind of bratty, but trying to make a point..Hugs KLynn I'll be waiting...",
      "MessageIndex": 90,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729109",
      "Title": "I'm Done TripleNeg AliceJean"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 16, 2008 09:18PM KLynn wrote: Hey Deb,     Sending you another BIG Huge HUG from Jersey !!!!!! Hope you are feeling even a tiny  bit better.. Thinking about and praying for you every night...Hugs KLynn",
      "MessageIndex": 73,
      "PostDate": "16/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721061",
      "Title": "Feel stuck in place....venting AlaskaDeb RIV54"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 27, 2008 04:22PM KLynn wrote: Amber hoping you are feeling better each day, and that the chemo, and rads kick in making the up coming holidays good for you...It's wonderful to see your beautiful family photos....Your children are so adorable....Bigs gentle hugs wrappping around you....Klynn",
      "MessageIndex": 10,
      "PostDate": "27/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723418",
      "Title": "Mrs_X_Sunneedazee LuAnnH Fitztwins"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Dec 17, 2012 07:35PM KLynn wrote: I have been on Xeloda for over a year and a half this time around, but I have also been on Femara with the Xeloda from about two months after the start of the Xeloda...I would also be leery of coming off the Xeloda, maybe you can ask  to have the femara added without coming off..My numbers have drop significantly, and I don't want to mess with it either, no until it stops working for me...I went from the 140 range down to 44..not perfect but hanging in there, even with the crappy side effects...which like you are mostly the hand and feet.good luck, but talk to your oncologist, it could be an option for you..Klynn....",
      "MessageIndex": 3,
      "PostDate": "17/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797742",
      "Title": "xeloda vs femara beth1118"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 7, 2008 04:08PM KLynn wrote: Hey Bcs,     Nice to meet you I will be saying a prayer for you !!!! Hope everything comes back negative..Better for the doc to be aggressive with your scans than to push them off for a year. Will be thinking of you , pet scan is not bad at all, it even gives you peace of mind when it comes back showing NOTHING but maybe some scar tissue..Try not to worry, I know the waiting is hard..     Take care and keep strong...Hugs KLynn ",
      "MessageIndex": 1,
      "PostDate": "07/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703555",
      "Title": "possible lung mets bcs75 Dukemom2"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Apr 7, 2012 01:53PM KLynn wrote: Keeping my peely cut up, bandaged fingers crossed....lol...hoping to get on it, and off of the Xeloda...second time around on Xeloda just doesn't cut it....This couldn't come fast enough for most of us....Good luck to those of you already in trial...we appreciate you for getting into the trials from the start...thank you...KLynn...xo",
      "MessageIndex": 22,
      "PostDate": "07/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784973",
      "Title": "Hope yet for TDM1 to be approved Fitztwins bhd1"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "May 14, 2009 10:23PM KLynn wrote: Love,   Please invite your friend to join us here...Like Faith said we will give her open arms...Gods plan my not be have been visible a few years ago for your friend and her husband, but maybe now she will be see a bit clearer his plan...I often find comfort in knowing who will be there waiting for me with open arms when I leave this world...I wish her peaceful healing at this difficult time..Hugs KLynn",
      "MessageIndex": 4,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734215",
      "Title": "Her Husband Passed Away Tonight lovemyfriend PattyP"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 28, 2007 11:01PM - edited Oct 28, 2007 11:05PM by KLynn Hey Traci,    thinking you you too, hope your sister is doing better.  Want you to know i am praying for you and your family. You have such a positive spirite, wish you lived closer.  Hope there are many years of  friendship ahead for both of us. You take care girl--------KLynn",
      "MessageIndex": 1,
      "PostDate": "28/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694592",
      "Title": "MIA...Missing in Action...Check in please..... Traci-----TripNeg lv2cmp"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jul 21, 2009 01:35PM KLynn wrote: Hi Positivity,, I hope it turns out to be nothing.....The only advise I can give you though is to stay on top of it...don't let doctors \"poo poo\" you and say you are too young, and it's nothing, if you feel something there...I was 38, and I noticed the slightest dimple on the botttom of my right breast, right under my nipple..I had already had two children so I was hoping it was just my breast reshaping....I had very lumpy dense breasts to begin with, so every month they would go up and down a bit with my cycle...There was one lump that I just knew wasn't right, I went for  a mammo, and I told them to cncentrate on that area mostly, they said nothing was there, I went to my gyno, he felt it, said \"it didn't feel like cancer..\" What ever that means...I decided to go to a breast surgeon just to make sure and put my mind at ease, he couldn't see it on any of the films but did feel what I was talking about...He tried to drain it with a needle..and that's when I knew things weren't good..SO...I don't mean to scare you, really..I hope everyhtin is good with you and I will say a prayer for you...BUT if you have a gut feeling, and you now that dimple wasn't there before, keep going until you find out what it is...You're young and probably very healthy, so you want to be aggressive.... Good luck sweetie.....keep us updated, there are many wonderful ladies here to help you...Hugs KLynn......",
      "MessageIndex": 1,
      "PostDate": "21/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/737751",
      "Title": "Breast Dimpling Positivity Positivity"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 12, 2009 05:29PM KLynn wrote: HAPPY HAPPY BIRTHDAY TO YOU DEAR FRIEND..... HAPPY HAPPY BIRTHDAY TO YOU HAPPY HAPPY BIRTHDAY DEAR  LINDA.. HAPPY BIRTHDAY TO YOUUUUUUUUU HUGS KLYNN....",
      "MessageIndex": 11,
      "PostDate": "12/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741999",
      "Title": "Today Is My Birthday Nanalinda heatherpalmerton"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "May 7, 2008 08:16PM KLynn wrote: Jordan,     (((((((((((((((HUGS))))))))))))))     Sorry you're feeling so crappy, both physically and mentally. but this is the place to vent..Many friends here to help you through the hard times... will be thinking of you.. Hugs KLynn ",
      "MessageIndex": 4,
      "PostDate": "07/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705203",
      "Title": "so discouraged I need some help jordan jordan"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Mar 24, 2008 11:01AM KLynn wrote:     HUGS, HUGS AND MORE HUGS.... Sending you well wishes, only positvie thoughts...     Be well KLynn xoxo",
      "MessageIndex": 29,
      "PostDate": "24/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702750",
      "Title": "Please pray for me badboob67 katie11"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 21, 2008 02:21PM KLynn wrote: He's beautiful !!!!!!!!",
      "MessageIndex": 18,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723132",
      "Title": "New grandbaby! waterlily Gitane"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Sep 15, 2009 11:10AM KLynn wrote: I'm so sorry to hear this...I like Beth's  thoughts that Mena and her mojo are with Patrick Swayze right now..happier thoughts.....prayers for her family and friends may they all find peace and healing..hugs Klynn..xo.",
      "MessageIndex": 27,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740382",
      "Title": "mena got her wings... celia088 Irina"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 21, 2008 09:51AM KLynn wrote: OHHHHH Waterlily CONGRATULATIONS !!!!!!! You made me smile, I just love to hear of new babies coming into this world...Such a big boy too !!!!  This is why we fight b/c, because in another day your world can be so much brighter and happier...Blessings to you and your family...Hugs KLynn",
      "MessageIndex": 6,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723132",
      "Title": "New grandbaby! waterlily Gitane"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jul 6, 2008 07:41PM KLynn wrote: Steph,     Praying that you are feeling better and home resting.....Hoping to hear from you sweetie... Gentle Hugs Klynn ",
      "MessageIndex": 70,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708563",
      "Title": "Can't Walk.... Headed to ER TripleNeg booklady"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Jul 8, 2008 04:55PM KLynn wrote: WELCOME HOME STEPHAINE !!!!!!! You are one tough and faithful lady, I admire you so much....Happy to hear the pain has been reduced some, hopefully each day brings more relief. Get some rest and then come back and talk to us, you have been sorely missed...Sweet dreams KLynn",
      "MessageIndex": 175,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708563",
      "Title": "Can't Walk.... Headed to ER TripleNeg booklady"
    },
    {
      "AuthorID": "KLynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44311/profile",
      "Content": "Oct 15, 2009 10:38AM KLynn wrote: May Amber's family and friends find peace and healing....Such a beautiful person with a beautiful soul,  Amber will shine as an angel.....Prayers KLynn... the  skies are shedding tears here....",
      "MessageIndex": 13,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742156",
      "Title": "Mrs_X_Sunneedazee (Amber) dmacw janie44"
    }
  ]
}