{
  "AuthorID": "KM47",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
  "Posts": [
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jan 11, 2009 06:10PM - edited Jan 11, 2009 06:11PM by KM47",
      "MessageIndex": 439,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Mar 29, 2009 10:15PM KM47 wrote: Thanks guys for the advice. It sounds awful but it's comforting to know I'm not alone! Not that I would wish this on anyone, but just knowing I'm not going mad and that this is normal somehow helps. I haven't had any rashes yet but last night my nails started feeling really sensitive. Today I noticed white blotchy patches on the nails so I guess this is the start of the nail reaction. I will have to trim them - I tend to type with my nails and it's getting a bit sore to do that! Am hoping, that at day six, I am over the worst of this aching. From what you all have said I'm anticipating I'll be on my way to feeling a little more normal by the end of this week.  I know what you mean about the runny nose -- someone told me it's due to losing nose hair. Since I started the taxotere it's been quite bloody as well. It's not a bleeding nose as such but when I blow it's bloody rather than clear. Might be related to the platelet stuff you guys were talkng about? I too have been eating like a horse. I was blaming the steroids but I've stopped those now so not sure what my excuse is....haven't felt up to exercising this past week so will be the size of a small house soon if my eating habits don't change! Thanks again to all who posted about your experiences. It's good hearing about how you have managed to adjust things to make it easier on subsequent treatments. I'm hoping my oncologist might be able to give me something to help get through the next two a bit better but I guess it hasn't been horrendously bad so I shouldn't complain. ",
      "MessageIndex": 1718,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Apr 7, 2009 06:35PM KM47 wrote: Jess, Just a quick question for you since you and I are the only ones of this forum to have had the same chemo drug regime...have you lost your eyebrows or eyelashes? I still have both but I haven't had to pluck my eyebrows since late Jan. I think my eyelashes are thinning but I'm not sure. I was just beginning to wonder if I might get away without losing them or if it's just wishful thinking... Cheers K.",
      "MessageIndex": 1832,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Apr 14, 2009 09:34PM KM47 wrote: Mimi - will definitely keep you posted. I'm not sure how fast the process is. I had thought I might have the test next week originally but looking through all the info it looks like it's just an initial meeting to discuss how to proceed from here. My rads sounds similar to you I think. She needed to look at my notes more closely but said they'll definitely do the internal mammary nodes and possible the infraclavicular lymph nodes (under the collar bone) and possibly the supraclavical area as well. A nurse told me when I was having my chemo that because I am young (37) the SEs from the radiotherapy (in terms of burns etc) are often very minimal, if anything at all so that's good to know. Kmmd - thanks for the tips on chemopause! I thought last time it was due to my temperature that I had with my infection but maybe it wasn't. Last night I had them all through the night. I slept with my hat off the entire night. I haven't had any today ... yet. Like you I don't want to take anything for them if I can avoid it - I feel like a walking pharmacy as it is! LisaLisa: Woohoo!!!!!!!!!!!!!!!!!!!!!! How great you have finished the chemo now. Hope the bug bite settles soon! I might have to invest in one of those chillin' pillows you mentioned since I guess I'll go through hot flashes again once I start Tamoxifen. Do you have a link at all? Holtbolt Another woohoo!!!!!!!!!!!!  for you too. I think it's perfectly normal to ask for so many opinions. It's your body and your life and you want to be sure - and it sounds like you've made a good decision. shockedat39 - a friend of mine called the hot flashes \"power surges\" and I think that also sums them up nicely! Yes, I know what you mean about having them with hair. It was so nice to just be able to remove my sleep cap to cool down (along with some blankets and my PJs!). I'm also glad I'm going through this in autumn rather than spring or summer! (We're opposite to you guys down here.) Jess: Glad to hear you are feeling better. Only one more to go now for both of us! Funny you should mention about the hair...it's odd, but I'm pretty sure my hair is growing back...I don't know how that can be when I've only just had treatment #5 of 6 but DH agrees there is more hair on my head. My pubic hair is growing back too (hope that's not TMI) and I had to pluck my eyebrows the other day. I wonder if the FEC chemo made it fall out and the Docetaxol isn't affecting it? Or maybe the Docetaxol hasn't hit the hair yet...? Okay, as for the links I promised you Jess, I will paste them below. I found the entire Lancet one online but can't find an option to read the 2nd and 3rd ones online without paying but you have more luck. If you don't please let me know and I can get my rad onc to email them to me or I can scan them myself as they are only half a dozen pages long each (whereas the Lancet one is more than 20 pages!) 1. The Lancet article is an old one but my rad onc said it is compelling when read with the other two new ones below. The entire text is available online but you have to register with their site (but that is free): http://www.thelancet.com/journals/lancet/article/PIIS0140-6736(05)67887-7/fulltext#article_upsell. If you have any trouble with that link article is: Effects of radiotherapy and of differences in the extent of surgery for early breast cancer on local recurrence and 15-year survival: an overview of the randomised trials (Early Breast Cancer Trailists' Colloborative Group) www.thelancet.com Vol 366, December 17/24/31, 2005. Pages 2087-2106 2. Article title: Is the benefit of postmastecomy irradiation limited to patients with four or more positive nodes, as recommended in international consensus reports? A subgroup analysis of the DBCG 82 b&c randomized trials. Authors: Marie Overgaard (Dep't of Oncology), Hanne M. Nielsen (Dep't of Oncology and Dep't of Experimental Clinical Oncology), and Jens Overgaard (Dep't of Experimental Clinical Oncology) Journal: Radiotherapy and Oncology 82 (2007) 247-253 Website: www.thegreenjournal.com 3. Article title: The value of radiotherapy on metastatic internal mammary nodes in breast cancer. Results on a large series Authors: U Veronesi, P Arnone, P Veronesi, V Galimberti, A Lunini, N Rotmensz, E Botteri, G B Ivaldi, M C Leonardi, G Viale, A Sagona, G Paganeilli, R Panzeri and R Orecchia. Journal: Annals of Oncology 19: 1553-1560, 2008. Doi: 10.1093/annonc/mdn 183 Published online 7 May 2008 Website: annonc.oxfordjournals.org/ Thinking of you all. K.",
      "MessageIndex": 1977,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "May 6, 2010 01:31AM KM47 wrote: Hello  January Jewells. I can't believe how long it has been since I've been on these boards. Life has got in the way but I think of you all often and wonder how everyone is doing. I came on to \"research\" some stuff and thought I'd also check out this thread while I was logged in, which was so valuable to me during my treatment. Once I got here I was interested to read the recent posts on Tamoxifen and its side effects. The research I'm looking for is on women's experience of bleeding while on Tamoxifen since it's something that's just started to happen to me after a year of no periods. Anyone else experienced that? My doctor has referred me for a scan (of my uterus) next week which I'm terrifed about. I say to myself how unlikely it is to be anything but like you JillyG I also beat the odds a little in getting breast cancer at 37 so understand what you mean about feeling anxious.  I really hope you get good news!!! Five weeks is a long time but you'll get there. I certainly find the waiting the hardest part and it's only a three-week wait for me. I'd forgotten how awful waiting is. It just seems so unfair that we go through one set of tests, illness and treatment, only to have them cause us to worry about another set of potential problems.  Love to you all. K. PS -PLUTZ - hope you get good scan news.",
      "MessageIndex": 3619,
      "PostDate": "06/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "May 18, 2009 10:14PM KM47 wrote:",
      "MessageIndex": 2365,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jun 29, 2009 10:41PM KM47 wrote: Holtbolt - yahoo!!!! I am so pleased. Please share with us how he reacted when you told him.",
      "MessageIndex": 2744,
      "PostDate": "29/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "May 7, 2010 01:29AM KM47 wrote: Hey FEC buddy! I know exactly what you mean about the bouts of panic. Sometimes it's related to  a specific thing (like the upcoming scan) but other times it's just a sense of foreboding for no reason at all at 3am. I don't have it constantly, but often enough to be frustrating. Like you it surprises me since I also thought my positive grab-life atittude would be to the fore.... I wondered to a woman who had breast cancer long before me if it will ever go away and she said it lessened her her over time which made me feel better. I  suspect it's because (other than the Tamoxifen and 6-monthly checkups) the formal treatment has stopped. Whereas with the surgery, then the chemo, then the radiotherapy and then the Herceptin I was at the hospital regularly now I'm largely left to my own devices. Knowing the fear is normal helps a bit I think.  Renrel, pleased to see you had good results. I feel so happy when I read such posts. Hugs to you all. K.",
      "MessageIndex": 3622,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Sep 28, 2010 10:18PM - edited Aug 20, 2013 05:50AM by KM47",
      "MessageIndex": 3803,
      "PostDate": "28/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Oct 13, 2010 06:22PM KM47 wrote: Hey, well done LadyJane! Jess, I can relate to what you said about the thoughts you have at this time of year. Hope the mammogram went okay? I don't have my next one until December and I know I'll be a wreck right before that. It's interesting that our anniversaries coincide with breast cancer awareness month (at least it is here in New Zealand) so I don't think I'll ever forget the anniversary. Here is a story about a woman at our local university who shaved her head to raise money for a special bed for the hospital for women after their surgery. The hairdresser in the middle (the guy) is my hairdresser! http://www.ch9.co.nz/content/fund-raising-events-across-country-breast-cancer-awareness-month Interesting mnmom to read about your hair. Mine is at bob length now and so much thicker than it ever was before. I have heard that changes in hair don't last but in my case I'm hoping they do since I always wanted thick hair! Shame it came back in the same shade of brown and gray though! K.",
      "MessageIndex": 3826,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "May 19, 2009 11:10PM KM47 wrote: JillyG - fantastic news! I remember being quite concerned after my first chemo when I was really sore in my ribs. I brought it up with my oncologist and she explained the pain was a side effect and it would be way too early in any case to be having any pain had any cancer cells got out. I was so relieved to hear that and when I left her office I burst into tears as well. Jess - we're arriving Oct 1 and heading home around Oct 11. I can't wait! I can't quite believe it's happening. That's interesting you start rads the day after me - we've followed each other so closely with our treatments. I'm also hoping I don't get too much scar tissue. The radiation oncologist says it will just make the area feel hard. So it'll be more feel than look but hopefully it won't be too bad. Like you, I'd rather have some scarring than cancer. Mine was also multifocal so I think they must be taking the same approach with us both. Kathy, you have my sympathies re the hot flashes. Mine have eased now but I start Tamoxifen at the end of radiotherapy so am expecting them back. Someone (Lisa maybe?) recommended a Chillow pillow. I found it online and bought one and can recommend it for cooling you down during the night. Okay, best get back to work. K.",
      "MessageIndex": 2381,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jan 14, 2009 11:31PM KM47 wrote: Hi everyone - particularly Jess who is having the same chemo drugs as me, only a few hours later! I had my first treatment this afternoon. I feel fine right now - but the nurse said the side effects won't kick in until this evening. (It's very odd sitting around waiting to feel sick! At midday I took five Dexamethasone (steroid) and three Ondoanestron (Zofran), ahead of my appointment at 1pm. They had no trouble finding a vein which was a relief (I'll have a port in by the time of my next treatment). I'm having FEC and they started with the Eprirubicin which is very red and is done slowly by syringe along with saline. It took a wee while because they do it so slowly. That was followed by the Fluorouracil which only took 15 minutes and then the Cyclophosphamide which took half an hour. I had to use the bathroom part way through (due to my increased water intake!) and already my urine was red from the Eprirubicin so Jess and others taking FEC, don't worry about red urine!  I finished up about 3.15pm. It's now 5.18pm and I feel fine so far but I guess that doesn't mean much given it's still so early. I just had a friend pop around who had FEC last year and she said she didn't feel that bad with her first FEC  so am hoping that will be the case with me but I realise everyone is different so time will tell. She said she didn't really feel bad with FEC until the final two (her fifth and sixth) treatments which is interesting as I (and you two Jess I think?) will be stopping FEC after the third treatment and switching to another drug. Anyway, I take ondanestron and dexamethasone for the next two days and have dompenidone to take if I feel I need it. Jess, the best of luck - I'll be thinking of you. Best of luck to others having their treatments on the 15th as well and those recovering from or anticipating sessions. One down, five to go...",
      "MessageIndex": 534,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jan 17, 2009 09:11PM KM47 wrote: Hello to Jess, I still have not had any nausea but I was interested to read you have some acheyness too -- I've had some in my back. It's making me nervous since I didn't think that was a side effect of FEC - I'm scared it means the cancer has spread to my bones. It's amazing how every little niggle makes you start worrying sometimes...",
      "MessageIndex": 601,
      "PostDate": "17/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jan 22, 2009 04:52PM KM47 wrote: BerkeleyKim and ddlatt, thank you so much for telling me about the MUGA scan -- things don't seem nearly as scary when you hear others talk of their experiences. Yes, I was wishing my bowel would make up its mind which way it wanted to go. Every morning I had a glass of Kiwi Crush, which is frozen mix of about six kiwifruit (I think you call them Kiwis in the US) that you mix with water. It got things going to the point where I had to lay off it completely on day five and now I think my bowel and I have reached a happy medium! Goodness, if you'd told me this time last year that I'd be sitting here now discussing my bowel movements with women I didn't know I don't think I would have believed you!!! Ddlatt - your blog is absolutely fantastic. I found myself reading it and recognising myself all over it! I would recommend it to everyone here. I also had chemo brain before starting the chemo! I just think our brains get so overloaded with information, there's no processing room left for simple tasks. It really has been great to see some people either with no side effects or dealing well with the side effects they have. It brings tears to me eyes to think of everyone going through this at the moment, but I guess one positive side is seeing the strength and humour that comes out, even though I'm sure we all have our low moments. K. PS - BerkeleyKim, am so jealous you've been watching Lost. I don't think it starts here in NZ until Feb! PPS - Jess, my FEC-buddy, hope you're doing okay.",
      "MessageIndex": 692,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Mar 1, 2009 03:17AM KM47 wrote: Wow, I have been away from the forum for a while and am overwhelmed by all that has gone on while I've been away. I've been busy with work and have managed to get back into running (albeit very short runs at snail's pace) which bring a smile to my face. So just haven't had the time to check the forum out. I was meant to have my 3rd chemo last Thursday but unfortunately my white blood cell count was too low. Before my second one it was 1.5 so I was borderline (they told me it needed to be 1.5 or above). Unfortunately last week it was only 0.4 so I had to wait. I'm going into the hospital tomorrow morning for another blood test and if the white blood count is high enough they'll give me the chemo then. If not, I'm not sure what happens next. I'm meant to be heading away for a week's holiday on Tuesday so I'm really hopeful the count will be high enough to go ahead otherwise I might not be able to go. The annoying thing is that I feel absolutely fine....so frustrating to have to wait... This is my last treatment of FEC before switching to Docetaxol (I think it's known os taxotere in the US). Jess, you were asking about it. My oncologist says you're less likely to get nausea and vomiting on it but that it's more likely to make you tired and give you muscle aches etc.  Time will tell of course - no-one ever knows how individuals will react I guess. Hope all is as well as possible with you guys.",
      "MessageIndex": 1401,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Mar 26, 2009 01:14AM KM47 wrote: Thought you guys might be interested in this piece a friend of mine wrote a couple of years ago. He has lymphoma but has quite an interesting - positive - take on life since being diagnosed.  I certainly could relate to a lot of it: http://publicaddress.net/3510#post",
      "MessageIndex": 1662,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Apr 4, 2009 05:23PM KM47 wrote: Hi thanks for all your kind wishes. I'm very lucky to have a group of lovely friends who have been extra kind since DH is away. One stayed with me in the emergency department and came up with me to the ward, and another went to my house to pick up things I needed. They've been great. When I get through this I have to figure out some way to thank them all. I was thinking about hosting a big party but if anyone has any special ideas let me know! Well, I'm still here. I haven't had the shot yet. It's not due to the cost - our public health system in NZ covers such things. The doctor is holding off for medical reasons rather than financial ones which is good. He explained that it is better for your body to start producing the neutrophils itself first and then give the shot after that. If I was feeling really unwell then they would give me the shot but because I'm asymptomatic they are waiting to see what my body does naturally first. If nothing has happened by tomrrow (Monday) then they will probably give me the shot but they decided to see what happened naturally over the weekend first. My white blood count has risen to 1.8 so that's steadily going up and the nurses tell me the neutrophils usually follow. The doctor said they may give me the G-CSF as a matter of course for my final two treatments but will discuss that course of action with my oncologist. I think I'm lucky to be in a health system where the decision will be made not by my insurance company or personal finances, but by my doctor based on medical grounds. I can't imagine how stressful it must be for some of you to take such things into consideration when treatment is stressful enough. A lot of people criticise the health system here, and it's certainly got lots of problems, but in this area of oncology, things seem to be good from my experience. Last night they moved me into a room especially for neutropenics. I would have been here originally but the patient next door had a bacterial infection and they didn't want to risk putting me there, even though they have very good infection control procedures. The new room has a special air system which means it only gets fresh air from outside rather than from the rest of hospital. It also has foot-pedal operated taps to lessen the chance of infection from touching the tap to wash your hands. It's also got new furniture and a fresh coat of paint which my last room didn't have. the nurse explained that people can be stuck in these rooms for quite some time so they try to make them as nice as possible. The view is also fantastic - over Mt Cargill (a place I like to run when I'm well), the city's museum and university. The museum grounds have lots of trees and they are just turning to their autumn colours so it's beautiful. DH gets home on Friday - I assumed I'd be out of here by then but now I don't know! He's been ringing twice a day and I can call him anytime so it's not too bad but I'd really rather he was here of course. Hugs to everyone - it's been nice to keep up with all your news while I lie here. K.",
      "MessageIndex": 1795,
      "PostDate": "04/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Apr 7, 2009 06:25PM KM47 wrote: Hi guys - I am home! It was so nice to sleep in my own bed and not be woken during the night to have my temperature taken, antibiotics given or blood taken! Part of me did kind of expect to have breakfast left outside my door this morning but I guess cooking is something I'll just have to do myself. DH is away until Friday and I have a friend staying at the moment. Unfortunately, DH, who is currently in Korea on business, has picked up a nasty flu - he has been throwing up, has a temp and is aching all over. Before I was released from hospital my doc said if he has full-blown flu and is still unwell on Friday that we can't be in the same house!! He's been gone two weeks and I really want to see him but if the doc says it's too risky for me then I guess I can't. The good thing is that I have another blood test on Thurs morning and if my neutrophils are up then my oncologist (who I see Thurs afternoon) might be able to give us the all clear to be in the same house. You have to laugh - it's so ridiculous! Was reading about people looking at your reconstructions. I'm so pleased with mine I show everyone (my PS joked with my husband that I'd become an exhibitionist). The tram flap procedure is fairly new in the city where I live as the PS that does it is the only one here who does it and he's only been here a year. So lots of docs and nurses haven't seen one before and they are amazed at how natural it is -- apart from an absence of a nipple (which I'll get when I'm through chemo) it looks just like the other side. I think I've put some weight on since the op but it's put on weight as well -- I guess because it's my own tissue. I'm excited about getting the nipple and aerola tattoo. Meet with radiation oncologist tomorrow as well as my regular oncologist so will be interesting to find out if I'm having radiation and compare notes with you guys who are also having it. I have heard that can affect the reconstructed breast so it doesn't look so good but if that's the case there's not much I can do. Will find out from my main onc whether chemo goes ahead on Tues or not. I''m keen to just get it done but doc at hospital said they may delay since I've been sick. Because I haven't felt sick that feels odd but will see what my onc says. I guess it'll depend on what the neutrophils are doing. I have high hopes they'll be above 2 by Thursday (they were 1.0 yesterday). One last question....has anyone noticed any eyesight problems with chemo? I've noticed my eyesight has deteriorated recently. I was going to make an appointment to see the optometrist but a nuse commented it might be the chemo but she wasn't sure. I hadn't heard of it as a side effect but if it is I'll hold off getting a prescription until I'm through chemo. I'll ask my onc but just wondered if anhyone else thought things were looking a bit blurry! Love to everyone - isn't it great that we are getting through all of this, slowly but surely. Can start to see the light at the end of the tunnel...",
      "MessageIndex": 1831,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Apr 7, 2009 07:23PM KM47 wrote: kmmd - I am due to start Tamoxifen next year -- the reason for the delay is I am on Herceptin for a year and they give Tamoxifen once all other treatment is done. I haven't asked too many questions yet because it's so far away but I am going to ask my oncologist about the test to find out if I will be a high metaboliser or not when I see her tomorrow since I've read a bit about that lately but it's never ben mentioned to me. Thanks guys for the info on eyesight. For some reason I hadn't thought to link it with my treatment. Also thanks for the info about the eyebrows and lashes....looks like I might have been being overly optimistic! K.",
      "MessageIndex": 1839,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "May 21, 2010 04:43AM KM47 wrote: Wow - great to see everyone celebrating anniversaries. Tell me, how does everyone else measure it? Do you take it from the date you had your surgery? I remember my surgeon telling me after my surgery that I was most likely cancer free following the mastectomy (but that we'd do all the other treatments (chemo, radio, Herceptin and Tamoxifen) just in case). BTW, I had good news after my ultrasound recently. Definite changes in my uterus but consistent with a woman on Tamoxifen. So it seems that the bleeding I have experineced is in fact my periods reppearing after a year-long absence. Have never been so pleased to hear I was having a period! Hugs to you all K. XXXX",
      "MessageIndex": 3633,
      "PostDate": "21/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Oct 25, 2010 06:55PM KM47 wrote:",
      "MessageIndex": 3843,
      "PostDate": "25/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jan 11, 2009 06:11PM KM47 wrote: To add to the confusion of keeping track of everyone, I'm another one starting chemo in January - on the 15th to be exact. I will have three lots of FEC, three weeks apart, and then three treatments of Docetaxel (also three weeks apart). I'll also start Herceptin at the same time as Docetaxel (they won't give the Herceptin with the FEC combination due to the potential side effects of both to the heart). I'm still waiting to hear whether I'll have radiotherapy. The final part of my treatment will be hormone therapy (Tamoxifen (trade name Nolvadex)) which will last five years!! When I write it all like that it just seems overwhelming. It's much easier to just concentrate on this coming Thursday only. I just want to get the treatment underway now - even though I'm absolutely dreading it as the same time. This forum is great - it's good to able to read about women going through the same things I'm going through and to be able to admit to being terrified sometimes. I'm hoping to get my hair cut short this week (if my hairdresser can fit me in) and then my plan is to shave it all off once it starts falling out. I haven't got a wig yet but I do have the form to claim for one. I'm thinking I'll just stick to bandanas and scarves but I guess I won't know until it actually happens what I'll want to do. The best of luck to everyone having their first treatments this month. I wish there was some other way to beat this illness, but I guess even the toughest treatment is better than no treatment.",
      "MessageIndex": 440,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jan 11, 2009 07:39PM - edited Jan 11, 2009 07:41PM by KM47 Hey there Jess, I don't know why but it makes me feel good to know you are I have the same treatment on the same day...makes me feel a little less alone! It looks like our diagonses were quite similar although obviously a few differences in terms of grade and HER2 status. We also got our diagnosis within days of each other. I think I looked at the same FEC thread as you and closed it in the end! I remembered what my oncology nurse said - you really can't go by how other people cope anyway (even with the same regimen) because everyone responds differently.  Hope you're feeling a bit better now. Just go with the down days and promise yourself you'll feel better tomorrow. This waiting is tough -- I just want to get started now. What time is your appointment on Thursday? I'm at 1pm NZ time, which will be 7pm on Wednesday EST I think. (It's 1.39pm on Monday as I type this.) Take care,  K.",
      "MessageIndex": 448,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jan 21, 2009 03:46PM KM47 wrote: Hey there everyone. Jess - good to hear from you. Good luck with the WBC. I'll have my fingers crossed for you. It's interesting how so many of you get neulasta. That has not even been mentioned to me as an option here in NZ. It's certainly not given as a matter of course but maybe it'll be mentioned if my WBC is too low for the next treatment. My next thing for me is an ECG (MUGA) scan on Jan 30. This is to get a baseline of my heart and will be done every three months while I'm having chemo and then Herceptin. Has anyone else had one of these? Then there's my portacath going in on Feb 3. I'll be pleased to be able to avoid needles with the port but am very, very nervous about the procedure itself and how it'll feel afterwards. However, I'm going to be on Herceptin for a year so I know it makes sense to get one. Today is a week since my first treatment (on FEC) and I still feel okay. Have managed to avoid nausea with the exception of one morning when my mouthwash (Biotene) made me gag briefly! (BerkleyKim, I can understand your nausea feelings around the chemo bag and your thermos - I get the same feeling just looking at the bottle Biotene!). I'm so sick of the taste of it already. Other than that, I've been tired and have had some stomach issues (constipation and then diarrhoea) but nothing too dramatic. I spoke to my oncologist about the back pain and she reassured me it was nothing to worry about. Lisalisa, hope the hot flashes are lessening. I have those to look forward to next year when I start hormone treatment. A friend of mine prefers to call her hot flashes power surges! Will get one of those fans you suggest mamasarah, for when I start to surge next year. Am loving my shorter haircut - it's a shame it will start to disappear in another two or three weeks.  Some lovely new turbans and scarves ordered arrived yesterday - I have enough now to start a scarf shop! Note to self: stop visiting online scarf stores! Have signed up for a workshop called Look Good Feel Better. I think it's an international thing so you probably have them in the US. It's basically a free service for women with cancer - you basically learn how to deal with appearance-related changes (ie dry skin, drawing in eyebrows etc!). It seems very superficial to even think about something like this, but I've heard good things about it and I have no idea how to draw an eyebrow so I figured why not! I hope everyone is dealing with the SEs okay as they read this. I'm thinking of you from the other side of the world. K.",
      "MessageIndex": 667,
      "PostDate": "21/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jan 15, 2009 07:30PM KM47 wrote: Hi everyone, Alo123 -well done booking in the head shave. I had reasonably long hair but had it cut short on Wed, before my first chemo yesterday (I love it so much I wish I had it done years ago). I plan to get it shaved once it starts falling out and already have bought some lovely scarves, skull caps and turbans. Hawaii808  and sjr585  - glad you are feeling better. And Hawaii808 that's great such advice about not trying to be superwoman. I think when people keep telling you how strong you're being there's a danger you think have have to continue to be strong even if you don't feel like it.  rsben70 and jrgolomb- you are in my thoughs - I hope it goes well for both of you. Jrgolomb - I know you are also taking FEC and hopefully your experience of it will mirror mine so far. Other than some muscle pain (which isn't a listed side effect and my nurse friend thinks might have been due to me being so tense) I have no side effects yet, 24 hours on. I feel completely normal. However, I know that could well change as today and coming days pass, but so far, so good.  ddlatt - pleased to hear the nausea has passed and hope the headache goes soon. Good luck for your Neulasta shot.I haven't had that but while I was hospital they gave me a med to prevent blood clots. It was meant to be given into the stomach but with a tram flap op they couldn't get to my stomach so the first nurse did it into my arm and boy did it hurt! The second nurse did it into my thigh (more like the stomach) and while I felt it, it was nothing like the arm. Obviously it's not the same medication but there may be some parallels? brendafromflorida   - hope your stomach issues come right soon! BerkeleyKim  - it's great to be able to count down isn't it - that's awsome!? Even though I may not be through the worst of it yet (since I have no SEs since yesterday's treatment yet) I still enjoy saying one down, five to go.  ChrysalisPa - welcome to the group (tho wish you didn't have to be here). The women here are amazing and have been a big help to me. Hope you are feeling okay after your first treatment.  lester63 - So sorry to hear about your illness. I'm sure your oncologist will be able to reassure you that delays aren't anything to worry about. Mine told me to allow four to six months for my treatment - four as long as we stick to three weeks apart but up to six if there are delays. My oncology nurse said not to get hung up on the three week period and just take it as it comes. Easier said than done I know - I hope you feel better soon. jas_man - Like you, I'll be having Herceptin for a year and Tamoxifen for five years. I'm 37 and also don't have children. However, my husband and I had already decided against having them but it was interesting when they told me about the implications of the treatment that I felt quite upset. I guess in the past I had control over the situation (and a small window of child-bearing years left) whereas now I probably won't. But like you, I have taken comfort in the \"if it's meant to be, it's meant to be\" approach  and my main focus is on staying alive. That may not work for everyone I realise, but it does for me. There is a thread you may be interested in reading here called Did it upset you to go into menopause? http://community.breastcancer.org/forum/6/topic/726914?page=1#idx_22 carlajane even tho I'm in NZ I have ordered three lots of fantastic scarves etc from the US and the two that have arrived so far are great. I will have to hunt the sites out again for you and will do another post. Love to everyone. K.",
      "MessageIndex": 562,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jan 11, 2009 08:50PM KM47 wrote:",
      "MessageIndex": 452,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jan 15, 2009 08:59PM KM47 wrote: Yay Bev - know what you mean! Hope the \"so far so good\" continues for you. I'm 26 hours on from my first of six as well and still okay so far.",
      "MessageIndex": 569,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Mar 26, 2009 01:06AM KM47 wrote: Hi there everyone, Two days out from my first Taxotere (which started after three previous FEC treatments) and my first Herceptin and I still feel okay. KT57, I took my lost two steroids last night so the wired feeling is starting to wear off and I managed a wee nap this afternoon after a couple of work appointments. I hope your treatment went well and you can get past the steroid mania soon too! (I also find my iPod invaluable at my treatments -- I listen to Lost podcasts rather than meditation though I have to admit!) Am thinking of all of you who have had to have treatments delayed due to infection/illness. It seems so unfair when you already have so much to put up with but I guess it's an indication of how much we are putting our bodies through. Patti I hope you feel better soon. Sending you good vibes. Holtbolt - I'm so pleased to hear you got through your treatment without any allergic reactions this time. It is scary to read about them but also reassuring to know that they can change the way they do things and what else they give you to mitigate against it in future treatments. Renrel, thanks for your interesting posts - really fascinating stuff in there. Jess - yes you are so right about that funny taste! I never quite figured out how to explain it. It wasn't metallic...it was oh I don't know but it was odd. I found lemonade iceblocks and fruit burst bubble gum made it better but that was about it. I love tea and even cups of tea for that first week after FEC didn't give me the pleasure I normally get from them. I haven't had any aches from the taxotere but then again I don't have that drug for white blood cell counts like you do and also I'm only at day two (but hoping I'd have had the side effects by now if I was going to). No, I didn't have any probs with my fingernails with FEC but the oncology nurse thought I might with taxotere. So I bought some nail hardener and some dark red nail polish at the pharmacy this afternoon, so fingers crossed I might be able to prevent it or at least slow the effects. It'll be interestimg to see how we both go. I think we must have read the same post about hair coming back! I started peering in the mirror to see if I could notice any difference! I think my eyelashes are starting to fall out now. My eyebrows are still there but I think they are thinning -- I haven't had to pluck them in weeks. It's funny though how I'm more focused now on it all growing back - perhaps a side effect of having four of six treatments done...you start thinking further ahead maybe? Ddlatt, good luck with the radiation. I won't know until  early next month if I will have radiation treatment. Am in two minds -- part of me wants everything they can throw at me and part of me would like to just get on with some normalcy. However, I'll go with what the professionals recommend - I don't want to have regrets further down the track. Alo123 -- well done! Can't wait until we are all joining you celebrating the final one. Has anyone here had a test for the breast cancer gene? I'm going to have one soon and although I'm nervous about the result (because it could mean my female relatives also carry it and that I may require more surgery - maybe removing my other breast and ovaries) it's good to be able to find out I guess. Just wondered if it's something offered to you guys in the US as a matter of course or something you need to ask for. Bye for now. K.",
      "MessageIndex": 1661,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Apr 2, 2009 04:16AM KM47 wrote: Hi Jewels, Sadly I have to join the ending-up-in-hospital party. Was admitted yesterday with a fever which they believe is due to an infection. My neutraphil count was 0.2 when they admitted me and dropped down to 0 today so they have me in protective isolation and are pumping me full of antibiotics. If the count doesn't rise by Saturday they will give me a shot of something to stimulate the cells which I think is what many of you have. Knowing how awful that isfor you guys I asked about the side effects and he said \"body aches\". I've been aching since last Friday from the taxotere so that is not great news. Still, as my husband said, it's better than a life-threatening infection. So they think I'll be here until Sat, but the doc warned me it could be longer -- maybe a week depending on how long it take my neutraphils to get above .5 again. Typically this has all happened while my husband is overseas. Luckily I have some great friends who are very supportive - one of whom who went and got my laptop for me tonight so I can be connected to the outside world. Anyway, hope you are all doing better. K.",
      "MessageIndex": 1766,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Apr 4, 2009 09:49PM KM47 wrote: Neutrophil update: 0.1! Yay...they are finally on the move!",
      "MessageIndex": 1796,
      "PostDate": "04/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Apr 5, 2009 07:52PM KM47 wrote: Lisalisa, I am seeing the radiation oncologist on Thursday to find out if I am having radiation...Of course in order to be able to see her I'll have to get out of hospital first! K.",
      "MessageIndex": 1802,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Apr 5, 2009 11:02PM KM47 wrote: Thanks kt57. The doctors have now said they want me at 1.0 before they let me go home, but they're confident that, as you say, once they start reproducing they go up quickly and that tomorrow I'll be at 1.0 anyway. How long were you neutropenic for? Were many changes made to your treatment to address it?  My doctor said I may be given the G-CSF shot as a matter of course with my last two treatments but I've managed to avoid having to have it this time around since the neutrophils have come up on their own (much to my relief - i was a bit nervous about the shot). Renrel, best of luck with the diet over the next two weeks. Look after yourself as best you can.",
      "MessageIndex": 1805,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jan 23, 2009 04:45PM KM47 wrote: Jess, I haven't spoken too much with my onc about Taxotere, but I did talk with my oncology nurse. She said that generally FEC is tougher nausea-wise than Taxotere - she said people generally cope better on it than with FEC. But I guess everyone is different so no guarantees - I'll see what my onc says when I next see her and let you know. According to the SE sheet I have for Taxotere though, the common side effects are low blood count, hair loss, fluid retention, mouth ulcers and general weakness/fatigue. Uncommon ones include things like nausea and vomiting. So maybe you doctor expects you to be feeling more tired rather than sick as such. Good news re the WBC. I don't have mine tested until Feb 2 so by then hopefully it'll all be okay.",
      "MessageIndex": 715,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jan 29, 2009 07:14PM KM47 wrote: Hey there Jess....interesting to hear you say you still have no hair loss...Mine started to fall out in the shower this morning - two weeks and one day on from the first FEC treatment. My head had felt a bit tender the past two days so I had a feeling something would happen soon. I got a bit teary eyed as I watched it fall and then told myself (yes, out loud, in the shower) to pull myself together. I told myself it's the chemo working, not the cancer doing this and that if hair loss is my biggest concern right now then that is a good thing. I'll be shaving the head completely in the next day or two and I suspect there will be some more tears then but that's okay - I'm not going to beat myself up about that. I think the toughest thing is that the lack of hair will be a reminder of what I'm going through - up until now, apart from a bit of weight loss, I look fit and healthy. I also feel pretty good. Anyway, less than a week go to until treatment two....then only four to go.",
      "MessageIndex": 870,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Mar 1, 2009 10:32PM KM47 wrote: Hi Thanks for those who wished me well with my WBC  -- today it was up to 2.7! So I was able to go ahead with my 3rd round. I'm hoping I'll be able to head way tomorrow as planned. I feel a lot more fuzzy-headed than I did the previous two times and more tired but I guess that's what you get when you keep having intravenous drugs! I thought I felt a bit of nausea coming on before and remembered a tip I read on here somewhere about having an iceblock (I'm not sure if you call them that in the States -- I'm talking about a frozen lolly on a stick!). Well I had a lemonade one and it made me feel instantly better! So I recommend that to everyone. Jess, yes that's a good point - I forgotten that we were half way through now. My oncologist is adament the nausea is less likely with the taxotere than the FEC so hopefully you'll be pleasantly surprised! Of course we may both be so tired and achy we won't notice! Interesting you had a tough time with #3. I only had my treatment this morning (and it's late afternoon as I write this) and so far I feel okay but very tired and have had a couple of waves of what I think were nausea but I'm not sure if it's in my head. I'm hoping I stay okay to fly out of town tomorrow morning... BerkelyKim - Neulasta or Neupogen have not been offered. I had a friend who had quite strong chemo last year - she had to have her treatment every two weeks and had to inject herself with something (which I presume was Neulasta or something like it) every night after the first week to ensure her count would be high enough for her next treatment. However for those of us having three-weekly treatment it doesn't appear to be an option. Is it a standard thing in the US? I must ask about my oncologist. Perhaps they may use it here if your WBC just doesn't move. Think I will go and lie on the sofa. I tried to have a nap in bed earlier but although I'm tired I couldn't seem to be able to nap for more than half an hour or so. I'm not sure how I can be tired but not sleepy...perhaps the steroids are to blame! Hugs to all K.",
      "MessageIndex": 1409,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Mar 23, 2009 07:21PM KM47 wrote: Hi everyone, I've been busy with work this month so haven't had a chance to visit the boards in a while. Right now I'm lying on a bed in the oncology unit receiving Herceptin. When it's done soon they'll give me the Doecetaxol (Taxotere). Am nervous about side effects from both drugs, but one thing I've learnt from reading these posts is everyone is different so I'll just have to wait and see how I react. They told me it'd be a long day today since they have to keep me for a few hours to make sure I don't react to the Hereptin so that's why I brought my laptop. What I'd really like to do is sleep but the extra steroids I'm on make that impossible unfortunately. I was still awake in the wee hours this morning... Thinking of you all.",
      "MessageIndex": 1646,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Mar 24, 2009 05:32PM KM47 wrote: Hi, Just as quick note to say thanks for your good wishes. It's mid-morning the day after my 1st taxotere (but 4th chemo) and 1st Herceptin treatment and so far I feel fine. The steroids had me awake to the wee hours again but once I went to sleep I slept soundly until about 7am. I feel incredibly tired but the breakfast steroids mean I still don't feel sleepy. They will wear off around lunchtime I'm guessing (judging by my recent patterns) so am hopeful I can get a nap in then. Luckily I work from home so can juggle my hours to suit my sleep patterns. I finish the steroids tomorrow so hopefully will be sleeping normally again by Friday night. Only thing I've had so far has been a sore neck last night - not sure if it was a side effect or the way I was lying but two Panadol got ride of it in 30 minutes and I have no aches or pains so far this morning.  Thinking of you all and sending out good vibes. K. PS - my oncology nurse yesterday recommended nail hardener and dark nail polish to prevent nail splitting. Has anyone tried either/both of these? My nails were fine with my first three treatments (of FEC) but it sounds like they may not be with the taxotere.",
      "MessageIndex": 1649,
      "PostDate": "24/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Mar 29, 2009 04:43PM KM47 wrote: HI everyone, Misty, my thoughts are with you and your son and I hope you will receive good news soon. I can't imagine how hard a time it must be for you right now. I had been feeling a bit sorry for myself today but reading what you are going through put things into perspective for me. I'm at day six after treatment and have not felt quite so good with the taxotere as I did with the FEC. I had the treatment last Tuesday and was okay until Friday when I started to get achy, particularly in my back. I've taken pain medication but I'm not sure that it's done much. It's not severe pain but enough to make me feel lousy.  I was surprised it took until three days after the taxotere to get the aches and wonder if they started once the steroids got out of my system (I stopped takikng those on Wed night). I am hoping they might go soon - I'm trying to tell myself I'm better today but I'm not sure. How long does it last for other people??? I don't have neulasta like some of you, so mine must be due to the taxotere...or potentially the Herceptin which I had for the first time as well -- I really hope it's not the Herceptin because I don't know if I could handle feeling like this every three weeks for the whole year of Herceptin treatment. I have two more Taxoteres to go so I guess I can handle two more bouts of feeling like this.Hopefully I might be able to get something more effective for the pain. Jess, no red streaks for me- but very red cheeks (the inflammatory response the doctors warned about I guess). My cheeks are back to normal now but from Thursday through to about Saturday they were really red. My tongue also got a bit sore on Friday but that's gone again now. It's interesting to read about the cost of the BRCA test in the US - here in New Zealand it is covered under the public health system so you don't have to worry about having health insurance to get it. Now I've decided to have it, I just want to get it over with. Unfortunately the genetic counsellors only come to the city I live in every three months so am waiting for an appointment the next time they come. There has been a lot of cancer in my family, but only once incidence of breast cancer that I know of so am hoping that means I, and my female relatives, do not carry the gene...(although obviously I realise it doesn't guarantee anything). Jess my surgeon said that if I did not have the gene he would not recommend having the other breast off. However, it's a different story if it I do. I understand what you mean about the sitting duck thing. I just feel too sore and tired right now to think clearly about it. I haven't really discussed with the doctors in detail about having my ovaries removed but if I carry the gene I guess that might be the case. I'm not sure if that would then mean I would avoid the whole five-year Tamoxifen treatment then. Sometimes it's all a bit much really...",
      "MessageIndex": 1710,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Mar 5, 2009 04:01PM KM47 wrote: Just a quick note to say thanks to all of you who have posted your thoughts over the past couple of days. It makes me feel less alone to know others are experiencing the same feelings on this rollercoaster.",
      "MessageIndex": 1443,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Apr 3, 2009 04:09PM KM47 wrote: Hi guys, It's been interesting following all these discussions over the past couple of days. The most impressive thing is that we are all making informed choices. I'm still in hospital, which is frustrating. Yesterday my white blood cell count went from 0.8 to 1.2, which is promising but my neutraphils were still at 0.0. If they don't start coming up today they are going to give me a G-CSF (Granulocyte colony-stimulating factor). The Neulasta many of you had is one type of G-CSF (a pegylated filgrastim). There is also a lenograstim (Granocyte) and a filgrastim (Neupogen®). I found all this out on http://www.cancerbackup.org.uk/Treatments/Supportivetherapies/HaematopoieticGrowthFactors by the way, My temperature still isn't behaving which is making me quite nervous. They originally thought I'd be home yesterday or today but my body is not cooperating.  The doctor said that with my next two treatments they may give me the G-CSF as a matter of course so that will be good - I don't want to go through this again. Wish my husband wasn't away.  Hope everyone else is doing okay. K.",
      "MessageIndex": 1786,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Apr 14, 2009 03:53AM KM47 wrote: Wow, I've been away for a few days and sat here with tears streaming down my face and then big smiles (and some happy tears) while reading about Misty and DDLatt. Misty, I am so happy for you and your son. I'm getting misty-eyed again just typing this. And DDlatt, I just couldn't believe that it would be cancer but I didn't finish holding my  breath until I got to the page with your good news. I have been out of hospital a week and other than a bit of tiredness (apparently quite common after a week confined to one room) I'm doing okay.  I saw my oncologist on Thurs and because my neutrophils had gone up to 3.0 she gave me the all clear to see DH as long as he had no vomiting or diarrhoea by the time he got home on Friday. He didn't so we were able to see each other - but we still haven't been able to give each other a kiss hello just in case. I asked my oncologist about some of the Tamoxifen issues raised here. 1. Test for whether I am a low or high receptor: She said the test isn't widely available here but she said even if it was it's hard to know what to do with the results.She said it's not proven yet that the drug isn't worthwhile even if you are a low receptor. 2. Risk of uterine cancer: She said it's very small increased risk and if it does develop, symptoms appear quickly and it can be treated early. 3. What happens if you go through menopause during the five year period: two years into the treatment they will test my hormone levels to see whether I've gone through menopause and in that case a switch of drugs may be recommended. She said it is good to be aware of this date so I know to ask two years in about the test if the medical professionals overlook it. I also asked about the blurry vision. She said that is a definite side effect and to wait to see an optometrist until 4-6 weeks after I finish chemo. My second lot of good news on Thursday (in addition to being able to see DH) was that they decided against delaying my chemo scheduled for today. However, they did decrease the dosage a little in the hope it won't knock my neutrophils so much and it may also help reduce the aches I had for a week last time. I finished my chemo about 7 hours ago and feel fine (last time the aching didn't start until the Friday), but the steroids have given me that dreadful extreme tiredness but unable to sleep feeling. Also saw my radiation oncologist for the first time - she is also just lovely. I am constantly delighted to meet wonderful medical professionals (the doctors and nurses in hospital were also just lovely). I am to have radiation therapy two to three weeks after chemo finishes - so a start in late May or early June. My radiation oncologist said that a year ago and certainly two years ago wouldn't have bothered with the radiation therapy in my case. Basically it was only done (here anyway) if you had four or more nodes affected under your arm and/or the margins of what they removed from the breast weren't clear. I had two nodes involved (although the doc said it was more like one and a half because the second one was so tiny) and my margins were really clear. However in the past year or two some studies are coming out showing that treatment is worthwhile even if only one to three nodes were affected. I don't need radiation to the underarm area or the breast but they are going to radiate an area to the right of the affected breast where internal mammary lymph nodes sit. The idea is to blast any cancer cells that moved from the breast into those nodes. My cancer was multifocal and in the top half of the breast so a perfect case for spread into those nodes - it's not likely but she said because my prognosis is so good and I'm so young, and the side effects are minimal, it's worth doing. She gave me three medical journal articles explaining recent studies including one from The Lancet which was excellent. One comprehensive study showed a 23% recurrence in cases such as mine without radiotherapy and this dropped to 6% with radiotherapy. If there did happen to be a recurrence in those internal mammary lymph nodes my doctor said there's no way to cure it so as far as I'm concerned it's no-brainer really. She said she is quite aggressive in her approach and other radiation oncologists might say I don't need to bother. But I don't want to look back and wish I'd had it two years down the track. It's only five weeks out of my, hopefully long, life. There was something else I was going to add that I thought might be of interest but chemo brain has reared its ugly head and now I can't remember what it was... Anyway, my thoughts are with you all - sounds like it's been a challenging couple of weeks for everyone.But we will get there. I certainly draw strength from you all. Thanks so much for your kind words throughout my recent hospital stay. Love K.",
      "MessageIndex": 1961,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Apr 14, 2009 05:31PM - edited Apr 14, 2009 05:32PM by KM47 Jess, I will see if I can find the articles my oncologist gave me for you online - if I can't I'll see if she can email them to me and I can send them to you (failing that I can scan them in and  send them to you). I felt the three articles together made compelling reading, but we are all different in our diagonoses I guess. As I said my radiation oncologist admits to being quite aggressive in her approach so she could be being over-cautious. I just have to get a wee bit of work done this morning but once I'm clear I'll do a search for them. Hot flushes anyone? I'm still a year away from Tamoxifen but last night (night after chemo) I woke four or five times with hot flushes. They didn't last long but they were interupting what little sleep I'm getting on steroids! Anyone have any ideas on how to cope with them? Genetic test. Remembered what chemo brain made me forget last night - I have an appointment to see genetic services on the 23rd of this month to find out about the genetic test. Have to take family history of cancer along, along with consent forms for family member's medical history and will take it from there. Will let you guys know what the process is after that first meeting. Talk soon K.",
      "MessageIndex": 1966,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Apr 6, 2009 04:59PM KM47 wrote: Just an update - my neutrophils got up to 0.5 all by themselves yesterday - no shot required! My fever is also gone. Before they send me home from hospital they want the neutrophils to be at 1.0 which they think I may well get to today. Can't believe I've almost been in here a week! K.",
      "MessageIndex": 1813,
      "PostDate": "06/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "May 8, 2009 12:20AM KM47 wrote: Just a quick note to report in -- am finished chemo!!!!!!!!!!!!!!! Had my last infusion on Tuesday. Am a bit tired and have a few side effects but I don't think I care anymore because this is the last one. Congrats to everyone else who is done or is on the way there. In some ways it's funny to feel relieved when there is still so much treatment left to go for me - 15 more Herceptin infusions until March next year, 25 radiation treatments starting in a couple of weeks and 1825 (!) Tamoxifen tablets starting at the end of rads. But I feel like I can see the light at the end of the tunnel now. My hair is growing back (gray!) but my fingernails look like they might be about to fall off. Love to you all. K.",
      "MessageIndex": 2254,
      "PostDate": "08/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jun 21, 2009 05:22AM KM47 wrote: Hi Jewels, I've been out of touch for a while but just wanted to say congrats to Patti and Phyllis and to everyone who made it through!!  It's so nice to know we're all done. I'm most of the way through my rads - 19 down, 6 to go. Just started to get some tenderness and redness in past few days. My left side is particularly tender but at least I can see the light at the end of  the tunnel. Have had two Herceptin infusions without the chemo now and I don't seem to get any side effects from Herceptin on its own so that's a relief since those infusions will continue every three weeks until March next year (I've had 5 so 13 more to go). I start Tamoxifen a week after I finish rads. Not looking forward to that - particularly hot flushes (or flashes as I think you call them in the US). I'm already having them but am a wee bit worried they'll get worse with Tamoxifen but who knows? Anyway, great to hear everyone getting through it all and starting to get hair back etc (I've had mine coloured and cut already --- couldn't stand the grays and my hairdresser reckoned I needed a trim around my ears!). Hugs to all K.",
      "MessageIndex": 2649,
      "PostDate": "21/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jun 22, 2009 08:16PM KM47 wrote: Holtbolt - have bookmarked the site and will go and vote as soon as the thumbs up sign icon appears (I looked for it today since it's the 23rd here - but obviousy it's not in the US yet!). Best of luck with the competition. I'll ask others I know to vote as well. Regarding hair, mine actually started growing back midway though chemo treatment when I switched from FEC to Tax. My oncologist said everyone's hair falls out with FEC but only some people's with Tax. I never lost all my hair completely and it's growing back quite quickly but still looks thin. But, at the risk of providing too much information, is everyone's hair growing back everyone equally? Hair on other parts of my body is very sparse and while I'm pleased about that in terms of not having to shave as much, I just wondered what was happening with others. My eyebrows never completely went but are a lot thinner (I naturally have very thick eyebrows so it would take a lot to get rid of them completely!). My eyelashes are finally coming in again but am nervous about losing them again. They've fallen out twice now and I remember reading somewhere that a lot of women found they fell out three times before they stayed permanently. I hope that's not the case -- I hate looking like I'm crying when I'm not. Continuing to moan....I am over the hot flashes. They seem to be getting worse not better (and I haven't even started Tamoxifen yet). I read on this site a recommendation to write down when you have them and what you were doing so you can find out your triggers so am going to do that from today. At night my Chillow has been great (http://www.chillow.co.uk/2008/template/). Thanks Lisa (I think?) for recommending it. Anyway, I'll stop moaning now. Just four more rads to go thank goodness. Am getting sore and tired...whoops, started moaning again. I've noticed if I do moan to people lately  and they say something positive I feel a bit annoyed which is odd because normally I get annoyed if people are negative. I think that after eight months of surgery, chemo, rads and Herceptin I'm ready for a break and I know what I will be getting instead is nine more months of Herpeptin and five years of Tamoxifen. I'm not really moaning deep down because I know these treatments all increase my survival rate (and I've been through the worst of the treatment) and I'm lucky to live in a country where such treatments are available. And I know there are people worse of than me - I see them every day when I go in for my radiotherapy. It's just that sometimes I feel sick of being a patient. I want my life back. Maybe I just need to take a nap. Hugs to all. K.",
      "MessageIndex": 2661,
      "PostDate": "22/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Jan 13, 2009 01:33PM KM47 wrote: Just want to say thankyou to Rock and to all the other posters on this forum. I start chemo tomorrow  (FEC) and am terrified. However, this board has helped me at least do some preparation, which makes me feel like I have some control, which helps for some reason. Today I'll be buying crackers, hand sanitiser, breath mints, cottage cheese, popsicles and lemons! Don't think I've ever had such an eclectic shopping list! Thanks again to everyone who has given advice - I hope I'll be able to help others once I've been through it.",
      "MessageIndex": 225,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "KM47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77454/profile",
      "Content": "Mar 1, 2009 10:09PM - edited Mar 1, 2009 10:13PM by KM47 Hi there - it's lovely you are there for your Mum (sorry, Mom - we say Mum in NZ so I can't bring myself to type Mom!). She's lucky to have a caring daughter there for her. I thought I would post a link to another forum that might be of help for you to read through (in addition to the helpful advice you will definitely receive here). You don't say the type of reconstruction your Mum is having, but I had a mastectomy and a tram flap reconstruction last December and this link is to a thread all about that type of surgery and if that's what your Mum is having it will give you an idea of the steps she will take in her recovery. Speaking from my own experience having meals cooked and our dog walked were the two best things to have done by friends! Anyway, I'll post this thread and you can read through and see what you think. community.breastcancer.org/for...  K.",
      "MessageIndex": 1,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/729990",
      "Title": "My mom's surgery 3/10/09 strongasmymom strongasmymom"
    }
  ]
}