{
  "AuthorID": "kmab15",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71824/profile",
  "Posts": [
    {
      "AuthorID": "kmab15",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71824/profile",
      "Content": "Dec 6, 2008 03:40PM kmab15 wrote: Seabee, I requested a copy of my Oncotype report so I have reviewed it.  Can you explain what you mean about how negative the HER2 is?  Are you saying that the more negative it is, the higher the overall Oncotype comes back? Also, I am not sure what you mean about a 2nd experience with cancer influencing the recurrence score.  This cancer is being considered a new primary and not a recurrence. Genomic Health did not know this was my second time with breast cancer when they did the test.  Thanks for your response and suggestions!",
      "MessageIndex": 7,
      "PostDate": "06/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725433",
      "Title": "Oncotype DX Score - shocked at oncologist recommendation kmab15 otter"
    },
    {
      "AuthorID": "kmab15",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71824/profile",
      "Content": "kmab15 wrote: Hi ~ I know that many women and oncologists place so much emphasis on the Oncotype DX scores that we get back.  I want to let you know of my recent experience.  I was diagnosed with BC in early September.  At the time I was told it was DCIS only.  I felt very fortunate that was all it was. I had BC 15 years ago (IDC), had lumpectomy, negative nodes, radiation and tamoxifen for 5 years.  So this time it meant mastectomy for sure on the radiated/cancer side but I opted for bi-lateral mastectomy and immediate Latissimus Dorsi Flap reconstruction.  After my pathology report came back from the mastectomies, my BS said a small (1 cm) IDC tumor was found.  I was devastated because I knew this would change the course of treatment.  As we all do, I waited to hear the specifics of my cancer.  The characteristics of my particular cancer were extremely favorable... ER+ (290), PR+, HER2-, Grade 1, K167 (0), good Nottingham score - an overall unagressive cancer.  I was happy and relieved to get these results.  However, my Oncotype came back at 29!  My BS and Oncologist were shocked.  They just couldn't understand how it could be at the high end of the intermediate range with such favorable test results.  I saw my oncologist yesterday for the first time and expected him to recommend chemo just because of the Oncotype score.  He didn't, said I did not need chemo with everything coming back so favorable - Arimidex only. He said he can't be sure but believes that its possible that some of the DCIS was mixed in with the IDC at the time of Oncotype testing which can alter the results of the test. He also said that the Oncotype is not perfect, like anything else.  I am doing well 6 weeks out from the lat dorsi reconstruction.  I spend quite a bit of time on these discussion boards and it has been very helpful to me to hear all of your stories and experiences.  I pray that everyone does well with their particular course of treatment and stays strong.  This is not an easy road to travel and as long as we believe we can get through all of this, we will be fine. I am not saying you shouldn't believe or trust your Oncotype results.  I'm sure it is a very good tool to use to determine whether chemo is appropriate and will benefit someone with ER+, PR+, node negative breast cancer.  All I am saying is it may not be accurate 100% of the time. Best to all of you and Happy Holidays! KB Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725433",
      "Title": "Oncotype DX Score - shocked at oncologist recommendation kmab15 otter"
    },
    {
      "AuthorID": "kmab15",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71824/profile",
      "Content": "Dec 4, 2008 10:23AM kmab15 wrote: Ginnysue - I'm glad that you trust your oncologist as that is very important.  Just learn as much as you can about your breast cancer and make sure you are informed of all test results (ER, PR, HER2, grade, K167, etc.).  If you become an \"educated\" patient, this will make your overall understanding and decisions much easier.  If you have any questions or need to talk, please write back and one of us will be here to help if we can.  You can count on that. Take care ~ Hugs :-)",
      "MessageIndex": 2,
      "PostDate": "04/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725433",
      "Title": "Oncotype DX Score - shocked at oncologist recommendation kmab15 otter"
    },
    {
      "AuthorID": "kmab15",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71824/profile",
      "Content": "Dec 6, 2008 03:15PM kmab15 wrote: Mattscot - You are right, some doctors would not do the Oncotype based on favorable results of all other tests.  My oncologist told me he probably wouldn't have ordered it had he seen all of my other results.  My BS was the one who ordered the Oncotype prior to me seeing my oncologist for the first time.",
      "MessageIndex": 6,
      "PostDate": "06/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725433",
      "Title": "Oncotype DX Score - shocked at oncologist recommendation kmab15 otter"
    }
  ]
}