{
  "AuthorID": "kmscarpa",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128991/profile",
  "Posts": [
    {
      "AuthorID": "kmscarpa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128991/profile",
      "Content": "May 23, 2011 01:40AM kmscarpa wrote: So I had my Breast MRI last weekend and should hopefully hear the results tomorrow...It is TORTURE!  I don't have a good feeling about it because I have a lymphnode that is swollen on my right side (the side of concern.)  Praying for good results!",
      "MessageIndex": 5,
      "PostDate": "23/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/768799",
      "Title": "28 yr old with bad mammo and us kmscarpa AnewBeginning"
    },
    {
      "AuthorID": "kmscarpa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128991/profile",
      "Content": "kmscarpa wrote: Hello my name is Kristina I am 28 years old and have a family history of breast cancer.  My grandma was 50 and my cousin was 37 when diagnosed.  My cousin was tested for the BRCA gene and she did not have it.    I recently found a lump in my right breast and went into the doc.  Given my family history he sent me right in for a mammo and ultra sound.  The lump that I was feeling ended up being cyst but both the ultrasound tech and mammo tech said that I had calcification's in my breasts.  The radiologist came in and ultrasounded me himself and said that my breast tissue looked abnormal but he could not find a definite mass.  He is sending me in for a MRI so that if he needs to biopsy then he will know where exactly to do it.  I got the report and I was wondering if anyone had an opinion on them. Mammogram results-right breast No definite mass can be seen.  There are numerous mircocalcifications in the upper-outer quadrant of the right breast which could be malignant calcification's (for right side.)  There are some calcification's deep to the areola on the left side.  Onultrasonography, the upper-outer quadrant of the breast had a irregularly hypoechoic appearance with some cysts.   Birades Code DO-incomplete-needs additional info Ultrasound-right breast No distinct mass is seem but there is an extensive area of abnormal echogenicity in the upper outer quadrant of the breast.  It contains some small cysts.  Mircocalcifications are also present within it.  There is an area of hypodensity which is more suspicious of a carcinoma. I am of course completely freaked out...I have also been having right arm pain and the sides of my ribs were my lymph nodes are sore.  If it looks likely that I have cancer then I would like to know...I am a single mother to a beautiful 3 year old little boy.  So please and thoughts, comments, or similar experiences would be much appreciate! Thank you!    Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/768799",
      "Title": "28 yr old with bad mammo and us kmscarpa AnewBeginning"
    },
    {
      "AuthorID": "kmscarpa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128991/profile",
      "Content": "May 17, 2011 03:29PM kmscarpa wrote: Thank you for your repilies.  I am schedule for an breast MRI tomorrow and am very scared.  How long does it take to get results?  How likely is it that it is cancer?  Anyone have any insight? Thank you!  Kristina",
      "MessageIndex": 2,
      "PostDate": "17/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/768799",
      "Title": "28 yr old with bad mammo and us kmscarpa AnewBeginning"
    }
  ]
}