{
  "AuthorID": "Kmtmom1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156309/profile",
  "Posts": [
    {
      "AuthorID": "Kmtmom1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156309/profile",
      "Content": "Kmtmom1 wrote: my mom is almost at her 15yr mark in remission. She found a lump under Her arm (armpit area) and had an u/s. They didn't call with any results but that she needed to go for a PET scan the next morning. Her general practitioner is ordering the tests. Why would they have ordered a pet scan? Does that mean it's cancer? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/827458",
      "Title": "Pet scan? Kmtmom1 WinningSoFar"
    },
    {
      "AuthorID": "Kmtmom1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156309/profile",
      "Content": "Jul 28, 2012 09:40AM Kmtmom1 wrote: So happy for you! Great news! I am waiting for a biopsy so your story gives me more hope:) I too have learned more about bc than I thought I'd ever need to know in the past 2 weeks. Go celebrate:)",
      "MessageIndex": 3,
      "PostDate": "28/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/791236",
      "Title": "Just got results.. Mary1NYS SelenaWolf"
    },
    {
      "AuthorID": "Kmtmom1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156309/profile",
      "Content": "Jul 14, 2012 11:24AM Kmtmom1 wrote: I have an appt Monday at 9:30. I'll keep you guys posted. Thank you for your comments!",
      "MessageIndex": 4,
      "PostDate": "14/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/790547",
      "Title": "Found a lump. What do you think? Kmtmom1 msphil"
    },
    {
      "AuthorID": "Kmtmom1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156309/profile",
      "Content": "Kmtmom1 wrote: I found a lump in my left breast 2 nights ago. It's hard and movable. It's at the 11oclock position. The first night it felt like it was about the size of a hot tamale (about the size and shape from the top of my finger to the first crease), but I just noticed it has another round lump on the end towards my nipple. I can't tell if they are connected or not. If they are, it definitely gets thinner before the other lump starts. It isn't painful. My mom had breast cancer at the age of 39. Double mastectomy. Survivor:) She does not carry the gene. I was having some pain in my other breast last yr while pregnant and had a mammogram that just showed fibrocystic (sp?) changes due to being pregnant. I was told I had dense breast tissue. I was supposed to go back 4mo later for a breast MRI but my son was just born so I just never did. I know It can be anything, but what do you guys think? If it is cancer, could it have grown like this in a year? With the size/shape, what does this sound like?? I'm scared. I'm 29 and my son is 17mo. Need prayers please:) and, please be honest as to what you think of sounds like in your opinion. Thank u!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/790547",
      "Title": "Found a lump. What do you think? Kmtmom1 msphil"
    },
    {
      "AuthorID": "Kmtmom1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156309/profile",
      "Content": "Jul 17, 2012 03:31PM Kmtmom1 wrote: I saw the surgeon and she did an u/s then sent me for a mammo, then the radiologist ordered another u/s.  They are wanting to compare my mammo from yesterday to my last one in 2010 (I thought it was last year).  Time flies when you have a baby!  Anyway, The surgeon sounded confident it was fibrocystic changes and all was normal.  I am also waiting on the mammo results for insurance purposes, then they are scheduling an MRI in the next few weeks.  Thank you for all your advice and comments.  I will post results when I have them. ",
      "MessageIndex": 5,
      "PostDate": "17/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/790547",
      "Title": "Found a lump. What do you think? Kmtmom1 msphil"
    },
    {
      "AuthorID": "Kmtmom1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156309/profile",
      "Content": "Kmtmom1 wrote: I have an appt in the morning to have a lump looked at. I found a lump about the size of a hot tamale (oblong in shape, about the size and shape from the first crease of my middle finger to the top, an inch or so long and .5inch wide). It has a smaller lump off the end more round but I can't tell if they are connected or not. It's in my left breast, at the 11oclock position. The smaller round lump is toward my nipple. I didn't notice the smaller one off the end until 2 days later. Not sure how I missed it when I felt the other one. It's movable and painless. My mom had breast cancer at the age of 39, I am 29. I had a mammogram last year that showed I had dense breast tissue and fibrocystic changes due to being pregnant. My question is if it is fibroadenoma is it possible it could have grown to an inch within a year? I stopped nursing 7mo ago do its not related to my pregnancy or nursing. What does this sound like to you? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790603",
      "Title": "Fibroadenoma? Kmtmom1 Janet456"
    }
  ]
}