{
  "AuthorID": "kmur",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102044/profile",
  "Posts": [
    {
      "AuthorID": "kmur",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102044/profile",
      "Content": "Jul 4, 2011 04:51PM kmur wrote: Hi jbrickley,  Just wanted to let you know I have heard of many women who have followed this method of treatment. I think by treating in this way the doctors are able to actually see the tumor respond in the way it shrinks with the chemo. I am by no means an expert in this , I too have breast cancer and during chemo met women who are being treated much like your mom. When it was time for surgery the tumor was much smaller and was removed . There is much hope with the new rounds of chemo so do think positively and I wish you and your mom lots of prayers and good wishes.I hope some of the women who have had this exact treatment will respond soon,but as I said please know this is a common means of treatment. Kim",
      "MessageIndex": 2,
      "PostDate": "04/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/771174",
      "Title": "My Mom has breat cancer jbrickley AnacortesGirl"
    },
    {
      "AuthorID": "kmur",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102044/profile",
      "Content": "Jul 2, 2011 03:31PM kmur wrote: Hi Rabbit, My Dr. is also Dr. Hargis. Just about everyone I know sees him. I go to his office downtown. I wish you lots of luck with your next treatment. They were always very good about asking each time what kind of SE I had. So do let them know...it will hopefully be better next time. I do not attend any meetings. I have just started to speak about it in this forum. There are lots of ladies that can to very helpful. Take Care, Kim",
      "MessageIndex": 22,
      "PostDate": "02/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770994",
      "Title": "sick on the first day? rabbit rabbit"
    },
    {
      "AuthorID": "kmur",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102044/profile",
      "Content": "Jul 3, 2011 04:30AM - edited Jul 3, 2011 04:31AM by kmur Hi Rabbit- I finished chemo in Sept and then did all of my 28 rads at the Baptist East hospital off of Old Henry. Dr. Hargis has very good nurses and I meet woman all the time that have been patients. I am highly er/pr positive. Dr. Hargis had me do surgery then chemo/rads now Fareston. It is an ER blocker. Thank you for asking me...I really do feel good. Everyone handles chemo in such a different way. I think you will do well. Just let Dr. Hargis assistant know how you felt and I think they will be able to get you through your treatments. Take care, Kim",
      "MessageIndex": 27,
      "PostDate": "03/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770994",
      "Title": "sick on the first day? rabbit rabbit"
    },
    {
      "AuthorID": "kmur",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102044/profile",
      "Content": "Jul 2, 2011 10:46AM kmur wrote: Hi Rabbit~ I hope you are feeling better today. I  did 3 cycles of FEC followed by 3 taxotere. I have a difficult time keeping up with what the abbreviated letters stand for,but wanted to let you know ~I didn't actually get sick - I would usually come home feeling  fine,however later in the evening I would feel kind of \"yucky\" is the only way I can describe it. I also felt as if I could not get comfy. I felt as if my legs were restless...not sure if that helps. I am in the Louisville area. Are you receiving chemo in Shelbyville? I know I had anti nausea meds but can not remember what the names are. I did also do Emend- the meds I took were additional. My ONC told me to take them right away at the start of nausea because it is harder for the drug to kick that nausea once it sets in. Do let them know how you are feeling. They may be able to adjust your meds so that you are not sick. Hoping your treatments will go well!! BTW- with the first 3 treatments I did begin to feel better by the second day and each day after was better. Much luck to you, Kim",
      "MessageIndex": 20,
      "PostDate": "02/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770994",
      "Title": "sick on the first day? rabbit rabbit"
    },
    {
      "AuthorID": "kmur",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102044/profile",
      "Content": "Jul 3, 2011 05:59AM kmur wrote: Hi Rabbit~ Yes, I had a port. My BS took care of the port along with my BMX. I left the port in until my exchange surgery which just took place May 3rd. The port really didn't bother me too much,but I am happy to have it out!!  One thing I did keep on hand are Popsicles. Sounds weird but the cold does seem to help with mouth sores. I have also heard of taking ice water with you to treatment to help with mouth issues. I did get thrush but it was taken care of with antibiotics. Like I said seems everyone is so different. I may have SE you will not have and you may have SE I never had. That is one thing I learned along the way. This chemo stuff is not the same for all.",
      "MessageIndex": 29,
      "PostDate": "03/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770994",
      "Title": "sick on the first day? rabbit rabbit"
    },
    {
      "AuthorID": "kmur",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102044/profile",
      "Content": "Apr 22, 2012 06:52PM kmur wrote:   Hi Mary,    Just thought I would put in my two cents worth....  I was 99% ER + and I think about 87 % PR +..my score was 14% ...at the time I had no clue what this meant..I knew I had node involvement and I knew my cells were grade 3...I think everyone was surprised my score was low...to be honest I still do not understand what it all means. I did 6 rounds chemo and 28 rads. Good luck to you ..I'm sure you will make the right choice. Kim",
      "MessageIndex": 21,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "kmur",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102044/profile",
      "Content": "Apr 23, 2012 03:13AM kmur wrote:  Hi Girls, Wanted to correct my earlier post....I was not thinking about the correct test ..when someone mentioned the Ki67 test..it made my realize...so I must not have had the Oncotype test, I had the Ki67 test and THAT is what came back 14%...sorry to post here in error.",
      "MessageIndex": 28,
      "PostDate": "23/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "kmur",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102044/profile",
      "Content": "May 6, 2012 08:13PM kmur wrote:  Barb, That is a good one and reminded me another quote by Mother Theresa..it goes like this.. \" I know God will not give me more than I can handle, I just wish he didn't trust me so much\"  LOL ...I think I can imagine what she may have been thinking????",
      "MessageIndex": 27,
      "PostDate": "06/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786999",
      "Title": "Please post your favorite or an inspiring quote BarbRocks marymoir"
    },
    {
      "AuthorID": "kmur",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102044/profile",
      "Content": "May 6, 2012 08:11AM kmur wrote:  Hi Barb,  This is a wonderful idea...thought I would share the one I like so much...it reminds me to think more????  \" I've learned that people will forget what you said, people will forget what you did, but people will never forget how you made them feel.\"  Maya Angelou",
      "MessageIndex": 17,
      "PostDate": "06/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786999",
      "Title": "Please post your favorite or an inspiring quote BarbRocks marymoir"
    },
    {
      "AuthorID": "kmur",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102044/profile",
      "Content": "Nov 28, 2011 03:40AM kmur wrote:  Hey Girls...My fellow 40ish friend is faster than me...so slow with the typing for me!! You girls crack me up.. Cowgirl...too funny .... and Weesa If you do have a pub and welcome BC girls ..we may just make a road trip to see you  CHEERS to ALL.     love those little mice",
      "MessageIndex": 69,
      "PostDate": "28/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778300",
      "Title": "Good News for Us Slouchfest Attendees! Celtic_Spirit cycle_babe"
    },
    {
      "AuthorID": "kmur",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102044/profile",
      "Content": "Nov 20, 2011 04:26AM kmur wrote:",
      "MessageIndex": 13,
      "PostDate": "20/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778300",
      "Title": "Good News for Us Slouchfest Attendees! Celtic_Spirit cycle_babe"
    },
    {
      "AuthorID": "kmur",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102044/profile",
      "Content": "Dec 30, 2011 01:51AM kmur wrote: Hey girls, Bluecowgirl....I hope you are feeling better I just wanted to hop on to say I did 28 rads and although I did burn at the end it was not too bad. I was given a script cream and it worked very well. The skin that came off was ,well, GROSS but I made it YAY... I know you will get there too Fightlikeagirl.... Everyone is so different I think. I thought taxotere was hard others thought it was easy. Just wanted to send you some positive thoughts. Rads for me were much easier than chemo and was my small light at the end of this tunnel and this crazy year +. I am now one year out from rads and all healed ( little bit tighter on the radiated side but otherwise all good) now just need to keep on !!! Good luck to all you girls Kim",
      "MessageIndex": 84,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/777460",
      "Title": "\"Easy\" part of treatment? MY A**! BlueCowgirl Tazzy"
    },
    {
      "AuthorID": "kmur",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102044/profile",
      "Content": "Jan 2, 2012 09:36AM kmur wrote: Dave~ Peace be with you and your family. So sad this disease. I do not know Kimberly, but I must think she will be in heaven and she will be \"her\"again . So sorry you are going through this. Kim",
      "MessageIndex": 117,
      "PostDate": "02/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779804",
      "Title": "Long time since I posted, not goog news dhmeiser scuttlers"
    }
  ]
}