{
  "AuthorID": "koconno87",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61001/profile",
  "Posts": [
    {
      "AuthorID": "koconno87",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61001/profile",
      "Content": "Dec 27, 2007 06:04PM koconno87 wrote: Today, I was dx with a left breast solid mass.  The radiogist strongly advised me to consult a surgeon due to my history of thryoid cancer removal for removal of the mass.  What questions should I be asking the surgeon for my first appt. ?  I also have to decide if I should go back to the surgeon who did my thryoid sugery (general surgeon) or go towards a breast cancer surgeon. ",
      "MessageIndex": 12,
      "PostDate": "27/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/697131",
      "Title": "Seeing Surgeon Wed what questions should I ask RobynDJ43 wendyk13"
    },
    {
      "AuthorID": "koconno87",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61001/profile",
      "Content": "Dec 29, 2007 07:36AM koconno87 wrote: Thank you Shirlann for the message.  I have decided to go with the surgeon who completed my first surgery for thryoid cancer. My anxiety level has been off the charts so I decided to go with the doctor who I am completely comfort with from the last surgery. Since I have been given the dx of the breast mass so  many people have been given me many opinions on what should be done. I know my friends and family are well meaning but sometimes I just wish they would keep their opinions to themselves.  My appt for the surgical consult is 1/8.  I have to admit I am really frighten about going through this because of my history of surgical intervention for thyroid cancer.  This site has been already a great source of encouragement !! ",
      "MessageIndex": 14,
      "PostDate": "29/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/697131",
      "Title": "Seeing Surgeon Wed what questions should I ask RobynDJ43 wendyk13"
    }
  ]
}