{
  "AuthorID": "KorMom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262574/profile",
  "Posts": [
    {
      "AuthorID": "KorMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262574/profile",
      "Content": "KorMom wrote: Hello. I am new to this site and hope I am posting in the right section! I am just looking for some advice and support. I am only 26 years old and have a two year old son. One month ago I started getting sharp pain in my left breast. A couple weeks later and I had spontaneous blood discharging from my nipple. One week after this, a small red patch appeared. Within 48 hours of the first red spot, half of my breast was red. Long story short, I have seen the OB multiple times throughout the symptoms. I was prescribed the strongest antibiotics including an anti-viral(in case of shingles), an anti fungal and an anti-bacterial (mastitis) all within a few days. None of the medications have worked and the redness has no decreased nor has the sharp pains. Should I be worried and how do I get my doctor to take it seriously? Thank you. You are all so strong on this site and have amazing stories, truely. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859864",
      "Title": "Possibly Inflammatory Breast Cancer KorMom KorMom"
    },
    {
      "AuthorID": "KorMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262574/profile",
      "Content": "Nov 4, 2017 09:55AM KorMom wrote: luckily, this weekend the doctors have been calling me to check on me and even after hours called an urgent care so I could pick up the last possible antibiotic at 8pm on a weekend! When I told them it's still getting worse, almost purple, they scheduled me for first thing Monday morning. So I feel like they care and will agree to an ultrasound. I have social anxiety so being my own advocate is difficult:( :(  I'm really concerned now because overnight it's gotten more purple and red speckles like a....hickey? That the best way I can describe it. And then still a large area of general redness and horrible sharp pains.",
      "MessageIndex": 3,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859864",
      "Title": "Possibly Inflammatory Breast Cancer KorMom KorMom"
    },
    {
      "AuthorID": "KorMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262574/profile",
      "Content": "Nov 4, 2017 10:04AM KorMom wrote: Also, I did breastfeed for 4 months and my son is now 2 years old.",
      "MessageIndex": 4,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859864",
      "Title": "Possibly Inflammatory Breast Cancer KorMom KorMom"
    },
    {
      "AuthorID": "KorMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262574/profile",
      "Content": "Nov 4, 2017 11:59AM KorMom wrote: Djmammo, Hopefully it might be just a tiny abcess because after 4 hand breast exams, a lump couldn't be felt and my breast isn't \"sore or tender\". Thanks for giving me some hope for another poasibility!",
      "MessageIndex": 6,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859864",
      "Title": "Possibly Inflammatory Breast Cancer KorMom KorMom"
    },
    {
      "AuthorID": "KorMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262574/profile",
      "Content": "KorMom wrote: I am wondering if anyone happens to live in Spokane and knows of a doctor who is familiar with IBC. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860194",
      "Title": "SPOKANE, WA IBC Specialist??? KorMom KorMom"
    }
  ]
}