{
  "AuthorID": "KPW3",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
  "Posts": [
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 18, 2019 08:30PM KPW3 wrote: Thanks Elizabeth! I’m in NH but would be willing to travel. Will check out the web site. .KP ",
      "MessageIndex": 16,
      "PostDate": "18/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/838364",
      "Title": "Cytoreductive surgery and HIPEC evelym KPW3"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 16, 2019 05:36AM KPW3 wrote: Bump",
      "MessageIndex": 11,
      "PostDate": "16/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/838364",
      "Title": "Cytoreductive surgery and HIPEC evelym KPW3"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 16, 2019 06:01PM KPW3 wrote: I just had a scan show new places in my abdominal “soft tissue\", planning biopsy next week. I'm a bit surprised with history of ducal not lobular and immunotherapy that is resolving a liver met. Very disappointed. But I'm just looking this procedure up to find out options. It doesn't appear that they this in breast cancer anymore....but if you have names I'd love to get them from you EV11.",
      "MessageIndex": 14,
      "PostDate": "16/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/838364",
      "Title": "Cytoreductive surgery and HIPEC evelym KPW3"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Sep 11, 2018 06:35AM KPW3 wrote: Apparently I have developed Keytruda induced nephritis, an acute kidney injury. Apparently it is a drug induced autoimmune thing....so I guess I was responding to the immunotherapy! Keytruda and eribulin are being held and I'm on high dose steriods to reverse kidney damage. I think they caught it fairly early and am hopeful that things can be restarted while closely monitored, but looks like it would take up to 12 weeks for that to happen, if at all. Since I had such a good response from drugs I don't want to completely give up. I have an apt tomorrow to check labs. Will cross post.",
      "MessageIndex": 2116,
      "PostDate": "11/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Sep 23, 2018 04:35AM KPW3 wrote: Well, an update....my kidneys responded really well to the steroids and my creatine is basically normal so I received the Halaven dose Tuesday, although the nephrologist said that Halaven would have been ok with some kidney issues and shouldn't be an issue. They are decreasing the steriods, but will take 6 weeks! They are negatively affecting my sleeping, so now I have to take something for that. But I was very happy to get the Halaven dose at a reduced dose. It's not clear whether I'll ever get the Keytruda/Pembo. The kidneys were a grade 2 injury, for the trial you aren't allowed to receive it again if you have a grade 3. So, we haven't totally ruled it out, but if I have a similar response in the future it may damage my kidneys worse the next time. If I don't get the Keytruda for >12 weeks I think I'm technically off trial. I really want to stay on it, or see what the next scan shows in Oct.",
      "MessageIndex": 2144,
      "PostDate": "23/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 15, 2019 04:15PM KPW3 wrote: JFL, I had already lost eyebrows and eyelashes on Abraxene when I started Havalen. I'm on such a low dose of Havalen now both are growing back, as well as the hair on my head ",
      "MessageIndex": 2259,
      "PostDate": "15/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 18, 2019 07:33PM KPW3 wrote: Check out SKIDA hats....they are made for skiing, nordic are one layer, alpine are fleece lined. Fun designs!",
      "MessageIndex": 2266,
      "PostDate": "18/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 5, 2018 02:48AM KPW3 wrote: Hi Southernsurvivor, If you are looking into a possible clinical trial to start next, most require you to have a \"wash-out period\", where you are on no chemotherapy for 2-6 weeks before you can start the trial drug. Before I started the Halaven & Keytruda I had to be off chemo for weeks (? exact time). And my cancer grows so fast it could have doubled in that time frame....made/makes me very worried....Pray it's working.",
      "MessageIndex": 2035,
      "PostDate": "05/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 28, 2018 05:43PM KPW3 wrote: So, CT scan did show liver responding nicely to treatment, one met remains and it is smaller, the place on breast/axillary where it recurred showed skin/soft tissue/musculature thickening....they aren't sure what to make of that. No new active disease shown. I did receive the pembro and eribulin last week, same flu like symptoms on day #3-4...low grade fever, aches, headache, NO energy. Oh, and my thyroid is now no longer working. I started having issues with it acting up just before I started this trial, so, I'm not sure it's to blame. Started on synthroid....hope it kicks in soon. Was scheduled to receive Eribulin today, but had to have it held due to increase in neuropathy in fingers. I hate to hold it, but I couldn't open the Advil bottle, typing is getting difficult and I am fumble fingers. It tingles, is more intense now instead of numbness.....I don't want it to get worse.",
      "MessageIndex": 2083,
      "PostDate": "28/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Sep 23, 2018 11:48AM KPW3 wrote: Susan, just checked the MD notes and looks like I went from 2.55 mg IV to 2.0 mg IV. This was due to increasing neuropathy. I'm feeling pretty good, there are several things that could be contributing to feeling better....I've been off the chemo/Keytruda for several weeks, my kidneys are recovering....I don't think my neuropathy is worse this week, so that's good. ",
      "MessageIndex": 2146,
      "PostDate": "23/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Sep 29, 2018 09:58AM KPW3 wrote: Awesome!",
      "MessageIndex": 2151,
      "PostDate": "29/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Oct 3, 2018 03:32AM KPW3 wrote: MustangIA, Keytruda is still a question, I won't know for several weeks.....after scans and evaluation at my local hospital and Dana Farber. Technically I could get it, but there are questions whether it would cause worse kidney damage the next time, if there was a reaction. Lulubee, What a horrible fall! I hope you are able to recover more on your week off. Do you take a claritin with the Neulasta? I think that helps me a bit. Susan, Glad to see the neuropathy is a bit better. I think mine didn't progress at least with the decrease in dosage of the Halaven. The steriods are not letting me sleep.....and that is something I've never had issues with. We started Trazodone but I think I need a higher dose. I like getting enough sleep....",
      "MessageIndex": 2155,
      "PostDate": "03/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 16, 2018 02:33AM KPW3 wrote: It looks like my liver mets are responding to the Halaven and Keytruda, I just got a call from the nurses with a preliminary report. I'm very relieved to receive the news.",
      "MessageIndex": 2048,
      "PostDate": "16/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 28, 2018 07:08PM KPW3 wrote: Lulubee, Thanks! I'll ask. My oncologist just left this hospital for one across the state and I have someone new and I don't know what his opinion is. The first one wasn't too thrilled (discouraged everything or said nothing worked). While on abraxane, I was using gloves, but for a 5 min. push with the eribulin I didn't think they would help much.",
      "MessageIndex": 2085,
      "PostDate": "28/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 29, 2018 11:59PM KPW3 wrote: Same here with the hair (Abraxene to Havalen)....it's falling out, think older man with spots missing on top, toward the middle...but with a cap on people can't tell. I'm started on cycle # 4 and just had one infusion, 7 infusions of Havalen...I think. It seems to be still coming out when I rub my head against things (tub), but not a large amount at a time.",
      "MessageIndex": 2097,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Nov 25, 2018 04:06AM KPW3 wrote: Susan, My blood pressure has been lower too, I was orthostatic and felt like if I stayed standing I would pass out. I have been making sure I am drinking fluids all day. I've been getting dehydrated. My MO has also had to give me extra fluids with potassium before I get my treatments. I thought it was more likely due to the pembro....Your energy is incredible! I went to in-laws and brought a several side dishes, but wouldn't have been up to having everyone here.",
      "MessageIndex": 2203,
      "PostDate": "25/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 12, 2019 06:36PM KPW3 wrote: Mike3121 Congratulations on your wife's scan results!! I've been taking magnesium for some time and I think it helps. I have also been sleeping with a heated blanked around my legs/feet and it has really decreased the amount of leg cramps. Update on my treatment with Keytruda and Eribulin (Halavan). I had a colonoscopy done yesterday which did show a very small area of colitis and the villi in the start of the small intestine were blunted. So, it is being recommended that with 3 autoimmune toxicities (thyroid, nephritis-resolved and now colitis) to stop the Keytruda trial. I have 8 weeks to stay on the trial before being kicked off due to stopping the pembro....the tentative plan is to stay on trial for the Halavan and depending on scan results go from there. My MO's opinion (and those he has consulted with) is that it might be dangerous to try more at this time, I could potentially have a far more serious autoimmune toxicity. I think he is, unfortunately, correct. He has not ruled out using a different immunotherapy in the future since it appears to be VERY effective in my case. I'm disappointed, but don't want anymore potential toxicities. Scans next week... susan_02143, how are you?",
      "MessageIndex": 2255,
      "PostDate": "12/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Sep 26, 2018 06:50AM KPW3 wrote: Susan, hope the recession of neuropathy continues with your feet and fingertips. I find my fingertips the most sensitive. I do notice an improvement with the week off. My kidneys are back to normal, labs good and I received the Havalen today. Woke up just after 4am, got tired this afternoon and had to take a nap. I really don’t like taking the time to sleep in the day......I’m not completely sure it makes sense to feel annoyed, but I’m am. I wanted to exercise and get the Havalen coursing throughout the vasculature......but have developed plantar fasciitis over the weekend-Argh KP",
      "MessageIndex": 2148,
      "PostDate": "26/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Oct 6, 2018 09:59PM - edited Oct 6, 2018 10:00PM by KPW3 I've seen 3 oncologists....2 in Boston, one where I had my surgery at MGH (hospital), and one at Dana Farber (DF). I live a couple of hrs away. I have one locally and so far they have offered me here (the trial, I'm on now) what they offered at DF. But, I'm very interested in clinical trials and DF did offer more trials and MGH different trials than I may have access to here. ",
      "MessageIndex": 2161,
      "PostDate": "06/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Oct 6, 2018 11:59PM KPW3 wrote: Kachincolor, I’m sorry to hear about the brain mets. I have a friend in CA that was treated for brain mets 5-6 yrs ago and they have not come back...she still has bone mets and has those for - 10 yrs. My grouciness when I visit DF is the all day affair....I hate that my husband, who comes with me to all apts with MOs, has to take an entire day off. But I feel like I need his ears and brain there....and opinion. I do feel like they don’t rush me and feel like I get excellent information, so I go infrequently when a new decision needs to be made. ",
      "MessageIndex": 2163,
      "PostDate": "06/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Oct 12, 2018 07:27AM KPW3 wrote: I also have never had pink urine (probably blood?). I would definitely check with the oncologist.",
      "MessageIndex": 2174,
      "PostDate": "12/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Oct 24, 2018 10:58PM KPW3 wrote: I have these leg & feet cramps too. Most of the time I have to stand on my feet to get them to go away. I started using a heating pad, actually just changed to an electric throw over feet and legs, and it has dramatically decreased the # I get each night. ",
      "MessageIndex": 2181,
      "PostDate": "24/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Nov 18, 2018 06:28AM KPW3 wrote: Susan 02143, When did you develop a dropped foot? I just went to a PT about this happening to my right foot. Have you been able to do anything about it. The PT gave me some exercises....do you think it's due to a neuropathy? I have neuropathy in my fingers but it hasn't been noticeable in my feet/toes. I'll have to update later on my Eribulin, pembro trial....",
      "MessageIndex": 2189,
      "PostDate": "18/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 6, 2019 04:23PM KPW3 wrote: Well, an update, I apparently have another Keytruda (immunotherapy) related complication, colitis. I started having diarrhea that was controlled by immodium. That stopped working and I had to switch to Lomotil but the diarrhea turned very watery-could see pills in toilet floating. I was having 3-4 episodes in a day (over norm), a tender abdomen on palpation, and cramps. Friday I was put back on high dose steriods (60mg) which made me MAD (!); I had just tapered down to 2.5mg from the earlier kidney issue. I see a gastroenterologist tomorrow-nice to been seen so soon! They will probably want to do a scope, and we'll see what else. I've heard there is a steriod that just effects the GI tract....I hope they can switch me to that! This systemic steriod, prednisone, I don't like. I'm actually feeling pretty good overall. Bummer. I was able to get the Halaven (eribulin), so that was good and they thought I was slightly dehydrated so they gave me extra fluids. I have scans in a couple of weeks....it's hard waiting especially with this new complication. ",
      "MessageIndex": 2245,
      "PostDate": "06/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Mar 7, 2019 06:02AM KPW3 wrote: I've been wondering about susan_02143 as well, I sent her a private message and haven't heard back. Well, I've been so discouraged I haven't been able to post for a while (or don't recall posting). I was on Keytruda and Halaven from June-Dec. with several months off due to autoimmune toxicities. First break was Aug. with acute kidney injury that responded very quickly with high dose steriods. When I was able to get the prednisone down to under 10mg (10 weeks) I was able to restart the trial (after seeing super specialist at Dana Farber). Then I was on until Dec. and developed grade 2 colitis, which again quickly resolved with steriods. An earlier CT in Aug. showed liver met resolving and no others. At this point while off in OCT, I had a CT and they found \"soft tissue mets\" in abd and chest. Found one lymph node that was removed for biospy on my upper medial arm, within 2-3 weeks saw it grow from slight questionable area to ~1 cm. Was taken off trial and am now getting Gem/Carb and other lymph nodes I could feel growing have now almost disappeared. This treatment is harder than the keytruda and halaven! Will cross post.",
      "MessageIndex": 2304,
      "PostDate": "07/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Sep 14, 2018 01:46AM KPW3 wrote: I have been intending to post earlier, but with the high dose steroids are making me a bit jittery and with the neuropathy in my fingers it has become more difficult to type....I hope it doesn't stay like this. I'm feeling much better. My headache is gone, cough gone, I have some energy back (not like Susan! wow). They are now attributing the thyroid (or now non-funtioning thyroid) to my immune system attacking it. The synthroid they started me on seems to be starting to kick in. Kidneys are looking better, I have an apt with nephrologist tomorrow. Keytruda and Halaven are being held....don't know it I will be able to take Keytruda again, but they are keeping me on the trial and tentative plan to start Halaven when kidney functions are normal. Apparently I'm one of the 1% that has this kind of reaction....leave it to me.",
      "MessageIndex": 2127,
      "PostDate": "14/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Nov 20, 2018 12:20PM KPW3 wrote: Susan, here are the exercises ",
      "MessageIndex": 2193,
      "PostDate": "20/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Dec 16, 2018 03:45AM KPW3 wrote: Pam, it depends when you want to feel the worst, during the week or weekend....Day 3 was the worst for me....but now I'm on such a small dose I hardly notice any side effects, just fatigue. My MO would have increased my dose back up if the clinical trial would have allowed it. I hope I'm getting a response! They pushed off the scans until Jan., every 3 months. I've been on the pembro (keytruda) with the havalen (eribulin) now for 3 cycles since restarting it and my kidneys are fine, all labs good. My energy level is still pathetic, very discouraging....hoping once the cold is over I'll have more energy. My 10 yr. old keeps wanting to have playdates over but I'm not to encouraging, I feel like a kill joy....too much to do, not enough time & energy, but I want her to have time with her friends...",
      "MessageIndex": 2209,
      "PostDate": "16/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 19, 2018 10:38PM KPW3 wrote: Wow! What a whirlwind experience! So glad the lesion was taken care so quickly and that you have family time planned. As a nurse, and, although I hate to discourage physical activity, I think mountain biking might be pushing it...if you took a tumble and hit your head, it would not be good. It may depend on the terrain? You look great and I hope you enjoyed your bath. Happy Birthday!",
      "MessageIndex": 1769,
      "PostDate": "19/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Apr 7, 2018 10:06PM KPW3 wrote: Therese, I do take the dog with me and he is good company. I feel calm after my walks, I really miss not getting out when I have to miss a day. I used to live in Abilene and learned how to play pickleball in college. It was a lot of fun.",
      "MessageIndex": 1659,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 10, 2018 06:41PM KPW3 wrote: I hiked up 'Moose Mountain' to the overlook yesterday....great view! Round trip close to 4 miles, good that I took a patient friend with me because it took more time than expected. ",
      "MessageIndex": 1754,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Apr 4, 2018 04:01PM KPW3 wrote: I have been snowshoeing in the forest behind my house almost everyday this past winter, staying out an hour or so. Unfortunately for me, almost everyone else is happy though, the snow is melting :( I'm going to have to find another exercise. I may try to swim. If the ticks weren't so bad I would continue to go hiking in the woods. ",
      "MessageIndex": 1642,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Apr 4, 2018 03:09PM KPW3 wrote: Our newer addition has made my hikes very enjoyable; we also have a 13 yr. old miniature poodle who stays home. He's a Puerto Rican rescue dog-a 'Sato' and about a year old. He seems to love the snow.",
      "MessageIndex": 1647,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 19, 2018 09:56PM KPW3 wrote: Love the photo of Iwrite and >Z<! I'm afraid I haven't accomplished much in the realm of exercise the past week. Too much going on.",
      "MessageIndex": 1766,
      "PostDate": "19/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Apr 11, 2018 03:00PM KPW3 wrote: Lumpie shared this on the topic 'Breaking Research News from sources other than BreastCancer.org': Surgical Resection vs Systemic Therapy for Breast Cancer Liver Metastases http://www.practiceupdate.com/c/66213/67/13/?elsca...  I couldn't read the entire article, but am planning on having my MO look for it.",
      "MessageIndex": 8296,
      "PostDate": "11/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "May 23, 2018 04:40PM - edited May 23, 2018 04:47PM by KPW3",
      "MessageIndex": 8885,
      "PostDate": "23/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 15, 2018 12:35PM KPW3 wrote: It looks like my liver mets are responding to the Halaven and Keytruda, I just got a call from the nurses with a preliminary report. I'm very relieved to receive the news.",
      "MessageIndex": 9461,
      "PostDate": "15/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 31, 2018 09:55AM KPW3 wrote: Babs, so sorry to hear of this, but much appreciate your sharing your news. I loved your last photo with your beautiful family. Will keep you in my prayers. Sounds like you have a great team working for your best care",
      "MessageIndex": 9591,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Oct 7, 2018 06:03PM KPW3 wrote: Love the photos! Beautiful family",
      "MessageIndex": 9911,
      "PostDate": "07/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Apr 18, 2018 10:32AM KPW3 wrote: I've been following this thread and several others, mainly lurking, but am always so impressed with you-all. Your strong spirits, the determination, the knowledge, the caring and encouragement is uplifting. I'm saddened and mad when cancer progresses, but hopeful that there is something out there that will work for each of us. Concerning liver mets causing pain....when I was first diagnosed with liver mets and had been started on Abraxane, I was having pain/pressure on my right side under my lower rib cage, where my liver is, I was very concerned about the chemo not working (my tumor lab #'s have always been normal and was waiting for scans) I asked a friend who is a GI-heptalogist (liver specialist and sees people with primary liver cancer-cancer that started in the liver) who answered me: \"Pain in the liver seems to be very unpredictable and usually doesn't seem to be a helpful indicator of what's actually going on. People with massive tumors being treated often have no pain and sometimes people with small lesions can have pain. Most of the time mass lesions in the liver cause no pain\" When I asked this, my reocurrance in my breast had been EXPLODING prior to starting Abraxane, and after I started the Abraxane I could feel the tumor 'melting' away in my breast. So, in my case, I think my pain in the liver was the tumor becoming necrotic and irritating the live tissues on the edge of my liver. I don't know if this will help....but thought I'd share. ",
      "MessageIndex": 8376,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 4, 2018 12:01PM - edited Jun 4, 2018 12:03PM by KPW3 Thanks >Z< I've read both clinical trials and NCT03435640 (added NKTR-262) which isn't yet available here in the Northeast....although coming in the summer according to NEKTAR; but I'm going to need to start something ASAP. Whichever one I try I wouldn't be able to participate the other in the future due to the Inclusion/Exclusion Criteria in the trials. My DH wrote this to me in an email answering one of my questions:",
      "MessageIndex": 9046,
      "PostDate": "04/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 6, 2018 02:35PM KPW3 wrote: Thanks Cure-ious, I appreciate your feedback! I was expecting to have those 2 choices, but as it turns out my choice is now the Halaven-Keytruda trial or a different trial with cisplatin and a wee-1 inhibitor (AZD-1775), clinical trial NCT03012477 at Dana Farber. The 2nd choice at DF sounds more invasive (liver biopsies necessary) and it's not as close a location....and I've heard good things about the Halaven-Keytruda trial. NKTR trial is closed, must have gotten their enrollment. Need to talk to my MO here...",
      "MessageIndex": 9054,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 14, 2018 02:22PM KPW3 wrote: Thanks >Z<.....I've tried the quinine and it somewhat worked and, I am a bit skeptical on the soap....but should try it since it can't hurt. These cramps are different than cramps I've had in the past that I've been able to stretch out. These cramps come on suddenly and are excruciating if I try to move my leg to stretch them out, it actually feels like they are about to explode....I scream out-and I had my port put in without pain meds, just lidocaine. I guess I've thought if the problem is likely low electrolytes I should just supplement with K+ and magnesium. It does seem to happen after hard exercising. But am considering the soap.  ",
      "MessageIndex": 9105,
      "PostDate": "14/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 15, 2018 10:56AM KPW3 wrote: I posted this in April concerning liver pain: “Concerning liver mets causing pain....when I was first diagnosed with liver mets and had been started on Abraxane, I was having pain/pressure on my right side under my lower rib cage, where my liver is, I was very concerned about the chemo not working (my tumor lab #'s have always been normal and was waiting for scans) I asked a friend who is a GI-heptalogist (liver specialist and sees people with primary liver cancer-cancer that started in the liver) who answered me: \"Pain in the liver seems to be very unpredictable and usually doesn't seem to be a helpful indicator of what's actually going on. People with massive tumors being treated often have no pain and sometimes people with small lesions can have pain. Most of the time mass lesions in the liver cause no pain\" When I asked this, my reocurrance in my breast had been EXPLODING prior to starting Abraxane, and after I started the Abraxane I could feel the tumor 'melting' away in my breast. So, in my case, I think my pain in the liver was the tumor becoming necrotic and irritating the live tissues on the edge of my liver.\"  Since then I did feel “pressure\" when my liver met started growing, and again, more persistently, when the new meds were working. I think if your liver met is near the outside of the liver you may feel something because the liver itself doesn't have nerves, but surrounding structure does.  My 2 cents..",
      "MessageIndex": 9457,
      "PostDate": "15/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 17, 2018 08:10AM KPW3 wrote: JFL, that’s a very good description of liver pain/discomfort.",
      "MessageIndex": 9465,
      "PostDate": "17/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 21, 2018 11:36AM KPW3 wrote: Raven, I'm on a clinical trial with Havalen and keytruda and just had my first scan which showed it was working on my liver mets......but, since I'm on both and keytruda is an immunotherapy I’mnot sure it correlates with just Havalen alone.",
      "MessageIndex": 9519,
      "PostDate": "21/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 28, 2018 12:42PM KPW3 wrote: So, CT scan did show liver responding nicely to treatment, one met remains and it is smaller, the place on breast/axillary where it recurred showed skin/soft tissue/musculature thickening....they aren't sure what to make of that. No new active disease shown. I did receive the pembro and eribulin last week, same flu like symptoms on day #3-4...low grade fever, aches, headache, NO energy. Oh, and my thyroid is now no longer working. I started having issues with it acting up just before I started this trial, so, I'm not sure it's to blame. Started on synthroid....hope it kicks in soon. Was scheduled to receive Eribulin today, but had to have it held due to increase in neuropathy in fingers. I hate to hold it, but I couldn't open the Advil bottle, typing is getting difficult and I am fumble fingers. It tingles, is more intense now instead of numbness.....I don't want it to get worse.",
      "MessageIndex": 9560,
      "PostDate": "28/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Sep 15, 2018 09:41PM KPW3 wrote: PP, I'm sorry to hear of the rising bilirubin levels, and praying the taxol kicks in and starts to make a difference. I cant think of anything to add to the thoughtful advice the others have said. I wish you peace",
      "MessageIndex": 9716,
      "PostDate": "15/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Sep 20, 2018 09:56PM KPW3 wrote: Dear Tristan I am so sorry, she was a special woman of character, personality and faith. I appreciate you sharing your loss with us.",
      "MessageIndex": 9779,
      "PostDate": "20/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Sep 30, 2018 07:18AM KPW3 wrote: grannax, I love it! I've found the accepted thought, decision, for these procedures, where I am, is that stage 4 is “systemic\" and they 'wouldn't' be helpful. But I mention it in discussions every so often to let them know i am interested and have not checked it off my box of possibilities. I was very close when on Abraxene, then I it stopped working. It definitely makes a difference in some cases.....it would be great if the possibilities were known and used by more in the MSBC community. ",
      "MessageIndex": 9839,
      "PostDate": "30/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Oct 15, 2018 08:28AM KPW3 wrote: I'm so sorry to hear the news of Babs passing. I'm especially thinking of her family's loss. She answered several private messages about the Y-90 that were very helpful to me. Thank you momallthetime for letting us know. ",
      "MessageIndex": 9993,
      "PostDate": "15/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Nov 15, 2018 04:29PM KPW3 wrote: I had my port placed without any medication other than the numbing lidocaine meds....I refused any type of anesthesia or narcotic. That is my personal preference. I was a nurse and kinda know what to expect, and I get very, very nauseated and totally knocked out from anything. I drove myself home. It’s all a personal choice and think they should accommodate your preferences.",
      "MessageIndex": 10182,
      "PostDate": "15/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "May 24, 2018 02:25PM KPW3 wrote: Just saw this article about gut microbes and liver cancer and mets, this is the beginning: Scientists have found a connection between bacteria in the gut and antitumor immune responses in the liver. Their study, published May 25 in Science, was led by researchers in the Center for Cancer Research (CCR) at the National Cancer Institute (NCI). It showed that bacteria found in the gut of mice affect the liver's antitumor immune function. The findings have implications for understanding the mechanisms that lead to liver cancer and for therapeutic approaches to treat them. NCI is part of the National Institutes of Health. https://medicalxpress.com/print446386608.html ",
      "MessageIndex": 8902,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 21, 2018 09:12AM KPW3 wrote: tumormamedcyde, I was in the similar situation in Dec. I have undergone one chemo regime and am now on a clinical trial with immunotherapy and chemo. It is very scarry. Trip neg is scarry, but you have a better chance of responding to immunotherapy. Private msg me if you would like.",
      "MessageIndex": 9154,
      "PostDate": "21/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Feb 23, 2019 02:22PM KPW3 wrote: Grannax, you look great!! ",
      "MessageIndex": 10732,
      "PostDate": "23/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 17, 2018 07:39PM KPW3 wrote: Raven, I was given a short acting, neupogen, the day before my infusion, and a long acting, neulasta, the day after. They gave my neulasta (the last 2 times I've been given it) via a small devise that attaches to the fatty subcutaneous area of your upper outer arm (could use on your abdomen). It infused the drug which was in a time release functionthe next day.....very high tech. I'm thinking it's actually cheaper than paying for the time it takes in the infusion room with the nurse giving it. I forgot it was attached and actually got into the bath and was there a good 20 min and it still seemed to work. It made my WBC's almost normal....but that could be my reaction (ie...my bone marrow is very reactive to the drugs).",
      "MessageIndex": 9482,
      "PostDate": "17/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Sep 10, 2018 04:33PM KPW3 wrote: Apparently I have developed Keytruda induced nephritis, an acute kidney injury. Apparently it is a drug induced autoimmune thing....so I guess I was responding to the immunotherapy! Keytruda and eribulin are being held and I'm on high dose steriods to reverse kidney damage. I think they caught it fairly early and am hopeful that things can be restarted while closely monitored, but looks like it would take up to 12 weeks for that to happen, if at all. Since I had such a good response from drugs I don't want to completely give up. I have an apt tomorrow to check labs. Will cross post.",
      "MessageIndex": 9662,
      "PostDate": "10/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Sep 22, 2018 02:38PM KPW3 wrote: Well, an update....my kidneys responded really well to the steroids and my creatine is basically normal so I received the Halaven dose Tuesday, although the nephrologist said that Halaven would have been ok with some kidney issues and shouldn't be an issue. They are decreasing the steriods, but will take 6 weeks! They are negatively affecting my sleeping, so now I have to take something for that. But I was very happy to get the Halaven dose at a reduced dose. It's not clear whether I'll ever get the Keytruda/Pembo. The kidneys were a grade 2 injury, for the trial you aren't allowed to receive it again if you have a grade 3. So, we haven't totally ruled it out, but if I have a similar response in the future it may damage my kidneys worse the next time. If I don't get the Keytruda for >12 weeks I think I'm technically off trial. I really want to stay on it, or see what the next scan shows in Oct.",
      "MessageIndex": 9794,
      "PostDate": "22/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Dec 21, 2018 10:28AM KPW3 wrote: Grannex, I had my liver bx done via a MRI guided bx. They were able to take a bx off a 2cm met. I guess it would be more expensive",
      "MessageIndex": 10375,
      "PostDate": "21/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 4, 2019 09:11PM KPW3 wrote: Kattysmith, I've heard rashes are actually good with some immunotherapy meds, it shows that it's working....except not necessarily for keytruda (pembro) which I'm on. I've had several other side effects, but not a rash, and I have had a good response. I will have my next scan in a few weeks. Good luck! Very sad to hear news on Lisajo, praying for her treatment and care.   ",
      "MessageIndex": 10464,
      "PostDate": "04/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "May 22, 2018 04:29PM KPW3 wrote: I am so sad about Missy and Kay Lynne. Here is the URL of Kaylynne's obit, it says she died May 20th, Sunday. http://www.smithandkernke.com/obituary/Kay-Lynne-Edgar/Oklahoma-City-Oklahoma/1797765",
      "MessageIndex": 2555,
      "PostDate": "22/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "May 31, 2018 10:02PM KPW3 wrote: sfgirl, I'm sorry to read of he loss of your friend. She sounds like she was pretty amazing! It's our loss too. ",
      "MessageIndex": 2558,
      "PostDate": "31/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 4, 2018 10:54AM KPW3 wrote: I'm looking for opinions....Abraxane has stopped working. My next treatment will probably mean a decision between: 1. NCT02983045- 2. NCT02513472- Study to Evaluate the Efficacy and Safety of Eribulin Mesylate in Combination With Pembrolizumab in Subjects With Metastatic Triple-Negative Breast Cancer (mTNBC) One is close to my hometown and the other is at Dana Farber.  Also posted on liver mets...",
      "MessageIndex": 2568,
      "PostDate": "04/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 17, 2018 10:39AM KPW3 wrote: I started Keytruda & Halaven (Pembro & Eribulin) on Wed. On Thursday started feeling achy and didn't sleep well. Friday & Sat flu like symptoms with aches, fever of 100, headache and fatigue; also didn't sleep great. Today, Sunday, I woke up after a better sleep and am less achy. I have had more discomfort over my right rib cage since Thursday (hoping those nasty cancer cells are dying). I'm worried about taking ibuprofen, but the tylenol didn't touch my general aches and flu like symptoms. So, since I don't want my kids to remember me as the mean, grouchy mom with cancer, I went ahead and took the ibuprofen. Next dose Wed.",
      "MessageIndex": 2594,
      "PostDate": "17/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 30, 2018 10:05AM KPW3 wrote: Tricia, Wow! Great news! The carbo/gemzar is great for you....I hope I find something that works for me for a significant time. Happy Anniversary!",
      "MessageIndex": 2632,
      "PostDate": "30/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Sep 17, 2018 07:49PM KPW3 wrote: Very interesting....I’d be interested, but don’t have the BRACA Mutations.",
      "MessageIndex": 2643,
      "PostDate": "17/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Oct 1, 2018 07:39PM KPW3 wrote: ksmatthews, there is the topic: Stage 4 NED crew, let’s support each other. There are other NED stage 4 community members there. ",
      "MessageIndex": 2661,
      "PostDate": "01/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 14, 2019 11:03PM KPW3 wrote: tina_marie, We don't know if I express it, I had some testing at Dana Farber and they didn't say I had the pd-l1 expression, they only gave part of the testing to my local MO, what they thought would be 'helpful' (it was not listed in the few that were listed) ..I was not pleased with this. I do know of several others with positive response to immunotherapy that were ER+that changed to TN, I'm not the only one. I'll have to look for that article about response without expression of pd-l1..",
      "MessageIndex": 2729,
      "PostDate": "14/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 4, 2018 10:52AM KPW3 wrote: I'm looking for opinions....Abraxane has stopped working. My next treatment will probably mean a decision between: 1. NCT02983045-  2. NCT02513472- Study to Evaluate the Efficacy and Safety of Eribulin Mesylate in Combination With Pembrolizumab in Subjects With Metastatic Triple-Negative Breast Cancer (mTNBC) One is close to my hometown and the other is at Dana Farber. Thoughts?",
      "MessageIndex": 9043,
      "PostDate": "04/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 13, 2018 08:50PM KPW3 wrote: I've been getting STRONG muscle cramps mainly in my legs, sometimes other places, with my cancer recurrence/mets and chemo. I've been taking magnesium supplements daily and drinking water with added electrolytes after I exercise, it seems to help. A heating pad sometimes helps too. I started on Eribulin and Pembro trial today NCT02513472. So far, no ill effects. Pre-med with zofran. 2 weeks on 1 week off. But the 2nd cycle will start late so I can go on vacation. I was able to go out for a walk in the woods and came back with a couple of ticks...I hate ticks. I'm going to take a warm bath and drown any additional ones I haven't found yet.",
      "MessageIndex": 9098,
      "PostDate": "13/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 29, 2018 04:12PM KPW3 wrote: Raven, When I was on Abraxane my ANC got very low several times (0.6 and 0.7) and WBC's 1.7 and 2 .....they held the next dose, and sometimes gave me neulasta. My kids had the flu several times during this time period. I wouldn't allow them into the kitchen and was very strict with handwashing, was very fussy if it was the kid sitting next to me at the table (strict is a nice way to put it). BUT I didn't get sick. I think you have to be careful....",
      "MessageIndex": 9571,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Oct 9, 2018 09:08AM KPW3 wrote: Cure-ious, love the information, especially since I was on keytruda, technically still on trial for now....sorry to hear about Babs, will keep her and family in my prayers. ",
      "MessageIndex": 9921,
      "PostDate": "09/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 8, 2019 05:23PM KPW3 wrote: camdu-678, Is it possible for you to get a second opinion at the Cleveland Clinic, or some other large cancer center? They should have their radiologists look at all films you take them (or have sent to them). I did that and MGH did find something that had been overlooked.",
      "MessageIndex": 10497,
      "PostDate": "08/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Mar 4, 2019 12:21PM KPW3 wrote: I just read about Zarovka on Inspire. I'm so very sad. She was truly an inspiration. Prayers for her family.",
      "MessageIndex": 10780,
      "PostDate": "04/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 4, 2018 11:25AM KPW3 wrote: Bontbestie, I'll send you a private msg.",
      "MessageIndex": 2570,
      "PostDate": "04/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 4, 2018 02:24PM KPW3 wrote: Thanks Hartrish, I do not have the BRAC or PALB2 mutations. I was looking at these trials before starting other chemo since they have to be 1st or 2nd line therapies and I've had Abaxane as my #1 line. I appreciate the prayers! I'll let you all know.",
      "MessageIndex": 2572,
      "PostDate": "04/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 16, 2018 12:11PM KPW3 wrote: Kcan, I had a liquid biopsy at one place (MGH), followed by 2 genomic studies with my liver biopsy at two separate places (MGH-did give me the report and Dana Farber-who have their own study and don't share the results with their patients). The liquid biopsy showed Tp53, which showed up on one of the biopsy studies from the liver-but they consider this a non-actionable mutation since there isn't a potential drug or didn't at the time(or the mutation wasn't showing up in enough tissue?). There was an additional mutation in a small amount on the liquid biopsy that didn't show on the liver biopsy studies. I think my insurance went back and forth with MGH.... Also, there is a woman with a blog-Barbara Bigelow that had a mets on her adrenal gland and bones and she was one of the first patients on the Keytruda & Eribulin trial. It almost killed her with her immune reaction (she was in a coma for several weeks) and her adrenal glands no longer are active-ie life long medication dependent, but she has been cancer free for several years. This is my recollection of what I have read from her blog....",
      "MessageIndex": 2628,
      "PostDate": "16/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 14, 2019 09:55PM KPW3 wrote: tina_marie, so you haven't been given immunotherapy? I've seen some evidence that even those not expressing pd-l1 can respond. I have had a response with immunotherapy, but don't know if my tumor expresses what it is supposed to. My tumor was initially Er+ now TN.",
      "MessageIndex": 2726,
      "PostDate": "14/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 15, 2019 06:03PM KPW3 wrote: tina_marie, I sent you a private message...",
      "MessageIndex": 2733,
      "PostDate": "15/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Sep 3, 2018 09:00PM KPW3 wrote: Minxie, I started a discussion on Keytuda and Havalin...I take both, but beside the neuropathy I think most of my symtoms are from the keytruda since they happen after I receive it and not so much with the Havalin. I'm on the way to bed, we took 10, 10 yr olds to a water park today for a late birthday party....if you don't get your answers there feel free to private message me. KPW3",
      "MessageIndex": 2640,
      "PostDate": "03/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Oct 7, 2018 12:09PM KPW3 wrote: Sharjin, I'm too so sorry to hear of your mother's passing, it's so hard to lose a parent. You and your family will be in my prayers.",
      "MessageIndex": 2665,
      "PostDate": "07/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Dec 7, 2018 07:37PM KPW3 wrote: Minxie’s sister, I’m so sorry to hear of Minxie’s passing. Thanks for letting us know. We had communicated about keytruda on the boards. I’m glad you were there with her. Praying for peace and comfort to your family",
      "MessageIndex": 2682,
      "PostDate": "07/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Dec 10, 2018 11:15AM KPW3 wrote: I've had a horrible upper resp cold for 5 days and am hoping I can fight it off without antibiotics. I am scheduled for infusions tomorrow, but am skeptical I will get them. I haven't gotten hardly any Christmas shopping done.....and the house is a disaster! At least the sun is out! ",
      "MessageIndex": 2686,
      "PostDate": "10/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 15, 2018 11:41AM KPW3 wrote: It looks like my liver mets are responding to the Halaven and Keytruda, I just got a call from the nurses with a preliminary report. I'm very relieved to receive the news. I've cross posted in a few places.",
      "MessageIndex": 2626,
      "PostDate": "15/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 18, 2019 02:20PM KPW3 wrote: It's very disappointing!",
      "MessageIndex": 2740,
      "PostDate": "18/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Apr 4, 2018 03:30PM KPW3 wrote: I just got this article from Medscape about scalp cooling with BC chemo: https://www.medscape.com/viewarticle/894727?src=wn... Scalp cooling before, during, and after chemotherapy is demonstrably safe and effective for the prevention of chemotherapy-induced alopecia and should be offered to all patients concerned about what can be a devastating side effect, an independent review of US-based experience says.",
      "MessageIndex": 8182,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "May 16, 2018 12:27PM KPW3 wrote: Same here, liver met and normal blood tests.",
      "MessageIndex": 8785,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 15, 2018 11:51AM KPW3 wrote: JFL-I went directly to my recent labs to look at calcium, it was smack dab in the normal range (taken earlier this week)....magnesium was too but I supplement with it and wonder what it would be without supplements. I hope the Y-90 kills all those nasty cancer cells in your liver JFL Taking supplements with pd-1? Does anyone have any thought about taking ibuprofen with pd-1? Or supplements, I normally take cucurmin, melatonin, vit D3, multi vit, and Claritin.",
      "MessageIndex": 9110,
      "PostDate": "15/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jun 15, 2018 06:09PM KPW3 wrote: Wonderful news Hartrish!",
      "MessageIndex": 9113,
      "PostDate": "15/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 5, 2018 11:43PM KPW3 wrote: MJHMJAN1014, Fantastic!",
      "MessageIndex": 9399,
      "PostDate": "05/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Aug 17, 2018 12:00PM KPW3 wrote: Raven, It looks like Zarzio is a biosimilar as filgrastim....and I have taken the trade name Neupogen. It worked wonderfully on me, brought my WBC and ANC up and I was then able to go on vacation. I take Claritin anyway, but I was told to take it with the neupogen for the muscular and bone aches that some people get with taking it.",
      "MessageIndex": 9469,
      "PostDate": "17/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Sep 13, 2018 11:31AM KPW3 wrote: PP, So sorry to hear of your recent news. I agree with others have said, chemo could be very effective quickly and turn things around. There are many clinical trials available for triple negatives, my ca changed to TN and I had several to choose from. I'm glad they were able to help you breathe easier. You've been in my prayers. Grannax, So glad to hear of your scan results! MJH, The nephritis I wasn't aware of specifically....but was feeling just \"lousy\" for several days. I'm sure the lack of thyroid function and having very little energy wasn't helping. Now the neuropathy in my fingers and the high steroids, making me jittery, is making typing difficult. But I am feeling much better! We are watching the kidneys carefully and I have an apt with nephrologist tomorrow.",
      "MessageIndex": 9692,
      "PostDate": "13/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Oct 7, 2018 12:00PM KPW3 wrote: Grannex, You look great!! So glad you were able to go and enjoy!",
      "MessageIndex": 9903,
      "PostDate": "07/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Oct 29, 2018 08:53PM KPW3 wrote: So good to hear from you Zarovka! Your treatment plans sound extensive and well thought out.  ",
      "MessageIndex": 10045,
      "PostDate": "29/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 12, 2019 01:03PM - edited Jan 12, 2019 01:06PM by KPW3 Hartrish, is this something like what you are looking for: https://clinicaltrials.gov/ct2/show/NCT02734004 There is also a thread on Inspire: https://www.inspire.com/groups/advanced-breast-cancer/discussion/keytruda-and-lynparza-treament/",
      "MessageIndex": 10532,
      "PostDate": "12/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Mar 6, 2019 02:11PM KPW3 wrote: grrifff, so sorry to hear of your issues with ascites. I think having issues in the liver is enough to cause the ascities....but it's no guarantee, I think abd mets would have shown up on CT or MRI, unless you are ILC. I think too the chemo can really make a difference. thrivingmam, I don't have any of those mutations....and I don't know if I have pd-l1.....but did initially have great response to keytruda. I also don't think I can be considered to have a \"hyper-progression\" Well, I've bee so discouraged I haven't been able to post for a while (or don't recall posting). I was on Keytruda and Halaven from June-Dec. with several months off due to autoimmune toxicities. First break was Aug. with acute kidney injury that responded very quickly with high dose steriods. When I was able to get the prednisone down to under 10mg (10 weeks) I was able to restart the trial (after seeing super specialist at Dana Farber). Then I was on until Dec. and developed grade 2 colitis, which again quickly resolved with steriods. An earlier CT in Aug. showed liver met resolving and no others. At this point while off in OCT, I had a CT and they found \"soft tissue mets\" in abd and chest., unusual for IDC. Found one lymph node that was removed for biospy on my upper medial arm, within 2-3 weeks saw it grow from slight questionable area to ~1 cm. Was taken off trial and am now getting Gem/Carb and other lymph nodes I could feel growing have now almost disappeared. This treatment is harder than the keytruda and halaven!",
      "MessageIndex": 10787,
      "PostDate": "06/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Dec 7, 2018 07:38PM - edited Dec 7, 2018 07:39PM by KPW3",
      "MessageIndex": 2683,
      "PostDate": "07/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 11, 2019 02:59PM KPW3 wrote: Parrynd1, I didn't see above that you've been on this...immu-132. It was mentioned to me as a potential next treatment. I had one oncologist (who I saw for 2nd opinion) say he's had a patient on it for 7yrs! https://ichgcp.net/clinical-trials-registry/NCT02574455 They keep saying (since last summer) it's about to be FDA approved so you wouldn't have to be in a clinical trial...but the trial might work for you.  ",
      "MessageIndex": 2714,
      "PostDate": "11/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "KPW3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211945/profile",
      "Content": "Jan 12, 2019 01:38PM KPW3 wrote:  This was cross posted...",
      "MessageIndex": 2718,
      "PostDate": "12/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    }
  ]
}