{
  "AuthorID": "KPZ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152557/profile",
  "Posts": [
    {
      "AuthorID": "KPZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152557/profile",
      "Content": "KPZ wrote: Hello! I am a 24 year old female who recently went in to my doctor concerned about a lump I'd found in my right breast. She felt what I was talking about, and said she also felt something in my left breast. She recommended I get an ultrasound, which I did yesterday.  They found a second lump in my right breast but didn't find anything in my left breast.  They said that both lumps in my right breast are most likely fibroadenomas, but recommended I have a fine needle biopsy done to be sure. I plan on having that done as well, but all day today, I have had pain in my LEFT breast. Is it possible that they missed something on the ultrasound or could the pain be from all the pushing and feeling around that comes with the ultrasound itself?  Thanks for your help! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/788022",
      "Title": "Breast Pain KPZ Healer"
    },
    {
      "AuthorID": "KPZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152557/profile",
      "Content": "May 24, 2012 08:25PM KPZ wrote: Yea I think it might be a combination-a little pain from the procedure turned into a big deal in my mind! I have a slightly higher risk of BC than other girls my age due to family history and my own medical history, but I know the chances of someone my age being diagnosed with BC are very small. I will try to stay positive and hope for the best! Thank you for your reply-take care!",
      "MessageIndex": 2,
      "PostDate": "24/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/788022",
      "Title": "Breast Pain KPZ Healer"
    }
  ]
}