{
  "AuthorID": "kristinmari…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153145/profile",
  "Posts": [
    {
      "AuthorID": "kristinmari…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153145/profile",
      "Content": "Jun 8, 2012 10:45PM kristinmarie wrote: Sorry if I have not answered posts. I am having a little trouble keeping up with where and what I have posted. Geez, I think my brain turned off when I found out I had cancer. Half of me still doesn't believe it and my breasts are already gone.   I don't even know if 17 nodes being removed is \"a lot\". Feels like it to me. I am disappointed to hear that there was still so much cancer left after the six rounds of chemo. I start radiation in about a week and a half. I find it amazing that the doctors think this body can handle anything else right now. ",
      "MessageIndex": 654,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    },
    {
      "AuthorID": "kristinmari…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153145/profile",
      "Content": "Jun 3, 2012 12:47PM kristinmarie wrote: May 22, 2012. Radical mastectomy on left, mastectomy on right. 17 nodes removed on left side.",
      "MessageIndex": 565,
      "PostDate": "03/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    },
    {
      "AuthorID": "kristinmari…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153145/profile",
      "Content": "Jun 8, 2012 10:49PM kristinmarie wrote: I wish there were a \"Like\" button on here! I love reading your posts and I am so glad you are all so willing to be open and share your battles on here with the rest of us. I am finding myself to be a little ignorant of so many things reading through here. I have gone through tests and procedures that I couldn't even tell you the name of. I'm starting to feel a little bit like someone hasn't been telling me things I should know.",
      "MessageIndex": 655,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    },
    {
      "AuthorID": "kristinmari…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153145/profile",
      "Content": "Jun 9, 2012 04:02AM kristinmarie wrote: Thanks for the advice ladies. I haven't actually been in bed for 12 days. I did six rounds of chemo before my surgery. Unfortunatley that really kicked my butt. I had to have several blood transfusions and have battled severe neuropathy all through the chemo. I've acutally been in bed for the past couple of months. I have gotten fairly thin and this bed is hard on pokey bones.  I have had one drain removed and hopefully the last will come out next week. I have not had any problems with swelling or lymphedema, for which I am grateful for.  I am using some cream for the sore and have had told my doctor about it several times. I am just doing the best I can to get up as much as I can. Seems that my pain meds make it harder to feel motivated. I am trying to wean off of those and my energy level seems to be better without them.  When do you start to feel better?? I have radiation coming up in about two weeks and I can't even imagine being ready for that. Thanks for your advice~",
      "MessageIndex": 10,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788536",
      "Title": "Bed/Pressure sores kristinmarie Moonflwr912"
    },
    {
      "AuthorID": "kristinmari…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153145/profile",
      "Content": "Jun 3, 2012 09:28PM kristinmarie wrote: Thank you for the advice! My daughter is off in search of the cream for me now.  I know that I am not eating properly or drinking enough fluids. I am going to start trying to get up more often today. I haven't quite figured out how much \"up\" is too much up. I tend to get up and over due it and then I have a jump in my lymph drains. I want these suckers out as soon as possible so I am trying really hard to be still and keep the cc's down. One of the drain tubes is unfortunately lying on a nerve so that has been a real challenge as far as stripping the tubes. They put me on morphine tablets last week to help with the pain of stripping the tubes. I am also on another pain med that has helped with my pain levels significantly but has also killed any appetite that I had. I think the medications and a little bit of depression thrown in has contributed to my weight loss a great deal. I am drinking at least one Boost a day if I can get it down.  Thanks for the warning about the memory foam as well. I have been using it for one hour and then moving off of it for an hour. I wish I could sleep on at least one of my sides but I've got the tubes in both sides.  What a fun ride this has been. Thanks again for the tips! I'm sorry if my posts are so unorganized. I think my thought process is as well!Hahaa",
      "MessageIndex": 2,
      "PostDate": "03/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788536",
      "Title": "Bed/Pressure sores kristinmarie Moonflwr912"
    }
  ]
}