{
  "AuthorID": "KristenSp",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240913/profile",
  "Posts": [
    {
      "AuthorID": "KristenSp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240913/profile",
      "Content": "Oct 15, 2016 11:49PM KristenSp wrote: I hope your biopsy goes well and will be thinking about you too.",
      "MessageIndex": 5,
      "PostDate": "15/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/848961",
      "Title": "BIRAD score of 5 KristenSp Moderators"
    },
    {
      "AuthorID": "KristenSp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240913/profile",
      "Content": "Oct 14, 2016 02:55PM KristenSp wrote: New scans show that my lymph nodes do not seem to be effected. That's really good news. The dr did come and talk to me. They are pretty sure it's breast cancer and are still rating it a 5 Biopsy will confirm and then we will get a treatment plan set up.",
      "MessageIndex": 2,
      "PostDate": "14/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/848961",
      "Title": "BIRAD score of 5 KristenSp Moderators"
    },
    {
      "AuthorID": "KristenSp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240913/profile",
      "Content": "Oct 14, 2016 05:12PM KristenSp wrote: when is your biopsy",
      "MessageIndex": 3,
      "PostDate": "14/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/848961",
      "Title": "BIRAD score of 5 KristenSp Moderators"
    },
    {
      "AuthorID": "KristenSp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240913/profile",
      "Content": "KristenSp wrote: hello, I am in shock that I am in this situation. 8 found a lump on my left breast on Sunday. It hurt a lot on Sunday and Monday. It is in the upper right quadrant of my left breast. Had an ultrasound and a mammogram on Tuesday. Both were abnormal and I was given a BIRAD score of 5. I am waiting right now to get a repeat ultrasound because she wants better pics of my lymph nodes. They were slightly enlarged but she said that enlarged lymph nodes don't necessarily mean it has spread. She said she needs better pics to see if the outer ridge of the lymph nodes have thickened. If it is thickened, that can be a good indicator that it is also effecting the lymph nodes. If not, good chance it has not. I am terrified and freaking out. When did you find your lump and where was it.? Did you get a B-RAD score? Did your lump hurt at all? Mine really hurt on Sunday and Monday but now it is just tender. I have a biopsy scheduled for Tuesday morning and should have the results back no later than Friday. I'm so scared Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/848961",
      "Title": "BIRAD score of 5 KristenSp Moderators"
    },
    {
      "AuthorID": "KristenSp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240913/profile",
      "Content": "Oct 17, 2016 05:36PM KristenSp wrote: I have one tomorrow too. Hopefully we bothe get good news. I will be thinking of you. What time is yours?",
      "MessageIndex": 14,
      "PostDate": "17/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/849049",
      "Title": "Core needle biopsy tomr scared to death Lindaerwin Toad"
    },
    {
      "AuthorID": "KristenSp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240913/profile",
      "Content": "Oct 19, 2016 10:57AM KristenSp wrote: Mine didn't hurt while doing it although I felt like they were jamming a meat thermometer in my boob like you would a chicken breast😳 It wasn't painful but the sensation was so awful. It did hurt like hell once the numbing meds wore off. I just am staring at my phone trying to will it to ring. I just want to know the results! I should have them no later than Friday but hopefully sooner. When will you get yours",
      "MessageIndex": 18,
      "PostDate": "19/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/849049",
      "Title": "Core needle biopsy tomr scared to death Lindaerwin Toad"
    },
    {
      "AuthorID": "KristenSp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240913/profile",
      "Content": "KristenSp wrote: I'm 38 and was diagnosed yesterday with Invasive Ductal Carcinoma. Treatment will most likely be a lumpectomy with radiation and maybe chemo or a mastectomy with chemo. The chemo portion depends on tumor marker tests which are not back yet and if it has or has not moved to my lymph nodes. My lymph nodes looked good on ultrasound but they will biopsy them during surgery to make sure. I have 4 kids, 11,8,5 and 3 and have not told them yet. I plan to wait until I have all the info and a better idea of what type of treatment I will have. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/849220",
      "Title": "38 and Diagnosed Yesterday KristenSp Hopfull2"
    }
  ]
}