{
  "AuthorID": "kristi43440",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57733/profile",
  "Posts": [
    {
      "AuthorID": "kristi43440…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57733/profile",
      "Content": "Oct 27, 2007 02:19AM kristi43440 wrote: Hello all, My mother had the laser treatmen on Wednesday.  It took quite a while (a few hours) because she used the laser on many different parts and then did manual drainage.  The laser was applied to certain points on her arms, neck, back and abdomen.  It was applied for 4 minute intervals.  It did not hurt or even tingle much as she fell asleep during the treatment.  Before, she had a spot on her back up toward her armpit that was hard as a rock.  Today, I gave her a massage (the way the therapist advised) and the spot has started to soften up quite a bit.  The therapist advised the treatment 3 times/week for a month.  We had to drive a little over 2 hours to get there, so we won't be able to go that often.  Especially since my mom has been really weak as of late.  She is making improvement, but it will take a while to get her strength back.  The treatment was $60 for the first time and then it will be $40.  I think that it did help, especially to help break up the parts on her back that were very hard.  We will have to continue the treatment to see the long term results.  We were supposed to go next Wednesday, but she has chemo on Tuesday and I'm sure she will not be in any shape for that long of a road trip.  I hope this helps, if you have any questions, ask away.",
      "MessageIndex": 8,
      "PostDate": "27/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/694017",
      "Title": "laser??? kristi43440 sccruiser"
    },
    {
      "AuthorID": "kristi43440…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57733/profile",
      "Content": "Oct 23, 2007 05:45PM kristi43440 wrote: Hello all, I wanted to let you know that I found a lymphodema therapist in Youngstown Ohio that is doing the laser treatments for lymphodema.  It is about a 2+ hr drive, but I am willing to give it a try.  Anything to help my mothers lymphodema.  I have a number for Mark Knight (don't know about the spelling of his last name) who works for BioHorizon (the company who sells the laser).  Any of you that are interested may want to call him and see if there are any facilities in your area that have this.  The therapist we are going to does not have this particular companies laser, they have another kind.  I also have a number for someone in sales for that company that may be able to help find one in your area.  Mark Knight-BioHorizon-1-866-914-5159 ext.105 Andre Goudas 1-800-373-0955 ext. 105 We are scheduled for the laser treatment tomorrow afternoon.  I will post an update tomorrow or Thursday.",
      "MessageIndex": 6,
      "PostDate": "23/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/694017",
      "Title": "laser??? kristi43440 sccruiser"
    },
    {
      "AuthorID": "kristi43440",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57733/profile",
      "Content": "kristi43440 wrote: I was just reading about the laser treatments that are being done in Australia for lymphoedema.  Do any of you know if there are facilities in the US doing this?  I emailed the facility in Australia to ask them for info because flying is out of the question right now.  If any of you have personal info on the laser treatments and where they may be available, that would be great!  I am in Ohio by the way.  Also, if the facility in Australia responds to my email, I will post the response.  Thanks! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/694017",
      "Title": "laser??? kristi43440 sccruiser"
    },
    {
      "AuthorID": "kristi43440…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57733/profile",
      "Content": "Oct 21, 2007 02:21PM kristi43440 wrote: Does anyone know if insurance will cover the cost of these lasers?  Also, if anyone has tried these will you please let me know how they work for you?  thanks",
      "MessageIndex": 3,
      "PostDate": "21/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/694017",
      "Title": "laser??? kristi43440 sccruiser"
    },
    {
      "AuthorID": "kristi43440",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57733/profile",
      "Content": "kristi43440 wrote: Hello all, I have been reading this site for a little while, and it is good to hear stories and experiences from others in the same boat.  My mother was diagnosed with IBC last winter.  Previously about 7 years ago she delt with breast cancer and went into remission.  She had a masectomy years ago and went through chemo and radiation.  This time she has already gone through chemo and then radiation.  She also has the estrogen negative sort of cancer.  Recently the docs found fliud around her lung (which I believe can be a side affect of radiation).  When the fluid was drained, they found breast cancer cells in the fluid indicating that it has metatistized to the lung.  She then develped lymphodema, one thing after another.  The lymphodema is in both of her arms and neck and now has fluid on one side of her back.  The fluid on her back is on the same side as where the lung fluid was drained and also the same side where recently she had a port put in.  She has been on oxygen on and off, but the last few days she has been on all the time.  She started chemo of doxil last Tuesday and it didn't seem to do much for getting the swelling down from the lymphodema (which the docs thought it would) and it didn't really help with her breathing (unfortunately).  She has been seeing a lymphodema therapist who is using compression bandages to get the swelling down to measure her for sleeves.  Last Friday she was miserable because she was in pain from the swelling and IBC.  I called her doc and she told me my mom may only have a few months left.  She has been on pain meds and they usually help her to breath better, they tell me because she is more relaxed when she is not in pain.  We went in to the doc Monday and immediately the doc started Taxol.  Whe hadn't been on this previously because she didn't want to lose her hair and had a really time with that the first time she had bc.  I told her we are at the point where she needs the strongest chemo possible and who cares about her hair.  I don't know how long it may take to see some results like reduced swelling and breathing easier.  The doc did not say anything yesterday about her only having a few months and I did not bring it up because I don't want her getting depressed or negative (I didn't tell her the other day about the doc saying she may only have a few months).  I am wondering if maybe the doc is not as negative as she was the other day or what.  I would think that if that is the case she should have told us straight up.  Unless she wants to see how the Taxol is going to work.  She is due back on the 30th of this month for more chemo.  I am wondering if any of you have had any experience with the lymphodema and breathing problems that my mom is experiencing and if it something she can come back from?  Sorry this was a long post, and thanks in advance for any insite.  (This is also posted in the IBC forum). Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693878",
      "Title": "Mom has IBC, very worried! kristi43440 kristi43440"
    }
  ]
}