{
  "AuthorID": "Krista-eliz…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208113/profile",
  "Posts": [
    {
      "AuthorID": "Krista-eliz…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208113/profile",
      "Content": "Nov 20, 2014 07:50PM Krista-elizaveta wrote: Hello I have just joined to gain information to help my sister. She has stage 3 breast cancer for 3 years and now has mets to lungs. Her dr told her she has 6 months to live with no treatment and maybe 2 with treatment. She and i are devastated. She only has 1 micro met in one node, had chemo and.33 rounds of radiation. She was on tamifen which must not have worked. I believe her dr did not give her proper scans to catch this. She has mets on both lungs. We are moving her back home and to a new oncologist. I get such hope reading your suvival stories. You are all an inspiration to me. Please tell me the best drug to shrink lung mets? Thank you. (Er/pr pos and her neg ",
      "MessageIndex": 1168,
      "PostDate": "20/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Krista-eliz…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208113/profile",
      "Content": "Nov 26, 2014 09:00AM Krista-elizaveta wrote: A big HUG and Thanks to all of you ladies with the positive emails. I see my beautiful sister has now posted her story below. We are on our way on Monday to our last visit with the terrible oncologist and we will get a referral to Vanderbilt. I sure hope we get someone who is top notch! If anyone reads this and can recommend someone good at vanderbilt, please please let me know. Krista ",
      "MessageIndex": 1186,
      "PostDate": "26/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    }
  ]
}