{
  "AuthorID": "kristenpa",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180731/profile",
  "Posts": [
    {
      "AuthorID": "kristenpa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180731/profile",
      "Content": "Jun 5, 2013 07:02PM kristenpa wrote: SpecialK, thank you so much. Unfortunately my doctor is away until the day of surgery so I am unable to ask any questions until the day of surgery. jakig, thank you for making me feel more normal. I'm a control freak and suffer from panic disorder with PTSD and don't trust anyone and if I don't like what I want to hear, I will be out of that pre-op room faster than anything, I've had these for years now, and they're just multiplying, but I know if I don't get it done next week, I probably never will. I've done a good job with managing these though, big shirts and sports bras",
      "MessageIndex": 6,
      "PostDate": "05/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805717",
      "Title": "New, Surgery in a week and scared kristenpa kristenpa"
    },
    {
      "AuthorID": "kristenpa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180731/profile",
      "Content": "kristenpa wrote: Hey everyone, sorry if this is in the wrong place, but I've come here for support and to talk to others who have been through this experience. I'm 26 years old and found my first breast tumor when I was 23, it was the size of a grape, which it's now the size of an orange. Over the past 2-3 years I've grown 10 in total, ranging in grape size to the size of the orange. I have two giant ones, the rest are the smaller. Ultrasounds have shown that they're solid masses, I haven't had biopsies, but most have grown considerably over a 6 month period of time. I'm scheduled to have surgery on the 12th. I've never had anesthesia before and am super scared due to my health problems (PVC/SVT arrythymias, Mitral Valve Prolapse) among other things. I got my cardiac clearance yesterday, but my cardiologist said I'm still high risk. The surgeron didn't really give me a lengthy consult, it was pretty rushed due to him having surgery scheduled and I didn't get a chance to ask questions. He told me the surgery would take about an hour.  Is the type of anesthesia used up to me? I want local with sedation if I have to. I am TERRIFIED of general and would probably run out there if that was my only option. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805717",
      "Title": "New, Surgery in a week and scared kristenpa kristenpa"
    },
    {
      "AuthorID": "kristenpa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180731/profile",
      "Content": "Jun 5, 2013 10:24AM kristenpa wrote: Thank you both, you've made me feel better. Maureen1, even my therapist suggested not to go with local. She said in my mind I may think it's better, but it's harder and more traumatizing. I'm just so scared of general :( I hope they can do a light anesthesia, I also hope that these masses stop growing and I don't have to have multiple surgeries. ",
      "MessageIndex": 3,
      "PostDate": "05/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805717",
      "Title": "New, Surgery in a week and scared kristenpa kristenpa"
    }
  ]
}