{
  "AuthorID": "krlinden",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168235/profile",
  "Posts": [
    {
      "AuthorID": "krlinden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168235/profile",
      "Content": "Jan 23, 2013 03:00PM krlinden wrote: I was diagonosed with stage 1a bc Dec 2012. I am ER and PR +.  Had lumpectomy and lymph nodes ck'd.  nodes came back negative and they say they got all the cancer.  I just went to both oncologists yesterday.  Going to go on tamox after radiation.  Went to radiation oncologist and he gave me a choice of external radiation or the balloon type.  I am still trying to make a decision on that.  Reading on this board, i'm not too strong on the balloon type.  The thought of 5 days vs 33 days of radiation had me leaning towards it, but doesn't sound all that wonderful.....?  I have been on birth control pill and was told to stop right away. ",
      "MessageIndex": 14,
      "PostDate": "23/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "krlinden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168235/profile",
      "Content": "krlinden wrote: I was diagnosed in Dec 2012 with breast cancer.  I've had surgery on Jan 3 and saw my oncologists today.  The radiation oncologist gave me an option of the balloon/MammoSite treatment or total breast external radiation.  I would like to hear from others on this subject.  He said I was a very good candidate for the balloon if that's what I decide.  I am meeting with the surgeon to discuss this treatment next week but want to hear from others who have actually had one or the other. Karen Lindenberger Dx 12/10/2012, 1cm, Stage IA, Grade 1, 0/2 nodes, ER+/PR+ Surgery 1/3/2013 Lumpectomy: Left; Lymph node removal: Left, Sentinel Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/799274",
      "Title": "Choosing between Contura Treatment and External Radiation krlinden Krackr26"
    }
  ]
}