{
  "AuthorID": "krssy11",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176012/profile",
  "Posts": [
    {
      "AuthorID": "krssy11",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176012/profile",
      "Content": "Apr 17, 2013 07:43PM krssy11 wrote: Let us know what they say...not that I can be much help figuring out what it means, but will be here to listen! I'm the opposite of you, I almost would rather not know, and just figure everything is fine lol. Good luck with the report. Hugs -Krissy",
      "MessageIndex": 14,
      "PostDate": "17/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/802745",
      "Title": "Waiting for Biopsy results kel44 Moderators"
    },
    {
      "AuthorID": "krssy11",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176012/profile",
      "Content": "Apr 11, 2013 03:31PM krssy11 wrote: Sam, I have very similar things going on with me!! The right breast has not a lump, but a thick feeling inside, radiologist referred to it as a vague area, but feels like a sheet of soft slate to me, and has been getting worse over the last 6+ mos. OBGYN felt it and sent me for a Mammo and US. US couldn't show much, although radiologist was called in, and spent forever in that area. Mammo showed a white shadowed area (very obvious) exactly where I feel the thick hard feeling. It was rated BIRADS 4. Had biopsy, the sterotactic one, and just got back results of pre cancerous cells and fibrocystic change. My OBGYN couldnt even explain much to me, and now being sent to breast surgeon next, and then MRI.  What struck me about your post is the hip pain. I have the same, always while in bed, (although not every night) and it wraps around to my groin also on right side.  I think it is just a back issue though-sciatica or disc? Once the breast issue is taken care of, I am having this checked out next. I am also young, only 34 with no history of cancer in family. Let me know your results, take care!",
      "MessageIndex": 11,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/802745",
      "Title": "Waiting for Biopsy results kel44 Moderators"
    },
    {
      "AuthorID": "krssy11",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176012/profile",
      "Content": "May 17, 2013 03:42AM krssy11 wrote: Hi, sorry you are going through all of this! It actually looks kind of similar to my image, but my lump changes with menstrual cycle. Feels more sore and larger just before period is due. I had a BIRADS of 4 and had a core biopsy...  I was diagnosed with fibrocystic change, PASH (a benign breast condition-which is what the mass is in my case) and Atypical Hyperplasia, also benign, but needs to be watched.  I need to schedule a MRI, but just havent gotten around to it yet (I know bad me). I am also young (34).  Just try to relax until the results are in...I know easier said than done!!",
      "MessageIndex": 7,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/804636",
      "Title": "Look at my Mammogram image Read my story...can anyone relate?? bhelson krssy11"
    }
  ]
}