{
  "AuthorID": "kshav6",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
  "Posts": [
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Jul 14, 2011 06:50PM kshav6 wrote: I started my first round of rads today (1 down 15 to go). Since reading about all the aloe and lotions and deoderant on this board I asked them what I should use or not use.  They told me I was fine to use deoderant as long as I did not put it below my lymphnode scar line.  Nothing above that is in the field of radiation.  They said to use no lotions until the doctor tells me too, but that I could use aloe if I wanted to as long as it was not put on several hours before treatment.  Also, I did not get \"tattooed\" like others spoke of.  They only drew markers all over me and just remark them as they think they need to since they see me every day.. I was thankful for that too.  The actual treatment was way shorter than I thought it would be which I was glad for as I suddenly got very nervous before going in thinking about what was going to be done to my body .  About 30 seconds after getting up off the table the power went out in the whole building!!  Whew, was so glad I had finished the treatment before that happened!!!  Round two tomorrow!  My friend and I decided that she would go with me to my every Wednesday appointment and then treat ourselves to a movie once a week.. Hopefully that will make the weeks fly by a bit faster!",
      "MessageIndex": 223,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Jul 6, 2011 06:09PM kshav6 wrote:",
      "MessageIndex": 123,
      "PostDate": "06/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Aug 6, 2011 09:24PM kshav6 wrote: 16/16 and one boost down.. two boost to go.. I have to say that last week drug me down energy wise bigtime.. By Thursday night I was so worn out I could not think straight and Friday was no better.  I do feel a bit better today, but plan on taking it easy to rest up for tomorrow.  I have to drive a couple of hours to take my son back to the base he stationed at and then drive back.  Only two more boosts to go and I will finally be done.  I feel for those of you going the full 33 rounds.  I am glad I was allowed to do the double doses and get it overwith quicker.  Although, I am told it is the same side effects, they just come on quicker doing it this way.  My skin got kind of red.  My nipple was sore pretty much the whole time, but not as bad toward the end.  It is more like the inside of my breast is sore then the skin on the outside.  When I first sit up in the morning I have to hold my breast and let it down gently because it hurts to just let if fall.  The nurse said it must be from some swelling and irritation going on in the inside. I loved the line \"May the Coritsone be with you!\"  Too funny :)",
      "MessageIndex": 523,
      "PostDate": "06/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Jun 12, 2011 06:42PM kshav6 wrote: I read where it does not matter how easily you burn.. Some people with fair skin fare better than those with darker skin and visa versa.. I think it is an individual thing.",
      "MessageIndex": 9,
      "PostDate": "12/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Jul 21, 2011 01:55PM kshav6 wrote: @mabye484 thanks for the info.. I heard that just because you turn pink early it does not necessarily mean you turn red fast, so hear is hoping I don't.  My main problem right now is my nipple is sore.  It got sore after only two treatments.  The RO looked at it and saw nothing.  I have taken to putting aloe on it and that seems to help some.  Did you have to have any boosts after your 16 treatments?  I saw in my record that they have me scheduled for three, but the doc never told me that lol.  Does rads cause insomnia too?  @Elizabeth1889 My dentist knows about my rads treatment and did not say anything about it causing damage to the roots.. I wonder if this is something that is newly found :/",
      "MessageIndex": 317,
      "PostDate": "21/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Jul 25, 2011 05:34PM kshav6 wrote: Welcome LeeLee3.  Glad you found the group, it has been a lot of help for me :) I too am worried about having to take Tamoxifen for the next five years.. I am NOT looking forward to the potential side effects and to think it won't be just for a few weeks or even a few months, but FIVE years!!",
      "MessageIndex": 374,
      "PostDate": "25/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Jul 21, 2011 03:16PM kshav6 wrote: @pejkug3 I always have questions as well.. Sometimes they are answered well and sometimes they are answered like I am being a pain in their back side lol.  I was wondering as I was lying on the table getting radiated whether most people just go in and do their treatments without questions since that particular time I seemed to have annoyed them a bit lol  I want to know exactly what is going on.. I don't just go blindly because someone told me to lol.  I asked for copies of my treatment plan and the nurse lady looked at me like \"what for?\", but she pulled it together and got me a copy lol.. That is the only way I found out they plan on doing three boosts at the end of my treatment.. They certainly did not tell me!",
      "MessageIndex": 319,
      "PostDate": "21/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Jul 23, 2011 12:32PM kshav6 wrote: For some reason I am always wanting icecream!  I have always liked it, but never craved it.. But shakes are the best right now :)  But, I will try to kee up with the protein more than the shakes :)  Thanks for answering about the nipple pain.  I still have it, but it has not gotten worse.  When I first wake up in the morning and the full weight of my breast goes down the whole thing hurts.  I have started using the Aloe and that seems to help too.",
      "MessageIndex": 345,
      "PostDate": "23/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Aug 4, 2011 03:26AM kshav6 wrote: Second to last day of rads today yippee!!  Then have three boosts and I am DONE.  They did the prep work for the boosts today and drew a circle to mark the spot.  Now I have X's and O's on my chest :)  Gotta love it!",
      "MessageIndex": 497,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Jul 20, 2011 10:22PM kshav6 wrote: Jessica, I felt tired early on too and was wondering if it was in my head as well.. I had my fifth treatment today (doing fractionation so it is more like the 10th treatment).  Today is the first day I did not feel tired after treatment.. I am starting to turn pink already though :/",
      "MessageIndex": 312,
      "PostDate": "20/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Aug 15, 2011 06:08PM kshav6 wrote: LeeLee, yes I use the Aquaphor too.  First I put on the aloe then if the itching continues I use the Aquaphor.  yesterday my boost site was bright pink like after a day after being out in the sun all day.  I had not gotten that pink the whole time durring rads!  It hurt about like a sunburn too.  On went the aloe and the Aquaphor and it is a little better today.  I feel like my boob has been cooked from the inside out!  It has been sore when I get up in the morning and my underarm area feels a bit swollen too.. On a good note, the fatigue is starting to back off \"SOME\". :) How many boosts do you have LeeLee? I hope your week of rads flies by ladies :)",
      "MessageIndex": 591,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Aug 9, 2011 06:53PM kshav6 wrote: Thanks for the congrats ladies.  I will be celebrating tomorrow when I do not have to go to another appointment :).  It was nice today, the tech ladies gave me a graduation certificate which is now hanging on my refrigerator lol.  I saw the RO today and he said I actually looked really good.  He told me that usually women with larger breasts have more of a reaction than I had.  That was good news.  The only discomfort I have is the nipple.  I got tender almost from the first treatment and it has stayed tender the whole time.  It is swollen and itchy now.  The other part of my breast that did not get the boosts is already starting to lighten up and is not near as red as it was, although I can still see exactly where the radiation was hitting.  I was also told today that when you have the frationated treatments the double dose tends to make you more tired.. Funny how they tell me all this stuff AFTER treatments :) They also gave me an evaluation form to fill out and mail back to them.  For anyone having to take rads I would personally recommend going the fractionated route.  The people there kept asking me how I \"got to\" do that kind of treatment.  The way I \"got to\" do it was becuase I asked about it.  I did research when I was first diagnosed, and asked about it and the brachytherapy treatment.  I would have been doing the 33 treatments plus boosts had I not asked.  So, if any of you ladies know anyone else just starting their BC journey this is an option that not everyone knows about.",
      "MessageIndex": 550,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Aug 9, 2011 07:39AM kshav6 wrote: pejkug3 - I would have said the same thing too.. I still have not been offered any creams etc. Only when I got a little pinter and complained of nipple pain and itching did they recommend that I go get creams.. Other than that these people tell me nothing and offer nothing.  If it were not for this site, I would not know anything about anything lol.  LindaJanette - Hope the beginnng of this week is better for you, because it will probably cycle around again by Sunday (at least that is what I find happens to me).  Just know it is par for the course and don't be hard on yor self about it :).  Today is my LAST DAY - Last boost will be overwith in a little over an hour then no more!  Yeahhhh!",
      "MessageIndex": 545,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Aug 12, 2011 10:14AM - edited Aug 12, 2011 10:15AM by kshav6 LeeLee - The boosts are different because they just do one area.  On mine they attached something (like an extension) to the rads machine and it got real close to my skin.  They also moved the table I was lying on in an angled direction.  There is only one shot of rads (as opposed to three different angles they were doing on me before) and then done for that session.  I was also told that the boosts only go just below skin deep, not as deep as the regular rads.  The strength of the radiation was just a little less than normal too, but not much.  Now (three days since the last one) I can clearly see the area that was boosted.  It is pretty red and it is kind of sore.. But mainly only when I have to itch.  My nipple is very itchy and irritated and it was not in the boost area.  The boost area was over my lumpectomy scar.  Yesterday I was so freaking tired I had to go take a nap and I was pretty lethargic all day.  So, I guess the effects of the rads continue even though I am no longer getting them. LindaJ - The route I took was I got double the dose of radiation each day and went half the amount of time.  It is a way that they are finding that works just as good as extending it out for five or six weeks.. I went a little over three weeks with 16 rads and 3 boosts (which equaled to 32 treatments with I guess six boosts).  I did not have any worse skin reaction and actually had better skin reaction than some who go the extended route.  The doctor told me before I started that he sees no skin reaction differences in women that go the fractionated route as opposed to the regular route.  The only thing they did tell me later was that women doing the double dose tend to get more tired.  Since it is a shorter amount of time, I guess that is a fair trade off.",
      "MessageIndex": 572,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Jul 25, 2011 11:02AM kshav6 wrote: @GmaFoley, thanks for the recipe.  It actually sounds yummy!",
      "MessageIndex": 368,
      "PostDate": "25/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Jul 27, 2011 11:56AM kshav6 wrote: @Smilie - Thanks for the encouraging words on Tamoxifen.. It is good to hear that some people do have an easy time of it after hearing so many other not so great stories.  I wonder why some docs do the Tamoxifen after rads and others not.. Just currious on their reasoning there.  I think the fatigue has caught up with me now. I just had 10/16 +3 boost of the fractionated doses so am about half way there now.  Where \"there\" is I am not sure though :).  The fatigue to me is mostly head fatigue.. My body does not feel worn out like the flu makes you feel, but my head is tired and fuzzy and  I can't make myself go to sleep really.. It is very strange to me.  I did not have a great day today.  Was supposed to see my oncolcogist this morning.  First off, a friend was supposed to go today and we were going to go to the movies and lunch.  She backed out.  Then my husband was supposed to go and he is sick and grumpy so we got into it before it was time to leave this morning and I told him to just not go because I did not want to go there fighting and grumpy.. I figure if he is not there to support me then no reason for him to go at all.  So, I went by myself.  Sat there for an hour and still no doctor.. Finally it was almost time to be at my rads appointment so I went to the front desk to ask how much longer the doc would be and the nurse was like IDK you will have to ask the doc.. uhhhhh no doc around to ask!  Then she looked at the doors with patients in the rooms and said it looked like there was still one patient beofre me.  So, I told her I had to go becuase I had a rad appointment at 11.  She was still a bit pissy and said I would then have to go to the checkout desk and tell them I was leaving.  So, I was there explaining to her that I did not get seen when said nurse marches in with the paperwork that I was supposed to have given the checkout girl.. She did not tell me to wait to get it but was pissy about handing it to the checkout girl.  The checkout girl was like when do you want to reschedule.  I am thinking to myself NEVER!  But, I will be back again tomorrow to try again. None of them were appreciative of the fact that they had just wasted MY time, like MY time does not count.  I am no thrilled my oncologist anyway and to have them treat me like this sucked too.  I will say something to the oncologist about it tomorrow and see what she has to say too.. wonder if she will appologize.. NO ONE appologized!  Geeze they are making tons of money off my insurance, you would think they could at least be nice. Anyway, I am not sure if I am so bitchy about it because I am tired or what.. Just had a crappy day and it was all rainy and nasty on top of it too..yuck.  Thanks for letting me rant :)",
      "MessageIndex": 398,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Jul 27, 2011 05:02PM kshav6 wrote: @LindaJanette - Thanks for the kind words.  I never even saw the doctor.. only heard her voice in the next room lol.. It was her staff that was being insesative.  I am hoping to have a better day tomorrow.. I get to go see a funny movie so the belly laughs should help :)  Sorry to hear about the bilsters, I hope they heal quickly and you get no more!!!",
      "MessageIndex": 401,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Jul 29, 2011 12:55PM kshav6 wrote: @DenimBlue - I tried to get the front part of the label off to see what the ingredients are in the Aquaphor Healing Ointment that I use, but it is so stuck together I cannot get it open! LOL.. I looked it up online and found this www.ehow.com/list_5813498_aqua...  I did not see anything ending with parabin.  This comes in a tub, not a tube though.  It is very thick.  I also have a tube of CVS brand lotion that is comparable to Eucerine Calming Creme.. It does not contain any parabin either  It is called Dry Skin Therapy Soothing Cream (CVS brand).  Non-irritating and fragrance free.  I am finding now though, that the aloe sooths my skin the best.  So, I am putting the aloe on during the day and the Aquaphor (which is made by Eucerine) at night since it is so thick.  The itching has started to back off since I started using this regimen.  I hope this helps!  @LeeLee3 - I had a much better day the next day :) Went to the oncologist yesterday and they were all majorly sucking up and nice.  The doctor actually appologized and that was good enough for me.. Just wanted to be recognized that my time is valuable too you know?  After all of my appointments a friend and I went to lunch and a funny movie.  Strange thing, this fatigue.. the movie was funny (Horrible Bosses), but I just could not work up a huge laugh like I know I would have before..",
      "MessageIndex": 425,
      "PostDate": "29/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Aug 1, 2011 10:10AM - edited Aug 1, 2011 10:27AM by kshav6 I sure wish there was a \"LIKE\" button on this forum lol.. There are a lot of times I would like to just hit the \"LIKE\" button on some of these posts :) @jankc - I have easy to burn skin and have even had skin cancer on my face many years ago, but have been very lucky so far about skin reaction to the rads.  I just finished treatment 13/16 (doing the double dose treatment so have to go fewer times).  So far I have just turned pink then tan then pink.  I  put on aloe after treatments and several times throughout the day.  I started using the Aquaphor once I got pink, but I think that may have actually made me get more pink.. So, for now I am sticking to just the aloe.  After treatments are over I will start back with the Aquaphor. @Elizabeth1889 - My rad/onc told me that there is a risk of a kind of cancer that you get on your skin.. I wish I could remember exactly what he called it.  He said it does not increase the risk of another BC.  He said of all the women he had treated he had only seen this happen once or twice and I believe he said it happens fairly quickly (like within two years).  I was worried about it too because of my history of skin cancer.   I have to look at it this way.. I had no risk for BC yet I got it.. My sister would have a much higher risk and does not have it..So, if it is going to be it is going to be.. How many cases have you actually heard of women getting cancer from the rads themselves? I have not heard of any except the one the rad/onc told me about (of course I have not really researched it much either).",
      "MessageIndex": 455,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Aug 9, 2011 07:05AM - edited Aug 9, 2011 07:05AM by kshav6",
      "MessageIndex": 543,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Aug 12, 2011 10:19AM kshav6 wrote: Congrats Pejkug3!  LindaJ did you get that other after rads thread going?  If so, how do we get to it?",
      "MessageIndex": 573,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "kshav6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127977/profile",
      "Content": "Jul 6, 2011 08:48PM kshav6 wrote:",
      "MessageIndex": 42,
      "PostDate": "06/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769167",
      "Title": "APBI, Brachytherapy - anyone? AnneWisc kira1234"
    }
  ]
}