{
  "AuthorID": "Kskchap",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270524/profile",
  "Posts": [
    {
      "AuthorID": "Kskchap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270524/profile",
      "Content": "Mar 13, 2018 03:00PM Kskchap wrote: hi dawn1982, I’m sure everyone’s drain output is different. I’m day 12 post-op and my two remaining drains are putting out approximately 13-15 ccs each every 12 hours. Are you “stripping” the tubing regularly? ",
      "MessageIndex": 64,
      "PostDate": "13/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/862535",
      "Title": "March 2018 Surgery Group mkn86 Kaykat"
    },
    {
      "AuthorID": "Kskchap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270524/profile",
      "Content": "Mar 10, 2018 07:01PM Kskchap wrote: Hi Everyone! I had a bilateral mastectomy on 3/2. Feeling a little better now 8 days later but still NOWHERE near normal. I had tissue expanders placed and I can't bring myself to look at them so showereing has been interesting! Anybody else feel this way? I am not brave when it comes to wounds, blood, pain, etc. Some of you have been asking about the sentinel node biopsy. I had mine during surgery, with the injections ( 4) before surgery when I was awake and not medicated. I pushed for and was given EMLA ( numbing) cream at the site of the injections about 45 minutes prior. It helped. I did not feel the needle sticks, but it did s sting a bit as the dye entered. You'll have to arrange for this days before surgery as it's not standard procedure- at my hospital anyway. Original diagnosis was a large DCIS but pathology after surgery revealed microinvasions of ILC. Other “good\" breast removed was found to have ALH, a precancerous condition but now I'm glad I went through with it. I was having doubts on the second breast as surgery approached. I have a strong family history of BC. I joined a DCIS support group on Facebook but I feel kind of abandoned as I've moved into the “ invasive cancer\" category. Reading that kind of outcome before my surgery scared the daylights our of me too. I hope that I've found support here. It's so helpful to me to read everyone's stories. Best wishes!",
      "MessageIndex": 56,
      "PostDate": "10/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/862535",
      "Title": "March 2018 Surgery Group mkn86 Kaykat"
    }
  ]
}