{
  "AuthorID": "kthopkt",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172170/profile",
  "Posts": [
    {
      "AuthorID": "kthopkt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172170/profile",
      "Content": "kthopkt wrote: So I was scheduled for a core needle biopsy this morning. The radiologist had seen a 1cm complex cyst beside a 1cm solid lesion. I was ready for the core; I even took a valium my PCP had prescribed. Well, once I got there the surgeon changed his mind and did a fine needle biopsy instead. Fluid was expelled and it was clear. I know this is a very good sign. I cannot even feel the lesion now. However, he did say the mass was lobulated. What does lobulated mean? Also, why did the radiologist see a solid mass but then today they saw a fluid filled mass? I feel like I have been put through so much more stress than needed. Has anyone else had an experience like this? I do think the surgeon was apprehensive to do the core because of the location of the lump. He did use the words dangerous due to how thin I am. I am assuming I am in clear now. Are my chances of having cancer even less now? Also, I asked the sonographer if it was shadowing I was seeing on the screen. There was shadowing or something around the mass. She told me she was not allowed to elaborate. Thanks for any input. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801525",
      "Title": "Biopsy this morning kthopkt kthopkt"
    },
    {
      "AuthorID": "kthopkt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172170/profile",
      "Content": "Mar 8, 2013 08:29AM kthopkt wrote: Does anyone have any advice about my above comment?  I am really confused. Why did the radiologist see a solid lesion but then the cyst collapses when aspirated?  How likely is it that the radiologist was wrong?  They did still send the cells off to be tested & I will find out Monday. The liquid expelled was staw colored and cloudy.  I am still worried sick. Has anyone ever been told they had a solid lesion only to find out it wasn't?  I am scarred that they only aspirated the cyst & missed the solid lesion. I am a chronic worry & would greatly appreciate any advice. ",
      "MessageIndex": 1,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801525",
      "Title": "Biopsy this morning kthopkt kthopkt"
    },
    {
      "AuthorID": "kthopkt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172170/profile",
      "Content": "Mar 11, 2013 01:06PM kthopkt wrote: Well I finally got my results this am & the cysts were benign! I will be checking out for now but may be back. If the cysts refill, then I will have to have an excisional biopsy but if not I go back for a u/c in 6 months. The cyst were filled with rare cytological bland aprocine metaplastic cells, whatever that means:). Anyhow, there was no specific diagnosis just a benign process of cystic content. Thank you so much to everyone on here for your support!! My very good friend was diagnosed 4 weeks ago & my heart goes out to her & everyone else dealing with such a diagnosis.",
      "MessageIndex": 5,
      "PostDate": "11/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801525",
      "Title": "Biopsy this morning kthopkt kthopkt"
    },
    {
      "AuthorID": "kthopkt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172170/profile",
      "Content": "kthopkt wrote: Very new to all of this. I am 33 & discovered a small lump 3 weeks ago. No history of breast cancer in family; do not smoke or drink; I am at a healthy weight; & no other health concerns. My only risk factor is that I have never had any children. My mammogram did not show anything but the ultrasound showed 1cm cystic complex & immediately adjacent to this complex there is a 1cm solid lesion which is suspicious for breast ca. The BI-RID is 4. The suspicious area is at bout 6:00 and against the chest wall. My surgeon said the biopsy would be painful because of how close it is to my chest wall & because he would not be able to use much lidocaine. I am very concerned and am looking for any insight anyone has to offer. I am have enormous anxiety about the biopsy. Please help! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801064",
      "Title": "Core needle biopsy next week kthopkt april485"
    }
  ]
}