{
  "AuthorID": "ktn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
  "Posts": [
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Jun 5, 2009 01:35AM ktn wrote: Marcia- To be honest the expanders were the hardest for me out of everything! I had a dbl mast, chemo and rads. I had my drains in almost one month too which doesn't help. Talk with your PS and see what he thinks. I was given muscle relaxers which I took the day and night thatI had fills. The muscle gets so sore with the expanders under it. My final fill was the hardest and I have 550cc on each side. I'll have my exchange surgery in Aug. I've been totally filled since Feb and they don't hurt anymore but they are hard as armour! I couldn't lie on my sides for quite awhile but can now. I took advil which helped initially too. There were moments I thought should I get them out??? But it has gotten better. Best of luck! Kathy",
      "MessageIndex": 2,
      "PostDate": "05/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735328",
      "Title": "Is it just me? Expander driving me nuts! marcia-n makingway"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Apr 29, 2010 08:02PM ktn wrote: I did some weeding, yard work, and sweeping the garage this past week. I woke up the next day sooo sore! I'm still achey days later. In the past I wouldn't have thought twice about it but of course now I get worried. I've had different aches and pains but they never get bad enough to get checked. I see my oncologist in June also so I'll mention things then if they persist. I'm afraid I'm in the \"ignorance is bliss\" phase. I'm on Arimidex and had expander reconstruction so that can cause alot of the aches too. It really is frustrating that we have to worry isn't it?",
      "MessageIndex": 6,
      "PostDate": "29/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/751684",
      "Title": "Sudden pain after almost 2 years ????? Mamita49 ktn"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Mar 1, 2011 07:00AM ktn wrote: You have had ALOT done and should be tired!!! I had mast, chemo and radiation. I was off work for 7 months and when I went back I decreased my hours for awhile. I tried to walk during treatment but sometimes even that was hard. Yesterday I had my checkup with the radiation MD for 2 years after radiation visit. I feel fine these days but have learned to take care of myself too. I had been told it takes about one year from final treatments to feel better but you also had added surgeries. Your body is also dealing with menopause stuff. All of this recovery takes time and each body is different. Take it a day at a time and things will improve!",
      "MessageIndex": 3,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765572",
      "Title": "So Many Questions about Recovery peverson pupfoster1"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Oct 23, 2010 05:29AM ktn wrote: I was told by my onc not to change or get a new prescription for eyes during chemo. I could hardly read the paper with reading glasses at the time. My sight did go back to normal after chemo ended Honestly I had the most problems with the AC so hang in there!",
      "MessageIndex": 6,
      "PostDate": "23/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/759761",
      "Title": "Anyone have Eye Problems with AC Lovelyface anonymice"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Jun 16, 2010 06:34PM ktn wrote: It will put your mind at ease when you get all the results. I'm on Arimidex and get bone pain and joint pain and my labs are good. I don't have any scans scheduled but will if things occur. I remember my onc saying after all my initial scans that all looked good but they did see some cysts on my liver. I freaked then she said, oh people have them all the time, they don't mean anything!!! Don't mention it then! I wish we could go back to the time of not worrying so much....this after treatment time is hard too!",
      "MessageIndex": 3,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/754220",
      "Title": "Onc, Zometa, Tumor Markers Today Shanagirl karen1956"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Apr 16, 2009 07:36PM ktn wrote: I finished 5+ weeks of radiation to both sides in mid Feb. I was also told to be really careful to keep that area protected this next year. The area that was so reddened from treatment is fading but can come back right away if burned from the sun.They really stressed the need for strong sunscreens too!  I figured I'll have to wear tshirts to keep it covered if I'm in the sun. I love having a tan but will be careful. I bought some self tanner to try too.",
      "MessageIndex": 2,
      "PostDate": "16/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/732609",
      "Title": "Sun on Radiated Area..How Soon??? Jeanne_D scarp"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "May 13, 2010 06:22PM ktn wrote: I agree with you! In the past I would have a pain, take advil and not think twice about it! Now I notice everything! I started keeping a notebook to jot things down and it has been reassuring that so many things just go away. I work 12 hour shifts so get achey on work days but do well when I'm home and taking it easy. I think some issues from treatment take a long time to go away too.",
      "MessageIndex": 10,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/752239",
      "Title": "My butt hurts bejuce ktn"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "May 10, 2010 01:29PM ktn wrote: bejuce~ Just wondering if your pain is gone. I also had pain around my tailbone area during snowmobiling time. It felt more like a deep bruising than bone pain though. It has mostly gone away but if I sit a long time in the car or on a plane I notice it. Nothing I need to take meds for but was worrying awhile. The onc said I could have an xray if it continued but it actually got better. I had heard from others here on the boards that they had similar symptoms too. I've been trying to exercise more so that brings more aches all over. I tend to blame Arimidex for alot of this!",
      "MessageIndex": 8,
      "PostDate": "10/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/752239",
      "Title": "My butt hurts bejuce ktn"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Sep 22, 2009 10:06AM ktn wrote: Dragonfly- Many months ago I posted the same question and received lots of advice. I decided to have my port removed when I had my expander exchange surgery. It had been in for one year at that point. I was tired of the flush appts! I had talked with my oncologist and she said I couldn't keep it in forever, it was a foreign object that could sometime cause an infection. Also it was an easy procedure to get so if I need another someday I'm not worried about it. I do get Zometa every 3 months so I have to hassle with the iv and lab draws now (the port made that so easy!) but I'm happy to have it out. Good luck with your surgery.....to me chemo was the hardest part!",
      "MessageIndex": 3,
      "PostDate": "22/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/740747",
      "Title": "Having the port removed? Dragonfly1976 NancyD"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Aug 16, 2009 11:30AM ktn wrote: My postop report had been faxed to my Gyn primary MD who posted it on the\" my chart\" website for me to read. I printed off 11 pages and was totally overwhelmed! My surgeon called that night because I needed to go back for more lymph nodes after the sentinel node on one side was initially negative. My husband finally took the report away and it's filed away. I am an RN and it was tough for me to read and decipher. I agree with chinablue that I don't let the path report get to me. I had mast, chemo, radiation, and am on Arimidex. I'm thrilled to just have had my exchange surgery. I try to look forward and am proud I made it through the past year of treatments and did well. I know it is hard but I would try to wait until Tues to see your report with the MD to explain things. Best of luck!",
      "MessageIndex": 2,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739028",
      "Title": "Anybody get their path results BEFORE follow-up with surgeon? tovahsmom dee1961"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Nov 16, 2010 07:44PM ktn wrote: Tonlee~ Sorry you have to be starting all this! I did the DD chemo also....AC every 2 weeks then Taxol every 2 weeks for a total of 8. I didn't have to do herceptin. The neulasta ($$$) is a shot given the day after chemo to keep your wbc count up to be able to keep up with the frequent chemo. The chemo is given with antinausea meds and steroids. It isn't fun but it is doable! The AC affected my appetite and I was pretty tired. The Taxol takes longer to infuse but was easier to handle. I really used these message boards to help me through. Not everyone gets all the side effects but it's a real help to know you aren't alone. I had great chemo nurses to help me out. Also they don't want you to have side effects so let your MD know everything. They can adjust meds as needed. Good Luck! Kathy",
      "MessageIndex": 1,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/760840",
      "Title": "Dose Dense Starting Nov 30th TonLee TonLee"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "May 13, 2010 09:17PM ktn wrote: What a great thread! I have to agree with clariceak~ we have to live and make plans! My mom was diagnosed in 1997 with stage IV lymphoma. It was in her bone marrow and several other places. She had to go through chemo (and losing her hair) twice. By the 2nd time a new drug was out that took care of everything and she is 75 and cancer free for over 10 years. they had been in the process of buying a vacation home in FL and she wondered if they should cancel.Good thing she didn't~ we've had years of good memories there. We often talk about what if she had just given up at her diagnosis? My husband and I just made plans to go with friends to Italy in Sept. I have had aches and pains lately due to gardening and of course the Arimidex. I had a moment of hesitation when I booked without travel insurance but no matter what I am going!At the onc office they always talk about looking ahead and making plans....that's my plan! Kathy",
      "MessageIndex": 22,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/752478",
      "Title": "Stage III 15+ Years? Shanagirl Shanagirl"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "May 26, 2011 08:17PM ktn wrote: I agree with 3rings.....try counseling and see if that helps. Some men get so freaked out about cancer they do things they might not have ever done. 37 years is a long time to be married so I know this must be devastating. Take it all one step at a time and I pray things will work out for you. I'm glad you have the support of your daughters too. Best of luck to you....",
      "MessageIndex": 35,
      "PostDate": "26/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769466",
      "Title": "Cheating Husband teamnana car2tenn"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Dec 7, 2010 11:36PM ktn wrote: This news has been really hard for me too. I admired her before I had my diagnosis and remember well when she had it recur in her bones. On the computer tonight there was a video from Fox News that really irritated me. They had an MD on and the host said\" I thought BC was the better cancer to get\" What??? The MD stated how many women per year are dx with invasive BC. Because 40,000 women die yearly of BC and 110,000 die of lung cancer, BC is \"better\". As a stage 3  both sides BC patient I live in a high risk reality. I will never feel I had a \"good cancer\". This is just another example of how we are not understood and how important these boards are!",
      "MessageIndex": 109,
      "PostDate": "07/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761600",
      "Title": "Elizabeth Edwards jleigh Lowrider54"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Apr 16, 2009 05:30PM ktn wrote: Hi! I have been a labor and delivery nurse since the mid 80's. I rarely ever used a sick day so was lucky to have enough time saved up for my first 3 months off and then LTD kicked in. I was off from the end of last July before surgery until early March after chemo and rads were done. I had never expected to need that much time off but it really helped. There were so many days during chemo that the thought of taking a shower was overwhelming! I tried to walk for exercise if I felt well but many days spent alot of time on the couch. I was told by my MD that it may take at least 1 year after treatments to get alot of my energy back. I used to work 12 hour shifts 3/week but have gone back 8 hours. I rest after if I need to. Each month that goes by gets better. I have my expanders in which are fully expanded and cause backaches if I'm on my feet too much. My PS said I would need 2 weeks off after the exchange surgery. He said most of his patients just need pain pills for the first week. I'm not sure about restrictions after. Reading some of the other boards may give more info. I do have to say I have a new appreciation for my job after being a patient. I think I do my job better after all I've been through. I realized how important my great care meant to me and how I hope to give that care to my patients too!!",
      "MessageIndex": 218,
      "PostDate": "16/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Jan 7, 2011 09:34PM ktn wrote: Palijo~ we have all been where you are at now. I ended up with a tumour in each breast with 4 + nodes on the left and 5+ on the right....basically 2 stage 3 tumours. I was devastated! I had the mast, chemo, radiation and am now on arimidex. I barely slept initially and was so scared. As I finished the different treatments I realized I was stronger than I thought. I am doing well and looking forward. These boards are an amazing source of support. Best of luck and keep writing!",
      "MessageIndex": 42,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/755213",
      "Title": "Anyone out there with more than 10 nodes positive? TammytrustsGod margyc"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Jun 4, 2009 07:26PM ktn wrote: I always enjoy this thread! My hair started growing back mid Jan. I slowly stopped wearing my wig at home and in the neighborhood. I had a hard time giving it up at work- but finally the nice weather came and I said that's enough! I washed the wig and packed it away (my husband told me to burn it but I don't want to jinx anything! Besides it was pretty $$$! ). Today was one year since I first found a lump so wanted to do something special for me. I headed to a nice salon in the area and had my very short hair styled a bit. Because it was coming in a little grey, blonde, light brown I asked about hilites. She said it was still a little short but recommended color. It looks nice and shiny, medium brown with even a little reddish cast. It was wonderful to have someone wash and style my hair for the first time since last August! I'm especially glad to put the past year behind me and keep looking ahead. I have the expander exchange in Aug then can really celebrate!",
      "MessageIndex": 39,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/733424",
      "Title": "status report and hair pic everyminute KerryMac"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Dec 26, 2009 10:36AM ktn wrote: I wish we all can have a party someday like that....how great to celebrate! thanks for a great story!",
      "MessageIndex": 21,
      "PostDate": "26/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745793",
      "Title": "Good stage 3 story!! - Happy Holidays!! mmm5 BonnieK"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Oct 12, 2010 11:44PM ktn wrote: I just flew home through Amsterdam after a trip and had to do the body scanner. After I walked through she took the wand and waved it by my chest area and sent me on my way. I've already had reconstruction and implants. I also travelled with expanders in without problem.",
      "MessageIndex": 19,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Aug 8, 2010 11:28PM ktn wrote: Thanks for posting this! You are a great inspiration to all of us! By the way~ I remember your posts that were helpful when your hair was just growing back.....and look at you now! You look great! Keep up the wonderful work! Kathy",
      "MessageIndex": 5,
      "PostDate": "08/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/756403",
      "Title": "My 15 mins of fame....some of you have already seen this on FB everyminute apple"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Apr 30, 2009 07:52PM ktn wrote: Thank you so much for showing the pictures!!! I finished chemo in Dec and my hair looks like your early picture. I still wear my wig to work (still a little chicken there!) but not at home. My hair goes every which way and came in darker than I am used to. I aspire to get the cute look in the latest pictures! Do you have any special products you use for the styling?? And did you get professional highlites or do them yourself? I wondered how this new hair held dye. I think I'll be happy to get bangs growing again too!!! Again- thanks for sharing the pix!",
      "MessageIndex": 2,
      "PostDate": "30/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/733424",
      "Title": "status report and hair pic everyminute KerryMac"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "May 6, 2010 10:24PM ktn wrote: I didn't realize until months later that my husband was asked by several friends \"is she going to live?\". He was so devastated by my diagnosis that this didn't help him out at all! For me the hardest was when someone gave me a caringbridge post to read for inspiration about their cousin who had BC. I had just had my mastectomy and sat down to read the posts for inspiration. Unfortunately the person had aggressive BC and passed away. I was not prepared for that and it upset me so much at the time. I realize it wasn't meant to upset me but I would have felt better if I was forewarned!!",
      "MessageIndex": 32,
      "PostDate": "06/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/751616",
      "Title": "OK another stupid comment comment DCMom ktn"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Mar 4, 2010 01:19PM ktn wrote: Shanagirl~ I was told the energy level got better one year after treatments end and it really has improved for me. I don't feel totally back to 'normal' yet but looking back, I know I am doing better. Our bodies have been through so much...it just takes time. Can I ask what strenth training DVD you watch? I love walking but need to start some strength training too. To reply to a few other comments...Last Memorial day was my last day with my wig and it was just time one day! My hair was still very short but the wig was starting to bug me when my hair was coming back. Now 10 months later it looks like it did before. I'm back to haircuts and hilites! My biggest gripe is getting asked all the time \"are you well now and all done with everything?'. I so wish I could say yes but we know it's not that easy. I have my 3 month appt with my onc this week and that's always a reminder of all that has happened. Going to the chemo lab last week for Zometa makes me feel bad for those getting chemo. Taking my Arimidex and having achey joints isn't fun. This is all our new reality that none of us asked for. It sure helps to have people on these boards we can commiserate with!",
      "MessageIndex": 24,
      "PostDate": "04/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/749119",
      "Title": "Stage III Recently Diagnosed What are Your Issues? Shanagirl Shanagirl"
    },
    {
      "AuthorID": "ktn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74143/profile",
      "Content": "Aug 9, 2009 12:47PM ktn wrote: Hi! I had bilateral BC and at my mastectomy the rt sentinel node was + so I had nodes removed. The left looked negative but one week later pathology showed +. I had to go back for removal...I had 3 micro+ in sentinel node and one add'l + node. I had heard at the time they don't always go in to remove if they think chemo may get rid of it. I was more high risk so my MD had me go back. It was more of a hassle than anything. I would get in to talk with your MD to get your questions answered. Good Luck!",
      "MessageIndex": 3,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738564",
      "Title": "SNB not clear after all, so confused? Kayleigh3483 Kayleigh3483"
    }
  ]
}