{
  "AuthorID": "Kuchenhexe",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195312/profile",
  "Posts": [
    {
      "AuthorID": "Kuchenhexe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195312/profile",
      "Content": "Feb 13, 2014 06:13PM Kuchenhexe wrote: Thanks, everyone! That gives me enough to answer my mom's questions. She was looking at some of the surgery-related garments on CureDiva and was wanting to get me things. I have her waiting until I actually have surgery scheduled before making any purchases, but she was curious about the whole thing with the drains. (So was I, truth be told)",
      "MessageIndex": 4,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/818021",
      "Title": "Question about Drains w/ MX Kuchenhexe exbrnxgrl"
    },
    {
      "AuthorID": "Kuchenhexe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195312/profile",
      "Content": "Kuchenhexe wrote: I haven't had surgery yet - the onc wants me to have three more rounds of chemo before we even start talking surgery, and while only one breast is affected, we both agreed that it might be better to go for a bilateral. But my question tonight is: DRAINS. Does every MX require drains? How long do you have to have them in? METAthriving.com - blog and website on Stage IV BC Dx 11/19/2013, IDC, 6cm+, Stage IV, Grade 2, mets, ER+/PR+, HER2- Chemotherapy 12/9/2013 Taxol (paclitaxel) Hormonal Therapy 5/27/2014 Femara (letrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/818021",
      "Title": "Question about Drains w/ MX Kuchenhexe exbrnxgrl"
    },
    {
      "AuthorID": "Kuchenhexe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195312/profile",
      "Content": "Dec 26, 2014 11:07AM Kuchenhexe wrote: I don't post here often, I'm usually on Twitter and my blog at metathriving.com but add me to the list. I was diagnosed in Nov 2013 with breast cancer at age 39, a PET scan and biopsy a couple weeks later confirmed metastasis to the liver. I finished 6 rounds of Taxol in May, and now I'm stable on Femara and Zoladex. I have IDC, stage IV with liver mets, ER/PR+, Her2-, BRCA1&2-. My onc is very pleased with my condition, the stability of the tumors and the disappearance of the breast tumor through chemo. I have very little in the way of side effects - hot flashes, some aching joints, that's about it.",
      "MessageIndex": 613,
      "PostDate": "26/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Kuchenhexe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195312/profile",
      "Content": "Feb 9, 2014 07:11PM Kuchenhexe wrote: Congrats! I've shared that wish upon a wedding link on my facebook, encouraging others to donate their dresses if they don't know what to do with them after the wedding.",
      "MessageIndex": 20,
      "PostDate": "09/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817845",
      "Title": "Vow Renewal Romansma"
    },
    {
      "AuthorID": "Kuchenhexe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195312/profile",
      "Content": "Aug 18, 2014 08:21PM Kuchenhexe wrote: I was diagnosed in November with BC, already metastatic with a lesion on my liver. After 6 rounds of dose-dense Taxol, the lesion shrank down to 0.2cm. I find out this Friday how it's doing, and if my cancer's staying stable on Zoladex and Femara or not. First scan after leaving chemo on Tuesday. Not looking forward to this.",
      "MessageIndex": 459,
      "PostDate": "18/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Kuchenhexe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195312/profile",
      "Content": "Dec 26, 2014 03:27PM Kuchenhexe wrote: A few months ago I mentioned a CT scan and being worried about the results, since it would be my first scan after stopping chemo and starting AI. I realized I never commented with the results. Oops. I just had another scan this month a couple weeks ago. The result of both scans: stable disease. No progression. The Femara and Zoladex are holding the line, and I have no pain or other sort of SE from the tumor. (Just joint aches and hot flashes from the drugs.) QOL is high. I was metastatic from time of diagnosis, confirmed by a PET and liver biopsy.",
      "MessageIndex": 977,
      "PostDate": "26/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Kuchenhexe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195312/profile",
      "Content": "Jan 23, 2014 05:09PM Kuchenhexe wrote: Oh my god. I have found it. The song of my people! I need to come back when I'm less exhausted and read through all of this. The first page alone has me giggling. I'm sarcastic, snarky, sardonic, and I've not bothered to treat my cancer any differently than anything else. \"Jeez. I just have cancer. It's not like I'm dyin' or anything. Lighten up.\" Yeah, that's pretty much how I see it, despite my Dx being Stage IV mets right off the bat. Not many people can get that. I HAVE FOUND HOME!",
      "MessageIndex": 145,
      "PostDate": "23/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "Kuchenhexe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195312/profile",
      "Content": "Dec 26, 2014 02:24PM Kuchenhexe wrote: Liver mets here from the get-go of diagnosis. I second the others, you need a biopsy to determine if it's a metastasis, or a new, separate primary cancer. That will affect the treatment plan. It's possible to be stable and have a good QOL with liver mets. My tumors all shrank drastically in chemo, and they're stable on AIs right now. No pain or SE from the tumors.",
      "MessageIndex": 4,
      "PostDate": "26/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827190",
      "Title": "Just diagnosed with Liver cancer Scrappygrl Scrappygrl"
    }
  ]
}