{
  "AuthorID": "kwagart",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
  "Posts": [
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Jan 24, 2015 06:18AM kwagart wrote: magiceraser Is there a chance your her2 status changed? I have lobular grade 2 that did not respond to ac&t, my initial biopsy was her2-, the pathology from my mastectomy was her2+ (6 months later). I hope your next treatment kicks your cancer's butt! Kim Ps my ki67 score was very low too.",
      "MessageIndex": 2,
      "PostDate": "24/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827842",
      "Title": "How are people with Grade 1 mets doing on chemo? MagicEraser Catesmom"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Aug 4, 2016 08:33PM kwagart wrote: Hi, 2014(probably de novo) bone mets",
      "MessageIndex": 158,
      "PostDate": "04/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Dec 19, 2014 05:17AM - edited Dec 19, 2014 05:30AM by kwagart Great thread! 1. My kids and step kids, they have all lost a parent at a young age (3,6,9,9,12) and I am not leaving until they are independent adults (now 14,18,20,23,26). And my grandkids (7 months, 3). 2. My husband, who has lost a wife already and who is so devoted to helping me with this stupid cancer. 3. My mom and two MIL (they are best buds) because they don't deserve to loose anymore kids. 4. My entire family and friends because they are awesome. 5. Myself, because I want to enjoy some peaceful years traveling, relaxing and enjoying the amazing people in my life. Thanks, I needed that!",
      "MessageIndex": 14,
      "PostDate": "19/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827071",
      "Title": "5 reasons to stay alive diana50 PattyPeppermint"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Nov 20, 2014 08:34AM kwagart wrote: hi Smellimd82 YES, there are. I am still newly diagnosed, there will be women with more experience commenting soon. You will find good information and support here. Sorry about your diagnosis, however you have found a great place to be. Kim",
      "MessageIndex": 1,
      "PostDate": "20/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/826425",
      "Title": "Newly diagnosed with bone Mets 32 Smellimd82 T-mac"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Nov 21, 2014 05:37AM - edited Nov 21, 2014 05:39AM by kwagart Thanks Deanna, You have all been such a help, even when you don't know you are helping (I have been known to lurk).  My Her2 status did change! I was lucky to find out when I did, apparently the addendum to the mastectomy pathology was stuck in the lab and did not show up in any of my files????Luckily I caught wind of it and with the help of the greatest nurse ever, tracked it down! So now I am 99% er+, 90$ pr+ and Her2+++, oh and BRCA2+....Guess I am just an overachiever:)  Weird pathology for lobular. Very excited to start perjeta, Herceptin and taxetore next week, FINALLY...I hope the delays have not allowed the cancer to wander further than my bones!  Every headache, stomach ache and my imagination runs wild! Kim",
      "MessageIndex": 12,
      "PostDate": "21/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/826425",
      "Title": "Newly diagnosed with bone Mets 32 Smellimd82 T-mac"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Nov 21, 2014 08:13AM kwagart wrote: Shutterbug, My first reaction to go to MD Anderson was because of the aggressive nature of my lobular cancer, once we determined that I was HER2+, it made sense.  I decided to get my second opinion from Karmanos, which is where I initially met with an MO and where my surgeon is located.  The MO at Karmanos spoke with my local MO (Karmanos is three hours away) and they agreed on this treatment.  The updated pathology and the treatment made me comfortable, also the MO at Karmanos assured me that they can refer me to any trials that my be relevant to my cancer. My MO at Karmanos is Lawrence Flaherty, I would recommend him for a second opinion, Karmanos is a NCI. By the way, also my local MO is affiliated with McLaren. McLaren is located throughout Michigan and has just acquired or merged with Karmanos. I have not eliminated MD Anderson or UofM, however right how I feel I am on the right treatment plan. Thanks for asking, Kim",
      "MessageIndex": 16,
      "PostDate": "21/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/826425",
      "Title": "Newly diagnosed with bone Mets 32 Smellimd82 T-mac"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Feb 17, 2016 10:22PM kwagart wrote: is it the divinchi method? I had that and it was really very easy",
      "MessageIndex": 3,
      "PostDate": "17/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/841344",
      "Title": "Meeting with the Gynecologist next Tuesday phrogger78 phrogger78"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Nov 9, 2014 11:49AM - edited Nov 9, 2014 11:51AM by kwagart Diagnosed the same month that I turned 49 After chemo and mastectomy found bone mets Brca2 positive (was unaware, not much cancer in family) Low grade lobular, probably there a while, mammogram every year since 40 ",
      "MessageIndex": 1016,
      "PostDate": "09/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Dec 13, 2014 10:00PM kwagart wrote: My diagnosis is similar, I am pretty new to this but I figure triple positive means lots of treatment options! The Cleopatra study recently published shows good results from the herceptin taxatore perjeta treatment plan for her2+. Ignore online survival stats, we are not stats and they are based on what has happened in the past. Lots of good information and support from women who have been at this for a while. ",
      "MessageIndex": 1,
      "PostDate": "13/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/826965",
      "Title": "anyone similar dx? Strong65 Shutterbug73"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "kwagart wrote: I have often wondered way the impact of stage iv patients living longer will have on private and government insurance systems? Does this article make anybody else feel like a case may be building against us? I do not subscribe to the theory that there are conspiracies to hide cures for money, etc, but this study made me a little uncomfortable. http://news.yahoo.com/doctors-raise-concern-chemo-...;_ylt=AwrBT_tFurZVLFsArwBXNyoA;_ylu=X3oDMTEzbnMya3EzBGNvbG8DYmYxBHBvcwMzBHZ0aWQDVklQNDQyXzEEc2VjA3Ny Kim Dx 4/16/2014, ILC, 6cm+, Grade 2, ER+/PR+, HER2- Chemotherapy 5/20/2014 AC + T (Taxol) Dx 9/24/2014, ILC, 6cm+, Stage IIIC, Grade 2, 11/24 nodes, ER+/PR+, HER2- Surgery 9/24/2014 Lymph node removal: Left, Sentinel, Underarm/Axillary; Mastectomy: Left; Prophylactic mastectomy: Right Dx 10/28/2014, ILC, Stage IV, Grade 2, mets, ER+/PR+, HER2+ Targeted Therapy 11/25/2014 Herceptin (trastuzumab) Targeted Therapy 11/25/2014 Perjeta (pertuzumab) Chemotherapy 11/25/2014 Taxotere (docetaxel) Chemotherapy 8/4/2016 Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833720",
      "Title": "Does this make anybody else a little uncomfortable? kwagart TonyaB"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Jul 28, 2015 12:35AM kwagart wrote: Everybody certainly has to decide what is best for them, for me chemo made my bone mets inactive and I had a reasonable quality of life during treatment. I just think that the article makes a broad statement considering all of the factors about each individual cancer. I don't nec",
      "MessageIndex": 2,
      "PostDate": "28/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833720",
      "Title": "Does this make anybody else a little uncomfortable? kwagart TonyaB"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Nov 17, 2014 07:59PM kwagart wrote: magiceraser My Ilc was erpr+ her2- for initial biopsy and node biopsy and erpr+ her2+ for mastectomy pathology. Have you had a bone biopsy? Kim",
      "MessageIndex": 3,
      "PostDate": "17/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825641",
      "Title": "Weird Pathology Results on latest bump MagicEraser MagicEraser"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Nov 24, 2015 10:27AM kwagart wrote: Hi Everyone, I am a big old lurker, learning from everyone, rooting for everyone…today I think I may be able to contribute something on the topic of our families moving on. Twelve years ago I was a very happily married woman with three kids age 3,6,9. My husband and I started dating the night I graduated from High School and got engaged the night I graduated from college. My husband, 39 years old, dropped us at the local campground where he was to join us after work, instead I received a frantic call from his work saying that he was having a \"seizure\", when I arrived my BIL told me that he had died, it was a sudden cardiac arrhythmia. I can tell you that the \"two become one\" part of wedding vows is very accurate and that the one that remains is no longer the same person and that a new person eventually emerges. After some time, a friend asked her brother, who had lost his wife to a cardiac arrhythmia two years earlier than I lost my husband, she was 34, to call me. We developed a friendship, mostly via instant messaging, he also had kids just older than my kids and we were busy. Eventually we started hanging out, as friends and somewhere along the line we wound up married. Blending these two families was not easy, mostly because we had slightly different parenting ideas, we made sure that our issues did not become the kids issues. What we have today is a sold, hard fought for marriage and five amazing kids. The extended families are all included whenever possible and my two mothers in law are best friends. We have two beautiful grandchildren that have a grandma in heaven and two grandmas on earth. I just wanted you to know that the love doesn't die and that we live in the people who love us. My life with my husband and my love for him are intact and are completely separate from my life with my current husband, the same is true for him and his late wife. We do not replace the kids lost father/mother, we just add a person who loves them. The point that I am really trying to make is that my late husband and his late wife are a part of us and our children and there presence is always there. I hope my story helps, now I have to go get ready to host Thanksgiving for 30 people from all four extended families, Jenny and Adam will be there in our silly stories and in our hearts.  Kim",
      "MessageIndex": 50,
      "PostDate": "24/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/836744",
      "Title": "What's the hardest part? nancyh ABeautifulSunset"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Aug 28, 2016 02:53AM kwagart wrote: Rosetide, You're welcome and I hope that you do awesome on h&p! Kim",
      "MessageIndex": 4,
      "PostDate": "28/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/847397",
      "Title": "8 Rounds of Taxotere, Perjeta, Herceptin? Or not? rosetide rosetide"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Aug 27, 2016 09:40PM kwagart wrote: Hi Rosetide, I did six rounds of taxotere and then continued on h&p. I finished taxotere 3/15 and had good scans for a year, however My tumor markers started slowly inching up after about 9 months and went above normal in June 2016. I had a pet scan in July and some of my bone mets were showing activity. My second opinion doctor said that the decision to drop taxotere after six rounds was arbitrary in the cleopatra trial and he keeps women on it until progression or until they are not able to tolerate side effects. I decided to go back on taxotere to get the most mileage out of my first line treatment (he didsay taht I could choose to go to the next line). The doctor said that breaks and dosage adjustments can help manage long term use. That being said, many women do well with h&p alone or with a hormonal. I think that I would discuss options for revisiting taxotere if h&p alone do not seem to be getting the job done. I have had two doses of taxotere since restarting, we dropped femara and I think that the joint pain from that was worse than the chemo side effects for me! Good luck with whatever you choose, Kim",
      "MessageIndex": 1,
      "PostDate": "27/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/847397",
      "Title": "8 Rounds of Taxotere, Perjeta, Herceptin? Or not? rosetide rosetide"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Dec 26, 2014 10:45AM kwagart wrote: Scrappy, I know that somebody with more information will be along shorty, I just wanted to lend my support until then.  I did just speak with a woman at the infusion center who has had bone and liver mets for quite some time and is doing well.  As far as the forever chemo, I don't have that answer, it seems like hormone suppression may be your treatment at some point, but I am sure you will get a more informed response soon.  Hang in there! Kim",
      "MessageIndex": 1,
      "PostDate": "26/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827190",
      "Title": "Just diagnosed with Liver cancer Scrappygrl Scrappygrl"
    },
    {
      "AuthorID": "kwagart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203265/profile",
      "Content": "Dec 14, 2014 03:41PM kwagart wrote: steelrose Sending positive thoughts and prayers! Kim",
      "MessageIndex": 3,
      "PostDate": "14/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/826986",
      "Title": "Scan tomorrow... arghhhh! steelrose RonnieKay"
    }
  ]
}