{
  "AuthorID": "kwhitmo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113315/profile",
  "Posts": [
    {
      "AuthorID": "kwhitmo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113315/profile",
      "Content": "Nov 3, 2014 07:36PM kwhitmo wrote: Hi!  First time posting...  Have a question.  I have received 15/25 radiation treatments so far and I am having difficulty swallowing & pain in my throat.  Anyone else experiencing this?  Anything I can do to make it better?  This is my second battle - didn't have radiation the first time.  It was in my lymph nodes this time, so getting radiation of the breast, armpit & neck.  I'm so close to the finish line but worried about this!  Any suggestions or advice would be appreciated.  Thanks!",
      "MessageIndex": 807,
      "PostDate": "03/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "kwhitmo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113315/profile",
      "Content": "Dec 9, 2010 10:39PM kwhitmo wrote: Hello g! I have surgery questions... Found a lump this September.  Wasn't sure if I could do a lumpectomy or would need mastectomy.  Decided on lumpectomy and although he got all the cancer, the margins were too thin.  He took too much tissue the first time to try lumpectomy again, so now I need a mastectomy.  I'm trying to decide whether to do the double - both for medical and cosmetic reasons.  Any input on that would be great!  I finish chemo on the 29th of December so I am hoping for surgery in late January or early February and need to meet with both the surgeon and the plastic surgeon to discuss, however would love to hear from others about this.  I already had one biopsy on my \"good\" breast and can't bear the though of going through breast exams, mommograms and maybe even more biopsies every six months on the other side! Thoughts?  Suggestions?  Advice? I would also mention that I have 3 and 5 year old sons to care for, I realize the double is a longer recovery and hospital stay but my goal is to be done with cancer and do whatever I can now to never have to go through this again...   ",
      "MessageIndex": 22,
      "PostDate": "09/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/659169",
      "Title": "I've had both surgeries if you have questions nosurrender nora_az"
    },
    {
      "AuthorID": "kwhitmo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113315/profile",
      "Content": "Jan 25, 2011 08:15AM kwhitmo wrote: Hey everybody - I've been reading about all of you and taking notes, thanks so much to those of you that have completed surgery - it's been so helpful to hear your stories!  Tomorrow is my date - BMX with TE.  I am ready.  Told my 4 and 5 year old boys last night - they don't really get it but were excited that this is my last step and were really excited that Mom Mom is sleeping over tomorrow night!  Hardest part for me is 2 nights in the hospital away from them.  Also having to step back from everything I usually do.  I'm not very good at sitting still.  But I'll do it since I have to!  Anyway, I'll check back when I can after surgery.  Thanks again for all the advice!!  Kim",
      "MessageIndex": 319,
      "PostDate": "25/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "kwhitmo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113315/profile",
      "Content": "Dec 29, 2010 10:27PM kwhitmo wrote: Hi everyone!  I am scheduled for a BMX on January 26th.  Had my last chemo today!!  So happy to be done.  Am definitely nervous about the surgery but am really looking forward to it since it is the last step in this process.  I had a lumpectomy back in September but the margins were too close.  I am a mother of two boys ages 4 & 5.  I meet with the PS next week to finalize decisions and get some more answers.  Thanks for all the info - it really helps to know others are going through the same thing!! ",
      "MessageIndex": 55,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "kwhitmo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113315/profile",
      "Content": "Jan 28, 2011 05:59PM kwhitmo wrote: Hello all!  I had my surgery Wednesday (BMX w/ TE) and got home today about noon.  I have 4 drains and still have the pump in too.  Once the medicine is empty I can take that out - one less thing hanging out of my body!  I am very sore and it's really hard to get up & down from the bed.  Even with a mountain of pillows it's hard to get comfortable.  The unexpected foot of snow that we got didn\"t help things at the hospital -they were short staffed and it took a long time to get the help I needed. Anyway, I'm just really happy to be home in my own bed and I hope I can get some sleep tonight. ",
      "MessageIndex": 359,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    }
  ]
}