{
  "AuthorID": "L-O-R-I",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279298/profile",
  "Posts": [
    {
      "AuthorID": "L-O-R-I",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279298/profile",
      "Content": "Mar 3, 2019 10:52PM L-O-R-I wrote: Doctors are often wrong!  I had all the signs and symptoms of a Ductal Papilloma, including discharge, and I also had 3 of them removed in the past.  My family Dr. thought that maybe an antibiotic would do the trick but I wanted it removed.  She sent me for a Mammogram and an Ultrasound.  All looked fine.  I was sent for a Core Biopsy during Ultrasound, which came back as a Benign Ductal Papilloma.  I had it removed with no complications.  Over 3 weeks later my surgeon had his office set up an appointment for me to see him.  I assumed he wanted to see how I was healing so I went to my appointment alone.  He proceeded to explain to me that he had booked another surgery for me in the coming week because the Pathology report came back as described below and the margins were not clean.  3 weeks later? I said to him, \"Why are you telling me about this 3 weeks later?\" and then I pointed out that the Pathology Report was dated 2 days after my surgery.  I was in shock.  It made no sense to me.  That was the start of my journey!  Needless to say, I have lost all trust in doctors.  I had to chose to focus on the urgency of my condition and also decide the route that I would take to beat this disease.   Lori",
      "MessageIndex": 22,
      "PostDate": "03/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/870019",
      "Title": "Misdiagnosed sugarfoot75 L-O-R-I"
    },
    {
      "AuthorID": "L-O-R-I",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279298/profile",
      "Content": "Jan 16, 2019 10:14PM L-O-R-I wrote: Hi Justme, I too went from a general hospital (small town)to a cancer centre (in Toronto) for a second opinion. They seemed so much more organized and understanding. They also seemed leary of going with the information supplied by my first hospital. They redid the mammogram and the ultrasound and had their own people read them. It seemed that everyone worked together to achieve the same goal. You will probably notice a big difference at the Cancer Centre. You say that you don’t want any surprises but you will probably be pleasantly surprised at how well you will be treated and how they include you in everything, making sure you understand what is going on. Best to not dwell too much on the confusion and just look forward to your upcoming appointments. It will be like a new start!",
      "MessageIndex": 71,
      "PostDate": "16/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "L-O-R-I",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279298/profile",
      "Content": "Dec 15, 2018 01:14PM L-O-R-I wrote: Hi Calliope42, I'm from Canada too and know that there is a limit to the time off that you can take off without penalty.  I'm sure that you can go back to work before your surgery and if your job isn't strenuous, you probably won't have to take off much time after surgery either.  Depending on the treatment you decide on doing, you may need to use your sick time down the road.  You are probably off because you are upset and not because you aren't well enough to go to work.  I get every Thursday and Friday off so I booked my appointments on those days and also made sure my surgery/lumpectomy was on a Thursday so that I could be back to work on that Saturday, since my job doesn't entail lifting or strenuous labour.  Time does fly by, even though it is probably going in slow motion for you right now.  Best of luck in your journey!  I know being a single mom is hard enough, so I'm glad you came here for some support. Lori",
      "MessageIndex": 22,
      "PostDate": "15/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "L-O-R-I",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279298/profile",
      "Content": "Jan 17, 2019 09:32PM L-O-R-I wrote: Your lymph nodes’ job is to catch and kill disease. They are the most important part of your immune system. Kind of like filters that prevent spread of disease. Yes, hopefully nothing got past the lymph nodes. Just because you had positive nodes, it doesn’t mean that the cancer cells got past the nodes. There’s a lot that you can do to improve the immune system like exercise and heathy eating. It will really help emotionally too. You sound more relaxed compared to your earlier messages so congrats for that!! Good luck talking to your Dr. tomorrow! Lori",
      "MessageIndex": 77,
      "PostDate": "17/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "L-O-R-I",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279298/profile",
      "Content": "Jan 23, 2019 07:54PM L-O-R-I wrote: I’m glad you are in a better frame of mind now, justme! The less stress, the better!! I’m glad things are moving at the pace you are comfortable with as well, and that you were better informed about everything. Keep us updated. Lori",
      "MessageIndex": 85,
      "PostDate": "23/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "L-O-R-I",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279298/profile",
      "Content": "Dec 15, 2018 02:58PM L-O-R-I wrote: Hi Sadlynew2018, I have a thought for you.  Instead of Googling LVI (Lymph Vascular Invasion), look up ways you can improve your Lymphatic System.   There are a lot of things that you can do to improve your prognosis, along with the Doctors' recommendations that you choose to follow.  If your lymph system is healthy, your estrogen and progesterone will be better regulated, amongst several other benefits.  I find it distracting and even enjoyable to rise to the challenge of becoming healthier.  Why not feel better and look better while going through this journey! Lori",
      "MessageIndex": 5,
      "PostDate": "15/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868835",
      "Title": "LVI (Lymphovascular Invasion) Sadlynew2018 windingshores"
    }
  ]
}