{
  "AuthorID": "Labmomof2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261631/profile",
  "Posts": [
    {
      "AuthorID": "Labmomof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261631/profile",
      "Content": "Nov 13, 2017 08:40AM Labmomof2 wrote: I would follow up with your specialist, I can't really tell who that is. My surgeon is a surgical oncologist and she handles all my breast concerns. I wouldn't think your primary is the right choice, unless you were using him throughout the process. I was lucky this go round. Apparently, the fibroadenoma went away. I find it a little difficult to believe, but it is already gone. So I had no grounds to demand/request the MRI and definitely no surgery. There's nothing there. I did decide to start tamoxifen prophylactically. I need to adjust other meds first, but I should start it next week some time. I'm still not completely comfortable with it, but I'm tired of dealing with uncertainity. Good luck to both of oyu ladies.",
      "MessageIndex": 4,
      "PostDate": "13/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/859520",
      "Title": "Not sure how to proceed-new lumps after ADH Labmomof2 Emerald097"
    },
    {
      "AuthorID": "Labmomof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261631/profile",
      "Content": "Oct 23, 2017 02:05PM Labmomof2 wrote: Thanks for your response, Cat. I definitely follow up as needed. I've already had the biopsy, so short of misdiagnosis from the biopsy, everything is OK. I'm just debating the best way forward. I'm lucky with my surgeon and breast center, they are always available for questions and I have never felt rushed, even though I plan most appointments for late in the day so I can work most of the day. If you feel that your concerns aren't being listened to, I would find a new doctor. It could be that there was nothing to be concerned about, even if it was follow-up, or it might be that you aren't getting adequate attention. Only you can decide that. You have to make the best decisions for yourself, no one will care as much as you do! find a new doc or get a second opinion. I can say that I have gone in for concerns and they were quick to reassure me things were fine. It was almost difficult to hear because I've been trained to be so wary. What do you mean it's fine?! I have a change!! But things were fine. Good luck to you.",
      "MessageIndex": 2,
      "PostDate": "23/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/859520",
      "Title": "Not sure how to proceed-new lumps after ADH Labmomof2 Emerald097"
    },
    {
      "AuthorID": "Labmomof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261631/profile",
      "Content": "Labmomof2 wrote: Hi! At 35, I was diagnosed with ADH through an excisional biopsy. At the time, I was given the option of tamoxifen, or just monitoring. I chose to monitor every six months. I have endometriosis, and tamoxifen would mean discontinuing my only source of relief, birth control. Because of multiple risk factors, I sit at anywhere between 25-60% risk for developing bc (depending on which scale). Six months ago, at age 40, I had a vacuum-assisted biopsy (I think that's what it was-the needle was huge and it hurt!) The results indicated a small papilloma which was completely removed, and a fibrodenoma. My surgeon left the decision for surgery up to me, but she was comfortable watching it. She said the risk of the misdiagnosis of the fibrodenoma was very low, and they aren't a problem themselves. So, at the time, I elected for monitoring. I am due for my 6-month follow-up next week and I think I'm going to change my mind. On the mammo and US both, it appeared I had one lump. We didn't know it was two until the biopsy. I now have a benign biopsy marker on the fibrodenoma. I have extremely dense (the highest rating) and fibrocystic breasts. I've already had one papilloma with atypical hyperplasia. If manipulated, I still have very dark bloody discharge. (I don't squeeze it!) My concern is that if another pappilloma forms where the last one was, will it be distinct? Is there danger that my density and proximity to the benign lump potentially hide another papilloma? And it it progresses unknown, it could potentially become cancerous before we know. I was just clear for five years when this happened. I don't want to live in a near-constant state of concern. Should I just remove it, take the tamoxifen and be done with it? What would you do? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/859520",
      "Title": "Not sure how to proceed-new lumps after ADH Labmomof2 Emerald097"
    }
  ]
}