{
  "AuthorID": "Ladyhop",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210271/profile",
  "Posts": [
    {
      "AuthorID": "Ladyhop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210271/profile",
      "Content": "Mar 5, 2015 06:21PM Ladyhop wrote: Thank you Manu14 and ceanna. I ended up in the ER last night due to copious amounts of fluid that was pouring out of the residual lumpectomy incision site. They had to open it a little and irrigate it. It was all so scary. My biggest fear with using the Savi was infection and I wish they had put me on antibiotics from the beginning. I'm on them now. I had to skip radiation today and will see what my breast looks like tomorrow before resuming. This scared me so much that I was ready to abort the tx plan and just take tamoxifen and take my chances. My RO said he would take it out if I wanted, but it wouldn't be his first recommendation. My husband also wants me to continue with it. Thank you wonderful ladies for your responses. Sorry for the duplicate posts. Mary",
      "MessageIndex": 6,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/828912",
      "Title": "Has anyone had Brachytherapy? rainbowpearl ceanna"
    },
    {
      "AuthorID": "Ladyhop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210271/profile",
      "Content": "Mar 4, 2015 10:49PM Ladyhop wrote: I had my Savi implanted on Friday 2/27 and started my radiation treatment today 3/4. The gap between implantation and tx was due to the surgeon's schedule and the radiation schedule. I'm having an unusual amount of pain. Just started taking percocet so that I can sleep. I also realized that I need to take it for each treatment session because of the pain with handling of the catheter tubes when they are hooking it up to the rad machine. My rad onc thinks the pain is due to the angle that the Savi had to be placed. Most people don't have this much pain. After my first day of treatment (2x/day, 6 hours apart), my breast is red, swollen and warm to the touch. Has anyone else experienced this? I guess I was surprised how quickly this occurred. Any input is appreciated. I'm pretty anxious about my level of pain. Thanks Mary (This is my first post and I haven't figured out how to put information in my signature)",
      "MessageIndex": 3,
      "PostDate": "04/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/828912",
      "Title": "Has anyone had Brachytherapy? rainbowpearl ceanna"
    }
  ]
}