{
  "AuthorID": "ladyod",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98052/profile",
  "Posts": [{
    "AuthorID": "ladyod",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98052/profile",
    "Content": "Mar 28, 2010 11:29AM ladyod wrote: Carol:  My heart goes out to you!  At this time, you deserve to be taken care of and loved and made to feel safe.  I am sorry your husband is not there for you emotionally.  Personally, I think you should try to find someone you could stay with who can nurture you...your parents?  a best friend?  A sister? And if that is not possible, then go outside your marriage and find someone to talk with on a regular basis who will empathize with you...again a friend, a close relative, maybe even a counselor.  Unfortunately we can not change the behavior of those around us, but there is no reason you can't get yourself another support system!  I can not for a minute compare my journey to yours since I only have DCIS.  I will tell you though that even with DCIS, you worry about the worst case scenario.  When I was going through my tough time, my dh distanced himself and cut me off from all emotions which hurt me so much!  I went to a counselor and she explained that men do that in time of crisis:   we all either become thinkers or emotional:  he chose to become a thinker. (Which the majority of men do...then they cut off their emotions because they are consumed by the thinking part)  DH told me I should just get over it, it had been 6 weeks since my surgery.  He was very irritated that I was still trying to deal with my emotions.  The couselor pointed this out to him and now he has been working hard to do the little things we all need:  a kiss in the morning, holding my hand, being there not just financially, but emotionally.  Maybe your hubby is going  through the same thing.... only X 100..... I wish I could make it all better for you, but I know that what you need is that support system to get you through this tough time.  Your husband's actions are reprehensible and you are worth so much more than just financial support!  Do not feel that this is your fault:  he is the one acting poorly, not you!!!  Stay strong, my sister!  You are not alone!!!! Tammy",
    "MessageIndex": 3,
    "PostDate": "28/03/2010",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/750435",
    "Title": "Spouse that just doesn't care my3sonz cancersuks"
  }]
}