{
  "AuthorID": "ladybugmommy2010",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191165/profile",
  "Posts": [
    {
      "AuthorID": "ladybugmommy2010",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191165/profile",
      "Content": "ladybugmommy2010 wrote: Okay so here is my update. Today I went to the surgeon who my mom had already warned me about but I wanted a woman surgeon so I sucked it up and just went with her. She said she didn't feel any lumps which of course I know but I am in pain on one side of my body and sharp pains going through my left breast. She also said that it's hormonal changes maybe and it happens to 30 and 40 year olds, I am 25. I am going for the BRCA testing Thursday because of my family's high breast cancer history especially on my dad;s side. I am just really hurt,confused and worried. I truly dislike how young women my age are treated. It's like they feel like women under 40 can not have breast cancer. I do not want it but I want to know what's wrong. I am the type of person who hardly ever goes to the hospital or doctor and when I go I have to really think something is wrong. My sister goes to the hospital every week it seems and she has the most negative things to say. My only support system is my aunt because she knows how serious it. Thanks for listening. 29 years old with a 7 year old Family History: Paternal Great Grandmother, Paternal Great Aunt, Paternal Aunts. Sister, Maternal Aunt Surgery Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/814455",
      "Title": "I just don't know! ladybugmommy2010 ladybugmommy2010"
    },
    {
      "AuthorID": "ladybugmommy2010",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191165/profile",
      "Content": "ladybugmommy2010 wrote: I recently went in for a mammogram and ultrasound and they found a spot that the doctor believe is likely benign. My gyno wants me to come back in 6 months and referred me to a breast surgeon who I will see next month. Any one have experienced this? Did everything turn out to be okay? Thanks 29 years old with a 7 year old Family History: Paternal Great Grandmother, Paternal Great Aunt, Paternal Aunts. Sister, Maternal Aunt Surgery Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/828530",
      "Title": "Question about ultrasound and mammogram ladybugmommy2010 ladybugmommy2010"
    },
    {
      "AuthorID": "ladybugmommy2010",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191165/profile",
      "Content": "ladybugmommy2010 wrote: I had a biopsy last Thursday on a abnormal lymph node that turned out to be benign. My sister who was diagnosed with breast cancer at 26 feels that I should have the lymph node remove based on my family history. What would you do? Thank you! 29 years old with a 7 year old Family History: Paternal Great Grandmother, Paternal Great Aunt, Paternal Aunts. Sister, Maternal Aunt Surgery Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/829942",
      "Title": "Question about lymph node ladybugmommy2010 ladybugmommy2010"
    },
    {
      "AuthorID": "ladybugmommy2010",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191165/profile",
      "Content": "ladybugmommy2010 wrote: Hello I am having breast pain and I had the ultrasound and the mammogram done and there was no lump but my gyno suggested that I go to a surgeon based on my family history. What I want to know is if there is no lump would I still need a biopsy because of the breast pain on one side which is the left? I am just nervous about them. Thanks/ Would love to hear from those who did not have a lump but experienced breast pain. 29 years old with a 7 year old Family History: Paternal Great Grandmother, Paternal Great Aunt, Paternal Aunts. Sister, Maternal Aunt Surgery Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/813957",
      "Title": "Question about receiving a biopsy ladybugmommy2010 Priyanka23"
    },
    {
      "AuthorID": "ladybugmommy2010",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191165/profile",
      "Content": "ladybugmommy2010 wrote: I'm just a bit worried. Back information I had a breast reduction May 31st. So about 3 weeks ago I'm sitting down folding clothes and felt something leaking. Looked down and it was my nipple,clear discharge. So I'm like okay maybe it's from surgery or something. Well last week I squeezed and it was like a milky discharge. I let my gyno know about it and she wants to check it out. Any experience with anything like this? Thank you! 29 years old with a 7 year old Family History: Paternal Great Grandmother, Paternal Great Aunt, Paternal Aunts. Sister, Maternal Aunt Surgery Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858018",
      "Title": "Nipple leakage ladybugmommy2010 ladybugmommy2010"
    }
  ]
}