{
  "AuthorID": "ladyvulcan",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177498/profile",
  "Posts": [
    {
      "AuthorID": "ladyvulcan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177498/profile",
      "Content": "ladyvulcan wrote: Hi, so I am a 14 year old female and a few months or so ago, I noticed some sort of rash around the nipple on my right breast. It was dry and flakey and had a little ridgey thing around it. The ridgey isn't really prominent anymore, but it is still dry and flakey. Like, if I'm wearing a dark colored bra and I take it off, there will be little flakes on it. A few weeks later I noticed that around my left nipple is also dry and flakey now. There is no pain they just both itch really bad sometimes. Also, there is a small bruise above my left nipple at the moment. I have no idea what this might be but I am really frightened. Could it just be a skin rash or something worse? I want to tell my mom about it but I don't really know how to. She knows I have really bad anxiety and I worry easily so she might just tell me its dry skin and not to worry about it but I am really worried about this. I know it's this type of cancer is rare and it's uncommon to get breast cancer at my age and also uncommon to have it in both breasts but rare doesn't mean it never happens. I have been reading a lot about inflammatory breast cancer lately and it's made me really scared. If it helps, I usually sleep with a bra on at night and sometimes if I can't find a clean bra and I'm in a hurry I'll just wear the same one I wore the day before. I do track and I sweat a lot so could it just be a heat rash or something? My breasts are also rather large considering my age.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803967",
      "Title": "Worried about inflammatory breast cancer ladyvulcan jushavinfun"
    },
    {
      "AuthorID": "ladyvulcan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177498/profile",
      "Content": "Apr 28, 2013 07:18PM ladyvulcan wrote: I know I shouldn't be reading about it because I am such a hypochondriac but I get worried. I do have cortisone cream so I think I will try that to see what happens. Thanks!",
      "MessageIndex": 2,
      "PostDate": "28/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803967",
      "Title": "Worried about inflammatory breast cancer ladyvulcan jushavinfun"
    }
  ]
}