{
  "AuthorID": "Ladyredlock…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72246/profile",
  "Posts": [
    {
      "AuthorID": "Ladyredlock…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72246/profile",
      "Content": "Mar 29, 2012 09:57AM Ladyredlocks wrote: You can find the Yoga For Cancer series (for each: Breast Cancer Survivors, Cancer Survivors and Heart Disease) on You Tube ... they break the DVDs up into one vid per pose ... I have saved all the poses that work for me into a playlist that I do every other day...  There is some overlap of poses from one DVD to another.",
      "MessageIndex": 17,
      "PostDate": "29/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/784108",
      "Title": "Yoga for BC Survivors garnet131 garnet131"
    },
    {
      "AuthorID": "Ladyredlock…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72246/profile",
      "Content": "Mar 3, 2011 11:03PM Ladyredlocks wrote: Well I've been out of the closet on this one for 18 months now ... so if I can add my 2 cents... I made a choice then to go off all the pharmaceuticals and one by one I replaced 6 drugs with Cannabis and that is all I still use today to manage all my post bc pains ... I am a legal cardholder in Oregon.  And now, since my last writing months ago, I am a caregiver for patients with conditions ranging from Cancer, MS, Chrons, Degenerative Arthritis, and Kidney Disease.  I am also an active advocate for medical use in my state.  Absolutely do no smoke it ... it has more carcinogenic chemicals in smoked form than cigarettes.   Research in 2007 showed that one smoked joint has the same impact on the lungs that 5 smoked cigarettes have.  And because cannabis has a lower combustibility than tobacco, it contains 50% more carcinogenic polycyclic aromatic hydrocarbons including naphthalene, benzanthracene, and benzopyrene, than tobacco smoke.  So don't light that joint! There are other, more effective, alternatives: I use salve (I make) for everything that hurts topically - like the deep armpit pain I get after vacuuming the house, or the spasms I get in my foobs.  It lasts 3 -4 hours depending on if it is a nerve, spasm or ache.  There is absolutely no psychotropic effect to a topical application.  This method doesn't touch my deep pain (I have a hot nerve) - I need something internal for that ... For internal use I make a tincture out of either Agave or alcohol and cannabis ... I take a few ml, depending on pain level, and that lasts 4 - 6 hours.  I also have a friend that makes infused hard candy - one candy will also last me 4-6 hours too.  Again, I experience no psychotropic effects with tincture.  Inside my body both tincture and a candy feel like a Darvocet or Percocet - not as strong as a Vicodin, but easliy on par with a Darvocet. I also make a capsule with activated cannabis in it and take that in the morning or night for stronger pain relief (these are for 5+ pain level days).  Capsules can be really strong (too strong a dosage can land you in ER with heart problems so caution is best used with caps).  I feel no psychotropic effect with a capsule either.   I also make infused butter and oils for cooking - this too lasts in me 4-6 hours depending on pain level and what else is in my tummy.  I can get a good nights sleep from a brownie but I don't really feel any psychotropic effects. Finally, I invested in a Volcano last year and I love it.  It does not combust the cannabis so there are no carcinogens in the vapors - this is the fastest way to pain relief, but it only lasts for an hour or two for me.  This is an ok solution for the end of the day when I don't need to do anything else because to really manage my pain (and at this point in the day if I haven't managed it with the above methods I am \"chasing\" the pain - never a winning battle for me).  This method definately has the psychotorpic side effect and I can get really \"stoned\" when vaporizing so it isn't a good solution when I need to be on my game (like keeping up with the 3 year old granddaughter). Finally, we treat it just like Vicodin in our house.  It is under lock and key, like all the other prescriptions. I think it is a drug just like the other painkillers that were prescribed and it needs to be treated with the same respect as any other pain killer.  It is one more tool in our tool belt to enable us to live our fullest life, after cancer. Oh and one comment on the finances of cannabis.  Every states laws are different, but in my state I can have a licenced organic grower and he grows my cannabis for me - for FREE!!!  I have not paid for a prescription in over 18 months ... I have bottles of unused Vicodin, Percocet, Darvocet, Oxycodone, Celebrex, Ambien, and Phenegrin still in the lock box...  my 2 cents for what its worth. P.s if anyone wants my recipes just ping me ... everything I have learned in the last couple years related to cannabis (and I have just learned all this in 2 years - so I am a newbie in the mmj community) I share freely - I just ask you pass it on to someone else in need and pay it forward. ",
      "MessageIndex": 68,
      "PostDate": "03/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764103",
      "Title": "Pot ~ weed ~ and other cures. :) lisa34lisa radiant"
    },
    {
      "AuthorID": "Ladyredlock…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72246/profile",
      "Content": "May 13, 2013 05:38PM Ladyredlocks wrote: Well count me in this group too ... Just learned (from xray) I have a clip left attached to my right axilla (of course I am rt handed) after my bilateral in 2008. Been complaining of excruciating pain there for 5 years (now I have nerve damage all the way down through middle finger on right hand) and I have been wondering why the surgeons \"circle the wagons\" every time it comes up for discussion in check ups . Now I know. Maybe we should start a new subgroup: the \"Clip Sisters\" since there seem to be quite a few of us who end up with unintended and undesirable remnants of surgery left in our bodies that cause us long term pain and limitation in our life after cancer... Just sayn! As for me .. Gonna explore other options. I don t trust doctors who I feel have not been completely honest with me both in causes of my pmps and in denying pmps for 5 years. Nope... Fool me (for 5 years) shame on you. Fool me again... shame on Me! Frankly at this point I'm trusting the Brazillian Shaman and his ayahuasca more than my two doctors who have been \"crazy making\" me about this pain for so long.",
      "MessageIndex": 41,
      "PostDate": "13/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/747590",
      "Title": "20 plus surgical clips left..does anyone have this? smart23 MariH"
    }
  ]
}