{
  "AuthorID": "Lady_Madonn…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
  "Posts": [
    {
      "AuthorID": "Lady_Madonn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
      "Content": "Oct 22, 2010 01:18PM Lady_Madonna wrote: Amy, thanks for passing along our message- we are NOT marketing material!!!  What a fantastic opportunity.  Hope they get it! ",
      "MessageIndex": 72,
      "PostDate": "22/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/759281",
      "Title": "My pink problem Melinda41 daffodil45"
    },
    {
      "AuthorID": "Lady_Madonn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
      "Content": "Dec 19, 2010 12:37PM Lady_Madonna wrote: My dear sister Tonya, it's such a blow to the heart to lose you.  You fought so hard and you wanted to stay here so badly.  I pray you are at peace with your Heavenly Father and that your children will feel the warmth of your love as you watch over them.  Thanks for your friendship.  With love, Melanie Thanks Jenn for the update.  I'm so sad for her kids.  It's just not fair.  The only thing to be thankful for is that Tonya finally has peace.  ",
      "MessageIndex": 42,
      "PostDate": "19/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762218",
      "Title": "Tonya (Nine_Rugrats) is an Angel JeninMichigan kittycat"
    },
    {
      "AuthorID": "Lady_Madonn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
      "Content": "Oct 4, 2010 08:51PM Lady_Madonna wrote: Jen, Please tell Tonya I'm praying for her and her children.  I'm sorry she's in so much pain and I wish I had more answers for her.  Those darn shots caused me so much misery also.  My onc always told me Claritin would help, although I always forgot to try it.  Please, please send Tonya my love.  Thanks for being such a great friend.   ~Melanie",
      "MessageIndex": 3,
      "PostDate": "04/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758920",
      "Title": "Question from Tonya - Nine_rugrats on Pain meds JeninMichigan vickib"
    },
    {
      "AuthorID": "Lady_Madonn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
      "Content": "Jun 2, 2010 09:24AM Lady_Madonna wrote:",
      "MessageIndex": 26,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753428",
      "Title": "Six and a Half Year Cancerversary... RobinWendy Anne45"
    },
    {
      "AuthorID": "Lady_Madonn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
      "Content": "Sep 24, 2010 03:33PM Lady_Madonna wrote: Hi there, I had nausea and dizziness during my rads treatment.  Rads onc denied it had anything to do with rads, my onc just laughed and said many, many patients experience it during rads.  My August rads group had several women with this experience- we can't all be crazy! So don't worry, and it did pass after a few days. All the best to you!",
      "MessageIndex": 12,
      "PostDate": "24/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/679444",
      "Title": "Radiation causing nausea and dizziness marymary897 Motherofall6"
    },
    {
      "AuthorID": "Lady_Madonn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
      "Content": "Oct 15, 2010 11:59AM Lady_Madonna wrote: Can I just add how much I hate this disease?!  The good news for all of us Her2+ gals is the Herceptin, so just keep fighting like hell!!  I can't imagine being in your shoes, but you have a great attitude... go get 'em!!! Oh, and the Young Survival Coalition is the group the previous poster was referring to, youngsurvival.org Lots of love, Melanie",
      "MessageIndex": 11,
      "PostDate": "15/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759304",
      "Title": "ANYONE ELSE IN THEIR 20'S? texasrose361 EnglishMajor"
    },
    {
      "AuthorID": "Lady_Madonn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
      "Content": "Dec 10, 2010 05:11AM Lady_Madonna wrote: ChocolateLover- Wife, sister, daugher, friend...I didn't know you but I did... we are sisters but we never met.  I share your love of all fine things.  I'm grieving your loss.  Sometimes it all feels like too much.  I'm so sorry...rest in peace sweet sister. ",
      "MessageIndex": 26,
      "PostDate": "10/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760430",
      "Title": "MMN ChocolateLover"
    },
    {
      "AuthorID": "Lady_Madonn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
      "Content": "Aug 14, 2010 09:33AM - edited Aug 14, 2010 09:36AM by Lady_Madonna *edited to add \"in the supine position\" I consulted with two rads oncs, the second (who I am currently receiving treatment from) has 21 years of experience and was chief resident at Memorial Sloan Kettering... Both doctors told me the prone position was most advantageous for women with large breasts because in this position the heart drops forward, toward the area being radiated.  While you're lying on your back, the heart drop toward your back, away from the area being radiated.   I am doing IMRT rads on the left side, in the supine position.",
      "MessageIndex": 18,
      "PostDate": "14/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/720735",
      "Title": "Radiation treatment in a prone (face-down) position... otter whatsnext17"
    },
    {
      "AuthorID": "Lady_Madonn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
      "Content": "Sep 21, 2010 12:32AM Lady_Madonna wrote: Nana, There really are no words... Just hoping you will be filled with peace and love. And one day may we all meet again...whole, healthy, and pain free. Love, Melanie",
      "MessageIndex": 14,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758297",
      "Title": "How do you say goodbye? Nanalinda konakat"
    },
    {
      "AuthorID": "Lady_Madonn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
      "Content": "Dec 3, 2010 08:34PM Lady_Madonna wrote: Hope you don't mind me jumping into this forum, but I wanted to wish you a very happy birthday!  I think it's perfectly normal to have mixed emotions right now- look at all you've been through.  It's very difficult for others to understand, they don't even realize what crosses our mind as they're complaining about getting older.   Here's hoping you have a day filled with love and happiness.  Happy Birthday... and many, many more!!! (((Hugs!)))",
      "MessageIndex": 7,
      "PostDate": "03/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761492",
      "Title": "It is my 30th b'day tomorrow HopeToMakeIt HopeToMakeIt"
    },
    {
      "AuthorID": "Lady_Madonn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
      "Content": "Aug 14, 2010 02:34PM Lady_Madonna wrote: Omaz, it looks like your citation supports what I was told by the rads oncs I consulted... that unless you have large, pendulous breasts the prone position causes more harm than good because of the heart falling forward into the field of radiation in the prone position.",
      "MessageIndex": 20,
      "PostDate": "14/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/720735",
      "Title": "Radiation treatment in a prone (face-down) position... otter whatsnext17"
    },
    {
      "AuthorID": "Lady_Madonn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
      "Content": "Nov 13, 2010 01:59PM - edited Aug 20, 2013 06:10AM by Lady_Madonna Kellie, I know EXACTLY how you feel!!  That's what's great about being here... we can all relate.  I just recently decided that the stress of worrying about all this would probaby cause me more harm than the thing I was worrying about itself!  So I pick and choose what works in my new lifestyle.  There are many, many products I've given up and exchanged.  But after trying every single deodorant I could get my hands on I found that I could not live feeling wet and clammy every day of my life- I was miserable.  So back to my regular deodorant for me.  I won't use lip balm that isn't 100% natural and organic but I won't give up my regular (mac!) eyeshadow.  I figure a lot of lip balm gets into your mouth whereas the shadow just sits on top of your skin.  You really just have to make decisions for yourself and then be at peace.  You can't stop living or worse, drive yourself mad with micro-managing!!  Because you will go crazy (as you're noticing!!)  Think about how many women are walking around on this planet smoking, loaded up with tons of makeup and hair products, without a care in the world... and they won't get breast cancer.  There's a certain element of randomness and genetics that can't be denied.  It's not our fault.   I hope you have lots more good days and you find many wonderful friends here at bco.  Enjoy your little girl- what a blessing!  (I'm on the ladies in their 30's board and quite a few wanted to have kids and didn't get a chance before the damn cancer interrupted their lives.)   ((((Hugs)))) for you!!",
      "MessageIndex": 7,
      "PostDate": "13/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/760647",
      "Title": "Parabens and Phthalates Free Products Arayasunshine69 Shanagirl"
    },
    {
      "AuthorID": "Lady_Madonn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
      "Content": "Jun 18, 2010 04:38AM Lady_Madonna wrote: Hi Clare, I just clicked on your profile to read through all your previous posts so I know where you're coming from.   I'm surprised you ended up with a lumpectomy rather than a fine needle aspiration (FNA) or even a needle or core biopsy in the first place; these tests could have determined if your lumps were cancerous without disfiguring your breast  (particularly a FNA, mine took about 5 minutes in the Dr's office with no anesthetic needed and I had the results within 24 hours) In any event, I would recommend getting a job so you have your own insurance and can make your own health care decisions.  HIPPA is very serious about patient privacy; once you have your own insurance no one but you will have access to any of your health information or decisions.  All the ladies here are kind hearted and helpful- you will be surprised at how differently you look at life 20 years from now.  Enjoy being young, try not to worry and believe that your mom really does have your best interests at heart!",
      "MessageIndex": 18,
      "PostDate": "18/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/753724",
      "Title": "Mother won't allow a biopsy. ClareatRisk CoolBreeze"
    },
    {
      "AuthorID": "Lady_Madonn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102258/profile",
      "Content": "Aug 14, 2010 01:26AM Lady_Madonna wrote: I'm so sorry.  Beth and her family will be in my prayers, as will you.  ~Melanie",
      "MessageIndex": 2,
      "PostDate": "14/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756727",
      "Title": "Please pray for Beth (BMDALEY) WingsofHope littletower"
    }
  ]
}