{
  "AuthorID": "ladysingsth…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108120/profile",
  "Posts": [
    {
      "AuthorID": "ladysingsth…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108120/profile",
      "Content": "Sep 2, 2010 09:31AM ladysingstheblues wrote: hello thanks for the kind words, yes it is like so many of us. for me it is good to communicate with people who are actually living with this diagnosis.  i am sorry that all of us have to go through with it. i think it is challenging and relentless and all we can do is do the best we can.  i really think it is great for women to empower themselves and ask as many questions to their doctors and be as informed as we can. like someone said stage 1 does not necessarily mean cured as is implied in some statistics. when i was diagnosed and was in the onkology waiting room from week to week i looked around at all the women, we all looked anxious and i shared their grief and fear silently, we are all in the same boat that is living with the diagniosis of cancer and sadly there are some of us at more advanced stages and this reminds me that i cannot be idle with this disease.  seeyla888 are you also doing tamaxofine? still would like to hear if any of you did 4TCH instead of 6. tomorrow i go and have my  port out.  look forward to having that reminder out of my sight. ",
      "MessageIndex": 3486,
      "PostDate": "02/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "ladysingsth…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108120/profile",
      "Content": "Aug 31, 2010 02:42AM - edited Aug 31, 2010 08:32AM by ladysingstheblues Hello everyone I am stage 1 and just finished 4 cycles of TCH. I was supposed to do six but my onkologist advised me to stop at 4 due to the fact that i was having a hard time on it and that the last 2 would carry too much toxicity for little benefit. Any one of you out there had the same experience. I will continue with herceptin for the next year.  i had a double mastectomy as i had DCIS in my right breast and DCIS plus an invasive component in the left breast.  would love to hear if any of you had similar circumstance and how you feel.",
      "MessageIndex": 3457,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}