{
  "AuthorID": "lahri",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241619/profile",
  "Posts": [{
    "AuthorID": "lahri",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241619/profile",
    "Content": "lahri wrote: Let me start with some back story. Breast cancer does run in my family, to an extent. It hasn't, thankfully, affected much of my family recently. On my dad's side, my grandmother had breast cancer. My great aunt had breast cancer. There are some other family members that are second-degree relatives that also had breast cancer. Additionally, my aunts both get very small masses from time to time that disappear on their own. They also have quite large breasts, but they continuously get them checked. They've never had breast cancer. As for my mother's side, my great grandmother had breast cancer, my great aunt had ovarian cancer, and some other third-degree relatives had breast cancer. In August 2009, I felt a lump in my breast one morning. I was 14. Later that month, I went in for a consultation, shortly thereafter an ultrasound, and a biopsy in December of that year. I was told that I had a fibroadenoma; it was located in the upper area of my right breast. I am also an A cup, so I really don't have much there. Over time, the fibroadenoma grew. A lot. It started out about 2 cm x 2 cm or so, which isn't that big. As it grew, I eventually could not do any sports or activities that required much movement on my arm. I would pull the fibroadenoma every time I moved much, which began hurting immensely. By the time I had my lumpectomy in August 2011, exactly two years after discovering the lump, the fibroadenoma grew to 7.5 cm x 7.5. When I would lie down, you could very easily see it bulging out of my skin. When my surgeon came in to mark the area in pen for removal, she tried lightheartedly joking about how she didn't even need to feel to find it. Flash forward a bit. In December of 2015, I found another lump. It was on the underside of the same breast. On average, I would say it's kept about the 2.5 cm x 2.5 cm size overall. I checked in with my primary care physician and set up an ultrasound for April. Like last time, I had also had an ultrasound-guided core biopsy in early May. (They have ultimately avoided mammograms because the ultrasounds shows everything clearly. I also had a localizing clip placed this past time, so they can easily find it.) This time, I was told that I had a surprising--not in a good way--number of blood vessels going to the mass. I learned shortly after that it was another fibroadenoma. Despite the surgical glue (I have no idea what the appropriate term is) being nicely placed over the incision mark, as well as proper maintenance of the incision afterward, I bled quite heavily from this biopsy: both internally and externally. I had dark red blotches across the lower side of my breast for about a month and a half before it completely went away. Both of my Bi-rads assessments have been a 4. I'm not sure what my previous fibroadenoma was, but my surgeon mentioned several times that it seemed suspicious, both before and after my lumpectomy. I'm going in for my six month \"check up\" ultrasound tomorrow. I'm going to talk to one of the nurses there in depth, if I can, but I've already made up my mind after months of thinking: I want to have a mastectomy on my right breast. Over the course of the last 11 months, the fibroadenoma has moved and changed shape and grown a lot. It certainly fluctuates with my hormones, but it changes all the time regardless. It hurts almost more often than not now. As I said before, I have very small breasts. Having a 7.5 cm x 7.5 cm mass already removed from it, my right breast is even smaller. If I leave the fibroadenoma in, I run the risk of having the same thing happen as last time. If I have another lumpectomy, I'm not going to have much breast left anyway, and what is left will look really awkward. My doctor also noted that breast masses may just be something I have to deal with again in the future. Ever since I was 14, I would heard from doctors about how I was so young to have this happen and to go through this. My nurse this past time said that as well, without knowing my history, which started 7 years ago. After my biopsy, the nurse asked if I had a plan for what to do after learning about my past lumpectomy. I felt judged when I told her that I was thinking about having a mastectomy, like it was too extreme. For the most part, if I wanted to breastfeed with my right breast, it would be very difficult due to the ducts that were interrupted with my past lumpectomy. I'm also already missing a lot of feeling in that area. So, long story short: I am looking for support that mastectomy isn't such a foreign idea for \"just\" a fibroadenoma. I'm also wondering if anyone has any guidance they can provide in terms of insurance and receiving the approval stamp of a \"medically necessary\" procedure. My insurance has said they will cover it under professional services if it is deemed medically necessary, but they have not given many guidelines for that aside from testing positive for the gene testing or personally having breast cancer. I am willing to fork out the money to get this done, but my $3,000 out of pocket maximum after my deductible is far more optimal than having to pay purely out of pocket. I would feel less comfortable forking out $3,000 for a lumpectomy. This is a lengthy post, and I apologize for that. I just recently came across this community, and I am looking for support that is difficult to find around me in person. Thank you. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "28/10/2016",
    "ThreadURL": "https://community.breastcancer.org/forum/148/topics/849383",
    "Title": "Mastectomy for fibroadenoma? lahri applewhite"
  }]
}