{
  "AuthorID": "LAinNJ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80665/profile",
  "Posts": [
    {
      "AuthorID": "LAinNJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80665/profile",
      "Content": "LAinNJ wrote: I am 40 and a year ago was diagnosed with level 2 malignant melanoma. Derma recommended a surgeon at NYU to do 1cm wide excision. Surgery was performed 02/08 and path report came back clean. Followed up with surgeon at 6 mo. and last Thursday 3/5, which was roughly a year post surgery. About a week and a half prior to my appt. I found a lump in my right breast during SBE. Knowing I would be seeing surgeon and that he routinely performed a breast exam at each visit, I waited until I saw him. Aside from melanoma his other area of specialty is breast cancer. Sure enough during exam he detected the lump, before I even mentioned it.  Now, aside from the breast exam he performed on me at our first meeting in January of 2008 and at my 6 mo. follow-up in August of 2008, I also had a breast exam done during my annual gyn appt in March of 2008 and had a routine mammo in October of 2008. I do not routinely perform SBE but do occasionally and had never detected the lump before. So, I sit down with my doctor and he recommended that I have an ultrasound done at the radiology group that he regularly uses, have them review my previous mammo films and possibly have a repeat mammo. That appointment was today.  Mammo was negative and ultrasound was inconclusive. Doctor performing US kept saying it was very vague and even attempted to get a better look at it with a different machine. She recommended that I speak with my doctor and have him do a biopsy as she could not do a biopsy because she could not see it clearly. My doctor actually called me while I was en route home from radiologist's and recommended that I come in and have him examine me again. Was concerned about attempting a biopsy and recommended that we remove the lump to be certain. Suggested I come in on Thursday for exam and we could do the surgery on Friday.  My concern is not with that course of action. A family friend who has gone through BC recommended to me that I only go with a doctor that only does breast surgery. While I am confident that my doctor is capable and experienced, I kind of see where she is going. Here is a brief description of my doctor's qualifications: Professor of Surgery and Oncology of the New York University School of Medicine, Senior Attending Surgeon at Tisch Hospital of the New York University Medical Center, and Director of Surgical Oncology. is the author or co-author of over 200 published manuscripts, abstracts, and chapters, and three books including \"Cutaneous Malignant Melanoma\" (W.B. Saunders) and \"Breast Cancer\" (Elsevier/Churchill Livingstone), now in its 2nd Edition. His research interests are the surgical and systemic treatment of cancer and the surgical treatment of thyroid and parathyroid disease. He is Director of the Breast Cancer Discovery Fund and the Cancer Surgery Research Fund at the NYU School of Medicine Pretty impressive. Unfortunately, he does not participate in my insurance plan. And while I can speak with him about my financial concerns and I'm sure come to some sort of balance, my possible options of surgeons who would be IN my insurance plan aren't too shabby either and include the Chief, Breast Service, Department of Surgery; Anne Burnett Windfohr Chair of Clinical Oncology at Memorial Sloan-Kettering and another breast surgeon at Columbia-Presbyterian who is the surgeon my friend sees. Looking for any thoughts on whether or not a surgeon who only specializes in breast surgery is the way to go. My plan in the short term is to speak with my current doctor tomorrow and still plan to see him on Thursday for exam, talk to him about my insurance concerns, but indicate that I am not ready to proceed with the surgery on Friday. In the meantime I will explore these other two options at Sloan-Kettering and Columbia-Presbyterian and see if I can get appointments with either right away. Don't want to prolong, but want to explore my options, particularly if this turns out to be cancer and further costly surgeries would be required. Certainly would want that to be fully covered by insurance. Would appreciate any info, thoughts and advice. My best to everyone on this journey.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/730511",
      "Title": "Choosing a doctor and course of action LAinNJ LAinNJ"
    },
    {
      "AuthorID": "LAinNJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80665/profile",
      "Content": "Mar 12, 2009 09:16PM LAinNJ wrote: Thank you for your insight. Did see my current doctor today and after examination, he sent me to have a biopsy done. 3 aspirations were done and results were benign. Thank God. Doctor still wants me to have the lump removed, he said there was a proliferation of cells. I didn't quite understand what that meant and asked for further clarification, but still didn't quite get it even after he briefly explained. I completely agree that I should have it removed. No rush at this point and currently have it scheduled with him for 4/3. In the meantime, have an appointment with doctor at NY Presbyterian-Columbia on 3/23 (in my insurance plan) for second opinion. I also plan to work with my insurance co. and current doctor to figure out what all charges are expected to be and what will be covered. Will help me to know what type of financial situation I'm dealing with and if all else is equal, which opton to choose with respect to doctor.  Again, thank you for your responses and best of luck to you both.",
      "MessageIndex": 3,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/730511",
      "Title": "Choosing a doctor and course of action LAinNJ LAinNJ"
    }
  ]
}