{
  "AuthorID": "lakegenevag…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196357/profile",
  "Posts": [
    {
      "AuthorID": "lakegenevag…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196357/profile",
      "Content": "May 3, 2014 07:16AM lakegenevagirl wrote: I am a woman in my twenties (so my cells divide quickly) and didn't begin treatment (in my case chemo), until 6 weeks after my biopsy as I did egg preservation first.  It's been six months since then and I am now done with treatment...almost 1 month cancer-free (a phrase that I obviously use with great caution, but also great optimism). So, that choice seems to have been okay. That said, don't be afraid to push your doctors.  If you feel you've been waiting too long, get on the phone and don't be shy about asking for the treatment you feel you need on a timeline you are comfortable with.  You are your own greatest advocate.",
      "MessageIndex": 4,
      "PostDate": "03/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820475",
      "Title": "How long did you wait for surgery after biopsy? rosemary_39 lakegenevagirl"
    },
    {
      "AuthorID": "lakegenevag…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196357/profile",
      "Content": "May 3, 2014 01:05AM lakegenevagirl wrote: I felt my tumor get larger at the very beginning, but like other women have mentioned, I felt it was likely due to cyclical changes.  I did neo-adjuvant chemo therapy so I also felt the mass (which was initially 3 cm), get smaller throughout chemo.  In fact, by the time I had my mastectomy (after five rounds of chemo), the mass had shrunk 100%.  I had no invasive cancer, just DCIS. Prior to chemo, I did egg preservation and was put on a Letrozole.  That drug also had an effect on my tumor and I felt it get smaller during the weeks I was on it. ",
      "MessageIndex": 8,
      "PostDate": "03/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820373",
      "Title": "Anyone felt the lump getting bigger? rosemary_39 lakegenevagirl"
    }
  ]
}