{
  "AuthorID": "lala1608",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258522/profile",
  "Posts": [
    {
      "AuthorID": "lala1608",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258522/profile",
      "Content": "Sep 6, 2017 03:29AM lala1608 wrote: How is everyone doing? I tried to stay off the internet during the long weekend, was making myself crazy. Has anyone gotten results? Mel1969, did you have surgery?",
      "MessageIndex": 5,
      "PostDate": "06/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858204",
      "Title": "Trying to stay calm lala1608 lala1608"
    },
    {
      "AuthorID": "lala1608",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258522/profile",
      "Content": "lala1608 wrote: I will keep this as short as I can...I'm 37 years old, when I was 34 I had an ultrasound due to pain in my left breast. They identified a small mass that was not a cyst so I had a biopsy. Results were negative, yay! I got a mammogram and ultrasound 6 months later and everything looked good. I started to get pain in the same area late last year and went in this March to have it checked out. The mass looks fine but they noted that I had a cluster of microcalcifications in another area (closer to the nipple). I was advised to come back in 6 months for a re-check. I just had my re-check and the number of microcalcifications in the cluster has increased and there is now a second cluster. I am scheduled for biopsies of both areas on 9/11. I am trying to stay calm, I did not know much about microcalcifications before this. In fact, when the radiologist mentioned them during my mammogram 6 months ago I was like, whatever, what's going on with the fibroadenoma? My main concern now is that I have multiple clusters of microcalcifications and they seem to be appearing pretty quickly. Has anyone been in this same boat? I can't believe I have to wait over two weeks before my biopsies, and I'm leaving for Vegas two days after that...horrible timing. My breasts are category 3 - heterogeneously dense BIRADS was 4 on the report Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858204",
      "Title": "Trying to stay calm lala1608 lala1608"
    },
    {
      "AuthorID": "lala1608",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258522/profile",
      "Content": "Sep 18, 2017 02:03AM lala1608 wrote: Hi Tpralph, No I haven't had an MRI, but I'm wondering if I should considering that my breasts are very dense so the mammogram wouldn't even see a mass if it was there. I'm starting to doubt that these people know what they're doing, but that's hard to believe considering I go to a comprehensive breast center. I'm trying to have some questions ready for tomorrow so that I can get answers. I will definitively ask about an MRI, thanks",
      "MessageIndex": 12,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858204",
      "Title": "Trying to stay calm lala1608 lala1608"
    },
    {
      "AuthorID": "lala1608",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258522/profile",
      "Content": "Sep 26, 2017 01:09AM lala1608 wrote: Me again! Sooo I have an appointment to see a Breast Surgeon/oncologist on October 9th. My sister is a doctor so I had her go find me the best :) The doctor is about 2 1/2 hours away so won't be too far to travel. They did ask if I've ever had an MRI (I haven't) so I think that might be in the plan for the appointment. The doctor at the Breast Center where I had the failed biopsies was very apologetic, she said it was the most frustrating case she's had. They are sending my reports to the new place and I will bring my films there when I go. So more waiting for me!! At least my breast is pretty much healed up, except for the hematomas. I'm wondering if any of you have gotten news on biopsies and/or surgeries?",
      "MessageIndex": 13,
      "PostDate": "26/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858204",
      "Title": "Trying to stay calm lala1608 lala1608"
    },
    {
      "AuthorID": "lala1608",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258522/profile",
      "Content": "Oct 10, 2017 11:43PM lala1608 wrote: me AGAIN...I finally saw my new doctor yesterday, I will have an excisional biopsy of the most suspicious area and she sent my films to radiology for an opinion on whether to excise the second area or wait to see if it gets larger. This has been the biggest waiting game of my life but I think I see the light at the end of the tunnel, not sure whether I'll like what's on the other side but not knowing has been THEE worst! Not sure if any of you have good news to share (or bad, either way I wonder how you're doing).",
      "MessageIndex": 16,
      "PostDate": "10/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858204",
      "Title": "Trying to stay calm lala1608 lala1608"
    },
    {
      "AuthorID": "lala1608",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258522/profile",
      "Content": "Aug 29, 2017 11:48PM lala1608 wrote: Hi Doglover32...the waiting is TORTURE. I thought about asking them to move it up but I know there are other women in the same situation and I wouldn't want to bump anyone. Are they only going to biopsy one of the clusters or all of them? Just curious because both of my clusters will be biopsied...maybe it depends on how close together they are. I hope your biopsy goes well and that you get good news...keep us posted!",
      "MessageIndex": 2,
      "PostDate": "29/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858204",
      "Title": "Trying to stay calm lala1608 lala1608"
    },
    {
      "AuthorID": "lala1608",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258522/profile",
      "Content": "lala1608 wrote: Well, it just makes sense that the most impatient person in the entire world will be waiting months to get a definitive diagnosis. I had two areas of clustered microcalcifications that they tried to biopsy in September with no luck, you can read all about it HERE. I went to see a breast surgeon who is now going to do a surgical biopsy of both areas, at first they were just going to remove the first area but her radiologist said they should both come out (so of course I'm overthinking that comment). The weird thing is that I've gotten used to the waiting for the most part and I even have these talks with myself that if it comes back cancerous, they caught it early and I'll be fine. And then I wake up in the middle of the night having a full on panic attack. It's always at night, I have no clue why. Last night was bad...I just want this to be over. My surgery is 11/14. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/859430",
      "Title": "More procedures...more waiting lala1608 lala1608"
    },
    {
      "AuthorID": "lala1608",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258522/profile",
      "Content": "Sep 12, 2017 01:08AM lala1608 wrote: that sucks Mel, I hope they get you in soon. I had my stereotactic biopsies today. Well two biopsies turned into 6 because they couldn't get the calcifications. They never ended up getting the ones they wanted to get. I ended up puking and almost fainted. It was not good. I have no idea what's next. They're going to send the samples to path and see what they come back as. OVER IT.",
      "MessageIndex": 8,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858204",
      "Title": "Trying to stay calm lala1608 lala1608"
    },
    {
      "AuthorID": "lala1608",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258522/profile",
      "Content": "Sep 18, 2017 12:58AM lala1608 wrote: hi everyone, Not sure if anyone is still following this thread but I need to vent a little and I'm also trying to figure out what to do next. I got a call on Thursday and they said that no calcifications were found in any of the 6 biopsies they took, so the procedure essentially was a failure. The biopsies that were close to each other pretty much formed on gaping wound on my breast so I've been trying to keep it together with steristrips. Also, they have told my doctor NOTHING...they don't even know what happened at this point. I know how to view my med records online (not my first rodeo) and the report from pathology was supposed to be posted on 9/15, then that day came and went. Now it states it will be posted today but I still don't see it. I have an appointment with them tomorrow to discuss next steps. The lady who called me Thursday (who is neither a doctor nor a nurse) mentioned waiting 6 months and then getting another mammogram? I'm like whaaaaa? All of the calcifications they were trying to sample are still in my boob based on the post op mammogram, why would I just wait another 6 months? I will probably request an excisional biopsy but I want to hear what they have to say tomorrow. This is all so EXHAUSTING. I'm an avid runner and I can't run because of the biopsies which is making me feel worse I swear. Any advice? Thanks for letting me vent",
      "MessageIndex": 10,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858204",
      "Title": "Trying to stay calm lala1608 lala1608"
    },
    {
      "AuthorID": "lala1608",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258522/profile",
      "Content": "Sep 26, 2017 01:11AM lala1608 wrote: Tpralph...I was wondering, did your mammogram not show any sign of a mass? I have dense breasts so I'm always wondering about that.",
      "MessageIndex": 14,
      "PostDate": "26/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858204",
      "Title": "Trying to stay calm lala1608 lala1608"
    }
  ]
}