{
  "AuthorID": "lala1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
  "Posts": [
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Jun 8, 2014 02:25PM lala1 wrote: Well, I had another TVUS. Things are actually looking better. My ovarian cysts are half the size on one side but bigger on the other side. The uterus isn't as enlarged and the endometrium lining has come down a bit. None of the measurements are in the range of the drs saying I don't need a HX but they say I can wait till the late fall. I will do another TVUS in August just to be sure that it's still ok to wait. This Tamoxifen is wreaking havoc with my life!! The muscle and joint pain in my hips and legs is terrible. It almost makes me not want to exercise but fortunately I have found that the exercise is what makes me feel better....that along with ginger and turmeric and now tart cherry juice there may be a tiny light at the end of the tunnel. And I think I'll feel better once I have all my lady bits out and take out that cancer risk!",
      "MessageIndex": 6,
      "PostDate": "08/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Jun 9, 2014 02:45PM lala1 wrote: Well, my doctor just called to let me know that he tested my hormone levels and they are normal. I am not in or going through menopause. This actually bums me out as I thought perimenopause might explain some of the problems I am having such as dizziness, nausea, night sweats, etc. I am assuming this means that when I have the hysterectomy, my surgical menopause will be much worse? Anyone got any insight or advice?",
      "MessageIndex": 7,
      "PostDate": "09/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Aug 17, 2014 12:00AM lala1 wrote: Farmerlucy--I was given one of the nasal rinse bottles which I used for a couple of months but didn't feel it made any difference. I really don't think it's allergies for me. I actually feel better when I'm outside so doc thought mold allergies but then I moved north just for the summer months and feel the same here. I'm pretty sure this is perimenopause. Kamm--I really hope I don't have to go thru this for six or seven years! Wow! You're one tough cookie! I've got the weight gain more or less in hand. I work out every day and don't lose and ounce...but I'm not gaining much either. I've gained about 5 pounds since diagnosis a year and a half ago and my MO is delighted. He said most of his patients who go on Tamoxifen gain 20-40 pounds in the first year! I guess I should watch my eating a little closer. I'm so worried about gaining weight that I tend to slack off on eating. And then when I feel dizzy or bloated, I then don't want to eat. I'm sure a hysterectomy is not too far off for me. Hearing you've had your ovaries removed and feel better is a HUGE relief for me. That's my biggest worry.....that I'll get tossed into surgical menopause and feel even worse than I do now. I just need to think positive!!",
      "MessageIndex": 38,
      "PostDate": "17/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Sep 22, 2014 02:15PM lala1 wrote: Thanks, awb. I'm hoping to just keep delaying this a bit. The issue I'm grappling with now is the ovary removal part. My gyn says remove them to reduce risk of ovarian cancer, but my MO says Tamoxifen reduces risk of ovarian cancer. So how do you decide which is the way to go? I'd hate to leave the ovaries only to have to remove them down the road in another surgery, but I hate the idea of removing them only to be hurled into surgical menopause! There should be some sort of formula for this to help us decide!",
      "MessageIndex": 49,
      "PostDate": "22/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Oct 4, 2014 09:18PM lala1 wrote: thirdgeneration----After a TVUS in April that showed thickened lining, ovarian cysts, enlarged uterus and fibroids, I was supposed to have surgery this fall sometime. But at my last TVUS he found that my lining was only slightly thickened, my ovarian cysts were gone and my uterus was no longer enlarged. I still have some fibroids but he said they are very small and haven't changed in size at all. I don't have any pain or heavy bleeding (Heck, I only have a period about every 3 months!) so he said let's wait and watch. We are doing another TVUS in Dec and will re-evaluate and go from there. I'd like to push it to later and hope I get thru menopause naturally. He just wants to make sure the Tamoxifen isn't causing uterine/endometrial problems. But when I do have it, he said he'd do a total lap with BSO, just like what you did. He basically feels that I don't need my \"lady bits\" since I'm 51 and all they are good for is giving me cancer. I don't have a problem with that idea, but have convinced myself (thank you, Google) that I will be hurled into surgical menopause. That scares me more that having a mastectomy!! I would actually like the idea of not being afraid of endo or ovarian cancer. But I also haven't had a hot flash yet. And I just KNOW they will be horrible. :) I've really got to stop being such a drama queen and I really really need to stay off Google!",
      "MessageIndex": 73,
      "PostDate": "04/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "May 26, 2014 01:15PM lala1 wrote: Thanks, all. This makes me feel a bit better about recovery. I've had a couple of surgeries before the MX, but that surprised me at how long recovery took. My DH was kinda lost but rallied with guidance from my SIL. Now that I've been through that, I think he would be ok with the HX since it's will be a laparoscopically assisted vaginal one (fingers crossed no surprises!) I've been reading HysterSisters to get some tips and am most worried about that first BM! They said I'd have the same issue after MX but I was so drugged for so long afterwards (I thought that since they gave you the drugs, you should take the drugs; all of them!) that I don't even remember if it was a problem. And then this whole idea of extreme pain from gas scares me. I'll keep researching and see if I come up with ways to ease both issues. My dr is doing another vaginal US next week to decide on the timing of the surgery. My gyn did a biopsy and said since it was negative I can wait till later in the year, Nov is my preference. But my 2nd opinion dr (who said I'm a great candidate for lap HX after gyn said I wasn't, mostly cause she doesn't know how to do them!) said if any of the cysts are bigger then I'll be in much sooner. I'm supposed to make my annual migration north for the summer job and am worried that I won't be up for the drive, much less packing the car. It's an 8 hour drive. Oh well, all I can do is cross my fingers and hope nothing is bigger at my next US!! Any more tips are most appreciated. It's especially helpful to hear from BC sisters who can compare to MX as well. Thank you!!",
      "MessageIndex": 5,
      "PostDate": "26/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Sep 24, 2014 12:49AM lala1 wrote: I always take all my vitamins and meds after eating a full breakfast so that wasn't my problem. Also, my symptoms could pop up at any time of the day (or night sometimes). I'm still cautiously optimistic that I may have found my problem but I'm going to give it a couple more weeks to be sure. Some of these vitamins have many unknown \"fillers\" in them. You never know what may react with your body. For those on Tamoxifen, you know that the different brands cause different side effects depending on the fillers used. Must work the same way with some vitamins.",
      "MessageIndex": 55,
      "PostDate": "24/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Oct 3, 2014 01:43PM lala1 wrote: glennie19--glad you're doing better every day! Your reports help me get in a better frame of mind about the my surgery, whenever that may be! thirdgeneration---didn't realize you had one so recently! Glad you are doing well too! Keep us updated on ya'lls progress. It really does help!",
      "MessageIndex": 69,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Oct 2, 2014 12:32AM lala1 wrote: Glennie19---Checking in to see how you're doing post surgery. Hope the healing is going well.",
      "MessageIndex": 63,
      "PostDate": "02/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "lala1 wrote: I have recently found out that I need a hysterectomy, probably due to my Tamoxifen. I have thickened endometrial lining, enlarged uterus, fibroids and a couple of simple cysts on my ovaries. I'm 50 and thinking I'm just starting menopause due to sporadic periods. My dr wants to do a total laparoscopic HX including the cervix and both ovaries. I've been researching post op recovery for this and was wondering if any BC sisters that have had this done can tell me what the recovery will be like? I had a UMX about a year and half ago and had my SIL come for the surgery. She stayed with me for a week then took me to her house for 2 weeks. She also came for the EX surgery planning on staying a week and I only needed her for about 4 days. I'm hoping the HX surgery won't be anything like the MX was. My dr said I should start feeling pretty good in 10 days. My husband was as much help as he could be during MX recovery (he is a man after all and not my choice for some nursing duties!) and what I'm wondering is if he can handle my recovery after HX since my SIL might not be able to come. I also want to know how long before I can drive. And since I'm assuming I will be thrown into full menopause, how do you handle the hot flashes if you can't take HRT? As you can see, I have lots of questions so any advice would be great!! Mentor smooth round high profile memory gel implants 600cc (Left); Allergan 10 Moderate Profile 120cc (Right) ; Oncotype 15 Dx 11/27/2012, IDC, 2cm, Stage IIA, Grade 3, 0/5 nodes, ER+/PR+, HER2- Surgery 12/12/2012 Mastectomy: Left Hormonal Therapy 1/31/2013 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Surgery 3/25/2013 Reconstruction (left): Silicone implant Surgery 6/24/2014 Reconstruction (left): Nipple reconstruction Surgery 1/19/2015 Prophylactic ovary removal Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "lala1 wrote: I have recently found out that I need a hysterectomy, probably due to my Tamoxifen. I have thickened endometrial lining, enlarged uterus, fibroids and a couple of simple cysts on my ovaries. I'm 50 and thinking I'm just starting menopause due to sporadic periods. My dr wants to do a total laparoscopic HX including the cervix and both ovaries. I've been researching post op recovery for this and was wondering if any BC sisters that have had this done can tell me what the recovery will be like? I had a UMX about a year and half ago and had my SIL come for the surgery. She stayed with me for a week then took me to her house for 2 weeks. She also came for the EX surgery planning on staying a week and I only needed her for about 4 days. I'm hoping the HX surgery won't be anything like the MX was. My dr said I should start feeling pretty good in 10 days. My husband was as much help as he could be during MX recovery (he is a man after all and not my choice for some nursing duties!) and what I'm wondering is if he can handle my recovery after HX since my SIL might not be able to come. I also want to know how long before I can drive. And since I'm assuming I will be thrown into full menopause, how do you handle the hot flashes if you can't take HRT? As you can see, I have lots of questions so any advice would be great!! Mentor smooth round high profile memory gel implants 600cc (Left); Allergan 10 Moderate Profile 120cc (Right) ; Oncotype 15 Dx 11/27/2012, IDC, 2cm, Stage IIA, Grade 3, 0/5 nodes, ER+/PR+, HER2- Surgery 12/12/2012 Mastectomy: Left Hormonal Therapy 1/31/2013 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Surgery 3/25/2013 Reconstruction (left): Silicone implant Surgery 6/24/2014 Reconstruction (left): Nipple reconstruction Surgery 1/19/2015 Prophylactic ovary removal Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Jul 25, 2014 10:30PM lala1 wrote: Thanks, madeditor, for that information. I usually recover very well from surgery but my mastectomy was a surprise because I was in so much pain for so long. Once I figured out that it was muscle related and learned to regulate Flexeril as well as use compression (wear a bra 24/7) it got much better. Other than still not being able to tolerate underwire bras, I'm doing really well. Exchange surgery was easy too. I have a real fondness for propofol!! For some reason, I'm much more worried about the hysterectomy. My doc keeps saying I'll feel really good in about 10 days so will have to be very careful to not overdo it. And I keep reading about all the women who are so glad to have gotten the hysterectomy because their pain is now gone but I don't have any pain or problems! It's more of a prophylactic issue in that I have so many issues that COULD become very bad. It makes me second guess my decision to do this. That combined with my total fear of surgical menopause (I am perimenopausal now but no hot flashes as of yet) is making me crazy!",
      "MessageIndex": 10,
      "PostDate": "25/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Aug 1, 2014 12:34AM lala1 wrote: Glennie19---I'm so glad you told me that! My estrodial levels were well over 700 when he ran my labs. I totally freaked because I knew that was sky high, like pregnant sky high! My doc basically blew me off and said not to worry because Tamoxifen can cause them to go up. He also said it was quite likely that I was in perimenopause. Pretty sure he's right cause about 3 days ago I started getting 1 warm flush every night around 5am. I'm sure it's just the beginning! And I get such headaches and bloating as well as about 3000 other menopause symptoms! I have an appt next week for a TVUS and to find out the date of my hysterectomy. Oh joy.",
      "MessageIndex": 12,
      "PostDate": "01/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Aug 13, 2014 01:46AM lala1 wrote: Farmerlucy---Hearing stories like your sister's gives me great hope! I'm pretty sure that the Tamoxifen is just lurking in the background waiting to blindside me so I'm still preparing for \"some day\". I'm hoping I get far enough into menopause that surgical menopause won't knock me for a loop!! By the way, I had an endometrial biopsy also which was negative. However my doc at the time said those biopsies are \"like looking for a tennis ball on a tennis court with your eyes closed\" so take the results with a grain of salt. But I also had her run the CA125 test (I have it done every time I get an US) which show normal levels so I'm comfortable with the watchful waiting approach. In the meantime I, too, shall work on strengthening my bladder!!",
      "MessageIndex": 33,
      "PostDate": "13/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Oct 5, 2014 03:54AM lala1 wrote: thanks, glennie---I really appreciate hearing everyone's story. Isn't it funny that I'm more worried about surgical menopause than I am about ovarian or endometrial cancer! Heck I'm more worried about hot flashes than BC returning/showing up in my other boob!! My dad tells me I'm a grade A worrier...that I worry for other people if I can't find something to worry about for myself! And he's right, of course. I just can't seem to make my brain remember that if I can make it through cancer, mastectomy and reconstruction, I can make it through anything!! Stupid brain...... Keep the info flowing. It definitely helps!!",
      "MessageIndex": 75,
      "PostDate": "05/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Oct 10, 2014 11:16PM lala1 wrote: I, too, have very high levels. My estrodial level was over 700 back in the spring when they first started talking hysterectomy. That was my original OB/GYN. Then I got a second opinion and the doc I have now says don't really worry about those numbers. He said Tamoxifen raises those numbers just like it can thicken your endometrial lining. It's just a matter of how much. I thought I was going through menopause back in the spring with night sweats, nausea, dizziness,weight gain, etc. But then along would come a period and I'd think...what now? But now that I've gone off the multivitamin causing most of my issues it's like night and day. Still have sporadic periods but no more nausea, dizziness, very few warm flushes...maybe 1 or 2 every other night, and best of all, I've already lost 4 pounds just from not being bloated and such! I'm sure my high estrogen levels probably helped cause my breast cancer, but I'm hoping that in return they will ease my menopause symptoms. Seems it's the least all that estrogen can do!!",
      "MessageIndex": 80,
      "PostDate": "10/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Aug 12, 2014 02:53PM lala1 wrote: So last week I saw my doc for my TVUS to determine when to have my hysterectomy and he cancelled it indefinitely!! He said my enlarged uterus was back to normal size, my ovarian cysts were gone completely, my lining was only slightly thickened now and although I still have the fibroids, they were already small and hadn't gotten any bigger. He said to come back in 4 months for another US and we'll just do some \"watchful waiting\". He thinks I will still need the HX at some point but for now I can try to at least get thru some menopause (I am 51 and just starting to experience warm flushes, dizziness, etc. I've had my levels tested and I'm not in menopause). So...leading up to this....starting in Jan I had my last normal regular period. I then went 2 months without, had one, then 4 months without. That's when I had my last TVUS (June 2014). I read somewhere that cinnamon helps regulate your cycle so I started adding a bit to my coffee every morning. 2 weeks later....period. Normal, lasted 1 week. 4 weeks later to the day...period. Normal, lasted 1 week. Doc said he didn't know if the cinnamon did the trick but it certainly couldn't hurt. And if regulating my period got rid of the cysts and such, then he was all for it. So for now.....we watch. My doc does think I should get the surgery at some point. He just feels the Tamoxifen can do so much damage and if I don't need my \"lady bits\" then remove the risk. But he'd like me to get as far into menopause as possible. He says removing ovaries is also important with BC survivors since so many of us have ER+ BC. My estrodial levels are sky high which makes me nervous. Since I can't take hormone therapy, I was really worried about surgical menopause. My doc said he'd probably have me give it a try and if it got really bad, he'd put me on Brisdelle. But he said that since I was already perimenopausal, that he didn't think it would be too bad. From his mouth to God's ears!!  I also told him I was worried about incontinence. He said I could strengthen my bladder now to lessen the risk (which he said is already very low) of problems later. This is how.....pee every 30 min whether you need to or not  for one week. Add 30 min for every 1 hour in week 2. Keep adding 30 min till you build up to peeing every 3 hours. This will help with age related incontinence or surgical incontinence. I asked about Kegels and he said most people don't do them correctly and if you don't, you can do more harm than good. That's why he recommends the other approach. I have pages of questions that I've asked him about hysterectomies so if anyone has any questions, let me know. I've probably already asked them!!",
      "MessageIndex": 29,
      "PostDate": "12/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Aug 15, 2014 03:40PM lala1 wrote: I'm 51 and wondering if all this crap I'm experiencing is perimenopause or Tamoxifen or both. Dizziness/lightheaded, fatigue, bloating, burping, peeing all the time, night sweats, heart palpitations, weight gain, sinus pressure....the list just goes on and on. I'll have a couple of great weeks and then have a few really bad days/nights. I'm still having periods although they were a bit sporadic through the spring and got regular again over the summer. The dizziness is the worst part! Makes me feel like my blood pressure is low or like I'm breathing too lightly if that makes any sense. I don't mind the menopause part cause I'm hoping to get through it so when I have my hysterectomy, surgical menopause won't be as bad. But damn!!....this is the pits. And when it happens in the middle of the night, my mind goes to all the dark scary places that start with brain tumor or heart attack! Ugh!!",
      "MessageIndex": 35,
      "PostDate": "15/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Sep 23, 2014 04:20PM lala1 wrote: glennie19---Funny enough I thought I was going into menopause for the last 9 months with sporadic periods, nausea, dizziness, bad bouts of burping, headaches, etc. Then about 3 weeks ago I sat down and looked over my notes (I keep detailed notes as to meds I start/stop and effects per a recommendation by my MO. He said it would help me know what Tamoxifen was doing to me as opposed to \"normal life\".) and I realized that just a few days before all this started I had started and new multivitamin. So I googled whether multivitamins can cause these types of symptoms and found that it is possible and One-A-Days are particulary bad about it which is what I was taking. So I quit. After 5 days, all my issues went away!! It's now been 2 weeks and I feel the best I've felt in months. Still having sporadic periods so guessing I'm heading into menopause and sometimes in the early mornings I have \"warm flushes\" but otherwise no issues, no pain, nothing. This is why I'm so hesitant to have the hysterectomy....most people have it for pain, bleeding, etc and I don't have those issues. Just slightly thickened lining and ovarian cysts that resolved themselves. Heck, even my fibroids don't cause me pain or real,y heavy bleeding when I DO have a period. Praying for an easy surgery and recovery for you. Keep us updated on how it goes.",
      "MessageIndex": 53,
      "PostDate": "23/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "lala1 wrote: I have recently found out that I need a hysterectomy, probably due to my Tamoxifen. I have thickened endometrial lining, enlarged uterus, fibroids and a couple of simple cysts on my ovaries. I'm 50 and thinking I'm just starting menopause due to sporadic periods. My dr wants to do a total laparoscopic HX including the cervix and both ovaries. I've been researching post op recovery for this and was wondering if any BC sisters that have had this done can tell me what the recovery will be like? I had a UMX about a year and half ago and had my SIL come for the surgery. She stayed with me for a week then took me to her house for 2 weeks. She also came for the EX surgery planning on staying a week and I only needed her for about 4 days. I'm hoping the HX surgery won't be anything like the MX was. My dr said I should start feeling pretty good in 10 days. My husband was as much help as he could be during MX recovery (he is a man after all and not my choice for some nursing duties!) and what I'm wondering is if he can handle my recovery after HX since my SIL might not be able to come. I also want to know how long before I can drive. And since I'm assuming I will be thrown into full menopause, how do you handle the hot flashes if you can't take HRT? As you can see, I have lots of questions so any advice would be great!! Mentor smooth round high profile memory gel implants 600cc (Left); Allergan 10 Moderate Profile 120cc (Right) ; Oncotype 15 Dx 11/27/2012, IDC, 2cm, Stage IIA, Grade 3, 0/5 nodes, ER+/PR+, HER2- Surgery 12/12/2012 Mastectomy: Left Hormonal Therapy 1/31/2013 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Surgery 3/25/2013 Reconstruction (left): Silicone implant Surgery 6/24/2014 Reconstruction (left): Nipple reconstruction Surgery 1/19/2015 Prophylactic ovary removal Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Oct 2, 2014 11:29PM lala1 wrote: glennie19---You had your cervix removed also? I know you had the 4 small incisions but wasn't sure if all removed vaginally. That's the way my doc wants to do it. He told me that I would feel really good at about day 10 which is the biggest problem because then you overdo it. He said if around day 10 you would pretend that you are at day 2 and start over, you'll get through this with likely no problems. So be sure and rest! How are the gas pains? I hear waiting to poop is the worst!!",
      "MessageIndex": 65,
      "PostDate": "02/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "lala1 wrote: I am 7 months post UMX and 4 months post exchange. I'm finding shaving to be one of the last difficult things I'm dealing with (other than still not being able to wear a real bra!). My massage therapist has offered to wax my underarms. Does anyone know if this is ok. I know they recommend not using a regular razor but I tried one of the small battery bikini razors and it's actually more uncomfortable. Would I be better off trying Veet or Nair? Just wondering what everyone else is doing. I didn't have to have chemo or radiation so all my glorious underarm hair is still growing strong!! Mentor smooth round high profile memory gel implants 600cc (Left); Allergan 10 Moderate Profile 120cc (Right) ; Oncotype 15 Dx 11/27/2012, IDC, 2cm, Stage IIA, Grade 3, 0/5 nodes, ER+/PR+, HER2- Surgery 12/12/2012 Mastectomy: Left Hormonal Therapy 1/31/2013 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Surgery 3/25/2013 Reconstruction (left): Silicone implant Surgery 6/24/2014 Reconstruction (left): Nipple reconstruction Surgery 1/19/2015 Prophylactic ovary removal Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808634",
      "Title": "Underarm hair after a mastectomy lala1 RebeccaA"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Aug 1, 2013 07:13PM lala1 wrote: Yeah, don't have lymphadema but surely don't want it!! So far, research seems split about 50/50 on waxing with more saying don't do laser hair removal. I've got one spot that's just really unreachable with any kind of razor...deep crater too!!",
      "MessageIndex": 2,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808634",
      "Title": "Underarm hair after a mastectomy lala1 RebeccaA"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "lala1 wrote: Anyone know of a good BS in the Bradenton/Sarasota area? Mentor smooth round high profile memory gel implants 600cc (Left); Allergan 10 Moderate Profile 120cc (Right) ; Oncotype 15 Dx 11/27/2012, IDC, 2cm, Stage IIA, Grade 3, 0/5 nodes, ER+/PR+, HER2- Surgery 12/12/2012 Mastectomy: Left Hormonal Therapy 1/31/2013 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Surgery 3/25/2013 Reconstruction (left): Silicone implant Surgery 6/24/2014 Reconstruction (left): Nipple reconstruction Surgery 1/19/2015 Prophylactic ovary removal Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/818523",
      "Title": "BS recommendation for FL lala1 MsMay"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Feb 28, 2014 12:25AM lala1 wrote: Thanks, lintrollerderby. I'll pass this name along. She'll travel for the right person!",
      "MessageIndex": 2,
      "PostDate": "28/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/818523",
      "Title": "BS recommendation for FL lala1 MsMay"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Feb 28, 2014 07:00AM lala1 wrote: thanks so much linda505! I'll pass it along!",
      "MessageIndex": 4,
      "PostDate": "28/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/818523",
      "Title": "BS recommendation for FL lala1 MsMay"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "May 1, 2013 02:51PM lala1 wrote: Anyone have residual pain after exchange surgery? I am 5 weeks out and still feel like I am wearing a bra 3 sizes too small. If anyone has found relief, please let me know.",
      "MessageIndex": 976,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Aug 12, 2013 10:24AM lala1 wrote: Stick with the massage, MaggiePgh!! I've been doing it once a week now for about 6 weeks and I feel great! Combined with exercise and strength training, I feel almost 100% but feel even better about myself than before mx!",
      "MessageIndex": 1044,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Jul 18, 2016 07:06PM lala1 wrote: I have been following this thread since March when my best friend was diagnosed with BC. Hers comes 3 1/2 years after mine. We have the complete opposite...I'm ER/PR+ and HER- and she's ER/PR- and HER+. I didn't have to have chemo or rads and she may need both. She's already had chemo first. Just finished her last infustion about a week and a half ago. After much deliberation, she will be doing lumpectomy next. Once she's done that and seen if she's node + or -, she may elect to have rads then or move on to a mastectomy. She's not much interested in the medical side of all this whereas I'm a researcher/Googler through and through. Which brings me to why I'm here. She's asking what supplements she should be taking now that chemo is over. I've suggested turmeric, Vit D, multi, probiotic, calcium, magnesium, Biotin, possibly B vitamins....all of which she should run by her docs of course. She's got to do Herceptin for a year and rads may interrupt this plan but really I just wanted to see if anyone had some tips/tricks to boosting chemo recovery. She had her last dose delayed a week cause her WBC was so low and she's always been very thin so I really want to help her get healthier before the next phase. TIA!!",
      "MessageIndex": 1778,
      "PostDate": "18/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Dec 30, 2014 04:44PM lala1 wrote: Yes, Tamoxifen is a scary thing to have to take but keep in mind that MOST women don't have severe side effects. I've been on it for 2 years and my worst issue was muscle/joint pain which I've reduced about 75% with ginger, turmeric and magnesium. I've had mild warm flushes at night a few times, deal with periodic nausea, dizziness, burping and bloating, but mostly feel really good. I have to have a hysterectomy in Jan due to AI after surgery but figure I do pretty well on Tamoxifen so why rock the boat? And I can tell you I was PETRIFIED to take this stuff!! But typically for me, my mind made it worse than it was. So I say try it and see how it goes before writing it off completely. And one more thing....I have to go off for 2 weeks prior to surgery and I've heard that sometimes taking a break can cause it to be a bit milder when resuming. I'll let you know if that's the case.",
      "MessageIndex": 28,
      "PostDate": "30/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/826766",
      "Title": "Estrogen replacement....am I crazy? Amoc1973 Scotty"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Jul 8, 2013 06:27PM lala1 wrote: MaggiPGH--i just posted about my gym adventures on exchange city. I had my 2nd massage last week. First one about 3 weeks ago. Didn't hurt at all and didn't make any difference in pain. Had my 2nd one with different lady at a gym's cancer group I joined and she had me almost levitating off the table a couple of times but it felt so great afterwards! She even left some bruising from where she worked the trigger points. I am going back on Wed. She said you could go every day if you wanted but once a week was plenty. Her myofascial release therapy was just what I needed. And Leeza13, in my cancer class is a woman who had BMX 2 1/2 years ago followed by implants. 6 weeks ago she had the implants removed due to ongoing pain (iron bra, muscle spasms, etc) and she told me the other day that it made no difference at all in her pain. She decided to just go flat and pain free and now realizes that the implants weren't the problem. So she's decided to follow what I'm doing at the gym and see if it helps the pain. If so, she may get them put back in. My PS and BS and MO all said my excruciating pain afte UMX was not due to implants but due to my lack of ROM which took me many months to get back. Once I upped my work with the PT and got back ROM, my pain started to subside. It's not all gone and a PT I consulted with today said I have a few problem areas but she gave me stretches to do and said I should be mostly pain free by the end of the summer! So working on frozen shoulder and cording may be your best route at this point. Hope ya'll both get to that pain free point!!",
      "MessageIndex": 1015,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Sep 30, 2013 10:38AM lala1 wrote: Pam--I second Linda-n3. Definitely find a good massage therapist who can do myofascial release. It was a life saver for me! I had ongoing daily pain and tightness along with muscle spasms for 6 months following my mx. Once I started with massage therapy, I got off all pain meds. I went once a week for 3 months along with joining a cancer class at a gym where they taught me how to do circuit training to help with keeping my muscles supple. They also had a warm water pool where I would float on a noodle and do the breast stroke to help with stretching and loosening my shoulder and pec muscles. Now, 4 months after starting therapy, I am almost 100% pain free. I have days periodically where I have to stretch a bit more or do some of my own massage at home, but for the most part, I feel really good. I'm convinced the gym and massage made all the difference!",
      "MessageIndex": 1097,
      "PostDate": "30/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Jun 12, 2013 06:42PM - edited Jun 12, 2013 06:45PM by lala1",
      "MessageIndex": 1007,
      "PostDate": "12/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Jul 10, 2013 10:11AM lala1 wrote: I know what you mean Maggi. I've been working out quite a bit and while it's helped tremendously, it hasn't solved all my pain. I really believe that most of what I still have is from scar tissue. I'm hoping myofascial massage will help with that. I had PT after my mx for about 3 months. I went once a week 12 times I believe. She only worked my mx side since that was what prescription was written for. I had hour to hour and half sessions and she would manipulate my shoulder for the first half then have me do stretches for the second half. She used both hands and would hold it for about 90 seconds. She was not very \"pushy\" so to speak about working my shoulder. She would quit if I even winced. My BS said I wasn't pushing myself hard enough so once I told the PT that, she pushed me alot harder and I got better faster. By the way, all my doctors and PT were in Augusta, GA. I do think there are different ways to do PT and you have to find the one that helps you. I went to another PT up here in VA where I am for the summer, mostly just for an evaluation, and she just gave me some stretches so everyone is different.",
      "MessageIndex": 1020,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Jun 12, 2013 06:47PM lala1 wrote: bak94---I have some of what you are experiencing. I'm 3 months post exchange surgery and still have the tight iron bra feeling that goes across my chest and wraps around under my arm and partially across my back. I had a Uni MX with TE back in Dec and implant put in in March. No chemo or radiation (thank god) and have had this pain the whole time. It's definitely better since implant but still there. I went to Occupational Therapy once a week and worked very hard to get my ROM back to 100%. I saw her for 3 months before my pain would ease for longer than a day or two. She's also given me a stretch band to some exercises with as well as shown me others to do. It helps as long as I do them a couple of times a day. I alternate the different types of exercises throughout the day and try not to do too much as I find it's worse if I do more than 3 times. Some days I only do once. It's been strongly suggested that I try myofascial release therapy for possible scar adhesions. I've found a woman who does this and have an appt next Tues. This will be my first time. I'll let you know how that works for me. Neither my PS or BS are very involved in this and just keep telling me to stretch more. I've done lots of research and this is my next best step. The woman really feels that she can help.",
      "MessageIndex": 1008,
      "PostDate": "12/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "lala1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168285/profile",
      "Content": "Aug 1, 2013 07:59PM lala1 wrote: Keep fighting Maggi! I just had my 5th myofascial release massage yesterday and today for the first time since my mx realized I had no pain all day! I was getting ready for my cancer class at the gym and thought \"Wow! I haven't thought about my pain all day!\" Of course, once I did all my exercising it got a bit sore but all in all I have started to feel pretty good. I know the stretching and strenght training are helping but the massage therapy has been the best. I go once a week and it's been great! And yes, they need to touch you for that!! Sounds like your PT is a real whack job. Kick her down the road and go try another. Life is short enough without listening to the crazies who like to make you feel like it's your fault you got breast cancer! I'm trying to surround myself with only positive helpful people and so far it's working like a charm! So call the next PT on your list. If you don't love that one, try another. You really need someone to help you through this that you really connect with. Healing thoughts headed your way!",
      "MessageIndex": 1033,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    }
  ]
}