{
  "AuthorID": "Lala-44",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
  "Posts": [
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Lala-44 wrote: I'm so annoyed :( it's a month I have a very itchy, tingly and red ish type nipple going on. I've visited 3 breast surgeons, not one lol. All of which first off can't even see any redness or anything on my nipple, completely disregard the itch and tingling. They said it's definately 100% not pagets and not to worry. I had ultrasounds done etc with obviously nothing detected. Now because I went back yesterday freaking out, they will do an MRI but completely refuse to do a biopsy as they said there is nothing to even biopsy. When I mention that pagets can only be detected with a biopsy and that many have been missed otherwise the Surgeons tell me to stop googling!!!! My nipple look so pretty normal, no bleeding, no scaling, no scabs nothing except a tad red. I don't know what to do. : Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858299",
      "Title": "Worried sick about pagets and no one will listen Lala-44 Lala-44"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Aug 29, 2017 06:41PM Lala-44 wrote: thank you for replying. I have a great Dermo I can definately go visit for a second opinion. The main reason they don't want to biopsy is because they say it will leave a scar and that for now it's completely un necessary. I wonder what an MRI can detect. I will definately keep you all posted, im booked in for this coming Friday.",
      "MessageIndex": 3,
      "PostDate": "29/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858299",
      "Title": "Worried sick about pagets and no one will listen Lala-44 Lala-44"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Oct 10, 2017 04:10AM Lala-44 wrote: just to update: I’ve had an MRI which shows nothing but a fibroadenoma and was rated at biraids 1 In right breast and 2 in second. I went back to breast surgeon and he doesn’t seem concerned and won’t biopsy. The Dermo said it looks more like exzema of the nipple since I have eczema in other areas on my chest. The nipple is still itchy at times, it also flakes as if it seems dry. The flaking is super minimal and only in one spot. The breast surgeon also took samples of the breast discharge that I have from both breasts. It looks like milk that never dried up from when I had a baby 17 months ago, only happens when expressed.So that was put on a slide and sent to patholog to check for abnormal cells. Again , no one will biopsy the nipple ... the skin flaking is new so I’ll see how this plays out and if it continues then I’ll demand a biopsy.",
      "MessageIndex": 8,
      "PostDate": "10/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858299",
      "Title": "Worried sick about pagets and no one will listen Lala-44 Lala-44"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Oct 11, 2017 07:01PM Lala-44 wrote: they didn’t really prescribe anything except moisturizing cream and since I already have cortisone the Dermo said I can use it if I want ...cortisone does help with itching but the flaking is so so minimal that u really have to look closely to even notice it. Once i moisturize it stops flaking instantly. Don’t know what else to do. Dermatologist and 3 breast surgeons won’t biopsy as they don’t see a clear area of concern. I’m at a loss..",
      "MessageIndex": 10,
      "PostDate": "11/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858299",
      "Title": "Worried sick about pagets and no one will listen Lala-44 Lala-44"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Aug 30, 2017 06:08PM Lala-44 wrote: thank you kicks. The Dermo will be a 4th opinion, you Are right. I grouped the breast surgeons in one catagory and considered dermatologist completely different, that's why. I understand there needs to be an Area of concern to biopsy but I keep reading that only a biopsy can diagnose pagets and nothing else. My fear is that's it's in a supe early stage hence the lack of ulcers. I can't explain the nipple itch that is driving me batshit :",
      "MessageIndex": 5,
      "PostDate": "30/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858299",
      "Title": "Worried sick about pagets and no one will listen Lala-44 Lala-44"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Oct 12, 2017 04:32PM Lala-44 wrote: LisaAlissa, thank you so much for such a kind and thoughtful response. I really appreciate all that you have said. I’m going to try and just move on with things and stop focusing on something that hasn’t even manifested Yet. I’m just so paranoid sometimes and I have a lot of friends with bc so this issue has had me stressing. Again thanks for shedding some light. Xo",
      "MessageIndex": 12,
      "PostDate": "12/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858299",
      "Title": "Worried sick about pagets and no one will listen Lala-44 Lala-44"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Aug 19, 2018 06:40PM Lala-44 wrote: greenish yellow breast discharge can be totally normal and not an indicator of infection. I’ve had it depending on where I am in my cycle. I even showed a breast specialist the color and it’s also been sent to pathology to analyze and it was totally normal. Mine was even a darker green",
      "MessageIndex": 18,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866041",
      "Title": "Green nipple discharge. Help! Freaking out! Erinashley19 Erinashley19"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Lala-44 wrote: i posted a while back. It’s years I have breast discharge both breasts usually when stimulated. It’s been sent to pathology on a slide twice. Benign. Recently I notice tiny traces on my bra (yellowish). Often it’s after working out but not always. Should I be concerned that it’s spontaneous now? : Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867581",
      "Title": "Breast discharge Lala-44 djmammo"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Aug 19, 2018 09:32PM Lala-44 wrote: thank you for posting this. This is exactly what I have! It’s pink but seems like it can be a collection of stretch marks or broken capillaries. Like you it’s visible in certain lighting and totally invisible in others esp bright lights! Freaking me out.",
      "MessageIndex": 35,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/840981",
      "Title": "IBC Worry juneinpa Lala-44"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Aug 19, 2018 10:46PM Lala-44 wrote: any updates? WhAt was the outcome",
      "MessageIndex": 50,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864821",
      "Title": "Diagnosed mastitis, worried it’s ibc Duckmomma JoE777"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Lala-44 wrote: I’ve been having breast discharge from both breasts, only upon expression and not spontaneous for many years since I had kids. I had my last baby 17 months ago... the breast surgeon put the discharge on slides and sent off to pathology. I’m waiting for results. Does anyone know what exactly this tests for?? Cancer cells? What type of cancers can be detected this way? Ive had a clear MRI on sept 1st... Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/859355",
      "Title": "Waiting on pathology of breast discharge Lala-44 Lala-44"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Lala-44 wrote: I go in today for my results of a nipple biopsy for possible pagets. I’m a complete nervous wreck and my tummy is in knots. I made the mistake of opening up my bandage on my nipple and noticed that my nipple is peeling even more! It’s crazy how much worse it looks and now I’m flipping out completely. To top it all off he did the biopsy a few cm away from where the issue is... arghhhhhh I just wanna know what the hell is going on :( my nipple is NOT acting normally at all. Need some good vibes, pretty please. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860218",
      "Title": "Results today at 130pm panicking!! Lala-44 MelissaDallas"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Oct 18, 2017 08:39AM Lala-44 wrote: I have the same problem. Very itchy right breast and nipple. My nipple actually flakes slightly too but the worst itch is right below the nipple. I’ve been everyone under the sun and even had a breast MRI done. Only thing I haven’t done is a biopsy which will be my next stop. The fact that you had a biopsy would reassure me some if I were you. If you really want an all around view then see if you can do an MRI. I wish I had more advice. Have you tried unscented detergent and eliminating fabric softnera",
      "MessageIndex": 5,
      "PostDate": "18/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859456",
      "Title": "Intense breast itching for months venuss9 Pearljammed81"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Nov 16, 2017 10:48PM Lala-44 wrote: my understanding is that an MRI is much more sensitive. However IBC is often diagnosed with a biopsy. Often the MRI will show swelling or layers of malignancy often in a “nest”. What’s reassuring for you is that aside from it being rare, it doesn’t come and go. Once it starts it becomes progressively worse and worse. There was one woman on here that had IBC and it took one year to diagnose since it seemed “minor” in terms of irritation and swelling. If I were you I would definitely want to get to the bottom of the swelling, that isn’t normal and it can’t be hormonal on one side! If your problems persist despite clear imaging, don’t be afraid to push and push for answers x",
      "MessageIndex": 6,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860154",
      "Title": "Not diagnosed with IBC, but I'm concerned about my breast Amyperry Amyperry"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "9 hours ago Lala-44 wrote: I have had several. They were just that. Fibroadenomas. At first I felt as you did and they recommended 6 month follow up. I wasn’t comfortable with that so I went after 3 months. There was no change therefore it was a B9. It stayed for years, same size and was seen in every breast ultrasound until it vanished last year. I wouldn’t jump to a biopsy right away I would wait 3 months and go back and see if there has been growth. I got several opinions and no one wanted to biopsy from get go. Depends on what you feel comfortable with",
      "MessageIndex": 7,
      "PostDate": "04/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/871487",
      "Title": "Anyone misdiagnosed with fibroadenoma? Christinadukie Lala-44"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Aug 29, 2017 07:51AM Lala-44 wrote: oh boy! I can totally understand your fears. I have a similar issue going on. No one will biopsy my left nipple. 3 breast surgeon specialists said no. I'm at a loss... I feel your pain. However with bloody discharge I think you should push HARD. Hope you get answers soon",
      "MessageIndex": 5,
      "PostDate": "29/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858117",
      "Title": "Pagets-not diagnosed yet but extremely worried Bex76 ishhlish"
    },
    {
      "AuthorID": "Lala-44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258720/profile",
      "Content": "Oct 16, 2017 06:15PM Lala-44 wrote: thank you. I wrote this thread before the last one. My apologies I’ll stick to the previous.",
      "MessageIndex": 2,
      "PostDate": "16/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/859355",
      "Title": "Waiting on pathology of breast discharge Lala-44 Lala-44"
    }
  ]
}