{
  "AuthorID": "lalisa",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
  "Posts": [
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Jan 13, 2012 11:03AM lalisa wrote: I have not been in your situation, but my feeling is that you can trust the opinion of the Drs. All 3 agree that rads is enough. It sounds similar to me to the way lumpectomy with radiation is just as effective as mastectomy to prevent recurrence. Of course, some women will choose mastectomy anyway. But if all the Drs agree that there is no reason to remove all the lymph nodes, I think you can take their advice and avoid the lymphedema risk. So sorry you have to go through this.",
      "MessageIndex": 3,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/780952",
      "Title": "Remove the rest of the lymph nodes or rely on rads? rabbit Artemis"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Nov 11, 2011 06:40PM lalisa wrote: I don't think you are in denial, you just sound strong and not neurotic to me. We have similar stats, so I am finding the way you handle this to be inspirational. I want to be more like you!",
      "MessageIndex": 10,
      "PostDate": "11/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/777918",
      "Title": "Is it denial and strength? SheChirple Janeybw"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Aug 11, 2011 10:02AM lalisa wrote: I'm so grateful for this doctor and his work to prevent needless lymph node removal. Thanks!",
      "MessageIndex": 1,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/772932",
      "Title": "New article from Giuliano: occult mets in sentinel nodes kira lalisa"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Jul 31, 2011 10:32AM - edited Jul 31, 2011 10:56AM by lalisa Don't be nervous! The big worry is endometrial cancer, right? It took me a while to understand this, but this type of cancer is very slow growing and it goes through many stages before it is actually scary cancer. It goes simple hyperplasia, complex hyperplasia, atypical hyperplasia, cancer. And they will start treating at simple hyperplasia so it never goes any farther.  Gyns do ultra sound and biopsies (and D&C's) to keep a close watch on the changes. My understanding is that it is VERY easy to catch early if you are being monitered, which you are. And as far as the D&C goes, very easy, nice light anesthesia. Maybe cramping for a couple days after, but ask for pain meds if you want and you will be fine with no pain at all. That has been my experience. The hard part is just all the uncertainty, but it is highly unlikely there is any danger of cancer at this point. Your gyn is just being really careful and watching you close, which is good. Let us know how it goes!",
      "MessageIndex": 13,
      "PostDate": "31/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/680237",
      "Title": "uterus thickening & tamoxifen waiting on biopsy edwh001 lalisa"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Aug 12, 2011 10:27AM lalisa wrote: Goodl, any news?",
      "MessageIndex": 15,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/680237",
      "Title": "uterus thickening & tamoxifen waiting on biopsy edwh001 lalisa"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Sep 6, 2011 10:32AM lalisa wrote: Hi Good! Glad to hear your path report was good. It is 2 months now since my hysterectomy and I am feeling totally back to normal, thanks for asking :)",
      "MessageIndex": 17,
      "PostDate": "06/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/680237",
      "Title": "uterus thickening & tamoxifen waiting on biopsy edwh001 lalisa"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Jul 18, 2011 03:32PM lalisa wrote: I hope your mom is okay. I had (still have) a little lump under my arm, like a raisin, I would say. I was scared to death, and went to the radiologist who originally diagnosed my bc 4 years ago. He examined me and said it was a little lump of fat, not to worry. I hope your mom gets the same good news.",
      "MessageIndex": 3,
      "PostDate": "18/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771616",
      "Title": "Scared and apparently ignorant to the reality of recurrence abigail8 CRR"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Dec 30, 2011 12:36PM lalisa wrote: Love this topic. I go flat and sometimes think of myself as a bit transgender-y. I actually feel more like myself this way than I did with boobs. I like that my chest is boyish or girlish or tomboyish. Sometimes I feel like the bmx put me back in touch with my child self in a way. But I also still feel like a woman. If I ever go for reconsrtruction it will have to be VERY small, just a little padding to fill in the boniness I think. I've been researching micro fat grafting. I grew up with a very small breasted mother and alway thought she was beautiful and was surprised to be a large B (and then when I was breastfeeding-D+!). My mom has since had augmentation and she loves it, feels more like herself I think she would say. So funny...",
      "MessageIndex": 67,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779933",
      "Title": "Gender Identity? MT1 sespebadger"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Aug 1, 2011 01:28PM lalisa wrote: So sorry you are going through this! Do remember that most lumps are benign, 80%, like you mentioned. The hardest thing is the waiting and not knowing. I have been through it many times, sometimes ending with bad news and sometimes with good news. Life is just filled with the waiting and the anxiety of the not knowing, it is a good thing to get good at if you possibly can. Sending light and love your way...",
      "MessageIndex": 2,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772513",
      "Title": "scared and worried like never before... scaredmommyof6 SarahsMom"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Nov 17, 2011 11:49AM lalisa wrote: Hey there, yes, it is very likely that your symtoms are due to the tamoxifen. They are of course worried about endometrial cancer, but the good news is that it is a very slow progressing cancer. The biopsy will tell you about how the cells look- normal, simple hyperplasia, complex hyperplasia, complex hyperplasia with atypia, or, last, cancer, what they are worried about.See, it is a long progression! You could very well have a normal path result, or maybe just hyperplasia, which they will follow. It is unlikely to be cancer, but it is good they are alert and following you. Best of luck, seding you love and light. I have been through this, normal resuts for a few years, then a change to simple hyperplasia, at which point I chose to have a hysterectomy and cross that worry off the list!",
      "MessageIndex": 1,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778243",
      "Title": "endometrial biopsy Canchaser GrandHillMom"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Jul 30, 2011 08:29PM lalisa wrote: Shippy, hugs. I bet that worker just wasn't paying attention. But no recon certainly brings up a lot of gender issues for me at times too. The funny thing is that since my bmx I don't really like to dress \"girly\" anymore, I feel more like myself in jeans and a tee and a flannel shirt. One thing I DO like is heels, not so much fancy stillettos, but high heeled boots or booties, with my jeans and tees. Everything boyish except for the shoes.  Tina, I get that chest stare sometimes too, and it does make me uncomfortable, I don't like it, but what can you do? When I had boobs there were guys who would stare too, didn't like that either I have to say. Breasts! So complicated, always too much or not enough, it seems :)",
      "MessageIndex": 392,
      "PostDate": "30/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Jul 31, 2011 12:49PM - edited Jul 31, 2011 12:50PM by lalisa I think I've said this in another thread, but after about a year of going flat, I finally went to be fitted for the prosthesis. We tried all sizes, but they all felt too big, so they finally special ordered the smallest size. Before, my breasts were small/medium with the exeption of when I was nursing (huge). But when the foobs arrived and I went to try them, even they looked wrong, too large, after a year of being flat. I have some \"cutlets\" but I don't think they look right either and I never wear them. I can't say that I like being flat. But, and I think Barb from breastfree has said the same, I also don't trust any PS to give me breasts, either implants, flaps, or fat grafting (which I have recently been researching) I'd rather have what I have now than risk something I might like even less. What I might try someday is Macrolane (legal in Europe, but not here yet). I like that it is not permanent (lasts a year or so). I think it can only increase the size about a cup size, which sounds perfect to me. I would like just enough to pass as just being naturally small breasted. I saw numerous PS back in my decision making days and it was almost impossible to make any of them understand this.  So am I happy with my decision? It's complicated. I wish there were more and better options. I think it is particularly hard for women who prefer to be small, because I have seen some pretty amazing implants, but they seem to work best in larger sizes.",
      "MessageIndex": 395,
      "PostDate": "31/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Aug 1, 2011 01:18PM lalisa wrote: I am new to this site, but one of the things I love is discussion like this. You guys are so smart and on it!",
      "MessageIndex": 13,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/772296",
      "Title": "New LE Position Paper NatsFan lalisa"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Sep 23, 2011 09:09AM lalisa wrote: I am bothered with numbness and weird sensations on the proph side too, and it is 4 years later. The side with the cancer and the node removal is quite comfortable. Go figure.",
      "MessageIndex": 569,
      "PostDate": "23/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Sep 23, 2011 10:16AM lalisa wrote: I know!! That thought has totally ocurred to me! :)",
      "MessageIndex": 571,
      "PostDate": "23/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "lalisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132027/profile",
      "Content": "Oct 26, 2011 12:05PM lalisa wrote: Great thread, thanks to everyone for sharing. My dx was in 2007, but I so remember having to make this decision myself. I would recommend 2nd and 3rd opinions just because of Dr biases. Some seem to need to do everything possible and others more evidence based. I am more comfortable with just evidenced based. My onco score revealed my bc to be responsive to tamoxifen, but not so responsive to chemo, so that is the course I have taken.",
      "MessageIndex": 20,
      "PostDate": "26/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/776993",
      "Title": "Onco 22 and must decide on Chemo LeesaAnn mdg"
    }
  ]
}