{
  "AuthorID": "lanihardage",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65827/profile",
  "Posts": [
    {
      "AuthorID": "lanihardage…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65827/profile",
      "Content": "Jun 4, 2008 12:22PM lanihardage wrote: Doctors really don't agree how to treat this disease, do they? Best Doctors expert had the same estimate I came up with using AdjuvantOnline! for genotypes -- chemo would reduce my risk by 50%. That translates into a recurrence risk that is lower by 3-4%, which he didn't think was enough to warrant chemo! I called my original oncologist and told her I wanted to go ahead with it. Now (finally) she says she would do the same thing if it were her. I will see her on Friday to find out the date.",
      "MessageIndex": 16,
      "PostDate": "04/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704318",
      "Title": "Oncotype not what the onc predicted lanihardage lanihardage"
    },
    {
      "AuthorID": "lanihardage…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65827/profile",
      "Content": "Aug 12, 2008 03:11PM lanihardage wrote: Even though the TailoRx trial has defined 3 groups, low, intermediate and high, remember that they are based on curves of scores. So a person in low intermediate has a lower chance of recurrence than a person in high intermediate (mine was high intermediate but in TailoRx everyone with my score gets chemo, so I chose to do chemo despite 2 out of 3 consults who said no chemo). It's a very individual decision, how much risk you can accept. With my score of 28, plugged into the adjuvant online program, I would get a 3-4% benefit from chemo. That means that 3 or 4 women out of 100 with my score who had chemo would not get metastatic cancer. My reasoning is that if I am one of those 3 or 4, I would rather do the chemo. I may be doing it for nothing except a whole lot of SEs, or I may be saving my life. Some people would probably prefer to avoid chemo unless their score was a lot higher. One of my consults didn't even trust the oncotype test because it was \"too new,\" but he's way out of line. Oncotype results have been incorporated into the clincal recommendations of the American Society of Clinical Oncology and the National Comprehensive Cancer Network. Here are links to those guidelines: jco.ascopubs.org/cgi/content/a...  http://www.nccn.org/",
      "MessageIndex": 24,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704318",
      "Title": "Oncotype not what the onc predicted lanihardage lanihardage"
    },
    {
      "AuthorID": "lanihardage…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65827/profile",
      "Content": "Apr 21, 2008 02:03PM lanihardage wrote: Thank you  both, Gayanne and Otter, for sharing your experiences. I am leaning toward agressive treatment and wish I had gotten started on it sooner. The delay was because my first oncologist was using old guidelines and because the office is overwhelmed and incompetent (a Mash unit, as one of their NPs called it). Yesterday, three months after surgery, I finally cried for the first time --at the frustration of the whole process. It was set off by my three year-old whacking me in the chest where I used to have a breast (didn't hurt). He calls it \"a breast askident.\"",
      "MessageIndex": 3,
      "PostDate": "21/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704318",
      "Title": "Oncotype not what the onc predicted lanihardage lanihardage"
    },
    {
      "AuthorID": "lanihardage…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65827/profile",
      "Content": "Apr 24, 2008 10:35PM lanihardage wrote: Rocktobermom, thanks for the affirmation. I agree with all three of you that I should do this. Rosario, that's a tough one for you. The problem is that they really don't know whether you will be one of the few who benefit or not. For me at 18%, I don't know whether I'm one of the 6 out of a hundred women who will benefit from chemo, or one of the 12 who will get metastatic disease no matter what, or I'm one of the 82 who don't need it. I know people who have decided against chemo based on various personal reasons, so as people say it's a very individual decision. I would ask your oncologist whether he or she has given chemo to people with lupus or knows of their response to treatment.",
      "MessageIndex": 6,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704318",
      "Title": "Oncotype not what the onc predicted lanihardage lanihardage"
    },
    {
      "AuthorID": "lanihardage…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65827/profile",
      "Content": "Apr 29, 2008 12:21AM lanihardage wrote: I consulted the local (one hour away) oncologist/internist, who does not credit the oncotype test and says it is too late for me to do chemo because (1) the magic window of opportunity (4-8) weeks after diagnosis is past, and (2) the other oncologist had started me on tamoxifen, which is supposed to come after chemo. He said I was welcome to see yet another oncologist, this time a breast cancer specialist 4 hours away, to see if they have some guidance in this \"uncharted territory.\" I'm so tired of being under-served by these so-called specialists! Don't ever move to the country and get sick.",
      "MessageIndex": 10,
      "PostDate": "29/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704318",
      "Title": "Oncotype not what the onc predicted lanihardage lanihardage"
    },
    {
      "AuthorID": "lanihardage",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65827/profile",
      "Content": "lanihardage wrote: I had a mastectomy Jan. 30 after IDC biopsy with dirty margins. Two weeks later, I saw an oncologist who said \"no chemo\" because small tumor, estrogen positive, no nodes, but she was OK doing the oncotype test at my request. She managed to make two months pass before I got my test results, but now I have a recurrence score of 28, which is 18% chance of metastatic disease within 10 years. She still says no chemo, but I know that everyone in the TAILORx study with a score over 25 is getting chemo, so now I'm thinking chemo is a pretty likely choice. Guess my onc (at a major cancer center) doesn't hold much stock in the oncotype test, because she quoted bad statistics to me--\"only 1.5% improvement within chemo\" but my reading of the genomic version of AdjuvantOnline is at minimum a 33% reduction in metastatic disease with chemo (statistically, that's going from 18% to 12%). BTW my age is 58 and we have four adopted kids from age 3 to 11, so I want to do what I can to minimize my risk. I'm seeing another oncologist for second opinion and preparing psychologically, if that is possible, for a long slog. I'm feeling rather let down and distrustful of the experts now. I'm in the uncomfortable position of second guessing the experts. Anyone been there? Dx 1/11/2008, IDC, 1 cm, 0/10 nodes, ER+/PR+, Her2-, oncoDx 28  Lani Dx 1/11/2008, IDC, 1cm, Stage I, Grade 3, 0/10 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704318",
      "Title": "Oncotype not what the onc predicted lanihardage lanihardage"
    },
    {
      "AuthorID": "lanihardage…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65827/profile",
      "Content": "Apr 29, 2008 02:02PM lanihardage wrote: Thanks, Harley, you are very reassuring. I'm so used to looking to doctors for answers, and it's hard to be in a place where they don't really know. I'm getting all my records reviewed  by a breast cancer specialist, and have to wait another 5 weeks for that. Thank you for your prayers. --Lani",
      "MessageIndex": 12,
      "PostDate": "29/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704318",
      "Title": "Oncotype not what the onc predicted lanihardage lanihardage"
    },
    {
      "AuthorID": "lanihardage…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65827/profile",
      "Content": "Apr 30, 2008 01:44PM lanihardage wrote: Well, I can't just go ahead with it. The local oncologist won't give me chemo unless a BC specialist gives him the go-ahead. My first oncologist, she of the totally incompetent office, is much further away but would give me chemo, presenting a dilemma. I will wait for the BestDoctors recommendation, which my local onc said he would follow. They will pass everything by a BC onc including all of my pathology slides for re-reading by a pathologist.",
      "MessageIndex": 14,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704318",
      "Title": "Oncotype not what the onc predicted lanihardage lanihardage"
    },
    {
      "AuthorID": "lanihardage…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65827/profile",
      "Content": "Apr 30, 2008 01:44PM lanihardage wrote: Well, I can't just go ahead with it yet, unfortunately. The local oncologist won't give me chemo unless a BC specialist gives him the go-ahead. My first oncologist, she of the totally incompetent office, is much further away but would give me chemo, presenting a dilemma. I will wait for the BestDoctors recommendation, which my local onc said he would follow. They will pass everything by a BC onc including all of my pathology slides for re-reading by a pathologist. But thank you for the encouragement!",
      "MessageIndex": 15,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704318",
      "Title": "Oncotype not what the onc predicted lanihardage lanihardage"
    },
    {
      "AuthorID": "lanihardage…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65827/profile",
      "Content": "Aug 13, 2008 02:12AM lanihardage wrote: I gave the link (breastcancerupdate) above. It is probably 1% for those at the lowest end of intermediate.",
      "MessageIndex": 29,
      "PostDate": "13/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704318",
      "Title": "Oncotype not what the onc predicted lanihardage lanihardage"
    },
    {
      "AuthorID": "lanihardage…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65827/profile",
      "Content": "Aug 12, 2008 08:57PM lanihardage wrote: Well, adjuvantonline.com has removed (grayed out the link) that used to do the calculation based on your oncotype-- it worked a few months ago! But if you look at the results of this clinical trial by Paik (www.breastcancerupdate.com/mia... you see that intermediate range of 18-30 had a 1% benefit from chemo and the high range (greater than 31) had a 28% benefit. Obviously there was not a jump between 1% at a score of 30 and 28% at a score of 31, which is why the TailoRx is using different ranges and looking at the benefits within a range. My guesstimate of my score of 28 is something like a 5-10% benefit, but we won't really know until the TailorX completes.",
      "MessageIndex": 27,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704318",
      "Title": "Oncotype not what the onc predicted lanihardage lanihardage"
    },
    {
      "AuthorID": "lanihardage…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65827/profile",
      "Content": "Apr 25, 2008 02:27PM lanihardage wrote: I see a second oncologist Monday and expect to get chemo in May. My biopsy was in January, followed by a mastectomy, but my first oncologist thought I didn't need chemo. She agreed to my request for the oncotype Dx but took two months instead of two weeks to do it. I have a fairly high risk of distal recurrence (aka metastasis), and even though she didn't think I need chemo. But everyone in the large national trial TAILORx with my oncotype score gets chemo, so I'm probably going to join the club. I cried my eyes out a few days ago and am better now, for the moment. My kids have a good book about moms with cancer, and I'm hoping they help keep me grounded and not too depressed during the process. They are ages 3, 7, 9 and 11.",
      "MessageIndex": 23,
      "PostDate": "25/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "lanihardage…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65827/profile",
      "Content": "Apr 26, 2008 02:31PM lanihardage wrote: Thanks, Robin. I have a partner who is determined to do whatever we need, and some friends who helped out when I was recovering from my mastectomy. It's hard to know how much I'll need until I'm there! Lauren, thanks for sharing your recent experiences with your kids. I'm already freaked out about my hair, and looking at hats was a cheering experience.",
      "MessageIndex": 34,
      "PostDate": "26/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    }
  ]
}