{
  "AuthorID": "Laratee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231112/profile",
  "Posts": [
    {
      "AuthorID": "Laratee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231112/profile",
      "Content": "Apr 3, 2016 04:20PM Laratee wrote: I guess I'm crazy but I've already basically diagnosed myself with Invasive breast cancer just by using Google. I know that's stupid. But really what else could it be. A lump that looks suspicious on ultrasound and a swollen lymph node. I feel so scared and hopeless. And haven't even had the biopsy yet.",
      "MessageIndex": 3,
      "PostDate": "03/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/842731",
      "Title": "Scared. 2 questions Laratee"
    },
    {
      "AuthorID": "Laratee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231112/profile",
      "Content": "Laratee wrote: 1. Is it possible for the radiologist NOT to be able to distinguish a lymph node from some other type of lump on an ultrasound? 2. Is it possible to have a lump of some sort that is NOT cancer, and still have an enlarged lymph node in the axilla? My lump feels just like a lymph node to me. I'm the queen of swollen lymph nodes, for some reason. Had mono as a kid, and one in my neck has never gone down. I used to get them in other places for no apparent reason too. This one FEELS like a lymph node. But radiologist wants it biopsied. :( SO SCARED. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/842731",
      "Title": "Scared. 2 questions Laratee"
    },
    {
      "AuthorID": "Laratee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231112/profile",
      "Content": "Apr 2, 2016 11:04PM Laratee wrote: Thank you for your input, Melissa.",
      "MessageIndex": 2,
      "PostDate": "02/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/842731",
      "Title": "Scared. 2 questions Laratee"
    },
    {
      "AuthorID": "Laratee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231112/profile",
      "Content": "Apr 3, 2016 05:39PM Laratee wrote: I guess I just read a ton of stuff....and so much of it saying that a mass with a swollen lymph node very often indicates IBC...I honestly don't know all the types of breast cancer and know very little about all this. I have been looking for something to convince me there's a good chance it's something OTHER than cancer. It's hard to find anything encouraging. :( I don't mean to be a downer. But I am terrified. This \"mass\" that I assumed was a lymph node has been there for many months, maybe 2 years even (with no change, by the way). My PCP sounded so discouraging on the phone and to hear the words \"suspicious for malignancy\"....knowing I also have a swollen lymph node............well, that just sent me on a spiral. I'll admit I don't know what I'm talking about.",
      "MessageIndex": 8,
      "PostDate": "03/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/842731",
      "Title": "Scared. 2 questions Laratee"
    },
    {
      "AuthorID": "Laratee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231112/profile",
      "Content": "Apr 3, 2016 07:45PM Laratee wrote: Invasive is what I said. Not inflammatory. I know even less about inflammatory than I do about invasive.....or any other type for that matter. :( I just know I have had a lump for quite some time that I thought was a node, and then found a lymph node recently, and have been in a tailspin ever since I saw my MD. :( I would like to educate myself but the more I read the more scared I get. I'm probably not reading the right stuff. I am definitely scheduling my biopsy tomorrow as soon as they open.",
      "MessageIndex": 11,
      "PostDate": "03/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/842731",
      "Title": "Scared. 2 questions Laratee"
    },
    {
      "AuthorID": "Laratee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231112/profile",
      "Content": "Apr 3, 2016 08:39PM Laratee wrote: Thank you for all the responses and all of the information. There's no better education on a topic than from someone who's been there. This is a good group. Thanks again.",
      "MessageIndex": 14,
      "PostDate": "03/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/842731",
      "Title": "Scared. 2 questions Laratee"
    }
  ]
}