{
  "AuthorID": "Larlaw",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262187/profile",
  "Posts": [
    {
      "AuthorID": "Larlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262187/profile",
      "Content": "Jan 10, 2019 05:35AM Larlaw wrote: Update that I had an appointment with my dr this morning (completely unrelated) but she did an exam while I was there. She felt it was the same spot as last year although its more of a lump now. Most likely fat necrosis. She said you could move it around and its just under the skin and that she didn't think it was anything to be worried about. She's going to recommend that I get it removed regardless.",
      "MessageIndex": 1,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869244",
      "Title": "More folllow up a year later Larlaw Larlaw"
    },
    {
      "AuthorID": "Larlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262187/profile",
      "Content": "Jan 31, 2019 09:41AM Larlaw wrote: Just on the off chance that anyone finds this thread in a search all was well in the end.",
      "MessageIndex": 2,
      "PostDate": "31/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869244",
      "Title": "More folllow up a year later Larlaw Larlaw"
    },
    {
      "AuthorID": "Larlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262187/profile",
      "Content": "Larlaw wrote: Hi all I was here in late 2017 after my first mammogram. At that time there was a spot of asymmetry found in my left breast and I had follow up of spot compressions, ultrasound and MRI. It was determined to be scar tissue (I had a huge bruise on that breast a few months before - I think it was from a tv when we were moving). I had follow up 6 months later and had no call back. I just had another follow up mammogram and got called back for an ultrasound for the same spot as last year. My question is why are they following up if its unchanged? Is it to confirm its unchanged or that its not hiding something else? My dr mentioned something about looking at it from another angle or something. Thanks! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869244",
      "Title": "More folllow up a year later Larlaw Larlaw"
    },
    {
      "AuthorID": "Larlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262187/profile",
      "Content": "Jan 13, 2019 08:01PM Larlaw wrote: I've struggled with anxiety pretty much my whole life but the last few years have been awful. Ever since I found out I'm infertile I feel like doctor's will have only bad news and not good. I fell apart last year after my first screening mammogram when they found my scar tissue (after a diagnostic mammogram, ultrasound and mri). 2 different radiologists looked at the mri and both said it was scar tissue. My family dr felt it afterwards as well and said it didn't feel concerning. I didn't get called back after my 6 month check up but have gotten called back for another ultrasound after my year followup. My family dr said its for the same spot so I shouldn't be concerned as I had the all clear last year but I keep going over worst case scenarios - that my family dr isn't telling me the whole truth or is flat out lying to me because she knows how I panic, that it's gotten bigger, that they were wrong last year, etc. It goes on. I know from the counselling I've been to that this is totally my anxiety at play. That most likely they are just being diligent at keeping an eye on this lump of dead tissue in my breast.",
      "MessageIndex": 152,
      "PostDate": "13/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "Larlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262187/profile",
      "Content": "Nov 14, 2017 12:36PM Larlaw wrote: I'm right there with you. Waiting is the worst. So is googling so stay off the internet as much as you can. I've been bad at that and it panics me every time I look. I'm getting an MRI tomorrow - usually its a 3 month wait at least but the radiologist went to med school with my best friend and is fitting me in. Hoping for good results for both of us. Hugs.",
      "MessageIndex": 3,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860093",
      "Title": "So scared.... waiting samzie24 Larlaw"
    }
  ]
}