{
  "AuthorID": "LASHON2008",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69005/profile",
  "Posts": [
    {
      "AuthorID": "LASHON2008",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69005/profile",
      "Content": "Aug 1, 2008 04:18AM LASHON2008 wrote: HI ladies.. Well i am having my port put in today.. getting ready to go as we speak.. I am having the neo adjuvant was well.. very nervous about it but praying for the samy results. i start thursday.. would like to keep in contact with you ladies to chat and see how things are goin.",
      "MessageIndex": 7,
      "PostDate": "01/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/709810",
      "Title": "Anyone done neoadjavant chemo? mommy3abm Joyceska"
    },
    {
      "AuthorID": "LASHON2008",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69005/profile",
      "Content": "Jan 9, 2009 06:07PM LASHON2008 wrote: HI i had the Neo. My cancer went from 7 com x 7 cm to 2cm x 2 cm and the place in my neck and under my chin went away completely. my pet scan and mri came back with nothing but the mass in my breast of 2 cm still showing.. i know it was only by the grace of god that it happend. I have surgery on the 22nd of this month. i am have a double just to be on the safe side with radation after.",
      "MessageIndex": 13,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/709810",
      "Title": "Anyone done neoadjavant chemo? mommy3abm Joyceska"
    },
    {
      "AuthorID": "LASHON2008",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69005/profile",
      "Content": "LASHON2008 wrote: I am 26 and i have breast cancer. They want me to do the chemo first because i have a larger tumor plus my lymph nodes are in question. I dont know if this is the right thing to do. i cant find a lot of information on this. they say that the biggest cause of death is that is spreads to other parts.and they want to try to shrink it so the surgery want be so hard.  I am very concerned due to i am an african american female with it at a young age. can anyone help. I will say of the Lord \"He is my refuge and my fortress, my God in whom I trust.\" Dx 7/1/2008, IDC, 6cm+, Stage IV, 4/8 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/709299",
      "Title": "CHEMO BEFORE SURGERY LASHON2008 BMac"
    },
    {
      "AuthorID": "LASHON2008",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69005/profile",
      "Content": "Jul 18, 2008 02:47PM LASHON2008 wrote: They told me i have IDC. and i just had an mri and a ct scan done. but i go next week to have a pet scan and a mamo. dont know about the possible triple neg. but thats the thing i am affraid of the most.  and after those other test are done i guess i will know more.",
      "MessageIndex": 2,
      "PostDate": "18/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/709299",
      "Title": "CHEMO BEFORE SURGERY LASHON2008 BMac"
    }
  ]
}