{
  "AuthorID": "lassman",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
  "Posts": [
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Dec 17, 2011 03:58AM lassman wrote: Hi, Have been on Xeloda for six months now and my SE's similar to nancyh. Bit of nausea which I control with anti-sickness meds and some tiredness. I always take the pills after food which helps with the nausea. So far feet and hands ok, although have had a few nail infections on big toe (not sure if related). I do still moisturise my feet just in case of problems though. I started taking B6 and this has made me feel better all over. I am on 14 days on 7 off regime. Taking 4000mg a day. Sometimes get excessive tearing with the eyes but this is intermittant and I put eye drops in when I get it. Not too bad really.  Lassman",
      "MessageIndex": 16,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779595",
      "Title": "Xeloda - Your Side Effects and What You Do To Alleviate Them NMM lsacrowe"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Feb 21, 2012 09:52PM lassman wrote: Rohm, I am also battling recurrent brain mets. Had WBR in June last year, which worked for a while, but MRI in December showed recurrence (despite being on tykerb and Xoleda). Had gamma knife a few weeks ago and hoping that will be more successful. You are the first person I have come across who just has it in the brain and no-where else. I am in the same boat. Brain but no-where else. Lassman ",
      "MessageIndex": 20,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782964",
      "Title": "Ugh! Brain Mets are Back! Rohm dellmonica"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Mar 5, 2012 02:41AM lassman wrote: What the...she was texting only a short time ago! Can't believe she has gone. I will miss her, rest in peace sister and condolences to her family. Lassman ",
      "MessageIndex": 20,
      "PostDate": "05/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783636",
      "Title": "Sad news alesta29 steelrose"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Sep 17, 2011 02:11AM lassman wrote: Hi pq2, Real bummer about your news. I know how scary it can be when diagnosed with brain mets. I was diagnosed in May this year and doing ok so far. Don't lose hope, your not dead yet! I'm hoping to prove them all wrong by lasting as many years as possible. We are here for you.  Lassman   ",
      "MessageIndex": 7,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774874",
      "Title": "Feedback please -- just diagnosed with brain mets pq2 T-mac"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Dec 18, 2010 01:47PM lassman wrote: Dear Schwartzina, I was in a similiar situation to you and your diagnosis almost the same as mine. I wanted a masto at first but surgeon talked me into doing neo-adjuvant therapy to try and shrink my tumour. Glad I did as I also had a complete response. Latte is right that once you have a mastectomy you can never go back. However, if you change your mind down the line you can always opt for the masto. Masto versus lumpectomy must be the hardest decision any woman can face. I did extensive research and all the info i came across said the mast v lump makes no difference to survival rates. There is, however, a slightly greater chance of a recurrance with a lumpectomy, although even this is small, especially if combined with rads. I decided I would take my chances and go with lumpectomy. Hope this helps you decide what to do. Best wishes Lassman    ",
      "MessageIndex": 3,
      "PostDate": "18/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/762188",
      "Title": "Lumpectomy w/ Radiation or Mastectomy w/ Radiation schwartzina riley702"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Apr 3, 2011 04:52AM lassman wrote: Loopey,  I also had a blue area that looked like a bruise (caused by the blue dye that they inject at the sentinel node biopsy stage). Mine lasted a year before finally dissapearing! The bottom half of my breast also went bright red and hot. This was no-where near the incision site from my lumpectomy. Eventually this also went away but some residually redness remains even now. They think it is mild breast lymphodoeama. Hope this helps.",
      "MessageIndex": 3,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762765",
      "Title": "Pink Skin on Breast loopey lassman"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Jul 8, 2011 10:22AM lassman wrote: Hi Suzanne, I know how you feel. I was diagnosed with 7 brain mets some weeks ago and am still reeling. It is the most awful thing to hear and i am sending hugs your way. Please send me messages if you want to compare notes on how you feel - or for any other reason. I had 5 WBR which caused me a lot of fatigue, but recovering some strength now. Also hair almost gone now. I continued with my herceptin today and i will start Xoleda tomorrow.  Soon they intend to stop the Herceptin and change to Tykerb. Let's hope we can sap the buggers! Louise",
      "MessageIndex": 21,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771310",
      "Title": "Brain Mets--Add Another Member to the Club sdisilvestri MJLToday"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Oct 26, 2011 03:15PM lassman wrote: Hang in there. As you can see, the ladies on this site are amazing and can offer a lot of encouragement and advice. Me, diagnosed with brain mets in may this year and doing well so far. Had WBR in May and now on Xoleda and tykerb which seems to be working. Lassman",
      "MessageIndex": 14,
      "PostDate": "26/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772042",
      "Title": "Searching for Brain Mets sisters Cathy1964 chainsawz"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "lassman wrote: Dear Ladies, Disaster has struck. Got rushed to hospital the other day. They thought i had had a stroke but a CT scan showed cause was mets to the brain (7 in all). I had a battery of tests to check for further spread in the body. Got the results back this morning and they confirm no (no) spread elsewhere. Bones/lungs/liver etc all clear. At least that is something. I start radiotherapy next week on brain. They will try and shrink the buggers. Hope it works. I will be moving to the stage 4 forum now and hope they can offer me some sage advice...I am well gutted... Best of luck to the rest of you - hope you don't end up in my situation. Lassman  Dx 4/5/2010, IDC, 3cm, Stage IIB, Grade 3, 1/12 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/769784",
      "Title": "Moving to stage 4 lassman edwards750"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Sep 6, 2011 02:29PM lassman wrote: Carpediemocc, Hang in there. I was diagnosed with brain mets in May this year. Had 5 WBR and found it made me feel really fuzzy/buzzy in the head, but did wear off after a while (about 3 weeks before i thought i was back on planet Earth). Was doable though and suspect the dex was partly responsible for some of my symptoms. I am intending to give up work if possible. As Chainsawz says, you need your strength to fight the cancer. Just need to pursuade them to medically retire me now. I do hope you find the support you need. Lassman ",
      "MessageIndex": 17,
      "PostDate": "06/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774089",
      "Title": "Brain mets diagnosis carpediemocc Lena"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Jun 2, 2011 03:35PM lassman wrote: Thanks for the posts ladies. it's making me feel so much more positive. I am still feeling numb at the moment..how could this awful thing have happened to me! Encouraging to hear about your mothin-in-laws friend - trying to stay positive but v hard when i see how upset husband is. Never wanted to hurt him... Lassman",
      "MessageIndex": 6,
      "PostDate": "02/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/769784",
      "Title": "Moving to stage 4 lassman edwards750"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Jun 8, 2011 03:46AM lassman wrote: Thanks profbee, i'll let you know what happens. You are right, at least we have a very \"popular cancer\" so they chuck everything at it. I was wondering what the Tykerb would do - guess different for everyone though. I am soon to join you in the bald department! I have been there once though - so dust off my wigs... Lassman ",
      "MessageIndex": 13,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/769784",
      "Title": "Moving to stage 4 lassman edwards750"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Jun 3, 2011 01:38AM lassman wrote: Thanks for your kind words profbee - I was gutted for my husband when i first got diagnosed as he was so upset then- Now he is devestated and keeps bursting into tears when he looks at me. I guess i am lucky to be so loved - we have always been soulmates. I'm hanging in here - just. I know these posts worry others as well - we all dread hearing this sort of thing and the \"sword of damocles\" hangs over all of us. Lassman",
      "MessageIndex": 8,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/769784",
      "Title": "Moving to stage 4 lassman edwards750"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Jun 7, 2011 07:33AM - edited Jun 7, 2011 07:34AM by lassman Profbee/Greenacres, Thanks for your kind words once again. I had a consultation with the ONC yesterday and they seemed quite upbeat. I start 5 WBR tomorrow and then they will monitor progress with an  MRI when all has settled down. I will also be getting Tykerb afterwards since I am HER2. Hubby seems more cheerful after the consulatation as well. It gave him some hope at least. God, please let this work!!! Louise ",
      "MessageIndex": 11,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/769784",
      "Title": "Moving to stage 4 lassman edwards750"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Feb 8, 2012 10:10PM lassman wrote: Chainsawz, Good luck with your next round of treatment. I was really hoping it was radiation necrosis and not breast tumour re-growth. So sorry. You have been my rock on this board and i expect it to continue. Let me know how it all goes for you. Lassman ",
      "MessageIndex": 87,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782258",
      "Title": "friggin brain biopsy results :< chainsawz AnacortesGirl"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Jan 1, 2012 01:49AM lassman wrote: Jenn 3, Just posted some info on the brain mets forum. Hugs to you and sorry you had to join the brain mets club. Lassman",
      "MessageIndex": 4,
      "PostDate": "01/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780266",
      "Title": "It has spead to my brain...... jenn3 lwd"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Oct 10, 2011 10:12PM lassman wrote: I am on Xeloda and also find my side-effects ebb and flow. Feel fine some days, really tired the next. Each day is different. I find mornings are the worse for me, better in the evenings. I have not had any handd/foot problems as yet. On my fifth dose of Xeloda so not sure when hand/foot kicks in? Have had acid indigestion problems though so taking anti-acid meds for that. Lassman",
      "MessageIndex": 5,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776190",
      "Title": "Side Effects: The Gift That Keeps Giving clemson93 cmhartley"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "lassman wrote: Hi Ladies, Have not been on the site for a while as I have been on holiday for two weeks. Needed to get away - change of scenery etc. Just wanted to update you on the brain mets situation. Saw my onc today who said latest MRI showed that there were only two lesions remaining of the original seven. He said one of these is actually a cyst and not a tumour at all! So then there was one...at 9mm lesion with no oedema - i thought all brain mets have some oedema? This has also shrunk. So it's on with the Xoleda and Tyverb and hope they stay away! Good news - i hope it lasts.  Body scan in a few weeks so expect serious scanxiety post. Next MRI might be interesting as well. Lassman Dx 4/5/2010, IDC, 3cm, Stage IIB, Grade 3, 1/12 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774277",
      "Title": "Brain mets - latest lassman china"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Jan 4, 2012 09:40PM lassman wrote: Jenn, My onc started me on chemo after my WBR. Did not want to start whilst i was having the radio treatment. Put me on Xoleda and Tyverb afterwards. The WBR is usually very effective. My brain mets have gone bar a small (3mm) spot. I am 6 months out from the WBR and doing ok so far. Hope the radiation kicks cancer ass for you. HUGS. Lassman ",
      "MessageIndex": 90,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780266",
      "Title": "It has spead to my brain...... jenn3 lwd"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Mar 12, 2012 01:39PM lassman wrote: Steelrose, I was half way through a degree when BC interupted. I am planning to restart this year and see how I go. I say go for it if you feel well enough. Lassman",
      "MessageIndex": 7,
      "PostDate": "12/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784000",
      "Title": "Anyone pursuing a degree? Or dreaming of it? steelrose Heidihill"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Dec 3, 2011 05:06PM lassman wrote: Hi All, I live in the UK and this site has saved my sanity! My story - Initial diagnosis was in May 2010. I was IDC stage 2b to begin with. Had a good response to initial treatment and thought i might get away with mets - wrong - 8 months later diagnosed with brain mets. I was 47 when i got my stage 4 dx. Now 48 and have been on Xoleda and Tyverb for six months. So far so good. Lassman",
      "MessageIndex": 68,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Sep 10, 2011 09:57AM lassman wrote: Hi Hezzy, Oedema is the fluid that collects around metatastic brain tumours. I think I spellled it wrong (might be edema). Not another drug unfortunatly. I am also on same drugs as you. Have you had any further scans to check your dizziness? The drugs themselves can cause dizziness somethimes. Lassman",
      "MessageIndex": 15,
      "PostDate": "10/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774277",
      "Title": "Brain mets - latest lassman china"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Jan 14, 2012 02:05AM lassman wrote: Jenn3, I know exactly how you feel. I am pretty much in the same boat. When i was diagnosed I was certain i would be dead in 6 months - that was six months ago... I was diagnosed in May 2010 and  was zapped with WBR. It worked really well and tumours almost dissapeared apart from one small 3mm spot. Unfortunatly 4 of the mets have since reappeared so the chemo drugs have failed. At least it did buy me six months almost cancer free. Just got to try and get rid of these new ones now. I do have days when the despair hits me. This disease is so unfair and the uncertainty is the worst of it all. Thinking of you. Lassman",
      "MessageIndex": 144,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780266",
      "Title": "It has spead to my brain...... jenn3 lwd"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Jan 31, 2012 03:32PM lassman wrote: Hello, I found this website in 2010 when first diagnosed with Stage 2B breast cancer. What a godsend it was as well. Lots of helpful advice from all the ladies which was much appreciated. Unfortunatly I am now stage 1V with brain mets so still getting much needed advice and support. Lassman",
      "MessageIndex": 22,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781871",
      "Title": "...And you are? EnglishMajor keepingon"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Jul 13, 2011 05:50PM lassman wrote: Dear Lynn1 and Justjudie, Well I am nearly at the end of my first weel of Xeleda and so far minimal side effects (just a bit of fatigue). I am thinking I may go on my trip after all if I still feel allright.  have MRI on the 27th and sweating big time... How are you guys getting on with the treatment? Was being a little dense about the D'Nile thing, get it now! Lassman ",
      "MessageIndex": 28,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771215",
      "Title": "Family Denying Reality.... CoolBreeze lassman"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Feb 13, 2012 11:05PM lassman wrote: Hi Chainsawz, Just to let you know I am thinking about you. Hope the WBR is going ok. Give us an update when you feel up to it. Hugs to you. Lassman  ",
      "MessageIndex": 125,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782258",
      "Title": "friggin brain biopsy results :< chainsawz AnacortesGirl"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Jan 4, 2012 05:19PM lassman wrote: Redwolf, I don't think you need to be too concerned, especially if the onc isn't.  A couple of weeks should not make much difference, especially since you are still on Xeloda which should keep the beast at bay in the meantime. Lassman ",
      "MessageIndex": 3,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780454",
      "Title": "Looking for reassurance/advice on \"washout\" redwolf8812 redwolf8812"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Feb 1, 2012 06:16PM lassman wrote: I had WBR six months ago but now about to try Gamma Knife (same as stereostatic radiation treatment I believe) as my tumours have progressed. It is considered very effective and fairly safe. I fought to get it. Should be plenty of info on internet and sure others will come along to offer advice. Lassman     ",
      "MessageIndex": 8,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781968",
      "Title": "Stereostatic Radiosurgery dclark3748 ruthevans41"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Aug 11, 2011 05:57PM lassman wrote: Sandiedbella, I was diagnosed with brain mets in May this year. My symptoms were numbness and tingling on side of face. Also down right arm and leg. Main symptom though was a total inability to talk. Just came out as gobbledygook. Eventually speech returned on its own. Really hope your results show nothing  and it is just sinusitus or allegies. Let us know what happens. Sending you cyber hugs for luck. Lassman",
      "MessageIndex": 1,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/772992",
      "Title": "symptoms of brain mets? sandiedbella sandiedbella"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Jul 6, 2011 02:07PM - edited Jul 6, 2011 02:08PM by lassman Hello all, Yep, know all about denial. Family can't seem to accept how serious my situation is.  Lynn1 - Sorry the chemo has ruined your Nile trip. Looks like my trip to France/Italy may be scuppered for the same reason. I start chemo (Xoleda) on Friday for my brain mets.What sort of chemo are you going to go on? Lassman",
      "MessageIndex": 20,
      "PostDate": "06/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771215",
      "Title": "Family Denying Reality.... CoolBreeze lassman"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Dec 22, 2010 02:17PM lassman wrote: Angel180, Sometimes a hard lump under the scar is caused by a haematoma. My incision area went rock hard 8 days after surgery and it scared the hell out of me! Had a sono done and she confirmed it was a massive haematoma, she drained it whilst I was there. Was kinda weird watching it shrink on the screen! My nipple went east after surgery! Now after 3 months it's gone back to normal. Boob still itches and zaps though!. Lassman",
      "MessageIndex": 11,
      "PostDate": "22/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761066",
      "Title": "Lumpectomy - breast still lookes weird InTwoPlaces lassman"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Dec 17, 2011 06:32AM lassman wrote: I became an eating machine on decradon! I thought of food all the time and really looked forward to lunch/dinner. Lay awake at night thinking about pan fried scallops and cheesburgers! Did put on some weight but lost it all once i stopped decradon. Now I have no appetite at all! Oh well... Lassman",
      "MessageIndex": 22,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779609",
      "Title": "pigging out: decadron or apprehension K-Lo 3rings"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Dec 7, 2011 06:33PM lassman wrote: Susansdot, The radiation continues to work for some time after WBR. I was told that things could get worse before they got better re symptoms. There is a lot of swelling after WBR and the more rads you have the worse symptoms can be. They would not scan me until eight weeks had passed before seeing if it had worked or not. Hang on in there! I agree with banjobanjo. Interogate your onc/radiologist as well! Hugs Lassman ",
      "MessageIndex": 2,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779177",
      "Title": "Brain mets and WBR Susansdot Bernicky"
    },
    {
      "AuthorID": "lassman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115390/profile",
      "Content": "Dec 18, 2011 03:35PM lassman wrote: Hi Smilingdeb, I had a MUGA scan on Friday. It's basically an ultrasound of the heart to make sure it is functioning properly, since Herceptin can weaken it. They will check your \"ejection fraction\" which tells them how strong your heart muscle is. I have one every three months. As tests go it is a complete doddle (just have to rub lots of sticky goo off your chest afterwards!). I doubt they will check your lung with this scan. Hope this is helpful. Lassman",
      "MessageIndex": 1,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779713",
      "Title": "Having my 1st MUGA Scan and have questions smilingdeb Outfield"
    }
  ]
}