{
  "AuthorID": "LauraW68",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
  "Posts": [
    {
      "AuthorID": "LauraW68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
      "Content": "Nov 5, 2014 05:24PM - edited Nov 5, 2014 06:56PM by LauraW68 Update: Bone scan and the CT scan were clear! Nothing anywhere else unless there's a cell or more floating around looking for a place to land and start a tumor. Doctors still want to do chemo since that may be the case being one of the lymph nodes involved showed it had broke through the wall. I had 3 of 15 lymph nodes test positive for cancer. Saw the medical oncologist on Monday, November 3rd. I'll have an echo on the 20th then and a port placement on the 21st. Then my first chemo treatment will be December 1st. I'll have 4 treatments (1 every 2 weeks) of AC (doxorubicin and cyclophosphamide) and then 12 weeks of Paclitaxel aka Taxol.  I will have to take the Nuelasta shot as well. The talk of Radiation was thrown in there but not sure how many rounds. Then take the hormone blocking pill for 10 years he said. So I'll actually be joining in the December Chemo group.  I am not looking forward to being bald in winter. lol",
      "MessageIndex": 82,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "LauraW68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
      "Content": "Nov 1, 2014 11:00PM - edited Nov 5, 2014 06:57PM by LauraW68 I was told I would start chemo 4 weeks from my surgery day (October 24) so that makes it sometime around the week of Thanksgiving. I won't know anything for certain though until the results of my bone scan I did yesterday, the 31st is back. I have a CT scan scheduled for Monday morning and then I see the medical oncologist Monday afternoon. So it's all still up in the air as to when, how long, what meds, etc.   If it is going to happen the week of Thanksgiving though, I am going to ask if we can delay until first week of December. I'd rather be able to spend Thanksgiving with friends and family instead of dealing with a chemo port, etc. that week.  We usually drive 4 hours to go to be with our families anyway, I'd rather go on that drive there and back in somewhat relative comfort. Update: Bone scan and the CT scan were clear! Nothing anywhere else unless there's a cell or more floating around looking for a place to land and start a tumor. Doctors still want to do chemo since that may be the case being one of the lymph nodes involved showed it had broke through the wall. I had 3 of 15 lymph nodes test positive for cancer. Saw the medical oncologist on Monday, November 3rd. I'll have an echo on the 20th then and a port placement on the 21st. Then my first chemo treatment will be December 1st. I'll have 4 treatments (1 every 2 weeks) of AC (doxorubicin and cyclophosphamide) and then 12 weeks of Paclitaxel aka Taxol. I will have to take the Nuelasta shot as well. The talk of Radiation was thrown in there but not sure how many rounds. Then take the hormone blocking pill for 10 years he said. So I'll actually be joining in the December Chemo group. I am not looking forward to being bald in winter. lol",
      "MessageIndex": 36,
      "PostDate": "01/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "LauraW68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
      "Content": "LauraW68 wrote: This Post was deleted by LauraW68. Laura Dx 9/24/2014, ILC, 6cm+, Stage IIIA, Grade 2, 3/15 nodes, ER+/PR+, HER2- Surgery 10/24/2014 Lymph node removal: Right, Underarm/Axillary; Mastectomy: Right; Prophylactic mastectomy: Left; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Chemotherapy 12/1/2014 AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826041",
      "Title": "Feedback please on this. LauraW68 LauraW68"
    },
    {
      "AuthorID": "LauraW68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
      "Content": "Nov 5, 2014 10:14AM - edited Nov 6, 2014 06:04AM by LauraW68 Thank you.   We do have friends who have and probably would again help out with the homeschooling. I guess I really  just needed to hear someone else other than the doctors tell me, yes, do this to prevent a re-occurrence. I called my PS and left a message for his nurse.  Can't figure out how to undelete my original post. I didn't want to sound like I'm whining, so I deleted it. Edited to add... can't edit my first post as there's not an option but thanks to the Moderators for posting my full post below:    Can't seem to post it in that post, but Laura, see if you can edit. I had a bone scan Friday, October 31st. It came back clear. I had a CT scan on Monday, November 3rd. It came back clear Those showed there were no cancer tumors anywhere else in my body. I had 3 of 15 lymph nodes removed test positive for cancer with one of the lymph nodes showing that cancer had broken through. There's a possibility of a cancer cell or more floating around looking for a place to land and start a tumor. 50% chance. I Saw the medical oncologist on Monday, November 3rd. I'll have an echo on the 20th then and a port placement on the 21st. Then my first chemo treatment will be December 1st. I'll have 4 treatments (1 every 2 weeks) of AC (doxorubicin and cyclophosphamide) and then 12 weeks of Paclitaxel aka Taxol. I will have to take the Nulasta shot as well. The talk of Radiation was thrown in there but not sure how many rounds. Then take the hormone blocking pill for 10 years he said. So I'll actually be joining in the December Chemo group. I am not looking forward to being bald in winter. lol I guess what I am asking, is this... I'm really concerned about being sick with the chemo drugs and trying to care for our 6 children at home as well as I homeschool. I'm almost to the point of telling the doctors that I don't want to do the chemo and radiation, etc. and just go to the hormone blocking pill. I have already had my bilateral mastectomies (on October 24th) with tissue expanders. I got two of my drains out yesterday and my first fill of 50cc. I'm nauseated today, threw up a little, and have diarrhea (sorry probably TMI). I'm crying as I type this. I just don't know what to do. I don't want to be so sick I can't homeschool and take care of my children. I took my temp and it's 99.1. I don't feel achy or anything. I thought about calling the doctor but don't want to sound like a whiner. Please any suggestions or thoughts.",
      "MessageIndex": 2,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826041",
      "Title": "Feedback please on this. LauraW68 LauraW68"
    },
    {
      "AuthorID": "LauraW68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
      "Content": "Nov 21, 2014 08:29PM LauraW68 wrote: I was diagnosed as ILC Stage 3a, grade 2 ER+, PR+, HER2- on 9/22/14. Bilateral Mastectomy 10/24/14 with sentinel nodes and axillary nodes removed. I had 3 of 15 lymph nodes test positive with one of them having the walls breached. I had my port placement surgery today. I start chemo December 1st. AC - 1 treatment every other week for 4 treatments then Taxol at 1 a week for 12 weeks after that radiation. I'll also be taking Tamoxifen for 10 years according to the MO. I was told I have a 50% chance some cancer cells could be floating around in my body so that's why the need for chemo, etc. and there's always the 50% chance of recurrence.",
      "MessageIndex": 634,
      "PostDate": "21/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "LauraW68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
      "Content": "Nov 7, 2014 05:07AM LauraW68 wrote: They told me 4 weeks after surgery. That may vary from dr. to dr and patient to patient though.",
      "MessageIndex": 1,
      "PostDate": "07/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826073",
      "Title": "When can I start chemo After masectomey Cookies Leighku"
    },
    {
      "AuthorID": "LauraW68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
      "Content": "Nov 6, 2014 08:51AM LauraW68 wrote: I'm ILC Stage IIIa. My tumor was 7.2 cm   I see so many IDC mentioned on the facebook breast cancer sites, in ads, etc. but not many with ILC because it's not as common. I know we exist just wish we were more prominently spoken for too since ILC has a way of getting missed on mammograms and ultrasounds until they are big enough to form a thickening \"lump\", dimpling of the skin, and/or nipple retraction... which is all of three ways I found mine even after doing monthly self exams. I was a big chested girl with lots of dense tissue and only found mine by the Grace of God. I felt like something was biting me under the arm and looked in the mirror and saw the dimpling on the side of my right breast then felt the big lump and two days later noticed the nipple retraction.   Women need to know that breast cancer can come in more than one form or fashion so to speak.",
      "MessageIndex": 11,
      "PostDate": "06/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/825862",
      "Title": "Mad tonight at Susan Komen JudyO april485"
    },
    {
      "AuthorID": "LauraW68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
      "Content": "Nov 6, 2014 06:03AM - edited Nov 6, 2014 06:10AM by LauraW68 Thanks Moderator! I got a call back from the nurse at the dr. office yesterday and said I may be trying to catch a bug going around as the what I was experiencing wouldn't be related to the first TE fill.     After work, Hubby brought me home some gingerale and some anti-nausea medicine last night though just in case I didn't feel good today.  This morning I feel better, just ate a little bit ago but now tummy feels queasy.  Gonna get a glass of ginger ale and then sit down to school work with the children. I'm sure I'll feel even better when the last two drains come out on Tuesday.  I miss being able to sleep on my side. I have never been a back sleeper.",
      "MessageIndex": 8,
      "PostDate": "06/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826041",
      "Title": "Feedback please on this. LauraW68 LauraW68"
    },
    {
      "AuthorID": "LauraW68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
      "Content": "Nov 28, 2014 08:50AM LauraW68 wrote: My tissue was not even sent for the Oncotype testing. I asked if I had an oncotype score and was told since I had a ILC with a 7.2cm tumor and 3/15 lymph nodes test positive for cancer with one have its walls breached, that an oncotype score was not necessary and I would have to have chemo and radiation based on those factors alone. I now wish I had spoke up before surgery to tell them I wanted oncotype testing done.",
      "MessageIndex": 20,
      "PostDate": "28/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/825115",
      "Title": "can i demand Oncotype Dx testing zha-an kris1114"
    },
    {
      "AuthorID": "LauraW68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
      "Content": "Nov 21, 2014 04:29PM - edited Nov 21, 2014 04:31PM by LauraW68 I went to the free \"Look Good Feel Better\" event that American Cancer Society hosted. You can get info on the ones in your area at http://www.cancer.org They gave each participant a makeup bag filled with not only makeup but cleanser, and moisturizer. The instructor taught each of us not only how to apply the makeup but also how to create brows and lashes even if you lost yours to chemo. She also instructed us on how to wear a wig properly. American Cancer Society will also give you one wig and three (3) hats. You just have to ask them and fill out one paper.",
      "MessageIndex": 11,
      "PostDate": "21/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825538",
      "Title": "Best Eyebrow kits /makeup if u have very little hair?? dancingdiva 208sandy"
    },
    {
      "AuthorID": "LauraW68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
      "Content": "Nov 21, 2014 10:33PM - edited Nov 21, 2014 10:34PM by LauraW68 Sorry. I just shared info hoping to help as it was/is a free event.",
      "MessageIndex": 13,
      "PostDate": "21/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825538",
      "Title": "Best Eyebrow kits /makeup if u have very little hair?? dancingdiva 208sandy"
    },
    {
      "AuthorID": "LauraW68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
      "Content": "Dec 1, 2014 04:46PM LauraW68 wrote: I'm following this as I had my first dose dense round of Adriamycin and Cytoxan today. I had no idea about using the nail polish. I even got a bottle of the Opi at the Look Goid Feel Better event too",
      "MessageIndex": 13,
      "PostDate": "01/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826476",
      "Title": "Adriamycin (Red Devil) SyrMom SelenaWolf"
    },
    {
      "AuthorID": "LauraW68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
      "Content": "Dec 10, 2014 09:24PM LauraW68 wrote: I was not able to keep mine either due to the size of my breasts and I had nipple involvement with the cancer in my right one.",
      "MessageIndex": 3,
      "PostDate": "10/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826892",
      "Title": "Double Masectomy with no Nipples Lillp07 bobogirl"
    },
    {
      "AuthorID": "LauraW68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206360/profile",
      "Content": "Nov 15, 2014 12:56PM LauraW68 wrote: I was diagnosed 9/24/14 and had surgery (BMX) on 10/24/14 with TE placement. I will start chemo 12/1/14 then radiation on down the road.",
      "MessageIndex": 44,
      "PostDate": "15/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/825430",
      "Title": "What was time between diagnosis and treatment? resigned LauraW68"
    }
  ]
}