{
  "AuthorID": "LauraCather…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117731/profile",
  "Posts": [{
    "AuthorID": "LauraCather…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117731/profile",
    "Content": "Aug 26, 2011 09:25PM LauraCatherine wrote: Reesie, Thank you so much for letting me know about the tribute page for my sister.  It's been a difficult week and we truly believed in our hearts that Shannon would be back home.  She'd had rough spells before and always fought through.  She fought this too, but I think the VAT procedure was a lot harder on her than was expected.  She went peacefully and quietly at a nearby hospice.  Our other sister Alison, our mother and myself were with her.  She so feared smothering, and we were so thankful she never had to suffer that fear at the end.  It touches my heart to see so many of you pick up on what an amazing woman she was and it touches my heart she found such support here, from all you brave women battling this same horrible disease.   Camden doesn't know yet, which may seem horrible to some, but my mom wanted to consult a child physcologist before telling him, we don't want to cause him emotional trauma that will last forever.  He was everything to her, and she to him.  We've all be working together to keep him busy and happy.  He had already gotten used to our Mom helping out with him, as well as me and my sister Alison spending time with him. Right now, I don't think I've fully processed that my baby sister is no longer in this world.  She had such a strong lifeforce, I can't believe it's gone.  I've learned so much from her, she is my hero. Thanks for lending some friendly understanding eyes.  I will have each and everyone of you in my thoughts, prayers, and now my heart. ",
    "MessageIndex": 43,
    "PostDate": "26/08/2011",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/773638",
    "Title": "Shan1171 is an Angel reesie GatorGal"
  }]
}