{
  "AuthorID": "LauraM",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
  "Posts": [
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 7, 2010 03:21AM LauraM wrote: Hi Ladies - I had my first AC today, they started off with giving me Decadron (steroid), Aloxi and the Emend for nausea.  Then they gave me Adriamycin then Cytoxan.  All in all the whole experiences was rather good.  The nursing staff was great and my friend and husband joined me and the time went by really quick.  It helped that I had a port put in on Monday so there was not messing with my veins. I am sure this saved a lot of time.   I am feeling good so far, hoping to keep feeling this good!  I go back tomorrow for Neulasta shot.  I am also a little nervous about what day the hair starts falling out, I have a wedding the day after my 2nd tx.  Not sure if I should shave my head and go for the wig or wait it out.  So many decisions. Thanks for all the well wishes and I wish you all a night without SE's!",
      "MessageIndex": 363,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Apr 14, 2010 03:21AM LauraM wrote: Hi Ladies, I am on hold right now waiting on when my Chemo will start.  I thought it was going to be April, but now it looks like May because my stomach has decided it doesn't like anyof the sutures used during my surgery the end of February and is not healing.  We are on a hold to decide if they are going to go back in and re-open up the whole scar and put in a new type of suture or see if the body finally dissolves them.  Will know more next week. So if you don't mind, I am going keep checking in on you ladies and reading your posts so I can get a better understanding of what to expect when I do start  Chemo. Good luck to all of you on your Chemo journey!",
      "MessageIndex": 83,
      "PostDate": "14/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Apr 15, 2010 08:53AM LauraM wrote: Hi Sara,  I think I read earlier that you are having AC every other week for 4 weeks to start?  Are they having you go back to the office the next day for a shot of Nuelasta to boost your white blood counts?  I haven't started yet,  but from your posts, they are planning on giving me the same anti-nausea meds as you the day of, Aloxi, Emend and Decadron (the steroid).   I will then take Emend for 2 more days at home. Thank you so much for posting your Chemo experience, it is really helpful for me since I am waiting for my start date and I am curious of what the after affects are.  I plan on having mine on a Thursday so that I only feel crummy on of the weekend. My dh and in--laws will be around to help on those weekends so it will make it much easier on my 9 and 11  year old, they will get extra attention from them all!  I hope you feel better soon.",
      "MessageIndex": 100,
      "PostDate": "15/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 5, 2010 08:55PM LauraM wrote: Well tomorrow is my big day... ugh, 1st TX of AC and I am really getting nervous.  Lexie5 - I hope you feel better soon!",
      "MessageIndex": 343,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 18, 2010 09:50AM LauraM wrote: Hi Ladies - Just checking in to see how everyone is doing.  I spent the weekend taking the kids to all of their softball/baseball/soccer games.  Kept me busy and because it was my weekend between treatments I felt pretty good.  I am gearing up for tx #2 of AC on Thursday.  I haven't lost any hair yet but I am starting to feel a little tingling of the scalp so I know it will be happening. I am just hoping that it holds out until Saturday since we have a wedding to go to Friday night and I would really like to have my own hair for it. Emme - I am sorry you are having such a tough day.  I am right there with you on this whole hair thing.  It makes my stomach turn just thinking about it.  I am sending you lots of  hugs and thoughts for the rest of the day!",
      "MessageIndex": 464,
      "PostDate": "18/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 2, 2010 10:14AM LauraM wrote: Jen C -  I am right there with you with the stitch abscesses.   I have been fighting them since my surgery in February.  I had the TRAM procedure and along my belly incision my body had decided it can not break down the dissolving stitches and I keep getting abscess and then it spits out the stitches.   I am 3 1/2 months since my surgery and I went to the doctors yesterday and there another abscess they had to open. (this happened in another spot right before my 2nd tx also)   I go back to my plastic surgeon tomorrow right before my scheduled chemo tx.   My onc will look at my stomach again tomorrow and will end of calling my ps and ask him what he thinks just like last time.  They almost postponed me, but decided to go ahead with tx because once they open up the site, it drains well and is not really a true infection just my body rejecting the stitches.   I am not sure what my onc will say tomorrow since I now have two open areas on my stomach.  She may postpone.  When they put in my port the other day, the stitches also formed a little abscess and then pushed the stitch out to the surface, once it could be pulled out, the abscess went away on it's own.  I am pretty fed up with this whole thing, it seems like it is a never ending process with me having open wounds on my stomach.  I have been wearing pads accross my stomach for drainage for way to long.  I now have to be careful on what kind of pad I wear because I have started to have a latex allergy from the original pads I used.  I now have to get latex free.  ",
      "MessageIndex": 557,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 22, 2010 11:36AM LauraM wrote: Well had my last AC on Thursday and this treatment really socked it to me.  I felt pretty much like I did with my 1st tx.   My stomach has been a mess and so has my throat.  I can't get the yucky taste out of my mouth today either...ugh!  I didn't sleep much last night because my stomach was so bloated and gassy.  My poor dh, I am sure my up and down every hour didn't help him either, but he is a trooper and didn't complain at all.   My stomach has been feeling a little better this morning so at least I know I am on the mend.  I just called my onc about my sore throat and just my luck they are not in the office today and told me to go to my  primary care Dr. Called them and hoped that they would just call me in an antibiotic so that I didn't have to go there with the chance of catching anything else but of course they want to see me.   I am pretty fed up with all this crap!   I really just want to feel better again... tired of being tired and yucky today.   Sorry for all the complaining but really having a rough feeling sorry for myself morning!  Thanks for listening. I hope everyone out there with hot flashes is having a cool  day! ",
      "MessageIndex": 674,
      "PostDate": "22/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 25, 2010 10:15AM LauraM wrote: JenC - I am so sorry about this latest setback, it does really suck all the things you have to go through to get well.   Just keep on holding on the fact that they can fix your issue, and maybe the change of your tx plan was meant to be.   I will be saying lots of prayers for you! SGJ05 - Good luck on your next tx, I hope it goes well. Toughmom - I tend to gain weight the week of my tx and then level back off the next week, I have found that if I get a fresh watermelon and keep it could in the fridge, it really satisfies my hunger and is nice on my throat when it is sore. My sore throat does not stop me from eating either, my stomach definitely rules and it feels better with food in it.  My worst vice beside nightly ice cream (for my sore throat..lol)  is eating cheeseburgers from Five Guys Burgers and Fries.   I blame my craving on my low iron and convince myself that this burger will help, it does helps my stomach!  Will I have been fighting a sinus infection since my last AC, finally starting to feel better today!  I am hoping that they will still do my next tx with me on antibiotics.   I hope everyone has a wonderful day!",
      "MessageIndex": 696,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jul 20, 2010 05:29PM LauraM wrote: Shelly43 - When I went to physical therapy, my therapist used Nivea cream and massaged my scars to get them to not \"stick\".  I forgot what she called this when they stuck, but after about 6 weeks, all of my scars had good movement.  Good luck.",
      "MessageIndex": 834,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Apr 20, 2010 04:52PM LauraM wrote: Well it looks like I might be getting chemo this month after all.  My surgeon said I should be all healed to start next week because my stomach really healed a lot last week.  I will know for sure by Monday.  I have been working on getting my wig and trying to see when I can get my port put in. I hope you all are feeling well!",
      "MessageIndex": 159,
      "PostDate": "20/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Apr 23, 2010 09:40AM LauraM wrote:  Hi Ladies - I posted this on the Cancer 2010 tread also, but just realized this might be a better place to ask the question.  Chemo Question, are any of you taking multi vitamins or any other supplements during chemo?  I am on a Multi vitamin, extra iron, probiotics and a fish oil, all natural products that I started when I was having issues healing from my surgery.  They have made me feel great and I have so much energy since I started them.  I was very excited yesterday when my oncologist office said that I can continue taking all of them during my treatment.  Has anyone heard anything against taking these while on Chemo? Thanks for your help!",
      "MessageIndex": 182,
      "PostDate": "23/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Apr 27, 2010 10:07PM LauraM wrote: Hi Ladies... I finally got my go for Chemo to start on May 6th.  I will get my port put in on Monday the 3rd.  I got fitted for my wig today, was pretty nervous but it wasn't so bad.  My step cousin had cancer 5 years ago and had sent me a hat about a month ago with hair on it that I had left sitting in the unopened box it came in afraid to open it up because it made it so real.  Well I finally opened it today and tried it on, it was so cute.  The hair is a little lighter then mine and longer but I might keep it just to change things up.  She also sent me some scarves and bandana's to use that were rather cute.  My dd and ds were not too sure about them, but did think the hat looked good.  I am glad that everyone seems to be adjusting well, your posts really mean a lot to me as I get ready for my chemo journey. Thank you!",
      "MessageIndex": 241,
      "PostDate": "27/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Apr 28, 2010 11:05AM LauraM wrote: Good morning ladies!   Regina shared this video on the February 2010 board and I thought it was wonderful and wanted to share it with you all! YouTube - Bomshel-Fight Like A Girl Lyrics I hope everyone is having a good day today!",
      "MessageIndex": 250,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 9, 2010 02:02PM LauraM wrote: Hi ladies -  I am on Day 4 of my 1st AC tx and have been doing not too bad.. a little upset stomach but not too bad.  I definitely have metal mouth taste today, does anyone have any remedies for that? Thank you and have a wonderful day. Laura",
      "MessageIndex": 386,
      "PostDate": "09/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 12, 2010 09:20AM LauraM wrote: JenC - Sorry to hear about your port issue, that really does stink.  All - I am faithfully reading all of your posts about the hair falling out, mine probably will be starting sometime next week.   I didn't think I would care so much, but every time I think of it, it makes my stomach turn...ugh, i am sure this too will pass. Has anyone else been havinging issues with their stomach being really hard right below where the ribs separate?  Mine has been swollen and very hard and it is very sore (started day 4)  When I went to my surgeon yesterday to have my port followup visit, she thought it was odd and had me call the Oncologist.  When I spoke to them yesterday, they were not sure what it was and told  me to keep an eye on it and then prescribed me a medicine called Reglan that might help. Thanks for your help!",
      "MessageIndex": 413,
      "PostDate": "12/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 9, 2010 01:37PM LauraM wrote: Raeann - Glad you are done with AC!  I have one more next Thursday and I will be on to Taxol.  I will be following you to see how your Taxol goes.  I am wishing you minimum side affects.  Jen C - All of my suture abscesses have been infection free.  I have had about 15 of them so far.  My doc explain it more as an allergy than an infection.  I hope you are done with them. Mine are finally getting better. Good luck to everyone else getting ready to have their last AC this week.",
      "MessageIndex": 605,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Aug 13, 2010 06:09PM LauraM wrote: Shygal - Congrats on the negative biopsies.. glad to see some good news come your way!",
      "MessageIndex": 958,
      "PostDate": "13/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 4, 2010 05:42PM LauraM wrote: Hi All - I got my port put in yesterday, didn't realize it would make my arm and shoulder so sore, ugh.  I am getting nervous about starting Chemo on Thursday but your posts really help so thank you. Pickles -  Thanks for the Buff Wrap info, I went right on line and bought one for myself. I hope everyone is feeling better today!",
      "MessageIndex": 327,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 31, 2010 11:20PM LauraM wrote: Raeann - I am with you on everything you wrote above.   I can handle the chemo and the nausea, I can even handle the mouth sores.. which suck.  (I didn't know there was a \"magic mouthwash\" until I read it in the posts today.  I am going to call my doc tomorrow for a script.)  But the hemi's are the worst thing I have ever felt.  I am taking stool softeners each day and they are not helping at all.  I have been using tucks wipes and preparation H cream for the last 3 days and they are starting to feel a little better today but they still kill me when I go.   Last time my constipation only lasted a day or two and then it was fine, I have my 3rd AC treatment on this coming Thursday so I am getting nervous that it is going to be worse this time.  ugh!  I hope you feel better!",
      "MessageIndex": 544,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 11, 2010 11:06AM LauraM wrote: Question - Has anyone out there had problems with blisters on their feet?  I have been having cracked heals, cracked area's between my big toe where flip flops would go and then a few blisters on my feet.  Today my feet are very achy, even if I am sitting around they throb.  I usually try to walk every day and the last two days the walks have been very painful.  I hate to quit exercising but achy feet make me cranky!  I called my onc today and I am waiting on a call back to see what they say.  I really hate all these side effects!!!",
      "MessageIndex": 609,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jul 5, 2010 07:17PM - edited Jul 5, 2010 07:18PM by LauraM Congratulations to everyone that has finished Chemo!  That is awesome news!   I am due to be finished on August 12th.  I am not sure about rads yet, I have to got to Sloane for a consultation after chemo to see if they think I will benefit from it.  I am hoping not, I too am ready to be done with this and to get my life back. I had my first Taxol on Thursday and besides getting a rush from the Benedryl and then taking a nap, everything went as expected.  I was surprised on Saturday when I woke up from my nap (I have been doing a lot of napping since my treatment) that I am really achy in my hips and legs.  It doesn't really hurt but is just uncomfortable and I feel like I have restless legs.  I can't sit or stand too much at one time.   Nothing is working to stop the achiness or to allow me to sleep now that I have it..  I have tried Dalaudid, Aleve, Advil and Tylenol and only the advil seems to take the edge off of it, my sleeping pill doesn't help at night either.  Last night I woke up 4 times before 6 am because my legs were bothering me and each time I had to go the bathroom (who would have thought one person could pee that much in one night!).   Is anyone else on Taxol getting these side effects?  I am hoping tomorrow is better!",
      "MessageIndex": 755,
      "PostDate": "05/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Aug 31, 2010 04:58PM LauraM wrote: Hi Ladies - We just got back on Sunday from a week at the Jersey Shore.  I have dear friends that have parents that own a house there and they invited us to join them for the week.  We had such a nice relaxing time, I forgot how much I love the ocean.   I finally heard back from all my doctors and they have agreed that I need radiation.  It has been a mess with these doctors since it looks like the doctor I saw at Sloane never read my whole chart and after my surgeon called her, she changed her radiation recommendation.   It was a definite waste of time to go to Sloane this time.  Now I just have to figure out what Rad Onc to use.  My surgeon is pointing me to one doctor and my Onc is telling me to go to a different doc.  It is never easy.   It seems that I will be getting it on my new breast, above my breast on the chest and under my arm.  Is anyone else getting rads under their arm?  I had two small tumors there that were removed in March so that is why along with 3 lymph nodes positive.   I meet with one of the Rad Onc tomorrow and the other next Friday and depending which I like better I will use. It seems like I have missed so much since I have been gone.  Congrats to every one who has finished Chemo, what a great milestone.  I am almost three weeks since my last Taxol and I am feeling stronger everyday, my biggest issue like the rest of you is the hot flashes.  I am not looking forward to starting Tamoxifen. Emme - My heart goes out to you.   I am glad that you and your kids are out of that bad situation.  I will keep praying for you, I know it is hard, but please stay strong.  I hope that the infection gets under control soon and you get back on your feet!.  I am wishing good thoughts to all!",
      "MessageIndex": 1058,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 10, 2010 11:02AM LauraM wrote: Hi ladies - Thanks for the tips on dealing with metal mouth, I am going to go to the store later and get some lemon drops and try them out.  Funny you mentioned ice cream, I have not wanted sweets since chemo started but last night I had some ice cream and it was really good. My stomach is still giving me issues today, plus I am very tired because I am not sleeping very well.  I sleep good til about 4 or 5am then I toss an turn with the churning stomach the last two nights.  I am on day 5 today so I was hoping to wake up feeling back to normal today but that hasn't happened.   I did start getting the tightening in the center of the ribcage last night, I think that is the sternum area which my doctor told  me was a possibility when the white blood cells start to produce after the Neulasta shot.   It doesn't hurt, just has my upper stomach hard as a rock.   All in all this hasn't been too bad, just annoying and lasting a little longer than I expected. Thanks for all your help! Laura",
      "MessageIndex": 396,
      "PostDate": "10/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 14, 2010 01:04PM LauraM wrote: Julia123 & Sara - I hate that you too have had issues with the feet, but glad to know that I am not alone.  I called my onc and when they called me back, they left a message that this is not a usual side affect with AC chemo and pretty much said if I have any other questions to call them back.  I was pretty annoyed with them and didn't feel like calling them back.  I mean...come on, I didn't have this prior to chemo and now I have it, it must be related.   On Saturday my feet hurt so bad that just walking to my kids sports games was so painful and at one point I just sat in my car and cried.  I felt so stupid, but it made me feel better in the end.  I have found that taking 2 aleve every 12 hours makes the discomfort manageable but I have to be proactive in taking it because it takes about 2 hours for it to start working.  It is really putting a damper on my daily walking routine...ugh!   I will have to try the Bag Balm, hopefully that will help me too.",
      "MessageIndex": 619,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 23, 2010 09:46AM LauraM wrote:",
      "MessageIndex": 683,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jul 20, 2010 08:22PM LauraM wrote: Shygal - I just wanted to let you know that my DCIS showed up first in my mammogram.  I followed up with an MRI that showed it was more extensive then the mammogram showed but the mammogram was key in my initial diagnosis.",
      "MessageIndex": 838,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Aug 12, 2010 07:00PM LauraM wrote: DancerMel - Thanks for the article - If you don't mind I am going to share it on the May Chemo group too.  Did you have your surgery to fix your stomach scar or some other scar?  I will have to have one to fix my stomach scar after all the issues with \"infections\" too.   I am glad yours went well. I just finished my last Taxol today so I am in need of a smiley face too!  Still waiting on my Rad's decision will hopefully know in the next 10 days. Congrats to all of you who have finished!",
      "MessageIndex": 952,
      "PostDate": "12/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Aug 17, 2010 11:46AM LauraM wrote: shelleyj43 - You made me laugh when you said you forgot about your port.  That is so something that I would do!  I say don't tell the doctor and see what they say when they call you.. got to have a little fun some how! ",
      "MessageIndex": 972,
      "PostDate": "17/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Sep 14, 2010 01:56PM LauraM wrote: Hi Ladies - I am taking a quick minute to check in and see how you all are.  I am back to work (from home), running kids to all their sports and radiation starts on Sept. 20th so my time to get online has been very limited. Kad22 - have you tried biotene tooth paste? It helped limit mouth sores for me. Hope everyone is doing well.",
      "MessageIndex": 1089,
      "PostDate": "14/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 16, 2010 10:35AM LauraM wrote: I was 45 - stage II, had been getting yearly mamograms since 38.",
      "MessageIndex": 487,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Nov 10, 2010 07:05PM LauraM wrote: Congrats Bon, nkrun and Shellyj43 for being done!  YEAH.  My appointments were at 7:45 AM and I had to drive 45 minutes each way, so I have really enjoyed sleeping a little later each morning.  I have been working from home since I returned to work in September and I am going into my office tom morrow for the first time since I went out on disability for my surgery in February.   I am a little nervous about seeing everyone, but will be glad to get another step towards normalcy.   I don't have any other tests or appts until mid December, such a weird feeling. nkrun -  That is awesome that you have been able to maintain your exercise.  I did really well unitl June when I had some crazy side effects from the chemo.  My burns have stopped being really painful and are  healing now so I look forward to start exercising again next week. Teka - I hope your burns are feeling  better!",
      "MessageIndex": 668,
      "PostDate": "10/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jul 20, 2010 09:22PM LauraM wrote: Hi Ladies!  I have been off-line for a couple of weeks and finally had time today to catch up on everything.   I completed my 2nd Taxol on Thursday and like Summer, Patricia48 and Leanna9 have had really bad bone/joint pain.   My first tx the pain was much worse than this tx and I really had a harder time sleeping because I couldn't get comfortable.  The bone pain from this tx it seems to be lasting longer.  I have been taking pain pills at night along with Ambien and Advil during the day.  Sometimes this works to help lessen the discomfort and other times nothing seems to help.  It does work better if I don't let the pain get out of control.    I just keep thinking I only have 2 tx left and I will be done with chemo!  I am waiting on an appointment at Sloane with the Radiology department to see if I need to have radiation.  I am hoping I don't, I am ready to be done with these treatments.  Sacphotomom - I am sorry you had such a bad reaction.  I hope the next tx is better, maybe they will start if off slower the next time and you will be fine.  I hope your bone pain is better soon! Day - My KI-67 was a 19 - which is very low end of intermediate per my docs.  I was glad it was that low, but seems to put me the in grey area for whether I will need radiation or not.   I don't remember who asked about mouth sores on Taxol, but I had them during AC and they have been soo much better while on Taxol.  I have not really had stomach discomfort with Taxol either, just the bone pain. Packjen - I love your chemo party stories, they are the best!  I am glad you are having such a good time while you are there, I am sure it is making the time go faster. Question:  I am hearing lots on these posts about drinking and I was wondering if any of your doctors gave you instructions about drinking while on Chemo?  Mine told me not to drink at all the first week after chemo and only occasionally after that.  Have a great night!",
      "MessageIndex": 1050,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Nov 8, 2010 12:29AM LauraM wrote: Daiva - Keeping the prayers that it is nothing more than a fibroid!  Leanna- Don't think I know your BIL, but that is great that his is still in the Norfolk area.  It is such a great area.  My dh is going there this weekend for a boys get together.  I am glad he is getting the chance to go, since the only vacation he has had in the last year is to the hospital with me. Jersey Good luck with your recon! X-Ray and Denise I liked my buff wraps, I think I looked more cancer looking when I was bald so the wraps because I had them in all colors were \"fun\".   Now I go without most of the time, but I did get my wig cut shorter so that when I finally go back into my office next week I will be wearing it.  When I go back to the office, I want to work and not have people looking at me with my too short hair and start thinking about why I was out for so long.  I am ready to move on. Magda - great news.... waiting on your news update! Day - Wow - I can't believe how long your hair has gotten.  It looks great! I have been battling post radiation burns for the last week under my arm, on my neck and down my whole breast.  About 3 days after I stopped radiation I started to blister and get very very sore.  I was so not expecting this because my skin up to that point had really handled the radiation pretty well.  I called the radiologist and they called me in a burn cream that has been very helpful.  I am still red and very sore to touch but getting better everyday.  Advil helps a lot too.  I am looking forward to my skin healing so that I can finally resume exercising.  Have a great night! ",
      "MessageIndex": 1853,
      "PostDate": "08/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 30, 2011 05:42PM LauraM wrote: Hi Ladies -  I have been keeping up on reading all the posts via my cell phone but for some reason I can't post from it.  I just had a long post to everyone and my computer shut off before I could send it- lost it all.  I think it needs a new battery.  I am now just going post to the recent activity. Day and Barb - My thoughts and prayers are with you both.  Keep as positive as you can.  Barb, I would wait to tell the kids until you know something more concrete, you know if you tell them now, they will have questions and the will fill in all the blanks with their imagination if you don't have all the answers.  This disease just sucks... what it doesn't do to your body, it will do to our minds with all the worry and anxiety we have to go through every day.   Leanna - I will vote for you too! Madga - Congrats on going wigless!  I went back to work wigless after the beginnning of the year.. feels great doesn't it? Golfer Girl - Congrats on your anniversay! I am back to work on a very busy international project, probably working too many hours but I love the excitement.   The good thing about this project is that I can work my hours around the kids activities because I have a lot of night time calls.  So for the kids it is good.   We are super busy right now with everyone's schedule, we were in Rhode Island last weekend for my daughter's cheering, and she practices 3 -4 times a week.  My son is busy in basketball and boy scouts and they both are skiing with their schools on Thursdays.   I even went on the slopes with them this past week.  It felt awesome to be back to doing physical activity and was very blessed I made it through the night with no injuries!  I go to my oncologist on the 1st for my 4 month checkup, it is weird..she only does blood work and a physical, no other scans or anything.  That makes me a little nervous, are the rest of you getting scans?  I am having my reconstruction touch up surgery in March, I am looking forward to that, for those that remember, I had an allergic reaction to the sutures in my stomach where I had the TRAM surgery.  the scar is very wide and bumpy and they think there are still pieces of sutures in there so they are going to go in and clean it out.  They are also going to fix my arm where my node surgery was and put fat injections in there because my PS said that there is new studies that fat injections help reverse the effects of radiation.  My arm is very tight now that rads are done so anything that he can do to help would be great. Sorry about the long post... I am thinking of all of you daily, you are in my prayers! Laura",
      "MessageIndex": 2136,
      "PostDate": "30/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Feb 4, 2011 12:43PM LauraM wrote: Barb - Great news on your results!  I have been thing about you. Day - I have been thinking about you too... You had good news too and I am sure your Kidney issue will be nothing... keep positive. Jenn - That is horrible, I can't believe you ended up in the hospital.  I am glad you are feeling better. Ditah - Your skiing trip sounds like fun.   I was pretty nervous the other day when I skied, was pretty amazed though at how quickly it comes back. Jen - Praying that the suspicious node is nothing.  Keep us posted. Daiva - Happy belate B-day! Patricia - That sounds like a wonderful trip!  I am hoping to get to Japan this summer for work.  Jersey - Do you think we have had enough snow/ice yet?  I am not ready for another storm this weekend..ugh Denise - I wasn't really sore from the skiing, maybe a little, but I walked on the tread mill for the first time since June and the last two days I have been so sore.  I am feeling really out of shape. Magda - I am with you on the hot/cold flashes.  it is driving me nuts..  Some days I get them every 25 min or so and other days every hour. And I get them some nights all night long.  I went for my Onc, checkup on Tuesday and told my Doc about them and she said that the only think I can  take that is shown to work (I have tried natural products and didn't work) is an anti- depressant that doesn't mess with Tamoxifen.  Now I am a pretty happy go lucky person, pretty upbeat so the thought of me on an anti depressant is weird.  I figured I would give it a try for a few days.  Well I don't like it, the medicine is really making me feel foggy.. I will give it another few days and see how it goes and if it doesn't get better then I will just deal with the hot flashes. My Onc. appointment was really good, nothing for concern.  I am now waiting on my blood tests and should have them back by next week but don't expect anything to be up.   On a sad note, a friend of mine passed away from breast cancer on Tuesday.... She was such a wonderful women and left behind a 9 year old daughter, a 13 year old disabled son and a wonderful husband.   This cancer shit really sucks!  I am trying just to feel blessed for every day that I have. If I missed you on this note, not intentional... Have a wonderful Friday!",
      "MessageIndex": 2160,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 19, 2010 12:51AM LauraM wrote: Good evening ladies!  I just took the last hour or so reading through all the posts since mid last week.   I have been feeling better and trying to keep up with all the kids schedules so I have not had time to be any where near my computer.  I am 13 days post AC tx 1 and have been on the much better since day 6.  I did relapse a little over the weekend with a little nausea but it was short lived.  I have tx #2 on Thursday so I have been trying to drink more water preparing.  My hair is holding steady but my scalp is starting to itch so I am sure that is my first sign that things are going to change soon.  I have a wedding on Friday so I am just hoping it holds out til after that. I hope everyone who has chemo this week gets it through it with flying colors and I hope everyone that has been sick and in the hospital feel better and keep healthy.  Hugs to you all!",
      "MessageIndex": 340,
      "PostDate": "19/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 14, 2010 07:12PM LauraM wrote: Sacphotomom -  My last AC is Thursday and the I will follow it up with 4 tx of Taxol.  I wish Thursday was my last chemo treatment,, I would be throwing such a big party.  njbhwgirl - My doctors give me anti nausea meds also and they work ok, but not perfect, I still find that I am nauseous alot and have to take the meds and then I feel better.  I was really tired after tx 3 and that lasted quite a few days and I think I have cried a few times this week which I am hearing is normal.  I am just tired of being tired and a lot of this is because I really don't like to rest very much so I am always on the go and then my body will just shut down after a while and I spend the day in bed.  Quick story....This afternoon my dd, age 9, asked me if the doctors have figured why the breast cells turn into cancer cells?  I explained to her that they didn't know this answer yet.  Then she asked me if they have figured out how to prevent breast cancer yet?  I told her that they had not figured it out yet.  It broke my heart when she started crying and telling me that they really need to figure this out quickly and then she followed that up with is anyone working on finding out?  I told her that they were working on it, but at least for now they know how to treat it.   It always amazes me with the way her mind works, so much older then her age. ",
      "MessageIndex": 707,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 16, 2010 09:26AM LauraM wrote: fotopet - I started the clariten 2 days prior to tx #3 and continued it 5 days post tx.  Overall the bone pain and achiness to my body was much better.  I still had issues with my feet being achey but I think that is another issue.  I hope you feel better this treatment. I hope everyone else is having a SE free day!",
      "MessageIndex": 720,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 1, 2010 07:04PM LauraM wrote: Jen -  I think you look BEAUTIFUL with your bald head!   I buzzed my hair last tuesday because it was falling out in clumps and it was making me naseaus just to think about all the hair. I felt much better once it was gone.  I have a wig that I wore that one day when I picked up my daughter from school.  It has been hot here so I have been wearing wraps ever since and go around my house without anything.  I will probably be completely bald soon since what is left is still falling out at a pretty good rate.  I went to the kids school to day in my wrap today and boy did I get lots of strange looks.... from the parents.  The kids didn't seem to notice.  I thought my dd would say something about me not having my \"hair\" on  but she was fine with it.   I will have my 3rd AC treatment on Thursday Have a great night",
      "MessageIndex": 539,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 8, 2010 07:26PM LauraM wrote: Hi Ladies - I am just back from a busy weekend here in NJ.  We had Relay for Life in our town this weekend also.  About 5 weeks ago, I put together a team to walk and we set a goal of raising $2500.  I am so excited, I was just looking on line and my team exceeded our goal and as of this morning raised $4116.    I had 38 people join my team and all of them came and walked some part of the the event.  The goal is to have someone from your team walking at all times.   I realize at times like this how truly blessed I am to have such wonderful family and friends to support me.  I had my 3rd tx of AC on Thursday so I wasn't sure how much I would be able to walk, but I really surprised myself.  I took a lot of breaks, but managed to walk on and off until Midnight.  My dh and his friends all took the night shift.    We followed this up on Sunday with my 9 year old dd having 3 softball games in a town 1 hour away and my ds having a soccer game.  I think keeping busy is helping me to keep going, days like today when I have down time, I seem to feel worse.  Maybe it is just in my mind! I am now at day 6 after tx 3 and I am just starting to get the mouth sores again...ugh.   I have been using Biotene toothpaste and mouthwash and was hoping that would help me this time but a little while ago I started to feel them coming.   I too have been having a sour type stomach since the tx and even water taste terrible.   I am taking probiotics, nexium, antigass meds and reglan for my stomach but nothing really seems to be helping the bloating, gassiness and just general yucky belly feeling.   I did try the clariten suggestion and WOW did that help, I had very minimal amounts of achiness this time.  So thanks for the suggestion. I think of you all often!  You are such a great support system.",
      "MessageIndex": 613,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 22, 2010 04:47PM LauraM wrote: sacphotomom - My scar under my arm from my axillary node removal is always much sorer after chemo.  I think it is the swelling from all the drugs they give you.   I had immediate reconstruction after my mast. and so I don't have any soreness there.    How are you feeling after AC #4?  I have been feeling like crap the last two days, my stomach has been acting up and I have a wicked sore throat that seems like it might be a sinus infection.  I am off to the doctor today to see.  I really didn't sleep well last night because of my stomach and throat so I am having a feel like crying day.   I hope your tx went better then mine. Here's to hoping that Taxol is much better on my system then AC!   I hope everyone else is having a SE free day!",
      "MessageIndex": 777,
      "PostDate": "22/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 25, 2010 08:53AM LauraM wrote: Well Sinus infection under control, finally starting to feel better.  Kind of stinks when my worst three days of post chemo collide with an infection, it really knocked me down.  I am hoping that I can still get my first tx of Taxol on Thursday even though I am on antibiotics.  My tx go through Aug 12th and my short term disability goes until Aug 22nd so I really don't want to be out of work any longer than that.  Actually, I kind of like being home and could really get use to it!  I really have a great job so going back won't be too bad. Leanna9- Your mom sounds like my mom.   She lived with us for a year until last summer and she drove my dh and I nuts.   She competed with my then 8yr old dd for my attention, if I wanted to go get a pedicure and she was coming, she would get annoyed if I invited my dd too.  Was kind of funny.   She came to visit for a week after my surgery, she was very helpful but I was ready to have her leave when she started inviting all my friends over to visit and I wasn't ready to see anyone, she really wanted them to come visit her! LOL     She just told me yesterday that she is planning on coming this summer to \"help\" me out.    I am fortunate that she is very giving and wants to see us, but after a week or so we start fighting too. JennyB - I hope your lung issues get better.  All these SE's suck! Redbarb - Glad to see you got through your last TX OK. Summer38 - Congrats on your daughters graduation! I am sorry I didn't get to reply to everyone, I read all the posts and am thinking of you all!  Have a great SE free day!",
      "MessageIndex": 811,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Sep 7, 2010 05:27PM LauraM wrote: Hi ladies - I just finished getting caught up on all the post for hte last few days. I am just back from Labor Day weekend at my in-laws lake house in the lower Catskills of NY.  It is only an hour trip from my house so it is nice.  My mom and my sister came into visit so it was a very nice weekend.  Today is my first day back to work, I am working from home until I am done with my radiation so that is good.   It is weird, part of me wishes that I wasn't going back to work at all, even thought I love my job and all the people I work with are wonderful.  They have  been so supportive to me though this whole process and I know it is best for me to get back to a \"normal\" life but my mind is not into it yet.  Oh well, it is good to have a job to go back to. I love my Buff head wraps too.  I have 6 of them in all sorts of colors and wear them everywhere.  I have been rubbing my head a lot too, I love the feel of it as the hair is coming in, it is so soft.  I had dark brown hair with a little bit of grey in it before and now it looks like it is coming in very grey on the sides and a mix on top.  Oh well, atleast I can dye it, even though I have never done that before, I am sure I can figure it out when it is long enough.  I am not vain, just too young to be all grey. Summer - I get dizzy a lot and out of breath, but not when I toss and turn.  I would mention that to your doc next time you see them. Xray Girl - They still gave you the shot after your last Chemo?  that stinks.  I hope you feel better soon! Congrats to everyone who has finished up their treatment since my last post!  I hope everyone else is starting this week with no SE's.  My thoughts and Prayers are with you all!",
      "MessageIndex": 1478,
      "PostDate": "07/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Sep 15, 2010 07:29PM - edited Sep 15, 2010 07:30PM by LauraM Daiva - My favorite way to wear the buff is to turn it inside out and then cross your arms inside the tube of material and then grab each end and pull it through from both sides at the same time.  I then put the cap on and adjust the size and the little part that hangs down by pulling on it and then pulling the outer area over little tail so it doesn't stick up.  Funny story from the weekend I want to share..   I was at the gas station near where my daughter cheers on :Sunday and there was a young Middle Eastern guy working. I handed him my credit card and asked him to fill up my tank.   When he handed back my credit card back he said...are you Jewish or Muslim?\"  I looked at him and said what?  He said are you Jewish or Muslim and pointed to my wrap.   I looked right at him and said no.   He asked what  I meant.  I said I have Cancer and he looked at me and said... what?  I said I have cancer and I pulled up my wrap and said I have a bald head, that is why I wear this wrap.  He looked at me and took a step back and said..Oh, sorry!    You should have seen the look on his face when I pulled up my wrap.  I found this very funny. Have a good day.",
      "MessageIndex": 1551,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Apr 15, 2010 10:08AM - edited Apr 15, 2010 10:09AM by LauraM Hi Ladies - I would like to join this group.  I have recently moved from Stage 1 grade 3 to Stage 2 grade 3.  I have been hanging out in the Stage 1 group and they are a wonderful group of ladies and had been looking for a stage II group but some how didn't find this thread until today. I am still healing from my dmx w/ immediate Tram on February 22 and auxiliary node dissection on 3/15..  I have had a few complications that keep setting my recovery back.  I am extremely anemic since my last surgery(now taking Iron and multivitamin)  and it appears I am having healing issues from that and now they are thinking I might be allergic to the sutures they used in my stomach from the TRAM.  I will know on Monday if they are going to go back in and open it up and put in new sutures.   They are trying to get me healed so that I can start Chemo.   I am not really worried, because I know it will all work out.  I am not mentally in a hurry to start Chemo but know it is best if I get it started so that I can get it over with. Have a great day!",
      "MessageIndex": 260,
      "PostDate": "15/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 12, 2010 09:11PM LauraM wrote: Hi Rocket -  Welcome and I am sorry that you had to join this sisterhood, but we are glad to have you!  They did not call mine multicentric, but had a tumor in the middle of my breast and 2 tumors under my arm in the breast tissue all at the same time.  All of them were under 1 cm.  I had a double mx in February which is when they found the two under my arm.  They went back in for my axillary nodes and found the cancer in 3 out of 14.  I started Chemo last week.  Lorraine5  - How are you feeling?",
      "MessageIndex": 301,
      "PostDate": "12/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Oct 26, 2010 06:48PM LauraM wrote: Hi Ladies -  I just spent the last half an hour writng  a long text to everyone and some how my mouse clicked on something and I lost it all.   So I this is going to be much shorter and I will won't get to reply to everyone but know that I think of you often and I am very thankful for each of you in my life. Here is my status update: Lumpectomy 12/6/10, DMX with Tram 2/22, Node surgery 3/16, Finished Chemo 8/12; Finishing rads 10/28 - YEAH THAT IS IN 2 DAYS!!!!!   Started Tamoxifen 9/13 and the only side affect is slight headache's most days but nothing that a few advil doesn't help with..  Got the BRCA negative results. I am back to work now so my life is pretty crazy with that and all the kids sports so I don't have much time to myself.  I did manage to get a way to my 1st girls weekend in 10 years this past weekend.  I met a bunch of my sorority sisters in Norfolk VA for our college, ODU, homecoming.  It was so much fun and I am going to make sure that I don't wait as long for the next one.   I did go the whole weekend without a wig or wrap.  My hair is pretty short so it was a pretty big step .  My thoughts and prayers are out to all of you. Laura",
      "MessageIndex": 1803,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Nov 1, 2010 02:05AM LauraM wrote: Thinking of you all! ",
      "MessageIndex": 1827,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Nov 11, 2010 01:41AM LauraM wrote: Hi -  Just checking in to see how everyone is doing.   I finally updated my pic tonight showing my small amount of hair growth.  At least it is some!   My rad burns are finally getting better, I am hoping that by the end of the weekend we are healed. Leanna - I hope you are feeling better Day - My thoughts are with your friend!  I hope he gets better quick. Majdula - and Latte - I think I have the same questions as Denise.  I am glad the chemo worked so well but why surgery now? Paxton - It is best to take it easy as much as you can now to let your body heal.  Gage will appreciate it when you are with him for many more years to come! Have a good night!",
      "MessageIndex": 1866,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 9, 2010 12:23PM LauraM wrote: TriciaB - Thank you for giving your updates.. I am a few days behind you I started my first dose of AC on Thursday 5/6.  Day one and two were uneventful for me, a little woozie at times but other than that went about my normal life.  Saturday started the same, but little by little some nausia and woozieness along with being tired settled in.  Actually eating has been okay, kind of makes my stomach feel better for a while.  Last night I didn't sleep well as my stomach seemed to be turning alot.  Today, I feel the same as yesterday, just a little off and my stomach can't decide how it wants to feel.  I had not been good at taking my stool softeners so I think that is part of my stomach issue.  I am not making sure that I take them until this issue resolves.  Hopefully tomorrow I wake up feeling back to normal. All you other ladies out there I hope you are feeling good today and Happy Mothers Day to all the mothers out there!",
      "MessageIndex": 169,
      "PostDate": "09/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 12, 2010 08:28AM LauraM wrote: Have a great day ladies!  You are all WONDERFUL!",
      "MessageIndex": 207,
      "PostDate": "12/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 13, 2010 01:52AM LauraM wrote: fotopet - I had the same incision issue with my tram, my incision kept reopening and spitting out stitches.  My Chemo was delayed a few weeks over it.  I still have two area's that are still healing but they figured they were good enough to start last week. JennyB and Golfergirl - My AC experiences were the same as yours.  The worst for me were days 4-6.  Tired, achy and bone pain.  Day 6 I started to feel better and today is much better.  Still a little tired but overall good.  I am not sleeping well so I am sure that is compounding my issues. Drim - You are my new role model for drinking enough water.  I always thought I drank alot or at least enough but now I am realizing that I don't drink nearly enough and that might be why my stomach was so upset.  I have been thinking about what you said all day and drinking more water too.  Thanks for sharing! On a positive note, I picked up my wig today and it looks great, I was pretty nervous as my stylist cut and shaped it, but it looks now just like my own hair.  I brought it home and my two kids had a blast trying it on and taking pictures.  It really helped them feel at ease with it and we got some much needed laughs. ",
      "MessageIndex": 222,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 19, 2010 02:38PM LauraM wrote: fotopet - I am sorry you had such a rough 1st tx, but it looks like you are in good hands with the nurses there.  Jenny B - Good luck today on your tx.  I am hoping for min, side effects for you. Juliebed and Snipinfool - good luck and remember to drink lots of water!  I hope all goes smoothly for you both. Summer38 - You and I are on the same treatment, I will be having my second tx tomorrow.  I had some SE's but compared to what I have read from others they were minimum.  Day 1 and 2 no SE's, day 3 my stomach started to turn and stayed that way thru day 5,   Day 6 woke up feeling nauseous but by mid day it was gone and have been feeling better every day.  Every once in  a while I will have an afternoon where I am bone tired, so as long as I nap, it seem to work it self out.  I hope that you have even less SE's than me. Have a great day!",
      "MessageIndex": 347,
      "PostDate": "19/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 11, 2010 10:05AM LauraM wrote: JennyB - My prayers are off to you and your family!  Way too much to be going through at this time. Photopet - I wore a hat with hair on it the day after I buzzed my hair and and got a rash all over my neck and back to the head.  Put cortisone cream on it for a few days and that helped.  I figured it was heat rash because it was 90 the day I wore my hat and had it on for 8 or 9 hours.  I hope you feel better. Question - Has anyone out there had problems with blisters on their feet?  I have been having cracked heals, cracked area's between my big toe where flip flops would go and then a few blisters on my feet.  Today my feet are very achy, even if I am sitting around they throb.  I usually try to walk every day and the last two days the walks have been very painful.  I hate to quit exercising but achy feet make me cranky!  I called my onc today and I am waiting on a call back to see what they say.  I really hate all these side effects!!!",
      "MessageIndex": 676,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 14, 2010 11:47AM LauraM wrote: LibraryJenn - I also started getting the mouth sore, mine started after AC #2.  I started using Biotene toothpaste and the Biotene mouth wash and they have been much better this time.  I got them a little bit, but very mild compared to last treatment.   I also rinse with saltwater when they are really bad. Day - I am still chuckling about the mosquitoes.  I really thought until this weekend that because of Chemo they were staying away from me.  I was thinking with all the SE's I have been getting,  I could really handle if the chemo kept the bugs away.. but this weekend I had to put bug spray on... so much for that!  Barb - Sorry about your son, mine is 11 and we have been worried about him lately too.  He seem to be to quiet and keeping everything in side.  My dh and I talked about it last night and he is going to make an effort to do more things with just him to see if he can get him to open up on his feelings. Packjen - I hope your rash feels better soon! LibraryJen - My doctors gave me the choice of a PICC or a port and I chose a port because with everything else going on, I didn't want the maintenance of wrapping it and taking care of it for the the summer.  My port has no maintenance and no swimming restrictions. My last AC is Thursday!!! YEAH.  My RBC was low last time, so I am hoping that it stays at a good level so that I don't have any issues with finishing AC.   I hope everyone else is having as good of a day as you can! ",
      "MessageIndex": 703,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 20, 2010 09:06AM LauraM wrote: Good morning ladies -  What a busy weekend since my last AC on Thursday.  As usual, I am on my steroid high and really still feel OK to get through the day.  Yesterday we spent half the day at the emergency room because my dd(age 9) took a line drive to the nose while playing 3rd base in her softball tournament.   She was wearing sports glasses so that helped stop some of the force to her nose.  Well the xray's show a hairline fracture to the nose bridge, but no displacement so she just has to let it heal.  She was so brave it was amazing!   I still hear the sound of the ball hitting her glasses when I close my eyes, I think it will take some time to get over it.   She woke up a little while ago and she looks pretty good.  We were expecting her to have two shiners but so far just a tiny bit of swelling under her eyes.  Lucky girl we have! sacphotomom- I hope you feel better when you wake today and don't feel so run down.  I usually get that same way days 4 and 5 after my AC treatment.  I woke up today with the yucky mouth taste that turns my stomach when I swallow when my mouth is empty.  This is what seems to make me want to eat all day long during this period.   Then of course the stomach gets bloated... I will be glad to get through these last side effects.   Thanks for Aloe Vera suggestion, I am going to get some today.  The feet are feeling better the last few days but my onc said they will get worse again before getting better on Taxol.  njbhwgirl - Congrats on your granddaughter's Christening!  I hope you have a WONDERFUL day for it.  Jen - I love all your Chemo Party stories, thank you for sharing them with us.  You have great friends. Drim - I hope your period issue resolves itself quickly, It is enough with everything else you are going through to go through that also.  I am very impressed that you are working through treatment.  I thought I would but had some surgery side affects that along with Chemo have kept me out of work.. I don't know how I would have done it.  Happy Fathers day to all the wonderful men who are supporting us during these tough times!",
      "MessageIndex": 760,
      "PostDate": "20/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 28, 2010 08:31PM LauraM wrote: Judy - It must be fun having a baby around, especially one that you can love and then give back and  go home.   I do love the smell of babies.  I am not sure if I will be getting radiation or not yet.  I have to go back to Sloane to get their opinion when I am done with chemo.  I am hoping I don't have to, I am really ready to be done with this.  Paxton - Good luck with your tx tomorrow, mine is Thursday and I am already dreading it.   I am really nervous how my body will react with Taxol.   Anyone that is looking for really good wraps that don't cause you to overheat or get rashes, check out buffwraps.com.   I read about the buff wraps on another discussion string a while back and have 6 of them now in all sorts of colors, they are my little fashion statement.  The are very comfortable and you can even get them with UV protection if you need them.    Sacphotomom - Sorry to hear about the boat.  That really sucks! Leanna: Congrats on winning the cleaning.  What a nice thing to win. I hope everyone has a good day tomorrow.",
      "MessageIndex": 828,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Aug 7, 2010 04:45PM LauraM wrote: Good morning ladies!   Day - be careful to monitor your system after you finish the antibiotics.  I ended up with C-Dif (also called the Super Bug in hospitals) two weeks after I finished my antibiotic for a sinus infections.  The first symptoms were multiple looser bowl movements a day.   I thought at first it was from the Taxol but called the doc and I had to do a stool sample (lots of fun!) and it came back positive for C-Dif.  If you catch it early not a big deal, but it can be a problem if left untreated.     C-dif is when the bad bacteria that are  normally in your stomach and intestines take over after the antibiotic kills the good bacteria.  I was on probiotics and it didn't stop me from getting it. Redbarb - That is awesome that you participated in such a good cause.  Even better that you are feeling up to it!  Leanna - I hope your tummy is feeling better today.  I had lots of problems with my tummy on AC, it was the worst part of it.  I found that if I took stool softeners it helped because all the steroids can constipate you.  My tummy got better each time so I hope yours does too. Packjen - thanks for the advice on Rads.  I had a double mastectomy also and was thinking I did not need rads.   The only reason they think I need them is that my age is/was 45 when I got bc.  All my margins were good and all of the other items they look at to see if you need rads were good also.  It was just that I am 45 and had 3 nodes positive.   I hate being in the gray area, hopefully the docs on Tuesday will have some insight for me. Kim - love how inventive you are with the wig.  I hope it works to keep you cool.  I have to go back to work soon too and wear my wig.  Will be a big change since I wear wraps when I go out and nothing most of the time at home. Patricia48 - Paris sound like so much fun!  I can't wait to hear all about it.  When will you go?  We are off to Cooperstown NY with friends for the next few days.  I have to go and finish packing up.  I will try and get on from my mobil phone to check on everyone but not sure how good the service will be were we are staying.  Have a great weekend everyone!",
      "MessageIndex": 1229,
      "PostDate": "07/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Aug 16, 2010 10:05PM LauraM wrote: wellsey66 - I voted for you too! KimLovesDachshunds - I am sorry you had a nasty cold... glad you are feeling better. Summer38/NJ - The Taxol causes a lot of bone pain for me too.  Just like you said, it is worse at night.  I find that during my worst couple of days the only thing that helps me at night is heavy duty pain killers.  During the day, I end up taking 3 or 4 advil when it gets too bad.  Since my last Taxol was last Thursday, they did not give me a neulasta shot and my bone pain was less this time then the last three tx.  It was still there, but I did not have one of the really bad nights that I had had in the past.  I hope the overall bone pain doesn't last as long this time, last tx the bone pain came and went almost the whole time.  Not really bad, but enough for it to be annoying. Patricia48 - Glad you hemoglobin was up and you didn't need a transfusion! Daiva - I agree.. Go to Paris.  Sounds like so much fun! LibraryJenn - I am sending you extra prayers that your tumor starts to shrink!  Keep up the positive attitude! Have a great night!",
      "MessageIndex": 1308,
      "PostDate": "16/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Sep 17, 2010 04:28PM LauraM wrote: Hi Ladies.. I just had a long post to everyone typed out and some how it disappeared while I was writing it... I stepped away for a second and went back to it and it was gone..ugh!  Maybe that was God's way of telling me I was being too wordy today!  LOL Irishness - My feet just ache when I am on them for any length of time.  It started when I had the blisters while on Chemo and then even though the blisters are gone, the achiness is still there.  I am sure it will get better soon. GolferGirl - So glad for you that you are done!  So how do you feel about being done with treatments? Daiva - I would love to hear your F monologue also, I bet it is hilarious.  Sacphotomom - I had a sinus infection and was on antibiotics during my 2nd or 3rd tx and didn't miss a treatment.  Madga - Only 2 more left!  YAH My rad dry run is Monday then Rads start on Tuesday. I will be glad to get them started so I can be done.   My hair has been growing back for sometime now, but in the beginning it was colorless wispy stuff.  Just recently I am seeing color, like a 5 O'clock shadow on my head, I am guessing this means that my hair is really coming in now. YEAH.  Has anyone experienced joint achiness since they have been done with chemo?  Just in the last couple of days my knees, wrists and shoulders are achy in the joints.  Was thinking this was a reaction to all the steroids getting out of my body.  Any thoughts? If I missed anyone.. sorry, didn't mean too!  Have a great day.",
      "MessageIndex": 1579,
      "PostDate": "17/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 4, 2010 10:34PM LauraM wrote:  Hi All - I am also new to this discussion area.  I am glad to have found this forum, I have already learned so much from reading all the old posts.   I am 45 married with a daughter 9 and a son almost 11.  I went for my yearly mamogram in October and they saw microcalcifications in my left breast that they thought were suspicious.  I was brough back in for futher mamograms to verify and then sent for a biopsy in November.   On November 13th I was diagnosed with DCIS and was sent for an MRI.  The MRI showed a lot more extensive DCIS then the mamo.  I had my lumpectomy on 11/30 and 4.5 cm of DCIS along with .8cm of ICD was removed.  I have a high grade comedo type DCIS.  Dr. called a few days later and told me they didn't get clear margins in 16 out of 20 blocks around the lump and that I would need to come in to discuss my options.  Boy was I stunned, here I go from having a \"nothing\" stage 0 pre-cancer (all the doctors words) to a stage 1 bc needing my lymph node removed and having to decide if I want them to go back in and take out more to try and get clear margins or have a mastectomy.      I went for second opinion at Sloane Kettering and they recommended a Mastectomy due to the extensive DCIS.   My bs thinks that I should let  her go back in and do another lumpectomy to get clear margins and that I should not rush into the mx.  If she doesn't get clear margins this time, then she would recommend a mx.   The pathologist working with my bs thinks that my bs won't  to get all the bc and that I should get a mx now.  I keep going back and forth not knowing what to do.  Can't decide whether to just jump in and get a mastectomy now.. and maybe a double to have it all over and just get reconstruction (too many choices there too).  Lots of decisions to make.  I have been taking the last couple of weeks to think and I am still not sure what to do.  I will get BRCA tested on Wednesday since my mother is adopted even though she has found her two 1/2 sisters and no one in my family has bc.  I meet with the bc on Thursday and I am sure she is expecting a decision.   Sorry to ramble on so much... sometimes it is good to just get it all out. Thanks alot!!!!",
      "MessageIndex": 1499,
      "PostDate": "04/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 11, 2010 10:17AM LauraM wrote: Ronqt1 -  I saw that you are from East Hanover NJ... I am also from Northern NJ.  I use to work in Roseland, but now work in Newark.    I was diagnosed in Nov right after you.  I am in the process of deciding whether to have a 2nd lumpectomy or go for the double mx...  I hope you can keep your spirits up!  I think that these first few months are the worst expecially mentally.  Let me know if you would like to chat!",
      "MessageIndex": 1608,
      "PostDate": "11/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 14, 2010 09:57AM LauraM wrote: Hi Ladies!   Welcome Grace and Chris! I did it.. I finally made my decision... it has been 1 long month of going back and forth in my head.  I am scheduled for a double mx on February 22 with immediate reconstruction.   I am nervous but good with my decision.  I will still need to wait the results of the removal of my lymph node to see if any further treatment will be needed.  I am glad to finally look to recovery and to get my new set of \"perky ones\".",
      "MessageIndex": 1709,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 24, 2010 11:12AM LauraM wrote: Ericka09 -  You are such an inspiration to me!  I also spent lots of time on these posts screaming Mastectomy/lumpectomy.  Everyone kept telling me to listen to my gut, took me lots of time going back and forth before I really knew what my gut was telling me.  I am scheduled for a dmx on February 22nd.  I am nervous of course but am looking forward to getting this cancer out of me!  It has been amazing how I have transformed from a woman who really LOVED her breasts to one that looks down at them and only sees Cancer. I never thought I would be that way, but I guess you don't know how you will react until it is you that is faced with that situation.  My doctors recommended a single mx after they couldn't get it all and the path reports were not good from the lumpectomy but they absolutely did not think I needed a double.  I too am going against what they recommended and getting myself a set of \"healthy ones\".   I would like to steal your saying from above, it is the best one I have seen.    -\"Dam right they are fake! The real ones tried to kill me!\" Have a wonderful day!",
      "MessageIndex": 1793,
      "PostDate": "24/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Nov 12, 2010 11:50PM LauraM wrote: Patricia - My RADs focused on my Clavicle, lumpectomy area, total breast and under my arm.   I really didn't get sore until I was done with all of them.  Good luck to you. Latte and Magda - I understand now.. makes sense that they would want to take out the tissue around the clip and test it. When I had my SN's out, they lab tests came back negative for both but they found  was some bad cells in 2 places outside the lymphatic channel, ended up going back in and taking out the rest of my nodes and they found cancer in 3 of my nodes.   Make sure the surgeon has the pathologist check the fatty tissue around the lymph nodes.  If mine hadn't I would still have two small tumors and my who knows how many cancerous lymph nodes by now still in my body. ",
      "MessageIndex": 1875,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Feb 11, 2010 09:45PM LauraM wrote: Cake - you are too funny!  When I went to my PS on Monday I asked also asked if he could liposuction my legs and butt while he was in there... he just chuckled at me and said one step at a time.  I think he just wants to keep me coming back . Kids were off of school again today so I worked from home for half a day and did get to take them skiing for the afternoon.  I guess that is one thing that you can say about getting BC, it is making me slow down and not work as much.. well at least when the kids are awake!  I am off to catch up on everything I didn't get done earlier. Goodnight to you all!",
      "MessageIndex": 1981,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 1, 2011 04:00PM LauraM wrote: Happy New Year Ladies!   As I look back on this past year, I am amazed at how much my life has changed. How many new friends I have added to my circle was the thing I didn't expect the most and feel so blessed about!   Now that all my surgeries are done, chemo and rads are a thing of the past I find myself wondering a lot what 'normal\" is suppose to be now.   I am back to work, and finally feeling like my mind is reengaging in work and not always thinking about the \"C\" word.  I do find though that with every twinge and weird feeling, I start to second guess my body and start going down the path of worry again.   Jen - I just went for my first trim on Tuesday, felt kind of weird, but wanted to have my hair neat because I am going back to work on Monday without my wig.  I am glad to be shedding it, but a little nervous about the whole thing.  I do like my hair short...it is coming in very nice and looks slylish short.  Everyone says I should keep it short.  We will see. Jersey - How much snow did you get?  We got 22 inches in Northern NJ, but we are in Point Pleasant this weekend and they got almost 3 feet here.  We come here every year for New Years and it is weird to see most of the boardwalk closed. Drim - I hope you enjoyed New Years Eve in the City Patricia - A trip to Asia - that sounds wonderful!  I am hoping to get to Japan this year with work, a trip was planned last January but then I got sick  so couldn't go.   My boss assures me this year I will get to go, I wish it wasn't so expensive to fly their, would love to take my whole family.  Enjoy the time with your sister! Magda - Waiting on your rads.. is that tough?  Mine was pretty much rushed on me, so I didn't have too much time to think about it.  The waiting always seems like the worst to me. Thinking of you all!",
      "MessageIndex": 2025,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Feb 19, 2011 11:35PM LauraM wrote: Hello -  Just checking in with everyone.  Been a very busy couple of weeks.  I had my 4 month checkup on Feb 1st (all was good..YEAH), My husband turned 46 on February 3rd (finally catching up to me!) and  my son turned 12 on Valentines day.   I have been really busy with work and shuttling the kids back and forth to all of their millions of activities.   I try to keep postivie but it still ways heavily on my mind that some day this disease will come back.  My dear friend lost her life two weeks ago to this disease and it is still so frustrating that women still suffer so much and no cure seems to be near. Thoughts and prayers to everyone! ",
      "MessageIndex": 2203,
      "PostDate": "19/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Mar 26, 2010 09:28AM LauraM wrote: Hi Ladies - I received my oncology report back this week and they found cancer in three of my lymph nodes so they changed my stage to a stage 2, ugh!  Chemo will start for me the end of April.  So I will keep checking in with this group but will be looking to see if there is a stage 2 group that I can join. Lots of pink love out to you all.  Have a great day!",
      "MessageIndex": 2291,
      "PostDate": "26/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Aug 1, 2011 09:20PM LauraM wrote: OMG... I am just devastated about the news about Jenn... I have to admit, I have not checked in for a while, been crazy back to work and with the kids, but I never expected this.   My heart is just broken and I feel like I can't breathe. This disease is just so horrible.  My heart and prayers goes out to Jenn's husband and son... I hope everyone one else is doing well and I will do my best to check-in more often. Hugs to all!",
      "MessageIndex": 2498,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Aug 6, 2011 06:36PM LauraM wrote: You are all so wonderful!  I read all of your posts and think how amazing it is that you have all been through so much and how easily you only think of others.... You are right, that little boy is going to need to so much love and support.  I think I had read earlier that Jenn had taken video of herself.. what a wonderful gift to her son.  That one gift will help him to know and understand what a selfless person she was..  I hope you are all having a wonderful weekend!",
      "MessageIndex": 2513,
      "PostDate": "06/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Sep 14, 2011 05:41PM LauraM wrote: Linda - That is wonderful news and a great story.  I am glad it is going to get told.  When I was first diagnosed a friend of mine gave me a couple of books that told different women's BC stories and how they survived.  They were very helpful to me so I am sure your story will do the same for other women.  Well - I got  my tatoo's today!!!  My Plastic Surgeon (who is awesome) did them in his office this morning.   I think I surprised myself on how much it made me feel complete to have the tats done.  My breasts look great and I can officially close that chapter of my life.  I am off to Japan in a few weeks with work for 1 week, which is very liberating.  I had just gotten my passport to go there when I found out I had cancer almost 2 years ago.  It will be great to get over there and be able to work and be a real part of my work team. Have a great day.",
      "MessageIndex": 2564,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 21, 2010 09:49AM LauraM wrote: MRDRN - I had a lot of discomfort after my SNB were removed also.  I worked really hard doing the exercises they gave me for a couple of weeks and then went to physical therapy to a place that specialized in understanding how to help me with out causing lymphedema (which I was the most afraid of!)  I just finished my PT and my arm it back to normal.  Good luck!",
      "MessageIndex": 2860,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 15, 2010 11:52PM LauraM wrote: labarbera2006 and Catlover - I am so sorry to hear that both of you have to continue to struggle with the bc beast.  My heart and prayers are with you both as you journey down this new path in your fight.  Just remember that we are all here to support you!",
      "MessageIndex": 1738,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Feb 2, 2010 10:29PM LauraM wrote: Irishmon and Running-girl - That is wonderful that you got clear margins!  You must feel very relieved!  My lumpectomy was 4.5 cm and they only got clear margins on 4 our 20 blocks around the cancer,. so back to surgery for me later in the month.  I am not sure if I will need any other treatment after my bmx, depends on what they find.  DenverDiva - I am praying that your biopsy results are good!",
      "MessageIndex": 1901,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Feb 5, 2010 12:50PM LauraM wrote: Congrats to all for clear nodes, completing radiation & Benign results! ",
      "MessageIndex": 1927,
      "PostDate": "05/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Feb 10, 2010 10:41PM LauraM wrote: Hello Ladies -  We have had 12 - 14 inches of snow so far in Northern NJ and it is still snowing.  I don't mind it too much, it is so pretty, but school is now closed for another day.  I usually work from home when it snows, but may take the afternoon off to take the kids skiing.  I only  have 11/2 weeks before my next surgery so I want to do has much as I can before all of my restrictions take affect.  I hope everyone is enjoying their week!",
      "MessageIndex": 1978,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 7, 2010 08:26PM LauraM wrote: Good evening ladies!  I hope everyone is having a wonderful day and feeling good!  Well wento the bs today and she was so great!  She spent so much time with us today and really wanted to understand my mind and feelings. Not sure what I expected, but I like her even more now.   I think I have a direction but I am going to sleep on it and see how it feels tomorrow.  Have a great night and thanks for all your help!",
      "MessageIndex": 1561,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 26, 2010 10:10AM LauraM wrote: Labby - My thoughts and prayers are going out for you and I will be thinking and praying for you on Wednesday!  Keep the Spirit!",
      "MessageIndex": 1813,
      "PostDate": "26/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Mar 26, 2010 05:52PM LauraM wrote: You all are WONDERFUL ladies!  You have really made me smile tonight and for that you all Rock!  Thank you for asking me to stay, I will stay, because you are all great and have been such a great help with my journey!",
      "MessageIndex": 2297,
      "PostDate": "26/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 10, 2010 08:23PM LauraM wrote: Hi Jean -  Good luck on your first fill tomorrow!  I did start my first doses of AC on Thursday and overall I guess I am handling it well.  The first two days were no big deal, Saturday I started to get more tired and a little unsettled stomach and Sunday was about the same.  Woke up today feeling better, went for a walk and then spent the rest of day in bed with a yucky belly and very very tired.   My stomach is better tonight, so I am hoping that I wake up tomorrow really feeling back to normal.  I have not been sleeping well the last two nights, so hopefully that will be better tonight.  I am so not the spend the day in bed kind of person, so I am ready to feel better :} Barb - I hope your chemo goes uneventfully. Harley - Good luck on your walk!  I am walking in the Relay for Life walk here in NJ on June 4/5th, I have a team ready to walk with me, so it should be a good time.  I hope everyone else is doing well!",
      "MessageIndex": 2678,
      "PostDate": "10/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 11, 2010 01:21PM LauraM wrote: Musiclovermom Thanks for the encouragement!  If you don't mind me asking.. what type of reconstruction did you get?  I think that is the last part of my decision I am trying understand more about now. Thanks again!  Laura",
      "MessageIndex": 1613,
      "PostDate": "11/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Apr 15, 2010 10:18PM LauraM wrote: Mouse6 - I am glad your BRCA test was negative that is such good news.  I am not sure what type of stitches they will use the next time.  I think my ps was not happy about the grade of sutures /materials the hospital I had the surgery  in used.  He a made a comment in the past when I first started having  an allergic reaction to the wire sutures and he now thinks that the the synthetic sutures (looks like fishing line) are causing an allergy.    My oncologist called me earlier tonight and does not want me to wait too much longer to get Chemo started and if my ps wanted to open me back up she wanted him to do it sooner rather then later so I can start/finish healing.  I told her I wanted to wait until after next weekend because we are flying to Indiana for my nieces first Communion.  She told me that if I needed the surgery that was too far out and that I shouldn't go to the Communion.  I think she was thinking that I was taking the whole bc lightly, which I am not.  I just don't want to give up everything when they really don't know why I am not healing.   She did tell me some good news today that my Bone Scan and CT of the abdomen were both clear so that was great news.  These are the first good test results I have had.   So I will know more about the surgery on Monday.  Carol66 - you give me hope about going back to work while on Chemo, I was hoping to be able do the same so I am glad it is working out for you.",
      "MessageIndex": 262,
      "PostDate": "15/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Apr 27, 2010 10:29PM LauraM wrote: JustmeAlicia- I was just informed today that my first day of Chemo will be next Thursday May 6th.  I will be on dense dose (every two weeks) Adriamycin/Cytoxan (AC) 4 doses and then Taxol 4doses.  I got fitted for my wig today and have a cousin who sent me her old baseball hat with hair on it and a couple of scarfs that are nice.   I get my port put in on Monday.   I guess I am all set, just getting nervous about it.  I really hope I handle it well, especially the first one since my anniversary is May 10th!.  I did get to go to Chicago this past weekend and had a wonderful time.  Our plane ride home got canceled so we had one extra night with family, it was a nice \"extra\".    We came home last night to find out that water heater sprung a leak into our new finished basement...ugh, it never seems to end.  My neighbor is here right now fixing it, so we will have hot water in the morning which is a blessing.  Tomorrow will be spent calling the carpet folks to see if they can come and help dry out the new carpet so we don't loose it.  It was just put in the end of November.  It is funny now a days that things like this don't seem to bother me as much as they use to. ",
      "MessageIndex": 284,
      "PostDate": "27/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 6, 2010 04:24AM LauraM wrote: Hi Ladies, I will be starting Chemo tomorrow 5/6.  Been hanging out in the April 2010 chemo group reading all their posts to learn as much as I can.  I will have dense dose - AC x 4 every other week and then Taxol x4 every other week followed by something for the next 5 years... probably Tamoxifen. I hope everyone is not having too many side effects so far!  Keep the good thoughts coming.",
      "MessageIndex": 125,
      "PostDate": "06/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 7, 2010 03:07AM LauraM wrote: Hi Ladies - I had my first AC today, they started off with giving me Decadron (steroid), Aloxi and the Emend for nausia.  Then they gave me Adriamycin then Cytoxan.  All in all the whole experiences was rather good.  The nursing staff was great and my friend and husband joined me and the time went by really quick.  I am feeling good so far, hoping to keep feeling this good!  I go back tomorrow for Neulasta shot. msbtl - I hope your day was was good and your are handling everything well!",
      "MessageIndex": 137,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 2, 2010 08:59AM - edited Jun 2, 2010 09:00AM by LauraM Sacphotomom - I hope your treatment goes well today. I was a lot more tired with my second treatment also so maybe we will both have it easier this time.   I had really bad mouth sores this time which really suck, when I go tomorrow I will ask for a prescription for a mouth wash.  I am off to the store today to buy some claritin.  It is worth a try since I had a lot of muscle soreness last time and would love to not have that this time. I have a team walking this weekend in the Relay for Life here in my town.  I am looking forward to it, I hope the weather is good.   I think there are about 30 people who are walking with me... Great friends I have.",
      "MessageIndex": 542,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 9, 2010 05:08PM LauraM wrote: Barb - I raised most of the money through direct donations of my friends and family.  We did do some fund raising at the event doing a baked sale which went well.   I used Facebook as a way to get the information out to people that did not live near me and that helped out a lot too.   I love your shirt!  I downloaded that song and my dd and I play it often.  I might have to get a t-shirt made like it.    The mouth sores lasted about 5 or 6 days last time... they weren't life stopping but annoying.   This time my stomach has been upset a lot more than the last two tx.  I can't seem to get past that and the metallic taste in my mouth.   Started to get constipated yesterday even though I am taking stool softeners, this happened last time too, so I started taking the softeners prior to chemo this time hoping it would help, but no such luck.  Oh well, this too will pass.",
      "MessageIndex": 629,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 17, 2010 09:40PM LauraM wrote: Hi Ladies - I just finished my 4th AC today and hopefully will have less SE's this time.    I had called the doctor the other day complaining about my feet hurting & aching, blisters and peeling of my feet.  The nurse called me back leaving a message and said that it sounds like Hands and Feet Syndrome but the chemo I am on does not have that as a side effect and to call them back if I have any questions.   That pretty much pissed me off and I didn't call back.  I went on  to have a really bad weekend with my feet hurting.  So at the onc appt.  prior to chemo today she looked at my feet and said that I definitely had Hand and Feet syndrome.  I was upset and told her about what her nurse said to me on Friday.   She said that it is rare and I am only the 4th patient she has seen this in that is on AC and all have been on the AC dose dense.  Not really much that I can do with but it does help to know I am not crazy.  The only thing she said that would help it was moisturizers.   LisaNJ - Welcome to the group, I am sorry you have to be here, but you will find lots of good information here and a sounding board for all the times you are frustrated with doctors, nurses, kids, husbands, neighbors..etc.   I have that horrible taste in my mouth also that makes me gag.  I can't seem to get past in and it makes my water taste so terrible.  I also get the mouth sores and have been doing the biotene mouth wash and that has been helping. Summer38 - I have started to get the eye tearing also.  I didn't mention it to my onc today, wasn't really thinking of it.  They don't burn, just tear all the time. Sorry this is so long...I hope everyone has a great day.",
      "MessageIndex": 736,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Aug 6, 2010 03:36AM LauraM wrote: Hi Ladies!  I have been off line for the last couple of weeks keeping up with two active kids (swim team, boyscout camp, soccer camp etc..)  and believe it or not, my dh and I got away for the first time in quite a few years without kids.  We went to Atlantic City for the weekend and had such a great time, didn't win, but we didn't care!  My dh's parents had the kids and they are wonderful so it was easy for us to relax knowing that they were well taken care of.    I just got finished reading all of the past posts.   It is amazing how much happens in two weeks.  I am glad everyone that went into the hospital is out of the hospital and I hope feeling better.  I am very excited for everyone who has finished chemo, what a wonderful summer gift!  for those of us still going through the chemo,  I will pray for minimum SE's.  As I read the posts, I realize how different we all are but how much we are all the same, it really is amazing being a part of this group!  Thank you to all! I had my third Taxol last Thursday and have spent this last few days suffering the terrible bone pain and general achy and weakness in  my legs.  I started to get the blisters on my feet again the last two days, mostly on the top these days but they are ugly and bothersome!    The achiness was better today and I am hoping tomorrow I will start to feel back to normal.   I will have my last Taxol next Thursday August 12th, I can't wait for this to be over. I was told by my Onc that I will not need to have the Nuelasta (sp) shot after my last chem so hopefully my bone pain will be more tolerable.   I plan on having a thank you party in September for all of my wonderful family and friends that have so selflessly taken care of me and my immediate family all of these months.  I am truly blessed to have such a great support system. For all of you starting Radiation already... what made you decide to do radiation?  My doctors say I am in a gray area for needing it.  We went to Sloane Kettering today for their opinion and the doctor we saw pretty much said the same thing.  She went through this whole rating sheet of what they look at to decide and the only things that I had that were on the Radiation side were that I had 3 nodes positive and I was 45 or younger when I got bc.   Having 3 nodes positive was not a factor in itself, it only became a factor because of my age being 45 when I got cancer.  All other items they used to rate were negative and were on the side of not needing radiation.  But because of my age, she thinks I should consider it.   She is presenting my case to the rest of the onc. board on Tuesday and will get back to me with what their opinion is.  I really don't want radiation, I want to be done with this all and get back to \"normal\" what ever that means but I don't want this to come back either.   I hate decisions like this especially when I have heard such negative things about the longterm use of radiation and that most of the information used for the rating was based off of people who had a completely outdated chemo regimen than we are all getting today. I hope all these hot flashes mean that I am going into menopause early, I would hate to have to go through all of these again later. :}  Have a wonderful night and sorry about the long post!",
      "MessageIndex": 1211,
      "PostDate": "06/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Aug 6, 2010 03:29PM LauraM wrote: Just thought of something I meant to pass on last night.  For everyone talking about hair growth, a women I met in Chemo told me about a product called Nioxin that you can buy in salon's.  Originally it was for patients that have for Alopecia (early hair loss) and now is being marketed to help with thinning hair too.  I finally got around to purchasing it two weeks ago and since I have been using it, my hair has already grown about 1/4 of an inch.  I use it every time I shower.  It is a little pricey, $45-$50  for the startup kit, but if it keeps on working I am OK with it. Summer38 - For the blisters I put antibiotic ointment on them and then top it off with bag balm ointment.  The really just have to run their course it seems.  Hopefully they will heal quickly.",
      "MessageIndex": 1215,
      "PostDate": "06/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Aug 12, 2010 10:58PM LauraM wrote: Hi Ladies - I am back from Cooperstown and we had a great time, it was nice to get away and relax with friends and family.   I just finished my last Taxol today.. YEAH!  No Nuelasta shot tomorrow so I am hoping  I am not as achy since the last one was pretty brutal.    I am still trying to figure out Radiation, The Sloane doctor we saw on Thursday sent my case to the oncology board on Tuesday and called me last night and said that they recommended that I get radiation because of my age (45) and that I had multi-focal tumors.   It was interesting because the doctor we saw at Sloane never mentioned that my tumors were multi-focal when she gave her opinion.  She was just too inexperienced and really not prepared when I went there..  My Oncologist is calling her friend at Sloane who runs the radiology oncology department to get her opinion and then once we have that I will make a decision. GoferGirl - If I have Rads, I will also start Tamoxifen at the same time.  I got a prescription today to start Tamoxifen in 1 month.  Leanna - I hope you are feeling  better.  Barb -Glad the MRI was good.  I hope that your tattooing goes well too.  njbhwgirl-  Wow.. I can't believe you woke without your eyebrows and some of your eyelashes.   I am hoping that since I just finished chemo, I will keep mine, but I have heard that some folks loose theirs up to one month after..I hope not.  I have been using Nioxin on my head, eyebrows and eye lashes for the last 3 weeks and I am hoping that is helping to keep mine since my hair has grown since I have been using it. sacphotomom- Interesting what they told you about not golfing or rowing because of lymphedema, my doctors said that if it is something your body is use to doing, you can continue it, just don't go out and start new things with out easing into them.  I think every doctor has their own opinion.  LibraryJenn - Wow what a fish.  My 11 year old son is going to be so jealous when he sees this picture.  He is an avid fisherman and is still waiting to get that big fish.  Congrats on catching it.  Paxton - My thoughts are with you, stay strong you can do this.  Summer38 - I hope your 7th treatment went well and you don't have too many SE's.  To everyone else I missed on this post, I am thinking about you sending good thoughts your way.",
      "MessageIndex": 1272,
      "PostDate": "12/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Aug 13, 2010 12:03AM LauraM wrote: I just got caught up on the April posts and there was a link that I thought I would share. As we're all heading towards the end of all this treatment I think it could come in handy - I was nodding my head in agreement all the way through as I read it. http://www.cancercounselling.org.uk/northsouth/extra4.nsf/WebResClient/1761049276601BD68025735B00604834/$FILE/article3.pdf?openElement",
      "MessageIndex": 1274,
      "PostDate": "13/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Oct 4, 2010 10:29AM LauraM wrote: Hi Ladies -  I have been so busy being back to work and going to rads every morning (70 miles round trip) that I have not had time to check in for a while. Everyone that is taking a trip, have a wonderful time!  Congrats to all of you that have finished chemo and are done with Rads.   Denise, I am glad you are out of the hospital, I hope you are feeling stronger soon. njbhwgirl - I hope your mom feels better soon! Jen - love the short hair.  Mine is coming back pretty quickly now too.   It is dark brown mixed with more gray than I had before I started..lol.  I am hoping that as it fills in, the gray won't be as noticeable.  Magda - I am glad you are feeling better. BC STORY - This weekend I ran into old high school  friend of husbands who has over the years become a friend of mine, she was diagnosed with breast cancer 7 months after she had given birth to a severely handicapped little boy.  I have seen her every year or two since her diagnosis but had never talked to her about bc until this year.  Since she was treated for bc, she has added a little boy and little girl to her family.   While talking about her treatment with me (chemo and rads after lumpectomy) she realized that most of the details of her treatment are fuzzy, like child birth she said she no longer remembers all the details  She said that she doesn't let bc define her.   She said \"I had breast cancer and I don't like using the word survivor because it gives bc too much of a hold on my life\".   Her saying this really has been making me think how I want to be defined.  I  can't wait until bc is no longer the first thing I think about when I get up and the last thing I think about when I go to bed.  It gives me hope when I talk to people who no longer have bc, and I realize that there is a life after this disease.  I have just finished my 10th rad today and I am feeling good so far.  I put fresh aloe from my plant on before and after each session and that it appears to be working.   My feet no longer have blisters and the achiness is getting less and less so I hope that means the chemo is finally going out of my body.   My eye lashes and almost all my eyebrows  fell out about a month after my last chemo and they are finally starting to grow back so that is good too.  I hope you all have a wonderful safe day!",
      "MessageIndex": 1682,
      "PostDate": "04/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Oct 26, 2010 10:16PM LauraM wrote: Hi Denise - I am getting 4 different radiation treatments each day.  My radiation was pretty easy the first 3 1/2  weeks,just a little redness in the clavicle and on the inside of my left breast where they are doing a specific electrons radiation treatment.  I don't remember those two area's getting a rash before they got red but that might be because I was a litte tan in those area's.  In the last  week or so the rest of my breast and on my side and underarm  did get this dotted rash.  Since Saturday my underarm area is very tender.  I asked my rad doc about it today and he said that it is normal to get the dotted rash before turning pink/redder and that is one of the stages of the radiation.  He said it will probably get worse for the next week or so and then start getting better.    I have been using fresh aloe ( I have gone thru 2 small plants already) and that seems to be helping my skin a lot.  He said my skin held up very very well, better then he expected with the amount of treatment I am getting. I hope this helped!",
      "MessageIndex": 1805,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Dec 25, 2010 10:15PM LauraM wrote: Merry Christmas to all my wonderful friends.  Even though I have not had much time to get on and post, I have been reading all of the posts from my phone.  I think of you all often and I am grateful for each of you.  Please have a very safe Holiday Season!",
      "MessageIndex": 2011,
      "PostDate": "25/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 29, 2010 10:43AM LauraM wrote: Melinda41 - I just read your letter, WOW it had me in tears from the beginning.  Thank you for putting it in writing for the rest of us!  I am having my bilateral on Feb 22nd, so I am thinking about how I want to document it all.  I already took pictures of my pre and post lumpectomy, just to have.  Thanks again!",
      "MessageIndex": 24,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/741285",
      "Title": "A letter to my boob Melinda41 JanetinVirginia"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 9, 2010 01:48PM LauraM wrote: Hi ladies -  I started my AC on Thursday and the first two day's were uneventful.  The last two have been scattered with a little whoozieness and stomach turning, but over all not too bad.  I am a little more tired today, but I think that is because my stomach keep turning thoughout the night.  I am hoping I will be back to normal by tomorrow. Have a wonderful day and Happy Mothers Day to all the Moms out there! ",
      "MessageIndex": 298,
      "PostDate": "09/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Nov 10, 2010 01:37PM LauraM wrote: When I had my lumpectomy it was because they were removing DCIS, when they got in there they removed 4.5 cm of DCIS without clear margins and found a small amount of (.8m)  IDC hiding under the DCIS.  They did not do SN biopsy at that time because it was so tiny and they thought they had gotten all the IDC out.  Because they didn't get clear margins for the DCIS and it was determined by the MRI that it was more widely spread I ended up having a dmx.  During that surgery they took out my SN and they were negative, but once the lab looked at the tissue around the SN they found the start of two more tumors in the fatty tissue around the SN right next to the lymphatic channel.   Because of this, I had to go in for a third surgery to remove all of my nodes (14) and three of those were positive.  ",
      "MessageIndex": 455,
      "PostDate": "10/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Apr 17, 2010 10:39PM LauraM wrote: Thanks for all your support ladies!   It is so wonderful to have you all in my life!",
      "MessageIndex": 270,
      "PostDate": "17/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Apr 20, 2010 04:49PM LauraM wrote: Well I got good news yesterday.  My stomach is healing good enough that I won't need another surgery and I should be cleared for chemo either next week or the following week.   It is bitter sweet, not really ready mentally to start chemo, but will be glad to get it done and over with. Happy Birthday Terry!",
      "MessageIndex": 276,
      "PostDate": "20/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 1, 2010 10:24PM LauraM wrote: Curious_one - I am not going directly to MSK but using a local group who are working with MSK for my treatment.  I went to MSK for my second opinion and my doctors have been sending all of my pathology reports to them to get concurrence, My bs and Onc both trained at MSK so when we went there for the second opinion they thought highly of my docs so I just stayed with them    Before my last surgery, my bs sent my path slides to  Dana Farber for their opinion also.   Lorraine5 -  It looks like we will be going through this together.  I am with you on the good attitude, I am trying to use mind over matter to control the side affects since  I have so many things that I want/need to do in the next month.  I hope the good attitude works for both of us! Have a good night ladies!",
      "MessageIndex": 295,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 6, 2010 05:22PM LauraM wrote: Laura (Cake)  Thanks for sharing your story!    I went for the BRCA testing today.. so should know the results of that in a week or so.  I am not expecting that to be positive, but figured I should check it out.  I meet with my bs tomorrow and hopefully I will have make a decision by then, if not may just hold them off until I get my results. All the other posts are making me hungry so I had better go and get dinner going!",
      "MessageIndex": 1529,
      "PostDate": "06/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Mar 17, 2010 10:33PM LauraM wrote: Susu - Congratulations on being 1 year cancer free!  I am hoping to celebrate my 1 year cancer free on March 15, 2011!   Cake - I have a black area on one of my breasts also and my ps said it is just outer later dead skin that will scab off in the next couple of weeks and not to worry about it. It looks gross but I have seen the area get smaller in the last week.   Have a great night!",
      "MessageIndex": 2223,
      "PostDate": "17/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Apr 17, 2010 10:49PM LauraM wrote: Welcome all the newbie's!   I am sorry you had to join this club, but you won't find a better group of ladies to help you along in your journey!  Stay strong and believe!",
      "MessageIndex": 2467,
      "PostDate": "17/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 1, 2010 11:00PM LauraM wrote:",
      "MessageIndex": 2597,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 26, 2010 08:29PM LauraM wrote: Cakeisgreat -  I am glad you asked the question abou being sore from the lumpectomy 6 months out.  I am 3 months out and still sore at the sight which was sort of expected, but didn't expect it to still be so tender.   I still get a tingle type of shooting pain in that breast also and I was wondering if that was normal.. I was thinking it was like that because they took out 4.5 cm, but kind of nervous to ask how long this should all last.  So sorry I couldn't offer any advice back to you, but glad this subject came up so that I could hear what others think.   It also makes me wonder how long I will be sore after my dmx and TRAM. TherelsHope and Brando1mar - Welcome to the group you will find so much information here and it is amazing how strong the women you will meet on this page are.",
      "MessageIndex": 1823,
      "PostDate": "26/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Feb 1, 2010 10:16AM LauraM wrote: Good morning!  I hope everyone is feeling well this morning!",
      "MessageIndex": 1886,
      "PostDate": "01/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Mar 3, 2010 08:25AM LauraM wrote: Cake - One more day!  Prayers and lots of hugs to you!",
      "MessageIndex": 2078,
      "PostDate": "03/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 10, 2010 09:41AM LauraM wrote: Hi ladies - Good luck to those of you starting today or this week, I am sending good thoughts out to all of you!  I hope everyone who has already started is feeling good. I am on day 5 today and still feeling a little bit crummy which I have to say I was not expecting.  I guess I Iive in my own little world and thought I would get though all this with no SE's.. funny me!.  Day 1 and 2 were no big deal, day 3 I started to get a little yucky in the belly.  Yesterday, day 4, was my worst day, but still overall not that bad, just a yucky belly for most of the day.  I did feel better when I had food in my stomach as it absorbed the acid.   Yesterday afternoon I took my Prilosec for my stomach which I had forgotten to do earlier in the day and that helped my stomach last night feel much better.   About 5am this morning my stomach started turning again..ugh.  I got up and went for my morning walk and thought that would make me feel much better, in someways it did, but my stomach is still giving me trouble now.  I am also getting lightning in the middle of my stomach from the Neulasta shot around my sternum where they say the white blood cells start to reproduce.   I guess that is good news since I know my white blood cells are responding properly.  My kids have been really worried with my SE's but I keep telling my them that getting SE's means the medicine is working so that is helping them understand some. My wig is on order and should be in this week, I have a wedding to go to the day after my 2 tx and I am not sure if I should make my head wig ready before that or if my own hair will hold out until after the wedding.  I also saw on a different discussion group about Buff Wraps, they are very soft wraps that feel nice on your head.  I ordered two of them from online and they came in very quickly. Today is my 13th Wedding Anniversary... YEAH!  My dh has been so supportive and super helpful through all of this, I am planning on cooking a nice dinner!  Have a wonderful day!",
      "MessageIndex": 180,
      "PostDate": "10/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Mar 10, 2010 10:04PM LauraM wrote: I think that Chemo depends on a couple of different things, onc score is one, but now like me, they have found 3 spots of invasive, all small,  that makes mine multi-focal and the onc score doesn't matter anymore.  I am now pretty much guaranteed Chemo.  I am just praying that when they do the surgery on Monday to take out the rest of the nodes and the fatty tissue around them that they don't find anything else and I can finally start healing and fighting all this mess.  Off to the ps tomorrow and hopefully all is good there. Have a good night!",
      "MessageIndex": 2168,
      "PostDate": "10/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 1, 2010 11:01PM - edited May 1, 2010 11:02PM by LauraM",
      "MessageIndex": 2598,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 23, 2010 03:01PM LauraM wrote: Well good thing I went to the doc yesterday, I ended up having a full blown sinus infection that knocked me for a loop last night.  Started antibiotics last night, my throat is a little better but the congestion and junk in my chest really sucks.. I started rising my nose with saline this morning (should have started that a few days ago!) Hopefully I will be better for the weekend. Paxton - Great pics!  Your baby is BEAUTIFUL! Fotopet - I am in awe that you are working! Kim - I hope you feel better this morning about shaving your head.  It was hard when I did it too, but the thought of all that hair falling out gave me the creeps.  Shaving my head made me feel a little more in control! Sacphotomom and Njgirl - I still have to shave my legs occasionally too.  I agree that we should at least get some perks out of this Chemo!  I Sacphotomom - I usually go for a walk every morning and some days I have a really hard time too, mostly because my legs are tired and achy.  I have not been able to go this whole week because of this sinus thing, hoping I will be better tomorrow so I can do a little bit this week. Have a great day! ",
      "MessageIndex": 787,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 23, 2010 05:54PM LauraM wrote: Day - That is awesome!  What a nice story.  It is good to know that there are people out there doing things just to make other people feel better. Patricia48 - I hope you SE's go a way soon!  My onc had told me that I would be getting more and more out of breath with each AC.  Sacphotomom - I called my Onc. and they were out of the office and told me to call my primary care doc.   I haven't had to call before about being sick...just figured I should call onc first just to let them know.   I sure hope Taxol doesn't beat me up so bad.  I have more blisters starting from the hand and food syndrome that I am not suppose to get with AC but I got anyway....Atleast I am half way done with Chemo.. I keep telling myself that by September I should be back to my normal routine.",
      "MessageIndex": 791,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "May 12, 2010 09:45AM LauraM wrote: Welcome to all the new Sisters!   We are sorry you have to be here, but glad you have found us, all our lives will be enriched having you here.   Please feel free to ask any questions you have, share your thoughts and if you just feel like expressing yourself, we are here to just listen too. Jean - I am feeling much less tired as of yesterday, day 6 but still having stomach issues, not so much that my stomach is unsettled anymore, but it hurts in the middle of my stomach.  The doctor put me on a new med yesterday to see if it helps and I am going to be doubling my water intake today.  I need to figure out how to have this NOT happen next time. Redbarb - I am getting a treatment on June 3rd also, so I will be like you, walking as much as possible and then resting as I can.",
      "MessageIndex": 2695,
      "PostDate": "12/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 22, 2010 12:44PM LauraM wrote: In_cognito - Sorry to hear that you are heading down the mastectomy path.   I had the same type of pathology report from my lumpectomy also.  Neither the mammogram or the MRI showed the invasive lump under my DCIS and my margins were not clear after my lumpectomy.   I ended up choosing (after many long nights) a double mastectomy.    I am 45 and have two children 9 and 11.  I chose to have immediate reconstruction with the TRAM and I have been very happy with the results.  My surgery was in February and I have no restrictons now, I don't have any muscle issues where the incision was and my new breasts look great.  I think the lifting restrictions were 8 weeks with the TRAM.  I had other complications, like allergy to sutures that set me back but it really had nothing to do with the mastectomy.   Having immediate reconstruction helped me because I woke up with boobs and never felt like something was missing.   I had a D+ to begin with so I went for a C+ size and my back thanks me everyday!  Good luck to you as you make this decision and feel free to PM me is you have any questions.",
      "MessageIndex": 2879,
      "PostDate": "22/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jun 25, 2010 10:19AM LauraM wrote: Sheila - I am so sorry to hear about your fall.  I hope you recover quickly.  Try to take it easy this weekend! ",
      "MessageIndex": 2907,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Aug 16, 2010 10:05PM LauraM wrote: wellsey66 - I voted for you too! KimLovesDachshunds - I am sorry you had a nasty cold... glad you are feeling better. Summer38/NJ - The Taxol causes a lot of bone pain for me too.  Just like you said, it is worse at night.  I find that during my worst couple of days the only thing that helps me at night is heavy duty pain killers.  During the day, I end up taking 3 or 4 advil when it gets too bad.  Since my last Taxol was last Thursday, they did not give me a neulasta shot and my bone pain was less this time then the last three tx.  It was still there, but I did not have one of the really bad nights that I had had in the past.  I hope the overall bone pain doesn't last as long this time, last tx the bone pain came and went almost the whole time.  Not really bad, but enough for it to be annoying. Patricia48 - Glad you hemoglobin was up and you didn't need a transfusion! Daiva - I agree.. Go to Paris.  Sounds like so much fun! LibraryJenn - I am sending you extra prayers that your tumor starts to shrink!  Keep up the positive attitude! Have a great night!",
      "MessageIndex": 1309,
      "PostDate": "16/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Aug 17, 2010 10:43AM LauraM wrote: Interesting that all of these doctors recommend the same tests to all of us but all at different times.   My Onc. told me on Thursday that she would test me in 1 year to see if I went into menopause.  I hope that I go early... really can't stand these hot flashes.  Between the hot flashes and the bone pain, sleeping is not easy, just restless all night.   I am going back to work in the next couple of weeks so hopefully it will be better by then. X-ray Girl - Glad to see that you got to go to Toronto to see your Dad!  Enjoy your time with him.  My mom is coming in a couple of weeks for Labor Day, it will be nice, I haven't seen her since my surgery in February. ",
      "MessageIndex": 1315,
      "PostDate": "17/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Sep 14, 2010 04:27PM LauraM wrote: Hi Ladies -  I have been off line for the last week, trying to figure out how to manage everything with going back to work (from home), trying to get rads set up, running kids to all their sports and finding a little time for me to get on line before I crash at night.  I had my best sleep in months last night, but I think that is because I took my sleeping pill twice.  I am not sure that I did, but when I was taking it, I was thinking to myself that I had meant to take it earlier and couldn't remember if I did or not.  I have to keep better tack in the future, but not getting up one time during the night was they best! Leanna - Glad you only have one tx left.   I am wondering if your stomach issues are acid in the stomach.   I have been taking nexium in the mornings and find that really helped when I was on AC to stop the sour stomach.  If it was really bad, the doctor had me take two. X-Ray -  Did you go on-line and look at the video on how to tie the Buff Wraps?  I found a couple of cute ways to tie them so that they don't look like the traditional cancer wraps.  I go everywhere in mine and even though I have a great wig that looks like my old hair cut, all my friends say they love the buff wrap look best on me.   I have some in crazy patterns and tye dye colors to try and make them fun.  I also have the BC one. Redbarb - My eye lashes have started to fall out too.   I am one month post tx and my bottom lashes are scarce and the middle of my left eye top lashes are gone.   I am hoping they grow back soon.  GolpherGirl - Thanks for the Miaderm recommendation, I am going to go on line and buy it.  I can't believe you are almost done with Rads.  That is such great news. Irish and Summer - I am right with you both on starting Rads.  I will have my dry run on the 20th and start my rads on the 21st.   Are either of you have rads directly under your arm?  I am having them under my arm, on my breast/chest wall and lymph nodes in the clavicle area. Sacphotomom - How is the lympho therapy going?  Do you see a difference?  Summer - I bet it was really emotional being in the City on 9/11.  That day really paralyzes me each year. I feel such sadness for all of those people and their families and such amazement of the people that jumped right in and started helping everyone.  I think of 9/11 every time I see a day with a full bright blue sky and not a cloud in it. Patricia 48?  Did you have auxiliary nodes removed when you had your surgery?  If so, will you need to wear a sleeve for your arm during the long flight? Drim - Glad you are almost done with your rads.  I will be starting Tamoxifen tomorrow.  I am a little worried about the hot flashes getting worse as I have at least 15 - 20 a day now.  I don't know if I can handle more. LibraryJen - WOW your tumor is shrinking, that is such awesome news!!!!!! Leanna- Family can really suck during times of need.  I have defiantly found out that that my friends and neighbors have been the best support for me.  My MIL and DH have been awesome also but so many people have come to help me, most have been from my kids school.  Magda - Glad you are feeling better and got out of the house for a walk.  I need to get back to walking, I love it and the weather is getting perfect for it.  I just wish my feet didn't still ache so much.  Paxton - Congrats on being Cancer Free.  What a gift!.    Keep feel better and hugs to Gabe. njbhwgirl - Have fun on your girls weekend, we will be at a wedding in Vermont that weekend. Sorry about this very long post! ",
      "MessageIndex": 1539,
      "PostDate": "14/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Oct 28, 2010 03:22PM LauraM wrote: Leanna9 - YEAH for the good pathology report!  That is such a coincidence about ODU, both my husband and I graduated in 1987 also! Denise - I was very nervous about starting radiation too.  I think the unknown is what we are the most scared of.  Majdula - CONGRATS on finishing Chemo.   You will feel so much better soon!  PackJen - I am thinking of you and hope that you feel better soon.  Once the drains come out you will start to feel much better. I have just finished radiation this morning!!! YEAH !!!   I feel so liberated, I feel like I finally have my life back.   I still have some of my reconstruction to finish the beginning of the year so I have that still on my mind but that is such small stuff compared to everything I have gone through. Good thoughts are going out to all of you!",
      "MessageIndex": 1815,
      "PostDate": "28/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Oct 31, 2010 02:38AM LauraM wrote: Hi Ladies!  Happy Halloween!   There is a lot a chatter about eye lashes lately and wanted to let you know that I had lost all of mine after finishing Chemo in mid Aug and in the last 2 weeks mine are now all back.  They are shorter (half the size), but they are there and I can put mascara on again!   Once they started growing back, they really grew in quick.   I have still been using Nioxin on my hair and eye lashes, not sure if that helped or not.  I talked  to a hair dresser friend the other night and she told me to stop the Nioxin because now that my hair is growing back it really doesn't do any good.  Not sure if I believe that or not because my hair is growing in nicely now, very short but at least most of my scalp is now covered that I am afraid to stop!  I have been going without my wrap all weekend around my town and it has been pretty liberating.  It is strange though because I forget I don't have hair and the I will notice people staring a little longer or they ask me questions or I pass by a mirror and I remember I dont' have hair.  LOL I am still very sore from rads under my arm but I am hoping that it will be better in the next few days.  I have been pretty tired this weekend, but I never seem to get a good night sleep.  I am sleeping a little better now that I am off the sleeping pills, I know that sounds weird, but I think they were having an adverse reaction in me. Day - I hope your gold gets better soon. Leanna - I was a business major and my husband was a criminal justice major.   I had quite a few friends that were in PT, Speech and Nuclear medicine so you never know we might have crossed paths.  Was he in any fraternities or clubs on campus? Magda - Congrats on being done with Chemo..What a relief you must feel. Everyone else - I hope you have a wonderful Halloween and are feeling as good as you can be!",
      "MessageIndex": 1824,
      "PostDate": "31/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 5, 2010 12:45PM LauraM wrote: All -  Thank you for the many welcomes and the advice!  Can I get some opinions on breast reconstruction...  Did anyone have the TRAM or Tram Free Flap?  How did it go? Thanks!  Laura",
      "MessageIndex": 1514,
      "PostDate": "05/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Jan 8, 2010 12:53PM LauraM wrote: Carolinachick... Glad to see that your one year tests went well! Cake - Sorry to hear about your friend's best friend, my thoughts and prayers are with them.  It breaks my heart to hear of stories like this.",
      "MessageIndex": 1582,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "LauraM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95037/profile",
      "Content": "Nov 8, 2010 12:54AM LauraM wrote: Hi Ladies -  Congrats to everyone who is done!  I am done too, finshed on the 28th.  My skin held up pretty well until 3 days after and it started to blister from my neck, down my breast and under my arm.   I called my onc. and he gave me some cream that has been helping.  It will be a week tomorrow and I am still sore but getting much better. Hope you all continue to feel strong!",
      "MessageIndex": 659,
      "PostDate": "08/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    }
  ]
}