{
  "AuthorID": "Laura927",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287927/profile",
  "Posts": [
    {
      "AuthorID": "Laura927",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287927/profile",
      "Content": "Laura927 wrote: Hello. I'm new here. I found a couple small dimples or puckering on my right breast below my nipple. I only see them when my arm is raised. They are not very deep looking but I can see them. I went to my doctor because I also found a pea sized lump in my other breast. My doctor was able to feel the lump I felt but wasn't overly concerned. She has ordered a diagnostic mammogram and an ultrasound just to be sure everything is ok. I also mentioned the dimples and she wasn't able to see what I saw, but she believed me. She is very thorough and examined both breasts and said she couldn't feel anything in the one with the dimples. Sadly I have to wait 2 weeks until they can get me in for the mammogram and ultrasound. So, while I try very hard not to be too worried during these two weeks...can you guys tell me what dimples or puckering you had? Everything I've read recently tells me that these are always something to be concerned about. Thank you Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870869",
      "Title": "Dimple/Puckering Laura927 Laura927"
    },
    {
      "AuthorID": "Laura927",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287927/profile",
      "Content": "Apr 8, 2019 12:08AM Laura927 wrote: Thank you. It’s so hard not to worry but I’m doing my best. I’m so happy to have a doctor who is very proactive and didn’t hesitate to order the mammogram and ultrasound. She really tried to put me at ease about the small lump. And even though she couldn’t see the dimples she said if I saw them let’s just check it out. So that’s why I was curious about anyone else here who saw dimples. Did you see them only at certain angles? Did you have dimples but everything turned out ok? Were they deep looking?",
      "MessageIndex": 2,
      "PostDate": "08/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870869",
      "Title": "Dimple/Puckering Laura927 Laura927"
    }
  ]
}