{
  "AuthorID": "Lavenderlee…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
  "Posts": [
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Jan 15, 2019 07:48PM Lavenderlee wrote: I had hives for awhile after chemo (about 6 weeks) and still get them occasionally. I take Benedryl when they’re coming on to help stop itching. However, the best thing I did was change my soap to Dove Sensitive skin and my laundry detergent to Dreft. Those small changes had a huge impact! Good luck to your wife",
      "MessageIndex": 27,
      "PostDate": "15/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867216",
      "Title": "Anyone have delayed allergic reaction/hives on TC? Need opinions Appyfan Anxious789"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Jul 25, 2018 08:53AM Lavenderlee wrote: One thing I forgot to mention was I that I asked to receive my sentinel node injection after I was given the happy juice. My team agreed and waited until I was under to do anything. I think it was because my surgery was so delayed that they felt bad for me - almost 20 hours no food or water. Today is one week out and I shaved my legs this morning and stripped my own drains. I think I do too much in the mornings and by early evening am wiped, but I feel too antsy to sit still for so long. Starting the Handmaid’s Tale today - hope it’s a good watch. Shark week was getting to be a bit (get it?) much. Vermonster, you and I are beach ball twins, it looks more uncomfortable than it is. I drink as much black coffee as I do water to try and help. Not much luck, but overall I feel pretty good. Praying for positive news soon on the pathology. Hope all is well with each of you.",
      "MessageIndex": 142,
      "PostDate": "25/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Jul 23, 2018 10:39PM Lavenderlee wrote: Just checking in - had my direct to implant nipple sparing BMX on July 18th. I have been in some pretty constant pain, but it’s all been very manageable with some sharper pains when sitting or standing and if my drain tubes start to clog. Everything looks pretty good, or so I’m told. It’s hard to look at my new breasts objectively even though they resemble my original set. I really appreciate my recliner and reclining bed so very much. I am still backed up, I hope that release is found soon. We are waiting on the node results as some atypical cells and discolorations were noted. Overall I’m feeling pretty lucky. Hoping everyone else is having as good a week!",
      "MessageIndex": 140,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Dec 6, 2018 01:35PM Lavenderlee wrote: I am another one of the gals who has had implants placed prior to radiation - wasn’t expecting adjuvant treatments or we would have used TEs. I am on Singulair oral to help prevent capsular contracture and feel okay (tan with a little dermatitis) at 18/33 treatments. Hope everyone is doing well to this day with implants post rads.",
      "MessageIndex": 7,
      "PostDate": "06/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/866539",
      "Title": "Anyone have breast implants prior to radiation? NJmom2boys duffyzmom"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Jul 10, 2018 10:00AM Lavenderlee wrote: Hi all! I am newly scheduled for July 18 BMX with direct to implant reconstruction. Oneof7, best of luck to you next week. Debsmisto, so sorry to hear your news, prayers for you (all of us really). I hope you get some much needed good news soon.",
      "MessageIndex": 83,
      "PostDate": "10/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Dec 28, 2018 12:46AM Lavenderlee wrote: Hi! Checking in. Urdrago, I am with you on the pain scale. I have been using the Domeboro soak to help with the skin discomfort and Tylenol/ibuprofen with the throbbing pain. Also, indulged a lot this weekend since there was zero pain while drinking, but time to put away the holiday celebrations and get back towards my alkaline diet. Need to cleanse my liver! 😉. I have two boosts left and then I’ll be finished. Can’t wait to ring the bell. Now, I’m trying to Decide if I want to take the next step with the maintenance treatments - not looking forward to more drugs (tamoxifen with more side effects. Hope everyone is healing well and feeling better each day.",
      "MessageIndex": 358,
      "PostDate": "28/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Dec 6, 2018 12:42PM Lavenderlee wrote: I have been catching up on the posts and am sorry to hear about the troubles for Spoonie and Idkidk as well as others with side effects starting to show up. I am 18/33 as of today. It seems to be going by fast, but not fast enough. My breast is tan and I can agree with the others on the “headache” in the breast. I have some areas with raised bumps thatare red and slightly itchy. RO prescribed some Silvadene to help with itching and irritation - I’ll pick that up tomorrow. Overall not too bad yet, but the fatigue is picking up. Slather on ladies, almost there.",
      "MessageIndex": 296,
      "PostDate": "06/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Dec 18, 2018 11:58AM Lavenderlee wrote: Hi ladies! I was so saddened to read about all you've been through. I found myself trying to go over my past few years for an identifier (my Breast Surgeon even asked once), but other than being a tax accountant nothing really stands out. You ladies have overcome so much not including this dreaded disease. I'm so proud and incredibly blessed to have you at my 'side' as we finish strong. I am 26/33 treatments in today. My skin is browning a little in some of the worst spots, like a bad sunburn about to peel. Still very sore and VERY tired, but trying to keep up with yoga to stretch out my stiff arm and walking when I can. Still slathering on the Silvadene, Miaderm, and aloe. Have been icing my chest lately too - feels so good (where I can feel it after mastectomy 😉). Most of my itchy rash has cleared up so I feel that was related to chemo. My boosts will start this Friday and I think I will luck out and finish by late next week! What a way to ring in the new year! I am loving all the puppy posts, this thread truly gets me! How are you all doing with the Christmas holiday fast approaching? I got out of hosting this year. Makes me a little sad, but my cousin who took over this year just got a puppy so that brightens it for me a smidge. In keeping with the pup posts I'll add his new puppy! Until next time, as Urdrago says - hydrate, slather, rest, and repeat! ",
      "MessageIndex": 330,
      "PostDate": "18/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Dec 19, 2018 09:39PM - edited Dec 19, 2018 09:39PM by Lavenderlee Tomorrow will be a most exciting day! Congrats to SIllyoldrabbit and Egregious for finishing (although I'm cheering a bit early). I looking forward to wrapping up the whole breast treatments. Urdrago, so close - you're into single digits with me! Sillyoldrabbit, I was advised to keep my skin lotioned during chemo as it tends to dry you out. Also, my RO mentioned to keep up with it before and after treatments for sometime to keep the skin happy. Sorry to hear you're getting into that itchy, burn time - you've held up amazingly! I agree with you that the cause is likely not one thing. Shrug shrug indeed. Am I the only one battling fatigue or general malaise? Hydrate, slather, rest, repeat! Good night!",
      "MessageIndex": 335,
      "PostDate": "19/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Dec 31, 2018 06:16PM Lavenderlee wrote: Thabk you all and congrats to those of us finishing up and healing!!",
      "MessageIndex": 367,
      "PostDate": "31/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Jan 8, 2019 12:20PM Lavenderlee wrote: Hi ladies! Checking in, almost two weeks out and doing pretty well, just some tanned skin and a little fatigue left. Still using Miaderm a few times a day (really just to use up the bottles, not gonna let any of it go to waste). Sillyoldrabbit - I love the burning of the paper! What a great way to end that year! Cefink - I have not had any nail issues as of yet, but I iced hands and feet during chemo. Here’s hoping it’s just the one for you. Hope everyone else is still doing wonderfully and that the next phase of treatment does well by you (and if you’re declining like me, I hope that serves you well also). Thanks for all the encouragement and support. I’ll be checking in from time to time to answer and seek knowledge from you wise ladies. *bighugs 🤗🤗🤗",
      "MessageIndex": 376,
      "PostDate": "08/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Nov 12, 2018 09:42PM Lavenderlee wrote: Today was my first of 28 treatments plus 5 boosts - all using a bolus - I feel like they really underplay what it will do to my skin by saying it just makes it a little more red. It was very emotional so I’m happy to be joining this thread (well, as happy as one can be) to have a group who understands. I am using Miaderm thanks to some other posters’ recommendations and Fruit of the Earth Aloe. I started taking Singulair as well since I had a direct to implant BMX in July to help prevent capsular contracture. I wish my office would give out that nifty instruction sheet Urdrago, but thanks for posting I finished chemo on October 18 and got right in to rads so I can try to finish before the year ends and insurance resets (like Ghostie). I’m still dealing with fun rashes/hives left behind from my good friend Taxotere. Not looking forward to the fatigue, but am hoping to continue to work near full time and get in some yoga and walks. Thank you CarolAnnie for the positivity in your treatment - looking forward to when we can ring that bell!!!",
      "MessageIndex": 82,
      "PostDate": "12/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Nov 14, 2018 03:15AM - edited Nov 14, 2018 03:19AM by Lavenderlee Alice - I hope your rads place has a bell, if not I support bringing your own. :) Hoping those blisters heal quickly. Appyfan - good luck on zap number one! It was emotional and scary for me, but #2 today was much easier. Spoonie- thank you for the updates and glad to hear you're healing so well! Sorry for all that you went through, but love that humor!! Ghostie - I hope that heals soon so you can get back on schedule, glad you got a little break. Sillyoldrabbit- good luck tomorrow. I have a shot through my back too, but I am doing the breath hold andmy RO assures anything that touches my heart or lungs is “well within tolerance” - I can only pray that’s true! Urdrago - Congrats on starting, hoping the next 29 go even easier! I'm so stealing your sign off - drink water, slather creams, and be kind to yourself!",
      "MessageIndex": 96,
      "PostDate": "14/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Nov 16, 2018 06:42AM Lavenderlee wrote: Pebbles - Love domino, thank you for sharing that sweet face! So cool that they let you bring her along! Today is 5/33 with the bolus and I’ve already noticed a slight tan on my breast. I apply miaderm directly after treatment when getting dressed and switch between that and aloe multiple times a day. My RO says 4 and my MO mentioned the sweet number is around 5 daily slathers - I’ll do whatever I can to keep moving along. The first week seems to go by quick. I have the same Sun-Wed schedule as many of you with a 4 day weekend, nice little break in the first couple of weeks. I appreciate the updates and love hearing the positives, and sorry to hear the negatives. I hope for quick healing. Gladthat sims are moving along and treatments are getting started. Linda - I hope that rash clears up quickly. That is one big thing about the bolus that worries me. I enjoy going braless (trying to see the bright side in my foobs) so hoping to prevent any rubbing. I practice hot yoga so I worry how that will react as the reactions intensify. As Urdrago says - drink water, slather creams, and be kind to yourself! 💕",
      "MessageIndex": 118,
      "PostDate": "16/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Dec 11, 2018 09:46PM Lavenderlee wrote: Congrats Appyfan! That’s great news, I hope that your skin stays well and you're back in action in no time! I am 21/33 today and my breast and underarm are pretty sore. The redness looks better than it feels. I am using a mixture of Silvadene, Miaderm, Aloe, and pure hope at this point. Looking forward to finishing. I hope everyone else is doing well, keeping hydrated, and staying active.",
      "MessageIndex": 314,
      "PostDate": "11/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "Lavenderlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275685/profile",
      "Content": "Dec 30, 2018 06:19PM Lavenderlee wrote: Urdrago, please try the Domeboro solution soak - it’s in the poison ivy section. I feel like it really made a big difference these last days. I finished yesterday and rang the bell!!! Celebrated a little too much and am couch ridden today - tired gal over here!  Hope everyone is doing okay, and those who aren’t find relief soon. Thinking of you all as we close out 2018.",
      "MessageIndex": 361,
      "PostDate": "30/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    }
  ]
}