{
  "AuthorID": "LaVieEnRose…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196630/profile",
  "Posts": [
    {
      "AuthorID": "LaVieEnRose…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196630/profile",
      "Content": "Feb 19, 2014 08:43PM LaVieEnRose wrote: And what in the world is with all of the delayed results on things?!  I'm so sorry to hear that so many of you have dealt with delays and miscommunications, as well.  That's the last thing any of us need when going through such a stressful time.",
      "MessageIndex": 205,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "LaVieEnRose…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196630/profile",
      "Content": "Feb 20, 2014 10:37AM LaVieEnRose wrote: Warrior woman, that's the most important thing, that you can rest easy at night.  We can't allow cancer or it's tests to take away our quality of life because that gives it too much power that it doesn't deserve.  I'm glad to hear that you're happy with your decision and I'm really thankful you started this thread; the perspectives, knowledge and information on here are amazing and it's great to hear what's on the minds of so many others going through this same experience.  I know I'll continue to refer back to this thread as I wait for my results and once they do come in, because a lot of things can change when I finally hear what that magic number is.  I just want to thank everyone who has given input on here and wish everyone the best on their journeys!",
      "MessageIndex": 211,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "LaVieEnRose…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196630/profile",
      "Content": "Feb 20, 2014 07:39PM LaVieEnRose wrote: Mine was found just a week before my husband and I were supposed to leave the country for several months.  I wanted to wait, but my gut told me to get this done, and I sure am thankful I did.  I even asked the radiologist if I could wait until I got back to get the biopsy and go from there.  He actually didn't push me too hard, but made it clear that he thought it was more serious and wasn't worth waiting.  Turns out he was right - I had a faster growing cancer, and I'm only 30 yrs old!  If I had waited until we got back, I probably wouldn't have been stage I anymore and it likely would have spread.   Only you can decide what's right for you, but I'm not sure how settled your mind will be until you find out for sure what that lump is.  Is there any way you can delay your trip?  My husband and I had to talk to the workplace and do a LOT of negotiating, but thankfully they were more accomodating than we anticipated and we were able to delay our trip for a year.",
      "MessageIndex": 1,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818297",
      "Title": "Never thought i'd have this fear.. NyxMezzanotte NyxMezzanotte"
    },
    {
      "AuthorID": "LaVieEnRose…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196630/profile",
      "Content": "Feb 20, 2014 08:16PM LaVieEnRose wrote: I can totally understand how scared you must be.  I wish you the best of luck on your journey, and be sure to update us when you can.  I'll be hoping and praying that it's benign :)  In the meantime, as difficult as it is, try not to stress too much and be sure to enjoy each day.  *hugs*",
      "MessageIndex": 3,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818297",
      "Title": "Never thought i'd have this fear.. NyxMezzanotte NyxMezzanotte"
    },
    {
      "AuthorID": "LaVieEnRose…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196630/profile",
      "Content": "Feb 19, 2014 05:29PM LaVieEnRose wrote: Hi everyone, I'm new here, and I'll need to look back through this thread to catch up.  I'm waiting for my Oncotype DX results... I should have had them already, and when I started calling the oncologist's office for results 14 days after my bilateral mastectomy, I found out that she forgot to order it  :(  So now the pathology sample has to be sent to another state, and then results will come after that.   In the meantime, I've had 2 doctors tell me that even though my lymph nodes were clear, I'm firmly a stage I, and they feel no need to do any scans because they feel very confident that there's been no spread of the cancer, that they'd probably still recommend chemo regardless of my Oncotype score.  Their words were \"everyone is going to want to give you the adriamycin because you're only 30 and your heart can handle the damage that the adriamycin causes.\"  My mom had adriamycin and I saw the heart damage that it caused on her and how it affected her, so I find my doctors' sentiment extremely frustrating.  Giving me chemo because I'm young and can handle it seems like they're treating me like an experiment rather than evidence-based practice.   Sorry, I think I just needed a place to vent where others know what I'm talking about.  ",
      "MessageIndex": 200,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "LaVieEnRose…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196630/profile",
      "Content": "Feb 19, 2014 08:41PM LaVieEnRose wrote: Thank you all for weighing in with your perspectives.  It really helps to have calmer minds give input when I'm feeling frazzled.  I definitely think I'll seek more opinions when the official number comes in, and I'm glad to hear they're allowing more options with chemo, so maybe with some research I can discuss something other than adriamycin (if it comes to that). The thing is, I see a lot of people on here (and obviously my oncologist feels the same) feel that the younger you are, the more benefit there is to doing chemo early as I have many years ahead of me to live.  After my mother's experience, it has me coming from the opposite end of the spectrum.  She had her lifetime maximum of adriamycin and taxol when she received it back in 1999.  Thankfully she's still alive and has had no more cancer scares yet, but that was her 3rd time fighting breast cancer.  She maxed out on her lifetime maximum of radiation with her first 2 bouts of breast cancer so she couldn't receive it the 3rd time.  I really want those options to be there for me if I have to fight cancer again later in life and I worry about maxing out early on.  My mother is still fairly young - she has plenty of years left in her, but if God forbid she got cancer again, her options would be much more limited.   It's a lot to take in and I think my mind is still overwhelmed by it all.  I appreciate all perspectives and information, though, and am definitely trying to sift through it.  This experience certainly makes you feel like you have to obtain the knowledge of an oncologist overnight!",
      "MessageIndex": 204,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "LaVieEnRose…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196630/profile",
      "Content": "Feb 19, 2014 09:50PM LaVieEnRose wrote: Oh my gosh, worried mom, so sorry to hear you're going through this  :(  Yes, it almost feels surreal.  I suppose it would feel that way at any age, but, well, I don't know how to describe it.  I know what you mean about coming to terms with acceptance.  Since I'm still very, very early in my reconstruction, I walk around with scarves layered upon my chest and I still tend to walk hunched over to cover up my lack of breasts.  It's like I can feel all of the glances in my direction, and whenever I meet up with someone who knows what's going on with me, every time they look me over I get a weird feeling.   Kiwilady, that's ridiculous!  I can only imagine how awful all this waiting has been.  I can only hope that you'll get good results to compensate for this agony.",
      "MessageIndex": 208,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    }
  ]
}