{
  "AuthorID": "LayDsayD",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246749/profile",
  "Posts": [{
    "AuthorID": "LayDsayD",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246749/profile",
    "Content": "LayDsayD wrote: Hi everyone..so here is whats going on. I have dyslexia so i hope you can all read this. I appriciate any advise and any ideas on what questions to ask. I feel in way over my head! I broke my tail bone last March, thats how this all began. If you are wondering how that led to a breast cancer scare..well.. I am too! The pain from the brokan bone never went away and i began pain management to cope with the pressistant pain. I get injections in my back that seem to help some . Well the dr did new mri's and my back, not just tail bone was worse.They did some blood work and it came back all kinds of messed up. Top on the list was low estrogen, and calcium. but there was alot wrong; thyroid, b12,folic acid, and honestly to many to list here. I followed up with my primary dr and obgyn right way they did additional blood work and some autoimmune marker came up. I guess some of what is going on can point to cancer of the breast or ovaries. Well they found a lump at the primary care dr The gyn confirmed and ordered an ultrasound . I have large breast implants so they said ultrasound was better. The ultrasound showed a 5 mil hard mass in my right nreast near teh arm pit. I was sent for a mamogram right away. the technician was great and even showed me teh pictures on teh screen i saw the mass, but mostly those huge implants. she explained that the 5 ml is actually just what is showing the rest of teh mass is behind the implant. Well that really freaks me out because i am afraid that this may have gone unnoticed for some time because of the implant. I am waiting on the dr's call with the results. Thsi all happened over two weeks time frame. It feels like teh whole world has gone crazy. in the drop of a hat im all topsy turvy. It doesnt help that i feel aweful due to low vitamins and such i feel super drained and sleepy ( I had blamed that on being in pain previously) Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "08/02/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852565",
    "Title": "Everything is happening so fast LayDsayD LayDsayD"
  }]
}