{
  "AuthorID": "lbcurtis200…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60406/profile",
  "Posts": [
    {
      "AuthorID": "lbcurtis200…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60406/profile",
      "Content": "Dec 10, 2007 07:26PM lbcurtis2007 wrote: Hey D1, I am in the same boat with you.  I was dx on Nov2 and had the SNB on Nov26.  I meet the oncology team this Friday and I am sure I will be signing my life away as well.  I am IDC, < 1cm, Stage I, Grade 3, 0/1 node,er-/pr-, HER2-.  Reading the decision trees, it sounds to me that they want Chemo.  I will know for sure on Friday the 14th.  Hey at least it isn't the 13th..... I have read some horror stories on here and some good ones.  I really don't know what to expect.  I know that I would prefer not to have the port, but if there are alot of treatments, then maybe it would be better.  There are so many maybes that it can drive one to want a drink. I am looking for all the info that I can get.  I am afraid of going to the doctor and not knowing what to ask.  I am afraid of not knowing the right questions or not getting all the info because I didn't ask.  So all advise, questions and info is welcome.  There is a major learning curve here since I have never done this before.  Sure hope to never do it again.",
      "MessageIndex": 1,
      "PostDate": "10/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "lbcurtis200…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60406/profile",
      "Content": "Dec 11, 2007 11:11AM lbcurtis2007 wrote: Hello Ladies, I have no idea what micromets are.  That will certainly be a question for the oncologist.  I am hoping there is a chance that they will say \"hey we got it all and the nodes are clear so no chemo\".  But since I have the appt with the medical oncologist it is hard to hold on to that hope.  I am trying to prepare myself emotionally for when I hear them say it.  I fell apart when I got the news that the lumpectomy was positive for cancer. Everyone at work is telling me to just be strong and have faith, but I keep saying to myself.  They aren't the ones that has had 3 surgeries and has the battle wounds to go with it.  They aren't the ones that has to have these chemicals pumped into them and watch their bodies change.  It is hard to keep a positive outlook all the time.  You go to work with a smile on, but inside your mind is racing with questions and the ultimate \"why me\".  Sorry....got to caught up in feeling sorry for myself.  All better now.  I will keep reading and checking back here.  It is good to have people to talk to that are going through the same things.  Hang in there girls, we will make it through this together. Has anyone had or heard of the BRCA1 or BRCA2 gene test?  I am trying to see if it is something that is routine or something that you have to request.  What exactly does it tell you and the doctors?  I also started reading a little last night about the \"Triple negative\".  Does anyone have info or know of threads that deal with that.  I know I am triple negative, but what exactly does that mean?  Is it good or bad?",
      "MessageIndex": 8,
      "PostDate": "11/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "lbcurtis200…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60406/profile",
      "Content": "Dec 13, 2007 09:09AM lbcurtis2007 wrote: This has been the longest week.  Tomorrow I go to the oncologist to get the scoop on my treatment plan.  I know what you mean vettegal, it is hard to keep focused on work when you are waiting.  I feel like I am not all here.  My body goes to work and I do the job, but I feel disconnected, like I am somewhere else.  It has been a tough week.  My first day back at work after the node surgery was Monday.  Then Tuesday I developed a UTI, I guess from the pain meds and not moving around much.  I forgot how painful UTI's can be. The antibiotics are kickin in now.  The pain is getting better.  I managed to make it this far, so the rest of today and part of tomorrow should be a bit easier. Hang tough...we can make it.",
      "MessageIndex": 14,
      "PostDate": "13/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "lbcurtis200…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60406/profile",
      "Content": "Dec 13, 2007 07:50PM lbcurtis2007 wrote: Hello Ladies, Everyone is such a fountain of information.  I have learned so much here.  I am so glad that I have all of you as a resource.  I will be taking all the info and using it to make my life easier.  Thank you to everyone who has shared your experiences.  D1 thank you for your positive attitude.  It really helps to have someone that has a good outlook on things to help the rest of us that are struggling.  The holidays will come and go and life will go on and us with it.  I am not excited about the holidays, but I just want it to hurry so that we can move on with getting better.  I just found out tonight that my cousin's wife in MN has brest cancer.  I talked to her tonight on the phone for over an hour finding out how everything went for her.  She was Stage 2 Grade 2 and she has completed chemo and working on the last of radiation.  She said that radiation has been worse for her than the chemo was.  Her skin is burned, peeling and blistered.  She said that the doctors have special medicines that they give you for the burns.  I told her I live in Florida I am use to the burns.  I don't suppose they would allow sunscreen....haha. Well it is off to bed to get some of that much needed rest.  Then off to the doctor's office first thing in the morning.  Hugs to all!!",
      "MessageIndex": 29,
      "PostDate": "13/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    }
  ]
}