{
  "AuthorID": "lbgal",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
  "Posts": [
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Mar 15, 2015 08:25PM lbgal wrote: Hello ladies I'm new on this thread but have been reading here now and then. I landed here now because I was looking for fatigue handling. I have a 7 yo and I'm sop tire call the time. Poor little guy he already learned I'm too tired to play so he doesn't even ask anymore. He just comes and hangs out in bed with me when he plays on the iPad. Breaks my heart. How do you all handle it?",
      "MessageIndex": 397,
      "PostDate": "15/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "May 13, 2015 10:42AM lbgal wrote: I can't do it either. I keep thinking I'll be around as long as I can and then when I die my son needs to move on. I lost my father when I was 29 and it still hurts (I'm 46 now) but you learn to live with it and fill up your life with other people. That's what I would want my son to do. Move on and have other people in his life (his father, grandparents, aunts and uncles, cousins, friends) that would make him happy. And not suffer while he's looking at pictures or videos of me. What good would it do to anyone? Sorry if it sounds cynical but I'm all for minimizing suffering.",
      "MessageIndex": 483,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Feb 25, 2015 07:45PM lbgal wrote: Spiritblessing, I am glad you stopped by! This seems to be sometimes a very quiet place. I guess each of us have found some other little groups and we just stop by here every now and then. I do check it daily but postings are not that frequent :) I'm sorry I don't know anything about disability, but I'll very very happy if you want to share what you find. I'm 46 but I was born in Europe and I only came to the States 17 years ago. I've been constantly employed since then, but it's been increasingly hard with stage 4 especially with being in and out of hospital. So I thought if I leave my workplace I won't have an income, but it's good to know there are options.",
      "MessageIndex": 1000,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Mar 9, 2015 06:35PM lbgal wrote: Bosco - good luck tomorrow! Are you BRCA positive or negative? I heard that some of the newer drugs like Keytruda are in clinical trials for TNBC with and without BRCA mutations. Just curious :) ",
      "MessageIndex": 1030,
      "PostDate": "09/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Mar 19, 2015 10:40AM lbgal wrote: Spiritblessing, that's great news! Keep us posted on the biopsies! This forum is a bit quieter but we're around. It's also wonderful that people can exchange information about treatments and how they work and YES positive news :) :) :) (or just reach out when we feel down...)",
      "MessageIndex": 1043,
      "PostDate": "19/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Mar 4, 2015 07:51PM lbgal wrote: adnerb - I sure hope the solid tumors are next for the viral therapy! But if I'm not mistaken the first patient in the VICE episode had neuroglioblastoma, which is a solid brain tumor, so it's getting there! Cat- how is your treatment going? How are you feeling?",
      "MessageIndex": 1018,
      "PostDate": "04/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Mar 6, 2015 11:14AM lbgal wrote: Yaaaay Cat! We are all so happy for you!",
      "MessageIndex": 1024,
      "PostDate": "06/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Feb 25, 2015 12:10PM lbgal wrote: Cat, sorry about the brain mets, I don't know much about it but there seem to be many ladies here who are doing quite well. On the lung/pleural mets topic - I just had my fourth chemo (carboplatin/ gemzar). It looks like it is working because there is almost no fluid in my lungs. The surgeon said he might remove the drain tube in 2 weeks yaay! I am hoping this will bring some encouragement to others that might struggle with the same issue! Big hugs to all! ",
      "MessageIndex": 997,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Mar 4, 2015 07:44PM lbgal wrote: Hi tbryer and welcome! We understand you are scared. The met diagnosis is pretty scary, and some doctors who look at older research might have a less optimistic attitude. But the truth is that things have changed a lot in terms of treatment and survival of metastatic TNBC. I don't have lung mets, my mets were in the pleura (the membrane around the lungs) so there was pleural fluid accumulation around the lungs and heart. They drained it and then I started chemo which reduced fluid production to very little so I'm doing fine and continuing the chemo. I assume your original chemo treatment (standard) was adriamycin, citoxan and then taxol. The next step is usually either xeloda or gemzar/carboplatin (I'm on the later). I was on xeloda before my mets diagnosis. It's kind of weird that your doc said there is no experimental treatment for you and 'it's back to chemo'. Besides the fact that there is always an experimental treatment (unless you exhausted all the clinical trials out there) 'back to chemo' is in fact the standard approach. They will use first the drugs that they know will work in most patients, the approved and tried ones before the experimental ones. So don't lose hope. You are just starting a journey, and it will have some ups and some downs, but we are here to encourage each other and to share information that could help. Btw - if you don't like your MO - change him/her. Their job is not only to treat you, but also to guide and help you through this journey (psychologically). So if needed, find a better one with whom you communicate better and feel great talking with them!",
      "MessageIndex": 1017,
      "PostDate": "04/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Mar 10, 2015 07:06PM lbgal wrote: great news Bosco!!!",
      "MessageIndex": 1036,
      "PostDate": "10/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Feb 11, 2015 04:59PM lbgal wrote: Hi all, I'm TNBC stage IV too. I just joined and I've been posting in the stage IV forum. I'm glad I found this thread which is for TNBC. I'm not sure how this works, how can I post to the TNBC group? Especially if I have a question? Thank you",
      "MessageIndex": 985,
      "PostDate": "11/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Sep 22, 2015 08:50AM lbgal wrote: Yaay Barbdenise! This is really great news!",
      "MessageIndex": 1184,
      "PostDate": "22/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Sep 25, 2015 03:17PM lbgal wrote:",
      "MessageIndex": 1195,
      "PostDate": "25/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Feb 25, 2015 08:18PM lbgal wrote: Spirit, in addition to what Cat said I found this message on another board Jan 27, 2015 06:18PM Sarah0915 wrote: Breast cancer with metastisis to a distant site such as bone, brain, or liver automatically qualifies for Social Security Disability (SSDI). It qualifies as a \"Compassionate Allowance\" case which is fast tracked. That is supposed to be picked up from the diagnosis in the application, but I called and talked to a representative at the local office to make sure my application was flagged for speedy processing. There is still a 5 month waiting period and a 2 year waiting period for Medicare, no exceptions. You really don't want to hear my opinions on that :)",
      "MessageIndex": 1002,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Feb 28, 2015 08:36PM lbgal wrote: hi Spirit I think the 2 y waiting period in that post referred to other people. Stage 4 is fast tracked as Aimee said. And lung is included too. Another board that I check often is the INSOMNIACS, they are a diverse fun group. Btw - has anyone watched the last episode of VICE? These documentary is about new therapies for cancer using modified viruses and the spectacular results. Gives us all hope! Anybody has more info about where they are with the breast cancer vaccine? To everybody- I don't know anything about bone, liver or brain mets. But if anybody has pleural and pericardial fluid, I have experience with that (unfortunately).",
      "MessageIndex": 1007,
      "PostDate": "28/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Mar 7, 2015 12:45PM lbgal wrote: Good morning everyone! Spirit - hope you get good news from the Pet scan! VICE is not a study, it is a documentary series/ investigative reporting. The last episode was about cancer and 3 clinical trials (not for breast cancer- I think it was neuroglioblastoma, multiple myeloma and leukemia) in which they used genetically modified viruses to attack cancer cells and they had very good results. I don't know about the T cell treatment but I'll try to find out. If there is a clinical trial it should be posted on clinical trials.gov.",
      "MessageIndex": 1026,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Sep 22, 2015 08:56AM lbgal wrote: Nanita, sorry about your mom. You will find lots of support from the amazing ladies here. There is also a thread for bone mets specifically (triple negative or not) and the ladies are very knowledgeable and supportive.",
      "MessageIndex": 1186,
      "PostDate": "22/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Apr 1, 2015 04:07PM lbgal wrote: Welcome JFL!!! So sorry to hear about your diagnosis but you are welcome to the club nobody wants to join : )My boy was 5 at the time of diagnosis. He will turn 8 this summer and I sure hope to have many more days and summers with him. We are taking it one day at a time :) some of us are also on the 'insomniacs' thread. The ladies there are really fun and it might help to talk about stuff other than the big c. Lots of hugs to you and the boy. We are here for you.",
      "MessageIndex": 426,
      "PostDate": "01/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "Apr 10, 2015 12:26PM lbgal wrote: Hi Patty - I'm so sorry for all your troubles. I have to confess I couldn't handle my situation without antidepressants and Xanax. You are right, in the craziest hours we worry about 'what if's and then what's. Maybe it sounds silly but the way I got some peace and acceptance of my situation was to tell myself it takes a village to raise a child and that my son has a network of grandparents, aunts, uncles, cousins and friends that are close to him and who will be there in time of need. And that I'm doing my best every day which is mostly being around for him and putting on a (sometimes genuine, sometimes fake) happy face :)",
      "MessageIndex": 433,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "lbgal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210527/profile",
      "Content": "May 6, 2015 10:53AM lbgal wrote: Welcome cj - your kids are very cute!!! Star bright - I loved your post about how you handle it all, especially being stage 4. Most of the time I'm ok but sometimes I get really discouraged. Your post came at the right time. Patty- you are my hero! Please keep posting. I am so happy you are feeling good after all the hospital adventures. Everybody else - warm hugs!!!!",
      "MessageIndex": 469,
      "PostDate": "06/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    }
  ]
}