{
  "AuthorID": "lcs513",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178405/profile",
  "Posts": [{
    "AuthorID": "lcs513",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178405/profile",
    "Content": "lcs513 wrote: I am 43 and woke up in the middle of the night 9 days ago with left breast pain. Upon closer inspection noticed breast was twice its normal size and was firm. When I examined my breast, I had a yellow discharge from the nipple. I had no palpable lump, no skin changes, no fever, no redness of breast. I thought these might be fibrocystic changes, so I began wearing a sports bra and watching my caffeine intake. The tenderness improved some but my breast remained swollen twice it's normal size. I went to a breast specialist and had a bilateral breast ultrasound. Right breast ( no symptoms) was essentially normal and left breast ( swollen breast) showed a fluid between my implant and the breast tissue). Also showed lymph node enlargement. Fluid was aspirated(clear yellow) and was sent for gram stain, culture, and cytology. I was put on antibiotics. 2 days later, I could now palpate lymph node. Went back to breast specialist. Cytology inconclusive due to presence of too much blood. Culture negative for bacteria, and gram stain negative-just showed WBC. The lymph node was larger and had lots of \"activity\" and most of the fluid was gone. The breast was still tender. Bloodwork was ordered. I was to stay on antibiotics and return in 2 days. Which was today.... CBC was normal except for a slight elevation of monocytes. Liver function tests normal. With ultrasound, the lymph node was still enlarged but the vascularture had improved. Dr. Decided not to do lymph node biopsy and have me stay on antibiotics and see how things are in a week. My breast swelling I believe is returning. No redness in breast but it is tender. Sharp sudden stabbing pain in breast as well. I am trying to be patient but I really think I may have IBC. Has anyone been diagnosed without skin changes or redness? Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "10/05/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/804509",
    "Title": "New...Breast pain, no redness. IBC? lcs513 NancyHB"
  }]
}