{
  "AuthorID": "LD3",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213960/profile",
  "Posts": [{
    "AuthorID": "LD3",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213960/profile",
    "Content": "Apr 12, 2015 01:17PM LD3 wrote: I am nearly 11 years out from my diagnosis. At age 34, I was diagnosed with breast cancer in my right breast. Even though scans showed nothing in the left breast, I opted to have a double mastectomy anyway. Pathology report confirmed it was indeed present in the left breast and I had one positive node. Chemo consisted of 4 A/C and 4 Taxol, with Neulasta injections given the day after each chemo treatment. After chemo, I was supposed to be on Tamoxifen for 5 years, but only lasted 3 due to side effects. I am thankfully still cancer free, but definitely still feel the joint pain/aches that most of you seem to be experiencing. My doctors also told me it's unusual and to take the occasional ibuprofen. However, sometimes it is so bad I feel like I'm 80 and worry I might fall down stairs or something. At the grocery store/Target/etc. I always get a cart whether I need it or not just for the relief it gives me while walking. Cold days are hardest. I workout, but have many times been derailed due to terrible pain in my lower back, knees, feet, or right arm. Sometimes, usually after increased activity, my arm and hands ache and I lose sensation in my hands. There have been times I can't even write or grasp and hold a glass of water. This can last anywhere from a few hours to a few days. After a few years, I noticed a different, unusual pain that started under my right implant and through to my back. I felt this most often after workouts that involved pushups and upper body work. My doctor thinks the scar tissue from my surgery has continued to grow and is causing that pain. I am wondering if others, 10+ years out, are experiencing similar symptoms and if they've found anything to be helpful. I am very thankful to be cancer free, but didn't expect all of these aches and pains to be permanent and would really like to find a way to manage them better.",
    "MessageIndex": 19,
    "PostDate": "12/04/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/136/topics/827213",
    "Title": "Bone and joint pain Hope40 dunesleeper"
  }]
}