{
  "AuthorID": "leahyart",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
  "Posts": [
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Nov 25, 2013 01:03PM leahyart wrote: Thanks Enerva. You'll be in my prayers. I just got a call from my PS. A surgical opening has been made available at his office on the 23rd, so he wants to do it outpatient instead of at the hospital, from which I was probably going home that day anyway. Since I didn't have any complications with the MX post-anesthesia, I'm going to go for it. The surgery will be earlier in the day, he'll be working in his own comfort zone and I'll be able to get home sooner.",
      "MessageIndex": 104,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Nov 26, 2013 05:55AM leahyart wrote: Christmas will be here, whether we are ready for or not. I am really blessed though, my 11 year old son has a thte top of his list \"For Momma to be home and okay.\" Santa can definitely bring that!",
      "MessageIndex": 125,
      "PostDate": "26/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Nov 26, 2013 05:59AM leahyart wrote: My PS put me in a sports bra that hooked up the front before I woke up. After that, I got the one's pictured below. I've wore a bra 24/7 since my MX/TE. I especially need the support now that I am nearly full. Looking forward to getting these rocks off my chest soon! :)",
      "MessageIndex": 126,
      "PostDate": "26/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Nov 26, 2013 06:01AM - edited Nov 26, 2013 06:02AM by leahyart I'm skipping the nips all together. Braless, no nips marks, white t-shirts. I'll get some pretties for the hubby until scars fade.",
      "MessageIndex": 127,
      "PostDate": "26/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 2, 2013 04:58PM leahyart wrote: Welcome!",
      "MessageIndex": 222,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Nov 26, 2013 06:07AM leahyart wrote: Oncearunner...I'm not a runner (unless something scary is chasing me. lol), but I WAS a stomach sleeper. Trust me, if you roll over, you'll know it! I propped pillows on either side of me. This kept my arms elevated and away from my sides, I was sore and swollen under both arms for weeks, but it also kept me from rolling over.",
      "MessageIndex": 128,
      "PostDate": "26/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Nov 26, 2013 08:25AM leahyart wrote: Cory, To say that unless you are or have gone through this, you can't understand what it's like is the biggest understatement ever uttered when facing a diagnosis of cancer. People, without even meaning it, can be so inconsiderate. When you are ready and if you think your friend will be able to hear it, call her, tell her how you feel about what she said. She needs to know, so that she doesn't hurt someone like this again. The worst thing for me, in the beginning, when people were just finding out, was the sad eyes. I just looked at people and said \"Knock it off! I am NOT sick and everything WILL be okay.\" I still have my days when I am the only one invited to the pity party, but I know, it will be okay, in time. Cling to your hubby, let him take care of you, now and after surgery. In his own way, he is going through it too and helping you will help him heal too. I'll be praying for you on the 3rd. In the mean time, enjoy your Thanksgiving (if you are in the states) and count your blessings. Vikki",
      "MessageIndex": 130,
      "PostDate": "26/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Nov 26, 2013 12:19PM - edited Nov 26, 2013 12:21PM by leahyart I came across this link today and much of it applies to us as we face and recover from and face surgery again, etc. Many of us \"grieve\" the loss of our breasts...our energy...our sense of safety and well-being. In many ways, it's not so different from grieving the loss of a loved one. Read this if it interests you. Think of me as a loon if you want to. It helped me... http://identityrenewed.com/2013/11/21/15-things-i-wish-id-known-about-grief/",
      "MessageIndex": 136,
      "PostDate": "26/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Nov 25, 2013 12:21PM leahyart wrote: Hi all, I'm a new member and I am 45 years old. I was diagnosed with LCIS right side in July after a routine mamo. Subsequent ultrasounds and MRIs showed \"areas of suspicion\" in left. Opted for BMX with TI recon and SN biopsy. My surgery was August 12th and I have been cancer free since then. My TE transfer is scheduled to December 23rd. \"All I want for Christmas is my 2 new boobs...\" Ha ha. I know how blessed I am to be cancer free. Make no doubt about that. My family and friends, especially my husband, have all been very supportive. But now, with another surgery ahead of me, the reality of it all has hit me hard and I find myself very depressed. I've tried to talk to my husband, but he's so elated that I am cancer free status that he doesn't understand why I anxious and sad. I'm glad to have found a place where I can express my true feelings without disappointing the people I love.",
      "MessageIndex": 102,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Nov 30, 2013 09:53AM leahyart wrote: Enerve and Laurie, I was all business and no emotions when I was diagnosed in July. Until recently, that is. I had my BX on 8/12, went back to work teaching kindergarten 4.5 weeks later and didn't look back. Now I getting ready for my transplant and have had some weeks without going to the doctor and the adrenaline that got me through to here has worn off. I am now, officially a basket case! I cry at the drop of a hat, I'm tired ALL. THE. TIME!!! And the TEs have been VERY uncomfortable...my joy now, is that in a few short weeks, I will have the weight of the world off my chest.",
      "MessageIndex": 179,
      "PostDate": "30/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 2, 2013 02:02PM leahyart wrote: Bobogirl, I am more that happy to update the calendar while you are recovering...How can I do that though? I guess it just won't be at the top?",
      "MessageIndex": 213,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 1, 2013 07:58AM leahyart wrote: I'll be a cheerleader for all! :) Vikki",
      "MessageIndex": 185,
      "PostDate": "01/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 2, 2013 02:05PM leahyart wrote: Aviva, My PS put me in a sports bra that hooked up the front before I woke up. I had to wear that for about 2 weeks, then I was aloud to wear whatever type of supportive bra I wanted...no underwire. I never had a compression wrap, at least not so far. Vikki",
      "MessageIndex": 214,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 2, 2013 05:06PM leahyart wrote: Piano Girl, I completely relate and understand the desire to \"be done.\" I think we all feel that way. Here's my experience so far. 1step...diagnosis...2nd step\" how fast can we be done?\" 3rd step\"1st recovery with TEs, etc.\" 4th step \"mourning\" (there was no time for that until now) 5th and future step - transfer TE for Perm implants. I am SO READY for the weight to be lifted off of my chest, but still nervous about another surgery. Like all of us, I think, I'm ready to be done. I already consider myself a survivor...just ready to be done. You are in my prayers! Love from a Prayer Warrior to a Warrior Survivor <3",
      "MessageIndex": 228,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 2, 2013 05:18PM leahyart wrote: Tae, You have given us all such great advice. Thank you. We'll continue to pray for you as your treatments progress. I had my DMX with TE surgery on August 12th so we're looking at over 16 weeks out and this is truly the most uncomfortable I have been. The expansion process has been worse than the surgery for me.",
      "MessageIndex": 232,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 4, 2013 03:16AM leahyart wrote: Warrior Woman, thanks for posting the video link. We are brave, strong and we are courageous! WE ARE SURVIVORS!!! Every one of us! Vikki",
      "MessageIndex": 252,
      "PostDate": "04/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 6, 2013 05:05PM leahyart wrote: Hi Friends, I am so glad everyone is doing well and recovering from surgeries this week. I've had drama not relate to cancer this week that has kept my mind reeling. I know this isn't the proper forum, but I feel like we are kindred spirits. When I read your posts, even though I'm new to group, I feel your pain and rejoice in your successes and healing. We have a commonality that will always bind us. First, one thing you don't know about me is that I am a kindergarten teacher and love every single one of my 5 and 6 year-olds and treat them and expect the same of them as I do my own natural born children. It's amazing what my kinderfriends accomplish that they never even dreamed of. I love watching them grow and love when they come back years later and tell me that they STILL love me. Monday morning, one of my former students, an 8 year old little boy was murdered by his mother before she turned the gun on herself and committed suicide. I spent all night after finding out about the shootings, in horror, of what my sweet angel must have thought when he saw his mommy aiming a gun at him. I late found out that, by God's grace, he was asleep when she shot him. Obviously she was disturbed...I will never wrap my mind around the senselessness of this tragedy. THEN....Wednesday the 14 year old daughter of my assistant attempted suicide. She was unsuccessful, thank God, and is in a rehabilitation facility. What has me so conflicted, worried, upset and ANGRY!...is here WE are, fighting for our lives, giving our bodies over to mutilation and poison JUST TO SURVIVE to see as many birthdays and we can...and others don't realize the gift they've been given. Obviously, they have an illness that I don't understand. I've probably said too much. I apologize if I've offended anyone. Vikki",
      "MessageIndex": 287,
      "PostDate": "06/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 22, 2013 06:09AM leahyart wrote: Tomorrow's the big transfer.  For some reason, I am MUCH more anxious about this surgery than I was about the BMX. :(",
      "MessageIndex": 493,
      "PostDate": "22/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 15, 2013 06:04PM leahyart wrote: Thanks everyone, for your kind words and prayers.  I haven't been on in a while...My mind is still reeling from my sweet little friend, who died so senselessly, then my uncle passed away this week from a 2 year battle with lung cancer.  He fought a hard fight and has made it to the other side now.  I think my assistant's daughter is finally going to be getting the help she needs...I just hope they don't change their minds again.  It has been a whirlwind of emotions.  I am not usually an overly emotional person, more analytical in difficult situations and grateful the rest of the time. Right now though, I am just so sad, scared, not sleeping, VERY uncomfortable from my last fill and dreading my surgery on the 23rd.  It's hard trying to be strong and \"normal\" for my family, friends and 23 5-year-old students and their parents.  I go in for Pre-op tomorrow.  I know it will all be okay, eventually, and there will be a new normal and I will feel joy again...I'm looking forward to that. To all of our sisters having surgery this week, and to all of your friends and family, you will be in my thoughts and prayers. December 17th - SherryR, December 18th - TB90, December 19th - 1resilientc, December 20th - blissful BMX To everyone recovering from earlier surgeries, you are also in my thoughts and prayers. WE ARE NOT IN THIS ALONE!",
      "MessageIndex": 409,
      "PostDate": "15/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 18, 2013 04:36PM leahyart wrote: My weepy friends, I am part of the crowd. VERY depressed.  Transfer is Monday and I am SOO nervous, anxious, scared,...no more needs to be said.  Every time someone asks how I am, I lie, smile and say, \"I'm fine!\" Then I find a quiet space, cry and try to face my students without a bunch of questions.",
      "MessageIndex": 463,
      "PostDate": "18/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 2, 2013 02:06PM - edited Dec 2, 2013 02:13PM by leahyart Oceanrunner, 2bluestars, Pianogirl, corpor, and ClaireFras, you will be in all of our thoughts and prayerstomorrow. We are in your corner! Let us know how you're doing when you are up to it.",
      "MessageIndex": 215,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 2, 2013 05:10PM leahyart wrote: Bobogirl -Yes, it is Vikki, and no I can only edit my own posts. However, I will update the calendar as we go along...It just won't be at the top of the page. You can copy and past when you are back on line. I'm sure we'll be in touch through this week. Be sure to let us know what you need too! Vikki",
      "MessageIndex": 230,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 4, 2013 03:12AM leahyart wrote: Prayers are going out to Carebear, Soriya, Warrior Woman and Abarker as well as for their families and surgical teams today. God's bless you all and can't wait to hear from you when you are back on your feet again. Vikki",
      "MessageIndex": 251,
      "PostDate": "04/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 4, 2013 03:17AM leahyart wrote: Happy Birthday Sandra!",
      "MessageIndex": 253,
      "PostDate": "04/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 16, 2013 01:27PM leahyart wrote: Lighthouse - Definitely do the SNB on the other side.  They will grab them through the BMX.  It is not an extra or invasive incision like you had on the other side.  It will allow your mind to rest at ease...especially with all you have already been through.",
      "MessageIndex": 426,
      "PostDate": "16/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "leahyart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192418/profile",
      "Content": "Dec 18, 2013 04:31PM leahyart wrote: Swimmon, I developed a yeast infection at the site of one of incisions.  Looked liked ANGRY acne to me.  Is there an odor?",
      "MessageIndex": 461,
      "PostDate": "18/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    }
  ]
}