{
  "AuthorID": "Leatherette…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
  "Posts": [
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 16, 2017 09:30PM Leatherette wrote: I have been fatigued for about a year. Since September, I do a two mile walk almost every day, the first half uphill, and I had been remarking to my husband, \"Shouldn't this be getting easier? Every day it feels just the same as when we first started.\" My tumor is pretty large and deep, and I wonder if it presses on my heart and/or lungs. It certainly feels that way when I am walking. I'm sure the docs would say no if I asked. the tumor will be out Monday, so it will be interesting to see if I feel a change once I recover from the surgery",
      "MessageIndex": 60,
      "PostDate": "16/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/778724",
      "Title": "Anyone have problems with fatigue prior to diagnosis? cfdr dlj140"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 24, 2018 08:07PM Leatherette wrote: I did TCH and had a port. The port placement is more of a procedure than a surgery. I did it because my veins have always been hard to find, leading to multiple pokes, a fear of needles, and terrible bruising. I was glad I did the port. If you are stage 1a, I think you have IDC with your DCIS, because DCIS is, I believe, considered stage 0. I am not triple positive, but am Her2+ and grade three, and was told TCH would be the most effective treatment. I also liked doing every three weeks rather than every week. I hope this info helps you with your decision.  Best, L.  ",
      "MessageIndex": 1,
      "PostDate": "24/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866780",
      "Title": "triple+,DCIS,Stage1a,grade3-ChemousingTaxol(weekly)andHerceptin Rosee Tresjoli2"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 24, 2018 06:48PM Leatherette wrote: Hi Rhoda, I have anxiety and depression, and the wait for the treatment plan was the hardest part. You can ask for a prescription for valium if you don’t already have one. Once I had a treatment plan, I was much tougher than I ever thought my fragile self would be! All those years of preparing for the worst with anxiety may have actually helped. Wishing for a low grade and stage for you..... Best, L.  ",
      "MessageIndex": 6,
      "PostDate": "24/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/866140",
      "Title": "Diagnosed at age 33 RDizon124 Lula73"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 27, 2018 07:03PM Leatherette wrote: The way I look at it is, an anxiety disorder is when you worry about things that aren’t actually threats, so when an actual threat comes along, you have the worrying and coping skills firmly in place. I don’t know if valium is stronger than the meds you are on-mine are different, but it’s a fast-acting rescue med. I don’t find it to be too strong (or strong enough, really), but it helps most people who take it.  ",
      "MessageIndex": 12,
      "PostDate": "27/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/866140",
      "Title": "Diagnosed at age 33 RDizon124 Lula73"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 21, 2018 05:03AM Leatherette wrote: Hey, it’s a reason. Go with it. Fight god and the universe. And chemo sucks. I am emetophobic, too, and I did not vomit once in the 4 months of chemo because I took the anti nausea meds. It sucks, and there are people all over these boards who have done it, some multiple times, and some for the rest of their lives. And some had shitty lives before they got bc, some had great lives that got shitty. Don’t be positive. Be pissed and determined. Live.  ",
      "MessageIndex": 10,
      "PostDate": "21/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/866037",
      "Title": "It's cancer. Jadedjo Jadedjo"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Dec 14, 2017 07:03PM Leatherette wrote: I was not told about any of these things, just read the things NotVeryBrave said here on BC.org. ",
      "MessageIndex": 5,
      "PostDate": "14/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860903",
      "Title": "Speciial precautions around the house mudd Leatherette"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 9, 2017 11:53AM Leatherette wrote: Wearing mine for the first time today! So far, it is much softer and better shaped than the one I made for myself. I didn't knit the one I made, because I only know how to knit rectangles, but cut the molded cup out of an old bra of mine and stuffed it with polyfill. It was good to have before I got something else, but the knitted knocker is much better. I also have a hellacious scar that still hurts quite a bit. It arrived super-stuffed. Iwashed it by hand with the polyfill in it, and it still isn't completely dry after hanging overnight. Wash without the polyfill if you want to wear it ASAP.",
      "MessageIndex": 6,
      "PostDate": "09/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/851997",
      "Title": "Knitted knockers BethHG lrwells50"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 28, 2017 06:44PM Leatherette wrote: Started out with high grade DCIS, 6+centimeters, was going to have a mastectomy on that side due to the size of the tumor, then they found Invasive Ductal Carcinoma as well. So I had a left side mastectomy, but do wonder if I should have had both removed. If you feel ready to do this, it is insurance that lowers the likelihood of recurrence. Best, Leatherette  ",
      "MessageIndex": 6,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860474",
      "Title": "DCIS 0 high grade and opting for Bilateral mastectomy Shakes561 Rrobin0200"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 29, 2018 03:16PM Leatherette wrote: Hi Jadedjo, Just to give you an example of a timeline...this was mine: May 5,2017, Mammogram, radiology said def., DCIS, suspicious for IDC May 19, Met with breast surgeon May 26, met with plastic surgeon -at this time, not sure if I would have lumpectomy or mastectomy, and would have maybe had immediate recon if I didn’t need chemo June 2, original lumpectomy scheduled, but couldn’t get MRI appt until June 4, so had to postpone June 4, MRI biopsy June 19, mastectomy (DCIS too big for lumpectomy, also still think there is IDC, but it was too deep for the biopsy to find) June 23, Mastectomy pathology report confirming IDC tumor deep in DCIS one June 29, met with Oncologist and genetics July 7, port placement July 10, echocardiogram because getting herceptin July 25, first round of chemo Objectively, looking back, it was probably a typical to fast timeline, but the time between the steps was always excruciating. Best, L.  ",
      "MessageIndex": 4,
      "PostDate": "29/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/866260",
      "Title": "How long safe to wait ? Jadedjo odat4me"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 11, 2018 07:53PM Leatherette wrote: Maybe stock up on most foods before surgery, then do your walk to the store for little things, like you were saying? I don’t know about where you are, but there are people who volunteer to do things for people in treatment- maybe someone like that could do your laundry? And make sure your laundry is all caught up before? Handwash essentials like underwear and hang them to dry overnight? I’d try to carry as little as possible, I was told no more than a gallon of milk in terms of weight (8.5 lbs). I’m not sure...I know this is an overwhelming time! Is there a friend or neighbor who will want to help in any way?  ",
      "MessageIndex": 8,
      "PostDate": "11/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866532",
      "Title": "After surgery what can you carry?how heavy Jadedjo jenndenino578"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 1, 2017 05:48PM - edited Sep 1, 2017 05:49PM by Leatherette I've gotten SheaMoisture products at Target and Walgreens. Sometimes they are in the African American hair care section. At Target, they are always out of things. You can also order through Amazon.  ",
      "MessageIndex": 25655,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 1, 2017 01:44PM - edited Oct 1, 2017 01:45PM by Leatherette Canadiangirl, I am taking Docetaxel (taxotere), lost a lot of hair, but it started to grow back at round three-a combo of the dark stubble of hair that didn't fall out and light coloured babyfuzz. I don't know if I will lose it again and start over with regrowth, but it's nice to know the follicles are working. I have 75% of my eyebrows and eyelashes, and I'm currently at day 3 of my fourth cycle.   ",
      "MessageIndex": 25776,
      "PostDate": "01/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 7, 2017 01:51PM Leatherette wrote: Lilsuzyq- congratulations! I searched on eye twitches and was directed to your earlier post here. My eyes are twitching like crazy-it's like someone is playing piano under my eyelids! ",
      "MessageIndex": 1171,
      "PostDate": "07/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 12, 2017 07:33PM Leatherette wrote: Well, I have my first thieves oil lozenge in my mouth. I don't have any sores, but my tongue has been hurting this round, and the lozenge is making that feel better. I have also had a terrible taste in my mouth, and it is helping with that, too. And since it is sugar free, I can have one before bed and not have to brush my teeth, leaving whatever healing properties there are to work their magic at night. The strongest flavors I taste are clove and lemon, with a touch of eucalyptus. I like it",
      "MessageIndex": 63,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858258",
      "Title": "Mouth Sores rdeesides ChemicalWorld"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 28, 2017 08:43AM Leatherette wrote: Ugh, maybe don't follow my tips....the taste bud is worse, and the thing on the roof of my mouth really hurts! It has, however, started 5 days later than on the last round. I guess I am back on the smoothie diet.",
      "MessageIndex": 7,
      "PostDate": "28/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858258",
      "Title": "Mouth Sores rdeesides ChemicalWorld"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 2, 2017 07:07PM - edited Sep 2, 2017 07:08PM by Leatherette Very happy-did not take vicodin at all today and have not had any bad pain. I think the one on the tip of my tongue is healing. Of course, now I am aware of other sores, but they at least don't hurt when I am not even eating anything!  ",
      "MessageIndex": 38,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858258",
      "Title": "Mouth Sores rdeesides ChemicalWorld"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 10, 2017 01:15PM Leatherette wrote: Uh, my fingertips are pruny, as if I was in a bath too long....what's this",
      "MessageIndex": 646,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 24, 2017 08:11PM Leatherette wrote: Thanks for all of the reassurances, everyone! And there are definitely the sh&$ days still for me, just surprised the sense of taste,appetite and hair seemed to be bouncing back. My mother in law died this morning, peacefully in her sleep. She wasn't even on any pain meds-no pain. She'll be missed",
      "MessageIndex": 1040,
      "PostDate": "24/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 25, 2017 05:11AM Leatherette wrote: Travelhound and Purplestargazer, Have you taken L Glutamine for the neuropathy symptoms? I've definitely had the freezing hands and feet, but it gets better when I take the L Glutamine. Other than that, hands and feet have been working well. I have been dropping things more, but I think it's fatigue, not neuropathy. AC+T sounds brutal compared to my experience with TCH. Sorry so many people are having bad SEs with it. ",
      "MessageIndex": 1059,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 28, 2017 05:05PM Leatherette wrote: Hi all, Between a small amount of SEs, death of MIL, and working, I'm not posting as much as usual, but had to post when I saw everyone's good news. We are cruising. I have my 4th of 6 TCH infusions tomorrow, and my sister is flying in tonight to be there with me. She came to be with me for my MX, but has not seen me in person since I started chemo. I have to say, even though I feel relatively good, I really look like a ''chemo patient' today. Pale skin, dark circles under eyes, and, of course, headscarf. If I put a lot of makeup on to mask it, I look like an old clown, so this is just how I am going to look for a while! Hang tough, Leatherette     ",
      "MessageIndex": 1124,
      "PostDate": "28/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 30, 2017 08:35PM Leatherette wrote: LoJo, I did a five mile walk today, too. I've been laying in bed since we got back, but it was good. I hope I didn't get sunburned. I didn't know what PFC was either, and kept forgetting to ask-thanks for the definition! Paulette, I am so glad you went out with a friend! Do that as much as you can. It does lift the spirits!  ",
      "MessageIndex": 1148,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 5, 2017 06:50PM Leatherette wrote: Paulette, good luck tomorrow! Sunnyjay, yay! As for me, a little better than yesterday, but taking a shower was a struggle, as well as walking the one flight of stairs in my house. I was able to do a little work from home. I can't believe my MO originally wrote a note to my work saying I could work full-time (I corrected him, but that could have caused me problems, if work had it on record that I was able to work full time, but wasn't). I called the oncology nurse, because we are supposed to if \"fatigue interferes with everyday activities\". When I said I could barely get out of bed, she said that was normal. Don't know why I am supposed to call, then. I'm definitely having cumulative issues. On the bright side, I ate oatmeal and split pea soup today, with no ill-effects so far. It's the little things, right? I'm sorry people missed pre-planned trips. How disappointing. My husband wanted me to start thinking about what I want to do when I'm \"all better\", and while it's sweet, I just got overwhelmed thinking about how long it might be, and how I will be expected to be \"all better.\" Definitely not taking enough happy pills, Leatherette  ",
      "MessageIndex": 1184,
      "PostDate": "05/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 15, 2017 01:51AM Leatherette wrote: Return of the mouth sores....they are at least not on the inside of my lips or tip of the tongue, but one inside my right cheek hurts like hell. It hurts to touch the outside of my cheek, and I'm getting a headache. At least I have hydrocodone, which I am definitely using. Hope the smoke clears for everyone in CA. Seattle had its turn this summer, and it was not fun.  ",
      "MessageIndex": 1258,
      "PostDate": "15/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 30, 2017 03:44PM Leatherette wrote: My nails look really good. I have kept them super short, and have been keeping OPI nail envy on them. I am not following the directions religiously (2 coats, then every other day add a coat, remove after a week and start again, something like that). My hands are pretty dry, as are the cuticles. I am telling work that I need to on full time leave again. I've been working 2days a a week, but what has been happening is that I can't go in at all for the first ten days of my cycle, then I have to cram it all in one week, the week before infusion. Last time, as a result, I was not able to keep up with drinking water, and now have to spend way too much time preventing constipation. Not being able to see well is also interfering. I'm a little bummed, but it is stupid to feel that I have to work whenever I start to feel a little better, and I was getting too stressed.  ",
      "MessageIndex": 1442,
      "PostDate": "30/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 30, 2017 05:35PM Leatherette wrote: Paulette-one treatment left. I have driven myself crazy trying to find a pattern/predictability to side effects. There were a few things that started to be a little predictable, but overall, I feel like I just have to see what each day brings.  ",
      "MessageIndex": 1447,
      "PostDate": "30/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 1, 2017 07:03PM Leatherette wrote: Nice to hear from so many people who are PFC! Teese, I can't believe you did that much one week PFC! I'll probably be in bed moaning on my day 7 PFC. I ended up deciding not to go on full time leave - too much trouble and loss of income when I only have one infusion left. I am getting so much support from my department and my school-they are taking things off my plate, so I can manage. So now, I have been working two days a week. My FMLA ends Jan.2. I found out that once that ends, I can stop working altogether, continue towork two days a week, or be full time for the rest of the school year. I am not allowed to increase my hours to anything but full time (I wanted to go to four days a week starting in January). This is what HR says, though. My principal said that there are ways around that.....we'll see. Pretty dumb rules when there is a shortage of school psychologists.  ",
      "MessageIndex": 1479,
      "PostDate": "01/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 8, 2017 06:19PM Leatherette wrote: Not so grumpy today, but anxious! I worry something will prevent me from my last infusion tomorrow, prolonging this awful process, or that I will get my infusion and have the worst side effects ever! I have a call in to my onc nurse so she can talk me down, and I am about to take an Ativan. Don't know if it will have much effect since I just took Dexamethasone. I agree with you on attitude, runnermom, and I think I am talking myself back into one. I don't think I am feisty, though-I am more of a \"slog through what you must, and move on,\" kind of person. I am not a person who is \"kicking cancer's ass,\" more like tunnelling through it, and near the end of this tunnel. I do admire the feisty ones!  ",
      "MessageIndex": 1569,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 9, 2017 11:25AM Leatherette wrote: Feeling a little more kickass today-I like to dress fierce for my infusion days, and have my knee-length black boots on. Feel good, a little over steroided, but good. Sitting in the chair for my last motherf#%€ing chemo! Rawr",
      "MessageIndex": 1577,
      "PostDate": "09/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 16, 2017 09:58AM Leatherette wrote: Avoiding soy is related to being ER/PR +, right (which I'm not)? I love tofu, and have been vegetarian for a long time-that would be hard to give up. I drink 1%organic milk. I already have been eating a lot more beans, and plan to make that a bigger part of my diet.  ",
      "MessageIndex": 1660,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 18, 2017 12:49PM Leatherette wrote: So, I got through my mastectomy and have now finished chemo. No rads or hormones in my treatment plan. The next step for me is planning (or not) reconstruction, and finishing up my year of herceptin. My hair is already growing back, so I don't think I have to worry about permanent taxotere hair loss. My neuropathy seems to be dissipating. My 'big C' resolved itself. Why am I constantly on the verge of tears/panic attacks? Why am I not feeling grateful that things aren't worse than they are? This is not how I thought I would feel at this point. I wonder if I am just afraid that I am not mentally or physically prepared to rejoin \"normal life\", but have to/will be expected to.  ",
      "MessageIndex": 1669,
      "PostDate": "18/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 28, 2017 11:29AM Leatherette wrote: Thanks for posting all of your good news, LoJo, and congratulations! Here is my hair almost three weeks PFC:   I keep patting it and (gently) rubbing it. My 14 y.o. daughter says it's creepy! Oh well.  ",
      "MessageIndex": 1696,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Dec 4, 2017 08:42PM Leatherette wrote: Okay, so I'm not crazy-there is a PFC letdown. At almost 4 weeks PFC, I think it's clearing. I think it was partly what Paulette was saying, where you want to do so much, because this was the time you were waiting for, but you still have SEs, and cumulative effects. What came next for me was extreme anxiety that I was not ready to join the \"real world\", and that I'd be expected to. Like I said, feeling better now, and my hair is growing FAST. And dark. I may be able to go without a headcovering by the new year! I do notice a little bit of a receding hairline, though. Teese, so sorry about your rads skin burns. Sounds really rough. LoJo, so great that you got to go to a concert! I hope to do that soon. I have been afraid to plunk down money for any type of planned event, because things have been so unpredictable.    ",
      "MessageIndex": 1756,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Dec 18, 2017 02:49PM Leatherette wrote: Hi All, I miss being on here! I have been lurking, but don’t have anything to add to the rads discussion. I’m doing pretty well, watery eyes the last active side effect. I had some days of major depression/panic, but it has subsided. Pruny fingertips, keeping a close watch on my nails. Hair progress:     Anyway, reading, and glad to see Proud, Paulette and Teese doing well! Hope everyone else is, too!  ",
      "MessageIndex": 1821,
      "PostDate": "18/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 25, 2017 09:36AM - edited Jul 25, 2017 09:38AM by Leatherette So glad things are going great now, mother hen! I've finished herceptin and Taxotere, and am 1/3 through my carboplatin. No bad initial reactions, which was my biggest fear. Delicious pastries from an awesome bakery across the street, lots of Free Cell (the 'cool' version of solitaire and texting with my sister, funny nurse......not a bad day so far.",
      "MessageIndex": 397,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 25, 2017 01:50PM Leatherette wrote: Glad all the first days reported went well! I, however, will not be going to a baseball game or anything of the sort. I don't feel terrible, but tired (5 hrs sleep last night, long day), with a kind of \"out of body\" feeling and some heartburn. Not complaining, though-I feel great about how the day went and will enjoy my steroid high the next two days, then brace for post-steroid reality. Great to have all the care and support here! ",
      "MessageIndex": 415,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 26, 2017 11:57AM Leatherette wrote: I am not going take this for granted, but today has been great. My body likes the steroids. My bowels have been a little rumbly and overactive, but really just cleared some constipation and haven't had me in the bathroom over and over. I gardened and walked a lot today, Pubes first, eh? Hopefully they go fast and don't itch? Another good thing-I do not crave my evening glass of wine at all. I thought that may be hard. And another positive vote for Nuun! Drinking it now. I don't usually drink soda or sports drinks because of the taste/calories, but the Nuun is great. My docs are not automatically giving me Neulasta, which I thought was a given. Did those getting it have concerns that led to it, or maybe it depends on the chemo you get? Sunnyjay, sorry about the bone pain. I'm glad you were able to enjoy a nice birthday evening first",
      "MessageIndex": 423,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 27, 2017 02:37PM Leatherette wrote: PingPong, glad you have a nice steroid buzz going. I am scared to give myself injections, so props to you. But who knows, at this point, I think I am learning about what I can actually do when needed. Well, despite still being on steroids, reality is paying me a visit today. Woke up nauseous, had to eat saltines in bed to take my steroids, and, while it helped, I was still nauseous and took another anti nausea med. Tired, but not wiped, but definitely not flying like the last two days. I did do an 18 block walk to take my daughter to/from summer school, and got some groceries and carried them home. I figured I'd get it (exercise)out of the way early in case I feel worse later. I feel pretty lucky though, as there is no pain or serious issues. A good day to work on a puzzle and prep my wigs. Be well, all, Leatherette",
      "MessageIndex": 441,
      "PostDate": "27/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 4, 2017 07:31AM Leatherette wrote: Paulette and theantz, wishing you uneventful infusions. 10 days out, I am doing pretty well. I did not have any nausea when I woke up, and went a few hours before I got nervous and took a zofran, just in time, I think! We are having a (Seattle,wimpy, 90 degrees) 'heat wave', and I walked two miles yesterday. I am pretty wobbly when I walk more than a couple of blocks, even if I'm not tired, so it keeps my husband on his toes. I had a smoothie and a piece of zucchini bread for breakfast, which I have been making for everyone else but was too sick to eat. My sense of taste is better, not great. I started putting glutamine in my smoothies, today and yesterday, and I could swear my hands and feet felt more normal pretty soon after. No hair loss yet, acne from steroids gone, just feet peeling a little. I think I'm going to have 'baby feet' pretty soon! I feel like I am constantly aware another shoe may drop, but not so much that I can't enjoy feeling pretty good. My next infusion is August 16",
      "MessageIndex": 578,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 6, 2017 07:51PM Leatherette wrote: They aren't worried about anything else, so I'll just get magic mouthwash and be out of here. Thanks for the well wishes and advice about eyemasks, Dawn and Paulette",
      "MessageIndex": 594,
      "PostDate": "06/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 10, 2017 11:19AM Leatherette wrote: LoJo,😕. Well, I am pretty sure that the next time I wash my hair, half of it will be going down the drain. I buzzed to three quarters of an inch, so may go shorter if this process is not quick. If I pinch a little section of my hair and pull gently, there's a fair amount of hair between my fingers. I think the mouth sores look like they are getting better, but they still hurt like a bitch. But last night I was able to eat out with my husband and enjoy a beer. I had to eat very carefully. I was trying to keep my diagnosis from my mother in law, who is 88, has pancreatic cancer, and dementia. She is asleep most of the time now.Wouldn't you know, the one thing she is noticing is my hair, and keeps asking me about it. I've been wearing a cap, and one day she said, \"I can't believe you got all your hair under that cap!\" then fell asleep, so I didn't have to say anything about it.",
      "MessageIndex": 644,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jan 19, 2018 04:29AM - edited Jan 19, 2018 04:29AM by Leatherette Hi all, saw my PS today, and am getting tissue expander on Valentines day. DIEP will be in June or so.  ",
      "MessageIndex": 1917,
      "PostDate": "19/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jan 26, 2018 03:27AM Leatherette wrote: Hi! Great news, Paulette and Runnermum! I have been doing well and working my butt off so I am caught up on my work before I have a tissue expander placed on February 14. Happy Valentine’s day, right? I have been taking L-glutamine daily, and neuropathy is close to gone. The only lingering SE is tearing eyes, and I notice that getting better as well. And the crazy depression has lifted. I am planning to have DIEP reconstruction after school gets out in June, since I don’t have any more sick leave. It was great to read everyone’s posts and catch up. You are all amazing.  ",
      "MessageIndex": 1939,
      "PostDate": "26/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Feb 15, 2018 07:16PM Leatherette wrote: Hello All, I hope you all had a good Valentine’s day. For mine, I got my tissue expander placed and a tiramisu cupcake. I had more pain yesterday than today, and found out that hydrocodone isn’t much better for me than oxycodone (side effect of major itching). Good news is, I think I don’t have to worry about being an opiod crisis statistic. I’m lucky I’m not in pain, or at least, not much. It’s nice to have a ‘mound’ rather than a ‘dent’ on my left side. They filled it more than I expected, probably because I had skin sparing and had space to ‘grow’. I was working a lot up till yesterday, so I’m not on BCO or Facebook a lot, but thinking about all of you! I got my first post chemo haircut on Sunday! I went to a really cool lady barber who specializes in styled crewcuts, and I’m glad to be out of the ‘monchichi’ phase. Gentle right side side hugs to you lovely ladies.  L  ",
      "MessageIndex": 1963,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Feb 19, 2018 06:32AM Leatherette wrote: Hi Clynne, I did TCH from July 25 to Nov.9, so very much like yours. My stomach makes a lot of weird noises, and there’s a lot of air in my system, but other than that, everything is working well",
      "MessageIndex": 1965,
      "PostDate": "19/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 19, 2017 03:34PM Leatherette wrote: SimplySammi, I wish I had a mom like you! I am so sorry your daughter has breast cancer, but so glad she has you! Another (not so lucky) Heather",
      "MessageIndex": 20,
      "PostDate": "19/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/856881",
      "Title": "Port placement for Chemo / Chemo before DMX SimplySammi11 MTwoman"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 21, 2017 10:34AM Leatherette wrote: Congrats on final TC, Teese! Had another rough night after Wednesday 's infusion, and pretty busted up today with fatigue. Tomorrow should be the day that my upward trajectory starts. I did get to see the eclipse in my backyard, and that was a good diversion. I didn't need totality-it was cool as is, and about as far as I could drag myself today. ",
      "MessageIndex": 741,
      "PostDate": "21/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 21, 2017 01:13PM Leatherette wrote: Sorry, JenRuns! I hope the antibiotics work quickly! It is so hard to make plans-I was going to talk to my supervisor about returning to work, and felt to cruddy to even talk today. I hope your work can be flexible with you",
      "MessageIndex": 743,
      "PostDate": "21/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 3, 2017 11:10PM Leatherette wrote: Hi-I am good-this was a tough round, but I am through the worst. My next infusion is Thursday (halfway point!). Today I walked for an hour, then was able to enjoy some himalayan food and a beer at a restaurant. It was good to feel a little normal! But I am not wearing my wig-too bloody hot! So, \"normal\" with a cap on it!  ",
      "MessageIndex": 818,
      "PostDate": "03/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 9, 2017 12:14AM - edited Sep 9, 2017 12:15AM by Leatherette I think I was itchy because the steroids are supposed to suppress allergic-type reactions, which I haven't had because I never missed the dose before. But I was also anxious and panicky about it, which can also make me itchy. Luckily I had my Zofran with me- puking on top of everything else, in an art museum, would not have been fun. I had a crazy, long busy day at work today. Being on the steroids helped, but I was definitely foggier than usual. I can still do everything, I just have to work to focus much more than usual. And it is definitely harder to keep my food and water intake up at work. It's just non-stop fires to put out and interruptions at work. But I am so glad to have it, and hope I can keep doing it - I'm kind of nuts like that. And my colleagues have been wonderful about everything. I'm lucky to have my second family at work! So, I think I have another good day or two in me, then I'll be \"back in the shit\" days 4-7 to 4-10, depending on how lucky I am this time. Please, please, I need a break from the mouth sores this round! Pink, sorry about the low RBC, bone pain, and appointment mixup. I hope things are better soon, and you don't need a transfusion. \"Fun times\" is right!  ",
      "MessageIndex": 831,
      "PostDate": "09/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 17, 2017 03:34PM Leatherette wrote: I don't feel that bad, just tired and a sore throat. No temp, so it's probably just mucositis. Mouth still behaving. But I can feel my WBC dying off.....10 days out from infusion. I'm going to put cranberry juice on my shopping list, too, just in case. I'm going to share yet another indignity cancer mocks me with...pubic hair-lost completely down the middle, Staying nice and firmly on/over the bikini line. I'm not planning to go swimming anytime soon, but, really? Hope everyone is doing well.  ",
      "MessageIndex": 958,
      "PostDate": "17/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 19, 2017 04:45AM Leatherette wrote: JenRuns, didn't you run every day before BC took over? May impact weight gain, I don't know. I can assure you, I was not running at all before dx.  ",
      "MessageIndex": 974,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 20, 2017 06:14AM Leatherette wrote: Hi, just wondering if anyone else is having this: after my third infusion, not only am I not losing hair, but I can see new growth as well as growth of my stubble. I was expecting to progressively lose all of it. Of course, it could still happen, but that's not what it's looking like now.  ",
      "MessageIndex": 998,
      "PostDate": "20/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 24, 2017 03:55AM Leatherette wrote: Two things: My SEs are so mild, and with the growth of my remaining hair and new growth, should I be worried that the chemo isn't effectively eradicating the rapidly dividing cells? We are always reassuring ourselves on this board that the hair loss means the chemo is working, so I'm getting a little bit freaked out. Also, when I went into urgent care last week, the staff accessed my port to get blood (after assuring me that they were trained to and did it all the time)and they were able to inject heparin and take a tiny bit of blood, but couldn't get enough for the tests they had to run. They ended up having to poke a vein in my hand. Has this happened to anyone else? I hope it doesn't mean they broke my port! ",
      "MessageIndex": 1031,
      "PostDate": "24/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 29, 2017 03:10PM Leatherette wrote: Sitting here getting my infusion, nothing bad, just have enough stuff in me to feel a little weird. It still seems to take forever! I started at 7:20, now at twelvish I still have 1.5 hours till I'm out of here. Others are coming and going, and here I sit. Glad to have my sister to talk to, getting all the dirt from back home! I have to get an echocardiogram soon, too. Hopefully I don't have to go to Tacoma to get it in a timely manner! I plan to continue posting, especially pix when I have more hair...and definitely want to hear what everyone's up to for a while to come.   ",
      "MessageIndex": 1136,
      "PostDate": "29/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 30, 2017 11:33AM Leatherette wrote: Paulette-my last infusion is scheduled for Nov. 7.  ",
      "MessageIndex": 1142,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 3, 2017 07:01PM Leatherette wrote: Ugh, I feel horrible. Have not been able to get out of bed hardly at all today. Day 5 after fourth infusion. I thought I had this, but apparently it has me..super weak, nauseous. Hope no one else is feeling like this today.  ",
      "MessageIndex": 1158,
      "PostDate": "03/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 19, 2017 04:33AM Leatherette wrote: Paulette, still one more after this one, but close to done! Jenruns, concealer doesn't work because my eyes are tearing all the time, adding to the healthy look! And I agree, my son is very handsome. 😉 Teese, so glad you get to spend time with your sister! Supportive sisters rock!    ",
      "MessageIndex": 1336,
      "PostDate": "19/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 20, 2017 02:05PM Leatherette wrote: Glad your infusion was uneventful, Paulette! Mine was as well, and I was at work from 8:15 to 4:45 today. I am paying for it now-totally exhausted, but got enough done that I will only have to work a couple of hours all next week if needed (generally a bad week, days 5-10!). Jen, hope you can enjoy whatever good comes your way on your birthday. I still forget that I am 46 now, because my birthday was a blur of whatever.  ",
      "MessageIndex": 1346,
      "PostDate": "20/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 31, 2017 10:41AM - edited Oct 31, 2017 10:42AM by Leatherette Hi All, Thanks for the encouragement regarding going back on full time leave, but it's starting to look like that won't happen. I got kind of a terse email from HR saying I will lose my job and benefits if I do that, and to let them know when I've made my decision.Nice. I asked if I can keep my insurance through COBRA, and of course they didn't answer that question. I'm considering going to HR sans headscarf and prosthesis and talking to them about this, ala Teese. L.    ",
      "MessageIndex": 1462,
      "PostDate": "31/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 4, 2017 02:05PM - edited Nov 4, 2017 02:09PM by Leatherette Proud, if you can swing it, do one of each! Teese, are you saying you can administer a bag of fluids to yourself through the neulasta pod? I wish I could just get some iv fluids every once in a while, so I'm not spending all my waking hours drinking water, peeing, and refilling my water cup! I think I will ask if they can give me extra iv fluids while I get my next infusion.    ",
      "MessageIndex": 1507,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 6, 2017 11:36PM Leatherette wrote: Sorry, I wasn't meaning to worry anyone! I thought I had sinusitis, and was worried my chemo would get delayed. My temp wasn't 100.5, but they wanted me to come in. Multiple tests later, I am fine. So at least I know that I'm clear as of now. Thank you for the well wishes and prayers",
      "MessageIndex": 1542,
      "PostDate": "06/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 7, 2017 07:41PM Leatherette wrote: JenRuns, glad the infusion was uneventful and the dose was lowered a little. I hope that reduction helps. Several posts back, Teese was talking about not having anymore patience for all this. Me too-I have serious battle fatigue. I'm so tired of weird things happening to my body-I'm like, \"Oh, really? WTF now?\" when I find little purple marks on my hand and arm, have strange, intense itches - one on my forehead, which is now all red, muscle spasms in my calf, new things like that. I'm getting pissy. I'm supposed to be an old hand at this now and know what to expect..... Anyway, whaaah, poor me, poor all of us! Okay, I'm done. Ready to continue soldiering forth.  ",
      "MessageIndex": 1556,
      "PostDate": "07/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 14, 2017 07:48PM Leatherette wrote: It's great to read about so many slowly getting their lives back! My taste buds are definitely different with carboplatin only-still weird, but definitely not as bad. I still have the smelling cigarette smoke all the time thing-will be glad when that goes. I have a sinus infection and am on antibiotics, but it's not too bad. They're working. The nurse was asking me if this felt like I usually feel when I have a sinus infection, and I told her that nothing about my body feels normal, so I can't tell! Anyone else getting lots of hot flashes? This wave of heat goes up to my scalp, making me sweat through scarves and caps more than when it was actually hot! They don't really bother me that much, but I'd like the chemo induced menopause symptoms to go away for a while. I should have a few more years.....  ",
      "MessageIndex": 1647,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 23, 2017 12:17PM Leatherette wrote: Excited to be cooking, tasting and eating...... sweet potato gratin pumpkin pie mushroom gravy celebration field roast (Vegan turkey alternative-good, I promise!) cranberry sauce stuffing carrots, peas, brussel sprouts I started to really fantasize about food when I couldn't eat during chemo-the concept of \"food porn\" is now totally understood by me. I hope you all have a good day. I am very thankful for each and every one of you!  ",
      "MessageIndex": 1688,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Dec 20, 2017 05:43AM Leatherette wrote: Dives, I was on the same chemo mix you are starting, and I lost a lot of weight/strength/energy. Exercising was hard, but I wasn’t starting out with a good exercise regimen (walked one mile uphill/one mile downhill daily, plus walking and up/down stairs all day at work). For me, it hit harder as the treatments progressed, so get in your exercise whenever you feel you possibly can. Everyone reacts differently, but I hit a wall after my third round and had trouble getting out of bed for 10 days. The next three weren’t as bad. But as you can see, there are people like Jenruns who get a lot of exercise in! I hope all goes well with your first infusion! *and on hair- I can’t go without a hat/scarf yet, because the sides of my forehead are too high-like male pattern baldness, even though my hair is coming in dark-I always had thinner hair in that area.  ",
      "MessageIndex": 1840,
      "PostDate": "20/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jan 12, 2018 10:24PM - edited Jan 12, 2018 10:27PM by Leatherette Paulette, that hair is looking strong! You don't look like you have wimpy, wispy, downy hairs, just tough, bold ones! And Jen, your hair is the Ron Jeremy of hair porn. Grow on! I think I’m still losing eyebrows. My daughter got me an eyebrow stencil and powder for Christmas, so that will be used for a while, unless I want to shell out for microblading.   ",
      "MessageIndex": 1888,
      "PostDate": "12/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 30, 2017 05:39AM Leatherette wrote: Teese-making a port placement appt today, most likely. JenRuns, thanks for the info on the genetic testing-that helps-if it comes back positive, hopefully they'll wait on the second breast as well. As I scroll through the posts, looks like everyone on this thread is HER2-. Any other July starters HER2+? That said, I am glad for all those who aren't HER2+, just makes it a little more scary for me to see it looking rare... Funny, you spend your life wanting to be an 'original', then this happens and you want to circle the wagons with the people you have the most in common with disease- and treatment- wise! Anything to have something be known, familiar or predictable L",
      "MessageIndex": 81,
      "PostDate": "30/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 30, 2017 06:21PM Leatherette wrote: ...and, my husband has chicken pox! Really, what next? At least my chemo hasn't started yet....",
      "MessageIndex": 86,
      "PostDate": "30/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 11, 2017 04:10PM Leatherette wrote: Jenruns,   We'll be thinking about you tomorrow! ",
      "MessageIndex": 158,
      "PostDate": "11/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 20, 2017 03:27PM Leatherette wrote: Hi emily mh-Thanks for noticing my post about HER2+ status. Any thoughts on how your first day went? Are you getting the TCH treatment? My first one is in 5 days, and I'm scared, mostly of potential allergic reactions. I am also going nuts waiting. I'm going to try to enjoy myself, but it's looming over me... I am going to a bluegrass festival/camping this weekend. Hope it helps! After reading the post about nails, I got OPI Nail Envy (the original formula has formaldehyde, so I got the one for \"dry and brittle\" nails), cut my nails real short (fingers and toes), used the OPI on them, then teatree/vitamin e oil on the cuticles. I hope this helps, because I am not sure I'll tolerate icing the hands so well (still going to try). How would I tap my screens? Teese-glad you were able to do your exercises at a level that felt good! Enjoy your good days! Maybe there will be more the second time around. Leatherette",
      "MessageIndex": 292,
      "PostDate": "20/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 24, 2017 09:59AM Leatherette wrote: Yes Teese, thinking about you here, too. Hope all goes as well as it can. I am flying on the decadron-it's actually useful today, because I am too busy to be worried. I washed and brushed both dogs, hung up a load of laundry outside, took it down, the put up another one, picked berries, cleaned the kitchen and my bedroom, and am only stopping because I'm feeling like a nut. So far it does not make me any hungrier. I had to make myself eat, too. I take it again at 8:00 tonight. How will I sleep? I haven't read too much from people on the boards about it, but wow. Maybe I haven't looked in the right place",
      "MessageIndex": 374,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 6, 2017 07:07PM Leatherette wrote: Aw, man! They told me I have to go to urgent care",
      "MessageIndex": 591,
      "PostDate": "06/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 16, 2017 05:54AM Leatherette wrote: My MO isn't letting me reduce/eliminate the steroids. Well, he isn't recommending it, so I'll see how this round goes before pressing the issue. Paulette and dmjmom, wishing you both uneventful rounds. Take care. ",
      "MessageIndex": 681,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 18, 2017 01:06AM Leatherette wrote: I get Hollywood beauty tea tree oil, which is already diluted, and put directly on my nails. It's usually in the African-American hair care section of the drug store. That said, I got something else for my cuticles today because the tea tree oil isn't totally doing the trick. I got sally Hansen cuticle gel, but haven't used it yet. I keep Saltines next to my bed, as I tend to feel nauseous when I first wake up. But that's usually not until morning. Second infusion yesterday, walked four miles the day before, two miles in the evening yesterday, and about two more today. I have energy from the steroids, but have to watch carefully where I put my feet-a little clumsy! So far only side effects are a little heartburn and watery eyes. My sense of taste just started to dull at lunchtime, but it still tasted good. My mouth sores are almost totally gone and stopped hurting days ago. I think the steroids help with the healing. Take care, everyone!  ",
      "MessageIndex": 710,
      "PostDate": "18/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Dec 12, 2017 08:46PM Leatherette wrote: I wish I could tell you something specific that helps. Positive self-talk, marking milestones (\"three chemos done, halfway through!\", etc) helped sometimes, and sometimes they weren't enough. Let others do things for you, and you will be overwhelmed by how kind others are-that can help on two levels-less to do, positive feelings.... Maybe start with letting someone else hide the elf (unless you love doing it). Don't be mad at yourself for feeling negative, it just propogates the cycle, and uses up energy that could be used finding the next positive nugget to keep you going. Expect that this may well be a shitty Christmas (cancer christmas), and be pleasantly surprised when things go well. I hope this helps.  ",
      "MessageIndex": 1,
      "PostDate": "12/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860812",
      "Title": "Just starting this fight Mamatwoboys PVM"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 4, 2018 09:57PM Leatherette wrote: It’s a tough call. I went with a uni, to keep sensation/nipple on one side. No (known) genetic component, and my mother in law had bc in her 40s, what I would call a radical lumpectomy on one side, and lived to be 88, dying of non breast cancer causes. So, no regrets yet.  ",
      "MessageIndex": 3,
      "PostDate": "04/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867604",
      "Title": "Uni or double Samnjb MCBaker"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 28, 2017 09:56PM Leatherette wrote: It's hard.I felt like all the news I got was progressively worse at initial diagnosis (because it was). But once we knew what we were dealing with and I had a treatment plan in place, news seemed to get progressively better. MRI, US and mammo all showed it being different sizes.  ",
      "MessageIndex": 4,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860453",
      "Title": "Every scan shows my tumor as being bigger! ToughCookie101 randrgirl"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Feb 28, 2018 09:47PM Leatherette wrote: Be careful about what you eat-nothing that can tear your skin in your mouth (chips, dry crackers), avoid spicy foods. Biotene toothpaste and mouthwash instead of regular, and I used a toothbrush with a really small head so it would just hit my teeth and not the inside of my mouth. Mouth sore queen here.  ",
      "MessageIndex": 7,
      "PostDate": "28/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/862800",
      "Title": "Mouth problems. Lahotch65 Lahotch65"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jan 10, 2019 09:42PM Leatherette wrote: I had a mastectomy because my lump was big and I was afraid about the possibility of not getting clean margins and docs having to go back in to get them. I’m in Seattle, and got great care through Kaiser Permanente.  ",
      "MessageIndex": 3,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869277",
      "Title": "Third surgery recommended!!! What to do? viewfinder viewfinder"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 8, 2017 12:46PM - edited Jul 8, 2017 12:48PM by Leatherette Got my port in today and found out my first chemo session will be on July 25th.",
      "MessageIndex": 457,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Apr 25, 2018 12:38AM Leatherette wrote: I’m a half flat DD, and frankly, it’s getting old. I had my umx in July 2017. my best solution has been wearing a nursing sports bra. It flattens my remaining breast a little, and makes it easier to pad the other side the right amount. I think I am pretty well adjusted to the situation, but I am planning to have DIEP reconstruction. That said, if someone told me I couldn’t do reconstruction, I don’t think it would be the end of the world. I miss wearing underwire bras and the lift/support they provide. I am wondering if there’s a way to make a bra that has underwire on one side and something gentler on the other..... L.  ",
      "MessageIndex": 57,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/861492",
      "Title": "How have you adjusted to being Half Flat? sm627 MexicoHeather"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Feb 5, 2018 01:34PM - edited Feb 5, 2018 01:34PM by Leatherette Hi, I am @3 months post final chemo, and all of my hair has come back. It is about 1cm long. I did not do cold capping.    ",
      "MessageIndex": 5,
      "PostDate": "05/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/862221",
      "Title": "Taxotere and permanent hair loss Debsmisto Hattiegirl"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 7, 2017 04:57PM Leatherette wrote: Sweetp, adding Nuun electrolyte tablets to water makes it a lot easier to drink. I use lemon-lime. Maybe if you stick with plainer foods, even when you feel like you can handle more, it won't come back to bite you later. I've read about many people having trouble with red meat, even though they need the iron and protein. On my wierd days, oatmeal, split pea soup (just peas, onion and garlic, no ham) and Ensure keep me alive and don't cause GI problems. I had yogurt at work yesterday, and that was better than I expected. I was losing weight pretty quickly, too, but I think that's tapering off some because now I'm more fatigued and moving less. Working is hard with chemo-I am amazed that many people seem to work full time or close to it. Two days a week, some of that from home, is all I can do right now, and some days I feel like I'm going in when I shouldn't.  ",
      "MessageIndex": 66,
      "PostDate": "07/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856900",
      "Title": "Did you work through chemo? Autum1031 sweetp6217"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 25, 2017 10:18AM Leatherette wrote: 45",
      "MessageIndex": 751,
      "PostDate": "25/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 13, 2017 08:56PM Leatherette wrote: I hear about so many people working through chemo! I start on July 25, so I have some time to see how it affects me. I work in public schools, so I'll want to make sure my blood counts are good before entering the germ factories. I am no longer a teacher, though, so I am not exposed to as many germs. I am a school psychologist, so I generally see one student at a time. I figure I can Purell and clean surfaces between students, and have them wash hands/ purell before our sessions. I hope I can work! I am also the family breadwinner, and want to be able to use my sick leave as needed, rather than use it all up avoiding work/germs! Plus being home for too long will make me crazy.But I will do it if that is the only way to be safe.",
      "MessageIndex": 4,
      "PostDate": "13/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856900",
      "Title": "Did you work through chemo? Autum1031 sweetp6217"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Dec 5, 2017 12:30PM Leatherette wrote: I saw a breast surgeon before an MO, because my biopsy only showed DCIS, and everyone was pretty sure there was IDC as well, just the DCIS was so large that the biopsy couldn't get to it. So I didn't see an MO until after post-surgical pathology reports came back with IDC.  ",
      "MessageIndex": 18,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860556",
      "Title": "Surgeon vs Oncologist First? DagnyT stexas"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Dec 7, 2017 10:10AM - edited Dec 7, 2017 10:16AM by Leatherette I have only had one surgery so far, the mastectomy. I couldn't do reconstruction at the same time, but people do that. When I thought I had a choice between lumpectomy and mastectomy, I was leaning toward mastectomy because I was scared the margins wouldn't be clean and they'd have to go back in. But then I didn't have a choice due to the size of my tumor.  ",
      "MessageIndex": 23,
      "PostDate": "07/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860556",
      "Title": "Surgeon vs Oncologist First? DagnyT stexas"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 10, 2017 01:44AM Leatherette wrote: I lost probably 15 lbs since starting chemo, and had lost 10 before that due to anxiety about the diagnosis and the surgery. I just weighed myself and am up 5 lbs. It fluctuates. I was not hungrier when I've taken steroids. I have not had diarrhea or vomiting, I just haven't wanted to eat anything much of the time bc it tastes bad. My oncologist has not been worried, but I weigh a different amt on every scale they put me on, and they weigh me fully clothed. I was a little overweight before this all started, so if it all comes back, no big deal, and if it stays off, that's fine, too",
      "MessageIndex": 5,
      "PostDate": "10/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859249",
      "Title": "Did you gain or lose weight? abatract ErenTo"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Feb 25, 2018 01:24PM Leatherette wrote: I didn’t want to do coldcapping, but for those who do, I think having it set up to be done at clinic makes a lot more sense if they are trying to provide proper support for patients who really want it and have enough stress in their lives already. Makes a lot more sense than the TVs they have for each individual attached to the walls at head level at Kaiser Permanente! In all my infusions, one person used one.  ",
      "MessageIndex": 1,
      "PostDate": "25/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/862763",
      "Title": "Cold caps come to Seattle Meow13 Leatherette"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 16, 2018 10:45PM Leatherette wrote: I think it would make sense to wait for the treatment plan before putting too much energy into making decisions. Personally, I am glad that nothing familiar changed while going through treatment. Some people thrive with lots of things and newness going on, but I’m not that way, and even less so during all of this. I’d ask myself: Which location would be easier in terms of getting the support from your parents, friends and community? Can you get good treatment conveniently from your current home, or would the new city improve that a lot? If you are not able to work during treatment, which location is better in terms of cost, work options for your husband? If your husband has already been accepted to grad school, they should be able to defer entrance for a year. It sucks to have to put exciting plans on hold because of cancer, but focus on your health and sanity for now.  Best, L.  ",
      "MessageIndex": 1,
      "PostDate": "16/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/865924",
      "Title": "IDC mothering during treatment RLoveC msphil"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 9, 2017 05:41PM Leatherette wrote: Scaredmommy, this sucks, I am so sorry. I think you are taking the right first steps to handling it like a pro-even now, xanax and netflix (I found Tig Notaro to be hilarious and cathartic, as well as Lady Dynamite) are the winning combo for the bad days. And frankly, I was worst off when waiting to get the full picture of my diagnosis. For me, it was harder than surgery and chemo. Take care of yourself, and let yourself lean on positive people in your life. They may react in awkward ways at times, but they want to help! Best to you, and hoping for the best possible news for you from here on out!  Leatherette  ",
      "MessageIndex": 4,
      "PostDate": "09/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/859956",
      "Title": "Just diagnosed IDC and DCIS Scaredmommy1971723 Scaredmommy1971723"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 25, 2017 06:08PM - edited Jun 25, 2017 06:10PM by Leatherette Yes, me, SBKH! I also check my remaining one out at times. Can I tell you all the worst post-mastectomy side effect for me? Sharp armpit stubble! On my MX side, where my arm has been at my side more, the poking, chafing and stinging....ow. I finally was able to get a razor up there with a Venus ultra comfort blade (big gel lumps on each side of the blades)then I threw some cornstarch on it. Sweet relief! Of course, post surgery days have been 20degrees hotter than usual. Of all the things.....I guess I better get used to the unexpected! ",
      "MessageIndex": 282,
      "PostDate": "25/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 26, 2017 10:13AM Leatherette wrote: CBsDetour, congrats on jumping one hurdle. Glad to hear the lymph nodes are clear and you aren't experiencing much pain",
      "MessageIndex": 298,
      "PostDate": "26/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 28, 2017 09:05AM Leatherette wrote: Great to see you, Illimae! Be well. Daphne, it was corn starch, not cornflour (that might hurt!). It is supersoft and absorbs moisture, without irritating chemicals like deodorant. That did not work for long, though, and yesterday I just had to tape a gauze pad in my armpit to keep the sides from rubbing! I found a bra that worked for me, at Whole foods of all places. The company is Pact, and I got the racerback lounge bra. Extra large-and my ribcage is 36 inches. I doubt people who have had double mastectomies would be able to get into it. It's not easy with umx, but it feels great once it's on. I made a flax seed foob that I can put in the other side if I put a surgical pad over my incision, but it's really there to support righty. I was able to tape rolled up cotton pads on either side of my drain tube so the band doesn't cut off the flow",
      "MessageIndex": 337,
      "PostDate": "28/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 15, 2017 08:18PM Leatherette wrote: I have lashes still, but my eyes watering is the most annoying side effect (not the worst, but the most annoying). I can't read, drive without stopping to wipe my eyes, and I have crust around my eyes all the time. And definitely no eye makeup.  ",
      "MessageIndex": 22,
      "PostDate": "15/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/785509",
      "Title": "Watery eyes? Whatashocker3 Leatherette"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 18, 2017 06:26PM Leatherette wrote: It happened to me, but only after the first infusion of TCH, and I am now ten days out from my third. My onc did not change my steroids or anything. Hope yours gets better. It's no fun!  ",
      "MessageIndex": 12,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/759890",
      "Title": "Serious Acne On Head and Face heathermcd Leatherette"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 29, 2017 12:18PM Leatherette wrote: I just ate a banana and it hurt. A banana! ",
      "MessageIndex": 17,
      "PostDate": "29/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858258",
      "Title": "Mouth Sores rdeesides ChemicalWorld"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 30, 2017 08:04PM Leatherette wrote: OMG, the one on the tip of my tongue hurts so much it is making me cry, and I even took ibuprofen. ",
      "MessageIndex": 26,
      "PostDate": "30/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858258",
      "Title": "Mouth Sores rdeesides ChemicalWorld"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 1, 2017 05:07PM Leatherette wrote: First round, I got the mouth sores on day 8, but I thought I was out of the woods this time-didn't happen until day 13. The sores aren't as big as last time, just the location being the tip of my tongue is what's brutal. I had to go in today for my eyes (tearing, gummy, glued shut when I wake up), but ended up leaving with vicodin for the mouth pain. Apparently it is all mucositis. Nothing is infected, which is good. The vicodin is making life a little liveable again. Paulette, I do feel that the L-glutamate helped with neuropathy symptoms. I am not having tingling or numbness in my toes or fingers this time like I did with the first round. It alsomay have helped by giving me the five extra mouth sore-free days this round. I'd say it's worth a try, but check with your oncologist to make sure it's okay with your treatment plan. In some cases, they don't want you to take it. Freya, the Vegemite idea is interesting, but I really don't like Vegemite. I'll keep it in mind as a last resort.",
      "MessageIndex": 36,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858258",
      "Title": "Mouth Sores rdeesides ChemicalWorld"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Feb 13, 2019 11:14PM Leatherette wrote: I had one breast for 9 months. I wouldn’t say I thought it was sexy, but I didn’t think I looked bad. But all along my plan was to have DIEP, so it was temporary. If I planned to go flat, I would have had a double mastectomy. If I had decided later not to have the DIEP, I probably would have had my other breast removed. I’m happy with my decision to have the DIEP.  ",
      "MessageIndex": 26,
      "PostDate": "13/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/868942",
      "Title": "sexy with one breast? AliceKo Leatherette"
    },
    {
      "AuthorID": "Leatherette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Leatherette wrote: Has anyone else experienced more sensory sensitivity since chemo? I was already pretty sensitive (had to cut all tags out of clothes, cannot wear wool/animal hair fibers, or certain synthetics), but now I feel the littlest seam or even a little lint ball. I’m 3 mos PFC. I am also a lot more sensitive to noise. Age 45 at diagnosis Dx 5/2017, DCIS, Left, 6cm+, Stage 0, Grade 3, ER+/PR+ Surgery 6/18/2017 Mastectomy: Left Dx 6/23/2017, IDC, Left, 1cm, Stage IA, Grade 3, 0/2 nodes, ER-/PR-, HER2+ (IHC) Chemotherapy 7/24/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Targeted Therapy 7/25/2017 Herceptin (trastuzumab) Surgery 7/1/2018 Reconstruction (left): DIEP flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/862367",
      "Title": "Sensory sensitivity since chemo? Leatherette Lula73"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 9, 2017 10:46PM Leatherette wrote: Hi all, I'm having a left breast mastectomy on June 19 or 21st, then waiting for pathology before next step - diep flap. I'm mostly doing okay, but have the occasional cry about the loss of my breast. I am 45, and have a 16 year old son and 13 year old daughter. ",
      "MessageIndex": 75,
      "PostDate": "09/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 19, 2017 08:34PM Leatherette wrote: Hello all, I had my UMX with sentinel node biopsy today. Not in pain, did not freak out when I saw my scar. Happy to have this behind me. Staying overnight at surgery center",
      "MessageIndex": 181,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 23, 2017 06:29PM Leatherette wrote: Coobies are seamless bras, some with removable pads (and you can put both pads in one side  shopcoobie.com. Bear in mind that I haven't received them yet. I'll review them after I try them.",
      "MessageIndex": 238,
      "PostDate": "23/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 23, 2017 10:22PM Leatherette wrote: Agreed, Tara17's post was awesome. I just got my pathology results back, and the good news is that the known cancer was removed with clear margins, and the two sentinel nodes were negative. However, it is not only DCIS, but also a pretty aggressive IDC. So, no new boob for me for a while, and likely 6 months of chemo",
      "MessageIndex": 242,
      "PostDate": "23/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 25, 2017 10:17PM Leatherette wrote: SusanGA - \"I walked around holding it.\" Until I read that, I hadn't realized that I was doing that last week, too. I also took pics with my phone, but deleted them right away. This does suck. But, what can we do? Thanks for sharing, everyone. I went out to a (casual) restaurant for dinner with (obviously) one breast tonight, and a drain in my little purse,because I was hungry! I'm pretty sure no one cared, and it was good.",
      "MessageIndex": 295,
      "PostDate": "25/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 2, 2017 08:40PM Leatherette wrote: Hi all, I didn't mind the drain that much, but once I got it taken out on Thursday, I realized it was the main thing causing pain and limiting mobility. So I feel great now. Good thing, too, because my husband came down with chicken pox on Friday and has been in bed ever since. Kids,dogs,chickens and dying man all relying on me and my post surgery bod Tomorrow is my post surgery appt., and on Thursday I get my port placed. Ready (maybe) for round two.",
      "MessageIndex": 392,
      "PostDate": "02/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 5, 2017 06:08PM Leatherette wrote: SBKH, I'll be thinking of you tomorrow. When I got my drain out, it did hurt while she was pulling it out, but it was bearable. She was pulling 4 to5 inches of plastic out of me, so I guess I should have expected it. I was not given any muscle relaxants. There was this purple glue over my incision. The doc told be to take it off, that it was easy. After half an hour in the bathroom with tweezers, it was off, but so was a little skin! Ow. Overall, the scar looks and feels better though. I put neosporin and a gauze pad over it. I haven't heard anyone else mention the glue. Is it common/uncommon",
      "MessageIndex": 423,
      "PostDate": "05/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 6, 2017 01:35PM Leatherette wrote: Sounds good, Nightcrawler",
      "MessageIndex": 429,
      "PostDate": "06/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 9, 2017 02:14PM Leatherette wrote: Tomorrow it will be three weeks out from my umx. Drain gone, can drive, can't reach my arm straight up, but close. I had my port placed Friday, which was painful and movement-limiting the first day, but nothing today(just two nasty bruises. I have been able to put t-shirts on for about four days. Carefully. So today I am wearing a t-shirt with my newly arrived knitted knocker in it, and my shirt covers the port bruises, so I look like my old self again, which is nice. Sucks that I can't just enjoy it for a while. I do have two weeks until I start chemo, but I'm doing things to prepare for it or cleaning to take my mind off it. I'm scared. I don't want to potentially feel like shit until November or longer. I am going to meet with a wig stylist for a free consultation on Tuesday, which may actually be a little fun. Thanks everyone for your updates, encouraging words for everyone, and sharing your fears and anger. Things are just kind of all over the place, and it's great to have an anchor here",
      "MessageIndex": 502,
      "PostDate": "09/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 10, 2017 04:15PM Leatherette wrote: OMG Illimae, that app made my day. Here's me, ready to fight the big C In a few weeks  Or:  Or:   Depending on my mood.",
      "MessageIndex": 510,
      "PostDate": "10/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 17, 2017 04:15PM Leatherette wrote: SBKH, I am 28 days out, and have not experienced nerve pain. It's not a given. The closest thing I think I've had to nerve pain are these little tingly \"electrical\" feelings near the scar. Didn't hurt It is awful that anyone has these pains, like F L Buckeye93, but as an anxious hypochondriac who is terrified of pain, if I was expecting it to definitely hit at some point, I'd be a wreck. It's helpful to be aware that it can happen, though, so you don't think something is going wrong if it does. Wishing everyone a day with less pain, L",
      "MessageIndex": 575,
      "PostDate": "17/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 12, 2017 08:35PM Leatherette wrote: That's what I got",
      "MessageIndex": 65,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858258",
      "Title": "Mouth Sores rdeesides ChemicalWorld"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jan 2, 2018 09:24PM Leatherette wrote: Hi, mybct, I got a toothbrush with a really small head and soft bristles, and that really helped. I don’t know what to say about the black when rinsing-didn’t happen to me. I did have awful mouth sores fo a couple of my chemo rounds-worst side effect, hands down. Take care, Leatherette  ",
      "MessageIndex": 71,
      "PostDate": "02/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858258",
      "Title": "Mouth Sores rdeesides ChemicalWorld"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 3, 2017 11:14PM Leatherette wrote: Better today- how about you guys? I guess I have some white blood cells on board again!  ",
      "MessageIndex": 44,
      "PostDate": "03/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858258",
      "Title": "Mouth Sores rdeesides ChemicalWorld"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 27, 2017 07:33PM Leatherette wrote: Sounds like you are doing everything right, however, I was told not to floss. I got a waterpik. I found that my sores started to really heal when I was on steroids for my second round, and since then, I'm being super careful to do the salt water rinse as much as possible. Despite that, I have a tastebud right on the tip of my tongue that is inflamed (not sure what it's called when one tastebud swells up and hurts) and the roof of my mouth has something that threatens to be a problem, but hasn't. I also got a toothbrush with a tiny head because my toothbrush would brush against the sores, hurting and probably interfering with healing. I'm cleaning my teeth more thoroughly as a result. They are the absolute pits, and to me, the worst side effect. I am sorry you have so many. It hurt to talk, not just eat. Ibuprofen helped with that. Magic mouthwash only helped in that I could get my whole mouth numb so I could fall asleep. Hope something here helps! L. ",
      "MessageIndex": 1,
      "PostDate": "27/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858258",
      "Title": "Mouth Sores rdeesides ChemicalWorld"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 31, 2017 04:26PM Leatherette wrote: I had L glutamine anyway because it is supposed to reduce neuropathy, and I am sitting here sticking out my tongue with the paste on it. I will swish with it, too. I'll let you know if it helps. I have Natural Factors L glutamine, and I don't remember how much it cost, but it wouldn't have been $45.  ",
      "MessageIndex": 30,
      "PostDate": "31/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858258",
      "Title": "Mouth Sores rdeesides ChemicalWorld"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 9, 2017 09:34PM Leatherette wrote: ML1209- I ordered those lozenges-I'll report back on how they work for me, Paulette. If they really work, the price will be well worth it! Even if it tastes bad...I like clove and eucalyptus, so maybe I'll like it",
      "MessageIndex": 58,
      "PostDate": "09/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858258",
      "Title": "Mouth Sores rdeesides ChemicalWorld"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 14, 2017 08:54PM Leatherette wrote: On the 19th, I will have a sentinel node biopsy and left side mx, and wonder, what are people's reactions to their appearance after either a full mastectomy or skin/nipple sparing mastectomy? I'm getting a skin/nipple sparing mx, and am a little freaked out by the thought of an \"empty bag\" there rather than a tidy line of stitches. I feel like I won't want to look at it. I'm sure it sucks either way. I am not even particularly hung up on my appearance, or so I thought, but I'm worried I'll lose it ifI look. Sorry, not feeling really tough or empowered right now.",
      "MessageIndex": 116,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 13, 2017 10:13PM Leatherette wrote: Legomaster, I was told NOTHING about scar care. And now my reconstruction is a year out at least, so I want to work on healing that area. I have started massaging with Bio Oil, and have silicone strips, which I am already using for my keloid SNB scar. And SBKH, great news on your pathology report! I waited a while to look, too. Take the time you need. I will say that it wasn't as hard as I thought it would be once I did it. I still haven't shared with my husband, for me, not him. I think he is cool with whatever. I do feel that by being \"strong\" people are not aware of the seriousness of post op recovery. I look \"normal\", but it's work to appear that way, for sure",
      "MessageIndex": 550,
      "PostDate": "13/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 24, 2017 01:42PM Leatherette wrote: SBKH, I had a UMX, and have been wondering lately if that was a mistake. I feel you.  ",
      "MessageIndex": 767,
      "PostDate": "24/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Mar 3, 2018 03:28PM Leatherette wrote: Hi All, Got curious, found this thread, and can’t believe how long it’s been since I posted. Chemo just kind of took over my life, as it tends to do, so I was just on that thread for a long time, but this was my first life-saving support thread! Good to see those of you that I haven’t seen in a while. Best, Leatherette    ",
      "MessageIndex": 819,
      "PostDate": "03/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 7, 2017 06:04PM - edited Aug 7, 2017 06:05PM by Leatherette Thanks for all the advice on mouth sores, everyone! I am going to make more salt water/baking soda right now, and I have a waterpik Insurance didn't cover my magic mouthwash, either. It cost 17 dollars. Jenruns, you look good in pink! Me, not so much",
      "MessageIndex": 612,
      "PostDate": "07/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 14, 2017 09:46PM Leatherette wrote: Babasmom, I don't want to speak for everyone, but I don't think any aspect of bowel functioning (or non-functioning) is inappropriate in this or any other thread at BCO. I haven't thought about elimination this much since my kids were babies. Our treatments are similar, and I had very loose stools the first week (controllable, did not take meds for it) but have been doing everything possible to not be constipated since then. Colace, prunes, prune juice, tons of water, split pea soup, lentil soup, hummus, and I am going, but it's like pellets, like a deer or elk. Miralax is next. I want to get it normal before the next infusion on Wed. I have had three day headaches, but they are just dull, not migraine level. Sorry your side effects have been so bad. I am not out and about every day, but when I am, I share it here bc I am excited about it. So, welcome, sorry you are here, share your poop without reservation,and be well. Leatherette",
      "MessageIndex": 670,
      "PostDate": "14/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 15, 2017 03:32AM - edited Aug 15, 2017 03:33AM by Leatherette Yep, I did the total shave today. The little hairs were driving me nuts, And the showers were not relaxing with all that hair all over me. It actually feels really good. I thought it would make my scalp more tender, but it didn't. It feels better. It feels better with the wig, and it looks better than the \" mangy look \" I was rocking. m I happy to have cancer and be bald? No, but taking control of this hair loss thing is better than prolonging the process to me. My husband and my daughter have seen it (well, my husband helped me do it)",
      "MessageIndex": 675,
      "PostDate": "15/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 16, 2017 01:52AM - edited Aug 16, 2017 01:52AM by Leatherette Wig is tolerable, but def. like my cap more. Bought another one today. Under both I wear a bamboo wig cap, which is great for keeping my stubble comfy. I walked 4 miles today, because I feel like my normal self and I started the steroids for my second infusion tomorrow. That, I wore a cap for, as the wig would have been way too hot and itched when I sweat. The ponytail sounds great, but my sideburn hairline is really low, and is dark stubble right now, which would blow the ponytail's cover. I may try it when my hair is 100% gone. I hope everyone is ok- this thread is getting a little less active. I think people may be posting more on the August start thread. Or maybe everyone is feeling great and living their lives with minimal side effects! ",
      "MessageIndex": 678,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 20, 2017 06:19AM - edited Aug 20, 2017 06:21AM by Leatherette Of course, I spoke too soon. Slept well, but woke up at 5:30 and was off and on the toilet until 800. Now I am still in bed, but may be okay after a shower. Not as bad as my \"bad night\" the first round. And I think the sense of taste is gone. Bah. At least I get to lay here and listen to my daughter and her friend (13 year olds) listen to music, talk and giggle-that helps! ",
      "MessageIndex": 728,
      "PostDate": "20/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 22, 2017 11:26PM Leatherette wrote: Sounds like everyone has it a little rough right now-hope we all get better. I don't know how much to expect things to get better with subsequent rounds-I thought maybe your body gets used to it/you learn how to manage side effects better, but that bumps up against cumulative effects making it harder. Better this time: no acne, nausea controlled, no mouth sores, can taste better Worse: stomach cramping, extreme weakness, signs of neuropathy, sore throat Ugh. Take care, everyone! ",
      "MessageIndex": 755,
      "PostDate": "22/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 24, 2017 09:55PM Leatherette wrote: My shaved part of my head is growing. I would have gone to a quarter inch instead of shaving if I knew it would still grow. It's like the rough side of velcro when I try to put my wig cap on. Once I get the thing on, it's fine, though. I also can't tell if I'm still shedding with it shaved. Hair still needed to go, though. Armpit hair not growing, shaved legs today for probably the last time in a while...eyebrow and arm hairs coming out if I pull gently. Eyelashes hanging tough, even though I have to wipe my watery eyes all the time.As for nether regions-creepy to look so 'young' there. IMO, Just saying. Went to a friend 's for dinner last night. Did not eat much, was in the bathroom for a while, but okay otherwise. It was so nice to do something normal! I didn't even care that the wine was flowing for everyone but me-I was present and upright with lovely people. Taking my daughter back to school shopping today. She's been getting anxious about it, and today is the first day I feel capable this round. Hope everyone is having a good/tolerable day.  ",
      "MessageIndex": 766,
      "PostDate": "24/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 26, 2017 06:48AM Leatherette wrote: Hi all, sore throat and temp fluctuating between 99.5 and 100.5, so I'm at urgent care. Of course when they took my temp here it was normal. This has been going through my family, but I have not touched or kissed any of them. We'll be talking again about good handwashing... Paulette, I don't know of anything to increase red/white blood cells that one can do on their own. Iron if you're anemic to increase red blood cells, but it can cause constipation. Teese, my son will go to college next year, and boy do I hope I can handle it gracefully like you. This whole BC thing has me so emotional- like I was upset (crying) when Glen Campbell died because I used to listen to his records with my dad, who died 20 years ago. I've been missing my dad a lot through this dx and treatment.",
      "MessageIndex": 783,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 4, 2017 02:06AM Leatherette wrote: Sorry, Paulette! Maybe it will be better than you are expecting? I hope so!  ",
      "MessageIndex": 821,
      "PostDate": "04/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 11, 2017 10:03PM Leatherette wrote: Maybe it was, but when I've had panic attacks in the past, they were related to something I was panicking about, not a bowl of oatmeal. But nothing makes sense right now, does it? Thanks, Purple! ",
      "MessageIndex": 862,
      "PostDate": "11/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 15, 2017 07:09PM Leatherette wrote: Paulette, glad the infusion was uneventful. I laughed when I read, \" Two princesses\"! Hope you and your pup feel good this weekend. ",
      "MessageIndex": 933,
      "PostDate": "15/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 19, 2017 12:25AM Leatherette wrote: I don't think I have neuropathy, but my hands and feet are often freezing! I was always a warm hands kind of person, comfortable when others said it was cold. I have lost 25 pounds since dx....is this a weight thing, because my anecdotal data from life supports thinking that thin people usually get cold easily. Anyway, glad I could give you a laugh, Teese and Jenruns, and Teese paid me back tenfold with the phrase, \"....smiling over your pubes.\"  ",
      "MessageIndex": 971,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 19, 2017 03:00PM Leatherette wrote: Thank you.",
      "MessageIndex": 997,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 23, 2017 03:39AM Leatherette wrote: LoJo, congrats on finishing and enjoying a good meal and a margarita!   I'll be chillin' on this thread through at least the first half of November, longer if Herceptin only gives me any problems....  ",
      "MessageIndex": 1024,
      "PostDate": "23/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 7, 2017 11:41AM Leatherette wrote: Hello all, I am doing better-actually went to work for four hours yesterday and feel a lot less anxious about it, but am still pretty tired. Getting dizzy easily. I'm reading everyone's posts and I see a lot of talk about neulasta and rbc counts, neither of which have been a part of my experience. I don't eat any meat, but the thing I have been craving most whenever my taste buds work is saag from a Himalayan place near our house, which is essentially pure spinach. I'm hoping my mouth continues to behave with no sores, and maybe I'll have it tonight. I started using Aveda scalp remedy, and sadly, I can't smell it (love the smell of Aveda products), but my scalp looks and feels better, and my fuzz looks longer. At night I look at my little fuzz halo in the mirror and try not to get too attached to it! It could still go. As far as neuropathy, the L-Glutamine makes it a lot better in about a half hour for me, massage and warm/hot shower help, too. Sunnyjay-I lost my insulated 34 oz cup for a day a while back, and it was totally like losing a security blanket! It cost 20$, so I only have one. Hope everyone has a good weekend. Dare I dream of doing a little Fall gardening today? I hope I can! May we all get to do something good that we weren't sure we'd be able to do!    ",
      "MessageIndex": 1204,
      "PostDate": "07/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 18, 2017 04:28AM Leatherette wrote: Teese-no cognac yet-the sores are healing on their own! I should get it for my next round Jenruns, I am considering diep flap as well, and may wait until the summer after next so I can have a good summer after this past sucky one. Summer because I work in schools. I have been working a ton the past two days, so a little out of the loop here. One thing I'm noticing at work since BC is that I feel more comfortable speaking my mind, and it feels good. I mean, what's the worst that can happen? Cancer? I am very pale and have dark circles under my eyes now. Ick. Infusion 5 of six is Thursday. The end is in sight! Hope everyone is having a good night. ",
      "MessageIndex": 1307,
      "PostDate": "18/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 24, 2017 09:45AM Leatherette wrote: Happy first day PFC, Teese! And no rads until the 29th of Nov.! Dare you even hope for some semblance of life like it was pre bc? Hope you have a great day. ",
      "MessageIndex": 1368,
      "PostDate": "24/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 25, 2017 10:03PM Leatherette wrote: Thanks Paulette-I already had my meetings, and I won't be doing any rads. Not in my treatment plan",
      "MessageIndex": 1390,
      "PostDate": "25/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 27, 2017 03:12AM Leatherette wrote: Teese, I'm pretty sure herceptin continues for a full year, so until july 2018. I think herceptin alone maybe just causes diarrhea, which I have not had while taking it along with the taxotere and carboplatin. Hopefully that means I won't have problems with it.  ",
      "MessageIndex": 1402,
      "PostDate": "27/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 31, 2017 12:37PM Leatherette wrote: Thanks Paulette-I work for the school district, which has thousands of employees. I know we have COBRA, and it's possible that the person who does leaves needs to communicate with people who do benefits. As one of my co-workers said, \"Really, the school district has never worked with an employee with breast cancer?\". Anyway, I hope you had the energy for your appointment and that it went well. Fatigue bites!  ",
      "MessageIndex": 1464,
      "PostDate": "31/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 3, 2017 09:07PM Leatherette wrote: I think it was my last round, I didn't drink enough one day before and one day after, so even though I drank plenty during infusion, I was sick as a dog for several days after. My last infusion is Thursday, Nov. 9; not this past week, sadly, but six more days! I am scared abt side effects, because it has gotten progressively worse since my third round. I can feel my body breaking down; my skin is crazy dry, I have purple hematoma-looking spots on my hand and arm, and I am not bouncing back as I get closer to the next round like I used to. I look like I am 80 years old when I have to climb stairs. In earlier rounds, I could still run up stairs when I was ten days or fewer before my next infusion, and I didn't have to hang on to the railings",
      "MessageIndex": 1502,
      "PostDate": "03/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 5, 2017 06:44PM Leatherette wrote: Be careful what you wish for....in my last post, I said I wanted IV fluids....well I am about toget some bc Ihad to go to urgent care. Won't get into why bc I have to type w my left hand, but we are being cautious so nothing interferes with my chemo schedule! Nothing super serious, though",
      "MessageIndex": 1528,
      "PostDate": "05/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 15, 2017 10:50AM Leatherette wrote: I have been very lucky that nothing has affected my sleep while doing chemo. I keep reading about hot flashes disturbing sleep, but that hasn't been happening to me. I don't know how I could have coped without sleep through all this.  ",
      "MessageIndex": 1650,
      "PostDate": "15/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Dec 2, 2017 05:04PM Leatherette wrote: No herceptin-MO said it was not a problem to miss it once. I think it may have been esophogeal spasms. The urgent care doc said it may be that, and once I got home I remembered it happened to me once so long ago that I didn't remember the symptoms. At that time, we were worried it was a heart related event. With the number that chemo does on the entire digestive system, it's plausible.  ",
      "MessageIndex": 1744,
      "PostDate": "02/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Dec 8, 2017 05:45AM Leatherette wrote: Proud, sorry to hear the scan results weren't what you'd hope. I hope the next treatment is more effective. Well, I have the flu, even though I got my flu shot. I spent a good part of yesterday at urgent care. My temp went up to 103. Fever down now, just feel like a limp rag. Bummer, as I was def starting to feel pretty normal. I had been planning to do xmas shopping this past week. My teeth are sensitive now, and I need to go to the dentist too. Ah, to not think about body/health for a little while! ",
      "MessageIndex": 1775,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 23, 2017 04:17PM Leatherette wrote: Hello, Back from my camping trip, checking in. Love seeing all the tips and updates from everyone. I am starting on Tuesday, like you, Runnermom. Reading this thread reminded me to apply another coat of NailEnvy! It was fun to get all dirty and germy camping, but I am back into sterile mode.....my 16 year old boy got so smelly, he couldn't even stand himself. A first! ",
      "MessageIndex": 359,
      "PostDate": "23/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 25, 2017 09:40AM Leatherette wrote: sorry it sucked so bad initially, but glad you are doing better now, KimE",
      "MessageIndex": 399,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 27, 2017 06:53PM Leatherette wrote: So glad to hear about the bone scan, Teese! Hope you get a good sleep.",
      "MessageIndex": 445,
      "PostDate": "27/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 30, 2017 12:09PM Leatherette wrote: Last night was so much better! I got up and weeded for an hour. I was staggering around the yard like a drunk zombie, but I was doing something! I am trying to work up the desire to eat something besides saltines. I drank a little lentil soup last night,but just made it through about a quarter of a cup. I have not been having trouble sleeping, but I am taking one Ativan at bedtime for insurance. As long as it's just one, I would not worry about having a problem with it. Sleep is so necessary for healing, and it's a time to escape the reality of what we're going through. It is exhausting to be consciously ill 24/7. Tubing sounds like it was so much fun, she1212! When I feel like I have a sense of my SEs, I hope to take more risks and do more fun things. Right now I'm afraid to be too far from my bed or bathroom.",
      "MessageIndex": 495,
      "PostDate": "30/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 7, 2017 12:26PM Leatherette wrote: Hope you get the help you need, Iris. I can't afford it now, but could when my son was a baby, and it was so nice! Uh, I am not finding the magic mouthwash to be so magical. It numbs it very briefly for me. It is better than not at all, I guess",
      "MessageIndex": 598,
      "PostDate": "07/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 15, 2017 02:45PM Leatherette wrote: Runningmama, Legomaster2 and Tara17- thank you so much for your responses-just what I needed to hear. I may re-read them multiple times this weekend",
      "MessageIndex": 130,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 23, 2017 02:30PM Leatherette wrote: Hello all, Thanks for the well-wishes-for me and everyone else who recently had surgery. I wish I could be as cognizant of who is doing what when as some others are, but I am thinking about all of you, wherever you are in the process, appreciating your bravery, humor and willingness to share. My umx was on Monday, was discharged Tuesday, and was able to attend a reconstruction support group Tuesday night with the help of my sister. It was super helpful, and I hope they exist elsewhere. A group of about 15 women were there, told their reconstruction (or no reconstruction) stories, and showed the group their results. I was even offered a feel by a woman who had diep flap, like I plan to get. I got props for being there 1 day post mx (I wasn't trying to be brave - if I didn't go that night, I'd have to wait another month-they meet once a month), but I did start to feel a little woozy at the end, so did not stay to chat. Anyway, that group and having my sister here made it so much better. I had bad side effects from oxycodone (itching all night, all over), so just took ibuprofen. I haven't even taken any today and feel no pain. I never had much pain, but did try the painkillers prophylactically. My mx was skin sparing, and I have to say, the results are hard to look at (puckering, dimpling, visible hair follicles-due to slackness?). I was expecting it, though. The first two days, I only looked at the surgical site, to make sure there weren't problems. When I looked at it next to my remaining breast, it was definitely stark, sad, etc., but I was okay. I am waiting for my coobie bras to arrive, because I'd like to go out more. My remaining breast is a 36DD, and still needs support! There's some chafing as well. Wish I'd thought to get the coobies earlier, but I thought Id just wear my normal bras (underwire!) with padding on the mx side, and even my sports bras are too heavy duty to be gentle to my tender side. Live and learn. So anyways, for those who have not had their mx yet, an example with not a lot of pain, the drain is not a problem, and surviving \"the reveal\". Could not be getting through this without my family andthe thoughtful and generous members of BCO. Next up: Dependent on pathology results- expanders will be placed on July 5, then scheduling diep flap. I am supposed to find out pathology results today or Monday. Feeling hopeful/cautiously optimistic.  L",
      "MessageIndex": 236,
      "PostDate": "23/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 24, 2017 01:29AM Leatherette wrote: Illimae, That is a great emoji! Thanks for the encouragement regarding chemo. I will try to be as active as possible. As far as I know at this point, I don't think hair loss will bother me that much-it's the nausea that I fear. I'll get hooked up with an oncologist next week and know better what to expect. Thanks again, ",
      "MessageIndex": 245,
      "PostDate": "24/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 3, 2017 09:21PM Leatherette wrote: Hi SBKH, I had my drain out on Thursday and my post op today. I was supposed to call them when my drain output was less than 30 cc's for two days straight, and got it out two days later. Until it was out, I did not realize how much of the problem with discomfort and range of movement was due to the drain! I am practically normal since getting that sucker out. Just no hailing cabs with my left arm! And I empathize with you on the husband thing. Mine, however, wants to help, but sometimes that comes out as questioning doctors a little too aggressively, to the point of talking over me in appointments, and sometimes trying to be funny and saying something hurtful unintentionally. As in, there are some jokes I'm allowed to make, but if your boob hasn't been lopped off, you don't get to. I try not to require mind reading though, just give him my teacher look and say, \"Too soon.\" He's my guy, though, and a good one. Just not always properly filtered. Ask friends for help! They want to help. I also have a mother that is so unhelpful that I can't even talk to her about any aspect of my bc. She would make it about herself. Find the love where you can. I think local breast cancer groups have volunteers that will do things for people- maybe look into that? My kids are 13 and 16, so they are pretty self-managing, and the 16 year old will do things if I ask him to, but isn't naturally empathetic. The 13 year old is a girl who is pretty self centered at this point. But as long as I don't fret about their diets or the amount of screen time they have, they are at least not extra work. I can't imagine having little ones right now, and kudos to those who do and are going through this! My husband 's fever broke today, which is great, but he is still pretty weak and wobbly. And yes, we are a pair-in solidarity during our collective disfigurement L",
      "MessageIndex": 402,
      "PostDate": "03/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 18, 2017 06:45PM Leatherette wrote: At 4 weeks out, with healed incision, I started massaging with BioOil several days ago, and the area looks and feels much better. I had skin sparing (they weren't able to save much, so it's not lots)so have some folds I was getting worried about. Less worried now. I feel like I am totally winging it, as I couldn't find thorough instructions on the internet, but just being gentle. I think I am feeling more sensation, like a good breast sensation feeling that I thought would be gone forever, but it may be wishful thinking......maybe it's just that massage feels good!",
      "MessageIndex": 583,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Feb 9, 2018 09:35PM - edited Feb 9, 2018 09:37PM by Leatherette Do you belong to a homeschooling group? Maybe they could help? You'll have a better idea once you have a treatment plan. It calmed me down to have a plan, and maybe your treatment won't be as punishing as you imagine it might. Until then, meds and PBS may be the way to go.   ",
      "MessageIndex": 13,
      "PostDate": "09/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862350",
      "Title": "Despair and kids Magnolia-mom bluepearl"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 19, 2017 11:00PM Leatherette wrote: Thank you for the well-wishes! We had been hoping to do nipple sparing, but it wasn't feasible. It didn't upset me in the least.I am just glad to have the 7x7x7 cm tumor out! Having a heck of time typing on Percocet, so goodnight",
      "MessageIndex": 184,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 27, 2017 11:55AM Leatherette wrote: Illimae, I'm thinking about you, picturing your thumbs-up emoji in the recovery room after a successful surgery. It sounds like you have the most important things that you need. I will say that my giant insulated cup has been my best friend-since it stays cold, it encourages me to keep drinking and stay hydrated (less constpation, too!). JenRuns, the nails thing bugs me, too. You can cover/replace a breast or hair, but you can't hide your fingers. But it hasn't happened yet, and I thought I'd be much more upset about losing a breast before it happened. Maybe ladies wearing white gloves in public will be back in style soon",
      "MessageIndex": 317,
      "PostDate": "27/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 6, 2017 01:36PM Leatherette wrote: Why does my final punctuation mark get omitted from my posts?",
      "MessageIndex": 430,
      "PostDate": "06/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 6, 2017 01:38PM Leatherette wrote: Except, of course, the one where I am asking about it",
      "MessageIndex": 431,
      "PostDate": "06/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 6, 2017 05:26PM Leatherette wrote: Great that you have clean margins and less node involvement than you thought, Illimae! I am having more pain at the incision site than I did before, not a ton, but can't tolerate some of the clothing I could previously wear. I am 2 and a half weeks out. Is it normal for pain to subside/rise at different stages of healing? I hope it's not because I removed the surgical glue as suggested by my surgeon.",
      "MessageIndex": 436,
      "PostDate": "06/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 6, 2017 10:28PM Leatherette wrote: I started driving 11 days post op, but I am right handed and only my left side had mx. Bmx may take longer",
      "MessageIndex": 449,
      "PostDate": "06/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 2, 2017 10:25AM - edited Aug 2, 2017 10:29AM by Leatherette My husband gave me a buzzcut today. I haven't started losing the hair yet, but I feel better being prepared. It's a half inch long, and I figure I'll just get another shorter buzz when it starts falling. I tried to do a mowhawk first, but I just looked like Rick Astley with short sides and floppety curls on top. So we just went all the way. I have had hair almost this short in the past, by choice, so it doesn't feel too abnormal to me. Saltines by the bed to take with my a.m. zofran has been essential. I am losing weight, but was a little overweight to start. I can't imagine trying to keep weight on with a bmi of 19. Not drinking on my partwill probably cause some additional weight loss.",
      "MessageIndex": 564,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 3, 2017 11:34AM Leatherette wrote: Lojo-great to hear you sounding so happy. I got my amoena breast form today, so that was cool. I also made an appointment to get my wig trimmed (for free). I'm feeling grateful that I have good health insurance, and grateful for the generosity from different organizations during this difficult time. I will definitely pay it all forward. It has made the prospect of possibly losing some pay a little less scary if I can't work this fall",
      "MessageIndex": 572,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 6, 2017 04:28AM - edited Aug 6, 2017 04:30AM by Leatherette More tearing today-I already had Systane, so I'll try that. Also, a vent: my mouth f{replace1}amp;@ing hurts! Big sore inside near my lip making my lip stick out on one side. I have been using biotene and the salt water rinse. It's kinda cruel that as soon as things taste somewhat good again, the mouth sores come. That's cancer for you ",
      "MessageIndex": 587,
      "PostDate": "06/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 10, 2017 02:42PM - edited Aug 10, 2017 02:42PM by Leatherette Jenruns, no worries, it was meant to elicit giggles.😀 My mother in law is a trip! ",
      "MessageIndex": 648,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 12, 2017 11:30PM Leatherette wrote: There's this: But also,this:   As expected, lost a ton of hair in the shower last night, but yesterday afternoon I got a wig that is much better than my previous options were. Paulette- Actually finding that, just as I always thought, my farts don't stink!😉 And my sense of smell is very heightened right now-weird. I lose my train of thought pretty easily now, and some more word-finding issues than usual-may be fatigue",
      "MessageIndex": 659,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 16, 2017 07:21PM - edited Aug 16, 2017 07:21PM by Leatherette Hi all, labs good, getting my herceptin now. I have been using the nail envy and tea tree oil pretty religiously, and my nails look good, but my cuticles are dry. I have to keep trimming them when they stick up so they don't catch on things. I cannot drink enough water or put enough lotion on to combat the hand and foot dryness. I'm thinking of getting some of those socks and gloves that are infused with lotion/aloe to wear at night. The gloves-socks I have for keeping the lotion intact are all falling apart. Have any of you used those? Sorry the cold caps didn't work for some of you-it seemed like it was a lot of work to not get the desired effect. ",
      "MessageIndex": 692,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 16, 2017 11:10PM Leatherette wrote: Thanks for the tips, everyone! Will try. Done with infusion, feel good, just ate a bowl of stir fried green beans from my garden, because I can feel my sense of taste starting to go! Glad your husband is recovering, dodgersgirl! Take advantage of rides from friends/family or free rides offered through the American Cancer Society, if you can",
      "MessageIndex": 698,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 19, 2017 04:40PM Leatherette wrote: Wow-I am doing well right now! I'm finding the side effects less than the first round so far. Things taste dull, but better than last time. My digestion isn't perfect, but better than last time. Walking does seem to help a lot-once I sit down, I start to feel queasy. I'm not taking it for granted, though. Things can change so quickly. But I had a real meal and a half-glass of wine, and I'm not suffering yet....we'll see what tomorrow brings",
      "MessageIndex": 724,
      "PostDate": "19/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 26, 2017 08:35AM Leatherette wrote: Happy to follow that directive once I get out of here",
      "MessageIndex": 788,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 30, 2017 02:07PM Leatherette wrote: I hear you, JenRuns. I am almost there myself. Sucks! ",
      "MessageIndex": 805,
      "PostDate": "30/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 7, 2017 10:45PM - edited Sep 7, 2017 10:51PM by Leatherette I just renewed my driver's license online, and I was asked if I just wanted to continue using the picture that was already on my license. I know JenRuns has to go in to renew, and I don't know about CA, but it may be an option for you, Paulette. Also, third round of chemo today, and it took 5 hours! Then I was out and about and didn't have my dexamethosone with me, so I got that dose late, and started to get itchy all over. I'm sitting here waiting for the steroid to kick in. I'm mad at myself for doing that. I have to get up early for work tomorrow, and hope taking the steroids late won't keep me awake tonight. Arrrgh!  ",
      "MessageIndex": 828,
      "PostDate": "07/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 19, 2017 10:43PM - edited Sep 19, 2017 10:47PM by Leatherette Hi All, I'm fine-it was basically the same thing that happened last round at the same time. I'm neutropenic and there was no infection to be found, so the theory is that the sore throat is just mucositis. So if this happens again, it will hopefully be during the day when I can talk to oncology staff, because the consulting nurses will always send me to urgent care if my temp is 100.5 or higher. I did call oncology today, and they are not worried. We just found out today that my mother in law's liver is failing and she probably has less than a week to live. My poor husband is getting a lot thrown at him right now. And I am closer to my mother in law than I am to my own mother, by a long shot. It's not a surprise, and we started the grieving process a while ago, but it is still hard. Dang it! Thanks for checking in and worrying about me-I need all the support I can get right now. You all rock. And I am so happy to hear that some of us are getting close to done with chemo!  L.  ",
      "MessageIndex": 990,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 21, 2017 03:09PM Leatherette wrote: Thanks for the prayers and good wishes for my mother in law. She has a beautiful private room and is resting comfortably, and is getting a lot of visitors. Not sure how aware she is of us, but we like to think she is feeling our presence. She had a very interesting life. She grew up in Holland during WWII. Her house was occupied by Nazis, and the kids spent lots of time trying to trick and annoy them. Her best friend at that time was Audrey Hepburn, pre-fame. She went on to become an artist, painting beautiful still lifes, portraits and lots of birds, especially chickens. Her house was always artfully decorated, and she loved hosting dinner parties. And she was always great to me (don't think she liked any other of my husband's girlfriends!). And she made it to 88, and lived independently until she was 87",
      "MessageIndex": 1008,
      "PostDate": "21/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 25, 2017 01:44AM Leatherette wrote: Thanks, everyone! We are doing fine. She always did tea and cookies at 4:00, so we had cuppas in her honor",
      "MessageIndex": 1046,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 8, 2017 11:14AM Leatherette wrote: Good timing on that question, Paulette. I was just thinking today about \"coming out\" on FB. I was not a prolific poster anyway, and when I got my dx, I was not ready to let yet more people into my bc experience. I guess I had 'telling everyone and accepting their sympathy' fatigue. Anyway, the opportunity to be in a group with you guys on FB clinches it. I'd love to keep up with everyone. I also feel like this whole experience has taught me to be more open and not hide from everyone as I deal with problems. Jenruns, sorry abt the nerve/joint pain. I hope you are able to get enough rest if it is worse at night. L.  ",
      "MessageIndex": 1210,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 8, 2017 04:00PM Leatherette wrote: I am so frustrated with the level of fatigue I'm having! I went to the kitchen to get something because I'm starving, and I had to go back and lay down before getting anything. WTF? Do others get this tired?  ",
      "MessageIndex": 1211,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 9, 2017 08:14PM Leatherette wrote: Teese, sounds like a great time with your daughter. Christmas shopping! Okay, I'm afraid to know how on top of things you are when not going through chemo! Paulette, my emotions hit bottom yesterday, but they are starting to come up a little, because at least today I was able to get out of bed and make some food. Hope you are on an upswing soon.  ",
      "MessageIndex": 1225,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 15, 2017 07:26PM - edited Oct 15, 2017 07:30PM by Leatherette Travelhound, that is a side effect treatment I can get behind! I'm not a classy lady who has cognac laying around, but a trip to the liquor store is in order. 😉  Sunnyjay, I had a similar FB experience. I should have stuck to my instinct to keep the whole BC thing off FB. I deleted my post. I think posting a picture of my dinner will get more of a response. Go figure",
      "MessageIndex": 1270,
      "PostDate": "15/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 19, 2017 03:52PM Leatherette wrote:  And this amazing young man is seventeen today. My baby! I am emotional today. ",
      "MessageIndex": 1330,
      "PostDate": "19/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 25, 2017 07:26PM - edited Oct 25, 2017 07:31PM by Leatherette Teese, no plan for rads or hormone therapy for me. I need to make it through chemo and eventual reconstruction, and that's all I know about for now. I had to go to two meetings this week, but I don't have to work anymore this week unless I feel good. This is my bad week, and I was probably not a pretty sight in my meetings, but I think they went well. My husband drove me to and from and waited for me, and that was all I could handle!   ",
      "MessageIndex": 1388,
      "PostDate": "25/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 29, 2017 07:52PM Leatherette wrote: Proud, my vision is terrible now, especially near vision. I have to take off my progressive glasses to look at anything close up. I figured part of it is the constant watering I've had, but that can't be all of it. I will probably wait until a few months PFC to have it checked again. I was due for new glasses anyway. Great picture, Sunnyjay! Glad you were able to do that! And the other posts are making me want to cook/eat.......  ",
      "MessageIndex": 1423,
      "PostDate": "29/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 31, 2017 01:45PM Leatherette wrote: Thanks for being fierce for me, ladies! I am pretty sure I won't have to resort to a lawyer to get COBRA. I should know more tomorrow.  ",
      "MessageIndex": 1467,
      "PostDate": "31/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 9, 2017 09:22AM - edited Nov 9, 2017 09:25AM by Leatherette And LoJo, Congrats on your last radiation! I don't know how I missed that. Great news! And Paulette, so glad tomorrow you will be sitting where I am sitting and finishing up! I think I'll take a selfie with my empty carboplatin bag when it's done. There are no ballons or confetti here. Don't know if I'll get teary today....we'll see!    ",
      "MessageIndex": 1586,
      "PostDate": "09/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 9, 2017 09:39AM Leatherette wrote:  Last empty chemo bag, ladies",
      "MessageIndex": 1587,
      "PostDate": "09/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 11, 2017 12:36PM Leatherette wrote: Yay, Paulette! So nice that they had a little celebration there. Nothing happened when I finished up at my place. However, I came home to a big bunch of ballons that my sister had delivered. We have to mark these moments",
      "MessageIndex": 1610,
      "PostDate": "11/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 13, 2017 01:11PM Leatherette wrote: tpralph, I have been trying to photograph my fuzz, and couldn't get it. Mine looks similar to yours, but not quite as long. I keep reminding myself that I could still lose it-don't want to get too attached. I am 4 days PFC. I admire everyone's exercising-once I feel a little better I will do my rowing machine, walks and yoga...at least, that's my plan. I have gotten so weak! I still have a hard time going up my stairs and opening jars!     ",
      "MessageIndex": 1633,
      "PostDate": "13/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Dec 1, 2017 10:14PM Leatherette wrote: Indeed, the fun never ends! I hope the sour candies/lemon help, Runnermum! Here's my fun for today..... I went in for my first herceptin-only infusion today. After my port was accessed, I had a significant squeezing feeling in my chest-right in the middle, under the sternum. And I could breathe, but taking a deep breath made me cough. This went on for 45 minutes, then got progressively better for 15 minutes. My oncologist and the oncology nurses were concerned, and wanted me to not get herceptin and go down to urgent care. Blood tests, EKG and chest x-ray later, no problem, and I felt better. Has this happened to anyone, and/or does anyone have a \"smart guess\" as to what was going on?  ",
      "MessageIndex": 1741,
      "PostDate": "01/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jan 12, 2018 07:20PM - edited Jan 12, 2018 07:24PM by Leatherette So nice to see everyone chatting again! So glad you are done with rads, Teese, and Paulette, almost there. And Runnermum, of course you are pissed off! So hope the PSA elevation turns out to be something non-serious Not much to report, just feeling almost normal and growing hair.....I shaved legs and armpits for the first time today. Now for some 2 months pfc hair porn: ",
      "MessageIndex": 1885,
      "PostDate": "12/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Feb 24, 2018 02:28AM Leatherette wrote: Hi Sunnyjay, Planning to do DIEP flap recon when school gets out-late June here",
      "MessageIndex": 1968,
      "PostDate": "24/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 22, 2017 09:19PM Leatherette wrote: Anxietygirl, so sorry you are in this boat. It is hard to know how to tell the important people in your life. Are you really all alone in the big city? Do you have good friends, or even newish friends that you can tell are good people? Maybe tell some friends first and see how you do. That said, if you feel you need to tell your mom right away because you need her support, there is no one right time or right way to tell her. You have cancer, and you need to focus on what you need to get through this. Best to you, and I hope you get details on your diagnosis soon so you have a better idea of what to expect.  ",
      "MessageIndex": 3,
      "PostDate": "22/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860323",
      "Title": "Just got the news AnxietyGirl85 GreenEyes81"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jun 29, 2017 03:31PM Leatherette wrote: Hello All, Will start chemo in July, hopefully just 4 weeks after my umx on June 19. Met my oncologist today, and really like him! I will have 6 rounds of TCH, 3weeks apart, then continue with Herceptin for a year total. My oncologist is going to try to get Perjeta approved for me, even though my tumors totalled less than 2cm and there is no node involvement. Iam not sure I am going to do hand/foot icing and/or coldcaps, as it sounds like a lot of work. I don't care about losing hair, but the possibility of messed up nails bugs me a little. May just see how it goes after the first round. My worst fear right now is having genetic testing point me towards removal of ovaries/hysterectomy/other breast before I can start chemo. Thanks for reading, L",
      "MessageIndex": 71,
      "PostDate": "29/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 15, 2017 06:28PM Leatherette wrote: Hi all, Thanks, Teese, for encouraging a check in. I've been a little grumpy so I've just been in lurk mode. In terms of prep, I have: gel booties in the freezer, purell, wig, 3 new hats, collected my scarves that could be headwraps together, signed up for a feel better, look better workshop so I can do brows when needed, ordered a set of clippers so I can be shaved and give my husband regular buzzcuts, getting in the habit of drinking lots of water, ordered bamboo wig caps so I don't get itchy, biotene toothpaste and mouthwash,tapered my wine drinking, and am getting together with friends a lot, who are great and inviting my family for dinner My port has been in since last Friday, and the bruising is down. It was kinda scary looking, especially the incision in my neck. The larger incision is healing. It definitely feels weird to have a solid object implanted in me, but it doesn't hurt. I had my echocardiogram, but no results yet. I think I am losing weight, aside from the nearly two pounds my mastectomy took out of me. Food is not that exciting to me right now, and I haven't even started infusions. I need to think hard about making sure I eat enough when the time comes. I had depression/anxiety disorder before this whole cancer thing, and it was in remission, but seems to be coming back. I take ativan, rarely, as needed for panic/trouble sleeping, and I don't think it affects me as well as it seems to be affecting some of you. I don't have a bad effect, but it doesn't seem that powerful to me, but I have not asked for/tried anything stronger because I was afraid of dependency or doctors thinking I was a drug-grubber. Is there a standard dose you take? Thanks, and I will be re-reading everyone's posts so I can be sure I'm not forgetting things. L",
      "MessageIndex": 202,
      "PostDate": "15/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 24, 2017 04:16PM Leatherette wrote: I'm actually feeling calmer now, even though I took more steroids at 5:00. They recommended doing it earlier, but I was afraid to put more into me until I calmed down a little. I do have ativan, and will probably take one tonight. Sorry things are getting bad around day 5 for people. Feel better, everyone",
      "MessageIndex": 384,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 29, 2017 08:11PM Leatherette wrote: Wow, Sunnyjay, can't believe you were at work then a wedding! Sorry your tummy is rumbling, too. I've been on the down-low today, but finally showered and walked around a little outside. I wouldn't call it a walk, though. I've had a peanut butter and jelly sandwich (no crust, light on pb-j) today with no ill-effects. Thanks for the encouragement! It wasn't the best day. Tomorrow will be better",
      "MessageIndex": 483,
      "PostDate": "29/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 31, 2017 12:45PM Leatherette wrote: On wigs: I got a new, free Jon Renau wig from the American Cancer Society, as well as two knit caps. It was actually a great experience. There was an amazing volunteer there who spent an hour with me. You are limited to what's there, so if you really want it to look like your hair, you may be out of luck. The volunteer told me I can always come back, look, and exchange if they get something new that is closer to what I want. I am pretty happy with that wig- it's a lot like my hair, but black instead of brown. It is synthetic. For some reason, all of the Pantene Great lengths human hair wigs were blonde.  I got a second wig at my treatment center, which has an exchange, so you can use a wig, return when done. This wig looks a lot like my hair does when it is long. It was pretty tangled and damaged, but after a couple of hours of work, conditioning, detangling and trimming, it looks really good. If you like close work, it's do-able, and I have a lot of experience detangling tightly curled hair, but it could have been terribly frustrating.  On other things: It took a while for my stomach to settle this a.m., so I could not walk my daughter to school, which was sad. That has been \"our time\" lately. Runnermum, I love your Monopoly game story. I have definitely been going out of my way to find special time with each kid, and it has been really nice. Definitely blessings to count. They are being so great thru this.  I made a smoothie with banana, peaches, blueberries, yogurt and orange juice, and it tasted good, and I think it will stay happy in my stomach. I made zucchini parmesan last night, which also had flavor. Weird but good SE: my skin feels super soft, don't know why. Maybe all the extra water I am drinking",
      "MessageIndex": 524,
      "PostDate": "31/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 2, 2017 09:54PM Leatherette wrote: Good! Ya know, I'm going to have to stop sharing good news here. Soon after I wrote about my mouth being better, it started to hurt and got progressively worse. Back to the vicodin. At least I had some pain and med-free time.....  ",
      "MessageIndex": 41,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858258",
      "Title": "Mouth Sores rdeesides ChemicalWorld"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 31, 2017 02:29PM Leatherette wrote: For those of you who have been through more than one round....does your sense of taste come and go, or is it just gone? I was hoping I might enjoy real food for a little while towards the end of a cycle. I am having a serious pizza craving right now (not that I could handle that)",
      "MessageIndex": 536,
      "PostDate": "31/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 2, 2017 12:50PM - edited Aug 2, 2017 12:51PM by Leatherette Recently hair-free sisters,I recommend finding a video of Sinead O'Connor doing Nothing Compares 2U online. For some reason it made me happy to look at it today. However, Prince sings it much better",
      "MessageIndex": 567,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 5, 2017 04:31AM Leatherette wrote: Hi Dawn, I am having a lot of tearing, too, but I wouldn't say it is constant for me. So it hasn't bothered me that much. I haven't tried to remedy it yet",
      "MessageIndex": 581,
      "PostDate": "05/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 6, 2017 08:09PM - edited Aug 6, 2017 08:10PM by Leatherette While I'm wearing it and thinking about it, I really like this hat. It is comfortable and completely covers the head.   Not the best pic of me, but I'm sitting in fluorescently lit pharmacy. It's from a company called Flipside Lids. They are 35 dollars, but I guess I bought it on a \"treat yo self\" day. They have cuter ones on their website. It is the \"weekender\" style. They had some pink ribbon ones if you are into that. ",
      "MessageIndex": 595,
      "PostDate": "06/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 8, 2017 11:58AM Leatherette wrote: I think Orajel mouth sore gel is helping along with salt water rinses",
      "MessageIndex": 622,
      "PostDate": "08/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 8, 2017 01:15PM Leatherette wrote: Emily, sorry the hair loss hit you hard, but glad you love your wig. I hope you eventually get to have a nice anniversary celebration with your partner! My husband cut my hair to half an inch several days ago, and I got my wig styled today. I wouldn't say I love my wig, but I like it. I have been wearing my cap when I go out, until today. I went to the mall with my buzz, and I didn't care. Then I saw a lady who has lost all her hair going about her business bare-headed. Actually, I am noticing ports and hair free women a lot when I go out now",
      "MessageIndex": 625,
      "PostDate": "08/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 14, 2017 04:36AM Leatherette wrote: emily, during that time around day 5, I was able to eat some zucchini parmesan one night, but it was mainly saltines and ice cream for me. Hummus has been decent tasting. I make it at home because my daughter is allergic to sesame seeds. Chickpeas, olive oil, lemon juice, apple cider vinegar, salt, cumin and garlic. But TCH is a bitch on the mouth/taste buds IMO.",
      "MessageIndex": 667,
      "PostDate": "14/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 18, 2017 09:08AM Leatherette wrote: Paulette, Hope your infusion is going/has gone well. I do take a .5 mg ativan before bed every night-I sometimes did before I was even diagnosed due to anxiety. I can't risk re-triggering mental health issues by not sleeping enough, so I don't have any qualms about the one nightly ativan. L ",
      "MessageIndex": 715,
      "PostDate": "18/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 24, 2017 02:39AM Leatherette wrote: Lojo, glad you got your port and it's healing well. I am very glad I have one, however, after losing weight, it protrudes more and you can see the little triangle outline. Looks more alien, but saves me pain",
      "MessageIndex": 762,
      "PostDate": "24/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 24, 2017 04:49PM Leatherette wrote: Teese, definitely feeling better than I was, but like you are saying, weak/out of breath more this round. Back to school shopping about did me in today! I did get some walking in with it, though",
      "MessageIndex": 777,
      "PostDate": "24/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 26, 2017 07:36AM Leatherette wrote: My WBC is 1.6, and I have no neutrophils. What does that mean? They are calling my onc",
      "MessageIndex": 786,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 26, 2017 11:50AM - edited Aug 26, 2017 11:50AM by Leatherette Apparently there is no fixing-this is supposed to happen at this point in the cycle. Then my WBC count should slowly go up in time for the next infusion. I don't have any kind of infection, so they think it's viral, so no antibiotics. They were glad I came in, and It was good for me to get a better understanding of what is going on in my body. They want me to stay home for a couple of days. My nurse moved here from the UK, and told me that she did not see anywhere near as many people working during chemo as she does in the U.S. Interesting to me. So, took a great shower and discovered that my head stubble is coming out and there was skin peeling off my scalp. I should be smooth as a cue ball soon. Take care, everyone.  ",
      "MessageIndex": 790,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 29, 2017 12:07PM - edited Aug 29, 2017 12:08PM by Leatherette Yes, Paulette! Mine got dry at he tips today, and a couple of them are peeling.  ",
      "MessageIndex": 795,
      "PostDate": "29/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 11, 2017 08:56PM Leatherette wrote: Hi All, I had a weird thing happen to me this morning-I'm on day five from my last TCH infusion. I wasn't expecting it to be a great day, but I was actually okay. I had one brief meeting scheduled with a parent at work, and got up and dressed. I made oatmeal for myself, as it is one of the few things I can eat, and about halfway through, I felt like I was going to fall out of my chair, had ringing in my ears, severe chills, and basically just thought I was going to pass out. I had to sit at the table with my head resting on my arms for about 15 minutes before I felt safe to get up. Then I went to the bathroom, and what came out of me (not urine) was bright yellow (bile?). After resting a little, I was able to get up and do my meeting, and all was well. Have you all had something like this happen to you? Thanks, L.  ",
      "MessageIndex": 860,
      "PostDate": "11/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 19, 2017 05:20AM Leatherette wrote: Remember how I was saying I was cold earlier? Well, it was chills. I checked my temp earlier and it was fine, but now it is 101. So off to Urgent Care I go. Ugh.  ",
      "MessageIndex": 977,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 19, 2017 10:09AM Leatherette wrote: Thanks Teese! She is at a facility one mile from our house, so we see her almost every day",
      "MessageIndex": 993,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 27, 2017 09:41AM - edited Sep 27, 2017 09:42AM by Leatherette Congratulations, dmjmom!  ",
      "MessageIndex": 1102,
      "PostDate": "27/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 1, 2017 01:48PM Leatherette wrote: Right Paulette! I am having a morning where it is really hard to be around my family's energy-nothing bad, actually all good stuff happening, just finding the noise level and expectations (mom 'looks' fine) overwhelming. About to hide in the shower......  ",
      "MessageIndex": 1150,
      "PostDate": "01/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 8, 2017 04:26PM Leatherette wrote: I don't know-the only time they test my blood is pre-chemo, and that was over a week ago. My RBC was low-2.95. Is that super low? Because I'd assume it's even lower now. ",
      "MessageIndex": 1213,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 19, 2017 03:13PM - edited Oct 19, 2017 03:14PM by Leatherette   Leo and Nico. Leo, tan one, is one year old, and Nico is 7 years old. Leo worships Nico. Nico tolerates Leo I think the paleness and circles under the eyes is related to low rbc count/anemia. I haven't gotten any neulasta or infusions like some here do. I guess my numbers haven't triggered it. I'll see what my counts are today when I get my infusion",
      "MessageIndex": 1329,
      "PostDate": "19/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 9, 2017 12:25PM - edited Nov 9, 2017 12:30PM by Leatherette I just got great news! since I had increased neuropathy symptoms, they are eliminating the taxotere this round! So I am not dreading the next ten days as much as I was. Thanks for the encouragement, LoJo! ",
      "MessageIndex": 1580,
      "PostDate": "09/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 18, 2017 07:23PM - edited Nov 18, 2017 07:24PM by Leatherette Sunnyjay, thanks for articulating what I was talking about in more detail. I am also 46, so get that, too. We are young, just doesn't always feel that way now. And I can totally relate to the trying to do something because you feel normal, then getting dizzy and having to cut it short. I love singing, too! Travelhound, I agree that we have been/are still going through a horrifying experience, I just thought I'd be a little happier, not more freaked out, after I had my last chemo. And since I didn't get the taxotere this last round, I actually feel much better physically. I think I have \"being strong\" fatigue. Paulette, I agree we have to look forward-it's just that looking forward is a little scary, too. We will never be the same as we were pre-bc, but we can still be pretty great, right? I also feel like there is some wisdom I am supposed to have, to take better advantage of what I have, live in the moment more, attitude of gratitude, etc., but that hasn't presented itself at all! I'm just impatient. I just spent a week trying to get physically un-constipated, now I am just mentally so. So glad we have each other to work through this with. Even the most awesome well-meaning people can't relate if they haven't been through it. I know I didn't know shit until this happened to me..... Be well, ladies!    ",
      "MessageIndex": 1673,
      "PostDate": "18/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Nov 28, 2017 03:22PM - edited Nov 28, 2017 03:29PM by Leatherette Jenruns-hair looks blonde, definitely. Mine is whitefuzz/dark hairs that never fell out combo. Paulette, I am not doing anything to make my hair grow, but may do supplements. Dmjmom, you have real hair! Can you go out without a head cover now? I feel like this whole experience has been going by really fast, even though it has completely sucked. \"The years are short and the days are long.\" rings true for me. Glad your rads flew by. My old hair grew really fast, was so thick that I had to have it thinned with razors, and I complained about it all the time. I think now I will grow it really long, never thin it, and look like I did in my college/deadhead days! Well, maybe not exactly, but with a lot of wild hair! It's like when Tig Notaro said her breasts wanted to kill her/leave because she always made fun of how small they were. X-posted with Teese-glad it is going by fast for you, too! You have such a good attitude regarding your fair skin/rads. I'm still feeling more depressed than I think I should be. Working right now is still really hard. People, IRL, not here, are annoying the shit out of me. That's not who I am. First herceptin-only infusion on Friday. I get to be one of the people who waltzes in and out in one hour, instead of watching everyone else come and go.      ",
      "MessageIndex": 1708,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Dec 12, 2017 02:30PM Leatherette wrote: Hi all, Work has been crazy the past two days, so haven't been able to check in. Props to everyone doing radiation now. Post-chemo is enough on its own, as far as I'm concerned. I have a lingering cough from my flu, but feel fine. Less fatigued. It doesn't make my leg muscles sore to walk up one flight of stairs. The big C is lingering, and my feet hurt in most places and are numb in the others. Hair looking a little thicker/longer each day. You know who popped into my mind when thinking about my hair? Susan Powter, 90's health guru/media personality........committed to \"stopping the insanity!!!\" Her hair could be measured in mm, and she looked good!  ",
      "MessageIndex": 1806,
      "PostDate": "12/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 25, 2017 05:53AM Leatherette wrote: Thanks Emily, I have been here for 2 hrs and so far just doing prep work. I have a great nurse, am feeling good about things, and your post made me feel even better. I'm glad you are doing so well L",
      "MessageIndex": 391,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 28, 2017 08:40PM Leatherette wrote: Day 4, first day without steroids, is pretty similar to yesterday. Not super low energy, but resting between tasks. I'm obsessing a little over avoiding constipation. Food does not have much flavor, and my mouth and throat are a little tingly. Nausea very bad when I first woke up, but ate some saltines and took an odansetron, and haven't been nauseous the rest of the day. Noticed some red spots on my forehead. Other than that, okay. Walked 24 blocks and drove my daughter to a sleepover. Glad to hear most everyone is doing okay. I groomed one of my wigs today, a free one that needed some love, still looks a little off, but my other one is very good. Now I have two creepy styrofoam heads looking at me",
      "MessageIndex": 468,
      "PostDate": "28/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Jul 29, 2017 01:28PM Leatherette wrote: Matryoshka, so glad your week ended up being so good after the trauma! Sounds like you are pretty tough. Last night was like three a.m. at a frat party for me. Woo hoo! Took turns between sitting on the toilet, throwing up, and curling up in a fetal position on the bathroom floor just to be horizontal. That lasted about 3 hours, then I slept for three more, just getting up now. Waiting for peppermint tea to cool off. I sure hope that was a one time thing. That sucked!",
      "MessageIndex": 477,
      "PostDate": "29/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Aug 12, 2017 04:21PM Leatherette wrote: I was actually shaky on the outside after my first (and only, so far) infusion, but had weird shivery waves of cold run head to toe (no fever) the first several days after. That went away",
      "MessageIndex": 2,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/857905",
      "Title": "Chemo treatment n shakiness Therealsvveetgirl123 Therealsvveetgirl123"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 15, 2017 06:53PM Leatherette wrote: Hi, I am on day 9 of round three of TCH. My first round, I felt great on days 1 and 2, day 3 I was nauseous but fine otherwise. I did not take my antinausea meds that night because i was \"doing so well\" and that was the only time I have thrown up (once). Keep taking your antinausea meds! I got bad acne on day 5 of the first round,but that has not happened again. After day 11 of round one, I had no nausea, and felt fine except for very painful mouth sores (worst side effect IMO), which I had on both rounds one and two. In general, some stomach upset the first few days/loose stools, then trying to ward off constipation the rest of the round, fatigue between days 3 and 12, no sense of taste most of that time, either. I started to lose my hair on day 16 of the first round. The most surprising side effect for me has been eyes that tear constantly, causing dried up tear crust on my face and eyes almost glued shut in the morning. I get a lot of cold waves running through my body, and my hands and feet are often cold, and many days, there is an \"otherworldly \" feeling that isn't quite nausea or dizzyness, but isn't normal, either. I was definitely weaker by the second round. This round, the sense of taste seems to be hanging on more, so I am eating more than I did the first two rounds. I lost about 15 pounds. Starting 8/29, I have been back to work 2days/16 hrs a week. I have been working about 1/3 of the time at home. Alright, enough for now. I hope this helps, but everyone's side effects are different. I feel that I have been doing pretty well compared to what I was expecting. It still sucks, but everything's relative!  ",
      "MessageIndex": 2,
      "PostDate": "15/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858688",
      "Title": "TCH chemo treatments Mstemen Leatherette"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 19, 2017 02:49PM - edited Oct 19, 2017 02:51PM by Leatherette Another hairy lady here-my hair started growing back during my third round. I lost quite a bit, but now I have growing stubble and new fuzzy growth. I still have most of my eyebrows and eyelashes. I am getting my 5th infusion as I type, and know I can still lose all of it, but I at least think the follicles are still alive! I knew I wouldn't follow through on cold capping, so didn't want to set myself up to fail. Some people have great success with it. I was premenopausal, 45, and had thick dark curly hair withmaybe 5% gray.  ",
      "MessageIndex": 22,
      "PostDate": "19/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858813",
      "Title": "Questions for those who completed taxotere treatment. JadeShiva SueRobbo"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Sep 19, 2017 04:55PM Leatherette wrote: mstemen, The first infusion hit me the most acutely, but I felt crappy for longer the second round, third has been better than both of the first two. I got acne the first round, but it didn't come back in subsequent rounds. Sorry to hear you already have mouth sores! They showed up further past infusion for me. Hopefully the rest of this round is all uphill for you.  ",
      "MessageIndex": 7,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858688",
      "Title": "TCH chemo treatments Mstemen Leatherette"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 11, 2017 11:43AM - edited Oct 11, 2017 11:45AM by Leatherette abatract, I don't feel that treatment has affected my depression/anxiety. If anything, having a real problem has pushed the things I used to be upset about to the background. I do get depressed during the times that I can't do anything for days, but I think that is a normal human response, and once I can do things again, it dissipates. Fortunately, my conditions were well-controlled with meds (wellbutrin, concerta)when bc hit.  ",
      "MessageIndex": 6,
      "PostDate": "11/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859246",
      "Title": "Can I choose NOT to take steroids? abatract Leatherette"
    },
    {
      "AuthorID": "Leatherette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253097/profile",
      "Content": "Oct 9, 2017 11:21AM - edited Oct 9, 2017 11:22AM by Leatherette I only take steroids 4 days per three week cycle. I got very bad acne the first round, and asked if I could opt out. Dr. was pretty against that idea, so I stuck it out. I have not gotten the acne again, and the steroids have not made me gain weight. I'm not bipolar, but have anxiety and depression, and if anything, I feel happier on steroids because I can do more. It may trigger mania, but I don't know.    ",
      "MessageIndex": 3,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859246",
      "Title": "Can I choose NOT to take steroids? abatract Leatherette"
    }
  ]
}