{
  "AuthorID": "Lee64",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
  "Posts": [
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "Aug 22, 2012 07:29AM Lee64 wrote: I was fitted for a sleeve before I started rads. The LE therapist told me to wear it when doing repetitive motions with that arm or when lifting more than 10 lbs. Also to wear it one hour before flying and keep it on one hour after landing. I haven't had any problems so far.",
      "MessageIndex": 2,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/792374",
      "Title": "why did you get your first sleeve melmcbee SpecialK"
    },
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "Jun 14, 2011 09:44AM Lee64 wrote: Today I will have #4 of 34. So far it hasn't been too bad. I have to hold my breath at certain times until they tell me to breathe again. I also have a bolus placed over my left chest and it is very cold and gel-like when they fit it on me. My understanding is that this allows the proper dose of radiation to spread along the mastectomy scar rather than penetrate deeply into the chest. Does anyone else have this? The nurse told me to use any lotion until I start to turn pink and then use Aquaphor at night. Oh, I also wear \"goggles\" during treatment. I can see myself on one side, a breathing graph on the bottom, and then the window where I breathe in and bring a yellow bar to a blue box and hold my breath. Does anyone else have this?",
      "MessageIndex": 132,
      "PostDate": "14/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "Jul 12, 2011 08:30AM Lee64 wrote: Does anyone know what determines the number of rad treatments recommended? The numbers seem to be all over the place. I have #23 of 34 today. My RO checks my skin every day now before treatment and also prescribed a salve that helps with the itching. I still have the bolus and am quite red but no blistering or peeling yet. I have not worn a bra since I started rads; I just wear a loose shirt over another top. Do any of you still have your chemo port in? If so, do you know when you can have it removed?",
      "MessageIndex": 441,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "Jul 12, 2011 08:41AM Lee64 wrote: Amen to the above. It seems I did everythiing \"right\" all my life and I still got cancer with absolutely no breast cancer history in my family. I think one could go crazy reading all the labels on shampoo, cosmetics etc., not to mention all the food labels. I think if  anything is an absolute \"no-no\" the doctors would say so.",
      "MessageIndex": 6,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/771501",
      "Title": "I'm fially coming out of the closet as a slouch. weesa faithfulheart"
    },
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "Jun 17, 2011 05:04PM Lee64 wrote: I am glad that it is Friday. This was my first whole week of treatments and I sure found it tiring. My times have been all over the place, from 9 a.m. to 7:30 p.m.   Gma Foley - hope your arm feels better over the weekend. Good luck to momoftwo and Melanie on Monday. Have a great weekend everyone.     ",
      "MessageIndex": 168,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "Jun 2, 2011 09:37AM Lee64 wrote: Hello ladies. I had my simulation on May 3l and my first treatment is June 9. They didn't use the dye for the scan because I am allergic to iodine. During the scan I was instructed to take a deep breath and then hold it until they told me to breathe; I don't think it was a minute, more like l0 sec. I am very apprehensive about this whole radiation thing and have been reading all the posts about it. I will be shaking in my boots on the 9th!",
      "MessageIndex": 27,
      "PostDate": "02/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "Jul 21, 2011 08:45AM Lee64 wrote: Congrats to all who are finished! I have my first boost today and for some reason am really freaked at the thought. They drew on me the other day to set it up and my skin is so red and raw that it felt like the pen was a needle. They put an attachment on the machine and told me that the machine might touch my skin during treatment. I think that's what bothers me. I will have 6 boosts. After 5 months of chemo and now rads, I am ready for a break. Then, of course, I have Tamoxifen and port removal to deal with yet. Yikes!",
      "MessageIndex": 562,
      "PostDate": "21/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "Jul 7, 2011 08:19AM Lee64 wrote: Mammalou - I will have #20 of 34 today and am also very red. I asked the techs about it on Tuesday and they thought I looked like what they would expect but the RO was just outside so they asked if I would like him to take a look. He came in and  trimmed away some of the bolus and said he wanted to check me every day before treatment. Yesterday he considered doing it without the bolus but decided to wait. Don't hesitate to have your RO take a look. Do you see him every week?  Good luck; I will be thinking of you.",
      "MessageIndex": 391,
      "PostDate": "07/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "Jul 13, 2011 12:39PM Lee64 wrote: I also have a bolus for rads. I wonder if it is only used for women who have had a mastectomy since the women I have talked to that had a lumpectomy don't have it. Had an appt. with my surgeon today for a recheck. He is such a great guy; really made me feel good. Very reassuring and positive.",
      "MessageIndex": 456,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "Jul 28, 2011 12:05PM Lee64 wrote: Just finished my 34th and last rad treatment today. For the last week after every treatment I have seen an RO nurse to have my skin bandaged; have to keep dressings on it all the time. I thought for sure the RO would skip some of the boosts or something, but no we kept on going. I am beyond red on the whole left side of my chest from below my collarbone to the bottom of my ribs, including the underarm area. It hurts so bad! Thank God I am done. Now I have to see the RO on a weekly basis until I am healed. I don't think I would tell anyone that this is easier than chemo. I don't see my MO until the end of August and then I will get the dreaded Tamoxifen prescription. I am so unsure of that too. One step at a time.",
      "MessageIndex": 602,
      "PostDate": "28/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "May 18, 2011 05:37PM Lee64 wrote: Thanks so much, Julie, for the information. I was indeed put off by the fact that this product was originally intended for other purposes. As far as cost, they told me that a can costs about $l0 and would probably last for my 34 sessions. I'm hoping to breeze through the radiation; I have to admit that I am really nervous about it and have been trying to prepare by reading the posts in the radiology threads. Thanks again.",
      "MessageIndex": 4,
      "PostDate": "18/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769136",
      "Title": "Cavilon instead of lotions Lee64 Lee64"
    },
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "Lee64 wrote: I met with my RO last week to discuss radiation plans and the only thing they recommend to use is Cavilon No Sting Barrier Film. I think it comes in aerosol form. It is sprayed on the area to be radiated and then  you reapply it twice a week. They don't recommend any other creams or lotions. Has anyone heard of this or used it?  I start radiation around June 9th and have so many questions. Dx 11/5/2010, IDC, 3cm, Stage IIB, 2/6 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769136",
      "Title": "Cavilon instead of lotions Lee64 Lee64"
    },
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "Jul 22, 2011 01:26PM Lee64 wrote: I had a mastectomy with removal of 6 nodes, 2 had cancer. I also had angiolymphatic invasion and extracapsular extension. I did 5 months of chemotherapy and am now completing 34 radiation treatments. I  know other women with large tumors who have had fewer or no node involvement; but also women with smaller tumors and more lymph node involvement. I guess there is no way to know for sure before surgery and the final path report. Good luck to you and your family.",
      "MessageIndex": 2,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772018",
      "Title": "Did you have lymph node involvement? Some questions? Pinkfuzzysocks34 edwards750"
    },
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "Aug 16, 2012 04:54PM Lee64 wrote: I had to have my port \"flushed\" every month after finishing chemo and during rads.  My Onc wanted it removed soon after rads because she said it would avoid the potential for infection. I don't mind my port scar either, but it is a constant reminder that I have BC and nothing can change that. Good luck, Camillia, on whatever you decide to do.",
      "MessageIndex": 10,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792072",
      "Title": "Port or no port??? Camillia lago"
    },
    {
      "AuthorID": "Lee64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127716/profile",
      "Content": "Apr 21, 2011 04:01PM Lee64 wrote: I am scheduled for l2 Taxol treatments; just finished my 7th earlier today. I have slight neuropathy in  the tips of my fingers.  My fingernails are discolored ( yellow/brown) and the onc nurse said I will probably lose my nails. No mention of stopping the treatments. I was also told to take l00 mg. of vitamin B daily.",
      "MessageIndex": 2,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/767930",
      "Title": "3 vs. 4 Taxol Treatments? Ker Huskerkkc"
    }
  ]
}