{
  "AuthorID": "leftduetostupidmods",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223516/profile",
  "Posts": [
    {
      "AuthorID": "leftduetostupidmods",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223516/profile",
      "Content": "leftduetostupidmods wrote: I had total bridges (both on upper maxillary and lower maxillary) done 15 years ago, that means that all my teeth had root canals, and were \"chiseled\" and covered with a total bridge with metallic base and porcelain veneers. It was done in Europe, and I understood this is a procedure that is simply not done here. Anyway. That worked very good for me until I had chemo. A couple years after chemo, suddenly my upper bridge fell off while I was eating and I discovered that I had only 4 teeth left on the upper maxillary - the rest were gone, just the roots remained. Of course to treat that, only dental surgery (that only an academic medical center can perform, not your run-of-the-mill dentist office) to remove the roots and put dentures in. Soon after my lower bridge followed and the same had happened. My oral surgeon said that he had seen that happening, and worse. I know that on the Taxotere side effects, jaw bone necrosis is mentioned as a rare but severe side effect. But couldn't find anything about teeth. Anyone else had this experience? Maybe not as severe as mine, but did chemo affect your teeth in any way? Also, I got apical fibrosis in my lungs from Cytoxan. Cyclophosphamides are known as malignant agents for pulmonary fibrosis. I discovered mine after I started having episodes of wheezing when I was laying down. A pulmonary function test and MRI/CT confirmed it. left this forum this time for good due to how stupid moderators are Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/836754",
      "Title": "Anyone had their teeth/jaw bone affected by Taxotere? leftduetostupidmods leftduetostupidmods"
    },
    {
      "AuthorID": "leftduetostupidmods",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223516/profile",
      "Content": "leftduetostupidmods wrote: To start, I will say that I am frustrated beyond belief on this whole \"war on opiates\" thing. I will explain why. 1. I know, I know, addiction is horrible, hard to break and all that. But when you have legitimate chronic pain patients who have to go through hoops and sometimes cannot get their pain under control because we got to this situation because of druggies, I feel like strangling someone. 2. The deaths by overdose have indeed increased tremendously in the states who have started the \"war on opiates\" but did not legalize marijuana. Why? Because opiate seekers as well as chronic pain patients who found themselves cut cold turkey from being able to obtain opiates legally, turned to the street drugs, heroin, the now famous dangerous fentanyl, etc. In all the states that have legalized marijuana, the number of deaths due to opiate overdose has plummeted. I seems that the prohibition didn't teach anyone a lesson, and, as usual, decisions about peoples health and quality of life are taken by people who have no health issues. This being said, as some of you know, for me, opiates are (or were until now) the only ones who can control the multiple causes of pain that I am struggling with after BC treatment. I can list them for you if you want. 2/3 of my torso being scar tissue that tightens over time making it at one point almost impossible for me to breathe, I have to go get massage therapy, scar tissue is loosened, I can breathe, rinse and repeat. Costochondritis - permanent inflammation of those little tendons that connect the ribs. I can't really take deep breaths because it hurts. Generalized severe rapidly advancing osteoarthritis (thank you, AIs). The worst is my cervical spine, where only the first 2 vertebrae are relatively ok, on the rest, I have spondylolistesis (vertebrae slipped out of alignment) severe narrowing of the foramens, bone spurs, severe constriction and deformity of the spinal cord. Then the same osteoarthritis in my hands, lower spine, hips, torn meniscus, etc. A spot of horrible pain that is located between the edge of the right shoulder blade and the spine - it's like I have a dagger there at all times, that someone from time to time remembers to twist forcefully - that one is from the LD reconstruction, seems that some tendons got nicked and never recovered. \"Fibromyalgia\" - that thing they tell you instead of \"we have no idea what is going on with you so we'll say you have this\". I tried all kinds of Gabapentins and Lyrica and the whole nine yards, there were 7 different meds I don't even remember. If they didn't affect my eyes (blurred vision, even pain, and I have Graves Eye disease, severe myopia and vitreous detachment on one eye) - then they didn't work at all. In one word, opiates are the only thing that make me able to move around. I live in Oklahoma. Probably, if I had kids, my great=great=grand children MIGHT see marijuana legalized. Because our prisons are privately owned. 90% of our inmates are in for drug charges, of which about 80% possession of marijuana. And our politicians corrupt. So too many pockets wouldn't be filled if cannabis were legalized. Ok, rant over. In short - in order for my body to not get used to the dose, 4 days a month I take no pain meds. The pain comes back with a vengeance. It's a small journey to Hell, but I've been able to not have to increase the dosage in over 5 years. A friend one time brought me some Kratom capsules for me to try. They work. True, not as strong as opiates do, and you have to figure out which of the strains works for you, because different people react differently and need different dosages. For now, it has not been made illegal, the DEA last year reversed the decision to try and ban it due to the results of the studies that were made on this plant. To be honest, for my disability income, if I would have to have my pain controlled just with this herb, I would probably have to get on eating Ramen daily, flush the toilet once every other day and walk naked around the house so I wouldn't have to do laundry more than once every 6 weeks. As it is, I CAN afford to get it for those days of the month when I don't take opiates. But, it DOES control the pain. It can have about the same effect on pain as hydrocodone (not as strong as oxycodone though) without the side effects. TBH, if I had the financial means, I would give up on opiates. I am still in the process of trying to find out which of the several dozens of strains of the plant work the best for pain control for me. The effect is a little enhanced if you consume orange juice or turmeric. Also, kratom has been shown to be promising in many aspects: antioxidant, with potential of stoping cancer cell proliferation, https://www.ncbi.nlm.nih.gov/pubmed/25081682 especially breast cancer cells. including triple negative https://www.ncbi.nlm.nih.gov/pubmed/19724995 Has great antibacterial properties, so it's wonderful for someone undergoing chemo or radiation http://citeseerx.ist.psu.edu/viewdoc/download;jsessionid=E44B973C0FF5DD61B3580B60BA8A123D?doi=10.1.1.396.4269&rep=rep1&type=pdf And helps with depression and anxiety. https://www.ncbi.nlm.nih.gov/pubmed/20869223 Anyone else here uses or ever used Kratom? I would love to be able to discuss about the efficiency of various strains on pain that they have experienced as well as dosage. left this forum this time for good due to how stupid moderators are Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/857869",
      "Title": "Anyone else using Kratom for pain? leftduetostupidmods leftduetostupidmods"
    }
  ]
}