{
  "AuthorID": "LeftyWasMyF…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207214/profile",
  "Posts": [{
    "AuthorID": "LeftyWasMyF…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207214/profile",
    "Content": "Nov 4, 2014 11:48PM LeftyWasMyFavorite wrote: I'm 28 and just had a Mx (left) with no reconstruction or skin or nipple salvaging, I don't regret my decision for a moment! As soon as my surgeon explained the recovery time, pain and risk for infection would increase with reconstruction I knew it wasn't that important to me personally and I didn't want it. To be honest I have no desire for reconstruction now but I'd never say never... I had surgery just about 2 weeks ago, my family/ friends/ church family were and are supportive of my decision but seem to worry about my self esteem hitting rock bottom when in truth it's never been better. Cancer has given me a different perspective, I feel more confident in my true self and the superficial than ever before because I'm God's Special Little Snowflake! Post surgery I found my husband's collared button up shirts to be the most comfortable to get off and on plus they offered easy access for drain care. I kept my drain tube grenades in a stretchy bralette around my waist, pouch style (I didn't like feeling their plastic rubbing my skin), it worked in a pinch but if I had it to do all over again I would have bought that camisole from the TLC catalogue that zips up the front/ has breast forms/ pouches for drain tubes. I figured things out along the way but wish I'd been more prepared for what to wear and what to do with drain tubes so I highly recommend researching beforehand if you end up with Mx. But I only had one arm affected and two drain tubes to handle. Wishing you the best :)",
    "MessageIndex": 7,
    "PostDate": "04/11/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/82/topics/825812",
    "Title": "29yo,requested mastectomy and no reconstruction Mommy2Six Mommy2Six"
  }]
}