{
  "AuthorID": "Leighku",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201635/profile",
  "Posts": [
    {
      "AuthorID": "Leighku",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201635/profile",
      "Content": "Nov 9, 2014 06:41AM Leighku wrote: I was in full battle mode and wanted to start chemo as soon as possible. I started 18 days post BM. I wasn't supposed to but the labs all came back quickly and I healed really well so MO said OK. WOULD NOT RECOMMEND!!! Even though my post surgery pain was very manageable...first chemo round of TC was horrible. I had severe shooting rib pains from the tissue expanders. I was in bed for like 10 days. I thought it was just chemo and Neulasta shot side effects but the next 3 rounds of TC had almost no side effects at all. I just hadn't healed yet and the I think the Neulasta shot caused bones in my ribs to feel full effect of expander being stitched into place. I was just impatient and wanted to kill any rogue cells right away. Should have waited about 4 weeks.",
      "MessageIndex": 4,
      "PostDate": "09/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826073",
      "Title": "When can I start chemo After masectomey Cookies Leighku"
    },
    {
      "AuthorID": "Leighku",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201635/profile",
      "Content": "Oct 19, 2015 11:06PM Leighku wrote: I was told the same thing. I had 3 tumors and was so worried that meant my particular cancer knew how to move and grow in other spots. Doctor said they all grew separate of each other and I would be staged based on the size of the largest tumor only. He said statistically the results are the same as if it was only tumor. I was lucky that no cancer was found in 3 nodes taken during mx. He did, however, say he used the fact that I was multicentric/multifocal in determining whether or not I should do chemo. I did and it's been a year and I'd do it again if it would help more! Good luck to you as you navigate this crazy journey. You will feel better as a plan is put in place and you know exactly what you're dealing with.",
      "MessageIndex": 10,
      "PostDate": "19/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/835832",
      "Title": "Newly Diagnosed and Scared!! Kimm992 TikkasMom"
    },
    {
      "AuthorID": "Leighku",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201635/profile",
      "Content": "Leighku wrote: My onc didn't order the Onco test for me as he nknew he would recommend chemo. I would love to know what my score would have been but it is assumed since I had 3 grade 3 tumors with i67% in the 80s and positive LVI that my score would be high. Wondering if TAILORX results talked about the high risk groups recurrence rate? I know this group all had stage 1 o2, node negative disease and 100% of the patients received chemo. Just curious idf the results revealed anything new. Thanks. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/835388",
      "Title": "TailorX results for high Oncotype score? Leighku BarredOwl"
    }
  ]
}