{
  "AuthorID": "LEMOM",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106348/profile",
  "Posts": [{
    "AuthorID": "LEMOM",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106348/profile",
    "Content": "LEMOM wrote: I'm 37 and have not nursed in more than two years. Two weeks ago I had some tenderness in my right breast...I thought I had just grabbed the wrong bra out of the drawer (it was laundry day!).  The tenderness progressed to pain, then swelling (up 2 cup sizes) with a red tender spot. Felt like mastitis...saw my gyn and she put me on Keflex and referred me to a breast specialist. Swelling went down after a day or so, red area increased and a lump/density formed on the lower quadrant of my breast. The lump has fluctuated in size and shape. Over the weekend my nipple started retracting. There was a golf ball size knot under my areola. Saw the breast guy on Monday for a Mammo and Ultrasound. He seemed surprised not to find an abscess. He did aspirate a small amount of fluid less than 1cc it was clear, slightly bloody with a little possible puss. He switched my antibiotics to Levaquin and Clindamycin, said he'd see me in 5 days and if we didn't have dramatic improvement we'd biopsy. Two and a half days later, the generalized swelling has gone down, but the lump hasn't really changed. I have noticed the skin around my areola has darkened and seems thicker with less sensation--side effect of the lidocane from the aspiration or beginings of peau d'orange? I think they are doing well to be keeping an eye on this and I fully expect a biopsy on Friday. Will I be able to drive myself home from a biopsy? Am I right to be concerned? I just have this sinking feeling in my gut mastitis might not be all that is going on... Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "04/08/2010",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/756314",
    "Title": "Mastitis or something more? LEMOM CandDsMom"
  }]
}