{
  "AuthorID": "leneza",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142652/profile",
  "Posts": [
    {
      "AuthorID": "leneza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142652/profile",
      "Content": "Jan 14, 2012 06:56PM leneza wrote: Hi Andrea. I just finished reading your post and feel the same way you do about all of this waiting.  I think I might put myself in a straight jacket or turn into a yo-yo.  I probably have self diagnosed myself with all kinds of ailments.  I was actually ready to go to the emergency room the day after my biopsies for a pain that I had.  My Dr. said that if I dont hear from them by Wed. I should call...Wed seems like forever.  I had 2 biopsies and 1 stereo on Thur...I know that all of this testing changes my life forever!!!  I want to go back to my life...just taking photos and spending time with my two lovely kids!!!",
      "MessageIndex": 127,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "leneza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142652/profile",
      "Content": "Jan 16, 2012 10:46AM leneza wrote: Hi Andrea, The flubug would be GREAT!!!.  What have you been doing to keep busy?  Me...I have sorted pictures to place in photo albums...played with the kiddos...Today is no work!!!!  But tomorrow is my first day back since the biopsy on Thur.  I know people are goin to ask, (out of concern) if everything I ok...I am never absent from work...Some coworkers know why i was out...many others do not.  I work in a school...Although this is not a secret by any means...I am not sure what to the tell them...I wish I had my results today!!! How are you doing? So happy for Barb!!!",
      "MessageIndex": 132,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "leneza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142652/profile",
      "Content": "Jan 17, 2012 05:40AM leneza wrote: Hi Andrea, Thanks for the advice!!!  I dont mind speaking to others...maybe it will help to inform and educate someone else..What island do you live on?  Digital Scrapbooking? I used to scrapbook...I need to get rid of all of my materials sitting in my basement.  Your results are the 20th?  Are they going to call you?  Doc said if I do not hear from them by Wed in the PM to call...so i figure either Wed or Thur.  I made an appointment with my general doctor today.  I need to address all the other aches and pain I get that I have put off.  I feel like asking him for a full body scan...just check eveything.  I think I am going to print the Pathology Report Brochure that is on this site...it had good questions and information that I want to look over before getting my results...Last night I kept waking up thinking this was all a dream...Hopefully I can gain some strength at work today...getting a chance to see my 850 kids at the elementary school I work at!!!   Enjoy your day!!!",
      "MessageIndex": 137,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "leneza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142652/profile",
      "Content": "Jan 18, 2012 07:27PM leneza wrote: Andrea and Friends... Here is the link for the Pathology Report Brochure.  http://www.breastcancer.org/Images/Pathology_Report_Bro_V14_FINAL_tcm8-333315.pdf It is about 23 Pages... My Dr. just called with my results.  Left breast 2 ultrasound biopsies for small solid nodules 1 stereo biopsies for cluster of calcifications...ALL BENIGN!!!!...This has been one emotional rollercoaster ride!!!   I am sending benign vibes and prayers for all my ladies waiting for results!!!!  I meet with the doctor on the 25 to review my results...he mentioned that the results showed the following... A breast duct papilloma is a benign (noncancerous) growth in a breast milk duct. It is the most common cause of spontaneous discharge from the nipple. This discharge may be clear or bloody. A breast duct papilloma also may produce a small lump that you can feel next to or behind the nipple. A breast duct papilloma may not be identified on routine screening mammography. A breast duct papilloma is generally a solitary tumor that is found most often in the milk ducts located near the nipple. Breast duct papillomas are typically found in women between the ages of 35 and 55. A single breast duct papilloma does not raise the risk of developing breast cancer. If you have multiple papillomas, or develop a breast duct papilloma that contains certain cellular changes, you may have an increased breast cancer risk. Treatment is typically surgical removal and examination of the tissue to be certain that breast cancer is not present.  I have learned so much in such a little time during this process!!!!  I will check back Andrea to see how your results turn out!!!   I live in Brooklyn, New York!!!!  HUGS...LENEZA ",
      "MessageIndex": 154,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "leneza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142652/profile",
      "Content": "Jan 11, 2012 06:51PM leneza wrote: hi..sue...tomorrow i have my 4 biopsies on my left breast....I will need a waiting buddy also...I  feel strong enough to get through the procedure...but the next 4 days after will be difficult.  I called the doctor today to find out when the results will come being that Monday is a holiday in New York...I am so nervous and do not want my results given at work or when i am with my kids....i think i will read the results forum.",
      "MessageIndex": 115,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "leneza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142652/profile",
      "Content": "Jan 8, 2012 11:55AM leneza wrote: Hey Christine.. Thanks for your reply...I did enjoy the city yesterday...we walked around 42nd street and enjoyed the sites...Yesterdays activity did help to clear my mind...Thanks for your support.  I hope everyhting works out for you also...Do you have children? ",
      "MessageIndex": 7,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/780637",
      "Title": "4 BIOPSIES - need support!!! leneza leneza"
    },
    {
      "AuthorID": "leneza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142652/profile",
      "Content": "leneza wrote: glad i found this site...ok so i have to have 4 biopsies in my left breast between 8 oclock and 12 oclock.  3 \"regular\" biopsies and 1 stereo biopsy all this Thursday 1/12.  the 3 biopsies are for the 3 small lumps that cannot be felt and the stereo is for the calcifications found around 10 oclock.  Dr. feels that none of the lumps or calcifications are related...I have had regular mammos since age 37.  Never any concerns.  Fast forward 3 years later and now this....no family history...i am just soooo concerned that I have to wait for 4 sets of results...concerned about my 7 year old daughter, 4 year old son, i need to be healthy for them!!!!!.  Family keeps saying think positive...easier said than done...I am trying to stay busy and think positive....the next week and a half until the test and the results...seems like eternity!!!!!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/780637",
      "Title": "4 BIOPSIES - need support!!! leneza leneza"
    },
    {
      "AuthorID": "leneza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142652/profile",
      "Content": "Jan 7, 2012 09:41AM leneza wrote: thanks for responding...i will try to stay positive...just so hard...i am always thinking about my kids...and the what if factor...i havent even taken tests yet...this is sooo much for one person...going to take the kids to the park...such a nice day in nyc today...taking one day at a time...i am thankful for this site...trying not to read too much but also want to educate myself...going to get the kiddos dressed and enjoy this day the best i can!!!!!!  thanks again... will keep you posted.",
      "MessageIndex": 3,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/780637",
      "Title": "4 BIOPSIES - need support!!! leneza leneza"
    },
    {
      "AuthorID": "leneza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142652/profile",
      "Content": "Jan 7, 2012 10:13AM leneza wrote: thanks heather!!! as u c i should b getting the kids ready for the park...but i am back here...my biopsies are thur so i will stay home friday...monday is a holiday...then back to work on tues...just hoping i get results b4 i go back to work...i am probably going to find something to organize over the next few days....but i keep getting headaches and cant take any meds...need to organize allll my pictures hard copies and ones on the hard drive...i am so not tackling my basement...u did that with 4 kids...that would surely give me a sense of accomplishment!!!!...ok...i am going now!!! to the city and park!!!  njoy ur day...",
      "MessageIndex": 5,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/780637",
      "Title": "4 BIOPSIES - need support!!! leneza leneza"
    }
  ]
}