{
  "AuthorID": "Lenny",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66885/profile",
  "Posts": [
    {
      "AuthorID": "Lenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66885/profile",
      "Content": "May 18, 2008 06:56PM Lenny wrote: I have decided to join in on the discussions (I have been reading for a couple of weeks to help get prepared).  This has been much better than the center's education program in terms of pratical use. I just had my first treatment of T/C 4 days ago and am feeling really yucky right now.  Please tell me there will be some good days as well.  I have 6 treatments to go through and then 7 weeks of radiation so it will be a long summer. I have also been reading the T/C list but I wanted to talk with others that are going through this now as well.  God has been preparing me for this for the past several months.  Maybe after this is all over I will feel like telling others.",
      "MessageIndex": 332,
      "PostDate": "18/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Lenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66885/profile",
      "Content": "Jun 2, 2008 02:48PM Lenny wrote: Whew, I have been at the lake this last week (no Internet) and have spent the last hour catching up on your posts.  Otter, thanks so much for your advice on Prolosec.  I was already on Prolosec before all of this so they told me to double it.  I can't imagine how bad the burps would have been without it.  This time it was still bad but tolerable.  Walking helps. I finished 2xt on Wednesday.  The weekend was really bad but am much much better today.  The infections seem to have gone as well.  Today is the hair thing...it was just coming out in handfulls. I got tired of cleaning it up so I went and had my beautician (she works from home) give me the buzz cut.  She then styled my wig to make it look like me.  I plan to wear the turbans at home and the wig at work.  There is a shop in the town I work that carries all the scarves, hats, etc.  I plan to go by there tomorrow during lunch and get some more.  I promised to give the words to a song that has really helped me... Sorry, I don't know the writer. \"Someone said that in this life, some rain is bound to fall.  Each one sheds his share of tears and trouble troubles us all.  But, the hurt won't hurt forever and the tears are bound to dry.  It won't rain always, the clouds will soon be gone. The sun that they have been hiding has been there all alone.  It won't rain forever God's promises are true.  The sun's going shine in His own time and He will see you through.\" Prayer does help. ",
      "MessageIndex": 665,
      "PostDate": "02/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Lenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66885/profile",
      "Content": "May 23, 2008 10:01PM Lenny wrote: Well, I am back.  The weekend was so rough I just stayed on the sofa.  I then have worked full time all week and have come home at night and just sat.  I did not have the energy to pick up the laptop.  but now (day 10 after 1tx) I am almost normal (if there is ever such a concept again).  My main side effects that seem a little different have been possible infections that might have already had that are now exaggerated.  It seems that this chemo may show up some health problems I have had for the last year and was ignoring (intestinal infection from previous mission trip).  I had just thought it was my sensitive stomach.  Chrsitine - I am scheduled for 2tx on Wednesday so we will have te down weekend together.  I know you have had a hard time waiting.  I thought mine was bad since I did surgery in mid March and just not starting chemo. Is this the second time for breast cancer for anyone?  This was my second lumpectomy but 5 years ago I followed the surgeon's advice and did not do radiation.  This time I had to make the decision of chemo or not.  I was in the \"we have no research for your particular case\" so it is your decision.  My surgeon said no chemo, my first onc said, my decision.  My nephew is an onc in another town so I asked him as well.  He also consulted with with an onc at another renowned hospital and they all confirmed chemo was absolutely needed.  So the decision and waiting was really hard.  It is good to be going down the road now.  I had second thoughts this past weekend when it was so bad thinking \"why did I pick the safest route instead of the easiest like I did last time.\"  But, this site has been great in helping me make the decision knowing that I can make it though and in knowing there are others along me. Everyone have a \"as good as possible\" weekend. ",
      "MessageIndex": 445,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    }
  ]
}