{
  "AuthorID": "leoscat",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66252/profile",
  "Posts": [
    {
      "AuthorID": "leoscat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66252/profile",
      "Content": "May 1, 2008 01:27PM leoscat wrote: Thanks guys... the biopy was done yestrday. It was suprisingly pain free...The best I can hope for is that he gets enough cells...  the doc alreay warned that if we get a \"benign\" result, it just means we need to do a different type of biopsy. I am glad they have been up front with me....helps me to prep and gear up for battle so to speak. I can tell by looking at the films that we are probably looking at a I.D.C.     thanks again...",
      "MessageIndex": 4,
      "PostDate": "01/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704741",
      "Title": "diagnosis by mamo and us? leoscat Vinogal"
    },
    {
      "AuthorID": "leoscat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66252/profile",
      "Content": "leoscat wrote: Hi all, newby here. Last week i had a mamo and us for a lump i had found. Before I left the office, the radiologist called me in. He was very straight forward as I requested. He showed me the mamo films and us stills. I asked him what the chance of it being cancerus vs benign. He said he wouldn't give me a zero chance of it being benign, but that he felt 80% chance of it being cancerus. From then on, he referred to the lesion as ca. He said all we needed to do now wa to prove it. I am scheduled for a core bx in 2 days. Has anyone else experienced this on a first visit? Thanks for the time... Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704741",
      "Title": "diagnosis by mamo and us? leoscat Vinogal"
    }
  ]
}