{
  "AuthorID": "lesleycnm",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89823/profile",
  "Posts": [
    {
      "AuthorID": "lesleycnm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89823/profile",
      "Content": "lesleycnm wrote: I had a mastectomy (single) 3 yrs ago and just had the DIEP recon 3 weeks ago. For the past 3 years I had a slicon breastform that I wore in my bra on one side, but now I have a reconstructed breast which is smaller and higher (!) than my natural one. it will be another 4-5 months until I can do stage 2 of the PS to reduce and raise the other breast. As it is only 3 weeks post-op, I am still only wearing \"training-type\" bras, for support, but no pressure. However, I am too large and lopsided to do this for another 4 months (and keep coming up with creative cover up clothing) I'd appreciate any suggestions! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/740871",
      "Title": "bra solutions for diff sized breasts lesleycnm mthomp2020"
    },
    {
      "AuthorID": "lesleycnm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89823/profile",
      "Content": "lesleycnm wrote: I have had a hematoma in the reconstructed breast (DIEP 3 wks ago) which had to be aspirated (in the PS office) a week ago.  I felt immediate relief, but within a few hours, I felt it re-fill. He had said that may happen and that I may have to have it drained again, but there was no risk and it wasn't something that needs immediate attention. I went back again today, a week later and had the same result. I definitely feel pressure and discomfort from the hematoma, however it isn't unbearable or anything. I've read about hematoma needing aspiration after DIEP surgery as a not uncommon thing (not even considered a complication), but I haven't seen anywhere that it needs to be repeatedly aspirated. I wondered if anyone has experienced this and how long until it was resolved/absorbed? Thanks, Lesley Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/740876",
      "Title": "hematoma after DIEP lesleycnm swimangel72"
    }
  ]
}