{
  "AuthorID": "Lesliew1010…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161158/profile",
  "Posts": [
    {
      "AuthorID": "Lesliew1010…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161158/profile",
      "Content": "Nov 4, 2012 04:55AM Lesliew1010 wrote: Hello all. Had my modified radical mastectomy on the 10th. It was just as bad as the partial mastectomy and auxiliary node dissection last year pain wise. But I'm doing fine now. Just got a picc line in to start chemo on Tuesday.The day before my 42nd birthday, yeah! I had done one treatment of TAC las year but the doctor is recommending FEC-D this time. Went to look at foobs and they didn't have a small enough one for me! The advantage with that is that you can barely tell I had a mastectomy if I wear a flattening type of bra. Lol I wish I could have followed up sooner here but it's been a tough run. Good luck for your recoveries. There are a lot of amazingly brave women here. Leslie",
      "MessageIndex": 467,
      "PostDate": "04/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Lesliew1010…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161158/profile",
      "Content": "Oct 7, 2012 01:07PM - edited Oct 7, 2012 01:14PM by Lesliew1010",
      "MessageIndex": 69,
      "PostDate": "07/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Lesliew1010…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161158/profile",
      "Content": "Oct 7, 2012 01:15PM Lesliew1010 wrote: I am supposed to be going in for a mastectomy on October 10. It is a recurrence of cancer I had in January 2011. I had a lumpectomy at the time and one treatment of chemo. Then it came back with a vengeance, the lump is visibley growing. One of my friends who had felt the mass three weeks ago, then felt it again yesterday was shocked at how much bigger it had gotten. Apparently I have no spots anywhere else but they just discovered during the battery of tests an abnormal (cancerous looking) mass on my thyroid. So I probably have thyroid cancer too. Totally unrelated to the first one. BTW I am 41, ten kids, nursed them all. Ate almost just veggies and raw for the last year. I'm scared about this wednesday but I am even more scared that they will cancel the surgery because of somebody else's emergency because of how fast the tumor is growing. Scared it will get into the rest of my body before the surgery can be done. Hope to get to know a few of you!",
      "MessageIndex": 70,
      "PostDate": "07/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    }
  ]
}