{
  "AuthorID": "lessormore",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196949/profile",
  "Posts": [
    {
      "AuthorID": "lessormore",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196949/profile",
      "Content": "Nov 18, 2014 01:32AM lessormore wrote: Glad to be of help, Sunrise97. Every clinic/hospital is different but I can tell you this, based on 10 years of transcribing reports for radiologists and surgeons at a big hospital: You can ask the radiology department to have your MRI read by another radiologist. It is very common. In the hierarchy of physicians, surgeons are the prima donnas who don't like to be questioned while radiologists are more team focused; so to satisfy your surgeon he/she needs a 2nd or 3rd read on the MRI and a good radiologist won't have a problem with that 9 times out of 10. If there is uncertainty your surgeon should then cover his backside and move you to the \"see first thing\" appointment list as they like their success stats high and malpractice suits low. Sorry to generalize about doctors, but that is how it works. The surgeon's mantra to prevent lawsuits is \"if you (the doctor) are rude you will be sued.\" Second question you raised, about size; I agree with the above post that size doesn't necessarily mean bad. The growth rate and atypia type (grade) is important. I'd take a low-grade 8 cm tumor over a 1 cm high-grade tumor every day of the week. Also, my Mom had a 5-cm DCIS (ductal carcinoma in situ) with no lymph node involvement. \"In situ\" means it had stayed contained within the duct. Imagine that -- it grew to 5 cm (2-1/2 inches) but still she was okay with just a lumpectomy and 16 radiation treatments. Third concern, about hematoma; scheduling, scheduling, scheduling. By the time you see the surgeon, get approval from insurance, and then get on the schedule the hematoma will be better. I had 3 vacuum-assisted ultrasound biopsies and then a stereotactic biopsy 3 weeks later without any problems, so I don't know where that magical 1-month wait is coming from. Hope this all helps. I've been there myself and even with my education and background in medicine it's all overwhelming to have to fight for care when all I wanted to do was crawl into a corner and curl up. Keep us posted and please keep asking questions. ",
      "MessageIndex": 4,
      "PostDate": "18/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826323",
      "Title": "Really worried after 2nd opinion Sunrise97 Sunrise97"
    },
    {
      "AuthorID": "lessormore",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196949/profile",
      "Content": "Nov 16, 2014 05:31PM lessormore wrote: Just to add to the wonderful advice and stories above, I had a unilateral mastectomy (no reconstruction) and a 1-night stay. They had a lady volunteer come in to provide me with a cotton camisole with pockets to hold \"fluffs\" or falsies to wear until I could be fitted for a prosthesis. Also, most breast surgeons have you wear some type of surgical bra for 6 weeks -- they put it on you in the OR and it stays on to promote healing by binding your skin tight to the underlying tissues. Mine opened in the front and had hooks and a zipper. If they do sentinel node sampling you will have swelling under your arm for a couple weeks so be sure your PJs are roomy enough -- mine weren't. Agree with pillows for cushioning and sleeping a bit upright. It was hard to stand up when getting out of bed for about 4 days, then it was okay. I never needed strong meds for pain, just Tylenol a couple times, but everyone is different. Someone told me once that people around you feel better about your illness when you let them help, so although I'm a self sufficient type I found something for everyone to do. Even asked my brother overseas to send me funny email clips to cheer me up. You might have a funny looking Christmas tree when you let the kids do it but they will feel so special to have helped Mommy rest.",
      "MessageIndex": 17,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/825812",
      "Title": "29yo,requested mastectomy and no reconstruction Mommy2Six Mommy2Six"
    },
    {
      "AuthorID": "lessormore",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196949/profile",
      "Content": "Nov 17, 2014 02:11AM lessormore wrote: I'm so sorry to hear what you've been dealing with. I'm sort of in the same boat, only I'm still waiting for my MRI this coming Thursday. Meanwhile I've been reading and am happy to share what I've learned. I also have skin thickening, some more prominent lumps, and some small indentations and my first thought was of inflammatory breast cancer. My mammogram and ultrasound didn't show anything but I know they are very limited tools in detecting lobular cancer and inflammatory cancer. My understanding is that inflammatory breast cancer can present itself as sheets of cancerous tissue so they are often quite large in width when found on MRI but very thin. They can be anywhere in the breast but seem to prefer growing near the chest wall or right below the skin, which makes sense because the breast itself is a honeycomb of supportive tissues, ducts and lobules (picture a blanket fitting over the honeycomb or under it). In fact, a skin punch biopsy is a pretty common way to detect inflammatory breast cancer. I'd ditch the first radiologist who thought you should wait 6 months. Did either radiologist say where the non mass lesion was located? I'm not familiar with epocrine metaplasia but I know my mother had papillary metaplasia on a biopsy 3 years before her DCIS (5 cm) was diagnosed in the same spot. Lobular cancer also can spread out but still be contained in the milk gland walls. Since both inflammatory and lobular breast cancer can spread more rapidly than ductal cancer I wouldn't wait even a week to have the second biopsy performed. They often give chemo before surgery for IBC. Survival can be good with prompt treatment but every article stressed that you don't have time to wait for appointments next month and must be very assertive in obtaining care and proactive on your behalf. The squeaky wheel gets the oil. I wish you all the best.",
      "MessageIndex": 1,
      "PostDate": "17/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826323",
      "Title": "Really worried after 2nd opinion Sunrise97 Sunrise97"
    }
  ]
}