{
  "AuthorID": "lestwin",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
  "Posts": [
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 17, 2011 09:28AM lestwin wrote: Hi ladies.  I have been reading this board for the last few weeks knowing I was going to have rads.  I'm slated to start sometime next week and have to have 33.  I think the rad dr. said 25 and then the rest, boosts.  I'm very nervous but I know I need to be positive and you'all seem so friendly and informative.  I am also dealing with ET (leukemia type blood disorder) which has caused two stokes and numerous allergies including paper tape!  I am so worried that my skin will be so itchy.  After 3 melanoma surgeries I have suffered for weeks with an allergic reaction each time and this surgery was no different, I still have the red patches (no itching now) from the end of November from paper tape and steri strips.  My left arm is very sore below the elbow, does anyone know why this happens?  Unfortunately, my right arm is pretty useless (due to a childhood accident) so I rely on my left hand for almost everything.  Any suggestions on what to do about making sure my left arm stays healthy?  I had BC in my left breast, close to the chest wall, almost under my armpit, that's why he took all the nodes but they were clear!!!  I am squeezing a ball in my left hand watching tv as suggested but don't know why.  I seem to ask him so many questions and the last time I saw my onc/ET dr. I took a tape recorder with his permission.  I opted out of chemo but will take the rads and the Arimidex for 5 years.  My onconotype came back at 13% but I'm getting older and my mum died at 41 with coronary thrombosis so I didn't want to risk my heart.  Thursday is my CT scan, then cardiologist and neurologist then I start.  I am going to read this every day, you guys are my lifeline (my twin sister lives in UK and no family here except DH and daughter) and I promise to try and be really positive.",
      "MessageIndex": 509,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 21, 2011 12:47PM lestwin wrote:",
      "MessageIndex": 676,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 24, 2011 12:13PM lestwin wrote: Congrats to all that have now finished rads, I do envy you as I'm sitting here with ink markings waiting for the rad place to call me (I'm sick of no exercise and no showers).  Went to the surgeon again today and he said no breast inflammation (even though it is red) and my arm pain was probably due to the IV.  I reminded him that I did not have the IV in the left arm, but the back of my right hand.  \"It's a mystery then but go and have an ultrasound of your veins done\".  I asked him if the rads would affect my arm (I only have that arm that I can use) and he sort of didn't answer until I pushed it and he admitted it probably would.  Not what I wanted to hear and he said do you want to have cancer or not be able to use your arms. NICE!  Had the ultrasound and the tech. said that the veins looked alright and could not see any sign of LE.  Also went to cardiologist and he gave me the all clear to start arimidex (have had two stokes due to ET) after rads.  He's going to do an echo test once I get my tattoos.  I went to 5 doctors offices today (some to pick up path. reports etc.) but I'm all doctored out!  I hope that is the end of all the problems, but I won't hold my breath.",
      "MessageIndex": 749,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 18, 2011 08:28AM lestwin wrote: suepen:  As you have been there, done that, I have what may seem like a dumb question.  My rad doc. said do not use deodorant, does he mean on both underarms and/or when I start rads?  I have to see the dentist this afternoon and just got out of the shower but my nose is twitching! I like the idea of a swim too, ocean is just up the street but it's sunny and not too warm, I think the ocean temp. is in the high 60'sF.  Living on a small barrier island, I'm surrounded by water but I have my limits.",
      "MessageIndex": 556,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 30, 2011 09:15AM lestwin wrote: My daughter just went to Walmart and found udder cream (not moo goo), is this any good or has anyone used it?  It was so cheap $3.46 for 12ozs.  I am taking it to the Dr. tomorrow and see if I can use it.  I can't find moo goo anywhere.",
      "MessageIndex": 907,
      "PostDate": "30/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 31, 2011 11:39AM lestwin wrote: I was thinking I was doing pretty good considering I go for my first rad today however, I got a letter in the mail saying my health insurance was being cancelled today at midnight.  I freaked out (I have a medicare employee (spouse retiree) insurance.  I just got off the phone after 45 minutes with them and have had to re-enroll all over again.  Apparently, they got a bill from a lab in California for this BC and assumed I had moved (even though I had already confirmed my address of 30+ years).  I live in Florida so why I got a bill from Ca. beats me.  This whole thing left me crying, I didn't need this today!  How can one of the largest insurance companies be SO STUPID!  As we used to say in Britain.BOLLOCKS.",
      "MessageIndex": 943,
      "PostDate": "31/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 4, 2011 11:29AM lestwin wrote: Decided to not call my rad machine Darth Vador after all.  It sounds so negative so have decided on Sunshine for obvious reasons.  Be positive!  My daughter told me when I dropped her off after lunch \"have fun with Sunshine this afternoon\". I will be here in February and March. There is a February 2011 rads forum too.",
      "MessageIndex": 1104,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 6, 2011 08:48AM lestwin wrote: hi ladies:  Had my 5th rad Friday but Saturday I was not feeling good at all.  I was so tired (I am a lot older that most of you guys) and I have a lifelong medication that also makes me tired (one of the side effects) so that may have been why.  I also got a UTI and an upset stomach and felt like s--t yesterday.  Today, I feel so much better.  Can you take anti-biotics while undergoing rads, or is that a dumb question?  I try to do everything right. Been to the DR at an AI and sorry to say got sick for almost the whole 10 days.  Take diarrhea medicine with you just in case and don't drink tap water even to brush your teeth.  Went to Negril Jamaica at an AI and loved it, got slightly sick (meds) but overall it was great. As for the sun, I am a 3 time veteran of melanoma surgery, live practically on the beach, and love to read, have a few beers and relax in a chair and swim.  I stay about 5 to 8 hours, whenever the temps are over 78 degrees so have learned to cover up.  I mean cover up.  I use 70+ sunblock, wear surf shoes, long pants and a long sleeved shirt, hat and sunglasses and sit under a huge umbrella that has an spf rating.  I swim in a tee shirt too!  I will not give up the beach even though my doc said not to go after 10 am.  I can't live my life like that so we learn to adjust and I never get suntanned. It is do-able!",
      "MessageIndex": 1163,
      "PostDate": "06/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 28, 2011 10:14AM lestwin wrote: Went for my x-rays and tats today, had 7 tats at least.  Didn't hurt much at all but, then, I am used to getting needle sticks because of ET.  The rad techs commented on my red breast and I explained that the surgeon said it was not an infection (so what is it?).  I start on Monday, 3:40 p.m. every day, just what I wanted.  I am going to have dinner at lunch time and then tea/lunch/supper, early evening in case I am too tired for anything else, if I am, maybe down the road a bit, I can just fall into bed and sleeeeeep.  I think my DH can get his own sandwich (maybe).  Thankfully, we have both retired (I was laid off but now I think it was for a purpose) so I will try and make this a positive experience and hope the 33 treatments go by fast.  I opted not to have chemo (the surgeon was a little ticked off that I didn't do it) but I feel comfortable with my choice and will just go with the rads and 5 year arimidex.  Hope you guys have a good weekend break off rads.",
      "MessageIndex": 866,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 12, 2011 03:31PM - edited Feb 13, 2011 07:18AM by lestwin raincitygirl:  Where did you get the t-shirt?  Did you make it yourself (writing, not the t-shirt)? Mine would say something like: Started work: March 16, 1959.         LIFE WITH BC SUCKS  Final  fry:      March 16, 2011.        LIFE WITH NO BC STARTS",
      "MessageIndex": 1322,
      "PostDate": "12/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 31, 2011 03:59PM lestwin wrote: I just got back from my first tx and as, you can tell from my previous post, I was pretty enraged and upset with my insurance company.  Bloody idiots!  The rad seemed to be really easy, over in a few minutes then I saw the RO.  He gave me samples of aquafor and told me to only use it on the top of my breast once a night and use the corn starch under my arm and breast before rads each day.  I reiterated how sensitive my skin was and he told me I am only concerned if you start to peel.  I see him every week so as far as I am concerned he better be on top of things if I get an allergic reaction or start having real problems.  He made it sound like a walk in the park but from being on this forum I know differently.  I am keeping my fingers crossed that I will be one of those who sail through (ha ha).  DH took me to our favorite grill and bar so that I could relax, that's why I just got back.  By the way, he asked me \"are cooked through yet\" I could have choked him........twit.",
      "MessageIndex": 953,
      "PostDate": "31/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 2, 2011 08:39AM - edited Feb 2, 2011 08:44AM by lestwin Omaz:  I thought I had LE too but I have been squeezing a small ball in my hand every day and the pain has subsided now.  Sometimes a vein down the middle of the inside of my arm to my wrist appears with knots in it but that too has dissipated.  Had it checked out by a vascular surgeon but they said at the time that it looked ok.  I'm still working the ball, even before my rads started (#3 today). Lyndalynda: As for husbands who seem not to support you, I have a friend who is married to a British guy and he acts really unpleasant when she is sick.  My husband and I are expats (now American) but he seems to be pretty supportive and it does help but hang in there, when all this is over he may be able to relate his fears during your treatment.  We are here to support you:) msjag:  Yes I have used melatonin to sleep but my primary was skeptical only because it was a supplement and I believe not regulated by the FDA.  I would take 1/2 a pill and it would knock me out but left me dehydrated in the morning but during this treatment I use 1/2 a benadryl and it works and leave me feeling uplifted the next day.",
      "MessageIndex": 1001,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 2, 2011 09:06AM lestwin wrote:",
      "MessageIndex": 1005,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 20, 2011 09:21AM lestwin wrote: No, it doesn't seem to be an infection as it is not hot, just red and not painful except the lower part of my arm is when I stretch it out.  I am praying that it is NOT LE.",
      "MessageIndex": 633,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 27, 2011 11:42AM lestwin wrote: Had to go to the cancer care center yesterday as the temporary marks were fading fast.  They redid them and I just got a call to go in tomorrow for xrays and permanent marks.  I am hoping to start Monday on the treatment.  Keeping my fingers crossed.  I'm going to stay on this site too, as we seem to all know each other and help when we can.  Polyanna:  We are all here holding your hand when you have to have treatment, don't give up, you sound young and life is ahead of you.  I know you had child abuse and I am familiar with it, obviously not what you're going through, and I think I know how hard it must be for you but hang in there, you have many hands and hugs from us.",
      "MessageIndex": 846,
      "PostDate": "27/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 9, 2011 07:49AM lestwin wrote: I posted this on the feb 2010 forum too.  Did anyone see the news about removal of nodes for early stage BC?  It was on one of those early morning news shows (I caught it on MSNBC on line).  It left me so furious with my surgeon, maybe that's too strong a word, frustrated maybe. From my take on the article, since July, the study has recommended only removal of 1 or 2 nodes for testing because the treatment for a lumpectomy will take care of any cancerous nodes, especially with the systemic 5 year treatment pill after radiation.  I am upset, because I already have issues (removal of 21 nodes, all clear by the way), and when I told my surgeon 2 weeks ago that I was having issues and would it get worse with radiation, he reluctantly admitted it probably would but then told me that I could die from cancer without radiation.  Duh!  Talk about shutting the barn door after the horse has bolted.  He knew (before surgery) I only have use of that one arm (the other one is pretty restricted (injury)). If anyone reads this who has not yet had a lumpectomy, please discuss this with the doctor before surgery.  I don't mean restrict him if he needs to take more, but make him aware of this study.  You have to be your own advocate. Grrrrrrrrrr! and I was having a good day before reading this.",
      "MessageIndex": 1227,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 19, 2011 08:48AM lestwin wrote:",
      "MessageIndex": 590,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Mar 1, 2011 06:52AM lestwin wrote:",
      "MessageIndex": 1595,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 24, 2011 03:10PM lestwin wrote: I am lucky to be starting this in a week or two..........maybe...........hot in Florida, had to use the air-conditioning in car today!",
      "MessageIndex": 753,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 26, 2011 07:39AM lestwin wrote:",
      "MessageIndex": 810,
      "PostDate": "26/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 29, 2011 11:20AM lestwin wrote: I agree, I would not have an ounce of information if it wasn't for being on this site.  I asked about cream on Friday (I start rads Monday) and I had a look of surprise and was told, wait until you see the dr. and he will give you some samples.  I thought you had to start cream before rads?  Did I also hear from you guys that you should drink a lot of water?  I want to get started but I'm also apprehensive.",
      "MessageIndex": 888,
      "PostDate": "29/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 30, 2011 05:27PM lestwin wrote: I'm not going to use anything until I have checked with the RO.  I am allergic to everything including paper tape!  When I use anything I have never used before, I can end up with 3 weeks of incessant itching and bleeding (only because I have an incurable blood disorder, which 1 in 1 million get) if I am allergic to it's contents.  I start rads tomorrow and my DH asked me why I was so scared of rads and I told him the reason was to my allergic reaction to everything (so it seems).  I would rather pain than the itching and hives, I can put up with all the other crap but itching is my biggest bugaboo!  I know I should be grateful that the cancer was caught really early and so were my 3 melanomas but it irks me that my biggest concern is itching.  I want to get this crap over and done with and get on with my life, I know we all feel that way too.  By the way, thanks to you guys, I have started drinking my water to hydrate myself and we will get thru this!",
      "MessageIndex": 924,
      "PostDate": "30/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 4, 2011 06:53AM lestwin wrote: I love the though of calling the rad machine a name, especially a male name, come to think of it I am going to call it DARTH VADOR!  #5 today (later this afternoon) but first I'm going to take my daughter out for lunch (her b/d is Sunday) so we will celebrate one week of rads is over.",
      "MessageIndex": 1088,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Mar 8, 2011 04:37AM lestwin wrote: I get my husband to vacuum and clean the toilets, not because I'm tired he has always done it.  He likes to wash the kitchen floor too, I don't argue.  I do everything else though.  I only had one bad day and that was Saturday (someone I knew committed suicide, 15 yrs old) and it knocked me on my knees.  I finished all my regular tx yesterday and start boosts today.  Almost not got to finish for a week because my burns are open and bleeding but the doctor okay-ed it. I didn't want to delay for a week I want to get over this crap.",
      "MessageIndex": 1633,
      "PostDate": "08/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 10, 2011 12:05PM lestwin wrote: Go to Walmart and get Udderly SmOOth in a round container $3.46 about 3 or 4\" in dia.  It is practically the same thing and my RO approved it Monday and said \"his ladies\" had good results.  No tried it yet except for a teswt spot on my leg as I am allergic to almost everything (so it seeems).  Have not started itching there yet!",
      "MessageIndex": 1265,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 12, 2011 01:59PM lestwin wrote: suepen:  Yes, enjoying the zap free weekend.  Didn't sleep though and had to take a benadryl after watching my soccer team on TV @ 7:30 am.  (Go MANU)  Slept for 4 hours, now I feel better. Had a really good day yesterday, #10 zap.  Went with my DD and left her doing the puzzle in the wait room, came out, later than usual as there was now a line of us (before I seemed to be the only one around).  Came out of rads and went up to her and said \"OK, I'm cooked\".  The look on her face was priceless!  She saw the funny side of it though.  By the way she is not a child, wouldn't do that to a child, just wanted to lighten the situation as the BC seemed to have been quite a shock to her.",
      "MessageIndex": 1319,
      "PostDate": "12/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 17, 2011 01:52PM lestwin wrote: sue:  No I'm not having physio yet.  They only took 21 but apparently you have 40 under each arm.  The rad dr. did say to squeeze a ball watching tv and mentioned something about it after rads about physical therapy but was not specific.  I'll pin them down on Thursday (cat scan) if I can and also tell them not to underestimate my skin allergy's as it will suck if I am itching for months.  I'm also allergic to hydrocortison creams etc.  Les",
      "MessageIndex": 518,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 20, 2011 08:36AM lestwin wrote: Just got back from the CT similation and it must be a day of problems for us ladies.  It seems I have to see the surgeon a.s.a.p.  The underside of my bc breast is very red and my arm is painful with the vein feeling very hard with knobs in it.  I told the rad doc this 10 days ago and he didn't have much to say except after rads are over with I may need to see a therapist.  I can't wait that long, I only have full use of that arm the other one is pretty useless so I have to use my left one for EVERYTHING.  Can't get an appointment until Monday....he's (surgeon) only there two mornings a week and then I had to push them to let me come then.  I had my marks put on and was told do not shower until the next appt, probably end of next week, hand bath only and do not excersize or anything that may make me sweat!  I hope this is not the start of \"more to come\".   Sorry, had to gripe, hope those of you that are having problems get them resolved pronto.",
      "MessageIndex": 630,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 30, 2011 10:12AM lestwin wrote: Adey:  I saw this website before but it's Austrailia, by the time it go here i would be done with treatment.  Someone mentioned that they got it at Walmart that's why I was asking if it was the same thing, but, it says for cow's udders!",
      "MessageIndex": 909,
      "PostDate": "30/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 31, 2011 07:29AM lestwin wrote: I am happy to say I slept good last night with the help of a benadryl so that I can face my first treatment without feeling like crap.  I also see the RO afterwards and I am taking all my things, soap, udder cream, corn starch to have them approved (or not).  I feel sorry for you guys who are having bad weather, our weather calls for high 70's and tomorrow mid 80's, above normal temps but that's the way I like it, the hotter the better. My udderly smooth cream has Allantoin, Dimethicone, Lanolin Oil, and Propylene Glycol in an Emollient Base and it says it is greaseless and stainless.  Is this what moo goo has?  I hope the RO lets me use it.",
      "MessageIndex": 939,
      "PostDate": "31/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 1, 2011 06:57AM lestwin wrote: Suepen: Thanks for your concern about my arm.  My right arm (which was damaged as a child and pretty much doesn't work but I can use my hand to some degree) is the one that bothers me with my arms behind me but it's bearable.  My left arm I have seemed to have eased pretty well because I have been exercising with a ball and I can now straighten it out without too much pain so maybe it is not LE after all.  I haven't heard from my surgeon whether the vascular surgeon found anything wrong with the veins or not, go figure.",
      "MessageIndex": 959,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 17, 2011 07:57AM lestwin wrote: Suepen:  Went for #13 yesterday, they also took pictures, and I had to see a doctor first.  I am covered in itchy hives.  The RO (not mine) said to take a benadryl (no driving) and get the cream also and cover myself in it.  I did, slept like a log for 11 hours and the itching this morning (so far) is minimal.  My skin has all the lumps (looks like oatmeal) on it (remember I'm allergic to so many things) but not too many blood blisters (from scratching).  Now I'm sticking to the Aquaphor! Great news Mbjmiller:  We are behind you but will be there hopefully in the not too distant future. Beacher:  I hope things get better for you.",
      "MessageIndex": 1456,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Jan 30, 2011 06:00PM - edited Jan 30, 2011 06:01PM by lestwin Suepen:  Co Could you please post the ingredents. ",
      "MessageIndex": 925,
      "PostDate": "30/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 2, 2011 10:59AM lestwin wrote: lyndalynda:  I would definitely like to have the exercises as I am doing everything I can to make this ugly episode in my life as easy as possible.  Reading this forum has been an eye-opener and such a help Your husband sounds just like my twin sister's husband, knows it all (or pretends to) and yells at her all the time.  She was hospitalized 3 or 4 times last year for 4 months with septicemia and was not expected to live and some days (because she had 5 seizures) her speech is garbled and he mimics her!  A--H!",
      "MessageIndex": 1009,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Mar 9, 2011 08:58AM lestwin wrote: Gingerbrew:  Yes, we are on the same schedule, thank goodness it's almost over!  Feeling very low today, I hate the boosts I feel like that machine is right in my face (4 times).  I got scared yesterday for my first boost and dreamt about it all bloody night.  Any one else feel this way?  I think I may ask them to put a towel over my eyes or something today.",
      "MessageIndex": 1641,
      "PostDate": "09/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Mar 9, 2011 01:59PM lestwin wrote:",
      "MessageIndex": 1645,
      "PostDate": "09/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Mar 16, 2011 04:58PM lestwin wrote: I am done!  Last one today 33/0.  Bit of a disaster, they left a message that the machine was down but I was not home, busy buying them all flowers.  Got there and had to go to the hospital instead.  Almost gave up after waiting for 45 minutes and was about to leave and forget the last treatment and a female (waiting for her husband with prostate cancer) convinced me to stay. My doctor said I could go on a cruise the beginning of April so now I am stoked  (sorry British expression meaning excited).  Went out to dinner, and yes, I imbibed, probably toooooo  much,  but I am so happy to be done!  You guys do not know how you helped me sooooo much.  I am so glad I found you.  For the guys who do not know much about me, I have faced so much diversity in my life and you were my rock.  Do what you need to do, it is important, and guess what, YOU CAN DO IT! I am going to post this on all three boards for rads, Jan 2011, Feb 2011 and March 2011 because I participated in all three.",
      "MessageIndex": 1656,
      "PostDate": "16/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 8, 2011 06:43AM lestwin wrote:  I submitted this on the FEBRUARY 2011 board. Eloise:  I think your description was right on (rads).  There are a few minor differences but WOW, I am going to read it to my husband. Had #6 yesterday, so far so good except for the UTI which was the worst I have ever experienced and I've had major bladder surgery, eons ago.  Saw my RO and he answered all my questions this time without too much grinning.  My questions were all the advise I got from you guys and I got a positive response except for the cream and how often to use.  He says only Aquafor and once a day on top of the breast only, weird.  He did give a script for 5 cipro as I was desperate and I took one last night and it feels like night and day.  Got to give him credit for that without a urine test too.  He also suggested referral to an LE specialist if my arm gets worse. His basic confirmation was: drink water/eat protein/avoid anti-oxidants/use cornstarch/aquafor/excersize. Congratulations to all that are now DONE.  We are all behind you in different stages but we WILL be doing the HAPPY DANCE!",
      "MessageIndex": 1204,
      "PostDate": "08/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 13, 2011 03:27PM lestwin wrote: SUEPEN:  I have been using the Udderly SmOOth like crazy this weekend and I remembered to put it under my arm and over my shoulder.  The RO told me only Aquafor, once a day and only on top of the breast!  I did what he said for two weeks but I think we ladies are the judge of what works and what doesn't.  The cream I use smells wonderful too.  Everytime I get up or pass my DH he always says \"where are you going\" and I reply \"lube the boob\".",
      "MessageIndex": 1340,
      "PostDate": "13/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 13, 2011 04:44PM lestwin wrote:",
      "MessageIndex": 1343,
      "PostDate": "13/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 16, 2011 07:29AM lestwin wrote: I should have kept my big mouth shut!  I'M ITCHING and I have a rash in three places!  I used the Udderly SmOOth cream on my leg (test) and everything went well.  This weekend I covered myself in it (cream) and now my knee has a rash, under my rib cage (rads side) and under my neck (rads side).  I was fine on Monday when I saw the RO but yesterday it started.  The rad ladies went to get the RO but he and his nurse were in a meeting and could not leave so I have to wait until today.  Strangely enough, my radiated boob seems to be OK?  I obviously stopped the cream and went back to Aquaphor.  I thought I was doing well too, but I guess being allergic to paper tape besides everything else, I should have known I was in for it.  Unfortunately I'm only on #13 today out of 33.  The big problem is, having ET, when I scratch myself it looks like I've been in a cat fight, big blood filled scratches.  I think I'll have to wear gloves at night.",
      "MessageIndex": 1421,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Mar 9, 2011 02:29PM lestwin wrote: Yes I remember you naming your machine.  I named mine \"sunshine\".  I live in the Sunshine State and I felt like it radiates warmth and it didn't make it so impersonal.  I felt this made it a more positive experience and except for the boosts and the open burns, I have been doing really well.",
      "MessageIndex": 1647,
      "PostDate": "09/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Apr 12, 2011 09:31AM lestwin wrote: duckyb1:  Don't know what your MO was thinking about when she said \"your type of cancer\".  We have BC, radiation is part of the therapy for almost everyone I would imagine.  I'm 68 and my BS, MO and RO never even suggested not having the treatment, it was assumed I would by all three.  I asked why, and they indicated it always followed a lumpectomy and axillary dis. Good luck, ducky, we will be thinking of you and knowing you, you will not allow them to dictate to you so I know you will bombard them with questions and so you should.",
      "MessageIndex": 7309,
      "PostDate": "12/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Mar 8, 2011 07:55AM lestwin wrote: I too, have open bleeding sores, and yesterday was my last regular tx.  The doctor almost cancelled my treatments for a week, I start boosts today, but I wanted to finish with this.  He warned me it would get worse but I am not in pain, just sore.  I can't use many medicines or such, as I am allergic to so much stuff, even paper tape, so I am using an anti-biotic cream my dermatologist perscribed from when I had my last melanoma surgery.  I think I am doing great considering I am also struggling with leukemia (the meds wear me out) but I can do this!",
      "MessageIndex": 366,
      "PostDate": "08/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Mar 16, 2011 07:59PM lestwin wrote: I am done!  Last one today 33/0.  Bit of a disaster, they left a message that the machine was down but I was not home, busy buying them all flowers.  Got there and had to go to the hospital instead.  Almost gave up after waiting for 45 minutes and was about to leave and forget the last treatment and a female (waiting for her husband with prostate cancer) convinced me to stay. My doctor said I could go on a cruise the beginning of April so now I am stoked  (sorry British expression meaning excited).  Went out to dinner, and yes, I imbibed, probably toooooo  much,  but I am so happy to be done!  You guys do not know how you helped me sooooo much.  I am so glad I found you.  For the guys who do not know much about me, I have faced so much diversity in my life and you were my rock.  Do what you need to do, it is important, and guess what, YOU CAN DO IT! I am going to post this on all three boards for rads, Jan 2011, Feb 2011 and March 2011 because I participated in all three.",
      "MessageIndex": 429,
      "PostDate": "16/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 7, 2011 01:25PM lestwin wrote: beacher4209:  Yes, they removed the cancer and 21 nodes as it was so close to the chest wall and very near my armpit.  (that is not being radiated though (nodes clear).  I went for a core biopsy but was not performed due to location of abnormality so had to have wire insertion (piece of cake except for squashing my boob so much).  Before I went for surgery, I had to once again go to surgeon for him to go over the same crap and I believe they knew I couldn't have biopsy.  I had a blowout with the nurse because I questioned why my insurance company had to pay twice for the same info!  She hates me!  She yelled at me again for the 2nd appt. when I questioned having to have a blood test as I was already set up for my 3 monthly ET check.  I hate insurance companies, got cancelled my 1st day of rads (now reinstated, their fault) and the week before my house insurance was cancelled again because of where I live (barrier island).",
      "MessageIndex": 57,
      "PostDate": "07/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Apr 10, 2011 02:30PM lestwin wrote: duckyb1:  I had to reply to your post.  I have been gone for a week on a cruise, a little celebration for finishing rads on March 16th, and just got back and was catching up on the board. I skipped the chemo part as I'm 68 and consider myself a senior now and I had oncotype of 20 with 13% chance of re-recurrence but I already have an incurable very rare blood leukemia (for 6 years) and have had 5 different types of cancer, including 3 malignant melanoma surgeries in the last 9 years.  I thought hard and long about treatment and even DH and I would wake up and talk at 4:00 a.m. and make lists of pros and cons about what treatment I should have.  I went with rads because I felt I had to do something.  I will also be starting Arimidex next week and I too have aches and pains and osteoporosis and am tired alot due to the leukemia meds I take so I am walking in trepidation but I will try it.  As for the radiation, it was very do-able.  I never got any more tired than I already was and the only SE I had was 2nd and 3rd degree bleeding, pus filled burns which did not hurt and were just sore.  I used Silverdean (I think) and it rapidly healed my burns and today, I can hardly tell where the redness was and I am only three weeks post therapy.  I surprised myself how active I was on the ship and snorkeling over the reefs and apart from a very heavy cold I picked up (thank you DH) I had a wonderful week without thinking much about BC. Step back and try not think of rads as torture (I know it's easy to say that) but as a positive step towards a healthier new beginning.  Take one step at a time with as much positive thoughts as possible and if you do decide to go with the rads you may fly through it. I have been very positive about everything and I honestly believe this has helped me a lot.  Good luck duckyb1, we are here for you!",
      "MessageIndex": 7277,
      "PostDate": "10/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Apr 14, 2011 07:48PM lestwin wrote: Grannydukes:  OK You WIN.  I started the aloe vera today ( I have not been using anything for two weeks as everything looked good) but I got good advice on here (Rads forums) and you ladies must be doing something right.  I still feel pretty good, starting Arimidex Saturday so keep your fingers crossed.  I figured if I can handle the leukemia meds, with horrible side effects for some people, I should give it a go (not that I really WANT TO).  If I can quit smoking cold turkey, surely I can handle yet another medication.....we'll see.",
      "MessageIndex": 7356,
      "PostDate": "14/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 9, 2011 02:10PM lestwin wrote: Congratulations to all the sisters who have finished RADS: I just jumped on this forum and I did not know anything about possible lung problems with rads. I already have ET, PCV, LE (possible), with the good arm pretty useless), 2 stokes etc.  Now I have to think about lungs, AHHHHHHHHHHH! My primary doctor is Indian, pretty nice guy and he talks to me, however, he chose my BS who is a gastroenterolgist and Polish, who I am now pissed off at (after the study about taking more than 1 or 2 nodes only) for taking 21 nodes (clear) and left it to my husband to tell me I had BC.  My MO is Vietnamese, who I have been seeing for 6 years (every 3 months), very nice guy but I have a hard job understanding him and he forgot to tell me that my PCV had now turned into ET 4 years previously.  My RO is Indian, smiles alot and tells me rads are a walk in the park,  ha ha!  Are there no American doctors anymore?  I was also a foreigner before citizenship so I don't have a thing about foreign doctors Sorry about all the B------g.  Apart from that, I felt pretty good today.",
      "MessageIndex": 6463,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 14, 2011 09:41AM lestwin wrote:",
      "MessageIndex": 6522,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Mar 25, 2011 02:27PM lestwin wrote: Annette:  Seriously decide whether this is what you want in a job.  I worked for a large engineering company for many years, at one time the only female in my department, and then they hired a temporary contract engineer for a big project we were working on and he got me as his designer.  To cut a long, long, story short, he did everything in his power to belittle me by lying continually to my boss and I did everything right in trying to show him that everything was a lie (I wasn't doing my work, etc).  In the end I became ill, saw a ENT doctor who insisted my illness was due to this toxic AH and told me to tell corp. management he was not to be near me.  That's a laugh, he's and engineer and I'm only a designer and female.  I was sleep walking, nightmares and in the end quit and got a better job with a company and boss (again only female in the department) who said he was honored to have me and my reputation proceeded me, (very hard worker).  The thing is, I didn't need to work but loved my job so much it hurt to think someone would lie like that and get away with it.  By the way, my old boss did admit he had made a terrible mistake and he was now paying for it. The sad thing is, I was also diagnosed with leukemia six months into my new job but I think there was some correlation between what went on and the stress.  In my opinion, it's not worth the hassle, I would rather work in a low paying job and be respected and not have to always wait for in-comings. I have been on this board for some time but I finished last week and glad to say my skin has healed up very well and no fatigue.  Good luck to all of you going through rads, you can do it. Think Annette, do what is right for you.  Good luck.",
      "MessageIndex": 7059,
      "PostDate": "25/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 3, 2011 10:38AM lestwin wrote:",
      "MessageIndex": 21,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 9, 2011 10:48AM lestwin wrote: Did anyone see the news about removal of nodes for early stage BC?  It was on one of those early morning news shows (I caught it on MSNBC on line).  It left me so furious with my surgeon, maybe that's too strong a word, frustrated maybe. From my take on the article, since July, the study has recommended only removal of 1 or 2 nodes for testing because the treatment for a lumpectomy will take care of any cancerous nodes, especially with the systemic 5 year treatment pill after radiation.  I am upset, because I already have issues (removal of 21 nodes, all clear by the way), and when I told my surgeon 2 weeks ago that I was having issues and would it get worse with radiation, he reluctantly admitted it probably would but then told me that I could die from cancer without radiation.  Duh!  Talk about shutting the barn door after the horse has bolted.  He knew (before surgery) I only have use of that one arm (the other one is pretty restricted (injury)). If anyone reads this who has not yet had a lumpectomy, please discuss this with the doctor before surgery.  I don't mean restrict him if he needs to take more, but make him aware of this study.  You have to be your own advocate. Grrrrrrrrrr! and I was having a good day before reading this.",
      "MessageIndex": 92,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 13, 2011 06:15PM lestwin wrote:",
      "MessageIndex": 6508,
      "PostDate": "13/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Apr 11, 2011 08:59AM lestwin wrote: Good for you ducky.  I too, have now taken control and refused to see the RO two weeks after treatment ended and told them no, I will do the 3 month follow ups (I already see the MO every 3 months for the leukemia anyway).  I told DH, it's my life and I make the decisions with discussion of course. When I see my primary doctor I will let him know too how pissed off I am that I allowed him to suggest a surgeon he recommended because \"I can talk to him\".  Yes, but I could not, and too late I find out he is not a breast surgeon (yes, I did call the primary doctors office and question it but was told he's done lots of breast surgeries) stupid me.............. and he took 21 of my clean nodes knowing I only had use of that one arm.  Even my MO was surprised that he did not take just the sentinel node.  I know its hindsight but ladies take your time with decisions and try and learn from others mistakes.  I just finished \"Breast Cancer Husband\" and boy, did it open my eyes! Grannydukes....good advice.  My DH suggested it to me and we did just that.",
      "MessageIndex": 7287,
      "PostDate": "11/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Mar 1, 2011 09:57AM lestwin wrote: Not been adding anything for a while (I read every day though).  I started my fifth week yesterday, today is # 22 out of 33 *(including boosts).  Apart from a 6\"x6\" area of itching from the allergic reaction I had, above the radiation site which is now sore and ugly looking, I have been doing very well.  I am no spring chicken so I am pleasantly surprised, even planning a week or two of vacation after this is all over, if I keep doing so well.  Obviously, I am not holding my breath as I have other medical problems, but, I am positive. Grannydukes, good luck we are all following behind you in getting past this monster!",
      "MessageIndex": 292,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 3, 2011 04:58PM lestwin wrote:",
      "MessageIndex": 23,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 7, 2011 12:20PM lestwin wrote: I'm here . Fighting a UTI, does anyone know if the RO will give anti-bio-tics?  I've held out now for about 5 days trying to do it myself but nooooooooooooo it is persistent.  I see him at about 4:00 today after #6 rad.  I read that rads can give you infection.",
      "MessageIndex": 51,
      "PostDate": "07/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Mar 16, 2011 10:37AM lestwin wrote:",
      "MessageIndex": 20,
      "PostDate": "16/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764687",
      "Title": "Radiation and Emotions sheuber MexicoHeather"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 2, 2011 06:08PM lestwin wrote: Hi ladies:  I'm also on the January rads forum as the 31st was my first day, #3 today that means I am 3/5ths thru the week!  To all the newbies, welcome, sorry it has to be because of BC.  I have about a 20 minute ride to the cancer care center so it's not to bad.  It was 83 degrees here today (east central florida) and beautiful outside so I made myself walk to get some exercise.  Not feeling too much (my breast was red before rads) but just feels different so far.",
      "MessageIndex": 13,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 7, 2011 12:42PM lestwin wrote: I absolutely agree with you.  I had a surgical biopsy and woke up to find out from my DH that I had cancer.  6 days later my RO called and wanted me to come in the following week, I didn't know anything about the cancer (how big, what grade etc. or what treatrment I needed) and I never even been there.  I explained I was 6 days past surgery and was told you need to make an appt.  I put them off until I decided against chemo and then went.  I felt like it was rush, rush, rush.  I didn't even get a chance to pick my RO.",
      "MessageIndex": 54,
      "PostDate": "07/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Mar 6, 2011 10:58AM lestwin wrote: My MO also told me to have chemo.  I had 1.4 cm, 21 nodes removed all clear, onco type 20 with 13% recurrence if I did nothing.  I am in my late 60's already have leukemia (5 years), 3 melanoma's and decided for the 4% that chemo would gain me it was not for me.  I am doing the rads, 33 total and Friday was my 25tx.  Yes, I am burnt pretty bad (bleeding) but yesterday was the only day I felt fatigued (a 15 yr old boy I knew committed suicide and it hit me pretty hard).  I then go onto Arimidex which really scares me, I am so allergic to every thing and I've heard horror stories about these drugs but I am giving it a go, so together with the rads and pill it will bring me down to 9% recurrence. annettek:  You go girl, I went cold turkey too and have never looked back.  You can do it!",
      "MessageIndex": 6729,
      "PostDate": "06/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Mar 13, 2011 03:10PM lestwin wrote: I had tx #30 on Friday and except for last Saturday and today I have not noticed the fatigue.  I did not sleep well either night and that is why I am tired.  It maybe because I also have leukemia and my meds for that make me tired already but, honestly, I have not found the normal tiredness any worse.  I'm also 68 and will be so glad to be over this stage.  I opted out of chemo too for the other medical problems I have but this has been a pretty easy step for me except for the fact that I am itchy in the rad area and have open, bleeding sores with green crap coming out of them.  Sore but not painful.  Three more boosts and I am done!  The boosts are the worse part for me. Enjoy your weekend everyone and hang in there. ",
      "MessageIndex": 405,
      "PostDate": "13/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "lestwin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119304/profile",
      "Content": "Feb 8, 2011 09:41AM lestwin wrote: Eloise:  I think your description was right on (rads).  There are a few minor differences but WOW, I am going to read it to my husband. Had #6 yesterday, so far so good except for the UTI which was the worst I have ever experienced and I've had major bladder surgery, eons ago.  Saw my RO and he answered all my questions this time without too much grinning.  My questions were all the advise I got from you guys and I got a positive response except for the cream and how often to use.  He says only Aquafor and once a day on top of the breast only, weird.  He did give a script for 5 cipro as I was desperate and I took one last night and it feels like night and day.  Got to give him credit for that without a urine test too.  He also suggested referral to an LE specialist if my arm gets worse. His basic confirmation was: drink water/eat protein/avoid anti-oxidants/use cornstarch/aquafor/excersize. Congratulations to all that are now DONE.  We are all behind you in different stages but we WILL be doing the HAPPY DANCE!",
      "MessageIndex": 74,
      "PostDate": "08/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    }
  ]
}