{
  "AuthorID": "lester63",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
  "Posts": [
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "May 27, 2009 02:04PM lester63 wrote: I haven't posted in a while, I think I've been too busy trying to watch my hair grow in.  Anyway, I've been checking in on this discussion so I can see what to expect.  Mine is finally coming in pretty good - I'm 9 weeks out of chemo.  It seems to be the same color I had.  For some strange reason I saved a baggie of my original hair when it was coming out in clumps.  I've been comparing my baggie hair with my new hair and it seems to be the same.  My DH thinks I should lose my wig- he thinks I have enough hair.  I'm not quite with him on that.  My wigs looked really good- this morning a lady I work with thought my short wig was my own hair.  Said she couldn't believe how quickly my hair grown back.  I have a short wig and a long one and just wear the one that fits my mood.  My lashes and brows also got very thin.  They're starting to come in now, but still very short Chelev - I'm sorry  about your sister, that is horrible.  I think some people just can't handle tough situations. My sister is my hairdresser and she has been so helpful - styled my wigs every time I washed them since I didn't think I could.  It made her feel like that was her part in helping me out.  She also told me she wouldn't color my hair with anything but semi-permanent for 6 months. Lainey - you are about 50 miles down the road from me - I live in the big town of Cleburne.",
      "MessageIndex": 2109,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Feb 3, 2009 05:34PM lester63 wrote: Berkley Kim - I can relate to story.  While I would hope most teachers and counselors are compassionate and that would help, I can say from experience some are not. Hate to say that since I am a teacher!   I also have a daughter in high school and this has been so hard on her.  She's a great student, but came home with a failing grade in chemistry because of one zero on a paper.  She left a paper at home the day I got sick with bronchitis instead of having chemo.  Our household was crazy because we had all so anticipated the chemo only to have it canceled.  She called me to bring her paper to her, but I couldn't get it to her before her class started.  When she told her teacher(who is just down the hall from me and knows the situation) she told her she wouldn't take it after class had started and when my DD asked if she could call me to not bring it to her - she said NO!  Not sure what I've done to this lady, but she got a nice little email from me the next day.  The teachers in my dept. thought I was too nice in my email, but it was pretty bitchy for me.  Anyway, if you don't take a paper 5 min. late and that's your policy - fine - but have a little compassion and let her save me the trouble.  She never replied to my email.  I think for the most part my DD is holding up well.  She walks up behind my and acts like she's pulled out a wad of hair and will joke around with me about things, but has also had some really tough moments.  It makes me so sad that she has to worry about this cancer stuff.",
      "MessageIndex": 973,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Jan 15, 2009 05:29PM lester63 wrote: I'm so bummed today - I was supposed to start TC today and I started getting sick on Tuesday.  I have bronchitis and a sinus infection and now I have to wait another week.  I was already so anxious about the whole thing - the waiting was killing me!  I just want to know how this is all going to effect me.  My onco did prescribe something for the anxiety, I may not take it,but its nice to know its there. I've been trying to check in every so often and it sounds like SEs are all over the place.  I pray that all who are having trouble get relief soon. ",
      "MessageIndex": 550,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Jan 23, 2009 09:55PM lester63 wrote: I had my first TC yesterday and so far so good except for diarhea.  Has anyone had trouble with that?  I was so worried about constipation that I went ahead and took Milk of Magnesia to ward that off and ended up with the other problem - very unusual for me.  Also, my mother in law sent me this great book called Cancer Vixen by Marisa Acocella Marchetto.  It is about the author's breast cancer and I could really relate.  Has anyone come across that one?  I don't think I've ever had a cartoon make me laugh and cry.  For all you teachers out there - how's it going in the classroom?  I teach high school and there really seems to be more elementary teachers out there.  I'm only going back for 1/2 days and I think that's going to work out well.  Another teacher who is right down the hall from me just got a diagnoses of ovarian cancer - my heart is breaking for her.  They did a hysterectomy 3 days after her diagnoses and found cancer everywhere.  They are being cautiously optimistic about her prognosis.  This makes me feel really lucky about my situation - I just have some treatments to go through to make sure this doesn't happen again.  She's fighting for her life right now. ",
      "MessageIndex": 721,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Feb 4, 2009 01:46PM - edited Feb 4, 2009 03:52PM by lester63 I try not to say b**** out loud when I pass that teacher's classroom, but I might when no one's around.  DD is going to tutorials and working harder to bring up the 0 - it was on her progress report.  I think things may come around quickly for this teacher - parents are griping to the principal about many things.  She passed out test papers and told the whole class \" and some students made a 7\"  as she put the test on a girls desk.  The girl started crying - I think retirement should come soon!  On a good work note - I had been worried about my paycheck since I'm half day for the next 3 months and our local college offered free dual credit to students for my class.  I will get a paycheck from them that will pretty much make up the difference.  YES!!!!!!! Also our FCCLA group has 2 breast cancer projects since there are 2 of us with the dreaded \"BC\".  I was the 1st recipient of their Pass the Plate project.  Kitchen Aid donates $5.00 every time a meal is given and the plate is registered with Kitchen Aid.  Very cool - they made a wonderful Chicken Francaise. I hope everyone is doing well!  I feel pretty much my normal self right now.  My hair started coming out yesterday though. ",
      "MessageIndex": 1000,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Feb 6, 2009 10:19AM lester63 wrote: My hair is coming out in clumps today and I'm getting my head shaved and wig this afternoon.  The hair was coming out so fast this morning I decided to call in a sub - I guess its still considered a sick day since I'm so sick about losing my hair.  I did think it might be funny though if I told my worst class \"You're making me pull my hair out!!!!\" and I really could have pulled a pretty good clump out for them!  My mother just called me and was going to go with me to my appt. this afternoon along with my sister, brother, and a cousin, but she is on her way to the emergency room.  She had sepsis recently - staph in her blood - and seems to not be able to get over it completely.  I'm thinking the rest of my family should be with her now instead of with me for my little hair thing.  Her condition is pretty serious and the hospital is nearby my appt. so I can be there when I'm finished.  This will definitely take my mind off my hair.",
      "MessageIndex": 1025,
      "PostDate": "06/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Feb 7, 2009 06:41PM lester63 wrote: Well, the headshaving and wig fitting are done.   My sister, cousin, and a friend went with me and we made a party of it - even packed an ice chest full of beer.  I allowed myself one.  They took a picture when my hair started looking like a mohawk.  I got two wigs - one cut short like my current style that I had done on a stupid whim at a hair show and one long that looks more like I usually do. They were supposed to be dyed to my color, but they are both way too light, I'm really disappointed.  My sis is a hairdresser and is going to put more lowlights in tomorrow.  I put a scarf on as soon as I got home and then I cried on DH shoulder for a really long time.  He said all the right things, but it really didn't help much. I really thought I was doing OK with it, but OMG  it just hit really hard.  I don't know that I'll wear the wigs much, scarves seem to feel much better.  I did go see my mom in the hospital when I finished and she thought I looked great.  But, of course she's my mom, what else is she going to say.  She will probably come home Mon.     I friend told me to pull up on my bootstraps really hard and keep pulling - for some reason that seems to help me when I get really down.  My next tx is coming up on Thurs. so I do have some good days to look forward to until then. BevR - great news about your son being home!  He's awesome for his service to our country!",
      "MessageIndex": 1049,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Feb 12, 2009 06:02AM lester63 wrote: Well I posted before I read your next response Berkley Kim!  I'm glad it was not a huge ordeal for you.  I still can't believe insurance co. don't always give notice when the cancel someone insurance. I have to mention my brother, sister and I went to the hospital on Sunday to see my mom.  I'm now wearing scarves to cover my bald head since I'm not crazy about my wigs.  Anyway, I looked at my brother who is now using a cane and has to have a sling for his arm and started laughing.  I said we were quite the pair with our obvious problems.  I guess my sister couldn't be outdone and said \"Well, I'm  fat as a pig, that's a handicap too\"  We were dying laughing walking in the hospital.  She is really overweight right now and its probably from the stress of being the only \" healthy\" one in my family right now.  She's the one in need of all the prayers the rest of us have been getting!",
      "MessageIndex": 1127,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Feb 2, 2009 04:18PM - edited Feb 2, 2009 04:22PM by lester63 Horselover - Sounds like you're in the about the same as me as far as side effects and timeline.  I'm also having the little scaly red things on my face and some on my arms.  I also have a rash on my back.  The skin on my face is all of a sudden so dry I look like I've aged 10 years in a week.  A friend I work with who just finished her treatment for breast cancer as I was starting mine has suggested a product called Lindyskin.  I had already started using the moisturizer and went today after work to get a few more products.  It really feels pretty good on the skin, its really pricey though, but at this point I just don't care.  I think it is so strange that there are 5 women in my dept. at work and 2 of us get breast cancer in the same year.  She has been my lifeline!  Anyone else having nueropathy?  It doesn't seem to be affecting my feet yet, only my hands.    Just as I think I'm on the road to somewhat feeling like myself, something else pops up.  I'm hating this chemo crap right now!",
      "MessageIndex": 946,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Feb 4, 2009 04:02PM lester63 wrote: Renrel - I'm laughing at your painless brazillion.  My DH has always half jokingly asked me to get one of those and I've never had the nerve.  I've told him he was going to get his wish, but I don't think this is exactly what he's always hoped for. I'm feeling good today, but I'm certainly with some of you on the depression. I spent a good part of last Friday morning crying about the weirdest things - some of the posts on here got to me.  I was just so tired and feeling pretty hopeless.  Next time that happens I'm just going to go with it  because it does seem to pass and I do find many things to be thankful for.  ",
      "MessageIndex": 1002,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Dec 31, 2008 09:02PM lester63 wrote: I guess I'll be joining this group as well. I had a lumpectomey 12/19 and will have T/C starting 1/15 followed by radiation.   Seems like a great group to be joining, although like everyone else I would really rather not.  I've looked for wigs the past two days and have found a place that makes custom wigs that will match your hair.  Luckily my insurance pays for the cranial prosthesis - whatever - that always makes me laugh.  Still not sure if I'm going to be able to handle the wig or not.  My hubby already shaves his head and he thinks its going to be cool we have the same haircut - told me to use some of his doo rags and put rhinestones on them! Holtbolt - have fun in Las Vegas!  My hubby and I went the weekend after I was diagnosed(the trip was already planned).  It couldn't have been better timing- took my mind off the whole C thing.  We definately laughed, had plenty of beer and actually didn't lose every penny we took.  I hope your trip is great!",
      "MessageIndex": 151,
      "PostDate": "31/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Jan 3, 2009 11:09PM lester63 wrote: Hi everyone - I'm dropping in again.  I've been reading posts and trying to get ready for when I start chemo - 1/15.  I didn't think I would be upset about the hair loss, but the closer it gets the more freaked out I get.  So many of you are in my thoughts these days as I read about you.  This is a pretty tough bunch - I'm so glad there are others out there ready to kick butt!  One of the things I think I'm most concerned about is going into menopause.  I had a hysterectomy 4 years ago and kept my ovaries.  I had to take Lupron for 6 months in order to keep them because of endometriosis.  That was a miserable 6 months going into chemical menopause, but when I stopped taking it that was over.  From what I understand, after chemo the ovaries are pretty much done if you are closer to menopause - I'm 45.  Can anyone shed any light on that?  Holtbolt - I stayed at New York New York also while in Las Vgas.  We saw \"Zumanity\" mainly because it was at our hotel.  We are still talking about some of the disturbing parts of the show - not the usual Cirque de Soliel.  Can't say we didn't enjoy it and we certainly laughed - it was just really bizarre!",
      "MessageIndex": 244,
      "PostDate": "03/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Jan 15, 2009 09:14PM lester63 wrote: Jas_man - I'm so sorry you are so young and having to go through this.  You seem to have your head in the right place.  Was it Lupron your Dr. was talking about?",
      "MessageIndex": 571,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Jan 22, 2009 04:56PM lester63 wrote: My modem went out on Sunday and I just got another one so I've been trying to catch up. I had my 1st TC today after having to cancel last week. Today was also my birthday - not my idea of a good birthday! The benadryl they put in my premeds completely wiped me out and I slept through the whole thing. At least it took the edge off and I'm so glad to get the first one behind me. Holtbolt - I'm going to have to post a picture of my cat - he is your cat's twin at 20 lbs. He has more brown in him, but loves to sit like that. I wish I was that comfortable with my belly hanging out!",
      "MessageIndex": 693,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Feb 8, 2009 09:10PM lester63 wrote: Sweetpam - I hope you've called you Dr.  I started running a temp. of about 100.5 after my 1st tx and called as late at night. They had me come in the next day - I didn't have to stay in the hospital.  I really think I was still down a little from the bronchitis and sinus infection I had the week before that postponed my 1st tx.  While it really sucks to have to put something off  it would really be worst to go into it with a compromised system.",
      "MessageIndex": 1069,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Jan 29, 2009 03:36PM lester63 wrote: I'm about to go get a Nuepogen shot - one today and one tomorrow.  My wbc was down and then I started running fever.  They're also going to give me some antibiotics.  Does anyone know if the nuepogen causes the same bone pain as nuelasta.  I had no idea I could hurt that bad.  I think I know what its feels like to be 95 years old now - I could barely move.",
      "MessageIndex": 863,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "lester63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76482/profile",
      "Content": "Feb 12, 2009 05:47AM lester63 wrote: Hey everyone - sounds like most everyone is moving along and getting closer to being over all this!  I go for 2nd tx in a few hours - can't sleep because of Decadron so I'm trying to catch up on here.  BerkleyKim - my brother had a stroke 3 months ago and is still on leave from his job.  His insurance has been cancelled twice like that since he's not getting enough in his check to pay for it.  He's been able to get it reinstated both times, but it has been a pain in the ass each time.  He went with me to get my Neulast shot last time and I ended up driving and trying to keep him from throwing his phone out the window everytime he got put on hold.  It was really scaring me how upset he was getting - not good for someone who is trying to get over a stroke.  I 'm wishing you luck getting this cleared up with little stress.  Keep us posted.",
      "MessageIndex": 1126,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    }
  ]
}