{
  "AuthorID": "letranger",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217427/profile",
  "Posts": [
    {
      "AuthorID": "letranger",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217427/profile",
      "Content": "Dec 22, 2015 06:31PM letranger wrote: Yes, I'm all for clinical trials. I am starting my second one soon. I like the frequent follow-ups and my MO and clinical oncs are communicating so I appreciate the input from both to better treat me. Hopeful, I did not know that there were some out of pocket expenses for some clinical trials. I thought they were funded. Well, I learn something new from you ladies everyday! And yes, thanks again to the Herceptin ladies who particiapted in the early trials!!!",
      "MessageIndex": 3,
      "PostDate": "22/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/838839",
      "Title": "No enrollees in clinical trials, no cure anytime soon TectonicShift PreludeSing"
    },
    {
      "AuthorID": "letranger",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217427/profile",
      "Content": "Jan 4, 2016 01:29PM letranger wrote: rosevalley, thank you for sharing a piece of you with us. You are a treasure. Never to be forgotten. Always loved by many.🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹",
      "MessageIndex": 19,
      "PostDate": "04/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "letranger",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217427/profile",
      "Content": "Jul 30, 2015 01:05AM - edited Jul 30, 2015 01:06AM by letranger My case is a little different. I had a bilateral mastectomy, one side was prophylactic. I really wanted to be flat, but let my PS talk me into silicone implants. Well one got infected after 6 months of the exchange so now I only have one implant. I wear a sticky prosthesis, but wish I was flat so I did not have to worry about looking balanced. I have bigger issues than that, but I am self conscious. I am ok with the prosthesis, but don;t wear anything low-cut as one can see it if I bend over. I also wear it swimming. Just have to pick out my clothes more carefully.",
      "MessageIndex": 32,
      "PostDate": "30/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/827945",
      "Title": "How is life with one boob? mtrebtoske316 Bekadawn1"
    },
    {
      "AuthorID": "letranger",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217427/profile",
      "Content": "Jan 18, 2016 04:52PM - edited Jan 18, 2016 04:53PM by letranger thanks for the info, scrunch. Wish I had $50K + to go to Germany and get treated. Wish the vaccine trails in the USA would hurry up and include Stage IV.",
      "MessageIndex": 1,
      "PostDate": "18/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/840396",
      "Title": "My Discussion with a German Clinic for HER2+ Treatment scrunchthecat agness"
    }
  ]
}