{
  "AuthorID": "letterchick…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127887/profile",
  "Posts": [
    {
      "AuthorID": "letterchick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127887/profile",
      "Content": "Apr 18, 2011 03:47AM letterchick wrote: I had bi-lateral mastectomy, estro+, HR2 neg, no lymph involvement. Stage 1 grade 2. Unfortunately , I had 3 tumors. Oncotype results 17, 18, and 24. My onc recommends TCx4 and Tamoxifen. OK with the hormone therapy. I am 39 (-will be 40 in 2 wks, not the way I planned...but manageable). Do not feel risks outweigh benefits w/ intermediate score. I am a vegetarian and very fit. I can't imagine spending the remainder of the year allowing someone to poison me and MAKE me sick. Fear infections and low immunity. Want to see natureopathic onc, but not covered and expensive. Willing to take my chances and boost supplements and maybe increase diet to raw foods. anyone else going that route? Hard decision to make...afraid to regret it someday. LAW OF ATTRACTION: think about the results you want, work hard to attain and it will happen!",
      "MessageIndex": 97,
      "PostDate": "18/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763815",
      "Title": "Anyone with an intermediate oncotype? Lovelillian nem126"
    },
    {
      "AuthorID": "letterchick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127887/profile",
      "Content": "Apr 18, 2011 03:49AM letterchick wrote: by the way, going for 2nd opinion tomorrow. have a feeling it will be same, but maybe she will give me something else to think about...",
      "MessageIndex": 98,
      "PostDate": "18/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763815",
      "Title": "Anyone with an intermediate oncotype? Lovelillian nem126"
    }
  ]
}