{
  "AuthorID": "lexislove",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
  "Posts": [
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 20, 2009 06:16PM lexislove wrote: I have pains too. My onc said the exact same thing. Carol, just be aware if the pain is worsining. If it is, then a trip back to your onc is in order. Does the pain ease up when you move around? Or is it constant / consistant. Im on Tamox and Lupron so my estrogen levels are low, sometimes I feel like I'm 90. I",
      "MessageIndex": 25,
      "PostDate": "20/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/740936",
      "Title": "Still pain, when will it go away... Mamita49 lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 9, 2010 09:12AM lexislove wrote: People are too self absorbed.",
      "MessageIndex": 28,
      "PostDate": "09/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748058",
      "Title": "You know what I hate...rant! everyminute cherneski"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 10, 2010 03:34PM lexislove wrote: The support group thing did NOT go well with me. I went the first time and was like ,\"eh.\" So decided to give it another chance. I was still going through chemo and had so much anxiety. I was a mess to put it lightly. Then a woman twice my age, was just diagnosed with DCIS. She was asking me about my disgnosis ect...then she had the nerve to say that HER breast cancer was not the deadly kind. At the time, I was speechless.....if that was now, she would have gotten a lot worse. Ill never forget her face.",
      "MessageIndex": 56,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748058",
      "Title": "You know what I hate...rant! everyminute cherneski"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 15, 2009 03:17AM lexislove wrote: I have heard of that second peak as well. It is what it is I guess....",
      "MessageIndex": 20,
      "PostDate": "15/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743879",
      "Title": "Such a hard day Pure Moissy"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 14, 2009 04:27PM lexislove wrote: Ya....I was an emotional mess during chemo. For 6 months I cried daily. I must have drove everyone nuts. The chemo + steroids really takes a toll. Thank god it is only temporary. I personally found it helpful to talk with a social worker down at the cancer centre I was being treated at. She dealt strictly with cancer patients. She helped a lot. Maybe see if the hospital or centre your at has a social worker. You have a lot on your plate right now....no need to suffer.",
      "MessageIndex": 11,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743879",
      "Title": "Such a hard day Pure Moissy"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 14, 2009 04:37PM lexislove wrote: You know what is funny? My first session with the shrink/social worker....a light bulb went off in my head. I entered into her office crying and over run with fear. I have never experienced fear in my life like hearing I had cancer. Before BC, I was fearless. She put things into perspective. I left that session....much more relaxed and I felt in control.",
      "MessageIndex": 13,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743879",
      "Title": "Such a hard day Pure Moissy"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 26, 2010 03:12PM - edited Apr 26, 2010 03:13PM by lexislove I appreciate your response Linda ...thank you. I'm eager to be jumping on managing the LE swelling bandwagon, but I just noticed my sleeve (which I just purchased 3 months ago) slips down to my elbow. I, like you, get 2 sleeves/gloves per year. So, in June I will get fitted again....and July I will have my new sleeve. I have not worn my sleeve as I should. To be honest, it has taken some time to get use to. I also finished 2 weeks ago a 6 week course of anti biotics for an infection I developed after my implant swap. I was told NOT to continue with LE massage until the infection has cleared. So....? Here I am now. Wanting to get started on getting my LE under control. I will be starting back on massage soon. Is there a thread or website showing examples of exercises to do to manage LE? Hopefully some pictures! TY.",
      "MessageIndex": 46,
      "PostDate": "26/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751566",
      "Title": "VISIBLE SIGNS OF LYMPHEDEMA - A PICTORIAL LindaLou53 glennie19"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 26, 2010 12:51PM lexislove wrote: This is excellent. Thank you for taking the time to do this! Linda...quick question: Your left arm before and after pics are from 2006 - 2010. did it take 4 yrs to get your LE under control? what were you doing exactly? Massage, bandage, sleeve...and for how long? thanks",
      "MessageIndex": 43,
      "PostDate": "26/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751566",
      "Title": "VISIBLE SIGNS OF LYMPHEDEMA - A PICTORIAL LindaLou53 glennie19"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 23, 2009 01:50PM lexislove wrote: Congrats roxy! Here's to many more!",
      "MessageIndex": 2,
      "PostDate": "23/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/734698",
      "Title": "Yeah roxy42 DCMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 28, 2009 09:04AM lexislove wrote: PIP..congrats on you great scan results! \" PIP..PIP horray!..lol KMac..wow, can't beleive you about to start rads.I remember loging on and reading when you were recently diagnosed. You must be thrilled to have this all behind you soon! Congrats to you too. 39Mom..I was diagnosed at 30 with a 22 month old. It was a rough year with doctors appointments ect, but you will see that amazing people do come in the picture to offer help. Take it! Get better.I'm all done and will be 32 next month. Granted, treatments are not a picic, but are doable. You WILL, get through this and will be back to playgrounds, grocery shopping and mommy duties again. I promise.",
      "MessageIndex": 10,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/734698",
      "Title": "Yeah roxy42 DCMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jun 1, 2009 08:08AM lexislove wrote: I found I was more tired by the end of the week. Ex. Fridays were hard, rested on weekends Monday were better. I did 5 weeks. And remember ...radiation has a cumulative effect. Meaning, after you have finished them ,it is common to feel really fatigued for about a week or so. For me 10 days after rads things were better. Your on the home stretch feel good about that!!!",
      "MessageIndex": 7,
      "PostDate": "01/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/735105",
      "Title": "Getting Rads, feel lousy? robinri robinri"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Aug 8, 2009 07:09PM lexislove wrote: Mamita, I would suggest you write down ALL your questions and fears and ask your onc at the next visit. It's good to get everything answered so you can focus on your healing, physical and mentally. Keep us updated!",
      "MessageIndex": 3,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738571",
      "Title": "Lymph nodes again/mattered nodes Mamita49 lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 14, 2009 07:33PM - edited Jan 14, 2009 07:35PM by lexislove thisisme, I think the 5% stat your surgon gave you was for a LOCAL recurrence. Ex. it returning in the breast. When people talk about \" recurrences\" there is local (confined to the breast), regional (surrounding tissues ie.lymph nodes) and distant ( other organs). Even though having a mastectomy reduces your cance of a LOCAL recurrence greatly, they can not completely remove all breast tissue. I think that they can remove 90-95% of it. So there is still that risk , the 5% given to you that it may come back. The \"healthy breast\" having a prophylatic mastectomy would reduce that 15% chance given to you, but AGAIN they cant remove every little bit of breast tissue. I hope I could make sense, its a very good question that I asked as well. I'm sure others will come along to explaine in better detail.",
      "MessageIndex": 1,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727368",
      "Title": "Risk reduction with proph mastectomy and other stat questions thisisme ailenroc"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 14, 2009 08:06PM - edited Jan 14, 2009 08:29PM by lexislove thisisme, At your surgery they will removesome lymph nodes to determine if there is or was cancer in them.I think I read on here before that in only 15% of the time there is a complete response to chemo, ie. no cancer remaining in the breast or nodes. Even though you had chemo first,the pathologist can tell if cancer had been involved at a given time. I had 28 rads myself and I did bring up to my onc about doing a bilateral. He said, not unless I tested positive for the BRCA gene. I asked what my risk for a \"new\"breast cancer and he said 20-30% LIFETIME risk. I'm 30 by the way. So...the way I look at it is 70-80% I won't get it. I'm also ER+ so I'm taking Tamoxifen to help reduce the risk of a \"new\" breast cancer. I think...IF I was to develop another breast cancer it would be caught a lot sooner than this one and maybe my treatment won't be so invasive as this one that I just went through. It is a very tough decision, but I feel I made the best one. I wrestle with this everyday.",
      "MessageIndex": 3,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727368",
      "Title": "Risk reduction with proph mastectomy and other stat questions thisisme ailenroc"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 2, 2010 09:50AM lexislove wrote: Kerry, Im glad you cleared up the whole ER+ higher chance of recurrence AFTER 5 yrs thing. I also thought this. Woman take their anti hormones for 5 yrs then most....stop. So of course, that would put us at an increase. Well? No. I did ask my onc this, he may not be some high n mighty at some BIG cancer centre, but...hes excellent. Up to date, young and agressive with his treatment options. You should have seen the look on his face!  . He had been impressed at my educating myself about MY situation, but not about the recurence thing after  5yrs. His response, \" Ummm, its actually the opposite.\"....",
      "MessageIndex": 10,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747713",
      "Title": "Are You Sure? paml diana50"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 20, 2009 06:29PM lexislove wrote: To put your mind at ease you can ask for some scans. Sometimes I put on one of those magic bags, the ones you throw in the microwave for heating, and it helps. Have you tried to do something to eleviate the pain?",
      "MessageIndex": 27,
      "PostDate": "20/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/740936",
      "Title": "Still pain, when will it go away... Mamita49 lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 3, 2009 08:22PM - edited Mar 3, 2009 08:27PM by lexislove Karma, If feel that you need a second opinion by all means get one. the truth of the matter is, and I'm sure your aware, your sisters breast cancer is very advanced. She needs to be as aggresive as possible. I was 30 when diagnosed. I had the AC chemo that you are concerned about. I'm fine and my heart was monitored. I'm young and healthy. unless your sister has \"other\" health concerns, she should tolerate it well. The heart issues that your worried about are most likely to happen in older woman, with underlying heart problems or high blood pressure. I know treatment seems long, but the docs perscribe the treatment based on the patients case. Your sister is very lucky to be getting the Herceptin...that is probably the MOST important thing for her! I wish your sister all the best in her journey and please be there to support her all the way.",
      "MessageIndex": 3,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730116",
      "Title": "Too long and aggresive? Need advice Karma76 apple"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 23, 2010 09:50AM lexislove wrote: Oh man.... I haven't slepts since I heard the words, \"its malignant.\" that was Sep 2007!!!! Went through chemo, no sleep (steroids) Finished rads ect, no sleep ( end of treatment anxiety) Started Lupron & Tamox ( menopause) Still...NO SLEEP. Ive tried Zoplicone. It stopped working, and I found I would wake up in a fog. I do take Melatonin 3-9mg a night. I honestly didnt want to take anymore pills for anything. This is what works for me : a routine. I go to bed by 10:30pm the latest. I also try to get out doors aswell. A good walk, fresh air ect. during the day. Funny thing is, Ive talked about this alot on the boards lately..., I stopped my Tamox for 3 weeks while I was having my exchange surgery. Guess what? I was able to sleep...and stay asleep. I noticed it ater about 5 days of stopping the Tamox. I really...really miss my sleep. I use to be able to go to bed by 9:30pm and wake up at 7:00am feeling great. I miss those days. The lack of sleep is defenitly the worse se from treatment/menopause Ive experienced.",
      "MessageIndex": 9,
      "PostDate": "23/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750171",
      "Title": "Sleep! weesa lewisfamily503"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 23, 2010 03:37PM lexislove wrote: lol@ haven't slept since 2007....sad but true.",
      "MessageIndex": 15,
      "PostDate": "23/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750171",
      "Title": "Sleep! weesa lewisfamily503"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 3, 2009 09:22AM lexislove wrote: I was 30 when diagnosed with a 2 year old. My husband helped out so much and my mother, It is difficult, but you will have good days. The chemo is doable, not fun, but doable. My daughter laughed when I lost my hair. We just made a big joke of it. Now I have my extensions and she see the \"old\" mommy..lol I am over a year past chemo and am on my Tamoxifen ect. My life IS back to normalcy. Grocery shopping, parks with my daughter, dinner with friends, cartoons and finger paints! You WILL get your life back after all of this is done. Just keep saying to yourself when your down....\"this is all temporary.\" Come here for support. There is a Young Womans thread on here if you would like to post there. Just click forum index and scroll you will see it. ~ Good Luck with your treatment and take things easy~",
      "MessageIndex": 3,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/731862",
      "Title": "31 and just diagnosed amiekae Jodi_Smart"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 23, 2009 02:16PM lexislove wrote: Pure.. I cant click on the link...would love to read the article",
      "MessageIndex": 1,
      "PostDate": "23/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742659",
      "Title": "Uplifting Article Pure LRM216"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 9, 2009 03:11PM - edited Mar 9, 2009 03:13PM by lexislove hmmmm..  Have you been tested for the gene? It can happen that one  memeber of an immediate family to be \"negative\" while the other is \"positive\". they are also realizing that there maybe other genes involved......they just don't know what they are yet. It's good that you are being preventive to avoid BC or Ovarian cancer, the thing is lots and lots of woman who were the picture of health got BC too. It's a crapshoot as we all here say. I can understand your anxiety, the best thing to do is get screened and tell you doctor about your family history. Some woman go for prophylatic mastectomies or an oopherectomy (ovary removal) to lower their chances. Very tough decision,but worth talking over with a professional. ~~* Good luck *~~",
      "MessageIndex": 1,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/730422",
      "Title": "mom with ovarian, sister with breast cancer, am i doomed? mardissis Eldub"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 9, 2009 03:33PM lexislove wrote: mardiss you are not bothering us at all... We are just explaining to you reality. And yes we do have real issues.....but lots of us have dealt with them and are here to offer support",
      "MessageIndex": 4,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/730422",
      "Title": "mom with ovarian, sister with breast cancer, am i doomed? mardissis Eldub"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 8, 2009 09:07AM - edited Apr 8, 2009 09:08AM by lexislove Barbe....stomp and scream at your docs! Reading your posts makes my eyes bulge out of their sockets. Get the info, and go from there. As for stages..ppffttt... I'm stage 2B, so I look at it as being the best of both worlds..lol. I see things like this, being stage 3 you get max treatment to kick the cance to the curb. I honestly feel that stage 3 woman have BETTER survival rates regardless of lymph nodes , tumor size..blah blah.  Why? Because of all the aggressive treatment. How many times do you see these stage 1 woman who are ooping and ahhing about weather to do chemo...or rads....or hormonal therapy? They rely on some \"test\", what is it called onco type test or something, UGHH..chemo brain again!! To determine their treatment! I'm sorry that doesnt't fly well with me. I don't care about accuracy of this test or whatever...I had max treatment. I was aggressive. I'm very lucky to have an onc that is aggressive too and was obviously looking out for my best interest. Chemo,mastectomy,rads, 1 year of Herceptin, and now Tamoxifen, Lupron and Zometa. I feel confident about my future and all of these stage 3 'ers. I dunno..just my opinion. *sigh* now I have to take my Tamox..lol",
      "MessageIndex": 38,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732075",
      "Title": "Am I stage II or Stage III jeanjean_chang nelia48"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 8, 2009 01:16PM lexislove wrote: KerryMac, When I was doing Taxol I cried every day. I was horrid. I think its the combo of the chemo and steroids. I thought I was going crazy and saw no end. I just wanted to be like I was before all this BC crap. It does end! when you finish with it give it a couple of weeks for it to get out of you. Everyday gets better and better. It has been 14 months since I finished Taxol and I can honestly say I feel like the old me again..sometimes better! I know its hard ..but just keep sayin to yourself...\"this is all temporary.\"",
      "MessageIndex": 42,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732075",
      "Title": "Am I stage II or Stage III jeanjean_chang nelia48"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 27, 2010 02:20PM - edited Jan 27, 2010 02:20PM by lexislove Im sorry your feelings were hurt. Mine were hurt too going through chemo, and it was by a supposive friend...<sigh> Nordy is right...people are idiots and most should think before speaking.",
      "MessageIndex": 13,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747460",
      "Title": "THAT STUNG.................. jenn3 jenn3"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 20, 2009 08:29AM lexislove wrote: EVOO = Extra Virgin Olive Oil I actually dont use the tahini because it is so high in fat....that why I roast the garlic witha little oil. Its a good substitute!",
      "MessageIndex": 4,
      "PostDate": "20/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744218",
      "Title": "Your Best Healthy Recipe Let-It-Be jenn3"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 21, 2009 03:44AM lexislove wrote: gfey, Im sure there are a TON of cook books out there. I just use my common sense really. I have been in the kitchen since I was 10 yrs old.......family businesses, so I can basically cook in my sleep..lol. Frozen fruits and veggies. Are ok. Of course fresh is better, but when stuff like blueberries arnt in season, buy frozen. Avoid canned veggies. Usually packed with a lot of salt, and canned fruit, sugar. Dried fruit is best every now and then. It has a lot of calories because of the sugar. Its best to drie your own fruit if you can than buy it already packaged. Dried fruit is expensive too and if you look at the back of the packages...ewwwww, not so good. Supplemnts, I take: Multi Vitamin, co enzyme Q10,Vitmain D3,Calcium. The basics..oh ya and Omega3",
      "MessageIndex": 10,
      "PostDate": "21/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744218",
      "Title": "Your Best Healthy Recipe Let-It-Be jenn3"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 20, 2009 08:06AM - edited Nov 20, 2009 08:09AM by lexislove Roasted Garlic Hummus 1 can of Chick Peas, drained ( ya..ya they containe phytoestrogens...moderation is key) 1 garlic bulb roasted (more if you love garlic, like me!) 1/2 cup good EVOO 1 Large lemon Sea salt, paprika to taste. Parsley to garnish. Blend chick peas,olive oil,and roasted garlic together in food processor. Add salt, lemon juice and paprika to your liking...mix again... transfer to tuppaware container (will keep for days in the fridge!) parsley as garnish. Serve with baked whole wheat pita bread or uncooked veggies.",
      "MessageIndex": 2,
      "PostDate": "20/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744218",
      "Title": "Your Best Healthy Recipe Let-It-Be jenn3"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 21, 2009 07:48AM lexislove wrote: gfrey, Its just practise.Allow yourself in the kitchen and play around...make it fun, not a daunting task. apple, I made Tabouli today!!!!  thats weird.......I use cous cous but havent added mint before..think ill try that next time.BTW, I love Middle Eastern cuisine, my fave!!",
      "MessageIndex": 13,
      "PostDate": "21/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744218",
      "Title": "Your Best Healthy Recipe Let-It-Be jenn3"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 23, 2009 05:23AM lexislove wrote: Mary!! I did the brown rice and black bean thing today....SOOOOOOO GOOD! Its my new favorite dish. I made enough to keep in the fridge for a few days, added a little leftover onion and green pepper...voila.",
      "MessageIndex": 25,
      "PostDate": "23/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744218",
      "Title": "Your Best Healthy Recipe Let-It-Be jenn3"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 27, 2010 06:45AM lexislove wrote: Thanks for the pics! Your family is beautiful. Hope you are doing well.",
      "MessageIndex": 49,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747382",
      "Title": "Pics of Baby Kilian Pure Meece"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 13, 2009 04:11PM lexislove wrote: Hi phoenix, I too did neoadjuvant chemo and had DCIS remaining. I think I have read on the boards that chemo does NOT kill the DCIS. DCIS is contained in the breast ducts, non invasive. Most tumors are made up of IDC and DCIS, so this is normal.Now...onwards to rads..keep movin forward! Celebrate that you had a great response! Sorry I couldnt answer your questions more.",
      "MessageIndex": 1,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 13, 2009 06:40PM lexislove wrote: I do feel the Herceptin has benefited me. . Unfortunatly, Herceptin doesnt work for everyone. Most of us...yes. But how do I know if I will fall in the good outcome group? Only time I guess. Noone can tell us that the Herceptin really worked.",
      "MessageIndex": 13,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 13, 2009 06:45PM - edited Nov 13, 2009 06:47PM by lexislove Im on the Lupron and Tamoxifen because I'm ER+. To lower my estrogen levels. Im on Zometa, because studies have proven that Zometa prevents bone mets in pre menopausal woman who are ER+. My onc is aggressive. There are a lot of woman on here taking Zometa for the same reason.",
      "MessageIndex": 17,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 13, 2009 06:50PM - edited Nov 13, 2009 06:51PM by lexislove Im having my surgery in January. Then finished! It has been 21 months since I have had my tissue expander in. My onc wanted to wait 2 yrs before I had the final implant placed...just in case I had a breast recurrence. Be well. If you have anymore questions, PM me. BTW, Im in Canada too....B.C.",
      "MessageIndex": 20,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 16, 2009 09:58PM lexislove wrote: Hi again! The DCIS was most likely there from day one. Chemo does NOT kill it. So it just sat there while your chemo was killing the invasive stuff. Don't worry....it didnt grow while on chemo.",
      "MessageIndex": 35,
      "PostDate": "16/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 13, 2009 06:37PM lexislove wrote: Ya, mine was 8cm. It grew rally fast. I noticed a lump the size of an almond in January 2007...by August , 8cm. Being Her2 scares me...I wanted to throw everything at it. We are very close in path reports, just different onc opinions.",
      "MessageIndex": 10,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 13, 2009 06:44PM lexislove wrote: Yes Herceptin has been a \"wonder drug\" for us Her2 girls. Im very lucky to have been able to take it. I just hope that it has worked. So far ...so good.",
      "MessageIndex": 16,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 13, 2009 07:07PM lexislove wrote: OMG, Ann that article just put a major damper on my Friday night..ugh.",
      "MessageIndex": 25,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 13, 2009 07:31PM lexislove wrote: lol...its ok!!! I know that rads given now a days are a lot more targeted, and doses lower...thats a sigh of relief. We can only do what we feel is best at the time. ~cheers~",
      "MessageIndex": 27,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 13, 2009 06:08PM - edited Nov 13, 2009 06:21PM by lexislove Phoenix, I did 28 rads. Im surprised that your onc has NOT recommended rads for you. My honest opinion....you need them. 6cm + tumor requires rads to the chest wall...at least. Radiation has been proven to benefit woman even with a mastectomy. http://www.medicalnewstoday.com/articles/141157.php This study included Stage1&2 woman, tumors 5cm or less.....I would think tumors OVER 5cm would have even more benefit.",
      "MessageIndex": 4,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 13, 2009 06:42PM lexislove wrote: I did go to my old GP and have it checked. I had my daughter 1 year before, nursing. I was 30.No family history. It couldnt be breast cancer? I was too young. Most likely a cyst because my mother has had breast cysts since she was 16. I was told to keep an eye on it. I knew nothing about BC. I didnt think it was BC either. You could imagine the shock when I found out it was.",
      "MessageIndex": 14,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 14, 2009 06:22PM lexislove wrote: Thanks Sherri, For setting the record straight about the ILC. I had no idea about the difference in growth patterns. Im not sure if Phoneix realized it as well.  Phoenix, I hope you have given some thought about the rads. Either way, ket us know your decision.",
      "MessageIndex": 32,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 13, 2009 01:06PM lexislove wrote: I myself do have one rad marking right between both breasts. It actually sits on a freckle...lol I think it all depends on the original tumor location where the rad tatoos are put. That said.......I'm sure you won't be the first woman with a tatoo on her chest who needs rads. I'm sure they will figure something out. Good luck with the rads! It goes by quicker than you might think. * cheers*",
      "MessageIndex": 1,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/727280",
      "Title": "\"Elective\" tattoos and rads TorchSong TorchSong"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 13, 2009 06:24PM lexislove wrote: My path was DCIS left..6 nodes removed, clear for metastasis. ER+ and Her2+. I was a smoker too before cancer, the chances of getting lung cancer from years of smoking + rads is probably less than a cancer recurrence. As per my onc.",
      "MessageIndex": 6,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 13, 2009 06:35PM lexislove wrote: I completed Herceptin 1 year ago. Im 2 yrs out from diagnosis. Even with a mastectomy, it is impossible to remove all the breast tissue. So the rads. It takes 1 little cell...thats all. Hiding...waiting..the rads clear it up. The choice is yours. My daughter was 2 at the time as well. I wanted to do everything.I did. Yes, its true that once you have had rads you cant have them again. I wasnt concerned about a loco recurence(breast). I was concerned about a possible 1 cell travelling to other organs...mets. Maybe a 2nd opinion would be good. I hope some other woman on here can give their experience and rationale.",
      "MessageIndex": 8,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 13, 2009 06:55PM lexislove wrote:",
      "MessageIndex": 23,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743847",
      "Title": "Just got path report, not sure about something phoenixsmom phoenixsmom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 9, 2010 09:08AM - edited May 9, 2010 09:12AM by lexislove mom, Well...theoretically, I can't take Tamox either (poor metabolizer) but there is so..so much contoversy with this test. Especially with pre menopausal woman because Tamox is THE only thing we can take. My onc explained to me that a poor metabolizer does not mean NO metabolzer. It just means it takes longer for the Tamox to do it's thing and how much I'm actually metabolizing? We don't know. So. What does that mean for me? Well, I don't want to be my own trial and \"see what happens\". Forget it. So, since I'm only 32 and still highly premenopausal, I decided to get the ovaries out now, than later. I asked my onc what I was suppose to do. Take the Lupron untill I hit natural menopause? Pfffttt....ok. That could be another 15 yrs! Plus, my Lupron is only covered for the first 3 yrs since finishing treatment. Why? Because studies to date only have this info, overall survival with 3 yrs of Lupron vs nothing. The SOFT trial will answer all these questions for us pre meno woman.The SOFT trial will be answering for 5 yrs and if Lupron with Tamox is better than Lupron with an AI. Or Tamox is just fine. I asked my onc straight out, \"what do you think I should do?\" My onc said very honestly, that with us pre meno woman they ,the reasearchers,just don't know enough right now. AND....any news regarding the SOFT trial will be years away. mom.....I can't wait years and take a gamble. I have to do what I know now. Most of it, is my own research, other womans stories I've read on various B.C. boards and my own gut feeling. So thats me. As for testing estrogen levels...it's a blood test. I do not get my estrogen levels checked, but I don't need to because I'm on Tamox still. Even though I'm on the Lupron, if I did test and it said that I wasn't fully in menopause, thats ok......being on the Tamox. NOT, the AI. Tamox and Ai's work differently. Tamox binds on to the estrogen in our bodies, where an AI....stops to help the production. Edit: Our bodies also produce estrogen in our adrenal glands and excess fat. Thats why they say a reducing excess weight and exercising to keep off the pounds will help lower our chances of developing BC or getting a recurrence.",
      "MessageIndex": 14,
      "PostDate": "09/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/749791",
      "Title": "removal of ovaries vs lupron 131mom exercise_guru"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 14, 2010 10:45PM lexislove wrote: HI there. My questions were the same...I decided to remove them. Im 32, done with kids and there is no research to tell me how long to stay on the Lupron for. Do I take Lupron shots every 3 months for 15 yrs or more? Come on now...really. I think age has to do with your decision too. There are pros and cons with removing the ovaries. For instance removal is permanent, there is no going back. Being thrown into menopause right away instead of gradually. Increase risk of heart disease and bone loss. These can be prevented through lifestyle though. Its a hard decision...do whats right for you.",
      "MessageIndex": 1,
      "PostDate": "14/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/749791",
      "Title": "removal of ovaries vs lupron 131mom exercise_guru"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 7, 2010 07:28PM lexislove wrote: I've been doing Lupron since June 2008. I do the every 3 month shot. It's ok. I like only going to the cancer centre every 3 months instead of every. I do have se's but I've linked it to the Tamox. momand2kids, Are you having your estrogen levels tested monthly to make sure that you are in full menopause? I hope you are...because the AI's will only work if you are fully menopausal. Even though we are supressing our ovaries, have had no period doesn't gurantee we are fully in menopause. This is very...very important. If you are NOT in full menopause...the AI's can actually stimulate the ovaries. So you actually doing more harm than good. I was told this by my onc, when I tested as a poor metabolizer via the cyp2d6 test. I was ready to throw the Tamox away and start up Femara. I actually DID do Femara for 2 weeks...then my onc told me that it was safer for me to do the Tamox than the AI untill I have my ooph (June 3rd). I asked about testing my estrogen levels, I think I remember him saying there was 2 hormones that need to be seen as menopausal, but apparantly in Canada...it's not available. There is literature on this on the net if you want to google yourself.",
      "MessageIndex": 9,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/749791",
      "Title": "removal of ovaries vs lupron 131mom exercise_guru"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 8, 2010 08:29PM lexislove wrote: mom, Congrats on the NO anxiety. I'm sure that you are fine with your menopausal status. My period stopped after my 3rd AC, that was Dec 2007.......it did not come back once I finished chemo in Feb 2008. I started Lupron in June 2008. Like I said....I only found out about this whole AI and Lupron menopause thingy...because I casually mentioned to my onc that I seem to have mild cramping right before I'm due for my Lupron injections. Like my ovaries were wanting to wake up. Thats when my onc explained the whole thing. Good to for you to follow up...better safe than sorry right? Be well.",
      "MessageIndex": 12,
      "PostDate": "08/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/749791",
      "Title": "removal of ovaries vs lupron 131mom exercise_guru"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 22, 2010 06:18PM lexislove wrote: chasinghope, I have been on Lupron with Tamox for 1.5 yrs. Many woman go this route too.",
      "MessageIndex": 4,
      "PostDate": "22/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/749791",
      "Title": "removal of ovaries vs lupron 131mom exercise_guru"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 13, 2009 12:17PM - edited Apr 13, 2009 12:18PM by lexislove I have been doing the chemical shut down myself since July 2008. I have thought about removing my ovaries, but I think being 31 I am too young to go that route. All my docs don't recommend it. It is not reversible and if it didn't work they can't give back my ovaries. The potential se's having them removed at a young age have me concerned. So I'm thinking about waiting to untill any sort of study says yay or nay. I tolerate the Lupron shots and Tamoxifen really well. I'm having no problems and feel really lucky. Some woman have horrid se's. If I had my ovaries removed I would be left taking an AI which have stronger se's and my quality of life would probably go down the toilet. Why would I set myself up for that. BUT, if I was older,  and naturaly close to menopause ...I would probably have the ovaries removed anyways.",
      "MessageIndex": 7,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732350",
      "Title": "Ovaries and all that stuff..... thisisme nobleanna007"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 31, 2010 12:20PM lexislove wrote: I had bone aches. They started 1-2 days after my infusion and lasted for 3-4 days. So basically the week after the infusion I was a little slower moving around. Whe I was up to it, I went for walks. As long as I could that really helped to, and the fresh air. Taxol is definatly better tolerating than the AC.",
      "MessageIndex": 2,
      "PostDate": "31/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747615",
      "Title": "Taxol pupfoster1 concernedsis"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 15, 2010 11:28AM lexislove wrote: Shana, First, big...big congrats on your one year. Second, like the others, the ankle/feet,joint pains are likely from the Arimedex. Look up the se's. You can try uping your VitaminD, or taking Glucosamine(sp) I saw some woman on the AI threads talking about this and it seems to work. Im starting up with Femara in 4 weeks after my surgery, so Im hoping my se's are not severe. I already have joint pains and stifness but thats likely from all the Lupron shots Ive been doing for the last 18 months. No estrogen, no quality of life...or less quality of life...hopefully.  If your are still having bad se's, you can always switch AI's and find one that is more tolerable.",
      "MessageIndex": 7,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746756",
      "Title": "PAIN PAIN PAIN! Shanagirl faithfulheart"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 8, 2009 03:25PM lexislove wrote: Took about 1/2 an hour.  It was easy peasy, but the arms above the head was uncomfortable especially because I had my first fill of my tissue expander that morning!!!..lol. Pure joy.",
      "MessageIndex": 9,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/743492",
      "Title": "What was your RADS Simulation Like? Sparrow Sparrow"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 27, 2009 08:42PM lexislove wrote: It sounds like you may have a bit of an infection. Green/yellow snot color stuff.... I would let your rad onc know and they may decide on a little break. I did not have an infection, but the week after I finished rads I was peeling a raw. I tried creams they didnt soothe at all. The only thing that helped was cold tea bags....believe it or not. I would soak about 4-6 bags and place them on the areas that were worse. Took the burn feeling away.",
      "MessageIndex": 2,
      "PostDate": "27/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/745930",
      "Title": "Rads burn peeling and seeping yellow/greenish snot looking stuff buccaneersdj Bethie1"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 25, 2010 09:37AM lexislove wrote: I did rads with my tissue expander in place. The expander was filled to 250 cc's. I did not have any fills during rads. I then waited 8 weeks to continue with the fills. My skin took really well to rads. No blisters or redness. Just sensitive. I applied cream 2- 3 x a day. I had my tissue expander placed March 27th 2008 and I just had my exchange surgery Jan 28th 2010. So, I waited 22 months. I wanted the skin to stretch as much as possible. I was in no rush. It can be done.",
      "MessageIndex": 2,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/748883",
      "Title": "radiation wth expqnders rayofsun Jayne_in_UK"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 2, 2009 09:11AM lexislove wrote: I had 28 rad sessions. I found by Thurs / Fridays I was fatigued...but ok by the Monday to start the rads again. After the 5 weeks I was exhausted for about a week...then it got better everyday.",
      "MessageIndex": 4,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730002",
      "Title": "RADIATION FATIGUE - POLL bluejay1 Siciliana"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jul 15, 2009 12:10PM lexislove wrote: Congrats Heather! I'm sure she will be spoiled. Precious!!!!!",
      "MessageIndex": 15,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737440",
      "Title": "Heather Palmerton's new grand daughter pictures Fitztwins virginiamom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 12:26PM lexislove wrote: Thanks!! Ill take a looksie...",
      "MessageIndex": 5,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 01:02PM lexislove wrote: Just like the ACS data is from 1999-2004 I believe? Duh..chemo brain. I agree with the Herceptin thing. It has turned stats upside down, benefiting the Her2 population, but untill there are studies singling out Herceptin.....we are all grouped as one. Just like Er+ & Er-, all grouped together.",
      "MessageIndex": 21,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 01:09PM lexislove wrote: lol....oh nico....ill bet you'll take those 80% stats and run with it!",
      "MessageIndex": 25,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 01:15PM lexislove wrote: Ahhhhhh...diana50. See, there is someone who has beat the odds!!!!!",
      "MessageIndex": 28,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 29, 2009 04:13PM lexislove wrote: Shana girl, You got really good treatment. The ACT still shows a minor superiority than the TC...like only 5%.",
      "MessageIndex": 66,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 01:04PM lexislove wrote: good attitude Nico, thats how we should all feel.",
      "MessageIndex": 23,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 12:39PM - edited Oct 28, 2009 12:40PM by lexislove Thank god!!!!!!!! So shana girl, in your case, 5cm tumor, grade1, only 2 nodes involved, Er+, Tamox or an AI, Zometa possibly, young(er) and otherwise healthy ...would fall above this 67% number...probably in the mid 70's or more. I think those are pretty good odds ",
      "MessageIndex": 11,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 06:25PM lexislove wrote: Shana, Don't get me started on stress. That is what I blame for my BC diagnosis. Thats another thread though....",
      "MessageIndex": 54,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 29, 2009 04:08PM - edited Oct 29, 2009 04:10PM by lexislove Bev, Try not to doubt your chemo. even though TC is been given more and more now...some docs still think AC is excellent. You would have benefited from chemo in some way especially with positive nodes. Did you do neo adjuvant chemo? Did your tumor respond?",
      "MessageIndex": 63,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 29, 2009 04:16PM lexislove wrote: JudyO, I think one day we will see neo adjuvant chemo be standard of care for tumors 2cm or over. How else can \"we\" know if our cancers responded or not? I think it should be done for everyone. I remember when I was first diagnosed and was told I would have neo adjuvant chemo.I freaked because every woman I talked with had chemo AFTER. I was convinced the docs knew something I didn't.....lol. Today....Im so....so happy that I did it because I know my ACT kicked that BC out of me. Its a piece of mind thing.",
      "MessageIndex": 69,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 29, 2009 04:19PM lexislove wrote: Shana, My onc is like Judy's. Young, goes to the conferences every year blah blah...I was worried about ACT VS TCH AFTER I finished my chemo. So I questioned him. He still thinks for a younger woman with no personal or family history of heart problems, AC is the way to go.",
      "MessageIndex": 70,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 12:17PM - edited Oct 28, 2009 12:21PM by lexislove There are so may factors when it comes to ones prognosis. - Age, pre-existing health conditions, Er & Her2 status, tumor grade, response to chemo if one had neo adjuvant chemo, multi focal disease,lymphatic invasion and the most important.....number of lymph nodes involved. These will all affect a womans long term survival. I also believe changing ones lifestyle can help as well. Exercise, proper weight and good food choices has an affect. As for stats.......Im gonna say it.....ready? They are what they are and so is ones diagnosis / path report. Do I believe in stats? No. People beat stats every day. You are always gonna read NEW studies regarding the proper chemo for certain cancers ect...ect. But you had the best treatment at that time. We cant go back and change our treatment or get worried that we had one chemo but news is saying the other MAY be better....it will make one mad. As for AI's they are relativly NEW, compared with Tamox so data isnt definitive...but we have a pretty good idea that they work great! As for Herceptin, the long term news will hopefully be out soon. Im Her2, I have various studies to show prognosis regarding myself.....but those studies are only 3 yr. Do I sit and worry about year 4-8? No. Do I wonder? Sure. I think if someone really wants to know their prognosis, the best person to ask is their onc. The onc knows ones specific case....and even then.....they have no crystal ball. Be well.",
      "MessageIndex": 1,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 12:33PM lexislove wrote: Ok...percentages will vary with different medical conditions....there we go. also, these stats are based on woman over age 60 most likely (with different medical things goin on).above.  Also, a stage 3A woman can be a woman with a 5cm tumor and 1 lymph node + or a woman with a 2cm tumor and 4-9 + nodes.....now, obviously the woman with the larger tumor has a better prognosis due to nodes involved, but these woman are grouped together in the same category making up the statistics.... Do I make a little sense...lol.",
      "MessageIndex": 8,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 12:57PM lexislove wrote: Thats the thing pure......cancer of any kind makes no sense. If it did we would have a cure. Remember , the stories you here on the board are the minority. the rest of the woman are too busy with their lives to be posting on here.",
      "MessageIndex": 19,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 04:06PM lexislove wrote: Lol.....there have been many times when I have done the same Mary. Non compliance is huge!!!  I read an article about it, locally at the BC Cancer Agency and they did a study. It seems that the first 2 yrs woman take there Tamox, but year 3-4 they think, \"oh im ok....\" and stop or take it periodically. The message staying disease free....take your meds!",
      "MessageIndex": 45,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 12:20PM lexislove wrote: Shanagirl, Now...are these stats just surgery alone or all other treament? Where are you getting this from, Id like to check it out more..",
      "MessageIndex": 3,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 12:35PM lexislove wrote: Whatever we read today...anywhere about stats is old data...is it updated in 2009? Yes...but its based on studies done 5-10 yrs ago.. And stats in 2015...will be based on 2009 and before cases...blah.",
      "MessageIndex": 9,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 01:14PM lexislove wrote: Kerry Mac, How did you factor in rads for Nico...Ive visited the site and been playing around, but nothing for rads is there?",
      "MessageIndex": 27,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 28, 2009 06:24PM lexislove wrote: PS73, I dont like adjuvant online myself. One the Her2 thing and it isnt reliable. There is suppose to be a new version comin out that DOES factor Herceptin treatment.......should be interesting. Remember that the 37% reduction in risk of recurrence for Zometa, turns out to be about a 3-4% difference. SO, its not as much as we think but it is something....I'll take it!",
      "MessageIndex": 53,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 29, 2009 07:01AM lexislove wrote: Exactly Kerry Mac, One has to look at their own risk for recurrence before considering any treatment. A woman with a 10% risk, may think the potential se's of Zometa is not worth the chance compared to a woman with a higher risk. But I think we all can benefit from Zometa's bone strengthing abilities.",
      "MessageIndex": 58,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 12, 2009 10:16PM - edited Apr 12, 2009 10:16PM by lexislove Zoplicone... You need a perscription but, trust me you will sleep. Warm bath, reading, relaxing music. This inconvience of not sleeping well is not for nothing. Keep reminding yourself that...",
      "MessageIndex": 4,
      "PostDate": "12/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/732358",
      "Title": "I AM SO CONFUSED! idaho terrilee"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 12, 2009 01:45PM lexislove wrote: Lisa.. I did not come to this forum untill this past winter. I had finished my Herceptin. If I was on here  reading side effect  threads, I would have been a basket case. Like I said..I winged it. When things got a little harder, I just asked my onc what to do. I feel I made the right decision for myself.",
      "MessageIndex": 15,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/733975",
      "Title": "What we wish we had known about chemo before we started! ddlatt kerry_lamb"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 11, 2009 10:00PM lexislove wrote: I didn't want to know about anything!!!! I just winged it. I knew nothing about the se's, I looked up nothing. I would have hated to anticipate anything.",
      "MessageIndex": 8,
      "PostDate": "11/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/733975",
      "Title": "What we wish we had known about chemo before we started! ddlatt kerry_lamb"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 21, 2010 10:38AM lexislove wrote: I agree with Nancy. It takes soooo long to get to a trial stage. And then when you get to that stage it takes longer.. Seriously, I was hoping to see early results of the SOFT trial the end of this year, but I don't think its likely. The SOFT trila results won't probably be available for at least 5 yrs likely more. That does me no good. But, right now there is a lot out there. Remember, just don't look at it from a drug standpoint. There is also \"other\" things you can do to help you never look at BC again. Like exercise, eating well. THAT has been proven too.",
      "MessageIndex": 3,
      "PostDate": "21/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748691",
      "Title": "Am I Wrong in Thinking Pure Husband11"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 10, 2009 10:27AM lexislove wrote: Pure, I cried everytime I went for my chemo session. 8 times totall. It was very hard for me to sit there and see all the other cancer patients. Then....everyone was looking at me because I was the young one. It was horrible. I would take Ativan beofre going, only 10mg. Maybe I should have taken more. My nurses were so good though. they didnt leave my side. Maybe you can take someone with you to distract you, or read or listen to an ipod. Just something. Dont pay attention to that nurse, she was not talking about you. She was talking in general. You are very fragile right now. Chemo turned me into a flake. Just keep counting down those chemos.......breathe.Have some tea. Im sorry you are feeling this way...been there.",
      "MessageIndex": 1,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743618",
      "Title": "Loosing it... Pure Gitane"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 12, 2009 08:17PM lexislove wrote: Ohhhh boy... It would have to be Hysteria by Def Leppard. My first boyfriend and I broke up in his car and that song was playing. That was 16 yrs ago..and I still cry when I hear it..",
      "MessageIndex": 41,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730432",
      "Title": "What Song Makes You Go Over The Edge? KellyC cp418"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 10, 2009 06:11PM lexislove wrote: I still have to visit the infusion room too. Zometa. Its hard, real hard. Still after almost 2 yrs finishing active chemo. The last time I went I sat beside an older woman. Not sure what type of cancer she had...didnt care. I have have hair extensions and look healthy. Im also only 32. The woman turned to me and strted telling me about some other young woman who had been in remission from her LEUKEMIA for almost 4 yrs. Leukemia? Excuse me. This older woman assumed I was a leukemia patient because I had hair and I was young!!! I corrected her. I hope I dont see her again in January for my next infusion.",
      "MessageIndex": 20,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743618",
      "Title": "Loosing it... Pure Gitane"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 7, 2009 06:15PM lexislove wrote: Excellent! Thanks Pure for the heads up! I see that the breastcancer.org homepage says that they will be posting highlights regarding the ASCO. December 15th?... Looking forward to it.",
      "MessageIndex": 2,
      "PostDate": "07/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745052",
      "Title": "Interesting News Pure Gitane"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 14, 2009 06:46PM - edited Apr 14, 2009 06:49PM by lexislove Would you share with us the \"name\" of the cancer? Is there a history of BC in the family? Also, did your daughter develop breasts early? I'm sorry about the questions you do not have to answer ....I'm just trying to make some sort of sense mom.I'm 2 years older than you and your mind must be racing.",
      "MessageIndex": 12,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732491",
      "Title": "HELP! 10 year old with bc cjsocal Mary-Lou"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 30, 2009 09:08AM lexislove wrote: Rose, Good post. I was trying to say the same thing...but I havent had my espresso yet!..lol. Oh I will never, give up an occasional coffee.",
      "MessageIndex": 9,
      "PostDate": "30/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746027",
      "Title": "No soy? kimber3006 kimber3006"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 19, 2009 12:05PM lexislove wrote: PT6, I would first just like to say that YOU are an inspiration to me being diagnosed at 29. I was 30 diagnosed and I hope, to say I am a 31 year BC survivor. I am sorry that you are having to go through all this garbage ...again...but like Beesie has said, it sounds like a new primary. AnneW is right, the treatments now a days have come along way. Feel that you will beat this again. Take care!",
      "MessageIndex": 6,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732661",
      "Title": "31 years and its BACK!!! PT6 lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 25, 2010 11:21AM lexislove wrote: Hi there. I did chemo, R mastectomy with immediate tissue expander placed, rads. I then went for my tissue expander fills after I finished rads. I just had my exchange suregery 4 weeks ago. I waited almost 2 yrs. I waited because I wanted the skin to stretch as much as possible AND because of the whole\" 2 yr recurrence thing.\" My skin took really well to rads. My PS said that he didnt see why it would not be successful. I opted for a lift/reduction on my healthy breast (left side). So far..Im happy. I was a D, almost DD cup before the surgery. I decided to go smaller, a C cup. and it is so...so...so.. much better. Only minor thing is I developed a slight infection 2 weeks after the exchange surgery. I seem to have caught it in time and it has cleared up. Im continuing with anti biotics just in case.",
      "MessageIndex": 4,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748921",
      "Title": "Did You Have Reconstruction Joy232 Gayleebug"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 14, 2009 06:55PM lexislove wrote: I typed  endocarcenoma in Google, and what came up is Adenocarcenoma. Please come back and keep us updated on your daughter.",
      "MessageIndex": 14,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732491",
      "Title": "HELP! 10 year old with bc cjsocal Mary-Lou"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 20, 2009 05:07AM lexislove wrote: Thinkin of Hannah too....",
      "MessageIndex": 127,
      "PostDate": "20/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732491",
      "Title": "HELP! 10 year old with bc cjsocal Mary-Lou"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 18, 2008 02:18PM - edited Nov 18, 2008 02:20PM by lexislove Roxy Im so sorry what you are going through. I can relate to you at some point.I have my days and I'm sure everyone does. I think it is time, and the fear will slowly leave but there will always be some sort of fear. I worry about food too.I lost 28 lbs but I was overweight to begin with, so it is a good thing.I completely agree with the moderation thing, and I always did that anyways. Remember there are people who are complete fitness / health freaks and they get cancer. Why? And then you have people who don't live a healthy lifestyle, drink excess, smoke and live till 80 or 90. Who knows, but I'm not going to sit and try to figure it out when doctors can't even. Do you fear a heart attack? Multiple Sclerosis? Stroke? If you live everyday in fear , your not living and I'm sure you don't want your children to have a basket case mother. My family doctor gave me a number to a psychologist that deals with people who have HAD, and I say HAD, a cancer diagnosis.Don't feel bad if you have to reach out for professional help. you and your children deserve it. You would be amazed how a professional can help you sort out\"stuff\"",
      "MessageIndex": 2,
      "PostDate": "18/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/724654",
      "Title": "Feer of Food roxy42 SpunkyGirl"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 30, 2009 08:50AM lexislove wrote: I avoided soy for 18 months.....untill Monday. Had to grocery shopping and was sick of eating fish or chicken...more fish...and more chicken. I was stuck in a food rut, since I avoid red meat. I picked up some firm tofu and made a veggie/tofu stirfry with udon noodles. It was delicious, and a change from my chicken and fish.   Im sure I consume most foods that containe phytoestrogens, but its moderation. Plain and simple...moderation. I do avoid anything flax because it has such a higher concentration of soy. My motto: Eat,live!!!!",
      "MessageIndex": 6,
      "PostDate": "30/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746027",
      "Title": "No soy? kimber3006 kimber3006"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 2, 2010 09:38AM lexislove wrote: I was getting nervous about seeing this thread started by you....lol. Then I opened.....yeahhhhhhhhhh!!!!",
      "MessageIndex": 7,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747703",
      "Title": "Tms everyminute Gitane"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 14, 2009 06:01PM lexislove wrote: I am so..so sorry. I don't even know what else to say. I pray for your little girl. I have never heard of this. Being diagnosed at 30 was hard..I can't imagine 10. you are in my thoughts and prayers.",
      "MessageIndex": 5,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732491",
      "Title": "HELP! 10 year old with bc cjsocal Mary-Lou"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 14, 2009 06:31PM lexislove wrote: Emily you have a point... cjsocal, are the doctors sure it IS breast cancer and not Hodgkins or another child cancer? I am not doubting you by all means...I just can't get my head around the idea of...10! I think of my 3 year old daughter and thats only 7 years away.",
      "MessageIndex": 10,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732491",
      "Title": "HELP! 10 year old with bc cjsocal Mary-Lou"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 18, 2009 03:05PM lexislove wrote: Thanks for the update nana! I was telling my own mother about your granddaughter and she was shocked! Her prayers are with you and your family. Please update us on her treatment protocol and how she is feeling. God bless...",
      "MessageIndex": 99,
      "PostDate": "18/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732491",
      "Title": "HELP! 10 year old with bc cjsocal Mary-Lou"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 21, 2009 08:20AM lexislove wrote: Hannah has been on my mind since her father first posted here. I have told my family about this and emailed my friends her blog. Everyone is shocked! There is so many here keeping her in their thoughts and prayers.",
      "MessageIndex": 148,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732491",
      "Title": "HELP! 10 year old with bc cjsocal Mary-Lou"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 12, 2010 08:50AM lexislove wrote: Thinking of you....",
      "MessageIndex": 7,
      "PostDate": "12/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746638",
      "Title": "Our new girl needs some support! Let-It-Be dee1961"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 20, 2009 06:22PM lexislove wrote: I did AC every 3 weeks too... I was like lovinmomma in how I handled it. NOW.....taxol.....thats a different story...",
      "MessageIndex": 8,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/731048",
      "Title": "Planning around chemo sherrimo NanaA"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 24, 2010 07:31PM lexislove wrote: Thanks for the update Wallan. Another long timer out living her life. Just what we all like to hear!",
      "MessageIndex": 3,
      "PostDate": "24/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748905",
      "Title": "Checking in wallan SoCalLisa"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 20, 2009 01:55PM lexislove wrote: hmmmmm... This is a toughy, I know after chemo or surgery...they like to do rads between 4-6 weeks. BUT, your situation is different. Do you have a radiology oncologist you can ask? Or maybe your own oncologist. I'm not sure your surgeon would have a good idea....mine was useless in the rad dept...lol",
      "MessageIndex": 1,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/731082",
      "Title": "How long is it safe to postpone radiation Pat634 Pat634"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 2, 2010 09:55AM lexislove wrote: lol",
      "MessageIndex": 9,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747703",
      "Title": "Tms everyminute Gitane"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jul 25, 2009 09:57PM lexislove wrote: I remember allll this fear. But you know what I started to think? I wanted the mastectomy fast so that this horrid cancer was out of me. Thats how I started thinking. I was also surprised at how well I felt after the mastectomy. I was sore of course, but not as nearly as sore as I thought I would be. I was most nervous about my pathology after as well. I had my mastectomy March 27 2008 and had my path report April 1. Every hospital is different though but expect anywhere from 1-2 weeks.",
      "MessageIndex": 1,
      "PostDate": "25/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/737976",
      "Title": "nervous about my mastectomy... me1ani anne26"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 8, 2009 05:55PM - edited Dec 9, 2009 05:48PM by lexislove",
      "MessageIndex": 11,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745091",
      "Title": "MMMMM Meat Shanagirl Shanagirl"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 8, 2009 02:00PM - edited Dec 9, 2009 05:50PM by lexislove .",
      "MessageIndex": 2,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745091",
      "Title": "MMMMM Meat Shanagirl Shanagirl"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jun 13, 2009 06:36PM lexislove wrote: Chemo comes first.",
      "MessageIndex": 1,
      "PostDate": "13/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735838",
      "Title": "What comes first chemo or rads amlg1 nelia48"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jun 4, 2009 05:07AM lexislove wrote: You know what..I really enjoy sitting in the sun for a couple of hours or so. I like the look that a nice bronzy tan gives me. I have also read that when you are exposed to the sun your body produces\"happy\" endorphins(sp?) BUT, Im aware of the possibility of skin cancer. Supposidly skin cancer is the number 1 cancer for woman ages 15-35. I do not tan everyday mind you. I will only tan max 2 hours maybe 1x week.",
      "MessageIndex": 13,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/734756",
      "Title": "Tanning after Radiation Jeanne_D Jeanne_D"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 10, 2009 07:02PM lexislove wrote: Good news Pure.",
      "MessageIndex": 4,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745177",
      "Title": "Baby Update and Personal Update Pure SpunkyGirl"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jul 25, 2009 10:08PM lexislove wrote: I could get around right away. The lifting took time. they will give you a list / description of exercises to do. Do them...AND \"regular\" house duties. Like dishes, folding laundry, reaching into cupboards. Don't go overboard the first bit...as the days go on things become easier. I had a 2 year old..so i was constantly picking up things and cleaning. I was thrown right into mom duties...I believe this helped with my healing.",
      "MessageIndex": 3,
      "PostDate": "25/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/737976",
      "Title": "nervous about my mastectomy... me1ani anne26"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 19, 2009 02:54AM - edited Mar 19, 2009 02:57AM by lexislove Hate ..hate ..hate..this disease! One step at a time, I'm hoping some experienced ladies can help you. I'm sorry you have to going through this....",
      "MessageIndex": 4,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730968",
      "Title": "It hasn't even been a year :( HELP! ekenny315 Makratz"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 22, 2010 02:30AM lexislove wrote: Im so sorry Shana, My fathers aunt, that would be my great aunt, passed from Alzheimer's. She was also a BC survivor. I was 16 at the time, but it was very upsetting. Towrads the end of her life, she didnt even recognized me or my brother. When we would come to visit she would ask us a million questions....um..hello? You changed our diapers?. So sad. My thoughts are with you.",
      "MessageIndex": 5,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747133",
      "Title": "My Dad Passed Away Yesterday Shanagirl Frankie_"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 4, 2009 06:34PM lexislove wrote: I was just going to post a topic on this. I was outside this weekend and got a little burn. I too did not put on sunscreen because I wanted my D vitamins. Anyways, I took a sleeping aid last night which had me in a deep sleep. I tend not to move around a lot..I find my position and stay there. Any whoo, I woke up and my Right hadn/arm was slightly more larger than my left. I had my mastectomy on the Right side an 6 lymph nodes were removed. I thought maybe I slept on it weird but now I'm kinda worried. Should I just wait a couple of days to see what happens or see the doc? H-E-L-P!!!",
      "MessageIndex": 6,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/733334",
      "Title": "Forgot Sunscreen - Lymphedema? chicago-37 Binney4"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 2, 2009 12:06PM - edited Mar 2, 2009 12:10PM by lexislove Enlarged left lymph node.....ovarian lesions on both ovaries...likely a cyst on the left ovary......the right ovary is either a cyst or solid growth...the right \"mass\" is intermediate (? don't know exactly what that means). Could be a fibroid \"they\" are not excluding it.....malignancy (cancer), not excluded ( may be malignant may not) Recommending pelvic ultrasound or MRI focussing on the Cervix Maybe someone else can help too....I have med back ground and this is what I interpet so far....HANG IN THERE!!",
      "MessageIndex": 1,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/730013",
      "Title": "Results of CT Scan? Can Anyone Interpret? Britt Britt"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 10, 2010 01:26AM - edited Feb 10, 2010 01:35AM by lexislove Hi Becky, I can only tell you what my onc told me....I did neo adjuvant chemo too. Tumor was 8cm...and grew fast, real fast. I started with AC as well. The tumor responded fast. It shrunk to about 1/2 after the first AC. Before I started chemo, my onc told me that if  my tumor wasn't responsive to the AC after 4 cycles, then we would do the mastectomy before starting the Taxol. I didnt question him at the time, what his reasoning was, I was such in a panic state from being diagnosed. Is there another oncologist you can ask? Third opinion? If not, I would tend to listen to the expert, your oncologist. But, thats just me. I guess the question is.....is your tumor  shrinking and how much?",
      "MessageIndex": 4,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748096",
      "Title": "need advice becky1 jenn3"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 4, 2009 08:32PM lexislove wrote: Thanks bettysgirl.. I slept almost 12 hours last night. the best sleep I've had since diagnosis.But waking up to see my hand/arm made me go huh? and then when I saw chicago's thread about the sunscreen and lymphadema, my mind went racing. It has gone down since this morning. So I will give it another day or so and see if lessens up.",
      "MessageIndex": 10,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/733334",
      "Title": "Forgot Sunscreen - Lymphedema? chicago-37 Binney4"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 13, 2009 02:58PM lexislove wrote: I take 75 mg of Effexor XR as well and it has made a huge difference!! I wish I had started sooner. Lisa is right, I had no motivation/drive. I felt like a slug that someone had poured salt on. Now, I have a ton of energy and always makin plans for something. I don't plan on being on it forever. Just to get through these rough first couple of years. I'm planning an ooph too, so I'll wait till after that to see how I am doing with it.",
      "MessageIndex": 20,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/733975",
      "Title": "What we wish we had known about chemo before we started! ddlatt kerry_lamb"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Aug 6, 2009 04:53PM lexislove wrote: There is no data out yet. It was suppose to be out already I think...but IF there were results and they were superior to the 1 year that is standard.....we would have heard about it right away. My onc says 1 year too. 2 years could be over load for early stage disease.",
      "MessageIndex": 2,
      "PostDate": "06/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738517",
      "Title": "Herceptin for two years mona1 mona1"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 28, 2009 03:35PM lexislove wrote: blondie, My PS says that he will do an \"anchor\" incision. So they will  make the incision around the nipple and then straight down. Best to google so you get a better idea...lol. So scaring is less noticeable, he will remove breast tissue and then lift the nipple higher.",
      "MessageIndex": 20,
      "PostDate": "28/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744378",
      "Title": "Keeping One Breast as a Diagnostic Tool? Alaina blondie45"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 10, 2010 08:43AM lexislove wrote: Yes. I found my \"lump\" when my daughter 15 months old. I was 29. I do not feel that it affects my prognosis....but I do feel, unfortunatly, that my pregnancy played a key role in developing BC. Wacky hormones ect... Thats just how I feel my onc says it is definatly a possibility.",
      "MessageIndex": 5,
      "PostDate": "10/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/749546",
      "Title": "Were you Pregnant 2 years prior to your diagnosis? Pure KerryMac"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 4, 2009 07:38PM lexislove wrote: Thank you Binney. I will get a referal ASAP. P.S. The bug is my daughter Lexi (Aleksandra). Thats her Halloween Lady Bug costume",
      "MessageIndex": 8,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/733334",
      "Title": "Forgot Sunscreen - Lymphedema? chicago-37 Binney4"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 25, 2010 10:14PM - edited Apr 25, 2010 10:23PM by lexislove I should have been more clear... I'm looking at my receipts and I paid $370.00 for the sleeve + glove. I remembered it wasn't more than the $400.00 I originally mentioned in my thread. I was referred by my LE massage therapist to call this pharmacy where they deal with these sleeves. I was sized and measured the whole sha bam. I'm more than sure they are legit. I was actually told about the drug store/pharmacy sleeves and told even though they are are cheaper, they wouldn't do much good. I don't have the company name. All I know it was made in Germany...hence the big cost. Edit: This is what it reads on the tag in my sleeve. mediven 550 CCL.2 R               80% Polyamid, 20%Elastan Made in Germany by mediven",
      "MessageIndex": 6,
      "PostDate": "25/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751794",
      "Title": "Now what do I do? lexislove Binney4"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 26, 2010 09:49AM lexislove wrote: No, I have only had it wrapped once. My LE specialist has offered to show me and my husband so I can do it myself. I think I'll get in touch with her. Stupid thing....I found a great...great LE massage therapist, who is close by and works out of her home. Well, she now can't see me because some moron downstairs complained of noise, hard wood floor, and now the building council idiots say she can not work out of her home no more...grrrrrrr....She did refer me to another lady, but she's not as near ect. I'll be asking my new therapist to show me the wrapping ect.",
      "MessageIndex": 13,
      "PostDate": "26/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751794",
      "Title": "Now what do I do? lexislove Binney4"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 19, 2010 09:34AM lexislove wrote: Thanks linda! I, myself, was thinking after the 3yrs to just do a yearly infusion....just like a maintenance thing. I was concerned about bone density as well, but my onc said the same as yours, the Zometa would counteract with such. Zometa is really such a great drug to be able to take. Yes, there are risks, but that comes with any medication you were to take. The benefits by far outweigh the risks... AND....4 years!!!! That is wonderful.",
      "MessageIndex": 12,
      "PostDate": "19/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746808",
      "Title": "3 yrs of Zometa.....Then What? lexislove lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 25, 2009 11:05AM - edited Nov 25, 2009 11:07AM by lexislove I am a young woman diagnosed with BC. You all already know that.... I think I am one of the minority of young woman to NOT opt for a bilateral mastectomy. I asked all my docs, and they all said no. My surgeon said that same thing as caaclarks...\" you could get cancer of the lung or brain but are we going to cut it off to try to prevent....no.\" Iam though ER+, and have changed my lifestyle habits , I had good babits before I just need some fine tuning...all things that help reduce recurrence. Im also planning an ooph. I  have thought If I was to remove the healthy breast and develop BC in it, it would probably be at the chest wall because most of the tissue had been removed . VS NOT removing the tissue and having a \"new primary\" caught earlier and easier to treat. This is MY rationing. Is it right? Who knows. But I feel better in my decision. I am getting a lift/reduction on my healthy breast to match my implant and my PS assures me that I will be happy. I have also seen pics of other survivors who have had his work. I must add though, if I was TN or obviously had one of the BRCA genes, I would be doing a bilateral.",
      "MessageIndex": 18,
      "PostDate": "25/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744378",
      "Title": "Keeping One Breast as a Diagnostic Tool? Alaina blondie45"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jul 24, 2009 07:27PM lexislove wrote: I did the neo adjuvant chemo as well. I started with a 8cm tumor / no nodes and the chemo shrunk it to about 1.3cm x 1.3 cm. My surgeon was able to get clear margins and the breast was gone... Be carefull with the pre surgery scans MRI's ect..they can be misleading. Final surgery will tell the whole picture. Sounds good the chemo worked..yipeee!!",
      "MessageIndex": 2,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737919",
      "Title": "Neoadjuvant chemo Beth7 kae_md99"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 23, 2009 05:54PM lexislove wrote: Roxy ..I think taking the fish oil is actually really good for you, and me, or anyone! If it DOES have some weak phytoestrogens it wouldn't do much harm. My natural path strongly suggested Fish Oil and she knows all about my BC history and hormone status. I made sure to tell her about the \"estrogen thing\"",
      "MessageIndex": 3,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/731238",
      "Title": "Fish oil roxy42 theprettiestmess"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 23, 2009 05:45PM lexislove wrote: Did he say why Roxy? I'm interested. I heard fish oil is excellent to take",
      "MessageIndex": 1,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/731238",
      "Title": "Fish oil roxy42 theprettiestmess"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 21, 2010 06:41PM lexislove wrote: Thanks elaine, I do find comfort in your post. I plan on wearing it as much as possible. My massage therapist seem confident that she can get it under control, of course me doing my part to  Im mainly at home now but will return to work later in the year, and will definatly be wearing it at work as well. Its just the summer months coming up....wearing tank tops or nice sun dresses with this big bandage like thing on your arm...<sigh> Im not looking forward to the looks or questions.",
      "MessageIndex": 3,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747129",
      "Title": "Feeling a little Depressed...Mild Le. lexislove Suzybelle"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 21, 2010 08:15PM lexislove wrote: Shana, B6 huh? Ill read up on it. thanks for the tip... Colleen, My first massage session, I just closed my eyes an relaxed...it was sooooooo ver relaxing..lol. but then I thought to pay a bit more attention to the therapists techniques, so I could lesrn for myself and do a little at home. I massage my hand and fingers, but the arm is a bit harder.",
      "MessageIndex": 13,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747129",
      "Title": "Feeling a little Depressed...Mild Le. lexislove Suzybelle"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 22, 2010 11:40AM lexislove wrote: Leslie, The sooner you get going with lymphadema treatments the better. I was excited to to see the massage therapist. Woke up this morning, and my hand and arm are still swollen but my arm is not painful. My range of motion is good, it always has been. Just My 2 fingers look like little sausages! When I start going for job interviews, I will not wear the glove. When I get hired I will bring it up with who ever and go from there. I dont really see the need to go into my whole cancer story from A to Z on interviews......",
      "MessageIndex": 21,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747129",
      "Title": "Feeling a little Depressed...Mild Le. lexislove Suzybelle"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 15, 2010 10:08AM lexislove wrote: LindaLou, If you can update on this thread that will be great. I personally have no problem continuing annual infusions if need be, Im just worried about the risk of ONJ after prolonged usage as well. thank you..",
      "MessageIndex": 9,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746808",
      "Title": "3 yrs of Zometa.....Then What? lexislove lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 21, 2010 07:02PM lexislove wrote: Thanks Binny...!! Elaine, I was worried about sweating with the heat. When the woman who measured me yesterday showed me an example of what Id be getting ..I was like great... Im glad to know it is comfortable. What about going out for special occasions, can we leave it at home for the evening? Does it have to be worn 24 hours a day? Or it depends on the severity of the lymphadema? Sorry about all the questions..I have so much on my mind right now. Exchange surgery in 7 days, ooph in the next 3-6 months...now lymphadema. Boy, when it rains it pours!",
      "MessageIndex": 7,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747129",
      "Title": "Feeling a little Depressed...Mild Le. lexislove Suzybelle"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 21, 2010 07:43PM lexislove wrote: Thanks shana for your thoughts... Thing is my arm was ok after surgery. Just range of motion issues...the lymphadema startedalmost1 year after! Thats the thing with LE, it can be triggered months or years after surgery...argggh!!! I did have some cording issues, but that resolved on its own. Elaine, thats another thing that depresses me. I CAN NOT wear my wedding ring. Orthodox Christians wear the ring on the right hand instead of the left (like most people do). So here I have a beautiful wedding set...and cant wear! I was thinking of going to have the rings re sized. Should I wait on it, untill I get the lymphadema under control?",
      "MessageIndex": 10,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747129",
      "Title": "Feeling a little Depressed...Mild Le. lexislove Suzybelle"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 18, 2010 09:46AM lexislove wrote: Jen, No, I never thought about asking my surgeon. I actually havent seen him in over a year. I remember asking him beofre my mastectomy and node removal how many he was going to remove. He then explained that they are clumped together so it is hard to tell exactly how many are removed. They have to go under the microscope. He did say...it depends on what he \"sees\" when he is there. My case...everything was good. And in the end...I only had 6...yes 6. Nodes removed. I thought I escaped LE. But then I travelled to Europe this summer, without a sleeve. I think thats what triggered it. I hate this LE thing.",
      "MessageIndex": 37,
      "PostDate": "18/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747129",
      "Title": "Feeling a little Depressed...Mild Le. lexislove Suzybelle"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 25, 2010 07:35PM lexislove wrote: MOTC, I'm glad to know I'm not alone. It's insane the price to pay for a few months wear. I personally, can't afford to pay anymore out of pocket. I also have a glove.....and it's too tight! My finger tips turn purple/blue after about 20 minutes. I did get bandaged up after one massage. But come on. My right arm looked like a mini mummy. Could barely drive home. It was so uncomfortable, and my LE therapist said most people only last 4 hours wearing the bandage. I lasted almost 2 hours. I really...really hope some more people can offer some suggestions for us. Thanks for your post. :)",
      "MessageIndex": 2,
      "PostDate": "25/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751794",
      "Title": "Now what do I do? lexislove Binney4"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 26, 2010 09:25AM - edited Apr 26, 2010 09:38AM by lexislove Thank you otter!!!! I'll be checking on line next time for my future sleeves. How do I know my size? Or what to look for?  should I call the pharmacy and ask for my specifics? Should I get measured again and just say \" thanks, but you guys are a rip off and leave?\"...lol. Here are the specs for my glove : Mediven 550 CCL.2 MTM326? My glove was more expensive than my sleeve! Edit: again, should have been more clear....my $370.00 for sleeve + glove, is for 2 each per year.  So in Jan I paid $370.00 for 2 sleeves and 2 gloves for the year. Is that still expensive? Would it be worth it to pay for shipping ect if I was to buy online? I'm in Canada btw. Sorry about all this, but this LE thing is more confusing than my Her2,Er+ diagnosis....",
      "MessageIndex": 11,
      "PostDate": "26/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751794",
      "Title": "Now what do I do? lexislove Binney4"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 28, 2010 02:31PM lexislove wrote: *update* So I talked with my new LE massage therapist yesterday....she sounds great. I see her on Tuesday for a consult and then I'll be starting up with my intensive treatments ( 3-5 days a week for 1-2 weeks). I'm looking at between $600-$800. Yup, out of MY pocket. I'd much rather be spending it on something else but I really need to get this LE under control... Anyways....I also called my sleeve lady and saw her today with my sleeve. Told her that it slips ect....She then did some measurements and I'm down!! Some parts l'm down 1.5-2cm!!!! So thats good news. She told me to do my intensive treaments then after wards go see her and I'll probably be able to get a sleeve off the shelf than go the custom route. Save some money in the future.",
      "MessageIndex": 21,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751794",
      "Title": "Now what do I do? lexislove Binney4"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "lexislove wrote: I purchased an arm sleeve back in February. I'll admitt, the most I was able to wear it was for about 5 hours then I'm going crazy. I did not wear it everyday. I'm finding it difficult to get use to....but I'm getting there. I do wear it when I am exercising or doing housework. I started doing massage a couple of months ago, but, had to stop after I developed an infection after my implant swap. I was told to hold off the massage untill I completed the course of antibiotics (6 weeks). Today.....I put on my sleeve to go for a walk, and half way through my walk my sleeve was down to my elbow! I paid $400.00 for this sleeve, barely wore it, and it's falling off. When I picked up the sleeve, I was told it was made in Germany and if the sleeve started to loosen it is basically no good. I'm allowed 2 sleeves per year, every 6 months per insurance. I can't get fitted for my next sleeve untill June. The sleeve will be ready July. I wanted to start doing my massage again and getting this LE under control! $400.00 for an LE sleeve and $80.00 per massage session......I'm spent. Spent!!! I can't do both. What do I do? Wait for my new sleeve then continue with massage? Dx:2007, 2B, Triple+, June 2008:Lupron,Zometa,Tamox.Jan 2010:Poor metabolizer of Tamox switch to Femara.Feb 2010: cyp2d6 test reliable? Back to Tamox. Ooph soon. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751794",
      "Title": "Now what do I do? lexislove Binney4"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 15, 2010 08:47AM lexislove wrote: Im pre menopausal and on Lupron. My onc gave it to me for prevention of mets and to strngthen my bones to help prevent osteoperosis. Shana, For us early stage disease ladies, I think the recommendation is 3 yrs as mets prevention. I dont have osteoperosis, so Im not oz Zometa for life...who knows what the future has in store though. Although the whole OJ then scares me with Zometa, I dont really think about it being on it for the 3 yrs.....but...I would worry about OJ if I was to do more than 3yrs of Zometa.",
      "MessageIndex": 3,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746808",
      "Title": "3 yrs of Zometa.....Then What? lexislove lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 15, 2010 08:53AM - edited Jan 15, 2010 08:54AM by lexislove eek..lol Gee, will there ever come a day when I dont have to worry about some pill or injection?!!!! This whole cancer biz is a full time job..Im tellin you.",
      "MessageIndex": 5,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746808",
      "Title": "3 yrs of Zometa.....Then What? lexislove lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 18, 2010 09:33AM lexislove wrote: Update: I got my arm sleeve and glove. I hate the glove! I do not wear it. It just seems too tight. The arm sleeve....Im trying to remember to wear it as much as possible. I usually wear it at night for 4 to 5 hours before bed. Or when I work out. The thing is, Im a stay at home mom. Im constantly doing stuuf around the house, cleaning dishes a gazillion times a day...the sleeve just seems to get in the way! Maybe its my attitude? Probably is. I can wear gloves doing house chores/ dishes. Arg. <sigh> I dunno....Im still depressed...lol.",
      "MessageIndex": 35,
      "PostDate": "18/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747129",
      "Title": "Feeling a little Depressed...Mild Le. lexislove Suzybelle"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 28, 2010 12:14PM - edited Feb 28, 2010 12:15PM by lexislove I found it really...really hard to trust my body going through treatment (chemo/rads). It was months after finishing, and a few 3 month checks under my belt, that I started to \"trust\" my body. This doesnt't happen over night. It took me a good year to be honest. I still, 2.5 yrs out from diagnosis, have my moments. But they are less. And I dont freak out when I go for my checks now. Never thought I'd type that...but oh well...lol. It really is time...You probably read that time helps with a lot dealing with diagnosis ect. But it really does.",
      "MessageIndex": 1,
      "PostDate": "28/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/749072",
      "Title": "How Do You Learn To Trust Your Body Again pupfoster1 sweetnvmbr00"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Aug 3, 2009 10:40AM lexislove wrote: Hi all! I finished chemo Beginning of Feb 2008..continued with Herceptin untill Nov 2008. To this date my hair is about 6 inches. I thought I would have more by now. My hair growth speed really picked up after finishing Herceptin.Herceptin slowed it down, for me that is. My hair has grown back the same color, thank god! BUT......it came in curly. The curls have started to weigh down , but are still there. I have had extensions in my hair for almost 1 year, but I;m kind of scared what will be when I take them out. Before BC my hair wa staright and fine. Now...curly and thick.Ok...I'll take the thick but I have no idea how to tame curls. I hope I can learn from some of you.",
      "MessageIndex": 2997,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 4, 2009 05:44PM lexislove wrote: Ohh Wendy I'm sorry that you have been having a hard time. Im very glad to hear you are feeling better with the anti depressants.I'm on Effexor myself and it has helped so much, I wish I listened to my doctor earlier! Please continue to check in and let us know how you are doing...remember we are all in this with you! Take good care .Samantha",
      "MessageIndex": 6,
      "PostDate": "04/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/731904",
      "Title": "Just out of hospital wallan jdash"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 26, 2009 01:52PM lexislove wrote: Hi ladies..I haven't posted on this thread..but I have followed it. I have posted my hair pics in the Moving Beyond Cancer forum, thread titlled My \"NEW\" Hair...",
      "MessageIndex": 1708,
      "PostDate": "26/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 13, 2009 11:29AM lexislove wrote: YAY!!",
      "MessageIndex": 5,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/728980",
      "Title": "Still Ned roxy42 Rhonda1966"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Sep 30, 2009 02:51PM lexislove wrote: Pam..there is a whole Triple Neg board for all the TN sisters with treatment plans and lots of success stories. Being TN definatly means chemo and probably radiation. Your docs will moist likely throw everything at you. I know the feeling of wanting to be done with all this garbage...but there is a little bit more that has to be done for you to get well. Try to be patient and gentle with yourself, you will get there.",
      "MessageIndex": 4,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/741196",
      "Title": "What does negative hormone receptor mean Pamsbc mawhinney"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jul 26, 2009 12:50AM lexislove wrote: ShellyJo, good response to the chemo! There was a study done on SLN biopsies after neo adjuvant chemo to see if diagnosis is the same regarding lymph nodes for pre chemo and post chemo. The study concluded that a SLN biopsy performed AFTER chemo is just as accurate at deteriming lymph node status as if a SLN biopsy was performed pre chemo. So ...you must likely only had 1 lymph node involved. Remember the false positives for scans play into pre chemo scan as well.It is very...very..difficult for any scan to single out lymph nodes",
      "MessageIndex": 5,
      "PostDate": "26/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737919",
      "Title": "Neoadjuvant chemo Beth7 kae_md99"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "lexislove wrote: The title says it all. I noticed my right arm a bit larger than the other a few months ago. I finally decided to go to a registered lymphadema massage therapist. She is wonderful...but expensive. She went over my history, took some measurements and went over the do's and don'ts of lymphadema. I also went yesterday to get measured for a compression garment. Should be ready in 3-4 weeks. My lymphadema is only from the elbow down. My hand is swollen too as well as my index and middle finger. I will be getting a compression garment for my arm and then a glove for the hand. I have only been to 2 massage sessions so far, and after the massage my arm and hand is noticebly better. I will be continuing to go for massages 2x week for the next 4 weeks at least.. I dont know a lot about LE. Is it true, that I will always be like this for the rest of my life? Is there anyway to get rid of it? Ive read that weight loss can help, and Im hoping thats the case, since I have some exrtra pounds to loose. Ive also was told that swimming can really help. It just saddens me.....I thought I was slowly getting back to my pre BC self, now this. It makes me very self conscious..... Dx:2007, 2B, Triple+, June 2008:Lupron,Zometa,Tamox.Jan 2010:Poor metabolizer of Tamox switch to Femara.Feb 2010: cyp2d6 test reliable? Back to Tamox. Ooph soon. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747129",
      "Title": "Feeling a little Depressed...Mild Le. lexislove Suzybelle"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 21, 2010 06:45PM lexislove wrote: Thanks Binny, My next session is on Tuesday and we will be going over the bandaging ect. Im going to ask my husband to come along so he can learn to. I guess it would be awkward to do it myself at first. Im planning to do as much as I can possible to get this better so I dont have to spend so much money. Its $80 a session. Each session is 1 hour. That over $500.00 a month! Id rather spend $500.00 on something else, but oh well. At least my arm is aching today!..lol",
      "MessageIndex": 4,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747129",
      "Title": "Feeling a little Depressed...Mild Le. lexislove Suzybelle"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 21, 2010 09:27PM lexislove wrote: Kira, Thank you for your suggestions. Im willing to hear all. I myself, am a denatl hygienist. So Im wearing latex gloves ALL day. And when Im not wearing them, Im washing my hands...or on a break. SO Im thinking, how do I even wear a glove at work? Right now, it doesnt seem like an option. It would be more of an inconvenience that anything else. I originally planned to wear one to work, but now,its not looking like  it. I wont be returning back to work maybe for another year....Im hoping to have this under control by then. My LE is in my right arm/hand and thats my dominant hand! I clean, carry with this hand. Im constantly catching myself and trying to learn to do more things with my left arm now.",
      "MessageIndex": 15,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747129",
      "Title": "Feeling a little Depressed...Mild Le. lexislove Suzybelle"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "lexislove wrote: The title says it all. I noticed my right arm a bit larger than the other a few months ago. I finally decided to go to a registered lymphadema massage therapist. She is wonderful...but expensive. She went over my history, took some measurements and went over the do's and don'ts of lymphadema. I also went yesterday to get measured for a compression garment. Should be ready in 3-4 weeks. My lymphadema is only from the elbow down. My hand is swollen too as well as my index and middle finger. I will be getting a compression garment for my arm and then a glove for the hand. I have only been to 2 massage sessions so far, and after the massage my arm and hand is noticebly better. I will be continuing to go for massages 2x week for the next 4 weeks at least.. I dont know a lot about LE. Is it true, that I will always be like this for the rest of my life? Is there anyway to get rid of it? Ive read that weight loss can help, and Im hoping thats the case, since I have some exrtra pounds to loose. Ive also was told that swimming can really help. It just saddens me.....I thought I was slowly getting back to my pre BC self, now this. It makes me very self conscious..... Dx:2007, 2B, Triple+, June 2008:Lupron,Zometa,Tamox.Jan 2010:Poor metabolizer of Tamox switch to Femara.Feb 2010: cyp2d6 test reliable? Back to Tamox. Ooph soon. Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747129",
      "Title": "Feeling a little Depressed...Mild Le. lexislove Suzybelle"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "lexislove wrote: Hi ladies! Hope you dont mind me starting this thread on the Stage lll board, but it seems most Zometa discussions are on here...lol. I had my 4th Zometa infusion on Wednesday. I have only 2 more to go, July/10 & Jan/11, then Im done. I always mean to ask my onc, what next but have had other more important things to talk about recently. My questions to anyone is what have your oncs told you? I know Zometa has a long shelf life...10-15 yrs? But where is that data? the Austrian study that got the ball rolling regarding Zometa, will they be following these woman for another 5 yrs? Total 10 yrs observation. So as the thread topic says....3yrs Zometa.. Then What? Dx:2007, 2B, Triple+, June 2008:Lupron,Zometa,Tamox.Jan 2010:Poor metabolizer of Tamox switch to Femara.Feb 2010: cyp2d6 test reliable? Back to Tamox. Ooph soon. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746808",
      "Title": "3 yrs of Zometa.....Then What? lexislove lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 1, 2009 11:50PM lexislove wrote:",
      "MessageIndex": 2,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726638",
      "Title": "Hasd surgrery yesterday Baberjean Baberjean"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 15, 2010 04:57PM - edited Jan 15, 2010 04:58PM by lexislove I agree, the techs are so busy with their patients for the day, you are literally a number. Now, that I remember, I had a male tech maybe for 1 week out of the 5 weeks I was there. He was excellent! And he didnt have cold hands like the woman...lol. They are there to do their job, so you can get rid of this cancer. For me, it hasnt mattered male or female. Just as long as your qualified and know what you are doing. You'll do fine, and it will be over in no time. Be well.",
      "MessageIndex": 7,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/746776",
      "Title": "Does someone literally have to touch your breast every day?? Raili Sido"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 28, 2010 10:22PM - edited Apr 28, 2010 10:22PM by lexislove precioustime - I like that quote..... I hope I wasn't sounding pesimistic or a debbie downer either with my post earlier.  Yesterday,I got a call from a woman I did chemo and herceptin with and she told me.............that another woman we did treatment with has recurred and it's in her lungs,liver,bones. <sigh> I'm going back under my covers now.",
      "MessageIndex": 14,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/751931",
      "Title": "How Do you Find Hope Pure Bugs"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 23, 2009 07:33PM - edited Mar 23, 2009 07:35PM by lexislove At the beginning I wasn't sure about my onc. He is 38 and I always had this image in my head of an \"older\"doc. But after a few months, he kinda grew on me. Now...I think he is wonderful. He is very honest with me, and takes his time answering my questions. He is also very aggressive with treatments. He suggested Lupron and Zometa right away. I know 2 other girls my age and their onc's have them on Tamoxifen only and will not put them on to Zometa without more \"proof\" even though studies have said otherwise. One example of why I think he is so great: It was 2 weeks from after finishing my rads. I was freaked....crying everyday, scared. Oneday I got so freaked out that I made something in my head to beleive he was not \"telling me everything\". You see I was misdiagnosed by doctor dumba$$ so my trust in any doctor was nil. I called his receptionist crying, she asked if I could come down later that afternoon to see him. I said, \"are you kidding me I can't drive!\" she then said she'll get him to call me. He called me in 10 minutes , calmed me down and was very positive with my prognosis.  He actually said...\"you have to trust me,I don't know why you think you are going to die.\" I see you being an old lady in her Volkswagen.\" he also told me NOT to go searching on the net about stuff and only HE knows my diagnosis. So if I have any questions , ask him only.  I was sooo happy. And thanked him gratiously. Now..when I see him for my checks....we mostly talk about travelling. lol. Just how you feeling? Blah blah....I feel fortunate to have him as my onc.",
      "MessageIndex": 10,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/731187",
      "Title": "patient-doctor relationship: your thoughts and experiences paige-allyson KerryMac"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 23, 2009 10:57PM lexislove wrote: Awwww paige.. The first time I met my onc I was a complete basket case! I asked him how long left did I have!! I knew nothing about BC! Anxious...hell ya! Geeesh! Your husband finding the bloody gauze....fate. The fast that she ran the adjuvant thing and entered the wrong stats.... I mean was she entering your stats by memory? From what you wrote there was a 10% difference.....in a woman with BC thats HUGE. I'd be upset too. Bottom line, if you have that \"gut\" feeling  that your just not sure...best to seek out another onc. Maybe someone can recommend one for you.",
      "MessageIndex": 12,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/731187",
      "Title": "patient-doctor relationship: your thoughts and experiences paige-allyson KerryMac"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jul 26, 2009 08:49PM lexislove wrote: Lookin good! Bon Voyage, I'm sure you will return all fresh....I have heard from multiple BC survivors that after treatment vacation is a MUST. We are lucky to be able to do so..",
      "MessageIndex": 2,
      "PostDate": "26/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/737999",
      "Title": "One year from surgery... everyminute KerryMac"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 9, 2009 02:12AM lexislove wrote: I remember those hard days. I had many. Everything is too new right now...still. It really is time that helps. I was told that by woman and thhey were so right...time.",
      "MessageIndex": 9,
      "PostDate": "09/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/741760",
      "Title": "Hard Hard Day Pure WildRose"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 29, 2009 12:59AM lexislove wrote: To be completely honest with you.....it was hard most days to get out of bed. When I could walk it was for about 1/2 hour...but it wasn't at a \"burning\" pace. The steroids that you take during chemo to help with side effects are what makes you gain the weight. Some woman CAN exercise often on chemo or work even..but I was one who could not. I hope you'll be different!",
      "MessageIndex": 1,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/731557",
      "Title": "Exercise during chemo javagirl39 Bethie1"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jul 23, 2009 02:58PM lexislove wrote: I have never heard of just the TH.Is this new or in trials? You have a small tumor so it might be quite ok. The AC has a slightly high risk for heart problems later on, so if you already have heart issues ect or are older, I would advise to not do the AC. Why risk it ..when the TCH has the same benefit. AC is a powerfull combo that has been shown to be superior when treating Her2+ tumors but studies have shown that the TCH shows similar results. Ask about the TCH for 4 treatments or 6 at your next onc visit. Herceptin will be given every 3 weeks. Congrats on your path report..sounds good!",
      "MessageIndex": 2,
      "PostDate": "23/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737864",
      "Title": "Chemotherapy Treatment AC versus TH manue manue"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 11, 2010 06:09PM - edited Feb 11, 2010 07:00PM by lexislove NOT mean!!!!!.... Realistic.  Not all my received Pm's are nasty...I have had only 2 or 3. Can't please everyone, and I Dont expect to. Now....on another BC board? Thats a different story. lol....",
      "MessageIndex": 46,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748156",
      "Title": "RESPECTING the STAGE threads **RANT** cherneski Nico1012"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jun 13, 2009 05:16AM lexislove wrote: Yeahhhh!!!... Kick those stats to the curb! Go celebrate a little (or a lot)! ~0* Cheers,",
      "MessageIndex": 1,
      "PostDate": "13/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735777",
      "Title": "5 Years Remission of Stage 4!!! Denny123 dreamwriter"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 6, 2009 02:45PM lexislove wrote: Cindy I was exactly where you are now...only 2 years ago. Please believe me things will get better. This first part is the worst, but you will get your life back.I promise, its a long road but keep telling yourself all the treatment ect will be over one day. I promise. Come here for support or any questions. You might want to join a treatment group on the board when you start your chemo. You will be with other woman going through it the same time. Be gentle with yourself and get better.",
      "MessageIndex": 2,
      "PostDate": "06/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/741584",
      "Title": "\"its not good news\" littlebird75 badger"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 12, 2010 04:09PM lexislove wrote:",
      "MessageIndex": 77,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748156",
      "Title": "RESPECTING the STAGE threads **RANT** cherneski Nico1012"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 15, 2010 12:10PM - edited Apr 15, 2010 12:18PM by lexislove OMG. It's crazy to think that a pathology report could have mistakes...or be wrong! I'm so...so..glad your now in the clear. Good news about more arsenal in your fight. This is a good thing. Welcome to the Triple+ club!",
      "MessageIndex": 6,
      "PostDate": "15/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/751294",
      "Title": "I have a new diagnosis! geewhiz lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 15, 2010 12:21PM lexislove wrote: I was told that if one is PR+, anti hormones are still perscribed. So, your treatment wouldn't change.",
      "MessageIndex": 7,
      "PostDate": "15/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/751294",
      "Title": "I have a new diagnosis! geewhiz lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 15, 2010 09:05PM - edited Apr 15, 2010 09:15PM by lexislove Geewizz, Lupron is a form of ovarian supression. Im pre menopausal and my onc wants my ovaries supressed to lessen the amount of estrogen floating around. Plus, Tamox. Hey...since your ER+ now..... time to ask for Zometa!",
      "MessageIndex": 12,
      "PostDate": "15/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/751294",
      "Title": "I have a new diagnosis! geewhiz lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 6, 2010 12:08PM lexislove wrote: Im so sorry! The last 2 days in Vancouver, B.C. it has been +10!!!!!   Tulips are out in my parents yard!",
      "MessageIndex": 12,
      "PostDate": "06/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747919",
      "Title": "Notice to all Canadians and New Englanders weesa Claire_in_Seattle"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 15, 2010 04:35PM - edited Jan 15, 2010 04:40PM by lexislove Your breasts are exposed......you lie on your back. Your knees are usually supported. I was comfortable. My techs were female , they did not touch my breasts, they did have to shift me around time to time, to make sure your lined up correctly. You hold really still and....then......ZAP! You done.",
      "MessageIndex": 5,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/746776",
      "Title": "Does someone literally have to touch your breast every day?? Raili Sido"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 21, 2009 03:47AM lexislove wrote: Jessica, You are doing the right thing by getting it checked. Please keep us updated.",
      "MessageIndex": 2,
      "PostDate": "21/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731072",
      "Title": "Found Large Lump - bit scared JessicaK JessicaK"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 21, 2009 06:42AM lexislove wrote: Jessica.. You are so right! With a high risk of ovarian cancer in your family you are best to get a second opinion. Scream and stomp your feet to get someone to take you seriously! Don't let them tell you \" your too young\". Thats what happened to me at 29. Well... you can figure out the end of the story...",
      "MessageIndex": 6,
      "PostDate": "21/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731072",
      "Title": "Found Large Lump - bit scared JessicaK JessicaK"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 6, 2009 08:18PM lexislove wrote: Mine grew really..really..fast. I was Her2 + so that may explaine why.",
      "MessageIndex": 99,
      "PostDate": "06/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727180",
      "Title": "Just diagnosed 3 months after giving birth to my second child kelty kelty"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 28, 2010 05:10PM lexislove wrote: Yes....fills after rads were not nice. My first fill before rads...I had 250 cc's done. I was a little sore the first day but a  Tylenol helped. After rads.....50 cc's and for 3-4 days I was wining and complaining. thats another reason why I took 22 months befor my exchange surgery...the fill appointments I did not enjoy. I just sucked it up and got to my 400 cc's which my PS told me would make me a full C cup. Done...finished. then took a break from hospitals ect. I also had a lift and reduction on my left breast to match. So...so much better than my previous D cup. All my clothes fit nicer and the breasts sit nice and high.",
      "MessageIndex": 11,
      "PostDate": "28/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748985",
      "Title": "Has Anyone Heard this? Pure concernedsis"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 28, 2010 04:22PM lexislove wrote: I have faith....not hope. Do I wish to see a cure for BC? Of course. Do I think it will be happening soon......no. I am realistic. I live each day...in the day. I don't think of next week, next year. I do plan though or I think of what I would like to be doing. what your thinking or feeling, is normal. The end of treatment stage. I won't lie, it was horrible for me. I took things day by day.......literally. I just had a massive recurrence scare April 1st, turned out to be B9 and I'm still trying to put it past me.Right now? I'm living under the covers.",
      "MessageIndex": 4,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/751931",
      "Title": "How Do you Find Hope Pure Bugs"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 23, 2009 01:50PM lexislove wrote: Yeah!!!!! So happy for you...enjoy your day! Like Stephanie says...\"god IS able!\"",
      "MessageIndex": 20,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732882",
      "Title": "Repeat Brain MRI on Thursday DianaT VickiG"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 8, 2010 12:45PM - edited Jan 8, 2010 12:46PM by lexislove Hi Aimee, I was diagnosed back in Sep 2007. I finished everything you have and will be having my reconstruction surgery on the 21st of this month. Its been over 2 yrs and Im STILL dealing with the this BS disease in some way or another. After my sugery, I will then be discussing having the removal of my ovaries to help prevent this BS disease form resurfacing again. Im sick of all the decisons. I do wish that my onc had a crystal ball to tell me what to do or not to do. I just want to finally be able to leave everything behind and really move foward. It does seem impossible at times doesnt it? Good luck on your surgery.",
      "MessageIndex": 1,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746463",
      "Title": "im out of hiding Aim4th Aim4th"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 11, 2010 06:08AM - edited Jan 11, 2010 06:23AM by lexislove Kerry is right, Going through treatment and a few weeks after treatment.....I had waaaaaay more bad days than good. What helped was basically getting back to my normal activities. At the time it was taking my 3 yr old to the park, grocery shopping, house duties, getting out with friends for lunch. Getting back to a normal helped me feel positive. As the time moves on, those bad days are less.  I have now anxiety days, going for a mammogram, onc check ups. But those come few, and when they are over I dont even think about them. I look forward, not back. I have done all treatment to date. I have been aggressive. Chemo,mastectomy,rads,Herceptin,Lupron,Zometa, Tamox and will be switching to an AI. I have to feel confident that I will be ok. The odds are in my favor....yours too.",
      "MessageIndex": 6,
      "PostDate": "11/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746594",
      "Title": "How do you keep positive? Readyforliving Diana63"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jul 26, 2009 08:54PM lexislove wrote: LOL...thats a good sign!!!  The top of my hair seems to be the shortest comparing to the rest. I like the short do BTW...suits ya.",
      "MessageIndex": 4,
      "PostDate": "26/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/737999",
      "Title": "One year from surgery... everyminute KerryMac"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 27, 2009 01:34AM lexislove wrote: Hi there! Reading your post brought me back over 2 yrs ago. I know the fear. Please dont freak out because the size of your tumor. Mine was 8cm and I did neo adjuvant chemo too. It shrunk to about 1.3cm by 1.3cm. With DCIS present. My onc was very pleased at the response and at surgery my surgeon was able to get clear margins. I cried to my onc about the size of my tumor and these were his words: Its not really the size of the tumor thats important, its how well you respond to the treatment and what they find at the time of your surgery (clear margins,lymph nodes clear). I was Her2+ too. And Her2 disease responds really,really well to chemo. You will also be having Herceptin and that is probably the most important thing for you to do. The beginning is the worse. But you will get to a point where you will just be focussed on treatment and being healthy again. I am almost 28 months out from diagnosis and 2 yrs out from finishing chemo and surgery. My life is back. My energy is back. I feel strong and healthy again. You will be there too.Promise. If you have questions just ask.",
      "MessageIndex": 18,
      "PostDate": "27/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/745862",
      "Title": "Just diadnosed and petrified SPoole Frankie_"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 14, 2009 06:11PM - edited Nov 14, 2009 06:12PM by lexislove I am 2 yrs out and still have pains! Are you on Tamoxifen or ovarian supression? side effects from those are hip / pelvic pains. I have those too....exercise has helped. Edit: I just re read you post..you have had an ooph. So an AI most likely is the culprit.",
      "MessageIndex": 6,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743859",
      "Title": "Body Pains, etc. fighting4mykids Binney4"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 10, 2009 07:29AM lexislove wrote: Congrats!",
      "MessageIndex": 7,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745172",
      "Title": "almost DONE! Christine2000 Gitane"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Aug 4, 2009 09:28PM lexislove wrote: No bra here. and I wore no bra for about 2-3 weeks AFTER rads untill my skin settled. Maybe a loose fighting sports bra, cotton to help if you are going out. If I was just at home or running erands I just wore over sized t shirts.",
      "MessageIndex": 8,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738026",
      "Title": "no bra during radiation Cherie5 Leah_S"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 25, 2010 12:38AM lexislove wrote: Im sorry to hear this news. She was one of the first to answer my posts. I hope she is comfortable and at peace.",
      "MessageIndex": 15,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748885",
      "Title": "BadBoob67 is in Hospice Now :( LuAnnH Danie"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 9, 2009 04:33PM lexislove wrote: Hi there, first I'm sorry about what your wife is going through, been there. I'm 31 now and had my mastectomy when I was 30. Married with a 2 year old. Before surgery I was planning for my relatives help...but I did not need it. the recovery was well for me. when the drains were out even better. I have left the healthy breast for now as I am wrestling with the idea of removing that one as well. I have just finished all treatment and I need a break from surgerys ect. I will be doing me expander/ implant exchange Fall 2009. I must admitt though, for MYSELF, removing the breast was a no brainer. You can see my stats below, I had a large tumor initially no nodes. Mastectomy was the only real option. Even if my tumor was a quarter of the size that it was, I still would have opted for the mastectomy. Just my opinion. Good luck with your decision!",
      "MessageIndex": 8,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727067",
      "Title": "Masectomy vs Lumpectomy Decision BTG koshka1"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 19, 2009 12:53PM lexislove wrote: psc, I am on a no car / low carb diet to loose some extra pound Although mangos and bananas have ecellent nutritional value...they are mega high in sugar. I love them! Any tropical fruit is. The fruits that are very low on the sugar factor are: strawberries, rubabarb, cantaloup, aplles and pears. These I am allowed to eat. I have NOT given up my blueberries though.",
      "MessageIndex": 34,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732090",
      "Title": "BC - Should you avoid dairy and sugar??? np312 debisongbird"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 19, 2009 12:56PM lexislove wrote: Kerrymac, I want summer here for FRESH blueberries! It's not the same adding frozen bluberries to your cereal ...evrything turns blue. I read in Helath Magazine, the one that is put out by Readers Digest, it's wonderful by the way, I highly recommend it! That medication should not be taken with grapefruit,orange juice. They said it DOES interfere with the meds. I don't have that mag anymore, I recycled them last week. But you can maybe check their websit for previous articles. They recommend water only.",
      "MessageIndex": 35,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732090",
      "Title": "BC - Should you avoid dairy and sugar??? np312 debisongbird"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 19, 2009 01:23PM lexislove wrote: KerryMac, I'm in B.C. so we have massive Blueberrie farms, you can buy flats of them for $5 ! I ususally buy them and bag and freeze. My husband goes into our frezzer to take out his steak and gets so frustrated because all he sees is bags and bags of blueberries..lmao",
      "MessageIndex": 41,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732090",
      "Title": "BC - Should you avoid dairy and sugar??? np312 debisongbird"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 15, 2009 09:51PM - edited Feb 15, 2009 10:38PM by lexislove",
      "MessageIndex": 5,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 11, 2010 04:40PM lexislove wrote: Elaine, I think you brought up a good point as well. I think its good to be positive, but I find it unfair to offer reassurance to anyone that they are going to live to 100. Positive yes...it gets us through our days....reassurance no. Cancer or no cancer, noone is guranteed tomorrow. Hit by a bus thing apply's here...lol. Great thread...if I already haven't mentioned. Heres my rant.....people who pm me because they don't like what I have to say or Im too blunt. I'm a realist and by sticking around this board for over 2 yr now you see the real deal. Carry on ranting.....",
      "MessageIndex": 44,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748156",
      "Title": "RESPECTING the STAGE threads **RANT** cherneski Nico1012"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 12, 2010 03:55PM lexislove wrote: I do the same...I hit Active topics and scroll down. If I see a topic that interests me, I click...take a looksie. Sometimes I pass because I have nothing to contribute or I pass because I cant think off what to say at the time (chemo brain). Or I'll post. I understand about the \"stages\". But...telling someone that they can not post on the stage 3 board because they are Ms. Stage 1 ( still laughing over than one Kerry...lol) is not right. People just need some common sense when posting! But I guess, not all of us have it. I do not think a stage 1 girl should be advising a stage 3 girl about treatment plans or a mastectomy vs a lumpectomy. NO! Unless, they know their \"stuff\". Or a stage 1 lady offering her reasoning why she did not take anti hormone meds to a stage 3 lady. Ummm hello?!!!!!",
      "MessageIndex": 74,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748156",
      "Title": "RESPECTING the STAGE threads **RANT** cherneski Nico1012"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 12, 2010 05:36PM lexislove wrote: Oh Diana... Ive been called a troll too, elsewhere though...its pretty funny. Ho hum....",
      "MessageIndex": 84,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748156",
      "Title": "RESPECTING the STAGE threads **RANT** cherneski Nico1012"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 18, 2009 01:17AM lexislove wrote: I hope tomorrow is a better day..... sorry about all the mental stress, it sucks.",
      "MessageIndex": 1,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/744099",
      "Title": "Totally Cr*pped Off!!! SandyAust SandyAust"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 12, 2010 10:23PM lexislove wrote: I did Taxol with Herceptin as well. My legs were like Jello. Very weak. It was awfull, especially that my legs were one of my strongest parts.. I just walked...and walked. As much as I could do at a time, but I made sure it was daily. It got better! But now...Im stiff because of the Lupron and Tamox...lol. At least its not Jello(y)",
      "MessageIndex": 7,
      "PostDate": "12/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/749665",
      "Title": "Taxotere 'Legs' Marie45 lovetosail"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 20, 2009 01:00PM lexislove wrote: Don't quote me Judy ...but I think the death rate you are talking about are those woman diagnosed prior to 2008 but HAVE died in 2008. So we don't know age, other health problems, if there cancer had returned and metastized or if they died of other causes. Maybe I'm wrong or half right but it makes sense to me. Hopefully soeone else can help answer your question...",
      "MessageIndex": 1,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/729428",
      "Title": "Confused about the statistics? JudyO Texas357"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 9, 2009 06:54PM lexislove wrote: LOL...YES!!! It's all the woman. I have not noticed this with men. I have had a run in with two of my husbands friends wives. They ask how am I doin? Or are you ok now? Bla blah....and then I notice them taking a \"peek\". It irritated me so much that I asked them if I can ehlp them with something. They obviously get embarassed..but I think its curiosity on there part. I don't think they mean harm....but some people just have no manners....or lack of empathy.",
      "MessageIndex": 1,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730423",
      "Title": "staring friends idaho 2new1s"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 21, 2009 01:27PM lexislove wrote: You are staged before chemo. They go by the original tumor size......I WISH they went by after chemo,lol",
      "MessageIndex": 1,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742521",
      "Title": "Staging lamuso lamuso"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 21, 2009 08:29PM lexislove wrote: Glad you back on the boards Diana I'm definatly praying for you! Have been from the beginning. I don't want to say, \"try not to stress out.\" Because that is simply not possible. Maybe try to take your mind off it. Go for a walk or call up a friend and talk about whats going on in their life. Have some tea and a nice relaxing soak so you can get a good nights rest.",
      "MessageIndex": 1,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732882",
      "Title": "Repeat Brain MRI on Thursday DianaT VickiG"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 7, 2009 03:19PM lexislove wrote: Hi Ladies! Im not new to the board I mostly offered support and posted on the stage 3 forum. You can see my diagnosis below in my signature. I hope that I can fit in here....god forbid another forum has to be created for woman \"like me\". Anyways....Im stage 2B......very large tumor but no nodes. I was diagnosed at 30 and am now 32 and have my life back. It has been over 2 years now since I heard those words,\"its malignant.\" I never thought I would be here today.....but I am so glad that I am. Welcome everyone!",
      "MessageIndex": 48,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 30, 2008 11:43AM lexislove wrote: For some reason the whole Christina diagnosis just erks me. Especially her comment, \" I'm 100% cured. I definatly won't be dying of breast cancer\" Positive attitude is great and all but....when I listened to her and that comment I felt like ringing her neck.I screamed at the TV \" educate yourself you \" bleep\" ! I had just finished treatment, Port in, ACT X 8 chemo, mastectomy, 28 rads, 52 weeks of Herceptin and I still have Tamox, Lupron and Zometa. I have been at war physically, but mostly emotionally. Christina a hero? I think NOT. There are more woman on these boards that are heros in my opinion than she'll ever be. Sorry , just had to rant",
      "MessageIndex": 16,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725120",
      "Title": "Christina Applegate and radiation tomatojuice deadlanguages"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 6, 2010 04:55PM lexislove wrote: I just saw a guy walk past my window in shorts and flip flops! ha! Seriously, I only had to wear my winter coat for maybe 5 days this winter so far. Usually a hoodie is fine, and even then....im warming up.",
      "MessageIndex": 25,
      "PostDate": "06/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747919",
      "Title": "Notice to all Canadians and New Englanders weesa Claire_in_Seattle"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 30, 2009 10:45PM lexislove wrote: Elaine, The is a whole Her2 forum on these boards...just scroll down the forums list to find. We are similar to diagnosis, only Im ER+ and my tumor was larger, 8cm. Both my onc and surgeon are optimistic about my future. Your onc would be the one to listen to regarding your breast cancer. And yes...Her2 disease is most likely to recur in the first 2-3 years....after 3 years recurrence rates drop quite considerably.",
      "MessageIndex": 21,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/695351",
      "Title": "Stage III 010407 DCMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 16, 2009 08:39AM lexislove wrote: I did rads myself. I had a huge tumor but no nodes. Because of my age and tumor size the they recommended rads. Radiation is completely doable, and if it gives you that extra advantage why not? ( Unless you have other health conditions that makes you not a candidate for rads ) I say hit it big now, so you can have that piece of mind knowing you have done absoloutley EVERYTHING. Instead of not doing rads and then living with the \" what if I did, should I have\". I never knew that there was an option of rads or not with 1 lymph node involved.",
      "MessageIndex": 9,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/727405",
      "Title": "Help, Metastatic Carcinoma found in axilla Rusty123 HensonChi"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 29, 2009 10:06AM lexislove wrote: My condolences to all that knew her on the boards and IRL.....RIP.",
      "MessageIndex": 17,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742956",
      "Title": "Stephanie is an Angel 2timer Britt"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 21, 2009 12:28PM lexislove wrote: When you hit the 5 year mark.....you chances of recurrence drop...they don't go up. There will always be that chance BUT...the odds are highly in your favor. Just like that MD Anderson study KerryMac refererred to........after 5 years Stage 3 has a  13% recurrence rate or 87% it WON' t recur. I think those are excellent stats.",
      "MessageIndex": 20,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/729428",
      "Title": "Confused about the statistics? JudyO Texas357"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 20, 2009 06:47PM - edited Feb 20, 2009 06:59PM by lexislove",
      "MessageIndex": 7,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/729428",
      "Title": "Confused about the statistics? JudyO Texas357"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 20, 2009 07:03PM lexislove wrote: I like what this says: http://cancer-types.suite101.com/article.cfm/breast_cancer_survival_rates",
      "MessageIndex": 8,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/729428",
      "Title": "Confused about the statistics? JudyO Texas357"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 7, 2009 07:02PM lexislove wrote: I avoid dairy because of the hormones ect....the sugar thing I have heard it DOES feed cancer cells....but I then asked all my docs and they said NO. So who really knows...I avoid it just to watch my waistline..*sigh*",
      "MessageIndex": 3,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732090",
      "Title": "BC - Should you avoid dairy and sugar??? np312 debisongbird"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 9, 2009 05:30PM lexislove wrote: Fruit Roll Ups....they are packed with suger unless you buy the natural ones. And they cost a bunch.",
      "MessageIndex": 15,
      "PostDate": "09/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732090",
      "Title": "BC - Should you avoid dairy and sugar??? np312 debisongbird"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 19, 2009 01:07PM lexislove wrote: Roxanne...I will not give up my coffee !!!!. Take away my mangos...but leave my damn coffee alone!  So I guess a little sugar is ok..",
      "MessageIndex": 37,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732090",
      "Title": "BC - Should you avoid dairy and sugar??? np312 debisongbird"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 22, 2009 11:58AM lexislove wrote: I did Taxol totall of 4 infusions, every 3 weeks (Taxol x4). I found my body was more lethargic and my bones ached. The bones only ached for 4-5 days after the infusion, then gone. Since you are having the infusion more often..it might be different. Anyways, Taxol seems to be the most tolerable for woman regarding side effects. Its better than AC or FEC thats for sure. Your on the home stretch....keep movin forward.",
      "MessageIndex": 4,
      "PostDate": "22/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744334",
      "Title": "Baby and Taxol Pure lkc"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Aug 7, 2009 11:44PM - edited Aug 8, 2009 12:37AM by lexislove Midlife crisis, thats a cop out.....Ppppfffttttt.... NEXT!",
      "MessageIndex": 7,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738612",
      "Title": "I Am Getting Divorced Heidi521 wallan"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Aug 8, 2009 12:09PM lexislove wrote: Okay...maybe I just don't get it. . So ladies here help me understand....midlife crisis. What exactly does that mean..from a husband standpoint. I always thought it was justa  quircky saying.. All these stories of divorces with woman in their 40's..kids..ect. Why does it happen at this time? My husband will be 39 this February, I just turned 32....whhat do I need to know!..lol.",
      "MessageIndex": 17,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738612",
      "Title": "I Am Getting Divorced Heidi521 wallan"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 19, 2009 08:28PM - edited Dec 19, 2009 08:33PM by lexislove Fabulous!!! Gabrielle, I see that you had Herceptin. it would be great if you posted your story on the Her2 forum as well. I love story's like this!",
      "MessageIndex": 2,
      "PostDate": "19/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745637",
      "Title": "10 years ago at Christmas.... Gabrielle Mimidi"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 12, 2009 09:09PM lexislove wrote: diamondGurl, I have only had one removed but I am thinking about removing the \"healthy\" breast as well. You will find ALOT of woman, mostly younger woman opt to remove both breasts even though the cancer is in just one. regardless of the BRCA gene. Hope you are well!",
      "MessageIndex": 1,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/728992",
      "Title": "Bilateral Mastectomy DiamondGurl Superwoman808"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 29, 2009 05:38PM lexislove wrote: My daughter was 2 when I was diagnosed. My husband and I just told her momma had a \"boo boo.\" She is now 4 and remembers nothing. I like to keep things this way untill she is old enough, early teens, to understand more about this disease and her risks.",
      "MessageIndex": 10,
      "PostDate": "29/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744671",
      "Title": "Feeling Guilty Pure Mantra"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 7, 2009 12:31PM lexislove wrote: I think they would go ahead with radiation to clear it all up!  If your ER+ you will take Tamoxifen or an AI depending on your hormone status. Your onc is the best person to talk with about this. He might....might want more chemo. Hang in there. there might be some more woman around who have been in a similar situation! Good luck.",
      "MessageIndex": 1,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732084",
      "Title": "PATHOLOGY RESULTS scarlett444 lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 8, 2010 12:22PM lexislove wrote: Pure, I had the same worries, Im sure we all have at some point. But, like mary said, you have to believe the treatment has worked.......and leave it. This is what I did, I wrote down on a piece of paper everything I did and am doing. Chemo,Mastectomy, rads, Herceptin, OS/Tamox and Zometa. Now an ooph... I then also put beside the % beside each that helps reduce my recurrence rate. I then put it up on my fridge. Yes, the fridge. Everytime I had doubt or was scared I looked at that paper. Its funny Im talking about this, I had my paper up on my fridge for 2 yrs. I looked at it many times....but Saturday I started my spring cleaning and threw it out. My fridge was cluttered with my daughters preschool art work and I asked myself. \" do you still NEED this? wouldn't having another of Lexi's art work look nicer on the fridge?\"  YES! My point being, I did then, what I had to do to get through tough times. Those times are gone, well not completely Im just more confident in my treatment and prognosis now. Be well.",
      "MessageIndex": 6,
      "PostDate": "08/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747995",
      "Title": "Did I Do Everything I Could? Pure karen1956"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 5, 2009 02:17PM lexislove wrote: Rads may not be needed...but surgery definatly. Some woman are able to have a lumpectomy after neoadjuvant chemo. Also...scans are not all that reliable.Just ask a few woman on here who have done the neo adjuvant route. The surgery is the time when the docs know for sure just how well the chemo worked.",
      "MessageIndex": 3,
      "PostDate": "05/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743301",
      "Title": "Neoadjudvant Chemo no surgery needed precioustime mumito"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 2, 2009 03:29AM lexislove wrote:",
      "MessageIndex": 22,
      "PostDate": "02/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743301",
      "Title": "Neoadjudvant Chemo no surgery needed precioustime mumito"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 27, 2009 07:37PM lexislove wrote: I didnt know you were already on the Effexor. I think an increase would be good. Talk to your doc, try it out. Most woman take the 37 1/2 just to start out......docs then increase. Some woman take 150mg...I was good with the 75. I tried ...tried to let things work out for themselves. But nothing was helping, not even shopping!!! I was at my GP one day, not related to BC, and she simply just asked \"hows it going?\" I lost it.....I was crying and all my fears came out to her. she told me that she wished I mentioned to her sooner about my fears and anxiety.She also said that I DID NOT have to be going through such emotional hell. Thats when I started the Effexor. again, it was the best thing I could have done for myself at that time.",
      "MessageIndex": 15,
      "PostDate": "27/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742851",
      "Title": "THE REALITY OF IT ALL Shanagirl Pure"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 1, 2009 11:52AM lexislove wrote: My scalp was really itchy right before the hair clumps came a comin'....don't worry, the chemo is working, your hair WILL come out..lol. We are all so very different. I bet by Monday its gone.",
      "MessageIndex": 12,
      "PostDate": "01/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/741153",
      "Title": "My hair is not following out Pure carol1949"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 7, 2009 10:31PM lexislove wrote: I just wanted to clarify, that I not once have never made any statement like \" thank god my nodes were negative!\" or around those lines.  For the first 6 months of my diagnosis my docs, and I, expected positive lymph nodes due to my tumor size. I was doing neo adjuvant chemo. My onc said I had a 10% chance of my nodes being negative. He said he had seen cases with large breast tumors before and no nodes.....but the majority of the time they are positive. I came on the boards and saw all these little 1cm tumors no nodes blah blah...and felt like crap.  Well....I fell in that 10% of being node negative. Luck? Maybe I dunno. My point is I know how those \"thank god\" statements sting. And I don't feel any better off than a woman with 1 or more positive nodes. I know how this disease can be unpredictable and sneaky. there are no gurantees. My BC was aggressive end of discussion. Im glad this forum has been started.",
      "MessageIndex": 63,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 27, 2009 12:05AM lexislove wrote: I ate like crazy! I'm not sure if the amount can be reduced. But I can tell you one thing is to take it. I missed one day and paid for it. even if she has no or minimal sideeffects the docs still recommend to use it. I also found that the steroid drugs caused me extreme insomnia,",
      "MessageIndex": 2,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729831",
      "Title": "Dexamethasone Husband11 Vavoom10"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Aug 8, 2009 12:36AM lexislove wrote:",
      "MessageIndex": 10,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738612",
      "Title": "I Am Getting Divorced Heidi521 wallan"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Aug 8, 2009 12:25PM lexislove wrote: hmmmm.. Can woman have midlife crisis? Does it happen? I completely understand the growing thing. Especially since having my daughter, and shes only 4 coming up!! I have changed..but it has been gradually and I accept change. To be honest, my husband has grown up in a different \"culture\" than the North american.I don't know if that is a good or bad thing. He does not believe in divorce. But there are certain things..that drive me crazy because he has very \"old school\" Eastern European views. Midlife crisis, is basically unheard of with his friends. Yes..Heidi does have the right attitude!!",
      "MessageIndex": 19,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738612",
      "Title": "I Am Getting Divorced Heidi521 wallan"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 21, 2009 11:12AM - edited Apr 21, 2009 11:13AM by lexislove naomib04.. There is also another site that is for young woman with a TON of info. Lots of girls in their twenty's who have been diagnosed too. The Young Survivivors Coalition. www.youngsurvival.org Please check them out too! I was 30 when I was diagnosed...I know how you are feeling",
      "MessageIndex": 5,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732838",
      "Title": "Breast Cancer at 26 naomib04 naomib04"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 21, 2009 12:06PM lexislove wrote: I know on the Young survivors website...there was a thread an a woman posted an excellent list of \"what to ask your doctor\"",
      "MessageIndex": 7,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732838",
      "Title": "Breast Cancer at 26 naomib04 naomib04"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 4, 2009 12:59AM lexislove wrote:",
      "MessageIndex": 13,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/733575",
      "Title": "breast cancer didn't win today everyminute everyminute"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 13, 2009 11:21AM lexislove wrote: I was diagnosed at 30, married and my little girl just turned 2. For me, I knew that this journey was going to be harder emotionally than physically. If I can make it....anyone can. YOU WILL GET THROUGH ALL THIS. * take care*",
      "MessageIndex": 8,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727180",
      "Title": "Just diagnosed 3 months after giving birth to my second child kelty kelty"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 13, 2009 05:44PM lexislove wrote: bre, I love stories like that. Thanks",
      "MessageIndex": 10,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727180",
      "Title": "Just diagnosed 3 months after giving birth to my second child kelty kelty"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 18, 2009 04:16AM lexislove wrote:",
      "MessageIndex": 28,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727180",
      "Title": "Just diagnosed 3 months after giving birth to my second child kelty kelty"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 6, 2009 05:06PM lexislove wrote: It's ok to post here!!! Welcome! I'm glad you are getting a biopsy on Friday. I discovered my lump by accident. I had an itch.I went to the doctor and he said I was too you,29, and to \"keep an eye on it\". It was on the outside of my breast too. That was January 2007 and by August it was bigger than a lemon. Ultrasound said it was about 8cm! My lump was hard and not mobile, it did not hurt, but by the end just before diagnosis, it had a dull pain. My daughter was 1.5 years old. I was not nursing her. It seems that a lot of young woman are diagnosed during their pregnancy or within 4 years of being pregnant or giving birth. Let us know how you do? Did you have a mammogram?",
      "MessageIndex": 97,
      "PostDate": "06/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727180",
      "Title": "Just diagnosed 3 months after giving birth to my second child kelty kelty"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 16, 2009 03:30PM lexislove wrote: I think it means that the tech could \"feel\" something, by touch.",
      "MessageIndex": 1,
      "PostDate": "16/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732604",
      "Title": "What does palp mean? Smitten Smitten"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 17, 2009 05:08PM lexislove wrote: idaho is right. If this was me....the only trip I would be booking now, is a trip to the hospital for surgery.",
      "MessageIndex": 2,
      "PostDate": "17/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732653",
      "Title": "Just diagnosed, should she take a trip? ebby ebby"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 30, 2009 04:07PM - edited Mar 30, 2009 04:10PM by lexislove thisisme... Did you do ALL of your chemo before surgery? some woman do half before and half afterwards. You onc may suggest more chemo. I know you must be in shock...but your not the only woman here who had pre surgery scans that said such and such...and the final report said otherwise. Scans can not be too reliable sometimes. Are you ER+ or Her2+? There are many woman suriving BC with multiple nodes involved..I'm sure you will be hearing from them shortly. Hang in there...Hugs",
      "MessageIndex": 1,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/731654",
      "Title": "Path report need suppor- Prognosis stats mentioned in post thisisme nelia48"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 25, 2010 10:03AM lexislove wrote: Im 2 yrs past chemo....and I still have post chemo isuues. I did refer to it as \"chemo brain\", but after having a conversation with my onc about concentration ect..ect...he said its most likely due to lack of estrogen (Lupron) now. Things are a bit better than say 1 year ago, but I am more forgetful. I have to write everything down. I use to be such a multitasker...not anymore. New normal I guess?",
      "MessageIndex": 1,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748888",
      "Title": "chemo brain? kimber3006 Mandy1313"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 25, 2010 01:59PM lexislove wrote: Im constantly freaking out about remembering to turn off the stove. One morning I was doing some baking. I was also trying to get my 4 yr old ready for pre school and doing 10 other things at least...lol. Whatever I was baking was finished. I took out of the oven and turned the oven OFF. Then I headed out the door to start my erands. I was 20 minutes away from the house....then I froze. Omg...did I turn off the oven?! I retracked all my last moves before heading out the door....but I still wasn't sure. I actually turned the car around and went home. My daughter was late...I was flustered and panicking...and the oven was OFF.",
      "MessageIndex": 10,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748888",
      "Title": "chemo brain? kimber3006 Mandy1313"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jun 12, 2009 03:17PM lexislove wrote: Gma: I just wanted to add to the horoscope thing. When I was first diagnosed we ordered chinese food. We had 6 fortune cookies, the one I picked read: You will have a carefree life once again. I keep that in my wallet.",
      "MessageIndex": 12,
      "PostDate": "12/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/735735",
      "Title": "Need to Talk GmaToni GmaToni"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 2, 2009 11:06AM lexislove wrote: I worry too. My daughter is only 3. I was diagnosed at 30...so I guess she will have to start mammograms at age 20. I sometimes feel so guilty, that she will have to worry and might be in fear. I hope she doesn't blame me for anything. My only hope is that there will be some vacine for prevention or even a CURE! My plan is to make sure she can live a healthy active lifestyle to help prevent anything. I have no BC in my family either.",
      "MessageIndex": 2,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/731797",
      "Title": "What's in store for our young daughters? pinkshortcake Carolina59"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 19, 2009 12:25PM lexislove wrote: Ive been on it for 16 months now. I DO have bone diascomfort ect, especially my hips and pelvic area. Im also on Tamoxifen which can also cause these side effects. But what do you do right? Bone pain or have my cancer come back....bone pain...cancer back. I'll take the bone pain.",
      "MessageIndex": 3,
      "PostDate": "19/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742375",
      "Title": "nervous young mom suthrnatheart Lauren3"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 19, 2009 12:36PM lexislove wrote: Of course its scary!!! I was misdiagnosed, my old doc told me to keep an eye on my cyst. Well....8 months later we know what happened. Let us know what happens! Be well.",
      "MessageIndex": 5,
      "PostDate": "19/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742375",
      "Title": "nervous young mom suthrnatheart Lauren3"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 1, 2009 07:29PM lexislove wrote: mamayave, I think every onc is different. Mine does not do them either...but when I think about it, I'm ok with it. Too much anxiety with scans and I have had enough radiation in the last 1.5 years.",
      "MessageIndex": 37,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730099",
      "Title": "What's your opinion on post-treatment tests staceyshusband bettysgirl"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 27, 2009 03:55PM lexislove wrote: I think thats a great idea!",
      "MessageIndex": 1,
      "PostDate": "27/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 11, 2010 04:33PM lexislove wrote: I do know that it is common to still have positive nodes AFTER neo adjuvant chemo. There are many woman here that has had that happen. Why? there is a theory that the chemo works better on bulk tumors (the main tumor). This doesnt mean that the chemo won't work for you. The Taxol maybe the chemo that clears things up. Look at it this way, your tumor responded to the AC and has shrunk. Its better than if it didnt respond or grew. Your at the half way mark still got more chemo to do...nothings definitive till you have had surgery and have your pathology report. Scans are not too reliable either right now. Its hard for scan to pick up single nodes...and to give an exact explanation to what is actually going on. The wait is hard...I know. I had neo adjuvant too. But...really you have to wait till pathology to find out for sure. One thing though...chemo works excelllent on TN tumors. Better than Er+. Dont give up yet!",
      "MessageIndex": 1,
      "PostDate": "11/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/749646",
      "Title": "AC did not work on lymph node becky1 elena58"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 27, 2009 07:49PM lexislove wrote: Dx at 30. Large tumor no nodes. BUT I found my lump at 29. Doctor dismissed it...........nedless to say I DISMISSED HIM!",
      "MessageIndex": 146,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 29, 2009 11:41PM lexislove wrote: Hi there. Im sorry about your struggles. What a tough situation to be in. What chemo cocktails have you done so far? Are you able to try a different combo? Im looking at your stats and you are ER- so anti hormone meds are not an option. It is a good thing that you are Her2+, so you can have the Herceptin. Most woman get through Herceptin much...much easier. Herceptin is probably THE most important.....BUT....as you are aware, your breast cancer is really advanced and needs as much as possible to beat it. I would maybe ask about some other chemos...maybe they would be easier to tolerate? I hope someone can give some help for you...BUMP!",
      "MessageIndex": 1,
      "PostDate": "29/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744698",
      "Title": "Any stage 3 long term survivors with minimal chemo? dharmamama Pure"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 17, 2009 05:35PM lexislove wrote: My honest opinion... To get on with chemo...then have your surgery. and yes you don't want to stop treatment now...have surgery and then wait to heal and have chemo. If you have extra nodes at surgery after chemo, the pathologist will most likely be able to tell. Scaring, necrotic cells, active cells, any change in the lymph nodes structure. and if there are no more nodes involved...then you will know that too! this is just my opinion!",
      "MessageIndex": 3,
      "PostDate": "17/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730859",
      "Title": "Had a 2 opinion, what do you think ??? Mamita49 Mamita49"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 18, 2010 09:16PM lexislove wrote: Yes, it should. But any type of scan you can have false positives or negatives. There are woman on the boards who for instanse did chemo first, before surgery, had a scan that showed no signs of cancer....had their surgery with lymph nodes removed.....and surprise! Cancer. Best to have the ALD to be on the safe side.",
      "MessageIndex": 1,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/751462",
      "Title": "CT scan jan-m jan-m"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jul 23, 2009 05:24PM lexislove wrote: turkish Delight..it is common for tumor markers to fluctuate while you are in treatment. Dee breath now....!!!",
      "MessageIndex": 2,
      "PostDate": "23/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737850",
      "Title": "Tumor markers increased scared :((( Turkish-Delight lovinmomma"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 20, 2008 06:51PM lexislove wrote:",
      "MessageIndex": 4,
      "PostDate": "20/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725975",
      "Title": "Is this normal? lexislove Shirlann"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 12, 2009 06:38PM lexislove wrote: Probably her age. Oncologists most of the time will recommend chemo for woman under the age of 35. Hi Allison...I was diagnosed at 30 with a 2 year old. I finished chemo in Feb 2008. You will get your life back.",
      "MessageIndex": 4,
      "PostDate": "12/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732355",
      "Title": "just diagnosed at the age of 33 aaronali12 nandy1975"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 22, 2009 11:58AM lexislove wrote:",
      "MessageIndex": 7,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732882",
      "Title": "Repeat Brain MRI on Thursday DianaT VickiG"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 11, 2009 07:52PM lexislove wrote: Mary, I admire your determination, awsome accomplishment! Rest up now.",
      "MessageIndex": 3,
      "PostDate": "11/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/741949",
      "Title": "I ran a half marathon today everyminute lexi4"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 25, 2010 10:11AM lexislove wrote: Bugs, I was having a conversation with my husband a few weeks ago. I was telling him thank god I finished my education before my diagnosis. There would be no way I could have the motivation/drive, concentration and memory skills to do any schooling now.",
      "MessageIndex": 3,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748888",
      "Title": "chemo brain? kimber3006 Mandy1313"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 19, 2009 04:36PM lexislove wrote: bevsteed... I'm glad you are back. Please keep us updated....and hope you find some good sales tonight!",
      "MessageIndex": 21,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730086",
      "Title": "Lots of Positive Nodes bevsteed lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 10, 2010 05:01PM lexislove wrote: Be happy to finish chemo! Really. Don't be scared about NOT doing anything. After rads, you'll be doing an anti hormone, and I know your planning an ooph at some point. So.....you;ll be taking an AI. Your getting Zometa..blah blah... I think Im more happy that your finishing up chemo soon, than you are....lol.",
      "MessageIndex": 14,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748127",
      "Title": "Talk Me off the Ledge Pure Pure"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 27, 2009 12:10AM lexislove wrote: Ohhhhhh ya! I know its a pain in the a$$ to take pills on a schedule but it makes things easier.",
      "MessageIndex": 4,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729831",
      "Title": "Dexamethasone Husband11 Vavoom10"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 12, 2010 02:08PM lexislove wrote: \"Death Watch\"?! Kinda creepy. I think sometimes people may look at others diagnosis to make them feel better about their own? Its kinda sad, but people do what they need to do for themselves. I myself, have always posted on the stage 3 forum. Since I joined, even though Im not stage 3. I feel more at home here and there is no forum for big huge tumors/no node girls. Oh wait...that could be the stage 2B forum.....but there isn't one. So where would that put me? Stuck in the middle...trying to find out where I belong. I post on the Her2 forum as well, some moving beyond cancer forums and I think I have posted on the TN a couple of times, but those have been medical articles that pertain to TN woman. Oh and I have offerd some condolences to some members that we have lost. Thats it. Mostly, I just try to answer questions. Only if Im sure though.",
      "MessageIndex": 69,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748156",
      "Title": "RESPECTING the STAGE threads **RANT** cherneski Nico1012"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 27, 2009 03:53PM lexislove wrote: Shana, You have every reason to be optimistic about living a long life. I was reading a season local breast cancer mag that I get delivered, and this is what it said....85% of woman are \"cured\" of their BC. And....woman need to be aware of the real killer of woman, before BC, heart disease. I have felt/been where you are feeling. I hated it. I had my 3 year old that was wanting to go to the park ect, and I was very down. I decided last January to take Effexor. Very low dose of 75 mg.....BUT it helped out and those \"dark\" days were gone. Instead of feeling pesimistic...I was optimistic. It totally helped me. I was having major anxiety especially after finishing Herceptin. I thought it would go away, but by Xmas 2008 it wasn't. I stopped taking it July, and everything is ok.......so far..lol",
      "MessageIndex": 8,
      "PostDate": "27/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742851",
      "Title": "THE REALITY OF IT ALL Shanagirl Pure"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Sep 29, 2009 10:58AM lexislove wrote: I was told 2-3 weeks for the hair to come out. Mine was 14 days exactly. It can be uncomfortable though..especially if you have longer hair. As soon as I notice it coming out, I shaved my head. I felts by doing this it would be less traumatic for myself and my 2 year old.",
      "MessageIndex": 4,
      "PostDate": "29/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/741153",
      "Title": "My hair is not following out Pure carol1949"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 3, 2009 04:32PM lexislove wrote: Yes....you being TN I'm positive your onc would recommend more chemo AND rads. Good that you had the mastectomies, you have been agressive and will continue to do so. i heard that MRI can have some false positive readings.....but in the end..it always comes down to pathology reports. Maybe post on the TN page and ask about Zometa (prevention of bone mets). I think I saw a thread and some woman were talking about it. It has been proven to show benefit for ER+ woman...so I think now there might be trials to see if it is effective with TN woman as well. Ask your onc too.",
      "MessageIndex": 3,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730086",
      "Title": "Lots of Positive Nodes bevsteed lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jul 5, 2009 04:39PM - edited Jul 5, 2009 04:40PM by lexislove Lovely photos! I have visited Europe a multiple of times, France,Cech Republic,Germany and the Balkans, but have always wanted to go to Russia. My husband is from former Yugoslavia (Serbian) and I have been in many Easter Orthodox churches.They are beautiful and stunning. We are going  \"backhome\" for 7 weeks this August and I plane on visiting St.Sava Orthodox Church in Belgrade. It is suppose to be the largerst Orthodox church in Eastern Europe. I will also be in Montenegro to see some monastary's. I will have to post my pics when I return.. Again...nice photos.And welcome home.",
      "MessageIndex": 17,
      "PostDate": "05/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736922",
      "Title": "Pics from Russia Irina EWB"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 23, 2009 09:56PM lexislove wrote: Great story! I went Monday to the salon to get my eye brows tinted. Was telling the esthetician about how my eyebrows thinned out since finishing chemo.....she asked what kind of cancer. She is a 15 + yr survivor. She cant remember the exact date anymore, only that it was the 80's. Mastectomy,chemo....thats it. She said it was big and ugly.",
      "MessageIndex": 6,
      "PostDate": "23/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745793",
      "Title": "Good stage 3 story!! - Happy Holidays!! mmm5 BonnieK"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 24, 2009 01:31PM - edited Mar 24, 2009 01:32PM by lexislove I'm enjoying this thread...really. Lynn....... Stage 4 or not this site is for everyone so post away!!!  When I finished my treatment and saw my onc he was explaining about \"maintance\" now ie..Tamoxifen, Zometa,Lupron Vit D3. I was like ...\"ok, sounds good.\" He then says \"alright, I'll see you in 3 months.\" Waaaaaiiiiiiittttttt....... 3 months? The look on my face made him laugh.lol. He said \"yes...3 months, this is a good thing.\" He does have a way with words. And in retrospect ALL my doctors: onc, surgeon,family doctor,onc #2 have never said anything \"doom and gloom\". They have all been positive and encouraging. I think I'll keep em around.",
      "MessageIndex": 18,
      "PostDate": "24/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/731187",
      "Title": "patient-doctor relationship: your thoughts and experiences paige-allyson KerryMac"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 11, 2010 03:19AM lexislove wrote: Yes, Get an ultrasound with a mammo. It is rare for someone so young to get breast cancer....BUT ....I found my lump at 29. It was cancer. Don't leave your gynecologist appointment with out those 2 referals.",
      "MessageIndex": 2,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/748179",
      "Title": "I found a lump... now what? lexigirl lexigirl"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 23, 2009 04:15PM lexislove wrote: I had my expanders in place BEFORE rads.Finished rads June 2008. I've decided to wait till Fall this year, so that would put me at 1 1/2 years after my expander was put in place. I've decided to wait for the exact reason Celtic said. I've also talked with woman who have waited and have had no problems. ~ good luck~",
      "MessageIndex": 27,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/724718",
      "Title": "Chest Wall Radiation and Reconstruction ninel 55andstillalive"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 19, 2009 01:31PM lexislove wrote: LOL....your lucky that you GET to go camping ! My husband is soooo scared, he says snakes will bite him....umm what snakes? We're in Vancouver...not New Mexico.",
      "MessageIndex": 43,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732090",
      "Title": "BC - Should you avoid dairy and sugar??? np312 debisongbird"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Aug 7, 2009 11:21PM lexislove wrote: I'm sorry about this happening too.....but you are right, you can get through this. If he wants out...so be it. I wouldn't be beging him to stick around. Good luck and good bye. Concentrate on you and your children.Life will take its course!! Be well.",
      "MessageIndex": 2,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738612",
      "Title": "I Am Getting Divorced Heidi521 wallan"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 6, 2009 09:02PM lexislove wrote: I had 1 drain and showered on day 3. Thats when I was able to move somewhat. I brushed my teeth with my other arm. After my mastectomy, my surgeon saw my husband and said that the nodes he removed, pathology said there were 6, looked clear but of course pathology would be the final answer. Pathology report said clear, no evidence of metastatic disease.",
      "MessageIndex": 14,
      "PostDate": "06/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733541",
      "Title": "Questions about After Bilateral Mastectomy hlya lifegoeson"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "lexislove wrote: Hi everyone. I lurked for about 1 year and finally decided to post last month. I have finished up with cehmo, surgery, rads and herceptin. I'm currently on Tamoxifen, Lupron and Zometa. My question is about my radiated side. I finished 28 rads in June 2008.  Every now and then I get little tingly sensations and I've noticed that if I press on my radiated side it is tender. Not painful, just tender. These twinges come and go. Is it the tissues healing or something else? I don't see my onc till the New Year. Thank you all so much, you are a wonderful bunch! Dx:2007, 2B, Triple+, June 2008:Lupron,Zometa,Tamox.Jan 2010:Poor metabolizer of Tamox switch to Femara.Feb 2010: cyp2d6 test reliable? Back to Tamox. Ooph soon. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725975",
      "Title": "Is this normal? lexislove Shirlann"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Aug 5, 2009 06:01PM lexislove wrote: kate is right.. They kind give a rough idea of size from scans or mammogram, but surgery will tell the big picture. Stage is completely based on tumor size and number of lymph nodes involved. Well wishes for your mom!",
      "MessageIndex": 3,
      "PostDate": "05/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/738459",
      "Title": "Mom just diagnosed cgrove0518 nash"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 30, 2009 08:46PM lexislove wrote: How pretty you are!!!! I like the short hair on you...you will too with summer around the corner. Isn't it funny how we always wanna go back to like we were before BC...I think you should do 6 month updates.I think showing pics lets the newer ladies really see that it does come back.",
      "MessageIndex": 5,
      "PostDate": "30/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/733424",
      "Title": "status report and hair pic everyminute KerryMac"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 19, 2009 08:38PM lexislove wrote: Congrats on the 2 years Roxy!!  Thats an inmportant milestone!! Positive vibes for you...",
      "MessageIndex": 5,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/734431",
      "Title": "MRI roxy42 DCMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jul 28, 2009 02:07PM lexislove wrote: Your daughter should visit a physician and have a mammogram. Is she still not insured? I'm not an American, but where you live do they have clinics or something for the uninsured? Especially with yourself being diagnosed, she should be deligent with her breast health. She is young, but that really means nothing anymore.More and more young woman,under 40,are being diagnosed.I was one..at 30.",
      "MessageIndex": 1,
      "PostDate": "28/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738070",
      "Title": "My daughter found a lump and I am concerned! Jack55ok AnnNYC"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 18, 2010 03:21PM lexislove wrote: Any scans that you have had prior to starting rads would show IM nodes, if they were +. I'm trying to remember...but I think I had 3 fields as well. Up top zap....the side zap...and the back zap. I did not have boosts, they just gave me the max. Good enough.",
      "MessageIndex": 2,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/751441",
      "Title": "Help with Rads Pure karen1956"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 30, 2009 10:00PM lexislove wrote: Elaine, A womans pronosis depends on many different factors. The main ones being: tumor size,number of positive lymph nodes,ER & Her2 status, tumor grade. Since you are Her2+ I assume you have had Herceptin? Herceptin has greatly changed the stats for Her2+ woman. Best person to ask is your onc about your individual diagnosis",
      "MessageIndex": 19,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/695351",
      "Title": "Stage III 010407 DCMom"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 17, 2009 10:04PM lexislove wrote: I wish I was given the choice!!! I did 28 rads, it would be nice to get it over and done with faster. Good luck!",
      "MessageIndex": 2,
      "PostDate": "17/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744080",
      "Title": "16 tx's vs 25? What do you think? cookiegal cookiegal"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 17, 2009 03:08AM lexislove wrote: I had a spot on my liver on my pre chemo scans. Onc said it was \"fatty liver\". If you are concerned, ask for a follow up scan to put your mind at ease. BTW....this is exactly why I didnt ask for my path report to take with me.",
      "MessageIndex": 6,
      "PostDate": "17/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743950",
      "Title": "Worried About Liver Mets Shanagirl clariceak"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 3, 2009 04:00PM lexislove wrote: I'm sorry bevsteed about your pathology results....but in esense only about 20% of woman get a cPR ( complete pathological response to chemo ). I'm glad that the chemo DID shrink your tumor! That is a good thing! Was the surgeon able to get clear margins? Are you ER+ or Her2+? Then you can get more arsenal in your treatment. Your onc may or may not want you to continue on more chemo. I'm sure you will be having rads. Keep posted!",
      "MessageIndex": 1,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730086",
      "Title": "Lots of Positive Nodes bevsteed lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 4, 2009 12:13PM lexislove wrote:",
      "MessageIndex": 6,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730086",
      "Title": "Lots of Positive Nodes bevsteed lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 14, 2009 10:29PM lexislove wrote: Good luck Mandy!!! You will be ok...you will get your answers soon. Keep us updated will ya!",
      "MessageIndex": 9,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732252",
      "Title": "3 cm lump in left breast mandymonkey nanapat6225"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Aug 6, 2009 12:00PM - edited Aug 6, 2009 12:02PM by lexislove Do the chemo. It is doable. Why take a risk? this is cancer and your right studies show that younger woman have more aggressive cancers in general. If you did not do the chemo, and the BC came back..how would you feel? And if it came back as stage 4 ?... Chemo and tamoxifen has shown to reduce recurrence by around 50%. Please reconsider. I was 30 at diagnosis..I threw everything at this disease known to man. I can sleep at night knowing I HAVE done evrything.",
      "MessageIndex": 1,
      "PostDate": "06/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738514",
      "Title": "31 yrs. Old Struggling to decide on Chemo yasminv1 yasminv1"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Aug 8, 2009 06:00PM lexislove wrote: Magob.. I'm glad you chose the chemo. Don't let there be any leaf un turned. Your chemo regime will go by quick...I had 8 sessions of chemo..6 months worth. If I can do chemo..anyone can!..lol",
      "MessageIndex": 22,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738514",
      "Title": "31 yrs. Old Struggling to decide on Chemo yasminv1 yasminv1"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 12, 2010 12:04PM lexislove wrote: ughhhh! Kerry, I'm sorry. I remember how I felt when my arm swelled up, and then I was diagnosed with Lymphadema. I though I had escaped it. Nope. <sigh> I hope the antibiotics can get rid of it. Feels better soon.",
      "MessageIndex": 18,
      "PostDate": "12/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/751081",
      "Title": "Cellulitis KerryMac Let-It-Be"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 14, 2010 11:15PM lexislove wrote: I don't like seeing anybody leave..... I think sometimes we have to remember that we are all different stages along in our journey's. We can become emotional and say things out of the heat of the moment. I don't think anybody meant to intentially hurt feelings or be mean. It's so hard behind a keyboard. Take some breaths, but I hope you find your way back here.",
      "MessageIndex": 5,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748356",
      "Title": "Taking a break Diana63 helena67"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 27, 2009 08:20PM lexislove wrote: So very sad, heaven has another shining star. RIP",
      "MessageIndex": 252,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jul 30, 2009 04:47PM lexislove wrote: I had clear margins after my neo adjuvant chemo. My tumor was originally 8 cm but shrunk to approx 1 cm. Lumpectomy was NOT an option for me. I personally feel better having had the mastectomy, I think your onc is right. I know this is hard, but later on..I think you will see that it, the mastectomy, is probably for the best.",
      "MessageIndex": 11,
      "PostDate": "30/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738131",
      "Title": "I got the bad phonecall today :) Mamita49 lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jul 31, 2009 09:22AM lexislove wrote: OMG Brenda_R.. I can not even begin to imagine the psycologic BS.... being told you were stage 4 then one day...\"oops..we were wrong, your not.\" Are ya kiddin me!!!!!",
      "MessageIndex": 15,
      "PostDate": "31/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738131",
      "Title": "I got the bad phonecall today :) Mamita49 lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 15, 2009 07:04PM lexislove wrote: yes..just a chest CT scan",
      "MessageIndex": 6,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/742193",
      "Title": "for those who had neo-adjuvant chemo -- tests before and after yogamommy yogamommy"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 19, 2009 12:16PM lexislove wrote: Ask for a mammogram and ultra sound too! Sometimes with young woman their breasts are dense and the cancer is difficult to detect. Remember...80% of lumps are benign Young woman can and DO get breast cancer...I found my lump at 29...diagnosed at 30.",
      "MessageIndex": 1,
      "PostDate": "19/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742375",
      "Title": "nervous young mom suthrnatheart Lauren3"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 13, 2009 10:27PM - edited Nov 13, 2009 10:29PM by lexislove It means that it is more agressive. Higher possibility that cancer cells might have travelled. Remember, I said might. but that is what the chemo is for. It is not uncommon for ER+ woman to still have + nodes after neoadjuvant chemo. cPR (complete response) only happens in about 20% of woman, and the majority are ER-. I see your hormone sensitive. That is a bonus, anti hormone meds are just as important than chemo. Chin up, Im sure your onc has perscribed rads. You still have a lot more arsenal behind you!",
      "MessageIndex": 3,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743848",
      "Title": "Extracapsular Extension gfrey jdootoo"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 17, 2009 09:12AM lexislove wrote: OMG....kjbell.. Moron! My mother has fatty liver as well, my onc says that he sees it often. I'll take some liver fat anyday..thank you...lol.",
      "MessageIndex": 11,
      "PostDate": "17/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743950",
      "Title": "Worried About Liver Mets Shanagirl clariceak"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 15, 2009 06:32AM lexislove wrote:",
      "MessageIndex": 2,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/729098",
      "Title": "Anyone want to share their story? mizztanjo jpann39"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 17, 2010 04:28AM lexislove wrote: I gained close to 20 lbs.... I was so sick, and literally did not move off the couch. It was winter, did chemo from Sep-Feb, and I had no desire to try to get outside because I feared that I would catch a cold/flu/infection. PLUS....I could only stomach things like pancakes and pastas, carbs. This all and the steroids they give you, caused weight gain. I did loose the weight though, but I restricted my diet to about 800-1000 calories a day. I have since gained it back...lol. Im trying again.",
      "MessageIndex": 3,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748468",
      "Title": "Weight gain during ACT Purdue98 cindy2"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "May 14, 2009 02:30PM lexislove wrote: Awww..Judy, Welcome Back! The first year is always the hardest. I remember. I am coming up to 2 years in September. Sorry about your tears regarding something that was misunderstood but, it is so hard to interpet peoples feelings or intentions on a computer. I'm sure there are no hard feelings. As for your sadness regarding your diagnosis, have you thought of a mild antidepressant? I was just like you, then I said enough is enough. I was driving myself and everyone around me crazy. I finally gave in and started Effexor XR 75mg,which is a low dose, and I am sooo much better. Like my onc said, you don't have to be suffering like this. We are all scared, a diagnosis and treatment of cancer is life changing, but things do get better. Next year at your 2 years...you will be better! Again welcome back and keep posting! Sam",
      "MessageIndex": 1,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/734190",
      "Title": "One year ago JudyO JudyO"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 11, 2009 03:49PM lexislove wrote: Hi silverlining, I was young too when diagnosed Sep 2007. 30 years old, married with a 3 yr old. If you need to ever chat..... you will get through this!",
      "MessageIndex": 8,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726618",
      "Title": "Just diagnosed w/aggressive IDC theredheadamy kim40"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 26, 2010 05:34PM - edited Feb 26, 2010 05:41PM by lexislove Every PS is different. And, they all have their own opinion about what is right or wrong. There are a lot of woman who have had tissue expanders in place during rads. I am one of them. I agree that tissue expanders can affect the rad field....but that is why you dont get fills during rads. You wait till rads are over, and the skin is feeling/looking better to continue. I waited 8 weeks post rads to continue with fills. I was expanded to 250cc's starting rads. Are you wanting to be a D cup with your final reconstruction? Is that the reasoning for the back thingy? What if you were to decide being a C cup? Its up to you...just more surgery ect. Second opinion might be a good idea too. BTW: I was also a D cup. DD to my PS. I went to a C cup and its so...so...much better.",
      "MessageIndex": 1,
      "PostDate": "26/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748985",
      "Title": "Has Anyone Heard this? Pure concernedsis"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 26, 2010 07:05PM lexislove wrote: i had it at the same time as my mastectomy. So...not quite sure. The fills will be sore though, especially with having rads. I would advise to go slow with the fills..maybe 50-60cc each appointment. I was at 400cc's for my full C cup. but you are probably taller than me so you may need a little more.",
      "MessageIndex": 3,
      "PostDate": "26/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748985",
      "Title": "Has Anyone Heard this? Pure concernedsis"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 26, 2010 07:21PM lexislove wrote: Yan, sorry again about Olga..I hope she is doing well. There is talk that later stage woman...should wait 2 yrs before doing reconstruction. Because of the whole recurence risk thing. That said, most woman do not wait that long. It's a personal decision. I did wait for 22 months before doing my exchange surgery. I had my tissue expander placed March 27th 2008 and the exchange was 4 weeks ago, Jan 28th 2010. Why did I wait? First...I wanted my skin to heal as much as possible from rads. Second, because my tumor was very large...I waited for a \"possible\" recurrence. It never happened.",
      "MessageIndex": 5,
      "PostDate": "26/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748985",
      "Title": "Has Anyone Heard this? Pure concernedsis"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jun 3, 2009 09:10PM - edited Jun 3, 2009 09:12PM by lexislove 41.\" Did it hurt?\" (my well meaning grandmother) 42.\" Ohhh...you have your implant, can i feel it?\" (best friend)",
      "MessageIndex": 23,
      "PostDate": "03/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735274",
      "Title": "100 things never to say to a woman who has had a mastectomy: iwannabefree jillyG"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 26, 2009 01:34PM lexislove wrote: Shana, I will try to answer these questions, but not 100% sure: 1) I dont think there are any studies out to determine if using Zometa on the bones prevents it going to the lungs,liver,brain. I was told by my onc, that if BC was to metastasize it 70% of the time it will go to the bones first. So maybe stopping the cancer going to the bones first will help prevent further spread. Good question. I never really asked. I was just happy to be taking anything to help reduce risk more. Zometa also has a long shelf life. So I was told if you are taking the infusions for 3 yrs,like most early stage woman will do, you still will get the benefit of Zomeat 10-15 yrs more. As for the AI, in the beginning I forgot my Tamox every now and then. After a few months when the anti hormones are in your system, forgetting a day will not affect you. Its multiple days or weeks. If you forget?Just take it when you remember.",
      "MessageIndex": 1,
      "PostDate": "26/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745860",
      "Title": "2 QUESTIONS Shanagirl Pure"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Aug 12, 2009 05:11PM lexislove wrote: Lieberman..that is really great news!!!!! I hope your mom can feel optimitstic that she can beat this beast and move on with her life! thanks for keeping us updated",
      "MessageIndex": 1,
      "PostDate": "12/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738837",
      "Title": "Fantastic News! lieberman1 apple"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 30, 2009 07:29PM - edited Jan 30, 2009 07:31PM by lexislove If you want to give yourself the lowest possible chance of NO recurrence like you stated...then DO the rads.If you search you will see than radiation can reduce recurrence by about 1/3 (33%) or more. How would you feel if god forbid, have to deal with a recurrence? You would never forgive yourself for not doing them. Most women tolerate rads very well, you should too. P.S. I see your Her2+ as well, like myself, you gotta hit this BC hard!",
      "MessageIndex": 5,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728238",
      "Title": "RADS VS. NO RADS mom_of_2 Alyad"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 19, 2009 03:22PM lexislove wrote: I agree!!!  A night out is in order.",
      "MessageIndex": 8,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744180",
      "Title": "happy 365 everyminute Mary apple Beverly11"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 12, 2009 07:53PM lexislove wrote: Everyone said I would need rads..lol",
      "MessageIndex": 3,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/743785",
      "Title": "Who recommended rads to you? CoolBreeze Mazy1959"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 22, 2009 12:04AM lexislove wrote: Yes I had both. I had it during my Taxol treatments. I couldn't wear my wedding ring and my shoes felt more snug. I'm sorry to say..it didn't start to go away untill AFTER finishing my chemo. I think it could be caused by water retention from the steroids you have totake during chemo.",
      "MessageIndex": 1,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/732855",
      "Title": "Swollen feet and ankles? CrystalLocket lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 6, 2010 12:06AM lexislove wrote: If you have a mastectomy, your chances of local recurence is less than a lumpectomy. It's around 1-10%, depending where you read. If you want to know, what I would do...if in your situation/scenario? I'd do the mastectomy.",
      "MessageIndex": 1,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750826",
      "Title": "HELP!!! Another Lumpectomy vs Mastectomy believe-recieve weesa"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 17, 2009 05:16PM lexislove wrote: sweeeeeetpam, Are you wearing your wig in your Avitar pic? If so, it looks fab!!!",
      "MessageIndex": 9,
      "PostDate": "17/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/727532",
      "Title": "Chemo with negative nodes? elizzim dcgirl"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 6, 2009 12:28PM lexislove wrote:",
      "MessageIndex": 5,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743389",
      "Title": "Am I the first one to say HELLO Mamita49 havehope"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 30, 2009 01:07PM lexislove wrote: Good question TL.... As far as I have read....long term is 5yrs or more.",
      "MessageIndex": 7,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743002",
      "Title": "any long term stage III survivors out there Sunflower64 clariceak"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 23, 2009 07:26PM lexislove wrote: I think personally it might be the beans..actually I've noticed with myself when I eat brussel sprouts.So maybe it is a veggie thing....",
      "MessageIndex": 2,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/727873",
      "Title": "Gas roxy42 LizM"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 15, 2009 06:43PM lexislove wrote: Hi vickie, I had neo adjuvant chemo too. I had all the same pre chemo scans as you, but AFTER chemo I just had a CT scan . My tumor was 8cm and DCIS was remaining also.",
      "MessageIndex": 2,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/742193",
      "Title": "for those who had neo-adjuvant chemo -- tests before and after yogamommy yogamommy"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 7, 2009 04:49PM - edited Apr 7, 2009 04:49PM by lexislove",
      "MessageIndex": 1,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732109",
      "Title": "Are you doing anything to reduce your breast cancer risk? kibbles lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 10, 2009 12:33PM lexislove wrote: Welcome! I'll be happy to answer any questions that you have!",
      "MessageIndex": 2,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745185",
      "Title": "Introducing Myself, Finally... azs40 Gitane"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 8, 2009 05:14PM lexislove wrote: EWWWww! *GaK*",
      "MessageIndex": 10,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732090",
      "Title": "BC - Should you avoid dairy and sugar??? np312 debisongbird"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 19, 2009 01:22PM lexislove wrote: I tried that Splenda stuff....OMG!  What is that stuff made of? THAT....will give you cancer!",
      "MessageIndex": 40,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732090",
      "Title": "BC - Should you avoid dairy and sugar??? np312 debisongbird"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Apr 8, 2009 03:18PM lexislove wrote: You can only do so much. Or you will drive yourself crazy, you have to enjoy food as well! Carbs are everywhere..like Barbe said, there is a lot of fruit and some vegtables that contain sugar. Moderation is the key. As for alchohol,,,,,*sigh* I was a social drinker pre baby days. I use to get off work on Fridays and go straight to the liqour store to get my Smirnoff Ice's....lol. Now...I go MONTHS without having a drink. I don't miss it really, it doesn't sit as well now. But I did hit a patio the otherday and had a wonderful Bellini",
      "MessageIndex": 10,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732109",
      "Title": "Are you doing anything to reduce your breast cancer risk? kibbles lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jul 11, 2009 12:02AM - edited Jul 11, 2009 12:39AM by lexislove Carol, I remember your earlier posts! I'm so happy you are happy with your second opinion!!!!!! This second onc seems to be on his \"game\" Good for you.Let us know how your surgery went ok? ameron, it is true that chemo works very well on agressive cancers. The positive receptor thing and response to chemo is actually the other way around. There is talk that ER+ woman actually benefit MORE from Tamox or an AI than chemo.That doesn't mean though that chemo doesnt work at all though. Being Her2 positive is agressive too so chemo combined with the Herceptin will really do a number on you BC. Only 20% of woman who have chemo before surgery have a cPR (complete pathological response) so even if you have some remaining tumor...your not doomed. As for chemo getting to the nodes...rare too. Chemo tends to attack the tumor bulk, its called tumor load.It is not uncommon to have positive nodes AFTER chemo. \\ Carol, when you have your surgery and if the nodes are clear? Most likely you only had 2 involved.There was a study that came out of the St.Gallens Oncology Conference this spring that looked at SLN biopsy's before chemo and after chemo in woman.They concluded that SLN biopsy's performed AFTER chemo was just as good at determining lymph node status in woman.Especially those with a cPR.",
      "MessageIndex": 3,
      "PostDate": "11/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/736013",
      "Title": "Happy I went for second opinion !!! Mamita49 KerryMac"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 21, 2009 08:05PM lexislove wrote:",
      "MessageIndex": 2,
      "PostDate": "21/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/731141",
      "Title": "Dear doctor, I wish ... mawhinney 2frogs1princess"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 10, 2010 10:15PM lexislove wrote: Bald yes.....but pretty! BTW....Your avitar always makes me smile...lol",
      "MessageIndex": 3,
      "PostDate": "10/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746571",
      "Title": "was i really bald? apple Beverly11"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Aug 9, 2009 03:23PM lexislove wrote: (((( VIRGINIA )))) I just wanted to say...I love your snarkiness....lol.",
      "MessageIndex": 42,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738576",
      "Title": "How many here have survived 6 years after chemo? gscott Beatis"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 2, 2009 10:36PM lexislove wrote: hmmm....maybe call your rad onc or speak to one of the techs and ask how long. I would wait at least 3 months. ~* Good luck *~",
      "MessageIndex": 1,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730045",
      "Title": "OK....... I admit I'm vain! canadian lisa39"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 30, 2009 01:20PM lexislove wrote: Oh you will be a long term survivor! Just around the corner......",
      "MessageIndex": 9,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743002",
      "Title": "any long term stage III survivors out there Sunflower64 clariceak"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 1, 2010 06:18PM - edited Mar 1, 2010 06:19PM by lexislove What irritates me? My husband has a large social network. My breast cancer diagnosis was not kept a secret. I was diagnosed 2.5 yrs ago...and I STILL get people asking me...\"are you ok.\" OR......\" your the one who had breast cancer right?...\" <sigh> And then this...this HAS to be the best,............. they immediatly look at my breasts.  Like, they are looking for my breast cancer. Um..what the h*ll are ya lookin at?!!!!!!!!!",
      "MessageIndex": 5,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/749119",
      "Title": "Stage III Recently Diagnosed What are Your Issues? Shanagirl Shanagirl"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 10, 2010 05:03PM lexislove wrote: Wow Carol, Does your rad hospital have last minute deals? Sounds great....lol.",
      "MessageIndex": 12,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748162",
      "Title": "What to Expect at Rads Office Pure carol1949"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 1, 2010 06:38PM lexislove wrote: I always have a strange feeling when Im in a group that people are wispering about me.... I hate having the breast cancer label on my forehead. Maybe Im just paranoid...but still. I also have body issue image. Thats bad too. I confined in my mother all the time. she is always quick to tell me that I should be moving more and eating less...blah..blah. And hows she is 56 and in menopause and was able to loose 25 lbs....so why can't I?!!!! Um....mom? Im 32, in menopause and on Anti hormone pills. I deal with lethargy...and Im looking after a 4yr old all day...everyday. My bones feel like a 90 yr old ect..ect. The weight does'nt come off like it should/use to.",
      "MessageIndex": 9,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/749119",
      "Title": "Stage III Recently Diagnosed What are Your Issues? Shanagirl Shanagirl"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 17, 2009 04:12PM lexislove wrote: I think I said this in another post, best to hit it hard at the beginning. chemo is completley doable and the hair grows back , probably better than before. Chemo reducing recurrence by ONLY 30 -40%...sounds good to me!",
      "MessageIndex": 4,
      "PostDate": "17/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/727532",
      "Title": "Chemo with negative nodes? elizzim dcgirl"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jun 9, 2009 07:05PM lexislove wrote: LOL.... I keep putting the milk in the cupboard!",
      "MessageIndex": 1,
      "PostDate": "09/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735605",
      "Title": "chemobrain moment of the day apple swimfan"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Nov 17, 2009 06:30PM lexislove wrote: Welcome icey!!! sorry you had to come here though. As for the grade 1 thing.....that means it was a very slow growing cancer. It had probably been growing for at least 2 years. Some docs would say 2-8 yrs. This board there is alot of info...take your time. there are some grade 1 gals around. JFYI..there are a ton of woman on this board who did have regular mammos...but the mammo didnt detect their breast cancer.",
      "MessageIndex": 5,
      "PostDate": "17/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/744077",
      "Title": "scared icey Shanagirl"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Sep 30, 2009 01:58PM lexislove wrote: Michelle... I have been following your story and Im just checking up on you. I hope you are feeling better and more confident. Listen to all these great ladies ...you will be just like them. BTW, I never asked for a copy of my path report. My onc just read it to me and that was it. I KNOW..I would just be reading it all the time making my husband mental....lol",
      "MessageIndex": 9,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/739735",
      "Title": "Confused with path report michele54 lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 10, 2010 04:51PM lexislove wrote: Good point christine. I suggest bringing something for distraction purpose. I always had something to read.....even if it was cupon flyers. When you look like your engaged in something.....people are less likely to talk to you in the waiting area. I you like to chit chat...thats fine. But I did not. I have had enough breast cancer talk at that point...I just wanted to get in and out.",
      "MessageIndex": 10,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748162",
      "Title": "What to Expect at Rads Office Pure carol1949"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 15, 2009 09:13AM lexislove wrote: <sigh>..... My condolences to all that knew her.",
      "MessageIndex": 9,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742156",
      "Title": "Mrs_X_Sunneedazee (Amber) dmacw janie44"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 1, 2009 10:02PM lexislove wrote: Oh ya. A book that I read that helped so much.....Picking Up the Pieces, by Sherri MacGee. A book for cancer survivors and all the feelings of being dignosed,treatment and then moving forward. I highly recommend!",
      "MessageIndex": 4,
      "PostDate": "01/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744798",
      "Title": "So Now What??? Shanagirl maltomlin"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 30, 2009 04:21PM - edited Mar 30, 2009 04:22PM by lexislove I'm sorry but your hair WILL fall out. It just doesnt happen all at once. You'll notice some on your pillow, or when you comb/brush your hair, in the shower. 2 weeks is avearge but it could take longer than 2 weeks..everyone is different. I was waiting too...then I said the hell with it and got my hairdresser friend to just buzz it off. This way it was less traumatic for me. ~~~ Take good CARE~~",
      "MessageIndex": 1,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/731638",
      "Title": "Waiting for hair to fall out......Yikes! GTYforeveryoung domenique"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 4, 2009 10:19AM lexislove wrote: I am doing Biphosanates. Zometa 2x year 4mg. I had my first infusion July 2008 and second one this January. I declined the trial, because I wanted to have what has already been proven, and I think in the trial they are testing larger doses of the Biphosanates. I also knew I wanted to have Zometa and did not want to risk getting into another arm. My first infusion I was achy a couple of hours after the injection...but I just took an extra strength tylenol and was good. Second infusion...nothing I went rollerblading. It's up to you if you want to do the trial or not...maybe weigh the pros and cons. But in the end I think Zometa is an excellent addition to your adjuvant care! ~* thake care *~ Sam",
      "MessageIndex": 3,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729915",
      "Title": "Zometa for Early Stage BC? Abbey11 TenderIsOurMight"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 12, 2009 11:18PM lexislove wrote: Tamox should not be giving you pain. I would bring this up with your onc and ask for scans to be on the safe side......",
      "MessageIndex": 1,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/728996",
      "Title": "Pain all over rferraris sueps"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 14, 2009 03:30PM lexislove wrote: What crap...if you can't get into surgery..demand chemo first!!! Survival doesn't change wether its surgery first or chemo. Cry and stomp your feet if you have to. My tumor was Her2 as well and in 6 months it almost tripled in size...they grow fast.",
      "MessageIndex": 15,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742122",
      "Title": "\"Are you waiting for me to die, or what?\" CoolBreeze lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 21, 2010 07:48PM - edited Jan 21, 2010 07:50PM by lexislove http://www.people.com/people/article/0,,20338298,00.html This is from People magazine, but she talked about her diagnosis. Sad story, too young.",
      "MessageIndex": 27,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747071",
      "Title": "crap, I hate this disease Fitztwins candy14510"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Oct 25, 2009 01:38PM lexislove wrote: Ann! I have been wondering about you!!! Good news about the surgery date. I dont know where \"they\" get tumor growth timelines. I know when I found mine it was about the sige of a plum pit. I felt it! That was January 2007 by Sep......8cm! How? I dunno. It just did. BC is not a one size fits all disease. What is with one person is different for the other. I blame  mine on the whole Her2 thing. Please check in from time to time.",
      "MessageIndex": 46,
      "PostDate": "25/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742122",
      "Title": "\"Are you waiting for me to die, or what?\" CoolBreeze lexislove"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 5, 2009 09:07AM lexislove wrote: Southport I'm in Canada. I'm at a local Hospital. I applied to Novartis, the company that makes Zometa, and they approved me financing. Basically the reimburse me half of the cost of my infusion. so ....I pay $620.00 up front at the pharmacy, I then fax the receipt to Novartis, and they send me a check for $310.00. Not bad!",
      "MessageIndex": 6,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729915",
      "Title": "Zometa for Early Stage BC? Abbey11 TenderIsOurMight"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Jan 13, 2009 02:08AM lexislove wrote: I am not in a trial but have chosen to take Zometa anyways. I have the 4mg infusion every 6 months. I had my second injection today. Se's are not bad.",
      "MessageIndex": 19,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/659325",
      "Title": "bisphosphonates joanne_elizabeth brena"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 5, 2009 11:16AM lexislove wrote: That;s very sweet of you everyminute and everyone else!!!! All of you will get there to. I can't beleive it has been 1.5 years for me and I hit my very important 2 year mark in September. To celebrate my husband is taking our family to Greece in August for 6 weeks. I'll definatly be thinking of all you who are in, or just finishing active treatments! So...so... happy for you guys! ~* OPA*~ ****cheers!***",
      "MessageIndex": 5,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730193",
      "Title": "Thank you to those who come back and give us hope! everyminute helena67"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Mar 5, 2009 11:24AM lexislove wrote: Yes!!! How about in April When I add my extra long extensions. Is that ok?",
      "MessageIndex": 7,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730193",
      "Title": "Thank you to those who come back and give us hope! everyminute helena67"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "lexislove wrote: I thought this would be the most appropriate place to post this. I have my ooph consult on Wed Feb 10th. This coming week. Reason being, I tested as a poor metabolizer for the CYP2D6 gene <sigh>. I have been busy healing from my exchange surgery last week, and haven't really though about what to ask at the appointment. My head is in a fog. Is there anything in particular that I should ask/know? Im kind of nervous, and just want to be prepared. Dx:2007, 2B, Triple+, June 2008:Lupron,Zometa,Tamox.Jan 2010:Poor metabolizer of Tamox switch to Femara.Feb 2010: cyp2d6 test reliable? Back to Tamox. Ooph soon. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/747929",
      "Title": "Preperation for ooph consult....? lexislove kimt"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 6, 2010 02:00PM lexislove wrote: I havent thought about removing \"other stuff\" while removing the ovaries.... The ooph will be done laproscopically, my onc recommended thats the best way to go. I really can't handle anymore big surgery's. Im at my limit. Thank you both for your responses!",
      "MessageIndex": 3,
      "PostDate": "06/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/747929",
      "Title": "Preperation for ooph consult....? lexislove kimt"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 10, 2010 03:13PM lexislove wrote: You will most likely have a CT scan before starting rads...to help map out things. And yes, the tatoos....they were the same appointment for me. I also met my rad onc the same day. They talk about what to expect with rads and skin care. they will give it all to you in writing too. When rads started....I met with my rad onc once a week. It was very quick...just \"hi, how are you, how are you doing/feeling?\" Stuff like that. I saw my rad onc only 5 times. I was suppose to see her 3 months post rads, but cancelled because my anxiety was too much going back down to the BIG cancer centre. Rads by far easier than chemo for me. It was harder mentally though (for me). Like I said, I had to go to the big centre....I saw so many cancer patients and I was always the youngest. My hair was short, and all the ladies in the waiting area had hair, and their breasts and were at least twice my age.  I would over hear them complaining about there DCIS diagnosis...* I hope no DCIS ladies rant on me..lol* I wanted to scream. I left almost daily with tears in my eyes. Thats just my experience though",
      "MessageIndex": 6,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748162",
      "Title": "What to Expect at Rads Office Pure carol1949"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Feb 11, 2010 09:15AM lexislove wrote: I was told no Tamox during rads....I started the day after rads. My oncs recommendations, so different opinion. Regarding the CT scan, I didn't go into details about what area they are mapping ect...I would asume they would scan your uper torso region ( waist - neck/head). Again, the purpose is to help map out for the rads. The techs are not looking for anything unusual......BUT....if...remember...if..... something was to show up? It would be seen. Thats what was told to me. You will do good.",
      "MessageIndex": 24,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748162",
      "Title": "What to Expect at Rads Office Pure carol1949"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 1, 2009 09:57PM - edited Dec 1, 2009 09:58PM by lexislove So now what? You go on with your life. You say to yourself ,\"I have had the best treatment to date, and I am still getting treatment (Tamox/AI, Zometa). You believe in the treatment and that you are going to live a long life. I went through the exact same feelings you are right now. EXACT. I finished Herceptin November 2008. I was done.Finished.Onc said, \"see you in 3 months, heres your Tamox.\" Ummmmm....ok. I focused on Christmas. 2007 Christmas I was going through chemo, so 2008 christmas I was going to make special. I took my daughter to have pictures with Santa.I made holiday gifts ect...ect. It helped take my mind of my whole BC experience. It is literally a one day at a time thing. The more that time passes...the less you think of BC and the fear that comes with it. Things do get easier...trust me. I wish I could wave a magic wand....for all of us.",
      "MessageIndex": 3,
      "PostDate": "01/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744798",
      "Title": "So Now What??? Shanagirl maltomlin"
    },
    {
      "AuthorID": "lexislove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56632/profile",
      "Content": "Dec 2, 2009 11:35AM lexislove wrote: shana, Im so glad your feeling better. Today, is a new day. No appointments, no rushing, no radiation. Celebrate!!! You get to do whatever you want! Go to the beach with your dog (I wish I had one :( ) Enjoy the air...breathe. Stop and buy youself a lil somethin somethin. I found retail therapy to be real helpful...lol. We are here when ever you need us!",
      "MessageIndex": 13,
      "PostDate": "02/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744798",
      "Title": "So Now What??? Shanagirl maltomlin"
    }
  ]
}