{
  "AuthorID": "lexigirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97249/profile",
  "Posts": [
    {
      "AuthorID": "lexigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97249/profile",
      "Content": "Feb 12, 2010 02:53AM lexigirl wrote: Thanks for the advice, I really appreciate it!",
      "MessageIndex": 3,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/748179",
      "Title": "I found a lump... now what? lexigirl lexigirl"
    },
    {
      "AuthorID": "lexigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97249/profile",
      "Content": "Feb 13, 2010 08:37PM - edited Feb 15, 2010 02:28AM by lexigirl Thanks so much for taking the time to respond! I am going to the doc on Monday and am anxious to get there. I am a little nervous that they may be dismissive because of my age (but I can be pretty demanding if need be). I forgot to mention previously that my maternal grandmother died from ovarian cancer - I have no history of breast cancer in my family. Can a history of ovarian cancer mean anything? I remember hearing (on Oprah) that the BRCA gene could mean breast and/or ovarian cancer but I could be wrong - I'm just wondering if this is important. Thanks again for the nice thoughts! ",
      "MessageIndex": 6,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/748179",
      "Title": "I found a lump... now what? lexigirl lexigirl"
    },
    {
      "AuthorID": "lexigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97249/profile",
      "Content": "lexigirl wrote: I'm only 22 years old and am pretty healthy. About two weeks ago I found a lump in my right breast while I was in the shower. It was about enough to knock me over. I had never felt it before, that I knew for sure and it is huge. It is rock hard, has a kind of golf ball-y texture and and it doesn't appear as if it is movable. It feels nothing like the tissue in my breasts and there isn't anything similar in the other one. I have checked it everyday since (often more than once) to see if it was still there or if it was just my imagination. It's still there. I have an appointment with my gyno for this Monday but nobody there seems very concerned because I am 22, which I understand. But I have this giant lump that just doesn't feel right and I don't know what it is and it's worrying me. Ever since I found it I just haven't felt right and it certainly could be my nerves but I'm worried that it's something bad. So I guess I'm just wondering if anyone has any advice, or if anyone's lump has felt similar to mine whether it turned out to be benign or malignant.   Thanks for letting me vent. :) Lexi  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/748179",
      "Title": "I found a lump... now what? lexigirl lexigirl"
    }
  ]
}