{
  "AuthorID": "lfejohnson1…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173691/profile",
  "Posts": [
    {
      "AuthorID": "lfejohnson1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173691/profile",
      "Content": "Mar 15, 2013 09:45AM lfejohnson1968 wrote: Thanks for your information. I just finished to talk to my BS and I will have the biopsy done on Wednesday  theydo not see cancer but they see ADH and ALH and my best understand is that theyare seeing both. Basicly I am looking one step more close to Breast cancer. I ask if instead of biopsy will be better just go and remove everything but they think is impractical ( or maybe I am crazy). I was told if this biopsy is positive then I will need to have and MRI and then will decide if we get lobectomy or mastectomy. I just thinking in the worse case scenary because even when they sound optimist I am not the hole seems getting deeper. Thank so much for listen and reply. Mean so much that I am not alone. Thanks again",
      "MessageIndex": 2,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801841",
      "Title": "what atypical cells really mean? lfejohnson1968 leaf"
    },
    {
      "AuthorID": "lfejohnson1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173691/profile",
      "Content": "Mar 16, 2013 05:31AM lfejohnson1968 wrote: Thanks to all. It is nice to find a place where you can find some aswers and more important somebody to listen. I spoke yesterday again with my doctor. I told her if we going for the biopsy why we do remove all the entire area that is affect? she said again no to worry about it, she seems not to be concern. But everytime I took this approch I find my self in a deeper hole so speak. I guess I just have to wait and see.  Probably will be until next friday that I have some news. Monday is my pre- testing and Wednesday is the procedure. I will keep posting.",
      "MessageIndex": 5,
      "PostDate": "16/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801841",
      "Title": "what atypical cells really mean? lfejohnson1968 leaf"
    },
    {
      "AuthorID": "lfejohnson1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173691/profile",
      "Content": "Mar 19, 2013 06:42PM lfejohnson1968 wrote: Thanks.  There is not lump just the microcalcification that they checked with the needle biopsy. I had a blood tube draw and EKG.  I was curious about the differences ( ultrasound/MRI). I will keep posting. Probably I will not have any news for a few days.",
      "MessageIndex": 2,
      "PostDate": "19/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/802063",
      "Title": "excional biopsy tomorrow, more questions lfejohnson1968 leaf"
    },
    {
      "AuthorID": "lfejohnson1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173691/profile",
      "Content": "Apr 21, 2013 05:26PM lfejohnson1968 wrote: Thanks for your advice. I just do not want to worry for a few months. So far they do not find cancer and they checked a large chunck of tissue. The only thing that conern me is the hyperplasia. I had schedule the MRI. I am just taking a day at the time. Thanks again",
      "MessageIndex": 2,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803612",
      "Title": "Surgical biopsy results, but still worry lfejohnson1968 Scaredandworried"
    }
  ]
}