{
  "AuthorID": "lhasamom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137570/profile",
  "Posts": [
    {
      "AuthorID": "lhasamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137570/profile",
      "Content": "Oct 11, 2011 03:11PM lhasamom wrote: MicheIe, I think we both have a great sense of humor!  I got the reports from my ultrasound (after 2 mammas) on my BIRTHDAY!  I stood in my kitchen saying out loud, \"happy f****#g birthday.\" I then buried my head in the sand for a few weeks!  I had a biopsy, on 7/18 which was positive.  Our health insurance ended on August 31.so everything had to move at lightening speed.  Mastectomy scheduled for 8;/18 with reconstruction.  After meeting with PS we (Mom and I) were coming home, she was driving and this A$$hole ran the red light.  If my Mom had gone through the light just a nanosecond quicker, I'd be dead.  I got knocked around pretty bad.  Blacked out so they transported  me to Johns Hopkins Bayview shock trauma.  After  checking me out,including a CT scan, they gave me the okay to go home.  The CT scan showed 2 spots on my lung, and trauma to my neck.  Came home called my doctor and he said I could take Advil for that Friday night and Saturday, but after that no pain meds!  So I have whiplash, a concussionback and,  neck pain, not to mention bruises EVERYWHERE, and I can't take pain meds.  Seriously?  I was actually looking forward to surgery so I could finally get good pain meds!  It's now early October and I still have neck/back pain, forgetting things, and I have to make lists to function.  Oh, and the A$$hole says he had the green light!  Grrrrrrrrr  I looked him up on Maryland Judiciary Site and found he's been arrested for 2 vehicle violations and convicted, the latest being driving while under the influence of drugs!  Oh, and he's been arrested 6 times for theft, convicted on 5 of those charges! More later on tonight..............................",
      "MessageIndex": 17,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/774949",
      "Title": "And it keeps getting worse... Michele_T lhasamom"
    },
    {
      "AuthorID": "lhasamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137570/profile",
      "Content": "Mar 16, 2012 04:07AM lhasamom wrote: Lynn, thanks for the backstory here.  You cleared up a lot of questions i was going to ask.  That being said, I would have to say, I think it woudl be a really positive thing to do.  I've never tried to \"hide\" my diagnosis.  I find it opens a lot of lines of communication.  It's amazing how many people you talk to, will say, \" So and So was diagnosed with BC too.\"  I was waiting for another MRI and was sitting with another woman who was waiting for her tests to begin.  It wasn't BC she had, but those 10 minutes of talking, commiserating really helped both of us.  When my name was called, she told me good luck, and I wished her the same.  I started to the MRI room and turned around and asked if I could give her a hug?  We hugged each other and I could feel her trembling with fear.  She told me with tears in her eyes how much that meant to her.  So, you never know how many people you casually meet you can help.  With your video, you'll be reaching so many more.  Just be sure you have final say ofthe finished product!  ((HUGS))",
      "MessageIndex": 11,
      "PostDate": "16/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784170",
      "Title": "Would you do this? Thoughts Please! Lynn1 bhd1"
    },
    {
      "AuthorID": "lhasamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137570/profile",
      "Content": "Nov 4, 2011 12:35PM lhasamom wrote: I've come to the conclusion that life causes cancer.  :P  No matter what you do, everything is suspect.  Sigh  Oh well, I still say live life to the fullest.  It's bound to piss off someone.  That sounds so Maxine like!",
      "MessageIndex": 10057,
      "PostDate": "04/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lhasamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137570/profile",
      "Content": "Oct 12, 2011 02:10PM - edited Oct 12, 2011 02:32PM by lhasamom Hi everyone, can I join this group?  My BC was discovered during a regular mammo.Went for ultrasound, chest Xray, blood work up on 7/5/11.  Still trying to get used to the abbreviation here, can't figure out the BXS!)  Doc called me 7/8 @ 8:00 pm that night, told me he wanted to do a biopsy,.  Scheduled it for 7/12.  I've always had a good, gallows sense of humor.  When doc was finishing up, he told the nurse who was helping, \"OK, let's get her cleaned up,since there was some blood on my boob\".  So as he steps back so the nurse can take over, I said, \"isn't this just like a man?  He makes the mess and expects the woman to clean it up?\"  Dead silence for about 3 seconds, and then he cracks up.  Says in his 30+ years as a breast surgeon,he's never had a woman cracking jokes during a biopsy.  He's had them crying, sobbing, begging him to stop cause they couldn't take the pain anymore, but I was the 1st to make him laugh.  Got the results on the 18th, my mom went with me.  I swear I  thought I was on Candid Camera.  I'm sitting there, Doc walks in sits down, and says, \"The results are...... at that PRECISE moment Mom's cell rings! There are signs everywhere saying to turn off all cell phones!!! We both turn and look at my mom, who is totally flustered.  She then proceeds to tell the caller she can't talk now, yada yada yada yada, me I would have just hit the OFF button and not even answered it!!  I finally say Mooommm, she then gets off the phone!!!!  She apologizes and says well, what's the answer?  So Doc says, you have cancer.  Three little words that just sucked all the air out of the room.  I thought I had prepared myself for that diagnosis.  He reached over and sqeezed my arm, and said, \"You will get through this.\"  I was very calm, I remember thinking, shouldn't I be crying? Shouldn't I be falling to pieces? It was surreal! Whenever there is an emergency, I'm the one who giving orders, sizing up the incident, getting the facts, basically being \"cool hand Lynn\". So, that's what I was doing. My Mom is sobbing, asking questions that were incoherent. I told the doc, that my insurance was finished as of Aug. 31th, and on Sep. 1st we had to switch to a new company. I told him we had finally reached our deductible ($3,000.00) so anything from now on WOULD be fully covered.  He said he would make sure everything was done before Sept. 1st.  He then lined up more tests, recommended a PS (he said if it were his daughter or wife, he'd send them to this PS).  So the next few weeks were a blurry of getting a breast MRI, blood work, meeting a PS, getting dental work done, and meeting with a lawyer to finally after 30 YEARS make up a will, power of attorney, living will, etc. ( I had been nagging hubby for YEARS to get it done). My dentist after my teeth cleaning, and after been told about my diagnosis, told his secretary to get me in before the surgery which was 4 days away!  He told me he would stay after hours, or open the office up at 6:00 AM if need be.  He then gave me a carnation (he gives his female patients a carnation when they're leaving.  Then he gave me a hug and told me he'd be praying for me!  I was really moved by that!  His secretary told me she could get me in the day before surgery at 11:15!  So during that final week, I had two dental appointments, met with my Onco Team, had a Dexa Scan, final appointment with PS. OMG, just realized I left out a major part of this story!  Surgery was the 19th, and I met with PS on the 12th, coming home, it was a beautiful day, hot but not unbearable.  We went to Home Depot to get bug spray for my Mom, and we decide to go to MickyDees for lunch.  I told her to avoid all the traffic, just to go through Target's parking lot and weave through it.  The way she wanted to go,you risk being rear ended because if you try to enter the McD's entrance, it is about 50 feet from the light, and to make matters worse there is a right turn lane only that feeds into the lane!  So, she decided to go through the light to Target's.  We wait for the driver ahead of us to go, which he did, we proceeded through the light and BAM, CRASH!   An A$$hole ran the red light and Tboned us!!!  I blacked out, Mom thought I was dead actually.  The ambulance arrived and I started to regain conciousness.  It took about 15 minutes for me to remember everything.  So, off I was to Johns Hopkins shock trauma. After being there and being checked out completly, yes they DO cut off your clothes, because I had to wear 2 hospital gowns home!  Told me I had whiplash, a concusscion  and a lot of scrapes and a cut to my elbow.  Called my surgeon when I got home, he told me I could take only Advil or Aleeve for that night and the next, but NOTHING after Sunday!  So the whole week BEFORE the surgery, I couldn't take ANYTHING for pain, only ice or heat packs.  My surgeon gave me his personal cell number, if I needed him.  That week, I was actually looking forward to the surgery so I could FINALLY get some pain meds!  (to be continued......)",
      "MessageIndex": 9817,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lhasamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137570/profile",
      "Content": "Mar 15, 2012 01:00PM - edited Mar 15, 2012 01:00PM by lhasamom Congrats Ducky!!!  Welcome Spitfire and Newbies!  I used to have a really good memory, but the Anastrozole has taken care of that!  Drives me crazy when I can't get the word out that I want to say.   Spitfire, I second asking questions!  You mentioned the Onca type DX test.  I was smack dab in the middle, just had a matectomy and my insurance was changed from Blue Cross to Coventry.  Neither would cover the $4200.00 bill, Blue Cross since I was changing to a new insurance and Coventry because I didn't get prior authorization!  Thank God Genomics Lab. called and said if insurance DIDN 'T cover it, the bill would be picked up by them.  Without that test I would have undergone Chemo.  My Onca DX result  was 13, so I am now on Tamox. for 5 years. ",
      "MessageIndex": 12022,
      "PostDate": "15/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}