{
  "AuthorID": "liamsgrand",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174437/profile",
  "Posts": [
    {
      "AuthorID": "liamsgrand",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174437/profile",
      "Content": "Apr 9, 2013 10:13PM liamsgrand wrote: Dear farmerlucydaisy: Thanks for responding to help us new to this journey. I suffered for years with uterine fibroids prior to a partial hysterectomy in 2002. A friend mentioned that her low hip pain was attributed to scar tissue and I decided just to wait until I see my BS again on Tuesday. So glad to have others to discuss and share this dreadful disease.",
      "MessageIndex": 7,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/802745",
      "Title": "Waiting for Biopsy results kel44 Moderators"
    },
    {
      "AuthorID": "liamsgrand",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174437/profile",
      "Content": "Apr 9, 2013 06:57PM liamsgrand wrote: Dear Kel44: Not so nice to meet you, but I'm glad to respond because I do understand how you feel alone. After my March 11 biopsies, I was Dx with stage 2, IDC on March 19, no LVI at this time. Okay, feel I'm ready to deal with whatever I need to do to eradicate this enemy from my body. However, like you, I've been experiencing this low hip problem which has sent my mind to a totally different planet. I saw my BS yesterday and she sent me down for an x-ray. She additionally ordered an MRI, bone scan and other testing I guess all is required prior to surgery. Although both specialist think the BC has no nodes involved, I can't stop thinking about the problem in my hip and wondering if the cancer could spread to the bones some other way. I'm generally a positive person, but can't stand the anxiousness this secondary problem has created in me. Since you are waiting for the results of your various tests, do you know if all those tests are typical for BC diagnosis? If someone view this post who can enlightened us, please do. Thanks and I will keep in touch or if you would to talk, I guess we can PM our numbers--not sure of all the protocol yet.",
      "MessageIndex": 5,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/802745",
      "Title": "Waiting for Biopsy results kel44 Moderators"
    },
    {
      "AuthorID": "liamsgrand",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174437/profile",
      "Content": "Apr 14, 2013 12:08AM liamsgrand wrote:",
      "MessageIndex": 3,
      "PostDate": "14/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/802997",
      "Title": "Diagnosis became just a little more... liamsgrand liamsgrand"
    },
    {
      "AuthorID": "liamsgrand",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174437/profile",
      "Content": "liamsgrand wrote: Hello everyone, After receiving my Dx on March 19, I finally got to see the BS today. Disappointed to hear that my tumor is not 1.9, but likely 2.5. Okay, forward on to the two options she presented, lumpectomy or mastectomy. However, she recommended bilateral MX because of possible LCIS in the right breast. Didn't feel a problem with bilateral MX if recurrence percentage was going to be low. However, I experienced a DVT (deep vein thrombosis/blood clot) in my left leg in 2009 which complicates the possibility of having the reconstructive surgery. The BS said having cancer itself presents clotting problems. Therefore, because of the intracacies involved w/having both surgeries at one time, could put me at serious risk. She's recommending that I see a hematologist for special testing of my blood prior to surgery. This could delay my surgery. Anyone else presented with similar problems or other complications? Would anyone recommend just having the MX now and reconstruction later? Or, is there other options for cosmetic procedures later. Just not sure I want to delay surgery too long. I appreciate any feedback. Dx 3/19/2013, IDC, 2cm, Stage II, Grade 3, ER+/PR+, HER2- Surgery 5/19/2013 Mastectomy: Left, Right; Reconstruction (left): DIEP flap; Reconstruction (right): DIEP flap Surgery 5/28/2013 Reconstruction (right): DIEP flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/802997",
      "Title": "Diagnosis became just a little more... liamsgrand liamsgrand"
    }
  ]
}