{
  "AuthorID": "LidzyWidzy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196566/profile",
  "Posts": [
    {
      "AuthorID": "LidzyWidzy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196566/profile",
      "Content": "Mar 14, 2014 09:57PM LidzyWidzy wrote: Lojo -- You're so right! And, while I am back on the computer, it's for information and support, not to get ahead of myself with that spreadsheet. Thanks for the sound advice and the information regarding the different components of the Nottingham grade. My biopsy listed the 3+1+1 breakdown for my grade, but it also reported the presence of LCIS. Ultimately, the pathology report for the lumpectomy (which also reported a Grade 1 - but not the components), did not report any lobular carcinoma, only ductal. So, who knows? Maybe it was 1+1+1. The Oncotype results should tell the full story.  Till then, I will prepare myself for either path, and enjoy the quiet after the surgery and before any other procedure begins. And, be grateful for all of you. ",
      "MessageIndex": 247,
      "PostDate": "14/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "LidzyWidzy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196566/profile",
      "Content": "Mar 24, 2014 04:20PM LidzyWidzy wrote: I met with the medical oncologist on Friday to discuss the results of the Oncotype score of 14 that I received. He advised me that with a 9% recurrence rate there was, at best, only a tiny percentage possible benefit from chemotherapy and that this must be weighed again the well-established risks of chemotherapy. He also stated that the Oncotype result presumes a regimen of tamoxifen and that the AI I’ll be taking (Femara) might gain me another 2%. In addition, the Zometa injections – for bone density loss – can be considered as another 1-1.5% protection against future recurrence, at least in the bones. He concluded that it would be irresponsible on his part to have me follow a course of chemo. I found his reasoning sound and am, at long last, comfortable with this decision. I get there in the long run . . . it just takes me a little time and understanding . . . thanks for all of your help! Voraciousreader – thanks for all the evidence – that was exactly what I needed last week. I can’t believe I had not looked at the NCCN guidelines before – Duh! Thx for leading me there. Farmerlucy – I so appreciate your words: “If it comes back it comes back. I will not let that fear steal any more time from me.” I wrote that into the FBC diary I am keeping – you know what the F stands for – and have referred to it more than once as I try to get used to keeping this fear at bay. MsP – yes, I agree – the key tomoving forward is engaging with the things that are in my control and make me feel better in any case – exercise, healthy habits, and moderation in everything. I’ll meeti with the “survivor specialist” over at the hospital tomorrow to discuss these kinds of things – kind of a creepy name and she was a ibt upbeat/cheery for me but I’m ready to hear what she has to say. Y’all are the best help a girl could want at a trying time like this.",
      "MessageIndex": 298,
      "PostDate": "24/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "LidzyWidzy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196566/profile",
      "Content": "Mar 13, 2014 08:36AM LidzyWidzy wrote: Question regarding accuracy of the Excel results. I’m 59 and had a lumpectomy in late Feb; tumor was 2.8 cm, grade 1 (3+1+1), ER+(high, 100%), PR+(low, 5%), node negative (0/1). Regarding the choice of chemo, the med oncologist said I had three factors in my favor (grade, ER receptor & nodes) and two things not so much (tumor size & low PR). He ordered the Oncotype Dx & the path material was sent yesterday. Another med oncologist I consulted said he agreed with the decision to order the test and for any number over 18, he’d recommend chemo since my underlying health is strong. OK – so I have run my figures through the Excel spreadsheet and have come up with numbers hovering around 18-19 depending on how I characterize the 100% ER positive (300 or 270). I don’t have access to a Ki-67 figure though the early biopsy report says that Pan-CK is “strongly positive” – what the heck is that? Can’t figure out after an extensive Internet search & I forgot to ask either med oncologist. The surgeon – who was terrific – didn’t know. My question is: how closely did any of your final Oncotype numbers track the number from the spreadsheet – what was the margin of error? This waiting game stinks and I want to prepare for chemo if that’s what is in store. This is my first post. I want to let you all know how much I have relied on the advice I have gleaned from all of your postings, from what kind of bra to wear post-op (yes, the fruit of the loom from walmart website is the best) to Oncotype info to the amazing positive attitude you all display. Heartfelt thanks to an amazing group of women. ",
      "MessageIndex": 239,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "LidzyWidzy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196566/profile",
      "Content": "Mar 16, 2014 02:41PM LidzyWidzy wrote: Hi - I actually have some confusion about the LCIS which was reported on the biopsy from late January but not on the early March post-lumpectomy path report. I asked the surgeon about this on Friday and he stated that perhaps there was just a smidge of LCIS and the biopsy itself removed it. I wonder if the Oncotype report will address the type of cancer? Yes, I am on board for radiation but don't know what the impact of the presence of LCIS has with regard to rads. If I even have/had it . . .  Kam170 - thanks for sharing your scores. Bet that made taking on the chemo \"easier.\" (you know what I mean . . . ) Looks like lots of you end up with slightly higher than the spreadsheet scores. If I count my Nottingham as a 5, I get 19. If I count my Nottingham as 3, I get 14+. I have already decided that if it's 18 or above, I will take chemo. Will report back the actual score when it comes in later this week. You all are the best - thank you!",
      "MessageIndex": 251,
      "PostDate": "16/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "LidzyWidzy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196566/profile",
      "Content": "Mar 20, 2014 08:24AM LidzyWidzy wrote: Good morning –  Interesting discussion about Oncotype scores and tumor grades. This is all brand-new to me and I learn a lot from all of you. To circle back to my anxiety-ridden post from a few days ago, I got the result from the Oncotype Dx yesterday: 14. That’s puts the “average rate of distant recurrence” at 9%, with a margin of error of 3%. I should feel elated but, somehow, a 1 out of 10 change for recurrence, WITH the AI’s, is still troubling – like, isn’t there something else I can do to lower these odds even further? I will meet with the MO tomorrow to discuss this more fully. Part of me wants to throw everything I can at this BC and part wants to go straight to rads so I can get on with my life. I need to more fully understand the risks involved with chemo, besides hair loss and serious discomfort during the process, to appreciate why lowering one’s odds by 2 or 3% does not seem like a good bet. Regarding the spreadsheet: since I did not know my ki67 score, filling in the numbers took some guesswork. My results ranged from 14 on up to 19 depending on how I characterized (guessed at!) various factors – so 14 was smack within that range. ",
      "MessageIndex": 265,
      "PostDate": "20/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "LidzyWidzy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196566/profile",
      "Content": "Mar 24, 2014 07:41PM LidzyWidzy wrote: Yes - a Plan is so much better than Uncertainty, any day! You sisters are great to stay on board and help us newbies navigate.",
      "MessageIndex": 301,
      "PostDate": "24/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "LidzyWidzy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196566/profile",
      "Content": "Mar 13, 2014 04:30PM LidzyWidzy wrote: Thank you so much for your responses. I know I really should adandon the spreadsheet and just have to wait for the Oncotype to come in. But it's hard not to fiddle with the tempting spreadsheet tool, especially since the chemo schedule will affect numerous things I have planned since it'll push the radiation out till early summer. Aside from optimistic planning, I just really, really want to know! You all know what I am talking about . . .  I don't know how to identify my mitotic score. The final path report listed just a gross grade of 1. The biopsy showed \"Grade 1 (3+1+1).\" I wonder if there is an established order in the way the components of the Nottingham grade are displayed. Also, is a Grade 1 that is derived from a \"5\" worse than a Grade 1 that would come from a \"3\", I wonder? All speculation, I understand, as I pace and wait :-) So . . . I just called Genomic Health and Carmen in customer service reports that they got my tissue sample yesterday & that it is in the lab. She gave me an estimbated completion date of next Thursday, Mar 20th! Phew, I think I can hang in there.",
      "MessageIndex": 245,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    }
  ]
}