{
  "AuthorID": "lifechangin…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
  "Posts": [
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Jun 28, 2012 05:45AM lifechanging2011 wrote: Hi Babett, I finished 33 treatments of radiation in March. I have an autoimmune disease so they were concerned about the radiation touching my inner organs, which could spark more inflammation.  They decided to have me lay on my stomach the whole time. My boob would be put through a whole in the table, but this way the radiation had a much less chance of touching my inner organs. Have they discussed that as an option? Traci",
      "MessageIndex": 23,
      "PostDate": "28/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Jan 5, 2012 08:52PM lifechanging2011 wrote: From the time a lump was found in the left breast at an annual GYN appt to the time I received the results from a biopsy on the right breast, it had been a month of various doctor visits. I needed to know the results as soon as they came in. As it was, I called the radiology dept the morning the results were to be in and was told that the results had just been faxed to my doctor and to call there. I called the doctor and was told that the doctor was in a meeting and then the OR in the afternoon and that my results were put on the doctor's desk. The doctor would call when she could. The stress of waiting all day for the phone to ring and it was a Friday, which meant if I didn't get the call I'd have to wait the entire weekend... I needed to know the answer. I didn't care that it was on the phone. I needed to know the results. I was told over the phone. My head would have popped off if I had to wait anymore.",
      "MessageIndex": 35,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780533",
      "Title": "How did you hear biopsy results--phone or appt? frazzledmom schoolmom"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Jan 25, 2012 05:12AM lifechanging2011 wrote: Hi all, I feel so sad about all this. I've been a trooper so far, but  I start rads tomorrow and I woke up crying this morning. I'm so stressed out. I know that this is to help so the cancer doesn't come back, but I'm feeling really blue about it. I don't think I've ever felt so powerless. :O(  newksmom100: What is a seroma? How do you know you have it? tnhelen: I'm worried about the tamoxifen too. I see the MO on 2/14 so I'll have a better idea of the expectations, but I'm worried too.  Thanks for sharing everyone.",
      "MessageIndex": 319,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Jan 27, 2012 03:50PM lifechanging2011 wrote: Thanks for all of the suggestions about the bra situation. I will be looking into all of them. 2 down. 31 to go. My breast is looking pink and feels tender. I, too, can't really discuss my true feelings about this with friends or family.  I don't really want to hear one more time that it could've been worse. I know I'm lucky. I know it can be worse. etc..etc. However, sometimes I'm just not feeling so grateful. Sometimes I'm annoyed as heck that I have to go through this at all. People want to be able to fix it and make me feel better. I'd rather someone say to me, \"You're right ...your life sucks right now\"",
      "MessageIndex": 371,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 3, 2012 08:41PM lifechanging2011 wrote: newksmom100...interesting that you mentioned high blood pressure. I was diagnosed with high blood pressure on 10/27/11 and put on blood pressure meds.  I was diagnosed  with breast cancer 12/9/11. Lumpectomy 12/27/11.  I was taking my blood pressure meds on a regular basis and checking my pressure and it fluctuated, but lately my blood pressure is relatively low(normal) and I do not take my pressure religiously.  I was wondering if the high blood pressure was due to breast cancer. Can they be related?",
      "MessageIndex": 446,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 6, 2012 03:05PM - edited Feb 6, 2012 03:05PM by lifechanging2011 Hi all, I had treatment #8 today. Afterwards, the nurse wanted to see my skin. I was surprised because it was unexpected. My breast has been pink & purply.  Today, however, it's definitely red. I asked if this was usual at this number treatment and she said it's early for this color.  They usually don't see changes in the skin until treatment 10 or 12. I'm curious what the doctor will say tomorrow.",
      "MessageIndex": 482,
      "PostDate": "06/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 8, 2012 07:22PM lifechanging2011 wrote: Hi AnnAlive, I took off work today. I don't want the rads to take longer than they have to. # 10 today, only 23 more to go. Red today but not sore, thank goodness. The fatigue hit hard. Not necessarily all due to rads, but no matter how long I stay in bed I don't feel rested. I guess that's the definition of fatigue. I hope for a breather soon.",
      "MessageIndex": 510,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Jan 21, 2012 08:33AM lifechanging2011 wrote: Hi all, Thanks for sharing your experience, strength, and hope. It's definitely helpful to feel that I am not alone. anafoefana; God bless you. I teach first grade, regular ed and they are a handful. I can't imagine teaching self-contained special ed. Yikes. Of course, I didn't tell my students my situation but they keep asking me why I'm out so much. Since November 10th when this whole snowball issue started, I missed 8.5 days.  Between various doctor visits and radiology appts. Luckily I will do radiation in the morning before work. I'm just hoping I can tolerate dressing work appropriate.",
      "MessageIndex": 276,
      "PostDate": "21/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Jan 24, 2012 07:47PM lifechanging2011 wrote: I agree. I remember when I got the phone call with my diagnosis.  It took me  a few minutes to realize that when the doctor said, \"You have a small breast cancer...\" She didn't mean that I had a \"little\" cancer like I'll have a \"little\"  piece of cake...She really meant that I had the biggie \"breast cancer\" that happens to be small in size. Breast cancer is breast cancer no matter how small.",
      "MessageIndex": 315,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Jan 25, 2012 07:01PM lifechanging2011 wrote: newksmom100: Thank you for the clarification.  My surgery was a month ago and it still hurts to lay on that side.  My tumor was at 6:00 and the weight alone of my breast can irritate the area. I see an indent on my boob where the node was taken. I hope it goes away. hawk: When I first met with my RO and told him that I have rheumatoid arthritis which is an inflammatory disease, he said I would have radiation on my stomach so the radiation won't inflame my lungs or touch my ribs. When they talk about radiating your boob, you never think what it'll do to the rest of your organs; at least I didn't.If your lungs become inflammed you'd be prone to pneumonia. Kaara: when I was first diagnosed, I was told that my tumor was 6mm by multiple people.  My mother had all of her friends and her church praying for me.  After surgery, my surgeon was surprised to find that my tumor turned out to be 3mm.  To this day my mother believes that it was the prayers that shrunk the tumor. Wish me luck tomorrow. I see the nurse for 30 minutes and then I get my first zap. Thank you all for sharing your experience, strength, and hope.",
      "MessageIndex": 327,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 7, 2012 05:40PM lifechanging2011 wrote: #9 today. Very red. I'm exhausted. Fatigue has definitely set in, however, many factors; 3 arthritis flairs in two weeks, report card week last week, fighting off a cold, and #9 rad treatment. I feel like I have led feet. I took off tomorrow in hopes of feeling better.",
      "MessageIndex": 500,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 11, 2012 08:45AM lifechanging2011 wrote: It's Saturday. Of course I didn't have treatment today, but my breast feels like it's burning from the inside out. It was #12 yesterday.",
      "MessageIndex": 528,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 12, 2012 07:19AM lifechanging2011 wrote: Hi Christyn37, Thanks for your response. It did feel kind of like a blowtorch on the inside. I ended up taking a pain pill. It's not so bad today. It's crazy how every day is such a different effect; a new and different adventure to experience.",
      "MessageIndex": 544,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 14, 2012 08:58PM lifechanging2011 wrote: #14 done. 19 to go. I am  red and sore. My nipple area is very painful. I took a pain pill from the surgery. I get fitted for boosts next Monday whatever that means.  Met with the medical oncologist for the first time and I was told I am not a candidate for tamoxifin. Since I'm pre menopausal, there isn't a med to take.  I'm trying to wrap my head around the idea that I am only  doing lumpectomy with radiation. Not that I want to start meds, that was stressing me out, but the thought of not doing anything when my tumor was estrogen fueled. I feel like a sitting duck just waiting for the estrogen to grow another tumor.",
      "MessageIndex": 565,
      "PostDate": "14/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 17, 2012 01:44PM lifechanging2011 wrote: Hi all, #17 today. My nipple hurts so badly, it's almost intolerable. The doctor ordered lidocaine. So now I put aveeno lotion all over breast; lidocaine over the nipple, then aquaphor over nipple. I put a bandage over the area because it's a mess and it gets all over my clothes. It helps to a certain degree, but then I take a pain pill because I barely tolerate clothes. This sucks.  Due to the high degree of sensitivity my treatment was changed from 28whole/5boosts to 25whole/8boosts. Early on my side effects would come and go rather than accumulate and remain. I hope the weekend allows the sensitivity to subside a little.",
      "MessageIndex": 596,
      "PostDate": "17/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Jan 14, 2012 10:05PM lifechanging2011 wrote: Hi Maureen, Thanks for your post. I haven't started my radiation treatment yet, although I get mapped on Monday so I'm assuming my treatments start this week.  I asked my radiation oncologist about diet and he suggested a healthy diet but emphasized exercise to stay strong.  I was curious why you deleted earlier posts? Just curious. Traci",
      "MessageIndex": 185,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Jan 20, 2012 10:54PM - edited Jan 20, 2012 11:01PM by lifechanging2011 Hi all,  Well, I had my mapping on Monday. I was so stressed out and depressed  the weekend before that I stayed in bed all weekend. My mapping was fine, but I have to tell you that I am so tired of being the only one half naked in the room. This time there were 7 other people in the room. I mean seriously. They were physicists, nurses, and RO, but I'm the only one half naked.  I start my first rad treatment on 1/26. I will have 33 total...28 regular and 5 boosts. I'm concerned about burning and fatigue.  As it is, I had a lumpectomy on 12/27 with lymph node dissection.  The lumpectomy incision is fine although I get an occasional sharp  pain through my breast which takes my breath away. I was told it's healing and it's most likely a nerve twinge. However, the lymph node incision is healing but in an area that is constantly irritated by movement and clothing. So I've already been feeling uncomfortable...so side effects from radiation scare the heck out of me. I also have rheumatoid arthritis and get an occasional flair which is very painful. I think I've been handling this whole breast cancer bit well because I'm always willing to share about it so it's not the elephant in the room and you'll find me making some kind of joke about it so I can laugh, but I'm tired of this journey already and I'ts only just beginning. I think the surgery was the easiest part of this journey. I appreciate you all being here because people who haven't experienced this, don't understand. Just because I'm not complaining doesn't mean that I'm okay; or maybe I am complaining and I just need to be listened to, not fixed;  or just because you don't see me in pain doesn't mean that I'm not. I'm sorry for the ramble. I'm just trying to put one foot in front of the other, but sometimes my head has a temper tantrum  along  the way. Thanks for listening.",
      "MessageIndex": 269,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Jan 24, 2012 07:26PM lifechanging2011 wrote: Hi all, amf099..I start rads Thursday. I wanted to vomit before my first appointment with my RO. My reality is that I had a lumpectomy with a small tumor and clear nodes, but if the cancer returns I lose my boob. No other option.  I need to do as much as I can to prevent the cancer from returning.  I need to trust my doctors that they are making the best decisions for me.  Bottom line is that they see this on a regular basis. They know what it could become, so I will do what they tell me to do. I, too, feel times of depression and frustration.  I haven't started rads yet but I get these shooting pains through my boob. I emailed my surgeon and she said that was normal and they will get less and less.  No one tells you about the shooting pains that come without warning. I find myself holding or grabbing  my boob throughout the day because it aches. That is frustrating to me. This Friday is a month since surgery. I don't want to feel achey or pain anymore and now I have to deal with the radiation SE.  I see the nurse before my first treatment to find out how to treat myself through rads. I'm grateful for everyone hear because reading thru these posts helps me to figure out the questions to ask. Thanks.",
      "MessageIndex": 311,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 3, 2012 08:20PM lifechanging2011 wrote: Hi all, It's hard to believe that I've had 7 treatments already. Since day one I've been pink, purpley and sore. Some days my boob feels raw. I am vigilant at applying the lotion 3x a day. Sometimes I'm afraid to look at it in the mirror or even touch it. I think I'm a little swollen too. I am walking through this and I know I need to take this one day at a time, but god only knows what this is going to be like at treatment #33. Thanks everyone for sharing their experience strength and hope.",
      "MessageIndex": 445,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 3, 2012 08:44PM - edited Feb 3, 2012 08:50PM by lifechanging2011",
      "MessageIndex": 447,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 10, 2012 11:06PM lifechanging2011 wrote: Is heartburn associated with radiation therapy? I thought I saw someone mention it in a post but didn't pay much attention to it because I had experienced it. I've had heartburn most of the evening and that is not usual for me. Any input?",
      "MessageIndex": 523,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Jan 26, 2012 06:57PM lifechanging2011 wrote: Hi all, 1 down. 32 to go. I'm already pink and purply. This is going to be a long 6 1/2 weeks. I take medication that makes me sun sensitive. yikes. I was told to use Aveeno moisturizing lotion 3x a day. It was interesting and a little disturbing that when I was getting rads that they set me up on the machine, left the room and closed a door that was close to 10 inches thick. I'm thinking what's wrong with this picture. I'm laying half naked on the table and they leave the room closing this gigantic door behind them. oh well... Question: What type of bra or sports bra is most helpful. I still need to be able to dress work appropriate. I haven't been able to wear an underwire since biopsy and the sports bras seems so tight. If I burn...I don't know. Any suggestions?",
      "MessageIndex": 345,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 3, 2012 09:01PM lifechanging2011 wrote: Thanks Ralston. I take  medications for another condition that make me sun sensitive. I wonder if that makes my experience worse. I'll see the doctor on Monday or Tuesday. I've read through the previous posts and I can relate with the fatigue. My feet felt like lead today.  I don't totally associate the fatigue with the #7 treatment, but I've also had a number of arthritis flairs in the past two weeks, I'm fighting off a cold or allergies, and it was report card week. I'm exhausted.",
      "MessageIndex": 449,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 9, 2012 05:59PM lifechanging2011 wrote: Hi Christyn37, I was curious why the week after rads was going to be the worst? Also, why did you decide not to do hormonal therapy?",
      "MessageIndex": 514,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 10, 2012 09:36PM lifechanging2011 wrote: Hi Christyn37, Thanks for the information.Great analogy with the microwave. Also, thanks for sharing your story. I'm not looking forward to the SE with the tamoxifen. I'm 48. I want to reduce the possibilities of a recurrence  as much as possible because if it comes back I lose my breast. It's all very stressful. #12 today. 21 to go. I'm very diligent about using the lotion 3x a day all over the irradiated area, but my side got so itchy today I thought I was going to scratch my skin off. It's a spot I didn't even think would be affected.  I'm trying to be proactive but sometimes I'm just frustrated.",
      "MessageIndex": 522,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 13, 2012 06:16PM lifechanging2011 wrote: Hi all, #13 today. I'm red and sore. The nipple area is so sensitive it hurts. I'm tired tonight. Congrats to those who have finished.",
      "MessageIndex": 556,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Feb 14, 2012 09:56PM lifechanging2011 wrote: Sorry. I wasn't clear. Tamoxifin is for premenopausal women. I have recurring uterine polyps and my mom had endometrial cancer. That is what makes me not a good candidate. My head is swimming with thoughts. Sorry for the confusion.",
      "MessageIndex": 567,
      "PostDate": "14/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Jan 14, 2012 09:55PM lifechanging2011 wrote: Hi all, I had a lumpectomy on 12/27. Luckily, I don't need chemo. I met with my radiation oncologist last Wednesday and I go for mapping on Monday. I've been stressed out about this whole radiation process. At this point, it seems that the surgery was the easy part. I  also have rheumatoid arthritis, so I already suffer from fatigue and the medication I take for that makes my skin sensitive. I don't know what to expect from radiation. I can't imagine doing that 5 days a week for the next 6 weeks. I guess I need to be willing to do  anything that will protect me from the cancer...but I'm stressed out about the next part of the treatment process. Traci",
      "MessageIndex": 184,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "lifechangin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141199/profile",
      "Content": "Jan 24, 2012 07:38PM lifechanging2011 wrote: Oh yeah...I forgot to mention that I have to have a D&C over spring break.  They found a polyp in my uterus. Isn't that great. I'm weary. My life sucks right now.",
      "MessageIndex": 312,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    }
  ]
}