{
  "AuthorID": "lifechoices…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
  "Posts": [
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 18, 2017 08:39PM lifechoices2017 wrote: Teach70, I'll be taking Tamoxifen also when my rads are done. Haven't started yet, Nov 29-Dec 27..20 sessions",
      "MessageIndex": 323,
      "PostDate": "18/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 3, 2017 12:35PM lifechoices2017 wrote: Just reading your post; was just skimming through the topics to see what creams are being used for rads. I have my appts for scheduling next week and just wanted to see what my options are. Glad that you are coming to and end of the 'rads' journey! Gods blessings.",
      "MessageIndex": 206,
      "PostDate": "03/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 4, 2017 05:47PM lifechoices2017 wrote: THANKS! I found the Crystal yesterday with the cancer ribbon...but I'll look for the Toms! Thanks much for sharing. It's greatly appreciated. I'm sure as my rads begin I'll gave more questions. I'm gonna be glued to these posts.",
      "MessageIndex": 226,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 7, 2017 12:37AM lifechoices2017 wrote: I read these post and realize that I'm in the midst of some very strong people! It's like we need a table of contents for ailments, side effects, skin reaction, etc... but I must say each tidbit of info is very helpful. Met with my MO today; no chemo..but will take tamox once rads are done. I meet my RO Thurs so I'll know more on that at that time. One thing for sure I'll be well supplied with lotions and creams ... and tea for the journey. Thanks to all for sharing, it's greatly appreciated. Continued prayers....",
      "MessageIndex": 240,
      "PostDate": "07/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 10, 2017 11:01AM lifechoices2017 wrote: SpeedyTeach; yeah they told me that I could treat a week before AND 2hrs before my sessions and then again right after. As Im reading most on these post lotion like 2-3 times a day but I guess I'll figure out those times once I find out the exact times of my treatments. What was the lotion/spray that they gave you? He also said that I could shower with 'warm' water...not too hot, but not cold (sounded like the three bears) lololololol... but he said because the breast temp may be different inside/out because of the rads its best to try to bathe in a lukewarm water. I asked what soaps to use; he did say I could use the Miaderm soap, but I already use Dove and he said that'd be ok. Just to make sure that I get a 'good lather' before putting it on my skin as I wouldnt want any 'dry' patches to rub and irritate the skin. AND... he said as for undergarments, a nice supporting cotton bra would be best for everyday. Said that other fabrics may cause sweat/moisture but cotton will keep it dryer. I did ask if I needed to sleep in a bra...he said probably not going to be comfortable but a loose fitting cotton tshirt would probably work. He said that allows the skin to breathe and doesnt 'confine' me in my sleep (lol) ... Im a 42DD so it takes alot to confine them. Lastly he said that w/me doing the prone breast radiation most of my affected areas would be the breast seeing that it wouldnt affect my arms and top stomach area; doing this allows the 'part where our breast falls' to not be as irritated and that should also help w/wearing a bra. Its a waiting game; but one that Im near ending so we'll see. THANKS for your feedback, its greatly appreciated!",
      "MessageIndex": 272,
      "PostDate": "10/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 4, 2017 05:29PM lifechoices2017 wrote: Dodgersgirl Thank You! I think after my appts this week I'll be purchasing some green tea, aquaphor, miaderm and radx...lol...seerms to be the going 'preferred' treatments...",
      "MessageIndex": 224,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 7, 2017 05:01PM lifechoices2017 wrote: question for all...MIADERM! im seeing great reviews on amazon...do you use the kind with lidocaine? and did you use the soap? or just the lotion? Thanks,",
      "MessageIndex": 245,
      "PostDate": "07/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 7, 2017 05:08PM lifechoices2017 wrote: I also saw this on one of the reviews: (MIADERM) I like this product, although I really needed only three tubes for my treatment period of 5 weeks. Treating the radiated area with chamomile teabags worked really well when the skin was burned (not just red). I used both, as well as silver oxide. I bought Miaderm for my wife who just started her radiation treatment and she was able to continue though 5 weeks of therapy without a lapse of treatment. I was surprised when the Oncologist and the Technician was not aware of the product. Now they do! They were only recommending aloe vera before - no longer ! My wife gave another patient a tube of Miaderm and for her it made a world of difference in the recovery period after her therapy. A bit pricey - But in our opinion worth every drop!",
      "MessageIndex": 246,
      "PostDate": "07/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 8, 2017 08:22PM lifechoices2017 wrote: Lojo100 yeahhhhhhh on your GRADUATION!!! Glad to hear that you are done and that your SEs were minimal. My journey will start soon, I pray that I'll be as much of a trooper as you've been! Enjoy your no appts and enjoy your downtime:)",
      "MessageIndex": 261,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 9, 2017 12:30PM lifechoices2017 wrote: Dodgersgirl: AWESOME! sorry about the itching and pain; but now the countdown is ON! Will be heading out for my rads consult in a few..I GOT THIS!",
      "MessageIndex": 265,
      "PostDate": "09/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 10, 2017 10:11AM lifechoices2017 wrote: SpeedyTeach; WAY TO GOOOO!!!!! Yeah for you... I will have 20rads beginning Nov 27 - Dec 22...prayerful that my body endures well! My RO mentioned the Miaderm on yesterday and Ive seen post on that so hopefully that will do me well. I do have a question for you; did you use ANYTHING before your sessions? or did you wait until your symptoms showed. I see some post that suggest to wait until you see signs; others start lotioning like a week before. Just trying to get a feel for what works best (knowing that what works for one may not work for another)...but still just hearing the feedback helps. CONGRATS again on your 'finale'!",
      "MessageIndex": 269,
      "PostDate": "10/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 30, 2017 01:36PM lifechoices2017 wrote: Dodgersgirl...YIPPPEEEEEEEE.... CONGRATS!!!",
      "MessageIndex": 394,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 13, 2017 05:49PM lifechoices2017 wrote: DodgersGirl; ok so I must be right on your heels! lol My surgery was Oct 19th; clear margins/nodes so again my rads will be whole breast only (no under arm). But yeah, im praying for lessened SEs. I was telling my sister that 'most' of the post showed signs of SEs around the end of 10-15 sessions; so Im prayerful that if I 'behave myself' and discipline myself of foods; water, exercise and lotions that as you say my countdown will be seamless! But yeah, those dang strips are something else. The one under my arm from the SNB has been off now for like 2weeks and that is completely closed and almost smoothed back to my skin. The one around the nipple is smoothing out, but still a bit pinkish from the strips coming off. Im gonna continue to treat w/neosporin and eucerin so that it should be back to my natural skin by the 27th. You'll be ending yours right as mine start so let the 'healing process' continue!",
      "MessageIndex": 287,
      "PostDate": "13/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 13, 2017 04:47PM lifechoices2017 wrote: DodgersGirl; you are just moving right along! GREAT!!! Almost reaching that light at the end of the tunnel; thats awesome! Glad you are feeling good as well. I was wondering what the reaction too would be for my lumpectomy scar; its around nipple. My surgery was Oct 19th and the glue strips just finally washed off over the weekend. Its healing good though. I had the pinkish 'healing' before it goes back to my 'brown' skin. I won't have rads until Nov 27th and nothing under the arm so my SNB scar 'should' not be affected (and because im laying in the face down position) just w/right breast rads. Ive been treating the scar w/a dove lather during my shower and eucerin and neosporin (mixed). Its doing well; just want it more healed before rads (crossing fingers and prayers to God). Just want my skin to be in its best health for what it'll endure for the 20days. I guess Im nervous on one hand of the SEs and anxious at the same time to just get started...uggggghhhh...",
      "MessageIndex": 284,
      "PostDate": "13/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 14, 2017 06:10PM lifechoices2017 wrote: Thanks all for the post because Im heading out for some errands today; thinking Aquaphor NEEDS to be on my shopping list. I saw the 14oz in the store; are you all saying that it comes in a bigger container than that? Also... if 'we can'... because we have SOOOO many that are in rads and many about to start... can you all put in the beginning of your messages where you are so that us 'newbies' that won't be starting until later know where 'we' all are. (ex: 17/28, 24/30 or starting Nov 27...). This will help (i know for me) know who to ask what questions as we travel this journey... OR if you are like me, have a 'buddy' that will be 'radding' with you. THANKS ALL ;-)",
      "MessageIndex": 297,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 19, 2017 12:00PM lifechoices2017 wrote: Teach70, yeah...have to get these rads starting and over and yes on to the Tamox posts. Everything has a SE..but you know what, it rids cancer from my body so I continually pray for continued healing and that whatever God provides for my path that it's only to restore my body whole!",
      "MessageIndex": 327,
      "PostDate": "19/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 14, 2017 01:52PM lifechoices2017 wrote: SpeedyTeach; thanks! I go for my simulation Thursday; I'll ask about it...thanks much! My Miaderm order should be received soon, Ive been using Eucerin on my right boob and neosporin on the scar; pretty much healed (just still a little pinkish), but should be skintoned before my rads start Nov 27th. As I stated before; noone really knows what will work best for their skin until it happens. Having supply of everything will at least be good for when I need it; so again thanks! Linwentz; Im not a teacher, Im the admin for the principal of the school; actually I will have 18yrs w/the school system on tomorrow (GO ME)! I totally LOVE my job! Ive been blessed since my Oct 19th surgery to have ONLY missed (4) days of work. Oddly enough I worked in Human Resources/Benefits for 12yrs prior to coming to the school so I was glad to be 'one-up' on knowing the how-to's of my out of office days; etc. I planned them for everyone else and now its my turn; go figure ;-) I have a small staff of 15; and I have NOT shared my journey with all. Those that I have; have lived through this (loss of spouse, mom, one has a daughter that had a mastectomy and another her daughter is in remission of lymphoma)...I do have a great support team. PauletteK I think you and I will be on the same rad journey; late Nov into December..LETS GET IT ... LETS DO THIS! WE GOT THIS...",
      "MessageIndex": 293,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 19, 2017 11:57AM lifechoices2017 wrote: DodgersGirl, SEs on your back? I pray that the lotion treatment keeps you a mend as you finish out your sessions. I will say a prayer for all to have as lessened SEs as possible.. I'm ready to start mine, I think...lol. or maybe I'm ready for them to be over. Lol.",
      "MessageIndex": 326,
      "PostDate": "19/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 20, 2017 05:02PM lifechoices2017 wrote: THANKS ladies... my RO did say that their patients use Miaderm, but other than that i didn't hear any others. I'll ask more when I go to my first session. I know everyone has different skin and all so that too plays a part. I am a brownskinned girl so being out in the sun is never my thing, so honestly I have no idea what a sunburn feels like; nonetheless how to treat one...so yeah, this should be interesting. Lol.",
      "MessageIndex": 335,
      "PostDate": "20/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 25, 2017 06:09PM lifechoices2017 wrote: Welcome Silver2000... Sounds like you are gonna be an End of Nov Rad Partner as well. I start on the 29th. I too am a lumpectomy, prone position, right breast, clear margins and nodes ...20 sessions; Tamoxifen to start on Dec 28th. These ladies here have helped me to prepare my shopping list for this now I just need to prepare me. I feel like this is the hill just before the end of the race so I'm staying positive, motivated and thankful! The journey continues but I got this! Prayerful for all on this upcoming process...WeAreFighters!",
      "MessageIndex": 356,
      "PostDate": "25/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 30, 2017 01:58PM lifechoices2017 wrote: DodgersGirl your getting to this point is already a blessing INDEED! The what ifs are going to come; but when you look back over how far you've come ... girl we can pretty much tear down mountains... Im so happy for you to be at this part of your journey...I'll be there in 18 more sessions and I CANNOT WAITTTTT!!! Again, many CONGRATS!",
      "MessageIndex": 396,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 3, 2017 11:48AM lifechoices2017 wrote: Ok, kewl... yeah because ive used Dove or Suave all my life but now since the surgery Im only doing my left armpit (lol) and nothing but just showering under the right. Im not an aggressive sweat..er... but i can tell at the end of some of my days there's a slight stickiness from the sweat. Not alot of odor, but more like sweat odor...hard to explain. But thanks. Just trying to get my hygiene lined up for the coming weeks. I saw your post on the tea bags and actually saved it to my email for the rads treatments. Ive saw a few w/aquaphor, aveeno, aloe and miaderm so will see what works best. Again, i havent started yet, but its soon to come (prayerfully lessened weeks) since my pathology reports came back as they did....will keep you posted. Any information, tips, or whatever you can give would be great. Im not asking you to be the 'guru of rads' but having someone to give any information is extremely helpful to a newbie. Thanks again!",
      "MessageIndex": 41,
      "PostDate": "03/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 4, 2017 11:47AM lifechoices2017 wrote: Dodgersgirl I love your sense of humor. You have alot of valuable info for us newbies so although you are not casting in ChicagoMed, we thank you for sharing. Again, I don't know if mine will be shortened my surgeon was just 'thinking maybe. And while I have you here, can you tell me appr how long is a rad session; not including set-up and all. Also, one post stated not to apply any apply creams prior to the visit but to start lotioning your skin faithfully 3xs a day like a week before and drink plenty of water. Another post someone said she applied cream an hour before going and right at the end of the session....help! Guess I'm just nervous on what to expect day one to day...whateber. Thanks",
      "MessageIndex": 48,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 4, 2017 12:25PM lifechoices2017 wrote: 53nancy, omg... my timeline was amazing! Mammo 9 15, Digital Imaging 9 19, Biopsy 9 21, Surgeon Consult 10 2, MRI 10 11 and Surgery 10 19... BRCA and MammaPrint results all in... and yes both MO and RO this week...it was like a whirlwind of days but I thank God for the best med team. They care and they talk it out with me. I'm single, never married no kids but my wonderful guy in my life and my family and friends are the best support ever. No-one wants this news but im thankful to be surrounded by a great support team. Still I'm anxious and nervous on this journey but God is a healer and I'm just moving on this path completely with Him as my guide. I've already had my followup scheduled for Jan 24 2018 so by then I should be on meds. Again, I'll continue to keep an eye out for you and your wellness journey. God's Blessings.",
      "MessageIndex": 50,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 8, 2017 05:44PM lifechoices2017 wrote: Brightness456 that's Great! I'm hoping I'll have reduced rads as well; clear margins, nodes, genetic and MammaPrint negative... Will you have the 2 sessions each day? I Know that once my rads are done I'll be on tamoxifen... for that prescription filled after my MO appt Monday.",
      "MessageIndex": 109,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 8, 2017 06:07PM lifechoices2017 wrote: Brightness456 that's Awesome! Funny to type rads being awesome...but really that is! I too would be soooooo ready to start and be done. I'm praying for the same...less is more...lesser sessions but more than enough to 'heal'! Can I ask how long your 'actual' rad will be. I've seen some post 10-15 min. Others it's like 2-3 min of rays... I'm so happy for your abbreviated session. I already know that you got this and will do just fine!",
      "MessageIndex": 111,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 8, 2017 06:27PM lifechoices2017 wrote: Georgia1, same here...clear nodes and margins. But ok, yeah..ive read so many post and haven't seen the same treatment yet. I guess we are all unique:) I'll be sure to ask away and prayerfully complete my rads as comfortable as possible. Good luck with yours!",
      "MessageIndex": 114,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 8, 2017 07:36PM lifechoices2017 wrote: AngelaJL, I just turned 49 Oct 28th.. they did my pregnancy test the day of my surgery, 10/19... lol I could have saved that test money for them...lololol. Thanks for the info....",
      "MessageIndex": 117,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 17, 2017 05:41PM lifechoices2017 wrote: NikJ I'm glad to see this post. I'll be having the same. 16 and then 4 boost.. What lotions did you use? And what time were your sessions?",
      "MessageIndex": 212,
      "PostDate": "17/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 27, 2017 06:51PM lifechoices2017 wrote: Georgia1 I too purchased a few protein drinks for my journey. One of them had 26grams and I figured with my tuna and chicken and nuts I'll do prayerfully ok. I have my first session Wed and it's at 11. Hoping I'll be in and out in an hour or so and back to work... my first 5 are around 11-1230, so I'll go back to work. My last 15 are at 230 so ill go home from there; braless! Whoohoo... Glad you had a good first day, I pray that all continues well for you.",
      "MessageIndex": 351,
      "PostDate": "27/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 29, 2017 04:47AM lifechoices2017 wrote: Good morning all...5:45am... Thank God for a good nights sleep. Off to work in an hour; first rads at 11am .... 20sessions and the countdown begins! Everyone have a Wonderful Wednesday...",
      "MessageIndex": 390,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 29, 2017 12:28PM lifechoices2017 wrote: IM BACCCCCKKKK... left work @ 10:30; got to appt at 10:46... had my 1st of 20 sessions; all went well! Appt was at 11am; went right back; undressed/robed; prone position on the machine and they had to make sure of my 'fit' since it was my first session. Remarked my tattoos w/markers for the rad beams; did xrays and I was on my way back to work at 11:48... back in the office at 12noon ;-) I meet w/my RO every Thursday so my session tomorrow will be about the same. All thereafter will be in/out (prayerfully). I did find out the 'exact' areas that are being treated. Just above my boob; and just under the fold and if you were to touch your bra line right under the arm; about there down the sides. I have my nodes scar toward the front of my armpit so it'll probably hit just near that spot but NOT under the arm. The techs said they just wanted to make sure they covered that area (even though my nodes and margins were clear)... but she said doing this will 'hit' any nodes 'creeping in that area and behind the breast'. I feel pretty good. I Miadermed... lol... this morning after my shower (630am) again at 9am (2hrs before my session) and again when I left...and I'll Aguaphor tonight. This has been my process for the past week (prior) to my sessions so im hoping it does my skin well. To all that are completed; 1/2 way there OR not yet started WE GOT THIS!!!... Im finding that although this part of my day is not the normal routine BUT I try to make EVERY OTHER ASPECT of my life 'the same normal'... if one thing has to be out of sync; I cant allow EVERYTHING to be out of sync. Staying focused and prayed up and before I know it i'll be DONE! CONTINUED PRAYERS OF SUPPORT for each of you!",
      "MessageIndex": 396,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 29, 2017 12:54PM lifechoices2017 wrote: Teese...YEAHHHH!!!! for you... Yeah, the receptionist told me today that on my upcoming 'visits' that I dont have to check in; i can just go to the back 'disrobe' and go to the waiting area. I'll have to stay 'robed' after my sessions on Thursdays to meet w/my RO; but all other sessions i get to walk in/out... GO ME! I live 40min from the facility; but only work about 10-15min; so the rest of the week i'll go to work; rads and back to work ... next week i get to come to work; rads and HOME! that'll be a treat as then I can leave lotioned and 'braless'! SO happy that your first couple of days went well; WE GOT THIS... let the countdown continue!",
      "MessageIndex": 398,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 29, 2017 05:23PM - edited Nov 29, 2017 05:25PM by lifechoices2017 Ok, trying to respond to the recent post 1. I have black tattoo dots, but today my 1st session, they still circled them with a marker. 2. I love the positive attitudes of everyone. Yes, I know this is a new norm, but we are making it the best new norm EVER! 3. 2017 BC SisterSite would be great! Ive learned so much from each of you and just thinking that if the ROs saw how much we've learned they'd have us to do the new patient consults; free of charge! ROs see way more than we do, but having a room full of knowledge on one site is sooooo helpful. 4. I don't have blue skies in my rads room, just that dome roaming my body. But as I lay there today, the song playing was Beat It by Michael Jackson, I was like Yep...i am gonna beat it! So hopefully each day I'll have a new song to sing as I get beamed:)))) Lastly...5. Ellyn27, I too am ticklish. Every time they dot my spine with that marker I cringe. As for the machine looming over me. I also close my eyes, I'm like if I have to be here I don't wanna feel like I'm being roasted in a rotisserie...so I just sing with the radio and know that by the end of a song, or two I'll be back in my clothes in a few. We're fighters. We're strong and we have a story that only we can tell. Cancer may be our connecting agent. But strength is what holds us together.",
      "MessageIndex": 411,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 29, 2017 07:32PM lifechoices2017 wrote: Georgia1 I also take a multivitamin, always have so I hope that adds to the positive!",
      "MessageIndex": 418,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 3, 2017 11:16AM lifechoices2017 wrote: I will be going for my medical and radiation appointments next week (my history; just turned 49 (oct 28th) mammo sept 15th; digital 19th; biopsy 21st; confirmed 25th... mri Oct 11; SNB and Lumpectomy Oct 19th)... HR/PR+ and HER2-... BRCA/negative and Mammaprint/low risk... what life changing 30 days (BUT GOD)! Can someone help with any suggestions on deodorant? lol Not sure of my rads treatment yet, will know more next week... but im adding this to my fav post to stay up to date on others that just recently started. prayers lifted for all during your journey.",
      "MessageIndex": 39,
      "PostDate": "03/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 10, 2017 07:13AM lifechoices2017 wrote: CEL82; good morning. We must be on the same schedule. I too met w/my RO yesterday and my sessions will start Nov 27th - Dec 22nd. (4weeks). I will be doing the on my stomach rads; says that since its whole breast only he didn't want any of the SEs to bother the skin under the arm or under the breast. Doing it this way will 'beam' (lol) the breast tissues only. I did ask if I could start the week of Thanksgiving and he said that if i had started NEXT week he would have been ok w/me having that thurs-fri of thanksgiving week off; but since i hadnt started he didn't want me to start w/missing those two days....oh well... Im just glad to know that Im soon to be on my last lap around the track... prayers lifted for smooth sailing and smooth skin... the countdown soon to begin!",
      "MessageIndex": 122,
      "PostDate": "10/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 12, 2017 05:01PM lifechoices2017 wrote: Linwentz... glad to hear your boob is on a good rad jpurney:) My order of Miaderm should be here this week. My simulation is this Thurs; rads to start the 27th. I plan on smoothing my boob in advance so that it helps. My RO said could lotion the day of rads, just do it 2hrs before. I have 20 sessions so I too hope that mine go well! Question, how often do you lotion and do you keep any of yours in the fridge? PauletteK, yes that's what I ordered.",
      "MessageIndex": 137,
      "PostDate": "12/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 12, 2017 09:13PM - edited Nov 12, 2017 09:14PM by lifechoices2017 53nancy... I paid $128 for the 4 tubes... they came in a 4pk Georgia1 and Linwentz, so you dont lotion at all prior to your rads? Did you lotion the week before?",
      "MessageIndex": 145,
      "PostDate": "12/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 17, 2017 06:03PM lifechoices2017 wrote: NikJ ok... my first 5 are around 11-1230...the rest are at 230; I leave work, go there and then home. My first boost will be 1130, then the last 3 @ 230...i requested the afternoon so that I could to work, go there...lotion up and go home braless. Lolololol... I'm praying for good results as well. It's like the fear of the unknown... but I've made it this far so I'm ready!!!!",
      "MessageIndex": 214,
      "PostDate": "17/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 19, 2017 07:01PM lifechoices2017 wrote: PauletteK, 53Nancy... Yeah hadn't heard anything on the antioxidants. I take a multivitamin daily? And maybe once a week I'll or every other I take an EmergenC... DodgersGirl...I also drink a glass of the 50/low suger orange juice each morning. I know on Tamox it says not to mix with grapefruit and tangerine... does that mean no OJ either?",
      "MessageIndex": 239,
      "PostDate": "19/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 20, 2017 07:40PM lifechoices2017 wrote: Georgia1 same here! I got 2 tats on my back. One at the top of my back, the other almost midway...and one each near my bra strap under my arm. They won't rad there, but just to align me.",
      "MessageIndex": 270,
      "PostDate": "20/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 29, 2017 07:27AM lifechoices2017 wrote: 53Nancy; 1/2 way there...AWESOME!!!! Can I ask what your SEs are so far?",
      "MessageIndex": 395,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 29, 2017 07:01PM lifechoices2017 wrote: I still have to purchase the calendula cream. Right now I miaderm morning, 2hrs before rads, right after rads...aloe gel when I get home and Aquaphor at bedtime. I did purchase the cortisone cooling gel for itching that may come... and I keep my aloe in the fridge. It feels good when I get home. I also have Eucerin and CeraVe, but I don't want to keep mixing. I want to see what works. But I've seen a few post on the calendula so i need to add that to my lotion arsenal:) For all that's on this journey; it'll go by quicker than we know. Just gotta keep it moving and stay lifted!",
      "MessageIndex": 415,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 29, 2017 07:30PM lifechoices2017 wrote: Georgia1 Thanks! I'm just on rad1 so I'm trying to stick to a pattern, if that's even possible. Lol. I'll continue with what I've been doing and just let the countdown continue. Thanks again.",
      "MessageIndex": 417,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Dec 5, 2017 01:51PM lifechoices2017 wrote: You ladies are giving me hope! Congrats on your countdown and doing so well. I'm just finished my 5th rad of 16 whole breast and then 4 boost. No SEs so far. Every now and then I get the internal twinges but no pain. Im lathering and lotioning like nobodies business sooooo prayerful that all continues well.",
      "MessageIndex": 477,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 4, 2017 11:28AM lifechoices2017 wrote: 53nancy, continued prayers on your journey. I go for my MO appt Nov 6 and RO appt Nov 9..im guessing my rads will soon follow. Diagnosis confirmed Sept 25, MRI only this one spot. They thought 1cm... Surgery was Oct 19 lumpectomy about 2.5cm, clear margins and nodes. BRCA negative and MammaPrint low risk; but im 49 yrs old, HR/PR+ Her2- . My surgeon said I may have a short rad time as well and maybe partial breast, but did not want to say for sure until I had my official Onc appts. I'll continue to follow your post on the 16sessions. Prayers lifted ...team winning...!",
      "MessageIndex": 46,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 6, 2017 06:41PM lifechoices2017 wrote: Linwentz.. Yes, all about the attitude! But you got this!",
      "MessageIndex": 84,
      "PostDate": "06/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 6, 2017 08:03PM lifechoices2017 wrote: Is anyone doing their rads in the afternoon? Or just in the morning. Trying to see how you are during the day, tired, fatigued, treatment? Or does anyone do them after work...or the afternoon and then head home? Will meet RO Thurs and trying to think about what time would work best. My facility is about 15min from my job so seeing if it's best to go there then to work? Or to work and then there to home. And I see on the post that you can't treat your area before the session...how often are you treating your area during the day?",
      "MessageIndex": 88,
      "PostDate": "06/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 8, 2017 05:26PM lifechoices2017 wrote: Georgia1... I go for my RO appt tomorrow. Guessing I'll be doing my fitting as well. So 20min sessions? How is that determined? Just want to have an idea or what questions to ask my RO. I too am thinking my sessions will start after Thanksgiving, but who knows. I guess I really just want to find out how many, for how long and as you said just want to get them started and count down to zero! I've ordered my miaderm and will get aquaphor and green tea :) I guess i will be starting my 'spa' days soon!",
      "MessageIndex": 107,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 13, 2017 09:24AM lifechoices2017 wrote: Linwentz; thanks for your reply. I guess Im trying to dodge the SEs as much as I can. But as previously posted everyones SEs are not the same. I won't know my schedule until my simulation this Thursday so I guess that too will determine when or how often Im using it. As for the week before, I may just start just to make sure my boob is 'soft' and smooth. lol... I drink plenty of water on a regular now but will add more veggies to my food intake. I also take vitamins daily so hopefully with all of that and prayerfully staying healthy that will play a part as well for the better. Integragirl; Linwentz is correct, you have every right to feel however you want. MOST days Im 100% 'winning', but some days I get that thought in my head like really, is this my life. But then Im reminded one day at a time...and before you know it as Linwentz stated; normalcy will soon follow. I too have a journal. Some days my writing is all peaches and cream; other days i write in CAPS as if im screaming my words on paper. But it helps. Noone can know your true thoughts but you and although my support team are like the BEST EVER still some days I can't even relay to them how i really feel. Linwentz, this too is my last lap (rads); and then on to tamox.",
      "MessageIndex": 150,
      "PostDate": "13/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 13, 2017 11:41AM lifechoices2017 wrote: Linwentz; control freak...funny you say that because that is SO ME! OMG... for as OCD as I am; Im like I have no control over this so Im just letting God do what He does best. Again, honestly, i think thats where my anxt comes in because its like i want all the answers, and I want it done, I want it done now; and I want it done quickly. I want to know how it feels, how it looks, what to use, what not to use and how much of whatever to use (lol)... BUT I know thats not the case so Im being patient and obedient. At my job we do this thing called One Word; its a book about choosing a word and identify why that is who you are. Oddly enough my word for the school year was 'choices'. I guess I had no idea how many Id have; but at the same time, how many I wouldnt have. RIght now; im choosing life, health, and peace of mind. So for all of the 'controlling' that I'd want to do right now...my 'choice' is already 'chosen' for me and that's to follow doctors orders! Relinquishing my control is not so easy sometimes, but I guess in this situation God is showing me that He's in control and you know what IM GONNA LET HIM! I thank everyone here for posting their journey; you never know how somewhere in a line or two how it can uplift someone else and help them along the way.",
      "MessageIndex": 156,
      "PostDate": "13/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 16, 2017 08:55PM lifechoices2017 wrote: AngelsGal57, thank you for that testament. And I'm sure that as my journey continues I'll be doing the same. I think as I made my personal vows to God I just wanted a close and tight circle. My family has endured much over the years and I already know this testimony will be great..my dad almost suffering an aneurysm, my mom DCIS when she was 60 and my nephew was in an accident at 18; now a quadriplegic... But God! My dad is 79, healthy ... mom 72 and her body healed and my nephew is a graphic designer/architect for our state office...and he drives in his wheelchair...so Lord knows we have a story to tell. Thank you for your blessings and prayers; I pray for your continued restoration and healing.",
      "MessageIndex": 207,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 19, 2017 07:04PM lifechoices2017 wrote: PauletteK I had my mapping done and my schedule given the same day. That took about an hour. I'll have my first session next Wed. They daid that too would be about an hour because they want to make sure everything is lined up. Said maybe the first 2 sessions would be like that. But all thereafter should be in and out. We'll see about that. Lol",
      "MessageIndex": 240,
      "PostDate": "19/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 21, 2017 09:35PM lifechoices2017 wrote: sumnyjay I saw an earlier post for the Fruit of the Heart aloe... I just purchased that today. I've been lotioning with Eucerin in the morning and Aquaphor at night. I'll try to keep the gel or the miaderm cool for after rads... and a cotton t to sleep in.",
      "MessageIndex": 285,
      "PostDate": "21/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 25, 2017 02:18AM lifechoices2017 wrote: HELLO Milkweed... I've gotten my bras from Lane Bryant cotton no wire. Kinda pricey, but I'm a 42dd and they support the girls well. I have Miaderm and I start next Wed, so I've been lotioning 3xs a day. I've been wearing a cotton t-shirt to bed. I'll be doing 20sessions, prone... But I've been lotioning a wider area than just the boob. For deodorant I'm using Crystal with the pink top. Looks like a few of us will be on our rad journey this coming week. Praying for all for healthy bodies, lessened SEs and strength to endure with minimal fatigue.",
      "MessageIndex": 318,
      "PostDate": "25/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 27, 2017 07:30PM lifechoices2017 wrote: OCDAmy, I'm not sure but I'll ask Wed.",
      "MessageIndex": 355,
      "PostDate": "27/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 29, 2017 01:18PM lifechoices2017 wrote: Angelsgal57 great words! And im pre-menopausal @ 49yrs old; but this is my 'hormonal' week and yes, yesterday was emotional for me too. I guess just my mind consuming how far Ive come and this being the last lap of my journey (and then tamoxifen). So yes MOST DAYS ... I GOT THIS... but since Sept 15th; i have had moments of 'got nothing'. lolololol. Im truly thankful for my support team and prayer warriors and for this outlet of strong women. Expressing fears, strengths, weakness, pain and yes a few jokes along the way. I remind myself that oddly enough this 'could' have been worse; so im thankful that I at least get a 'fix'... so many dont have that option. Its hard some days but truthfully MOST days im at 100%. Its just those 30sec or 5min moments that get in your head and you are like am I really in this place. You say YES I AM and then say 'but i will NOT STAY IN THIS PLACE'... My scripture for each of us; and especially personal to me: Romans 8:18... For I reckon that the sufferings of this present time are not worthy to be compared with the glory which shall be revealed in us. We have yet to see all that God can and will do in our lives so with that I press on. As always, continued prayers of strength, healing and peace for all!",
      "MessageIndex": 401,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 3, 2017 12:06PM lifechoices2017 wrote: Thanks! Ive added all of this to my favs for my 'shopping' reference! I really appreciate you all feed back...",
      "MessageIndex": 43,
      "PostDate": "03/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 6, 2017 09:31AM lifechoices2017 wrote: tlfrank... im with you. You know my family says that im a controller, but for all the things that i can control this 'situation' lol is not one of them. I already have anxiety and now after reading some things its only heightened. I've probably googled more since Sept 19th than I have in a lifetime. Some things I wanted to know; some I didn't. I will say that nothing prepared me for the needle for the sentinel node biopsy...OMG...but GOD! I have my MO meeting today and my RO meeting on Thursday so I too will be starting rads soon. Ive spoken w/quite a few on here and Dodgersgirl has been very informative. I told her the other day I feel like I need to run out now to buy aquaphor, miaderm, green tea, and radx... not sure which one will work the best but from the post they all seem to help greatly in some way or the other. My continued prayers for you and all that are on this journey; one step at a time...one day at a time. ",
      "MessageIndex": 70,
      "PostDate": "06/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 8, 2017 07:38PM - edited Nov 8, 2017 07:38PM by lifechoices2017",
      "MessageIndex": 118,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 15, 2017 12:08PM lifechoices2017 wrote: Ellyn27: Hellloooooo... I will be doing the exact same! I have my mapping tomorrow as well and will start my sessions Nov 27th; face down (with the booby hanging) and will also be doing 20 sessions (ending Dec 22nd)! I too am rather busty (42DD). The doctor said this position was best for me and prayerfully it will lessen the SEs (in reference to it ONLY targeting the boob) and not the underarm; ribs; etc... Ive already set up my lotion and creams station (Eucerin, Aquaphor and Miaderm)... will look for the spray Aquaphor that was mentioned in an earlier post. I don't have alot of preparing to do for the holidays per say; but I will be putting up my tree Thanksgiving weekend; my tree at work (in my office) probably the week after Thanksgiving...and I usually put up my mom/dads mid-December. Im hoping that w/me being just 2 weeks in I'll still be feeling pretty good and will then just start counting down. Once my rads are done; I'll be on tamoxifen... Keep me posted on how your session goes tomorrow and I'll do the same. My appt is at 230...BEST OF LUCK with your session and on our 'last lap'!",
      "MessageIndex": 198,
      "PostDate": "15/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 20, 2017 02:52PM lifechoices2017 wrote: 553Nancy any sunnyjay... I've seen post where ppl say use nothing until you see an SE... others say lotion up a week before...others are lotioning 2-3xs a day.... uggghh....what to do, what to do?!?.. Like you don't wanna lotion and not needed. But then you don't want early SEs and wished you had. I start next Wed for 20sessions, and I don't know what to do. My RO was like, don't worry about getting anything because we have creams to help. But in my head I'm hearing, girl go buy everything because you're gonna need it. Lol.",
      "MessageIndex": 258,
      "PostDate": "20/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 20, 2017 04:14PM lifechoices2017 wrote: I've been using Eucerin each morning and Aquaphor at night; that was just for the scar and healing from my surgery. The Eucerin is light enough under my bra to not feel like gunk during the day...and at night so that my skin stays soft and not dry out I'll use the Aquaphor; and I shower with Dove. Again I don't know what will work until my rads start, as you said I guess I just want to be prepared.",
      "MessageIndex": 261,
      "PostDate": "20/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 22, 2017 12:55AM lifechoices2017 wrote: sunnyjay the Fruit of the Heart aloe, I got from Wal-Mart! It was less than $2.... The Aquaphor I got from a local pharmacy and the Miaderm I purchased offline; Amazon.",
      "MessageIndex": 287,
      "PostDate": "22/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 25, 2017 04:34PM lifechoices2017 wrote: Yeah, I'll be purchasing the calendula cream as well..i have been using Miaderm a week ahead morning, afternoon and Aquaphor before bed. I plan to do the same after my sessions start. I'll be using aloe when I get home. Been keeping that in the fridge so that it's cool on my skin... I'll continue to do the Aquaphor at bed because as everyone says that's thicker on the skin. The Miaderm dried pretty quick and doesn't seem to be too messy. I did read on the instructions for miaderm that you can use 1hr before rads. Will have to check with RO on that. Im wearing cotton t-shirts to bed now and cotton bras, no wire.",
      "MessageIndex": 327,
      "PostDate": "25/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 25, 2017 05:08PM lifechoices2017 wrote: DodgersGirl, this is a crazy question...but I'm a brownskinned girl, my skin probably won't turn red lol...at least I don't think so as I've never had reason to suntan...so I'm wondering what are the effects on my skin... I know my RO said that the spots on my skin would be more pronounced but not sure of how quick of the SEs reactions.",
      "MessageIndex": 331,
      "PostDate": "25/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 26, 2017 08:14PM lifechoices2017 wrote: sunnyjay, are you in the prone position face down? If so, how much of your skin is beamed. Lol... also, what creams are you using? And how often. It's like I want to protect my skin but not sure how often. I've read the post on protein and water so I've made sure to do my grocery shopping for the right foods. So glad to hear you're doing well at 12 sessions. How many will you be doing. I'll have 20... 16 reg and the last 4 boost.",
      "MessageIndex": 343,
      "PostDate": "26/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Dec 1, 2017 12:05PM lifechoices2017 wrote: Teese and OCDAmy I'm a mix of end of Nov 29 - Dec 27th rads; so I'll too join the December group if you have one. Just finished my 3rd session; no odd SE's just the same 'twinges' in the breast that Ive had since my lumpectomy surgery (10/19). I guess its the combination of rads; healing and getting everything back to where it needs to be (lol). In any case, I have NO COMPLAINTS! Im not letting anything distract me from my last rad date (Dec 27th)... Today went well; got to treatment center at 11am; had an 11:10 appt; got in rads at 11:20; all radded and dressed at 11:38 and back to work at 12noon...WINNING!",
      "MessageIndex": 455,
      "PostDate": "01/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Dec 1, 2017 12:24PM lifechoices2017 wrote: Linwentz; I actually have my dental appt on Dec 20th; by then I will have done 13 of my rads. Im not feeling dry mouth as of yet (only 3 done) but I do drink alot of water now so hopefully that'll help..but thanks for the heads up because I can also inform my dentist during my cleaning. OCDAmy; I dont get to see exactly what the machine does other than as it looms over my back. My rads are in the prone position to my right breast, but my head is turned to the left so I only get to see it swing over and then swing back. I too have tried to figure when they are 'beaming' me but its only been 3 sessions and I haven't been able to figure out which click is actually giving off rads. Today I counted from sliding in to sliding out and i got to 600; which was about 10 minutes. As I caculated my time that was probably close; as I got in the rads room @ 11:20 and was out and dressed by 11:38. I'll crossover to the Dec room as well to see what my \"CHRISTMAS\" partners are up to. You ladies and ALL OF YOU; take care, be blessed and enjoy YOUR RADS FREE WEEKEND!",
      "MessageIndex": 458,
      "PostDate": "01/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Dec 6, 2017 11:11AM - edited Dec 6, 2017 11:14AM by lifechoices2017 Linwentz, AngelsGal57 and AngelaJL; thanks for the info on the SEs. Today I go in for my #6 (of 20); I feel like Im counting up to the 12 days of Christmas. But Im a 1/4 of the way in and no real SEs to report. Swelling and random twinges but not sure if thats the rads or still healing from the surgery. But still no pain. Last night (on a personal note) I had hot flashes (49yrs old) and i literally had to come out of my tshirt; slept like a baby til this morning. Im still lotioning througout the day. Im african american so I think I see a bit of skin darkening just under my breast but nothing itchy, cracking or patchy. The joy of my afternoon rads is I get to leave my sessions with OR WITHOUT a bra (the little things)! In my mind Im like; 2 more days and Im 8 down and really 9 to go (whole breast) w/4 boost. So Im prayerful that my SE's are few and as lessened as possible (thanking your Lord in advance for your cover and protection). For all those w/SEs I'll keep you in prayer for comfort and a quickened healing! Every Wednesday at 6am my church does a conference call; Wednesday Morning Inspiration. This morning it was 2 Corinthians; 9-10 (And he said unto me, My grace is sufficient for thee: for my strength is made perfect in weakness. Most gladly therefore will I rather glory in my infirmities, that the power of Christ may rest upon me. Therefore I take pleasure in infirmities, in reproaches, in necessities, in persecutions, in distresses for Christ's sake: for when I am weak, then am I strong.)... With that being said; we are the STRONGEST at our weakest point! We got this ladies. Truth be told we were strong before all of this; THIS has only made us stronger! My continued prayers for all for strength, peace and healing!",
      "MessageIndex": 482,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 6, 2017 11:31AM lifechoices2017 wrote: Linwentz yeahhhhh for #11...how many treatments are you having again? Im sure you may have posted earlier but Ive roamed so many pages im sorry I cant remember. But nevertheless...CONGRATS on your progress thus far ;-) Yeah, I think I'll also have a counter of 'fix-its' just to see what works. Again, Im hoping to know by the end of the week after my MO and RO on my next path for this journey for meds and rads...thank GOD im not walking it alone. I love this show of support and I know that God is with me every step of the way. ",
      "MessageIndex": 72,
      "PostDate": "06/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 6, 2017 08:51PM lifechoices2017 wrote: Georgia1, that's what I was thinking. Since my lumpectomy 10/19 I've been on fmla working reduced hours. I was out that Thurs, Fri, Mon, Tues but everyday since I've worked 6hr days. This has allowed me to schedule appts without feeling overwhelmed with my work day. I'm to resume reg hrs on the 13th, with reduced hrs and/or leave days..again when rads start... so I'm hoping I can work my 730 to 1/130... rads at 2/230 and then head home. My job has been good about my hours (although the staff is unaware of my journey)...i guess I'm trying to take care of them and me too. Lol. But again, I'll see how my rads schedule works. I've gotten this far...God won't forsake me now.",
      "MessageIndex": 90,
      "PostDate": "06/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 8, 2017 07:35AM lifechoices2017 wrote: IntegraGirl; we are ALL sending really tight squeeze hugs to you. WE have cancer; but Im praying that it does NOT have US! Im thankful for this sight. As we've stated somethings you want to know; some things you dont. I have yet to start my rads and instead of counting those days; ive actually been counting down to appts. With all that said; you got this! IT DOES NOT HAVE YOU... it's cliche' to say you dont know how strong you are until you have to be; but LORD knows thats the truth. I dont know if this will help you, because its never too late to start. But when I was diagnosed; I started a journal. Each day I write in it; how i feel, who i talked to that day, what my emotions are like and I also write out my prayers to God. Ive taped quotes, pictures and sometimes just a THANK YOU LORD just to get me through the day and it helps. Ive shared with my friends/family about this journal and one day its going to be a book; with some tearful stories and OMG so many funny ones (I'll just have to rename my cast)... Dont get me wrong there are days I want to scream and just hide under a rock, but in my mind Im like...if God is working it out, then thats one less job I have to do so I just keep it moving and say 'one day at a time'! ..Im single; live alone but I have the best support of friends and family EVER! I pray that as your journey continues that you are strengthened and I hope in some way that this site and our words of encouragement will lift you.",
      "MessageIndex": 101,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 8, 2017 06:29PM lifechoices2017 wrote: Brightness456, yeah I've heard the full dose time is less than 5min it's the setup that takes up the time.",
      "MessageIndex": 115,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 12, 2017 05:14PM lifechoices2017 wrote: PauletteK you are welcome. Funny thing, I ordered the 4tube pk because I wanted to start lotioning before my sessions. When I had my consult last week, the Dr says ...dont buy anything we'll supply Miaderm... oh well, at least I have mine anyway. Looks like we'll be rad buddies...so praying our boobs will have a smooth journey.",
      "MessageIndex": 139,
      "PostDate": "12/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 12, 2017 05:27PM lifechoices2017 wrote: PauletteK yeah, I'll be starting Nov 27th. But same here wanted to be prepared. We Got This... before you know it, we'll be all done! When my rads are done Dec 22nd) I start Tamoxifen...",
      "MessageIndex": 141,
      "PostDate": "12/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 16, 2017 04:33PM lifechoices2017 wrote: AngelsGal57, I love your post! Much agreed that although this is a path not chosen; God knew this journey before we did. My faith is strong and I trust Him! You know, I really havent shared my story with alot of people in my community because I wanted my family and those on my journey with me to stay lifted. I didn't want anyone comparing other stories with mine and making it worse than what it is. Nor did I want negativity in the air. I keep a journal and I write out my feelings. My prayer warriors omg...they are like God's army! I say to myself I am healed, my body is restored; whole and I lack nothing. Lord remove what should not be and fill me to your restoration.",
      "MessageIndex": 203,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 18, 2017 07:46PM lifechoices2017 wrote: Linwentz, I'm like 53Nancy...not really dreading the first session, just nervous I guess. It's like each session I anticipate a SE..or in my mind it's like ok day 1 ok...day 5 ok... like instead of counting down 20sessions I'm counting how many rads before the SEs show.... But I'm staying positive. I'm on my road to restoration, healing and my new path so I will endure. I'm so thankful for this site. We get to share, SCREAM, cry...and uplift all in a paragraph.",
      "MessageIndex": 228,
      "PostDate": "18/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 19, 2017 06:42PM lifechoices2017 wrote: DodgersGirl... I didn't ask about stopping antioxidants. Tell me what that does? I start next week; Nov 29th... want to see if that's something I need to check on. Lotions, boost...etc I think I'm ok on...but not sure about that.",
      "MessageIndex": 233,
      "PostDate": "19/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 19, 2017 06:56PM lifechoices2017 wrote: DodgersGirl, hmmmm... I'll have to ck on that I do take vitamins daily, but not sure if they'll help or harm during rads. Maybe I need to take them with me next Wed so that he can see the increments in them. I'll go continue to take them up to thst time...and if I can't take them daily during rads, maybe every other?!?...ill see what he says. Thanks! Then I guess I'll see if I can take them with the Tamox...hmmmm... Another crazy question... do any of you drink wine at all? I'm sure we/I can't have a bottle lol, but was wondering if wine is allowed during rads? Or on Tamox?",
      "MessageIndex": 237,
      "PostDate": "19/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 20, 2017 06:38PM - edited Nov 20, 2017 06:38PM by lifechoices2017 Georgia1, I too had a lumpectomy; clear nodes and margins...BRCA neg and low MammaPrint, but I have 20sessions... 16 with 4 boost... I start next Wed;) are you doing yours the morning or afternoon? My first 5 are between 11-1230... the rest are at 230. I'll go to work; leave and go back the first 5... the 230 sessions I go to work, rads and then home:) thinking by the 2nd and 3rd week I won't have to wear a bra when I leave. Lol",
      "MessageIndex": 264,
      "PostDate": "20/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 20, 2017 07:34PM lifechoices2017 wrote: Georgia1 will you be doing rads in the prone position? Face down? I will since they didn't have to do armpit or other areas. I did well in the simulation and getting my rad tats... I'm hoping I can check in and out with a breeze. The nurse did say that sometimes it's a waiting game just in case someone doesn't line up well... but we'll see how mine goes next week...crossing fingers:) Hooray for those of you completed or almost at the finish line.",
      "MessageIndex": 268,
      "PostDate": "20/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 22, 2017 04:45PM lifechoices2017 wrote: 53Nancy and Georgia1 are you both doing prone, because I am too... When I did my simulation, only my boob was in the hole (lol), I was actually laying on some of area above my boob... it felt like just the boob was exposed. Even the little fold under my breast was barely exposed. Like my nurses hands were right at my breast, no under breast was in the beam area.. I asked my RO if my underarm area would be affected and he said no because I had clear nodes/margins that it would be just whole breast ... but now that you've been diagrammed a square, I too start next week, Wed..so I better lotion up and ask to see my exact area so that I don't get any early SEs.. Thanks for that info...and here's wishing you happy and healing rads!:)",
      "MessageIndex": 291,
      "PostDate": "22/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 28, 2017 06:48PM lifechoices2017 wrote: Brightness456 and OCDamy, well i must be getting early effects, as I start tomorrow for 20sessions and out of nowhere I find myself on the sofa in tears... I've gone to every appt since Sept 15th alone... my sis attended the surgery consult but all others just me and the Drs... I guess I too want to feel strong and not vulnerable...but I guess the anxst and getting started tomorrow just took it's toll and the tears began to fall. But I'm better now...as i was crying my 7yr old great niece happened to call and she was singing a song on the radio that she and I always sing in the car together...it was I Will Trust In You Lord... that was so on time and well needed. I'm single; dating a wonderful man and I have the best support team ever...but I'm so thankful for you ladies. With you and my daily journal that I write in I'm staying focused and this too shall pass. My countdown starts tomorrow and I Got This!",
      "MessageIndex": 379,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 29, 2017 07:26AM lifechoices2017 wrote: THANK YOU ALL... Im nervous; anxious, emotional all wrapped up in one BUT I know that this is a beginning to a soon to be end of rads. #WINNING!",
      "MessageIndex": 394,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Nov 30, 2017 12:54PM lifechoices2017 wrote: AngelsGal57; yeah Im sure that with it being my 'menopausal week'; starting this week didn't help much. After my 'cry' Im better. I think I just had to get that out of my system and put my BIG GIRL PANTIES ON! I just got back from my 2nd session; and met w/the RO. My appt was at 11:40; they had someone in there that Im guessing didn't line up well because I didn't start rads until 12:15; but I was in/out and met w/the RO and back at work by 1:15. Im hoping that 3s a charm and tomorrow I'll be in/out in an hour instead of 2hours (to include travel time). But in spite of it all; Im able to work - go to my rads - and go back to work. Next week I get to come to work; rads and home! Thats gonna be wonderful! I did ask my nurse tech and RO how soon will I see SE's he said 'most' of the time the early twinges will start on like day 3-5 and that i'll feel them before I see anything other than maybe my skin darkening. I have 3weeks of whole breast so he's hoping that IF i get any they'll come later in week 2 so that the after that I'll only have 1 week of full; since the last week is boost only. I was like NO...I dont want to see any. He said well you know what \"he calls me Princess\"...lol. He said I dont want to see any either but whatever happens we'll take care of you. I did feel some tightness at the bra strap near my nodes area when I left; but Ive since 'Miadermed\" and its better. Again, glad that as my sessions continue I can go home 'braless' and I wont have to worry about my bra or fabrics rubbing any irritated areas. I'll probably start taking my cotton tshirts w/me to work so that I can lather down and wear that home so that I dont have to change again. All in all its a process; but a healing process and its all good!",
      "MessageIndex": 437,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "lifechoices…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262535/profile",
      "Content": "Dec 6, 2017 11:25AM lifechoices2017 wrote: 53Nancy; you are so right! When I was first diagnosed I think I thought of 100+ things to say yes or no to. I prayed to God to 'remove this cup' from me and if not that whatever my path that Id be blessed w/less is more...lessened pain, SEs, treatments, time from work etc...BUT more than enough to heal and restore me; physically, mentally and emotionally! And He's doing (He's done) just that. I can't be anything more than thankful and blessed for His grace and favor shown. I told my mom yesterday that God saw all of this before I did so I have to believe that if he can allow birds to fly, me to rise each morning with peace of mind, then surely HE can handle this!",
      "MessageIndex": 484,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    }
  ]
}