{
  "AuthorID": "LifeOfBabbs…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228972/profile",
  "Posts": [
    {
      "AuthorID": "LifeOfBabbs…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228972/profile",
      "Content": "Apr 11, 2016 09:06PM LifeOfBabbs wrote: I had my first session of radiation today. The weird part was my breast felt warm, and it still does. Did anyone else feel this? I also found out my Oncotype Dx score today and it's 58. That's a hard number to take. I was hoping it would be below 38 and in the low risk category. But 58 is in the high risk category.",
      "MessageIndex": 55,
      "PostDate": "11/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "LifeOfBabbs…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228972/profile",
      "Content": "Apr 13, 2016 10:33PM LifeOfBabbs wrote: Thanks for checking in with your experience Moondust, and Congrats Kathy on being DONE!",
      "MessageIndex": 77,
      "PostDate": "13/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "LifeOfBabbs…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228972/profile",
      "Content": "Apr 13, 2016 04:21PM LifeOfBabbs wrote: Randi1035, I was on HRT for 8 years and it was working so well, I was hoping that I'd never have to go off of it! My oncologist/gynecologist took me off it immediately cold turkey. I am Estrogen positive so I start Tamoxifin after radiation. I am worried about mood swings and the terrible hot flashes, not to mention all the other strange side effects I've been seeing. My gyno put my on Paxil for hot flashes, but then yesterday when I talked to oncology, I found out there is a strong interaction between that and the tamoxifin. My oncologist talked to my gyno, so today, they switched me to Effexor. I just started Radiation on Monday so today will be my third time. Did anyone feel tired right off the bat? Yesterday, when I got home at 2:30, I slept until 5pm and then went to bed at my regular time anyways. Could it be the radiation, or is it probably just a coincidence?",
      "MessageIndex": 70,
      "PostDate": "13/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "LifeOfBabbs…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228972/profile",
      "Content": "Apr 5, 2016 05:52AM LifeOfBabbs wrote: Thank you moderators. I'd like to be part of this group. I had my radiation \"education\" appointment last week, and I start radiation on Friday. I guess they don't actually do the radiation until Monday April 10th though because they're doing something else on Friday, such as a dry run or something. Good luck to everyone, and may we all be here to support each other during this difficult, and scary time:-)",
      "MessageIndex": 26,
      "PostDate": "05/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "LifeOfBabbs…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228972/profile",
      "Content": "Apr 5, 2016 06:24AM LifeOfBabbs wrote: fabchick and Randi1035, it is scary! I am afraid that I'll be crying all the way there on Monday. I think it's important to allow yourself to feel what you feel. I don't want to feel embarrassed about being upset about this. I also worry if the radiation is going to give me cancer in the years to come! The stuff is not good for your body, obviously. I'm glad I found this group.",
      "MessageIndex": 27,
      "PostDate": "05/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "LifeOfBabbs…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228972/profile",
      "Content": "Apr 15, 2016 07:40AM LifeOfBabbs wrote: Tami4965, how are you doing now? I'm so sorry to hear of all you are going through. It sounds terrible. Is anyone else on Effexor? I was on Paxil for hot flashes, but now my doctors figured out the paxil has and interaction with Tamoxifin which I am due to start next month. I took one Effexor pill yesterday morning and felt nauseous all day. Then, it was impossible to sleep. I saw these side effects on the web, but didn't think it would happen to me. Also, I read over and over about how hard it is to get off the Effexor after you're on it for some time. Any thoughts on this? I didn't take it today because I have company coming and I don't want to be sick while they're here.",
      "MessageIndex": 105,
      "PostDate": "15/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "LifeOfBabbs…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228972/profile",
      "Content": "May 10, 2016 07:26AM LifeOfBabbs wrote: I have 15 more treatments left, with 36 all together (over half done). My armpit is really hurting. I see the doc on Mondays and she gave me Aquifer mixed with lidocaine. I have been using Aloe and Aloe mixed with Aquifer. It feels like someone peeled off the first few layers of skin and the nerves are exposed. It's waking me up at night when I move my arm. Something that does help is taking a piece of cotton cloth and placing it in my armpit so things don't rub on it. My RO is very helpful and compassionate. I get my RADS in Albany, NY. It's a 50 minute drive one way. My breast really is fine so far! It's just the armpit that's bad.",
      "MessageIndex": 295,
      "PostDate": "10/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "LifeOfBabbs…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228972/profile",
      "Content": "Apr 5, 2016 08:15PM LifeOfBabbs wrote: iammags, Although I don't like the idea of radiation at all, I think it's a necessary evil for me. The DCIS was in more than one spot, it's high grade, and my margins were barely clear after two lumpectomies. What really stinks is you only get one try with radiation. If this doesn't work, no more radiation in that breast ever. Geez! Not that I want more, but only one shot with this! Randi1035, I think we're all in the same position! The whole experience in surreal and unbelievable isn't it? Many times I can hardly believe this is happening to me and I was diagnosed on February 12! This isn't even gone yet, and I'm already afraid about how I'm going to react when it comes back!",
      "MessageIndex": 34,
      "PostDate": "05/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "LifeOfBabbs…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228972/profile",
      "Content": "May 3, 2016 08:43AM LifeOfBabbs wrote: Today will be treatment 17 of 36. The only side effect I had until yesterday was fatigue. Sometimes it's bad and it's all I can do to drag myself out of bed or the recliner! Today it started itching badly, and it feels like someone punched me in the armpit! It's red, and actually the whole area is red. I use aloe in the morning and a mixture of aloe and aquifer at night. I'm feeling really drained. I hope everyone is doing ok!",
      "MessageIndex": 222,
      "PostDate": "03/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "LifeOfBabbs…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228972/profile",
      "Content": "Apr 1, 2016 03:58AM LifeOfBabbs wrote: HI all, I'm starting radiation next week. Should I join this group, or is there a \"Spring 2016\" Group that I should be in instead? Thanks!",
      "MessageIndex": 2362,
      "PostDate": "01/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "LifeOfBabbs…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228972/profile",
      "Content": "Apr 5, 2016 10:17PM LifeOfBabbs wrote: mdoc524, Thank you! I start radiation on Friday April 8, 2016.",
      "MessageIndex": 2416,
      "PostDate": "05/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    }
  ]
}