{
  "AuthorID": "lifeisabeach59",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260992/profile",
  "Posts": [{
    "AuthorID": "lifeisabeach59",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260992/profile",
    "Content": "lifeisabeach59 wrote: I am in shock and denial. Following a thorough breast exam with a new gyn, she took my hand and said \"I want you to feel this\". She placed my hand over hers and said \"here is a lump\". Even as I type this I feel like it is someone else writing these words. Since I was not keeping up on my annual paps and mammo she advised that I get a bilateral mammogram to check both breasts. She also referred me to a surgeon. She told me to call the surgeon...not to wait until after I get my mammogram. She said \"tell him I am referring you.\" My mind is reeling thinking about the history of breast cancer in my family....My maternal grandmother and aunt both died of breast cancer approx. 2 years following their dx. It was many, many years ago, but they were in their early 60's. I turn 60 next year. (as I pause to take a deep breath before I can continue writing) So...here I am doing the Dr. Google thing. I should know better, right? However, I am glad I did because it helped me find this group. After spending well over an hour reading your posts I thought to myself...I am one lucky gal to have found this group. Your posts are thoughtful, kind, supportive and most of all very informative. So, on Monday I will be calling the surgeon to schedule an appt. I think about what my gyn told me...\"tell him I am referring you.\" I hope this means they have a solid, ethical and competent professional relationship, and my gyn is steering me into good hands. I guess I will know more after I call his office and tell him my gyn \"sent me\". I vacillate between \"this is a new gyn...she doesn't know my breasts so it can't be a \"real\" lump ( or mass as I saw written on her notes ) to....feeling like I am in this trance-like state feeling slightly spaced out unable to focus. And yes, I have broken down in tears once or twice but mostly I feel kinda numb. I don't want to share this with anyone until I have more information. I feel it would be so unfair to share with my family and close friends at this point in time. Any suggestions about how to deal with anxiety, fear, numbness would be greatly appreciated. And any other thoughts you would like to share with me. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "08/10/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859221",
    "Title": "My gyn found a mass deep in my left breast on Fri Oct 6th lifeisabeach59 lifeisabeach59"
  }]
}