{
  "AuthorID": "Lifeisbeautiful",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90946/profile",
  "Posts": [
    {
      "AuthorID": "Lifeisbeautiful",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90946/profile",
      "Content": "Lifeisbeautiful wrote: Hi all.  I hope that this finds all of you well and having a beautiful day.  I've been reading a bit over the posts since last week, so I'm not quite familiar with you but I have enjoyed reading the support that is provided.  You ladies are magnificent and God bless each and every one of you.   I have slept maybe 3 hours per night since the 8th of this month and not by choice.  I just can't shut my mind off.  Small background, I'm 37 years old and the natural mother of 2 and I have one step son.  My husband is 38 and the absolute love of my life.  I've had problems with my left breast for a decade or so - abscesses mostly, some having to be cauterized.  I'm an ex smoker having quit May 31st 2008.  Otherwise I think I'm pretty healthy except for the dermographism and it's a benign condition, just annoying.  I was dx'd with that in March.  About 6 - 8 weeks ago I had some soreness under my left arm and this may or may not be related, so I thought I'd throw it in there.  The soreness only lasted a couple of days so once it resolved itself, I didn't think anything of it.  October 8th I was in the shower doing my usual routine and found a very hard lump in my left breast.  I immediately cried - this was different.  I don't usually get excited about things regarding my health - I figure if I'm feeling alright and I can do most of my daily activities then I'm blessed.  Abscesses and lumps I'm used to but not ones that don't hurt.  Not ones that feel like a rock.  I immediately called my GYN and he got me in on Monday the 12th.  I've been with this same doc for the better of 15 years and I trust him 110%.  I'm blessed once again.  Once he felt of it, his first response was to ask if breast cancer runs in my family.  Not at all on my mother's side that I know of - at least for the last 4 generations.  My father's side however, I don't know at all, and my parents, may they RIP, I can't ask.  My mammogram was ordered first thing Tuesday morning and my results (U/S and Mammo) came back Thursday.  Only a 2 day wait but it felt like years.  I know you all understand that!  I keep telling myself that it's most likely NOT cancer but training my brain to stay off the worst case scenario is almost impossible.  Here's my findings:  Bilateral Diagnostic Mammography: CC and MLO images of both breasts along with compression CC and MLO images of left breast. Findings: In the upper outer aspect of the left breast in the region of the patient's palpable abnormality, there is a 2 cm density pattern.  Ultrasound of the left breast also obtained on 10-13-09 demonstrated a 1.97 cm x 1.59 cm heterogeneous solid lesion with an irregular margin in the 2 o'clock position of the left breast which correlates with this mammogram finding.  More anteriorly and laterally within the lateral aspect of the left breast there is a 1.5 x .7 cm sharply marginated nodular density seen on the CC views which is difficult to identify on the oblique images.  There is fibroglandular tissue in both breasts.  There are no suspicious calcifications.  (that nodular density, my guess, is an active abscess I have right now) Impression: 2cm density pattern in the upper outer aspect of the left breast region of the patient's palpable abnormality and this density pattern correlates with a 1.97 cm x 1.59 cm heterogeneous solid lesion with an irregular margin demonstrated in the 2 o'clock position of the left breast on the ultrasound don 10-13-09 and which is considered suspicious. 1.5 x .7 cm sharply marginate nodular density in the lateral aspect of the left breast. This is the patient's baseline study. ACR Category 4 Ultrasound guided biopsy of the solid lesion in the 2 o'clock position of the left breast is recommended. I also have a copy of the best image here: http://i6.photobucket.com/albums/y202/epirush/Mammo.jpg I see the specialist on Tuesday and hopefully will have some reassurance.  Of course, I'll take some sooner than then too!  Thanks for bearing with me, I know I'm long winded.  So, now I'm not so sure if the pain under my left arm was nothing after all and I also have to wonder about these hives and if it could all be related.  37 y/o Dx: 10/23/09 IDC 2cm - Stage IIIa Grade 3 - 4/18 Nodes; 10/26/09 Lumpectomy w/clear margins, nodal dissection - Triple Neg BRCA1&2 neg Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742323",
      "Title": "New Here - Worried Sick Lifeisbeautiful AnnaG"
    },
    {
      "AuthorID": "Lifeisbeautiful",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90946/profile",
      "Content": "Lifeisbeautiful wrote: This is probably one of the most prominent side effects I had.  I remember my legs being so weak I couldn't stand long without feeling like I was going to fall down.  It also made my lower back ache and that continues but is tolerable.  My arms were also weak, not being able to lift much of anything - especially my three year old.  My legs and arms just felt \"sick\", kind of tingly, oogy and just floppy weak, if that makes sense to anyone.  My doc won't tell me anything about it when I mention it, he just keeps saying \"but you're fine now\".  #*$!@#$  I'm thankful for that and that's fabulous and all but if it's a common/uncommon thing I'd like to know and if there's something I can do to lessen that side effect, I'd love to be in the know and be able to do it!  Being able to do nothing but sleep 20/24 hours for 4 days SUCKS but I'll do it - just help me with that horrible non stop feeling.  I'm trying to see a new oncologist early this week and I plan to ask him too, but who better to ask than the sisters who have already been there and done that!  37 y/o Dx: 10/23/09 IDC 2cm - Stage IIIa Grade 3 - 4/18 Nodes; 10/26/09 Lumpectomy w/clear margins, nodal dissection - Triple Neg BRCA1&2 neg Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/747989",
      "Title": "AC side effect - WEAK Oogy Legs and Arms?? Lifeisbeautiful Lifeisbeautiful"
    },
    {
      "AuthorID": "Lifeisbeautiful",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90946/profile",
      "Content": "Lifeisbeautiful wrote: Ok, so, not what we wanted to hear. Infiltrating ductal carcinoma.  And what are \"medullary features\"?  There's some histological grading on here too but I have no idea what that means.  What is that?  Just a formality?  I hope?  The ER/PR/Her2 studies are still pending.  They're doing the genetics testing.  Wow.  How did I get here?  On October 7th, I didn't know ANYTHING.  I went from finding a lump on the 8th to having a partial mastectomy/lumpectomy scheduled for the 26th.  My doctor said that she sees no indication that we can't cure this.  She's going to inspect my lymph nodes under my arm during surgery and if they look to be cancerous as well, she will remove all of the nodes.  That means I'll have to spend the night in the hospital because she said they insert a drain tube.  She said that she doesn't know what stage the cancer is in but still feels we're fairly early.  She did say something about a number \"2\" though like a grade 2 or something?  It's so hard for me to remember things these days.  Can anyone help me with that?  I know she doesn't mean the stage since she hasn't gone in with surgery yet but anyway..  anyone?  Grade 2?  Something 2? The mammo and u/s indicated that the mass is about 2cm, so that's not too horribly big is it?  I realize most of these questions should be to my doc but how can you hear enough positives during times like this?  She has told me over and over \"worst case scenario is we treat it\".  Yesterday I hear \"85% success rate\".  CRAP!  If I heard that about anything else I'd think the odds were great but now all I can focus on is that 15%.  I really need to train my brain. So, partial mastectomy and maybe removing some lymph nodes on the 26th and she is suggesting chemo and radiation because I'm only 37.  Talk about kicking your fear into over drive.  When does chemo and radiation start after you have surgery usually?  I'm guessing they give you time to heal from surgery first?  I'm thinking about bleaching my hair out, teasing it up really good and then dying the tips pink.  lol  I figure if I'm going to lose it anyway..    Ah, maybe not.  Not everyone loses the hair, right?  I don't care either way.  It's just hair. Small price to pay to spend a long life with my children. And let me add that whoever invented the idea of how to conduct a breast MRI had to be a man!  I felt like a cow dropping her udders in the buckets for milking.  UGH! 37 y/o Dx: 10/23/09 IDC 2cm - Stage IIIa Grade 3 - 4/18 Nodes; 10/26/09 Lumpectomy w/clear margins, nodal dissection - Triple Neg BRCA1&2 neg Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742686",
      "Title": "Pathology Is Back - Cancer Lifeisbeautiful jenn3"
    }
  ]
}