{
  "AuthorID": "LifeIsGood1…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75426/profile",
  "Posts": [
    {
      "AuthorID": "LifeIsGood1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75426/profile",
      "Content": "Dec 17, 2008 06:17AM LifeIsGood17 wrote: Yes, I had neoadjuvant chemotherapy to shrink my large tumor prior to surgery.  I was initially terrified at the prospect and, like you, just wanted the cancer out of my body immediately.  My oncologist's wisdom prevailed and it turned out that this was absolutely the right treatment sequence for me.  Having chemo before surgery ultimately enabled me to have a lumpectomy and radiation instead of an almost certain mastectomy and reconstruction.  I finished treatment right after Thanksgiving and am feeling great. My tumor was highly responsive to the prescribed chemo regimen and shrank dramatically after the first round of A/C.  Amazingly, it became clinically undetectable after only 3 rounds!  I also had weekly Taxol for insurance prior to surgery. In addition to increasing the likelihood of breast-conserving surgery, neoadjuvant chemo also treats the entire body right away. So, if there are any micromets, they will be eliminated sooner rather than later.  It also provides an opportunity for your doctor to monitor the tumor's chemosensitivity in real time while the tumor is still there.  If it doesn't respond as well as hoped, your doctor can opt to change the chemo regimen and see if there's a better response to a different cocktail. It's lucky they implanted that surgical clip pre-chemo because that's all that was visibly left when I had my pre-surgery mammogram this fall...  Five days after surgery, I received the astounding news on my pathology report that the chemo had, indeed, apparently eradicated the cancer.  There were no residual cancer cells at the primary tumor site and all 17 lymph nodes that were removed were clean as well.  They never were able to stage the cancer or even tell me exactly what kind it was. So, I've been there and can completely relate to your discomfort with the proposed treatment sequence.  From personal experience, I think that you should trust your doctor's judgment.  All the best to you and I hope that you are as unbelievably lucky as I have been!",
      "MessageIndex": 4,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/725978",
      "Title": "What does a core needle biopsy test for? Sirena_Gorda omonim53"
    },
    {
      "AuthorID": "LifeIsGood1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75426/profile",
      "Content": "Dec 18, 2008 11:43PM LifeIsGood17 wrote: They opted not to do a sentinel node biopsy prior to chemo and planned from the beginning to do the axillary lymph node dissection at the same time as my surgery.  Given the initial size and grade of my tumor, my team wanted to start chemo ASAP -- and it began less than 3 weeks after my diagnosis!  My surgeon felt that a negative sentinel node biopsy after chemo couldn't be trusted in my case, so there was no point in doing one. I wasn't thrilled at the prospect of the ALND and the increased risk of lymphedema.  Fortunately, I recovered quickly and haven't had any sign of lymphedema so far in the 3 months since my surgery.  The tradeoff for having the ALND is that 17 negative lymph nodes provided more definitive proof of my pathologic complete response to chemo.   And, although not a complete walk in the park, chemo wasn't at all the torture I had imagined.  I tolerated the side effects well, was never sick, and was able to continue working full-time throughout chemo -- even going straight to work from the infusion center while on Taxol.  Being able to see the dramatic shrinkage with my own eyes that first month was a huge boost to my morale, making it a lot easier to remain motivated and optimistic throughout treatment. As for your initial confusion, staying informed during this journey is definitely an educational experience... Let's just say that I've learned all sorts of stuff in the past 8 months that I never would have even considered relevant to my life a year ago.",
      "MessageIndex": 10,
      "PostDate": "18/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/725978",
      "Title": "What does a core needle biopsy test for? Sirena_Gorda omonim53"
    },
    {
      "AuthorID": "LifeIsGood1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75426/profile",
      "Content": "Dec 20, 2008 04:53PM LifeIsGood17 wrote: Sjprofe, the period between diagnosis and treatment was, by far, the most overwhelming and stressful for me. Not knowing what to expect and being shuttled from one appointment to another almost every day was very difficult. I missed more time from work during those couple of weeks than I did during treatment, except for a short medical leave after surgery. Once treatment actually started, I took some comfort in the fact that I was finally moving forward and that my schedule was more or less my own again. I was pleasantly surprised to find that my body tolerated the side effects well. Then, seeing the rapid shrinkage and **knowing** that the treatment was working helped me stay more positive, especially on those days where I was tired and just wanted to wake up from this bad dream. In general, all chemo drugs differ in their potential to cause unwanted side effects, but your doctor will undoubtedly give you the specifics on your particular regimen. You may even learn that the potential side effects could be minimal. If not, I can personally attest to the effectiveness of the drugs they have these days to combat nausea and to keep your white blood counts up. Other than that, you have to listen to your body in between treatments, slow down and/or sleep extra if you need to, and let your doctor know sooner rather than later if you are concerned about absolutely anything, no matter how small it may seem to you. There are so many factors intertwined in an individual's experience with chemo that it's, of course, impossible to predict exactly what yours will be. The only thing for certain is that it's yours... and that I wish you well!   :-)",
      "MessageIndex": 12,
      "PostDate": "20/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/725978",
      "Title": "What does a core needle biopsy test for? Sirena_Gorda omonim53"
    }
  ]
}