{
  "AuthorID": "LiG",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85392/profile",
  "Posts": [
    {
      "AuthorID": "LiG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85392/profile",
      "Content": "LiG wrote: Diagnosed with DCIS about 2 cm last week.  These boards have really helped understand what is going on.  To begin with, I am 42 and single.  I saw my surgeon and a plastic surgeon yesterday and am now trying to review my choices.  Initial thought was lumpectomy followed by radiation; however, the surgeon informed me that the DCIS was located slightly below and to the edge of the aureola (upper portion) and that given how much tissue would be taken and the radiation treatment, it had a high chance of being disfiguring based on location.  He also told me that I was a good candidate for a nipple saving mastectomy which would have a better cosmetic effect and avoid radiation treatment as well as reduce my recurrence potential at about the same rate as above.  The plastic surgeon gave me all the mastectomy alternatives but agreed that the above was a good way to go but that I should be concerned with cancer treatment first and looks second.  He stated that doing any repair after radiation would be problematic due to the skin damage caused by the radiation.  I have been reading about both of these on the board here, but its hard to see the advantages of either.  Right now, I am in a nerve wracked. stomach turning dither on what to do...though I believe I am leaning toward the mastectomy.  Can anyone help me with how they made choices in simialr conditions and how it worked out? Dx 6/7/2009, DCIS, 3cm, Stage 0, Grade 3, 0/3 nodes, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/736152",
      "Title": "Surgery and Choices LiG Beesie"
    },
    {
      "AuthorID": "Bird-of-lig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231921/profile",
      "Content": "Aug 15, 2016 11:03AM Bird-of-light wrote: Myra, your eyebrows look amazing! I wish you could teach me how to do mine.",
      "MessageIndex": 24324,
      "PostDate": "15/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "LiG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85392/profile",
      "Content": "Jun 19, 2009 10:46AM LiG wrote: The plastic surgeon told me that the method for reconstruction was proposing was conservative and I could have the implants replaced with natural tissue later (addt'l surgery) if I chose.  He was very thorough with informing me of all my choices though. Its encouraging that you are doing well, thank you.",
      "MessageIndex": 2,
      "PostDate": "19/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/736152",
      "Title": "Surgery and Choices LiG Beesie"
    },
    {
      "AuthorID": "LiG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85392/profile",
      "Content": "Jun 19, 2009 06:16PM LiG wrote: Thank you Beesie.  I was hoping you would answer.  I have read alot of your posts and they are comforting.  I believe that the DCIS they found is more toward the middle tissue and not right below the areola.  At 12 o'clock and inner a bit, but they would have to remove tissue below the areola to get the margins is what I understand.  I will be asking several more questions of the surgeons before I make my decision I'm pretty sure.  The BS is from MD Anderson and the PS is from Baylor, both have very good reputations but a second opinion is not a bad idea.",
      "MessageIndex": 4,
      "PostDate": "19/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/736152",
      "Title": "Surgery and Choices LiG Beesie"
    },
    {
      "AuthorID": "Bird-of-lig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231921/profile",
      "Content": "Oct 14, 2018 11:37PM Bird-of-light wrote: ",
      "MessageIndex": 139,
      "PostDate": "14/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/695426",
      "Title": "Diary of a bilateral mastectomy twinkly pinkvictory"
    },
    {
      "AuthorID": "Bird-of-lig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231921/profile",
      "Content": "Oct 19, 2017 08:37AM Bird-of-light wrote: Twinkly, thanks for the update. I think of you often. Hugs",
      "MessageIndex": 137,
      "PostDate": "19/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/695426",
      "Title": "Diary of a bilateral mastectomy twinkly pinkvictory"
    }
  ]
}