{
  "AuthorID": "light1candl…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/257351/profile",
  "Posts": [
    {
      "AuthorID": "light1candl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/257351/profile",
      "Content": "Feb 23, 2018 10:24AM light1candle wrote: Hi Kedahnya, I’m sorry you are going through all this and I know the waiting for information and for treatment to begin is terrible. I can’t answer your question about how quickly treatment plans are usually set up, but I wanted to chime in here about your referral to another hospital. I live in the St. Louis, Missouri area and I can tell you that Washington University and Barnes Hospital’s Siteman Cancer Center is the only National Cancer Institute designated Cancer Center in Missouri. That means that they have been recognized for their expertise and the quality of their cancer care and research. Because you have a complex and unique medical history, I think your doctors are wise to refer you to Siteman for a consultation to insure you get the best possible treatment. Hang in there! Wishing you the very best. Barb",
      "MessageIndex": 3,
      "PostDate": "23/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862740",
      "Title": "Question about how quickly treatment plans were set up Kedahnya rdeesides"
    },
    {
      "AuthorID": "light1candl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/257351/profile",
      "Content": "May 18, 2019 09:11AM light1candle wrote: “Has anyone had issues with intramammary lymph nodes?“ Hi jp18. Yes, I had an issue with an intramammary lymph node. I have LCIS so I was already on a six month alternation between mammogram and other types of imaging. In my case a small enhancing mass at 8-9:00 position in my left breast was noted on an MRI. This gave me a Birads 0 (inconclusive) score and a recommendation for a targeted US. The US was done within a day or two and did not show anything, except some “fibroglandular tissue.” (I have doubts about this US as the technician seemed very inexperienced.) The recommendation was a follow-up US at the time of mammogram in 6 months. At 6 mo. the mammogram still showed nothing, but the US (with an experienced US technician) showed a small round hypoechoic mass near the previous site of fibrograndular tissue that was thought to correspond to the MRI lesion. I got a birads 4/5 rating and a biopsy, which showed a benign intramammary node. No one ever explained to me why an intramammary node would have enhanced on an MRI or not be identifiable as suchon mammogram or ultrasound. Your case sounds more complex than mine, what with the all the identification difficulties, so I can understand why you are still worried. Do you have somewhere else near you, like a NCI designated cancer center, where you can get a another opinion on your existing imaging?",
      "MessageIndex": 2,
      "PostDate": "18/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871598",
      "Title": "Intramammary lymph nodes jp18 light1candle"
    },
    {
      "AuthorID": "light1candl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/257351/profile",
      "Content": "May 1, 2018 11:24AM light1candle wrote: Hi moondreaming. Sorry you are having so many health problems, and I think you are right to be proactive. I wanted to chime in here to ask if you have considered paying out of pocket for genetic testing? Last year I was diagnosed with LCIS but the surgeon did not think I needed genetic testing due to no family history of breast cancer. However, my family has had a ton of other cancers, including prostate cancer in a sibling which can be a risk factor for ILC, so I was slightly uneasy. I was also trying to decide on my options regarding preventative anti-hormonal therapy or prophylactic surgery or just increased surveillance. My thinking was that the genetic testing results would be another data point for making my decision so I chose to pay for my own testing at Color Genomics. Their hereditary cancer test looks for mutations on 30 genes that are known to be associated with various cancers, including some for breast and ovarian cancer, for $249. These are the genes that they look at: APC, ATM, BAP1, BARD1, BMPR1A, BRCA1, BRCA2, BRIP1, CDH1, CDK4*, CDKN2A(p14ARF), CDKN2A(p16INK4a), CHEK2, EPCAM*, GREM1*, MITF*, MLH1, MSH2, MSH6, MUTYH, NBN, PALB2, PMS2*, POLD1*, POLE*, PTEN, RAD51C, RAD51D, SMAD4, STK11, TP53 (Those marked with an asterisk are only analyzed at specific locations.) This test is performed under a physicians supervision. Your own dr can order it and receive the results, or you can have it done under the direction of Color's physician as I did. You will receive the results and can have a copy sent to any doctors you choose. The price for the test includes a telephone conference with one of Color's genetic counselors, to help you understand your test results. This is not an endorsement of Color Genomics, but I just wanted you to know that there are some relatively affordable alternatives out there for genetic testing, and Color is the one I am familiar with. How reliable are they? I would take any genetic testing with a grain of salt, because there is a lot we don't know. But if you show any known mutations on this testing, you could bring it to your dr's attention to ask for confirmation thru their more extensive/expensive testing and perhaps your insurance would pay for it. Anyway, just a thought. I wish you all the best.",
      "MessageIndex": 10,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864320",
      "Title": "New:My story and area of concern:please help moondreaming GreenEyes81"
    },
    {
      "AuthorID": "light1candl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/257351/profile",
      "Content": "Apr 14, 2019 06:44PM light1candle wrote: AliceBastable and Beesie: Thanks to both of you for weighing in here. Beesie, your observations about the limits of chemoprevention for a prophylactic BMX in cases like minewere very helpful. Just the kind of feedback I was hoping for. Thank you both.",
      "MessageIndex": 5,
      "PostDate": "14/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870905",
      "Title": "After prophylactic BMx, did anyone take tamoxifen or AI's? light1candle light1candle"
    },
    {
      "AuthorID": "light1candl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/257351/profile",
      "Content": "Apr 15, 2019 02:36PM light1candle wrote: Hi gndvll. So sorry to hear of your post chemo/surgery trials. Thank you for posting your thoughts. Yes, each person’s journey is very individual, and we all must make the best choices we can with the information we have. Since your IDC was so aggressive, I think you were wise to treat it aggressively. Hopefully, you are through the worst of it! Here's hoping you are feeling so much better very soon. My situation is different. With LCIS I may never go on to actually get invasive breast cancer, but my risk for it is higher and the risk is bilateral. I am considering preventative BMX to reduce my risk. (Other health problems make me uncomfortable with just doing surveillance.) I am just trying to understand what imaging/treatments would be recommended after mastectomy should I choose to go that route. In situations like mine, it sounds like the BMX is pretty much it, unless there is a later lump",
      "MessageIndex": 8,
      "PostDate": "15/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870905",
      "Title": "After prophylactic BMx, did anyone take tamoxifen or AI's? light1candle light1candle"
    },
    {
      "AuthorID": "light1candl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/257351/profile",
      "Content": "Apr 14, 2019 11:09AM light1candle wrote: Hi Shadie. Thanks so much for taking the time to respond. It’s good to hear of someone who has not had adverse side effects from their SERMs/AIs. With the increased risk of being BRCA+, it seems wise to do all you can to be proactive to prevent cancer and it sure seems like you have certainlydone that. Again, thanks for sharing your experience.",
      "MessageIndex": 2,
      "PostDate": "14/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870905",
      "Title": "After prophylactic BMx, did anyone take tamoxifen or AI's? light1candle light1candle"
    }
  ]
}