{
  "AuthorID": "lightacandle",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69001/profile",
  "Posts": [{
    "AuthorID": "lightacandle",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69001/profile",
    "Content": "lightacandle wrote: Just to let all the readers know. I havent yet read up on much of this website or books. I have a friend that has had a Mastectomy and has pretty much guide me so far. In Nov/07 . i found a cyst. Had a mammogram the first of Mar/08 , I did ask for a US and they granted it. I was lucky as you have to wait to get your results back from your mammogram before the USound. The middle of March i had a core biopsy done. They took 5 samples from this cyst. My husband was present for this appt. I waited a month for the results. I was told by my Doc that it was great NOT cancer. \"go home and make sure you have you mammogram NEXT YR. I wasnt sure. With gut feeling i asked my fam doc to let me see a surgern. He was ok with that decision. The end of March i saw this surgern. He too told me that it wasnt BC. I asked if i could have it removed. I also asked if this would be done in Day Surgery and that i could get home the same day.  The Surgern did go back to the lab to check this cyst again. So, really he told me twice that it was ok. -With my gut feeling and with his ok ..the surgern said ok we will remove it. ..i was put on a waiting list. I waited a month...Boys, i really understand what the stress others go through waiting!! I got the bad results on May 27/08 . I was in shock. I made him repeat over and over again. I then went home and shared this with my husband and sister. My sister phoned his office and relayed what he said. He did ask me to set up another appt and to take in my family. ' On June 12 at 2pm i had a Mestectomy. I had 2 options. one-remove some tissue and lymph plus raddition. or to have a Mestectomy. Its 3 weeks since my operation...with pain,fatugue& frustrated. I;m trying to move on. As it stands now , i only told a couple of fam members and some friends.  I'm waiting to hear from the Oncologist to hear my next step. As far as i know it will be more options...hormone therapy..chemo..need no treatment. ps Because i'm a private person i was allowed to go home after the Mestectomy...i was home 4 hrs after this operation. I'm still not up on what BC is. ,,,in fact i havent read a book yet. When i try ..i get sick to my stomach. This my friends is a Big Step for me to jion this group. I'm looking forward to be able to wear a bra again (Prostheses) is all i have on my mind now. thanks for your ear light a candle Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "02/07/2008",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/708436",
    "Title": "hi, new here -> shocking story! ?? lightacandle lightacandle"
  }]
}