{
  "AuthorID": "Lilaa",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247198/profile",
  "Posts": [
    {
      "AuthorID": "Lilaa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247198/profile",
      "Content": "Lilaa wrote: hello, I am new, 31 years old and recently diagnosed with bc, which totally destroyed my world. in the last few days I began accepting my illness, when I received a new information about my hormon receptors. Then the sorrows began again. With a fine needle biopsy the cancer tissue was taken and was tested twice in different hospitals. at the first hospital the result was ER-/PR-, HER2+. but now when it was tested at the second hospital the result is ER 10%, PR 0%, HER2+. Now I am totally confused and also scared. don't know which result is right. I read that the prognose for her2+ ladies is bad, combined with er+ it's even worse.. typing my diagnose on \"predict\" states the same. I am really depressed knowing, that I am eventually er+ and her2+. Do you know if it makes sense to do (besides a herceptin treatment) an antihormonel therapy after finishing the chemo? does it work with only 10% er+? And if not, does that mean for me, that I have the high risk, that the cancer may grow again after chemo, because my estrogen feeds it? Dx 12/2016, IDC, Right, <1cm, Stage IIIA, Grade 3, ER+/PR-, HER2+ Chemotherapy 1/5/2017 Cytoxan (cyclophosphamide), Ellence (epirubicin), Taxol (paclitaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/853393",
      "Title": "low estrogen receptor, therapy needed? Lilaa SSInUK"
    },
    {
      "AuthorID": "Lilaa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247198/profile",
      "Content": "Mar 16, 2017 05:18AM - edited Mar 16, 2017 05:23AM by Lilaa Thanks for your encouraging words! I hope you are right and everything turns out to be good - even after many many years. i'm just so confused and scared about the different results, which may lead to a wrong treatment after chemo... that might increase my risk of recurrence... sorry for whining so much, the diagnose turned me to a totally anxious and negative person By the way, i am doing a neoadjuvant chemo, so i dont know for sure how many nodes are involved. by ultrasound the doc supposed that at least 4 nodes are involved. With only ultrasound he couldnt see more, so there might be much more nodes infected.",
      "MessageIndex": 3,
      "PostDate": "16/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/853393",
      "Title": "low estrogen receptor, therapy needed? Lilaa SSInUK"
    },
    {
      "AuthorID": "Lilaa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247198/profile",
      "Content": "Lilaa wrote: hello, A woman told that everyone in her chemo group, who lost weight during chemo and was thin died few years later.. She also told that she read , that whoever looses weight during chemotherapy does have a more negative prognosis than someone who dont loose weight or even gain weight. Is this really true? Do you have read similar opinions or even experienced the same thing on other women? I am now very afraid, because I constantly loose weight during my chemo. I just don't have much appetite. Dx 12/2016, IDC, Right, <1cm, Stage IIIA, Grade 3, ER+/PR-, HER2+ Chemotherapy 1/5/2017 Cytoxan (cyclophosphamide), Ellence (epirubicin), Taxol (paclitaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/853730",
      "Title": "Loosing weight during chemo = bad prognosis? Lilaa Denise-G"
    },
    {
      "AuthorID": "Lilaa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247198/profile",
      "Content": "Mar 27, 2017 06:49AM - edited Mar 27, 2017 06:50AM by Lilaa thank you for the answers. Your examples really calms me down. But you don't know if there are any studies about this issue, do you? @Rebamacfan. Your mom seems to be a very lovely and nice person. She's so strong and brave! Hope I'll be able one day not to be negatively affected by every bad news I hear or read.",
      "MessageIndex": 6,
      "PostDate": "27/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/853730",
      "Title": "Loosing weight during chemo = bad prognosis? Lilaa Denise-G"
    }
  ]
}