{
  "AuthorID": "Lilactulip",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205682/profile",
  "Posts": [
    {
      "AuthorID": "Lilactulip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205682/profile",
      "Content": "Jan 3, 2015 02:15PM Lilactulip wrote: Thanks for the updates on plant aloe! Didn't even think of bacteria. . .The winter warriors list is a wonderful idea also. Love to see all the Warriors done with this part of their battle. Nap time!",
      "MessageIndex": 687,
      "PostDate": "03/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Lilactulip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205682/profile",
      "Content": "Jan 3, 2015 07:42AM Lilactulip wrote: Good morning everyone! I have been lurking on here and reading about all of you incredibly strong women. I have learned about lotions and tank tops and trials and praises. Thank you all for sharing your stories so that people like myself know we aren't the only ones. I have just finished number 10 out 33 yesterday and now I get my weekend break. I'm sore at my incision site and I'm just getting over a stomach bug that my lovely daughter passed on to me, so to tell the truth, I'm feeling a bit fragile today. I'm thinking some extra rest might be in order. I start back to work at a middle school Monday after two weeks off for break. My doc gives out Miaderm cream while your in treatment and says not to use any thing else but I've read about putting aloe straight from the plant on every morning also. I'm an F cup now, but can't wait to see what I'll be a year from now. Hanging in there, one day at a time. ",
      "MessageIndex": 675,
      "PostDate": "03/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Lilactulip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205682/profile",
      "Content": "Jan 10, 2015 08:40AM Lilactulip wrote: I've been off for a week and the thread has exploded with more people! It's going to take me awhile to catch up on reading! I'm off rads for awhile due to an abcess in my lumpectomy site. I've had it drained twice now and then again next week and it was some nasty stuff. They cultured it and think that the antibiotics should work. . .but it pretty bad. Has anyone been on and off of radiation is it less effective?",
      "MessageIndex": 849,
      "PostDate": "10/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    }
  ]
}