{
  "AuthorID": "lilithmoon",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165367/profile",
  "Posts": [
    {
      "AuthorID": "lilithmoon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165367/profile",
      "Content": "May 2, 2013 02:57AM lilithmoon wrote: and there is always a chance that it is benign!!",
      "MessageIndex": 11,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/803945",
      "Title": "Waiting for Biopsy to be scheduled sfin lilithmoon"
    },
    {
      "AuthorID": "lilithmoon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165367/profile",
      "Content": "May 2, 2013 03:36AM - edited May 2, 2013 03:37AM by lilithmoon that's a really good idea.  I take valium when things get too overwhelming.  Plus my boyfriend took off after my Mx so I've had to deal with this alone.  Some days are better than others!",
      "MessageIndex": 13,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/803945",
      "Title": "Waiting for Biopsy to be scheduled sfin lilithmoon"
    },
    {
      "AuthorID": "lilithmoon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165367/profile",
      "Content": "Jun 9, 2013 04:08AM lilithmoon wrote: I went back and forth with my breast surgeon and went with a UMX because there was a suspicion that there was other stuff lurking in that breast - which was the case.  It's a tough decision but know that the recovery time for Mx and reconstruction is long and really tough.  Lumpectomy and radiation are much easier to deal with recovery-wise.  Also losing a breast and getting a foob is a complex psychological process.  Either way it's hard not to worry... best to you - I hope this helps",
      "MessageIndex": 6,
      "PostDate": "09/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/805868",
      "Title": "Help I need to make a decision peace777 lilithmoon"
    },
    {
      "AuthorID": "lilithmoon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165367/profile",
      "Content": "Apr 29, 2013 11:23AM - edited Apr 29, 2013 11:33AM by lilithmoon yes, my nodes were clear but they still took out 3 of my sentinal nodes which is what they normally do - they send them to the lab during surgery so you'll know your results once your surgeon gets the results back from the lab.  They'll also test the tumor to determine whether it's receptive to estrogen as well as to progesterone.  You'll also find out your HER status. The more aggressive tumors are triple positive or triple negative in which case chemo is likely.  You'll might do an oncotype dx test to find out the genetic profile of the tumor and whether or not you need chemo. The gummy bears are the newest and latest in implant technology, they are cohesive silicone which won't leak.  They also have a good shape to them and if you go the Mx route, it should look pretty good.  I'm pretty happy with my results and look forward to revisions.  Not everyone who does direct to implant needs revision work but it is fairly common. There is so much to know so keep researching on the internet to see what your different options are.  I chose Mx because I had the suspicion that there was more pre-cancer in my breast and I was right, so I felt good about my decision though it's pretty radical to lose your breast and get a new one that has much less sensation.  If you have a lumpectomy you'll get radiation but not necessarily with Mx. Know that whattever your tumor turns out to be, you will  get rid of it and you will heal, it's not a death sentence.  It's a very scary process because you don't get all of the information at once and you need to wait a lot and make decisions about surgery fairly quickly.  Usually there is a month between diagnosis and surgery so you'll have time.  I went through all of my options over and over until I felt comfortable with my decision.  Get lots of support.  If you are post-menopausal and ER+ then you probably will be give an aromatase inhibitor to keep from having a recurrence.  Let me know what happens next, I'm sending positive thoughts your way. ",
      "MessageIndex": 3,
      "PostDate": "29/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/803945",
      "Title": "Waiting for Biopsy to be scheduled sfin lilithmoon"
    },
    {
      "AuthorID": "lilithmoon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165367/profile",
      "Content": "May 4, 2013 10:13AM lilithmoon wrote: sfin- I'm sorry that you have to deal with this monster but the good news is ER+PR+ Her- is the easiest type to treat, the most curable.  Keep us posted.  My thoughts are with you. -jocelyne",
      "MessageIndex": 19,
      "PostDate": "04/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/803945",
      "Title": "Waiting for Biopsy to be scheduled sfin lilithmoon"
    },
    {
      "AuthorID": "lilithmoon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165367/profile",
      "Content": "May 5, 2013 02:32PM lilithmoon wrote: I'll be thinking of all of you, remember that this is a new journey with lots of ups and downs but totally enlightening on many levels.  Jocelyne",
      "MessageIndex": 24,
      "PostDate": "05/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/803945",
      "Title": "Waiting for Biopsy to be scheduled sfin lilithmoon"
    },
    {
      "AuthorID": "lilithmoon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165367/profile",
      "Content": "Apr 29, 2013 02:45AM lilithmoon wrote: Hi there, I know how scary the waiting can be but you have some good signs already, your nodes are probably clear and it is early so your prognosis will be very good.  This is the beginning of a new journey so keep breathing - your diagnosis will be revealed soon and you'll have to make important decisions.  This forum really helped me.  I was dx'd last november with stage 1 IDC.  I decided to have a UMX rather than take both.  I'm happy with my decision.  I went direct to implant and will be exchanging my round silicones for gummy bear implants in June.  Hang in there, everything is going to be ok. Jocelyne",
      "MessageIndex": 1,
      "PostDate": "29/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/803945",
      "Title": "Waiting for Biopsy to be scheduled sfin lilithmoon"
    },
    {
      "AuthorID": "lilithmoon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165367/profile",
      "Content": "May 2, 2013 02:56AM lilithmoon wrote: not knowing it really is the hardest, I remember it so vividly.  When they called to give me my results they told me that it was stage 1 - but I was in such profound shock, I could barely register it.  Once you see the surgeon you will feel better and you will get all of the info from the path lab.  Keep breathing and imagine all of your BC sisters holding your hands in a big circle, sending you healing love, prayers and light.  You are going to be fine. Jocelyne",
      "MessageIndex": 10,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/803945",
      "Title": "Waiting for Biopsy to be scheduled sfin lilithmoon"
    }
  ]
}