{
  "AuthorID": "lilith",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
  "Posts": [
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Apr 13, 2008 10:34AM lilith wrote: I had outbreaks of normal lip herpes during chemo. the doc said that was totally normal, and I chose not to medicate more... the cold sores were healing normally anyway... just one more pain to endure. I don't know about your sore - but definitely ask your doc to look at it!",
      "MessageIndex": 5,
      "PostDate": "13/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/703893",
      "Title": "Herpes Simplex? HeatherBLocklear lilith"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Mar 10, 2009 03:29AM lilith wrote: I would say one need to really talk with the surgeon before the op. Frankly, if during the lumpectomy they find a larger tumor, and it is decided I needed a mastectomy, I would not want to be woken up, to learn I have to have another surgery as soon as possible. I definitely would not what to recover only to go under again. I feel that one must find a surgeon that she trust, and evaluate with her the different situations that can arise. There are horror stories - also because this illness is being treated since many years, and surgeries 30 years ago were very very different both in the aestetical part and in the survival. We are all \"lucky\" to be ill today, and not back then.",
      "MessageIndex": 3,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/730290",
      "Title": "mast without notice? esserbre Zachsmom"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Apr 16, 2010 10:28PM lilith wrote: For at least 2 months after my mx, I went around with... ahem, a ball of cheese cloth on the mx side. I even wore it in the swimsuit! eventually, I was fitted with an amoena, and I hated the poor thing. it felt as a dead body part (sorry for the gross factor), it irritated my skin, and it stuck to my scar. yuk. I was wearing it sometimes, using one of my normal bras (I cut off the underwire from those). at home I was going 1/2 and 1/2... and sometimes I would even forget to use it inside. I guess it was good to have - if I didn't I would have wondered if that would have helped. but I know it didn't.  ",
      "MessageIndex": 111,
      "PostDate": "16/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/749767",
      "Title": "Why do I \"need\" $$$ silicone breastforms? lovemygarden lovemygarden"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Oct 27, 2008 10:04AM lilith wrote: No, Herceptin is not a classic chemo treatment. It is a hormon blocker - more similar in this sense to Tamoxifen, but acting on different hormons (not feminine hormons, so it doesn't induce symptoms of menopause). Now, it is Chemotherapy in the sense that it is a therapy  done using chemicals (chemo + therapy)... as opposed to radiation and surgery. Also, it is received usually as infusions (weekly or tri-weekly), so because of the rythm it is often confused with the classic chemo. But it doesn't give the same effects... and it is a longer treatment. I've had dose dence 4xtaxol, 4xAC, now I am finishing my year of herceptin. Herceptin didn't give me ANY side effects at all, other than an excellent resistance to illness, because it is in fact antibodies... not a cold nor a flu since a year!!! yeah! Also, I didn't need any pre-drugs, and the nurses told me that no side effects is the norm. I walk in at the doctor's office, plug in the drip, and an hour later exactly I am done. A doodle, really. If only all treatments were so painless and easy....",
      "MessageIndex": 9,
      "PostDate": "27/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723407",
      "Title": "Is Herceptin actually chemo? mother78 bluedasher"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jun 1, 2008 07:38PM lilith wrote: I guess it is what you want to look at. For me, I'll look at my mastectomy date: I consider to be cancer-free from that date. that was the 11 of July, 2007. We'll celebrate together!!!!!",
      "MessageIndex": 3,
      "PostDate": "01/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706442",
      "Title": "survivor anniversary BDB txred9876"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Sep 29, 2008 12:12PM lilith wrote: Renée... another bilat mastectomy here (one side prophylactic), with implant recon. Because of the mastectomy, I didn't need rads, and I had my recon early June... less than one year after my first discovery of a lump (29th of June 2007). All behind me now. :)) I'll just add the \"icing of the cake\" aka nipples sometimes in the fall. That will hide some of the scar. No regrets - none. not even a thought about it. Recon looks good, and is very comfortable. Even in a skimpy swimming suit - I look better than I did before. :D and knowing that I will most likely not have BC again is a great thought...",
      "MessageIndex": 27,
      "PostDate": "29/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721847",
      "Title": "Should I have a full mastectomy? BooBee kjcsis"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jun 11, 2008 10:28PM lilith wrote: First of all. Sorry you had to join us - you are so young, you must be heartbroken.  If there is no doubt that you will have a mastectomy, I would opt for that right away... what good can it be to wait? Also, knowing exactly the results of the mastectomy will help determine the treatment afterwards. Remember also that depending on the size of your tumor and/or lymph nodes involvement, mastectomy may avoid radiation. Rads are less difficult during treatement than mastectomy, but delay reconstruction by one or several years! Radiated skin doesn't stretch well to accomodate implants/recon. I would suggest that you consider seeing a plastic surgeon with a good recon experience now, before surgery - and gather your options. Rads are strongly recommended after lumpectomy...",
      "MessageIndex": 4,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707071",
      "Title": "Chemo or Surgery First wowitscancer lilith"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Sep 11, 2008 05:56PM lilith wrote: Hi. I am also BRCA2, and had bilat mastectomy with reconstruction - following a dx last year of cancer for which I have been treated separately. My dx came at 43. my mom had it at 34... so for me it was a lot later. My sister is fine, she is 42 now and never had a dx (checked and mammogrammed). We don't know if she carries the gene too. So, it looks like ages can differ, there is no telling.... but now I am very very glad to have all out. No more mammos, right now I still do blood tests every 3 months (tumor markers), but soon will be every 6 months, then yearly. Don't forget other bits at risk because of our genetic mess: ovaries (I plan to have this out), and colon need screening.",
      "MessageIndex": 37,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/706536",
      "Title": "prophylactic mastectomy-your input wanted tweekerbeeker lilith"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Sep 19, 2008 02:21AM lilith wrote: Hi there. All the debate inspired me to do a bit of a research through Google (bless Larry Page, it is my main tool of research). check it out here... http://www.cdc.gov/genomics/hugenet/ejournal/bimastec.htm includes stats about the results of a prophilactic bilat mastectomy, in case of genetic mutation BRCA. Very encouraging, if you ask me. http://www.medhelp.org/posts/show/261213 includes some cases (posted in a forum like ours). Nothing conclusive, but my drift is that usually there is only a very small amount of breast tissue left, and that the chances are that if there is a return, it is a met of the previous cancer rather than a new cancer. finally, a research on quality of life and satisfaction after the op: http://www.annalssurgicaloncology.org/cgi/content/abstract/14/2/686 Remember - web material should always be taken with a pinch of salt...",
      "MessageIndex": 44,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/706536",
      "Title": "prophylactic mastectomy-your input wanted tweekerbeeker lilith"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Sep 22, 2008 04:36AM lilith wrote: good post... interesting. Also to note, that the genes BRCA1, BRCA2 are the ones doctors know about. There may - and there probably are - other ones that disrupt our cellular work in similar or different ways, compounding the problem.  I hate this whole thing.",
      "MessageIndex": 48,
      "PostDate": "22/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/706536",
      "Title": "prophylactic mastectomy-your input wanted tweekerbeeker lilith"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jul 22, 2008 02:11AM lilith wrote: Hi, I am glad you found these boards - but sorry you had reason to look it up...   You are right, all this really sucks. I am 44, and underwent a left side mastectomy last summer, one node touched. My bra size prior this adventure was 36DD. After mastectomy, I had chemo, but all doctors agreed that I didn't need radiations. This was great, because it allowed to plan for a reconstruction. I had the right side taken out (bilateral mastectomy) and had one-step implants (skin was preserved during the original mastectomy, so I didn't need expanders). today, I have matching D. Remember that after radiation, it is more difficult to do a recon (skin is not as good as it is burned), so sometimes it is better to do a mastectomy rather than a lumpectomy. I asked the doc to have smaller breasts than before, but given my frame my current size works well. The reason of my drastic decision on having a bilateral were multiple: family history, but also better chances of having matching breasts... I really didn't like being loopsided! today, i can go bra-less, wear spaghetti-strap tops, wear a bikini.... yay! it took one year to get here, but it feels good.",
      "MessageIndex": 1,
      "PostDate": "22/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/709468",
      "Title": "masectomy - seems like this sucks rseaw22 Mandy1313"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Aug 21, 2009 06:55AM lilith wrote: Ok, ladies, don't get mad at me. No, I am not one of you. I want to say why I come here and read sometimes your posts: because maybe there is some help of advice that will be useful for my mom.  you see, she is a BC survivor since 30 years, and now she has an advanced stage of lungs and bone cancer. No-one knows if it is a reoccurrence - probably not, but who knows - test results from the first round aren't available, so there is no comparing. Anyway.  While of course, offering advice would be totally out of place for me, please: do not close the board - the information is beneficial, and there is no ill-purpose in our reading...  And learning how others deal with the pain and fear sometimes helps me to understand my mom better.",
      "MessageIndex": 14,
      "PostDate": "21/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739271",
      "Title": "Advice for metsters konakat RobinWendy"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Sep 3, 2008 11:24AM lilith wrote: Lyn... where are you in Switzerland? I am in the French speaking area... Are you resident in Switzerland? you must be, even if you are an expat! unless you are with the international organizations.... in all cases, you have insurance, and they cannot cancel it on you. It is illegal to be resident in CH and not have insurance - you could sue your employer. You may have public insurance, but you still are fully entitled to get treatment at all hospitals. Including, Chemo, Herceptin, and whatever else. There is a very good health care, and extremely efficient.  Do send me a PM, I'll try to get you all info you may need...",
      "MessageIndex": 3,
      "PostDate": "03/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/720503",
      "Title": "Help with Pathology Report lyn1117 2z54"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Feb 25, 2008 03:53AM lilith wrote: Hi Red... I see that you are new to this community. If you read some of the comments, you will see that you are far from being the only one with these feelings... it is scary. Each of us deals with it in a different way, and what works for one may not work for the others. Lori has some very wise suggestions and points. On my side, I choose not to go \"there\". I am alive, now, and feeling quite well. This is the most important to me. Also, I know that even in the worst situation, I have time in front of me, and that is also important because this means that I will see my daughter grow up, and I will be here to take care of her. Of course, i would prefer to be healthy... and I plan to be, but I also want to live THIS life to the full, to go out, party, enjoy travelling, food, wine, friends... without worrying. It is a constant choice: if I sit down and start thinking \"what ifs\" scenarios, I feel I would not be able to stay serene and to enjoy my family. On the other hand, I also choose now different priorities. My family and my life come first. That also really helps me...",
      "MessageIndex": 3,
      "PostDate": "25/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/701049",
      "Title": "not sure what to do know red33 trigeek"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Sep 12, 2009 02:20PM lilith wrote: Hi Giggles, so sorry you had to join us - but if you needed our help, I am glad you found this place. This site is a mine of good info, and I am sure you will also find good friends. You are going through a rocking time. It is tough to be a single mom, and having to face a BC diagnosis at the same time is overwhelming - I know that very well. What to say? what to explain, how much to explain... and the awful part, to wait to learn the full extent of the DX, without showing the stress nor mentioning it. Do you have family aroud? sisters, brothers, parents? it would be very helpful to you and - even more so - to involve them now. When you will learn more about your treatment plan, you will be better able to make plans - but if you have a sister or a mom close-by - able to be with you as you talk to the kids, and to help re-assuring you - it will make feel them safe and a better. If you don't - maybe friends? you may be amazed to see how the true friends come through in such a situation. I was. That may be the ONE and ONLY blessing of being ill: that you can truly tell who is there with you - and who is not. Giggles, we all here on the site will be throught the journey with you. It is a promise we always keep.  ",
      "MessageIndex": 14,
      "PostDate": "12/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/740288",
      "Title": "OMG PLEASE HELP! iamgiggles1 cbm"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Oct 8, 2008 01:55PM lilith wrote: Hi Robin. Both after my initial mastectomy last year and after the bilat with recon this summer, I always wore exactly my normal clothes. For the bras - I snipped out the underwire from the mastectomy side, and kept wearing them - stuffing my bra for the first time in my life ;) the surgeon ensure that the scar was so well placed, I could even wear a swimming suit - a bikini of all things!!! One month after the bilat with recon this summer, I was travelling overseas and wearing totally normal clothes. Best of luck!!!",
      "MessageIndex": 4,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/722455",
      "Title": "Wardrobe tips and social life Texas357 lvtwoqlt"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jan 29, 2009 12:13PM lilith wrote: Kara, I am sure you will be fine. And then you will be able to relax, and go back to a blissfull oblivion for many years, feeling good in your body and happy with your life. Do plan a nice dinner out with your husband, and something happy.  You will not feel the needle. Doctors are careful to anesthesize you so if they expect it to hurt, they'll make sure you won't feel a thing. Only you may need to wait for results afterwards! I suggest you make friends with camomile tea and other relaxation techniques... :) ",
      "MessageIndex": 15,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727718",
      "Title": "Young and Worried... kara241 lilith"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jan 21, 2009 05:17AM lilith wrote: I don't think anybody can really offer consolation - you are doing the best thing you can, getting it checked quickly. Having had your PAPs or not would not change anything to the current situation! I am sure your doc told you that more than 80% or the lumps felt are actually benign. That is a great number. Your doctor is a very smart person in not brushing you off (you wouldn't believe how many would!!!), so you are in good hands. Most likely, it isn't anything. And if it is - then remember, treatment is here, and is effective in the large majority of cases. The most difficult time is waiting for the DX - try to get your mind off it and relax if you can. And, STOP SMOKING NOW. if a Breast cancer scare is good for something, it should be to reform our lifestyle and bad habits!!! your doctor will be happy you did.  ",
      "MessageIndex": 2,
      "PostDate": "21/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727718",
      "Title": "Young and Worried... kara241 lilith"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Feb 4, 2009 09:42AM lilith wrote: Kara, are your results in? keep us posted please. Crossing fingers and touching wood.... Tina, thinking of you as well, it is soo scary. I hope someone is with you, holding your hand while you wait.  ",
      "MessageIndex": 19,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727718",
      "Title": "Young and Worried... kara241 lilith"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jun 20, 2008 06:32AM lilith wrote: I have a port, don't know what make. It is brilliant - it is totally invisible under the skin, but easy to find for the nurse. I have no issue to wear anything, no-one can spot it even in a bikini. It was a bit painful after the operation (it was done at the mastectomy time), but after healing I cannot tell I have it. I kept it after chemo for Herceptin, and use it for everytime they need bloodwork - no more needles for me!!! I am really in no hurry to get it out...",
      "MessageIndex": 9,
      "PostDate": "20/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707507",
      "Title": "Hickman catheter vs port-a-cath anahat gramma23"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jun 15, 2008 01:12PM lilith wrote: Hi Kara... maybe a hairdresser could help you this time. Why not step in, and ask what to do? they should be able to tune down the red right away, and suggest what to use next to keep your hair in the color you like...",
      "MessageIndex": 1,
      "PostDate": "15/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707368",
      "Title": "Hair Color Mistake Kara Kara"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Dec 2, 2008 11:20PM lilith wrote: Please share all our very best happy birthday wishes with this lady. Actually, if you would want to send me her address by PM, I'd be delighted to send her a birthday card!!! I also understand if you prefer not to. She is definitely a brave and strong lady. I didn't have radiation - but from all I hear it is quite hard on the skin. However, there must be something more that can be done.. I guess surgery has been ruled out because of the lady's age? It is true that health care in UK is a bit slow, and often penalize older patients. Have you thought of posting on the UK board? it is a quite lively one, and people there may be more in tune with treatment options there. here is the url... http://www.breastcancercare.org.uk/",
      "MessageIndex": 3,
      "PostDate": "02/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725343",
      "Title": "suggestions for 100 year old patient Mandy1313 Mandy1313"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Oct 29, 2008 02:35AM lilith wrote: I think you should get on their back, up to when you don't have your MRI scheduled. They don't seem to be proactive at all, and several times you had to call to get a reply. Frankly speaking, it is your boobs on the line, you are likely to be the most interested person in the whole deal! Plus you don't want to pass the 5th line with the insurance, they are painful enough.... Touching wood that it is nothing, nothing, nothing!",
      "MessageIndex": 1,
      "PostDate": "29/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/723504",
      "Title": "Light a fire? jenirae mginger"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Apr 11, 2009 08:50AM - edited Apr 11, 2009 08:51AM by lilith Ally, many doctors actually support this rather than just watching.  I had my BRCA test coming up positive, and I never had a doubt about what I was going to do... the genetic oncologist was VERY positive about doing a bilateral. He also mentioned that being young (43 at dx) I was doing the very best in order to live still a long life. Gosh how I liked that guy being positive! that was great to hear.  Also - hey, the recon is symmetric and pretty good. That is much more difficult to obtain when the recon is done only on one side... :)) that is definitely a plus.  My new breasts are as much a part of me as my previous one, they are better looking than before, and I don't miss anything. I just hope it will keep going a long time.",
      "MessageIndex": 13,
      "PostDate": "11/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/732028",
      "Title": "contralateral prophylactice mastectomy 2 years later ally2 mythreesons"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jun 9, 2008 07:36AM lilith wrote: I am so sorry. I know how hard it is.... expecially having had long hair, it looks like a very long time to get it back there... I had it long too, before. But you know? I am so happy to have HAIR, that I don't care if it is long or short!!! It's there!!! and it's full, lively, spiky, determined to grow. HUGS to you. I am sure your son and husband will be thrilled to have you - with short or no hair! - and will support you and help you. Welcome here.",
      "MessageIndex": 2,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706996",
      "Title": "Mourning for my hair Sable MsKarin"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Mar 2, 2009 12:32AM lilith wrote: Karen, why is your heart so set against Tamoxifen? I feel you may want to take some further information on the drug. I am not trying to say that it is a wonderful thing - but considering the options... it is as good as it gets. It is NOT hormons. It is an hormon blockers - that is already different. It may very well be that taking the pill for 15 years had a play in your BC; yet again, all statistics say it is unlikely. I can imagine that the side effects as described discourage you... however, you should remember that people posting on the board are the ones experiencing strong SE, not the hundreds, thousands that are taking the med and not having any SE (myself included, with only a mild and occasional bone pain). If I really have to be fair, the worse SE for myself has been the immediate menopause. I would have liked another baby... but I've waited too long, and with an ER+ status, a new pg could kill me. Chemo anyway put me in chemopause, and tamox confirmed it. So, be it. It is shocking to get a diagnose so early; I was only 43 at the time. But this makes it even more critical to follow the therapies that are available, because you have a whole lot more of life to live. You are not mentioning in your post your views on chemo and rads (rads would be proposed also, if you have more than 2 or 3 nodes involved). Also, I am sure your onc will talk later about Herceptin - which is an easy drug, without side effects or very mild, that can be litterally life-saving for people like us HER+.",
      "MessageIndex": 16,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Feb 20, 2008 08:51AM lilith wrote: My docs all agreed that taking vitamins and supplements is OK. I took regularly multivitamins, extra magnesium, echineacea. I had terrible leg cramps and the magnesium helped (I think...). Note that I am in Switzerland - and doctors have different ideas in different geographical regions. Through other connections, I also got recommendations for other supplements, such as Reishi or Tea extract, but I stayed within classical medecine and doctors I trusted.",
      "MessageIndex": 1,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/700691",
      "Title": "Supplements while on Chemo? NancyLa Poppy_Spruce"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "May 20, 2010 01:14PM lilith wrote: Hello dear,  so sorry you are so worried and scared... The above posters have made some very good points, including the fact that there MUST be some support there available for you - you just don't know about it. Now, I know there are some posters here that are based in Japan... they may not come on the board very often... but still. There is also a \"side board\" to this one, where we go to find information about reconstruction. It is hosted by a lady called TimTam... I believe she is in Japan, if you post or send her a PM, perhaps she will have some hints for you.... :) Wishing you all the best.  ",
      "MessageIndex": 8,
      "PostDate": "20/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752864",
      "Title": "So scared I'm shaking. . . . Army-Travler lookingforward4more"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jun 15, 2008 04:15PM lilith wrote: My last chemo was Dec. 3rd. By early January, I saw lashes and hair growing. By March I was able to go wig-less.... and my avatar shows today's growth. I am considering going for a haircut - but I LOVE running my fingers through my hair!!!!",
      "MessageIndex": 9,
      "PostDate": "15/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jul 25, 2008 01:02PM lilith wrote: I finished DD AC and Taxol on December 3rd... see my avatar to see current growth. I've been wig-less since April.  Growth starts slow - and only about one month or two after the last dose. You see, the last dose is in fact the last cycle... so it will be wreacking havoc in your body for at least one month. if you cound the end from there, you will see it makes sense. After one month you see peach fuzz, then more and more every day. Lashes sometimes DO fall out only after the end. but they are also fast to grow, and they amost grow overnight! ok, not quite... rather within a week. I didn't loose them all at once - but it is true that about 2 months after, I noticed lots of lashes falling out, became a BIT sparse again - now it is all normal again. Hang in there!",
      "MessageIndex": 178,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jun 6, 2008 07:12AM lilith wrote: It definitely could be the steroids... I don't know what kind of chemo you are on, but it could also be your body's reaction to the fatigue. If the chemo isn't affecting your digestive tract, then it makes sense that the body's asking for nourishment for rebuilding! Try to eat well... fruits, veggies, lean proteins, whole grains... and yogurt, to help your tummy.",
      "MessageIndex": 1,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706831",
      "Title": "Ravenous hunger after chemo tomatojuice LoriFL"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "May 28, 2009 12:31PM - edited May 28, 2009 12:31PM by lilith Fiona, I don't think anybody can really tell you bad/not bad. Obviously, there would have been better outcomes, but that you already know, right?  What is good to think about is that now - after the mastectomy - you can consider yourself \"cancer free\", or rather, NED (No Evidence of Disease). All the following care is to do the best to keep you like that for the longest time. That is the same for all of us!  You are young, and doctors will propose you all kind of treatments, all quite aggressive; your age is definitely a factor. As you are ER negative, you will at least not have to undergo long term hormonal treatment. Believe me, it is a bonus.   I am sorry you had to join us here, but you are welcome. There is lots of help and good information to be found, and that is definitely a plus to understand what your choices and options are.  ",
      "MessageIndex": 4,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/734912",
      "Title": "Everything is happening so fast fiona1144 lpizza726"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Feb 6, 2008 07:21AM lilith wrote: Oh I hated that part!!! yuk. I am so sorry it feels like that to you too... The only thing I could do, was to chew on minty gum - the stronger, the better. I also liked broth - I could still detect the saltiness, and it was better than other murky stuff. I guess saying that taste is \"metallic\" is just a generic approximation, I personally don't know *chuckle* what metals would taste like... Try to eat anyway, you need to stay strong, and food and sleep are the best ways our body has to strengthen and restaure energy...",
      "MessageIndex": 2,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699823",
      "Title": "I Want My Tastebuds Back Bonnielv licorice2006"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "May 6, 2008 04:56PM lilith wrote: oh, my, you do have a full house.... and you are so young. If I can add an encouraging note, you may find that you aren't as tired as you fear. I found that being young and strong helps (at least that!!! ahem). I am 44, single mom of a 12 yrs old...  I was actually in pretty decent shape, if one except 3 days each cycle (I did 2 weeks cycles, dose dense, 4x A/C, plus 4x Taxol). I had leave from work, but kept showing up for meetings a couple of days each week. I would suggest you find a cleaning lady - that is a MUST. Don't try to spend the little energy you have on cleaning! spend time with your babies. maybe also your husband can lend a hand...",
      "MessageIndex": 3,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705071",
      "Title": "Child care during chemo AndreaM4567 engk916"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jan 28, 2009 10:51AM lilith wrote: Well, maybe finding a breast surgeon is a bit fast, but I think an ultrasound is in order NOW, and perhaps also an MRI. An ultrasound is a cheap, easy, non-invasive exam - I really don't understand why your doc has not done it yet, and please, do not take more antibiotics or else before a test. Many doctors take the age factor too seriously - and in fact it isn't really. However, before going down the road of biopsy, there are other exams that should be done! A mammo may be painful, but MRI (these are expensive) are very through, and can also help to plan a biopsy afterwards because they allow to locate the trouble spot. Go back to your doc, insist, and if he still resists find another one.",
      "MessageIndex": 4,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/728088",
      "Title": "Whats wrong with me? alt08 EleanorJ"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Sep 9, 2008 05:30AM lilith wrote: I was in 5 days. Not that I was sick, actually I was rather bored - but the insurance covered all and the doc would only let me out after all the drains were removed. I was never uncomfortable or sick, I remember surfing internet like a mad-woman... :) probably posting on this board.",
      "MessageIndex": 5,
      "PostDate": "09/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/720834",
      "Title": "How Long in Hospital after Bi-Later with Reconstruction? Mocity mom_of_2"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jan 18, 2008 04:20AM lilith wrote: OH boy!!! am I ever looking forward HAIR, curly, straight, blond, red, or whatever!!!! hair, hair, HAIR!!! at this point, I have a fuzz head that looks like a 5 o'clock shadow. It is pretty even - 1/4 inch long, and dark brown all over. I've never been curly, so what the heck - I'll have a kick of having it without perming. but it does feel already unpleasant under the wig... I've been wearing wigs since I lost hair, for business purposes (showing a healthy face...) and for family (some of my family cannot know of my illness, long story). now, if I suddenly show with 1/2 inch black hair, there is bound to be some reaction... :)) Maybe I'll go afro???? :))",
      "MessageIndex": 6,
      "PostDate": "18/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/698653",
      "Title": "What do u do when yer hair starts growing back? paxton Myrajuc"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Oct 30, 2009 10:29AM - edited Oct 30, 2009 10:30AM by lilith I am also BRCA2+, with a teen daughter. She must be of age to decide if she wants or not the test. This is not negotiable - legally - in most countries. I fully understand your stress over the question, but also think of her. This decision is really hers to take - not for you and your stress, but for her own life. In the meanwhile, you have to think that - as other point out - knowing now wouldn't change anything, would only add to fear and stress. My mom is most likely BRCA2+ (we don't know, the docs didn't consider the test relevant now) and she had BC. My sister is disease-free so far (she is 43), and BRCA2-. So there are chances that your daughter will be too. Try to put the questioning aside for now, take care of your health. Remember also that - should it come down to this down the road - treatment evolve all the time. The difference between what my mom went through 30 yrs ago, and my treatment 2 years ago are dramatic, as well as my chances. Should your daughter be positive in 15 years - there may be treatment for that! Of course it is relevant information, but for a young adult and not for a child.  ",
      "MessageIndex": 7,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/742842",
      "Title": "BRCA2+ with young daughter -do you have her tested? kmg1015 Breastless"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "May 18, 2010 02:35PM lilith wrote: An invaluable support group. Comparing notes, suggestions, ideas, virtual hugs with a group of girls going through the same DX was absolutely great. I was able to ask the right questions and make informed decisions much better... :) Those girls are and will be very dear to my heart. ",
      "MessageIndex": 22,
      "PostDate": "18/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/747826",
      "Title": "Please share how breastcancer.org has impacted you.... Moderators gentianviolet"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jan 29, 2009 11:09AM - edited Jan 29, 2009 11:10AM by lilith I quickly butt in on this one... I met my fiancé while on chemo. Sucker huh - just meeting someone when I was feeling less than attractive - \"bald and monoboobed\". That was almost 2 years ago. The absolute BEST thing was that I never, ever, ever saw a flicker of ugliness in his eyes. He never looked at me as a sick person, and - I could see myself normal through his eyes. I was able to be home without a wig, and still he was just as tender, sweet and cuddly as I could have wished. I have no idea how he did it... and the endorphines that I got back then from the falling in love were the most incredible support I could ask for. As for the sex... *blush, blush*, it was great - and still is now, even after chemopause, and now an ovariectomy. (hoping that it will stay like that). I had a port in during the initial mastectomy, because they knew I would need chemo, and LOVED it. I have bad veins, and it would have been an agony to search for them everytime for 6x cycles, plus the bloods check-ups weekly. I was lucky, it was totally invisible on me, and a huge help.",
      "MessageIndex": 26,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/728047",
      "Title": "How help my wife through chemo? Husband11 Ninja"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jun 8, 2008 11:50PM - edited Jun 9, 2008 12:17AM by lilith OK... I've posted the list here: http://www.breastcancercare.org.uk/bcc-forum/discussion/18612/shopping-list-and-suggestions/ Depending on the replies, I'll ask it made a sticky so it stays on top. I'll work for a french translation, and ask my doc if she is interested in using it for information to new patients... :) Hope your b'day was a happy one. I also turned 44 at the start of chemo.... :) and I fondly remember the friends who made it beareable.",
      "MessageIndex": 18,
      "PostDate": "08/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jan 22, 2009 10:47PM - edited Jan 22, 2009 10:47PM by lilith Interesting to find this group of \"daugthers of suvivors\"... I feel like a daughter of the revolution - LOL. I am also the daughter of a 35 yrs BC survivor. Mom is just now going through some more Cancer - alas - they found it in her lung, but it is totally unlikely to be a follow-up of her old BC. I am 45, and was 43 at DX time, my mom was diagnosed at 38... and I am a BRCA2 carrier. Tina, one day at a time. Maybe you'll get good news - it is so hard to wait!!! It is also important to remember that - whatever it is, it is highly treateable, and that YOU WILL SURVIVE too!!! and life goes on after. It will take some time, but it goes on... see my picture? even the hair is back!!! Hugs to all. I am happy you all found your way here, it is a great site for exchanging information, learning and finding support.",
      "MessageIndex": 9,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727763",
      "Title": "daughter of bc survivor ~ now it's me! kristinabergner TheQu33n"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jul 24, 2008 03:53AM lilith wrote: BTW... I have no use anymore for my short spike red-head wig - my really good one, made for me. the others are ... well cheapos from ebay, but this one was my good one. Marta, I'll be happy to send it to you, if you PM me your address... I can send you separately a pic of myself WITH wig.",
      "MessageIndex": 7,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/709504",
      "Title": "starting DD AC-T in August - what to expect?? jetset31 familyroks"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jul 23, 2008 08:47PM lilith wrote: Hi Marta. This whole thing is a terrible waste... not only the hair. But hang in there! I had a similar treatment schedule as yours. Mastectomy, then DD AC plus Taxol (4 each). Now I am on Herceptin. Wigs are very expensive - my best tip is to go on ebay, and look at what you can find. I got very nice funky ones there from HongKong, at a price of about 20US... I had 3 or 4, changing colors and cuts. I didn't gain a pound, actually I lost LOTS of weight (got it back on though now... sigh), because the treatments agains nausea gave me - ahem - the runs. Go figure. I did stop working, I couldn^t be involved full time, and as my insurance coverage was great, I decided that on \"good days\" I would take the time for living. Also, I planned vacation time - and took off for a cruise between the AC and Taxol courses. It was doable... My guess is that you will be fine with the wedding, and enjoy it. See how your first treatment goes, then mention your plans to your docs, and see if you can plan your treatments so that your week-end time is good.. Keep it up. As nasty as it is, the worse time for me was back were you are now... waiting for the start. From then on, every treatment was making my way out of it, every day was being closer to finishing. :)",
      "MessageIndex": 3,
      "PostDate": "23/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/709504",
      "Title": "starting DD AC-T in August - what to expect?? jetset31 familyroks"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jun 6, 2008 05:24AM lilith wrote: Rock: I am impressed with how exhaustive and helpful your list is. It should be a sticky... 2 things from my side: - wigs: I was very successful shopping for cheap wigs on ebay. They are made in the far east, and even with the shipping you can get a pretty one for about 20$. I tried also some natural hair, but didn't like them - the artificial hair were perfect. I had several so that I could rotate and wash them (bonus: experimenting with hair color...) - why not posting this same list in other BC sites? there is one in UK (breast cancer care), and I am sure also plenty of others in canada, australia, africa... it is such a well compiled list that it would make sense to diffuse it. Note that if you wish, I can help with translating it in Italian and French. I am sure other here would be available for German and Spanish (and I think we also have contributors from Asia...). Let me know if you want help.",
      "MessageIndex": 1,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Apr 24, 2008 05:03PM lilith wrote: I had dose dense AC/T, 4 and 4 bi-weekly. I am doing herceptin now. I hated taxol, even more than ac. it made me feel yuk, fingers were tingling and unpleasant. not much more than that, just a bad flu (but I think it was also related to the Neulasta injections). very tired. I am now 4 months past, the tingling is all gone, and only 2 toenails became bruised (black). None fell off, they are growning out (but for a moment, I kept one glued on with band-aids...).",
      "MessageIndex": 11,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/701143",
      "Title": "Taxol Side Effects Dragonfly92127 shelloz1"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Aug 25, 2008 11:47AM lilith wrote: Thanks mommy... I'll keep that in mind. My genetic tests are already done, but in Europe. If I move to the US, Î'll keep it to myself...",
      "MessageIndex": 3,
      "PostDate": "25/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/720012",
      "Title": "BRCA and future insurance? 3boyz2keep 3boyz2keep"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Apr 29, 2008 10:11AM lilith wrote: Hey Jacqui... I stopped smoking ages ago, some 20 yrs (I am 44). So that wasn't an issue. On the other hand, I did NOT stop drinking. I drink socially, regularly, a couple of glasses nightly, occasionally a tad more. Upon advice of my doc, I didn't stop - she said that taking away fun and pleasure was a sad way to go through it. To go with the flow, and do what my body needed. As a result, I didn't drink on the \"bad days\", because I couldnt stand the taste... then once recovered (3 days later), I would happily pick up my social habits, and open a good bottle with my significant other. I had a relatively easy time, finished last october, and have been recovering well since. My take, if relevant, is that your mood and your well-being is the most important thing in this ordeal.",
      "MessageIndex": 2,
      "PostDate": "29/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704732",
      "Title": "Smoking;Drinking and Chemotherapy! jacquibutterfly EyesOTex"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Apr 20, 2010 01:05PM lilith wrote: Lizzymac, good luck with all the decisions you are soon facing. Remember there is a life after! I am almost 3 years out... :) and doing well (tomorrow I am going to my next check up, crossing fingers).  I used to be a 38DD (so quite large breasted), and had initially a unilateral MX. I used my normal bras, snipped out the underwire, and wore them with a stuffing - litterally, folded kleenexes or cheese cloth! I am 46, and it worked great. No-one could tell, not even with a bikini. For clothes, that wasn't a problem, I kept the same stuff (just got rid of some low-cut blouses, I should have kept them... grrrrr). Eventually I got the other side taken out as well, and a reconstruction done with single implant silicones. ",
      "MessageIndex": 51,
      "PostDate": "20/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/751379",
      "Title": "Just diagnosed and I need advice! 1WonderWoman goodvibesonly"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Mar 14, 2009 09:45PM lilith wrote: Oh, dear, how scary! I understand you must feel floored. Yet, you must think and remind yourself that so far, you are fine. Your DX just say you are at high risk - but there is no reason to take steps that WILL interfere with your childbearing options. later on, in a few years, you may take more aggressive decisions - or maybe, medecine will have advanced and you will have different choices. So far, I feel that there is no reasons to be too dramatic! I am 45, and am BRCA2. yes, a couple of years ago I was DX with BC. before that I had my kid (and I could have had more), and had I known as you do that I had a defective gene I would have followed up better my risks. I also have a family history. I suggest you take a positive spin on it. Possibly, get a second opinion, and discuss it with your family and friends. Life is about taking risks... but also about doing what you want. What life would that be otherwise??? Note that statistically, Ovarian cancer hits after 40. That is why your doc hints at age 40... ",
      "MessageIndex": 1,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/730717",
      "Title": "BRCA 2+..still want to have children.. what can I do? MKMS22"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "May 26, 2008 06:21AM - edited May 26, 2008 06:23AM by lilith I found decent ones on-line, on ebay... really cheap, from HongKong. It was nice to have several different ones, so I could choose if I wanted to be a blonde or a brunette... ;)) The insurance paid me a special one - it was indeed the better fit. Can't beat the fun of getting new ones in the mail occasionally!!! I am 44 - my changing colors was known to the nurses at the hospital, and they were coming in to say HI just to check the new wig... I think I got a great service!!! :)",
      "MessageIndex": 19,
      "PostDate": "26/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705965",
      "Title": "wigs and hair loss mizz jdg1"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Feb 21, 2008 11:57AM lilith wrote: Good luck with the port. It makes life a LOT easier and confortable during chemo, nobody will be poking your veins!!! if you are like me, that is a major benefit. I am also keeping it for an extra year, as I am getting Herceptin through it, and it gets the the whole process very fast and painless: 1h in and out of the doc office, not even need the clinic... Putting it in was not easy. They did it during the mastectomy surgery, so I wasn't awake, but they told me after that it was the tougher part of the surgery. It took the surgeon one hour to set it in properly, my arthery was hidden under a muscle and they had to move around it - so result, I was a LOT more sore from the port than from the mastectomy!!!It took 3 or 4 weeks before I was comfortable carrying my handbag on either side: mastectomy side because of the scar, port side because of the stiffness in the muscle(luckily... my boyfriend didn't mind to much to be carrying around a lady's purse, bless him, I made sure to kiss him for the hassle...). When a nurse tried to get a needle in the port after the op, he went in with his big fingers to find it, and I screamed. Loudly. Then, I proceeded to tell him that if that was for giving me my paracetamol, to hand me a box of Tylenol, and begone!!! that was promptly done. Why am I saying that: because it may hurt a bit in some cases, and it doesn't mean it is a bad thing, and because sometimes it is good to discuss what the nurses or others say... question, question, question, and sometimes you are right.... :)",
      "MessageIndex": 7,
      "PostDate": "21/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/700678",
      "Title": "Having a port put in siuane msthanglila"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Dec 18, 2008 01:30AM lilith wrote: Hi... I hated the falsie. And, I am BRCA2+. So, after the initial mastectomy, I opted for a bilat. and asked the doc to fit in DURING the second mastectomy - 2 implants - small or whatever made most sense. I was adamant I didn't want to live with expanders. I didn't care about big boobs (been there, done that), but I wanted a normal fit in clothes - I work in corporate environment, and I often chair big meetings and conferences (knitkrazy, I don't think you are narcissistic, rather quite realistic...). So I was done in one op only. I am not the same size as before, but I didn't want that, I am more or less symmetrical, and can jump off the bed and get dressed without a bra if I want to (small silicones stand up! at 45 that is a pleasant thought). The way I see it, I just wear the falsies under my skin, so they are lighter, they don't rub, and I don't have to worry about how they droop.",
      "MessageIndex": 98,
      "PostDate": "18/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Apr 13, 2008 12:41PM lilith wrote: well, I guess we are all different.... I went on a cruise DURING chemo - only a week, and it was going over venice, greece and turkey. It was fun - and a good way to change horizons and think of something else. I kept my dates flexible, as just before going I had a bit of a fever and was afraid of not being able to... Since finishing chemo last December, I've been on several trips, either by car or by plane and train. I didn't go yet oversea - will do that this summer for sure, after my recon. I always travelled a lot, and for me, it was an obvious thing to keep doing it.",
      "MessageIndex": 5,
      "PostDate": "13/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/703867",
      "Title": "Traveling after chemo kimbly lilith"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Feb 27, 2008 12:11PM lilith wrote: Sic. I've heard it happens sometimes. I've read that it is because each lash has a lifespan of about a month or two... and as in our cases they all had come in at the same time, they fall off all together (quite insensible if you ask me  ), and it can happen a few times, up to when they are FINALLY out of synch again... Just when mascara had become useful again...",
      "MessageIndex": 3,
      "PostDate": "27/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/701167",
      "Title": "Losing Eyelashes a 2nd time susieloutoo Tessmerelda"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Jun 24, 2008 01:13AM lilith wrote: Hi Cupcake... yes, HER++ is for life. Herceptin is for one year to cover the riskier year for us... no pills to take afterwards (unless you take others, such as tamoxifen). I don't have any identified SE from Herceptin... I am occasionally tired but I was way more tired before my DX (pushing myself a lot more to get all done). Also, Tamox is not that bad for me. Hot flushes, yes, and some dull joint pains.",
      "MessageIndex": 4,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707880",
      "Title": "Herceptin ellie123 ellie123"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "Apr 28, 2008 07:24AM lilith wrote: :) Lorena, just as you... only I have daughter. cannot add much, if not to make sure you have a cordless phone... with a battery lasting enough! so you can keep it with you. For me, it hasn't been too bad. A few friends really came through during the chemo, and have been extremely supportive, offering to come by as much as needed (but I didn't need them! yeeppeee). While we all agree that this illness sucks, and chemo is not the least of it!, I found a ... renewed faith in humans, by seeing how people came around to help. My most critical advice would be not to hide your illness, but to accept to show you need help. From the post man bringing upstairs your mail, to the cleaning lady making extra-sure that your home is sanitary so you don't catch a cold... from a collegue bringing you office gossip and cooking a warm meal, to acquaintances offering to come with you to chemo, chatting and discussing. It is all precious, and in some cases people have now become close friends... :)",
      "MessageIndex": 3,
      "PostDate": "28/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704677",
      "Title": "Living on our own rock SuperMujer"
    },
    {
      "AuthorID": "lilith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56561/profile",
      "Content": "May 29, 2008 12:17AM - edited Oct 23, 2008 02:34PM by lilith Hi Gabi, maybe I can also give you some pointers. I have a similar road-map - I am 44 yrs old, 1 node, 8 rounds of chemo, no rads, one side mastectomy. And I came up as BRCA2 positive. For the record, I live in Switzerland, and I have found that the quality of health care I am receiving is superlative. I have interviewed at lenght my genetician (he also specialize in oncology) and my oncologist. I had already planned a bilat (I already have one breast missing, and for reconstruction purposes it felt logical to start on both side with an implant...), so that is going to be done next Monday (can't wait...). Per doctors' opinion, with BRCA2 the chances of ovarian cancer are pretty high, but not as high as with BRCA1 (in the 20% range rather than 50%). So they told me that I can take my time to decide, it isn't as URGENT as it may be sounded sometime. I'll probably do it, toward the end of the year. Anyway, I'll never have more children: chemopause seems to be here to stay, and now with 5 years of Tamoxifen and Herceptin! Such operation is done by laparascopy (no full incision), with a recovery time of a couple of days. Here, they'd keep me in the hospital 2 or 3 days as they are very careful, but I would expect a faster process in the US. Note one more thing: my mom is also most likely BRCA2 positive. She had breast cancer in '72 at 34 yrs old, underwent mastectomy and rads (no chemo), is alive and well today. She never had a recurrence nor further cancer declarations, she is turning 70 this year, never changed anything in her lifestyle or food intake. She even smokes occasionally (very occasionally), and drinks wine or cocktails in moderation, is not physically active, adores going in the sun. I am saying this to remind all of us that this is NOT a sentence, it is a statistic. I see it as an opportunity to take decisions in my hands...",
      "MessageIndex": 14,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/706229",
      "Title": "BRCA2 positive and now what??? seoulite tweekerbeeker"
    }
  ]
}