{
  "AuthorID": "Lillypoppy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193044/profile",
  "Posts": [
    {
      "AuthorID": "Lillypoppy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193044/profile",
      "Content": "Oct 23, 2016 10:07AM Lillypoppy wrote: Hi Tigio17/Amaplola Sorry you find yourself here. I was diagnosed 3 years ago at age 41. The first few weeks are so stressful as you have to learn a lot about cancer and treatments in a short space of time. What I can tell you is your Drs should tell you the best treatment plan for you .... my advice to you is do your research, ask questions on this site and to your nurse and do not feel rushed into decisions/surgery etc. There is time to make the right decisions for you regarding type of surgery etc and we each come to a place to make the best decision for our type, grade, size of cancer etc. The surgical decisions you make now in reality you have to live with longer term so it's important to make the right ones for you. It all feels such a whirlwind in the beginning but you will feel better once a treatment plan you comfortable with comes together. This website is a great resource. Take care. We're here if you need to ask ANYTHING. Lilly x ",
      "MessageIndex": 2,
      "PostDate": "23/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/849229",
      "Title": "42 dx with invasive mammary carcinoma (grade II-III provisional tlgio17 tlgio17"
    },
    {
      "AuthorID": "Lillypoppy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193044/profile",
      "Content": "Jan 3, 2014 02:28PM Lillypoppy wrote: Hi  1MjndyydniM1 - I had bilateral nipple sparing mastectomy and immediate implants using seristructure which is a mesh similar to Aloderm.   I was a D cup prior and am a D cup now but would not have been able to go any larger going straight to implants. I am really pleased with the cosmetic outcome and so happy I chose this option.  One thing I found useful taking in hospital were small gift bags ( I used pandora bags) to carry my drains in. I also found plastic bags useful to cover drains so I could shower and keep drains dry. I also found a V pillow useful to get comfortable. A electric heat pad ( like a small electric blanket) was a great. My breasts felt cold and I put it on low heat for comfort. (Surgeon approved) The pain killers also gave me stomach pains (constipation) and I used the blanket then too. Pyjamas with button down top as others have said - pyjamas better than night shirt as when being examined at least bottom half covered!  Sending you lots of good luck wishes.  Lilly xx",
      "MessageIndex": 12,
      "PostDate": "03/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/816358",
      "Title": "Mastectomy with reconstruction coming up....VERY NERVOUS 1MindyydniM1 Skiergirl"
    },
    {
      "AuthorID": "Lillypoppy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193044/profile",
      "Content": "Jan 12, 2014 12:00PM - edited Jan 12, 2014 12:03PM by Lillypoppy HI NNN Hopefully your Oncotype will be low hence making your decision for you. My histology results were similar to yours and I had resigned myself to no chemo and then my Oncotype had a score of 30. I feel your dilemma as I too had similar feelings about chemo and it's long term side effects and weighed up all the percentages like yourself. Having a little bit of medical knowledge I eventually after huge deliberation decided on a chemo regimen called CMF. Im no expert but it's known as \"chemo lite\" by some with I believe fewer side effects and for some no hair loss.  There is a huge thread on here and many ladies with a lot of knowledge about it. It may be worth a read for you if your Oncotype returns a higher result than you'd like. It did help in my decision making although it wasn't easy.   Here is the link should you want it.  http://community.breastcancer.org/forum/6/topic/24... Good luck for a low result.  Lilly. ",
      "MessageIndex": 145,
      "PostDate": "12/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "Lillypoppy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193044/profile",
      "Content": "Jan 13, 2014 02:15AM Lillypoppy wrote: Dear NNN I am so sorry if I scared you. It wasn't meant to. Just wanted to share that we understand your fears and that the waiting is horrendous.  I echo everything WW said. I am 42 and this was an influencing factor for me. Like WW said the Oncotype is just another piece of information in the whole picture. It's such a hard time waiting. Lilly x",
      "MessageIndex": 149,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "Lillypoppy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193044/profile",
      "Content": "Dec 15, 2013 04:23PM Lillypoppy wrote: 41",
      "MessageIndex": 160,
      "PostDate": "15/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    }
  ]
}