{
  "AuthorID": "Lillyana",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/257738/profile",
  "Posts": [
    {
      "AuthorID": "Lillyana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/257738/profile",
      "Content": "Lillyana wrote: hello- I posted on here a very short time ago... Over the last two months I have had increasing breast pain the feels burning, stinging and sharp. It is in the upper outer area of my right breast with some underarm discomfort. I have had a few test so far including ultrasound that came back normal. I had a sore shoulder and test for that also came back normal! My doc said that the sore breast is more nodular but felt normal just \"bumpy\" so after everything I have no particular red flags for breast cancer yet just this really persistent pain! That is there every day. My step is a breast specialist. The only thing that is starting to make sense is fibrocystic breast changes. I have pain and bumpiness. Can any lady's shares any storys of similar pain that equals this? I'm so worried and it starting to effect my daily life. I have a small child and all I keep thinking about is that there is something wrong and I'm going leave her behind :( Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858017",
      "Title": "Very bad breast pain- does this sound like fibrocystic changes? Lillyana MTwoman"
    },
    {
      "AuthorID": "Lillyana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/257738/profile",
      "Content": "Aug 18, 2017 10:24AM - edited Aug 18, 2017 10:32AM by Lillyana well this is actually a new question and after a week down the track things have changed and I added some of my old information. Thought this a supportive site not a place full of forum police. So did not need criticism on the rights and wrong of posting. I am very new here! All I was looking for was some supportive advice. So upset",
      "MessageIndex": 3,
      "PostDate": "18/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858017",
      "Title": "Very bad breast pain- does this sound like fibrocystic changes? Lillyana MTwoman"
    },
    {
      "AuthorID": "Lillyana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/257738/profile",
      "Content": "Oct 18, 2017 05:34PM Lillyana wrote:",
      "MessageIndex": 5,
      "PostDate": "18/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859494",
      "Title": "Communicating to family members ysi Lillyana"
    }
  ]
}