{
  "AuthorID": "lillysmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83102/profile",
  "Posts": [
    {
      "AuthorID": "lillysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83102/profile",
      "Content": "May 4, 2009 11:07PM lillysmom wrote: Had repeated UTI's - on Doxil monthly and Zometa every 2 months.  After two years, spiked a fever of 105 and found myself hospitalized.  A urine culture and a blood culture were done, and the bug \"Citrobacter freundii\" was found, targeted and exterminated.  With that bug went my chronic intestinal discomfort and the recurrent UTI's.  Suspect the bug lurked for 2-3 years before making it's spotlight appearance.  Just some thoughts.....  Nancy in MN",
      "MessageIndex": 42,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733216",
      "Title": "UTI? KellyC lillysmom"
    },
    {
      "AuthorID": "lillysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83102/profile",
      "Content": "Aug 17, 2009 11:08AM lillysmom wrote: Heidi - you have been on my heart steadily since the original post about the brain mets.    Attitude counts for sooooo much, and my bet is on you in that corner!  A thought to tuck away for rough times:  hard as it is to remember, for me anyway, God loves your children even more than you do.  (Not sure if that applies to grandchildren - -)  Peace and wonderful healing to you and all who love you.  Nancy in MN",
      "MessageIndex": 108,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "lillysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83102/profile",
      "Content": "Sep 28, 2009 11:02AM lillysmom wrote: It's impossible to comprehend the short time between Heidi's original post and the peaceful coma in which Heidi now rests.  My prayers are with all of you, Heidi's family and friends, several times daily.  She will continue to live in all of you and in all of us.  Bless you all!",
      "MessageIndex": 695,
      "PostDate": "28/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "lillysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83102/profile",
      "Content": "May 4, 2009 10:43PM lillysmom wrote: 60 years old, Stage IV from get-go.  Now 64, living good quality thanks to a good doc and a gentle monthly chemo. ",
      "MessageIndex": 220,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "lillysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83102/profile",
      "Content": "May 4, 2009 10:54PM lillysmom wrote: Hi Analemma - about 2 years ago my platelet count began dropping like a concrete block and it was necessary to get blood tranfusions to simply get out of bed.  After a bone marrow biopsy and a spinal tap (another suspicion) it was clear that I had mets to the bone marrow.  BTW, both tests were surprisingly painless.  We began a course of Taxol and it didn't do much for the problem, plus caused nasty side effects.  Instead, we switched to a somewhat questionable (50% rate of resolution) treatment called Doxil ( I think it's doxorubicin) and it has been a miracle drug for me.  Platelet counts normally run between 150,000 - 450,000.  Mine had dropped as far as 30,000 when we changed treatments.  Today they were at 364,000, where they've been for over a year.  I DO have bone mets, but they have not needed to be dealt with yet, and they are very different from the bone marrow. Hope this isn't too much info, but it's what I've experienced, therefore it's what I know.\\ Nancy in MN",
      "MessageIndex": 11,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733568",
      "Title": "Bone mets vs. bone marrow infiltration Analemma Analemma"
    },
    {
      "AuthorID": "lillysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83102/profile",
      "Content": "Dec 21, 2009 10:05PM lillysmom wrote: Hi all - is there any further wisdom on this subject?  I just started taking it last week and all I have heard is the weight gain side effect.  I don't think I'm taking it to \"cure\" the Stage IV metastasized to bones, bone marrow and now liver.  Have been on a variety of chemo treatments for 4 1/2 years, and we're planning a 3-month break in chemo to allow the body to try and heal itself before the cancer discovers we're not hurling poisons at it.  I'd just like to know what others' experiences have been.  Thanks!",
      "MessageIndex": 9,
      "PostDate": "21/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729202",
      "Title": "Megace anyone? Anyone? katie11 lillysmom"
    },
    {
      "AuthorID": "lillysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83102/profile",
      "Content": "May 21, 2009 10:33PM lillysmom wrote: Zometa monthly for 3 1/2 years, every other month for last 6 months.  Haven't noticed any difference between the two dosages.  Also haven't dared have any teeth extracted! Nancy in MN",
      "MessageIndex": 7,
      "PostDate": "21/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734510",
      "Title": "How often do you get Zometa infusion? meima-Bev marieibrahim"
    },
    {
      "AuthorID": "lillysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83102/profile",
      "Content": "Apr 30, 2009 06:10PM lillysmom wrote: I'm new here, and was moved by your 2-year diagnosis of stage 4 BC.  I was diagnosed 4 yrs. ago with stage 4 and haven't met very many with this diagnosis.  Regarding the exhaustion, I agree with the \"diagnosis\" of 5 kids being a primary contributor, and congratulate you on the extraordinary amount of mental energy you must have!!  Also, though, is your doc monitoring your hemoglobin and your platelet count?  When I reached the point of needing transfusions just to function, we discovered that the cancer had moved into the bone marrow.  2 years of a gentle chemo have resolved that nicely.",
      "MessageIndex": 10,
      "PostDate": "30/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733405",
      "Title": "tired, tired, tired motherof5 MJLToday"
    },
    {
      "AuthorID": "lillysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83102/profile",
      "Content": "May 21, 2009 08:23PM lillysmom wrote: My platelets made it down to 30,000 before we began utilizing transfusions as treatment.  They helped, but only temporarily.  A bone marrow biopsy, not as scary as it sounds, diagnosed the BC mets to the bone marrow.  My current chemo, Doxil has brought the platelet counts to normal, where they have remained for 16 months.  Our \"Normal\" is 150,000 - 450,000.  Seems like there is some variety in that definition.  When platelets were lowest, I had no energy at all and was constantly bruised all over, particularly in the thighs, knees and arms.  And my info agrees with the others who say there is no dietary or supplemental way to help the situation.  Nancy in MN",
      "MessageIndex": 6,
      "PostDate": "21/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734549",
      "Title": "Question about Platelet count pattih roseg"
    },
    {
      "AuthorID": "lillysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83102/profile",
      "Content": "Sep 3, 2009 09:38PM lillysmom wrote: Kirby - I was diagnosed at stage 4, so can't identify with the \"thought it was gone\" shock.  I CAN tell you, though, that it's been 4 1/2 years with mets to bone, bone marrow and now liver, plus pleural effusions, and I still work, travel, garden and love my family.  Currently on CMF for about 4 months and it is truly kicking the liver mets!  So much research, so many new treatments (CMF is older, but there are lots of new ones) - have hope!  And know the discouragement isn't a permanent side effect.  Women here are wonderful.  Wish you all the best!! Nancy",
      "MessageIndex": 17,
      "PostDate": "03/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739789",
      "Title": "Am I Stage IV now? kirby happytobealive"
    }
  ]
}