{
  "AuthorID": "Lilleeob",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260494/profile",
  "Posts": [
    {
      "AuthorID": "Lilleeob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260494/profile",
      "Content": "Lilleeob wrote: anyone have any experience similar to this? I found my lump out of nowhere, seemingly overnight.. in the shower. This was three weeks ago.About two weeks or so before that, I have severe tingling in my last two fingers but it kind of went away for the most part. (Although, if I focus on it I can still feel it a bit). Feels although it could be easily aggravated, for example I did a shoulder work out and experienced the tingling again, luckily I'm aware and stopped immediately. It went back down again thank god. My blood work all came back normal. Awaiting ultrasound and mammogram and CT scan. My lump feels like a band or tendony type thing rather than a circle, one edge can be felt very clearly and it's rigid, while the other edge kind of just fades away towards my nipple area, it's about 1.5 cm maybe? Hard to say due to irregular shape and can not be pinched between my fingers, it's quite hard, and the NP said it was moveable (whatever that means). Also experience pain in chest/breast bone and shoulder blade upon deep breathing. Other than that, I have no pain. I should add, my breasts look normal. They feel normal and I would think the lump was gone if well, I couldn't feel it with my fingers. May be worth mentioning sometimes the lump feels itchy inside. My skin has no visible symptoms. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858997",
      "Title": "Found a lump, it's painless, tingling down arm to fingers Lilleeob Grammy2be"
    },
    {
      "AuthorID": "Lilleeob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260494/profile",
      "Content": "Sep 30, 2017 05:45AM Lilleeob wrote: I'm awaiting tests, ultrasound and mammogram on October 28. There's not much I can do in the mean time but wonder. Just wanted to hear other people's experience who may have been in a similar situation. I was not trying to diagnose myself. Thank you for the response.",
      "MessageIndex": 3,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858997",
      "Title": "Found a lump, it's painless, tingling down arm to fingers Lilleeob Grammy2be"
    },
    {
      "AuthorID": "Lilleeob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260494/profile",
      "Content": "Lilleeob wrote: Well it was finally done today. How did yours go? Mine was loud, and the dye kind of hurt. My arm got super sore from being at my side for so long. And the ladies didn’t tell me anything, just to call my dr in like two weeks for the results. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860513",
      "Title": "Had breast mri Lilleeob Arsen01"
    },
    {
      "AuthorID": "Lilleeob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260494/profile",
      "Content": "Nov 29, 2017 11:18PM Lilleeob wrote: lucky. I felt totally lost in there but not only that, they said they would tell me when they put the dye into me. Then shoved me down the rabbit hole lol, so I was laying there wondering if their mic was broke, for like fifteen minutes and wondering if the dye was in me or yet. There was very little guidance or telling me what they were doing. I wasn’t not even asked to talk or breathe in or out. It wasn’t at all as I was expecting, but I was really hoping for an answer today",
      "MessageIndex": 3,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860513",
      "Title": "Had breast mri Lilleeob Arsen01"
    }
  ]
}