{
  "AuthorID": "lilsiskathy…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186269/profile",
  "Posts": [
    {
      "AuthorID": "lilsiskathy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186269/profile",
      "Content": "lilsiskathy wrote: I have read many things that say asites is a sign that the end is coming.  Does anyone know if this is true? Dx 3/2009, DCIS, 3cm, Stage IV, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809530",
      "Title": "Ascites--- Is it a sign of liver failure? lilsiskathy Tina72"
    },
    {
      "AuthorID": "lilsiskathy…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186269/profile",
      "Content": "Aug 21, 2013 11:32PM lilsiskathy wrote:  Chicky, I am kind of in your situation, I've been told I have one more drug to try and that's it.  I too don't want to be miserable in the end.  I want to be able to function as much as possible and at least feel good for a little while.  I have already told my family, and my onco, she said she would tell me when we were done, and I trust her.  My family would like me to stay hooked up to a needle the rest of my life, but they have all said they get it, that they are not the ones going thru all this, and that they will stand behind me no matter what.  It's frustrating and scarey, but at the same time I don't want to keep doing this, I'm tired and so is my body.",
      "MessageIndex": 8,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809693",
      "Title": "How do they decide? Chickadee jlmacy"
    },
    {
      "AuthorID": "lilsiskathy…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186269/profile",
      "Content": "Aug 18, 2013 09:20PM lilsiskathy wrote: I'm new to this site, but I was on zeloda.  I couldn't take the side effects.  I got really sick and could hardly walk, and it didn't shrink my tumors.  However I know everyone is different, I have read a lot of post here, and other sites, where it worked wonders.  I have had liver pain from the beginning.  I've had bc with liver mets for almost 5 yrs and have not been in remmission yet.  I am currently on afinitor.  I'm just getting tired of nothing working for me.  That doesn't mean it won't for you, even the side effects are different for everyone.  Damn cancer!  Got to hand it to it, it is smart.  Well good luck to you.",
      "MessageIndex": 18,
      "PostDate": "18/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lilsiskathy…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186269/profile",
      "Content": "Aug 21, 2013 11:37PM lilsiskathy wrote: Spam I was on Zeloda too, I had the same problems, I hated it, and waited for my onco to take me off.  I was so sick, I didn't want to keep doing this, I was ready to die then, I told her I would never be on that again.  I too was glad it failed.  Isn't it funny the thing you hate is supposed to save you?",
      "MessageIndex": 9,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809693",
      "Title": "How do they decide? Chickadee jlmacy"
    }
  ]
}