{
  "AuthorID": "Lils23",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211577/profile",
  "Posts": [
    {
      "AuthorID": "Lils23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211577/profile",
      "Content": "Feb 19, 2015 12:27AM Lils23 wrote: Thank you for your replies!  I've just finished with the Doctor (second one this week, plus 2 nurses) who was pretty confident that it is just something going on with the skin... He saw how worried I was about it and said that if in 2 weeks of using my cream, there is no change, then to come back and he would refer me to the breast clinic. At this point I started crying (bloody hell haha) and he said although he didn't think there was a clinical need to refer me, he would refer me to the breast clinic so as to reassure me... So I'll be going for a mammogram hopefully within 2 weeks (can't be sooner as it is a non urgent federal) and although I understand that IBC won't show up on a mammogram, I'm hoping that the peoplr at the breast clinic will spot if there is a problem and request a biopsy... Can that happen?  Lily",
      "MessageIndex": 3,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828644",
      "Title": "\"Dr Google\" - not my best idea Lils23 Lils23"
    },
    {
      "AuthorID": "Lils23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211577/profile",
      "Content": "Feb 20, 2015 10:42AM Lils23 wrote: oh god, my anxiety is THROUGH THE ROOF. I'm really not coping well and I don't know what to do. My partner doesn't cope with my anxiety well either. I just feel helpless :( I literally feel like I'm about to be handed a desth sentance after reading the statistics I feel there isn't any chance for me.  The redness is fading and is looking more like a bruise. Surely a fungal infection etx wouldn't fade to a bruise :",
      "MessageIndex": 7,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828644",
      "Title": "\"Dr Google\" - not my best idea Lils23 Lils23"
    },
    {
      "AuthorID": "Lils23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211577/profile",
      "Content": "Feb 23, 2015 03:07AM Lils23 wrote: Thank you for those great words. I should take a leaf out of your book!  This anxiety is driving everyone mad... I feel bad talking to my parents about it as my Mum actually did have breast cancer at about 37 (she recovered) and my girlfriend is threatening to break up with me if I don't get it sorted... I have an appointment with a psychologist and will be starting CBT so I'm hopeful that will help the anxiety side of this!  It's been almost 2 weeks since I first saw this red patch. I have been using the cream since I was given it and 2 doctors have said it doesn't look like IBC... Anyway it doesn't seem to have got better at all! To me that is... My parents and girlfriend say it is looking less red... Would IBC have gotten worse over the 2 weeks?  Lily",
      "MessageIndex": 11,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828644",
      "Title": "\"Dr Google\" - not my best idea Lils23 Lils23"
    },
    {
      "AuthorID": "Lils23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211577/profile",
      "Content": "Lils23 wrote: Hello everyone! I've been avoiding posting on here for the past week, but I've worked myself in to such a state that I feel physically ill :/ I'm not going to ask anyone to \"diagnose\" me, opinions are welcome but I'm well aware that nobody can say yes or no. Last Wednesday night, I'd just got out of the shower and I looked in the mirror and noticed a red patch of skin on my left Breast just to the left of the nipple and down underneath (on the Breast skin). Immediately I googled red patch on breast and the ONLY thing that comes up is Inflammatory Breast Cancer. The next morning I called the doctors and was given an appointment with a nurse, who didn't seem worried at all and gave me hydrocortisone. It didn't help over 5 days, and so I managed to get in to see a Doctor this time on Tuesday. She examined my breast, noted the red patch with a slightly dry top to it (it feels dry when touched and there are tiny scaly bits if you look closely). There appeared to be no swelling, no peau d'orange, no excess warmth or anything apart from the red patch. Anyway, she gave me a stronger topical steroid suggesting that it could be a fungal infection but I really don't believe her :/ Yesterday I was looking at it and although not to the eye, the skin of the red patch was harder to pull up with fingers than the same place on the other breast! So I called the surgery and a doctor called back and I'll be seeing him at 8am! A big issue is that I'm absolutley convinced this will turn out to be IBC, and what makes this worse is that I suffer from Health Anxiety. Therefore I have fixated on this potential outcome and I feel a sense of absolute dread. I keep crying, I can't eat, I feel sick and irritable and constantly check my breast (pull it round to look, proding my arm pits etc and I'm pretty sure that is making it feel worse :( After 8 days there doesn't seem to be any big changes, neither better or worse. But last night when I got in to bed, I'm sure I felt stabbing pains in my nipple and tenderness under my arm... I feel helpless and my anxiety is off the scale. My mother had breast Cancer as did my great aunt and I'm 24. Thank you all for taking he time to read this! Lily x Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828644",
      "Title": "\"Dr Google\" - not my best idea Lils23 Lils23"
    },
    {
      "AuthorID": "Lils23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211577/profile",
      "Content": "Feb 20, 2015 12:50PM Lils23 wrote: That would be much appreciated. I'm in the UK so it's 9pm here!  Hope it goes ok!",
      "MessageIndex": 9,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828644",
      "Title": "\"Dr Google\" - not my best idea Lils23 Lils23"
    },
    {
      "AuthorID": "Lils23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211577/profile",
      "Content": "Lils23 wrote: Hi everyone, I posted back in February when I first noticed a red patch just below my nipple on my left breast. I saw a nurse, then a doctor, both of whom gave me anti fungal steroids. After no change, I saw a bother Doctor who only referred me to the breast clinic when he saw how worried I was about the red patch. The breast specialist had a look and said absolutely no way is it anything - he couldn't see the area without me pointing it out to him. Moving on to now - the patch looks like slightly pigmented round dots, flat with no scaling, little redness if any at all, and has not got any bigger/more prominent. I have no pain, no discharge. My nipple is as it always is (has not inverted) and my breast isn't warm to the touch or swollen. What would your next steps be? I have been told if it was IBC, after 10 months there would certainly have been a change. Lily x Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/838862",
      "Title": "I'm back again Lils23 bride"
    },
    {
      "AuthorID": "Lils23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211577/profile",
      "Content": "Dec 22, 2015 12:48PM Lils23 wrote: I think I'll try to get an appointment for a dermatologist. When I last saw the doctor, he wasn't even sure where I was asking him to look. Very weird, it is extremely obvious to me, but not to anyone else. It doesn't even feel like a different texture to the rest of the skin",
      "MessageIndex": 3,
      "PostDate": "22/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/838862",
      "Title": "I'm back again Lils23 bride"
    },
    {
      "AuthorID": "Lils23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211577/profile",
      "Content": "Dec 22, 2015 11:04PM Lils23 wrote: Thank you for your responses! Are you all thinking that is isn't likely to be IBC then? Because of the fact that there has been no change over 10 months (perhaps even longer than 10 months as I only noticed it in Feb, it may have been there longer)",
      "MessageIndex": 5,
      "PostDate": "22/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/838862",
      "Title": "I'm back again Lils23 bride"
    },
    {
      "AuthorID": "Lils23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211577/profile",
      "Content": "Dec 27, 2015 12:25PM Lils23 wrote: I will have to wait till Tuesday to try to get an appointment with a dermatologist, but in the mean time, I have bought some anti fungal shampoo from the pharmacy that I have seen suggested on a dermatology website. Can't hurt, right! It does not even look like a rash anymore, more like a patch that is a different colour with some pigmented parts... Odd! I really appreciate you all responding to me. Lily55, believe me, I am in no way wishing breast cancer on myself. I am worried about something that is a very scary prospect, made a little worse by the fact that I have been 'brushed off' a few times from medical professionals, as well as the fact that it has not resolved after 10 months... I just cannot find any information on whether or not my symptoms would have worsened over 10 months if it is IBC. I know that the disease spreads quickly, but am unsure if this spread would show up by with worsening visual breast symptoms.  Lily",
      "MessageIndex": 11,
      "PostDate": "27/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/838862",
      "Title": "I'm back again Lils23 bride"
    },
    {
      "AuthorID": "Lils23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211577/profile",
      "Content": "Dec 27, 2015 03:56AM Lils23 wrote: I did think that - but could it just remain the same with no change if it was IBC?  I've returned to the doctors and he said there was nothing to see, I had to show him the area... Nobody will send me for a biopsy and if it is IBC then it's over 10 months since I've noticed the symptoms, and because it's been so long, surely it will have spread.  I feel so helpless because nobody is helping me, the doctors just say it's a fungal infection and the discolouration is a result of that",
      "MessageIndex": 7,
      "PostDate": "27/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/838862",
      "Title": "I'm back again Lils23 bride"
    }
  ]
}