{
  "AuthorID": "lilybean717…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73007/profile",
  "Posts": [
    {
      "AuthorID": "lilybean717",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73007/profile",
      "Content": "lilybean717 wrote: today is my bilat and sono. I'm so nervous about this. Just had to post b/c i'm freaking out a little. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/722822",
      "Title": "a ball of nerves lilybean717 Shirlann"
    },
    {
      "AuthorID": "lilybean717",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73007/profile",
      "Content": "lilybean717 wrote: Hi, I'm new here. I just turned 24. When I was 23 and 3-4 months pregnant with my daughter (2nd child) my midwife found a lump in my breast. After a sonogram, they determined it was a 1.5\" in diameter dense tumor and we did a core needle biopsy (2 samples were taken that day, from the sameish area). The report I received back stated the biopsies returned as \"possibly benign\"  and I was told to return after my daughter was born for a mammogram. When I went back, I was told that they could not do a mammogram b/c I was nursing, and they could not get a clear image. I was told to return after I was done nursing. I finished nursing my daughter when she was 5 months old, she is now 8 months old. In the months following her birth, my husband nearly lost his job and had to find a replacement job quickly with very few options. He went with a company that offered to pay 1/2 of our insurance costs, but once he started, we found out they \"meant\" 1/2 of HIS insurance costs, and myself and our 2 children were SOL. So I had a period without insurance. We applied for Aetna insurance, and were denied as they said I was uninsurable (even though they knew I'd had a clear biopsy). I'm due to go back to the dr, and I have a place here where I can get the mammogram done for about $110.00. Problem is I'm afraid to go because I'm worried that if it comes back as cancer, I'll never be able to get medical or life insurance again. Should I try to get those things lined up before hand? I mean, if it's necessary I can figure it out, but if it's not, I'd rather not b/c as it is, my husband is about to lose this job too (he's in the construction business, so he's in a really bad job with the economy right now) and we are barely scraping by on the income we have.... and come to think, up until 4 days before my daughter was born, we were financially stable :sigh:. This year has sucked, man.   Another quesiton I had is that someone told me that cancerous tumors are never painful... is that correct? B/c I have a lot of dull aches in that breast, between the tumor and my ribs, and it's very uncomfortable, and I didn't know if that's a \"good\" sign, or not. Thanks for any help you can provide. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/722211",
      "Title": "give me your input and experience lilybean717 whoopsiedoodles"
    },
    {
      "AuthorID": "lilybean717…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73007/profile",
      "Content": "Oct 14, 2008 01:57PM lilybean717 wrote: okay, i've got my bilat and sono scheduled for wed and 1:30. Keep us in your thoughts please :)",
      "MessageIndex": 3,
      "PostDate": "14/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/722211",
      "Title": "give me your input and experience lilybean717 whoopsiedoodles"
    }
  ]
}