{
  "AuthorID": "Lindy58",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74911/profile",
  "Posts": [
    {
      "AuthorID": "Lindy58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74911/profile",
      "Content": "Feb 11, 2009 11:58PM - edited Feb 11, 2009 11:58PM by Lindy58 Hi Everyone, I go for my simulation on the 19th and then i am not sure exactly when the rads. start. I think I go for a dry run and then two days later the real ones begin :)  Another step on the journey ! I finished chem 4x AC on 1/21/09.  I am still feeling extremely tired.  My hubby is a great support and  my family and friends are great.  I have lots to be thankful for can't quite figure why I am so depressed on and off. Also I am having wild hot flashes LOL!  Oh well and life goes on :) Great to be here and thanks for thread, it seems to make things much easier! Linda PS  I go for 6 weeks 5 days a week :)",
      "MessageIndex": 153,
      "PostDate": "11/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lindy58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74911/profile",
      "Content": "Feb 19, 2009 01:17PM Lindy58 wrote: Hi Ladies, Just catching up since I haven't been around lately, really tired still effects from Chemo.  I also am worried over every little ache and pain (but I talk myself down LOL)  I wonder if this is a side effect from Chemo.   I go for my simulation tomorrow at 10, am alittle worried about the pain  of holding your arms above your head.... so I guess I am in for a treat tomorrow.  I will touch base and let you know how it went.  I have 33 tx over 6 weeks so I guess I am at the starting line :)   I will keep you all in my prayers: Linda",
      "MessageIndex": 300,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    }
  ]
}