{
  "AuthorID": "Lindzanne",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231789/profile",
  "Posts": [
    {
      "AuthorID": "Lindzanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231789/profile",
      "Content": "Lindzanne wrote: Hi. I got the phone call yesterday that the biopsies I had last week were positive for BC. I still know little. I have a positive node and the lump they tested was positive. They said it's Infiltrating Ductal Carcinoma, grade II, HER2 negativite, ER+ & PR+. I still don't really understand what that means even though I am taking good notes and all the staff I've spoken with patiently explain everything and tell me that it's very likely I will survive this and thrive. I have an appointment with the surgeon in 2 days. I felt an odd peace after the terrible anxiety of waiting, and today I almost felt normal all day. Now, at night, while my incredibly supportive husband sleeps, my mind races with all the worst fears. That it's all over my body because of the positive node, the sadness of maybe leaving everyone I love, I feel selfish knowing that there are many that probably have it worse than me, I feel terrible like I am causing all these people I love so much so much fear and pain. I know that's ridiculous, but I suppose this brings out a whole range of feelings. There were changes in my breast for several months, but I thought nothing of it bc it came and went with my cycle, until I realized there was an actual lump and went to my PCP after my husband felt it and said, that's not right. It was soft, it moved around, it was smooth to the point my PCP referred me to the breast clinic saying, \"I'm 90% sure it's nothing, if feels like every benign lump I've ever felt.\" But thankfully I took her advice and went for the referall and this roller coaster began. I feel so stupid I didn't go see her about the changes sooner. I would say 80% of my day I felt calm, positive, grateful, supported, and like each day at a time is what we get and it's a gift. Now, I feel alone, terrified, confused, angry, selfish.......so many things. I will be 36 in a weekk, and finding it hard to look forward. I've been reading these boards the last few days and see so much hope and support. I just needed to put my feelings out somewhere, a place where people might understand. It's also an odd feeling---if I post this, it's another thing saying, this is really happening. That's all. I send love, peace, and support to everyone else on here too. This seems like a great place. Whoever reads this, thanks for listening. Dx 4/18/2016, IDC, Left, 3cm, Stage IIIC, Grade 2, 28/28 nodes, ER+/PR+, HER2- Surgery 6/2/2016 Lumpectomy: Left; Lymph node removal: Left Chemotherapy 7/1/2016 AC + T (Taxol) Radiation Therapy 12/27/2016 Whole-breast: Breast, Lymph nodes, Chest wall Hormonal Therapy 2/8/2017 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/843601",
      "Title": "Yesterday everything changed Lindzanne ryland19"
    },
    {
      "AuthorID": "Lindzanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231789/profile",
      "Content": "Apr 24, 2016 03:04AM Lindzanne wrote: Karenna16, thank you so much for your kind words and thoughts. I really needed to read them just now. I am so sorry about your sister's diagnosis. It sounds like you will be an amazing support for her--my sister is too but it also hurts me to see her hurting for my sake. The support of family means everything. Thank you so much for taking the time to respond to me.",
      "MessageIndex": 11,
      "PostDate": "24/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/843601",
      "Title": "Yesterday everything changed Lindzanne ryland19"
    },
    {
      "AuthorID": "Lindzanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231789/profile",
      "Content": "Apr 20, 2016 11:48AM Lindzanne wrote: Wow, I am blown away by all of your responses. Thank you so much for your kind words, advice, and clarifications on some things. Kicks, I believe I am seeing a breast surgeon. I spoke with my coordinating nurse who was amazing and who apparently is an advocate just for me to make sure my team does what they are supposed to do for me and she made it sound like he was---but I will find out tomorrow I guess! My husband will be there and does not mess around when it comes to asking quiestions, documents, etc. I'm shyer and of course in a daze! But I write EVERYTHING down even if it means I have to go through my scribbled notes to ask what they mean later! Every single one of you have made me feel better. How amazing that you don't know me but came right through with advice and support. I was going to say you have no idea what it means to me-----but given where we all are, you probably do!!!! Thank you!",
      "MessageIndex": 7,
      "PostDate": "20/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/843601",
      "Title": "Yesterday everything changed Lindzanne ryland19"
    },
    {
      "AuthorID": "Lindzanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231789/profile",
      "Content": "May 3, 2016 07:58PM Lindzanne wrote: This is tough. It can feel very exposing to have everyone, even family know. For me, I chose to tell all of my family, even cousins I don't particularly like and worried about telling and my husband did tell my in laws. I do know I had to think about how people would feel if I didn't tell them--I weighed that I knew they would feel hurt because they would want the opportunity to show me some love. I didn't put their feelings above my own, but it was something I considered. People will worry when they're far away, but they can still send messages or cards or care packages that can feel very supportive! One thing that has helped me is having my husband and mom tell people (I realize in this situation your husband is the hesitant one) and they express boundaries I may have right now. Like, they let people know texts, emails, cards are OK, but she's overwhelmed and isn't up to phone calls. Or, she's feeling self conscious about this or that, and isn't ready to talk about it. It's exhausting trying to set all those parameters myself. Ultimately, it should be up to you how you would feel most supported, and hopefully you get your husband on board to make that happen.",
      "MessageIndex": 8,
      "PostDate": "03/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/843945",
      "Title": "Newly Diagnosed & Need Advice on Sharing Diagnosis with Family AnaSimone claireinaz"
    },
    {
      "AuthorID": "Lindzanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231789/profile",
      "Content": "Lindzanne wrote: This Post was deleted by Lindzanne. Dx 4/18/2016, IDC, Left, 3cm, Stage IIIC, Grade 2, 28/28 nodes, ER+/PR+, HER2- Surgery 6/2/2016 Lumpectomy: Left; Lymph node removal: Left Chemotherapy 7/1/2016 AC + T (Taxol) Radiation Therapy 12/27/2016 Whole-breast: Breast, Lymph nodes, Chest wall Hormonal Therapy 2/8/2017 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/843600",
      "Title": "Yesterday everything changed Lindzanne Lindzanne"
    },
    {
      "AuthorID": "Lindzanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231789/profile",
      "Content": "Apr 16, 2017 03:29PM Lindzanne wrote: Interesting. I also have been on antidepressents for years and quite frankly think they saved my life. If there was a tiny percentage of a chance they contributed to my bc, I think to myself, I don't care. My quality of life greatly improved. As you say, a cost benefit analysis. And I don't think I'd have been able to manage my diagnosis and treatment, and now the scary and confusing waters of being a cancer survivor and what that means, without them. As for the interaction with Tamoxifen, yes most anti-depressants do interact negatively with Tamox, but Effexor does not, which I switched to before I started taking Tamox in Feb. I'm grateful to report that it is my favorite antidepressant so far (it's the third type I've tried). And, it helps with some of the side effects of Tamoxifen like hot flashes. It would be interesting to me to know more about how some of the REASONS people take antidepressants contribute to bc or other diseases--of course we have heard how stress may play a factor. I have experienced significant trauma and stress throughout most of my life and often think about how it may have contributed to my developing bc.",
      "MessageIndex": 3,
      "PostDate": "16/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/853090",
      "Title": "anti depressants and breast cancer kathleen1966 SSInUK"
    },
    {
      "AuthorID": "Lindzanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231789/profile",
      "Content": "Jul 10, 2016 04:18PM - edited Jul 10, 2016 04:19PM by Lindzanne I just want to say how amazingly helpful this list was in getting me through my first round of chemo. I used it well before my first infusion because it gave me something to do and a sense of control and preparation and it was SO HELPFUL to have all my supplies all lined up the day I got home. I've bounced back quite a bit but did not tolerate the AC as well as some those first 5 days and so many things on this list got me through it and I'm sure will continuse to. So, for anyone that needs help finding out what to get or something to do to get their mind occupied and gain some control, THIS IS the list and thread. Many many thanks to all who have contributed to it. Lindsay",
      "MessageIndex": 1776,
      "PostDate": "10/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "Lindzanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231789/profile",
      "Content": "Jun 23, 2016 04:48PM Lindzanne wrote: I hope your bone scan turned out ok. I had one this week too and they did similar things to me. One of the techs said, while you're here and we have the dye in you we're going to get some bonus shots, and of course I thought, of what??!! I could have sworn they were looking at me with pity as I left but I got the call the next day that it was all clear. You're right, no one can tell you but your doctor, but I hope it helps to hear that someone had a similar experience and I was reading so much into every little thing and it turned out ok. Good luck and hugs. Scans are the worst.",
      "MessageIndex": 1,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/845326",
      "Title": "Bone scan Mom2fourplusmore nye1980"
    },
    {
      "AuthorID": "Lindzanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231789/profile",
      "Content": "Jun 24, 2016 05:30PM Lindzanne wrote: My onco ordered one, because of how many lymph nodes I ended up having. She said if it's just a few involved, like 3 or 4, she doesn't usually order one, but when there's a lot of nodes involved she does one just in case, although she said it's still only a 10 to 15% chance it's spread. Before my surgery, we thought it was only 3 nodes involved, and she said then it was a 1 to 2 % chance of spread and wouldn't have ordered the CT and bone scan. It looks like you have no nodes involved and maybe that's why you don't have one ordered? I have heard from many people they don't always do these full scans unless you have certain risk factors (like a lot of nodes) or are symptomatic of mets but have also heard a few people say they got all the scans possible even at early stages. I don't know if this helps. If you got all this info before surgery it could have all changed based on the pathology of your surgery, I know my plan did. Can you call your onco or one of their nurses and clarify?",
      "MessageIndex": 1,
      "PostDate": "24/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/845409",
      "Title": "CT Scan of chest, abdomen and pelvis boricua_63 MelanieBC"
    }
  ]
}