{
  "AuthorID": "lindsay_a07…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251257/profile",
  "Posts": [
    {
      "AuthorID": "lindsay_a07…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251257/profile",
      "Content": "Sep 1, 2018 01:38PM lindsay_a07 wrote: Thank you all for the responses! I really appreciate it. I have been on the Brain Mets Sisters board, but was just looking for those with HER2+ receptors who have had a similar experience. I know my oncologist mentioned switching to Xeloda, but we decided to stay with the HP since it has been so effective below the neck. Thanks! : )",
      "MessageIndex": 4,
      "PostDate": "01/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/866951",
      "Title": "HER-2+ with Brain Mets lindsay_a07 hhfp"
    },
    {
      "AuthorID": "lindsay_a07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251257/profile",
      "Content": "lindsay_a07 wrote: Hello Ladies,I was originally diagnosed with Stage IV (HER-2+++) in November 2016. Multiple lesions to the liver at that time. I had 7 rounds of chemo and have been on Herceptin/Perjeta every 3 weeks since then and thankfully NED! However, my routine PET scan at the end of July showed some activity on my brain which led to us finding a 2x4cm tumor on my left cerebellum. I had a Craniotomy to successfully remove the tumor on August 9. I am preparing for 3-5 SRS radiation treatments to the resection bed. Does anyone have experience with this? What was is like for you? Any noticeable side effects and was it successful? Also, did brain Mets change your treatment course from H/P to something else? Thanks in advance for any responses! :) Dx 11/11/2016, IDC, Right, Stage IV, metastasized to liver, Grade 3, ER-/PR-, HER2+ (FISH) Targeted Therapy Herceptin (trastuzumab) Chemotherapy AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/866951",
      "Title": "HER-2+ with Brain Mets lindsay_a07 hhfp"
    }
  ]
}