{
  "AuthorID": "lindaa",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105914/profile",
  "Posts": [
    {
      "AuthorID": "lindaa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105914/profile",
      "Content": "Jan 21, 2011 09:32AM lindaa wrote: I am shocked and saddened.  I had been posting on her other thread, and knew she was ready for hospice, but I somehow thought there would be more time.  I went to go post and saw her husbands message.  This just sucks!  I also just lost someone in town.  She wasn't on these boards, but she leaves a husband and 2 teenage daughters behind because of BC.  My own chemo is not working for me, so this week just ends badly.  I can only offer my condolances to her family and others on this board who will miss her. ",
      "MessageIndex": 97,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763574",
      "Title": "Bopeep is an angel Leah_S"
    },
    {
      "AuthorID": "lindaa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105914/profile",
      "Content": "Nov 3, 2010 09:33PM lindaa wrote: for susan_02143 Where are you being treated?  I am looking for a second opinion in the RI, MA, CT area.  I know someone who got treated at Wellesly and is very happy, another (ovarian) at Leahy clinic and likes it there, someone who complained about Dana Farber being too big and they felt like number and didn't offer anything that wasn't being offered elsewhere, and yet another at mass gen who I feel didn't get the best care in the beginning (her disease progressed undetected until she was stage 4, even though spots were on scans?  I don't know all of the exact details but that's the gist of it.  There are a lot of options on the east coast but I am trying to find someone who specializes in triple neg.  There are a lot of opotions on the east coast, but i think the best way to find a really good onc is by word of mouth.  I like my onc, and my tumor team, but I want to make sure they are being as agressive as possible (I go to woman and infants)  thanks in advance.",
      "MessageIndex": 26,
      "PostDate": "03/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760007",
      "Title": "stage IV \"discrimination\"? jenny66 lindaa"
    },
    {
      "AuthorID": "lindaa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105914/profile",
      "Content": "Dec 9, 2010 09:25AM lindaa wrote: I agree with kat,  Please check for inflammatory breast cancer (IBC).  Are you near a breast health center or cancer center?  Ask the question - How much experience do you have with IBC?  There is a thread on here for IBC - but the right doctor won't be puzzled by the symptoms.  There are only a few centers that have departments specifically for IBC (md anderson, fox chase, dana farber, etc) but there are many good treatment centers found everywhere.   I have IBC and no one would believe me on how fast it was growing and kept telling me that 80% of these things are benign. ",
      "MessageIndex": 22,
      "PostDate": "09/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761410",
      "Title": "Can a cancerous tumor grow quickly within a week? Ling29 Ling29"
    },
    {
      "AuthorID": "lindaa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105914/profile",
      "Content": "Mar 17, 2011 04:24PM lindaa wrote: If it comes up again, Smile and say 'I can relate to how you feel, I've almost died a couple of times myself and every time I go tothe hospital,my whole family prays that I come home again.\"  It's not playing the C card, its the truth. ",
      "MessageIndex": 8,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766311",
      "Title": "Really tempted to use the \"C\" card here... KSkier jenn3"
    },
    {
      "AuthorID": "lindaa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105914/profile",
      "Content": "Dec 15, 2010 07:09PM lindaa wrote: So sorry you have to go through this - but you are clearly intelligent and willing to do the research needed.  Its a big kick in the stomache for sure.  It does look like its leaning toward ibc.  So good that the second biopsy was clear.  ibc waits for no one, so immediate chemo is the plan.  The type of chemo will be determined by your ER, PR, and HER2 + or -.  The rush to treatment hardly leaves you time to think.  As for chemo class, I never had one.  just my onc explaining what to expect.  I came here for answers, like you.    As I put in my other post, there are only a few places that have departments just for ibc.  I am not familiar with Stanford, so I can't comment.  Is there another cancer care center near you for a second opinion?  I don't think it will change your chemo so much, as there are usually just a few that they hit it with.  DD A/C followed by taxol, FEC, - are a couple.   i a m on AC right now, and my biggest thing is lots of sleep day 2 and 3 after treatment.  You are younger and probably much fitter than me so that may not happen to you so treatment may not affect your job.  Does this job offer any work from home options?  My best to you.",
      "MessageIndex": 45,
      "PostDate": "15/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761410",
      "Title": "Can a cancerous tumor grow quickly within a week? Ling29 Ling29"
    },
    {
      "AuthorID": "lindaa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105914/profile",
      "Content": "Mar 18, 2011 12:29PM lindaa wrote: Wow!  What a great boss.  I've rarely had the pleasure myself.",
      "MessageIndex": 16,
      "PostDate": "18/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766311",
      "Title": "Really tempted to use the \"C\" card here... KSkier jenn3"
    },
    {
      "AuthorID": "lindaa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105914/profile",
      "Content": "Dec 9, 2010 04:31PM lindaa wrote: I am on other side of country so can't help on where to go.  I do know that most tolerate chemo quite well, they give you plenty of things to counteract side effects.  It depends on the chemo on your body but you will be fine.  It is often scarier than it actually turns out to be.  There are many ppl here to support you.  You will find throughout this site that many, many work through chemo, raise kids, etc with their treatment time their only interruption.",
      "MessageIndex": 27,
      "PostDate": "09/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761410",
      "Title": "Can a cancerous tumor grow quickly within a week? Ling29 Ling29"
    },
    {
      "AuthorID": "lindaa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105914/profile",
      "Content": "Mar 25, 2011 12:28PM lindaa wrote: So sorry Jen, I understand the angst and despair.  I pulled the crappy cancer card myself and am one of those freaks where little works.  I just started a new trial, in hosp now, but it had a 4 week waiting period.  Sure enough this stuff spread like wildfire.  I had plural effusions drained this week for the first time and am going in next week to get the rest.  This disease truly sucks.  My onc just talked me into anti-depressants and I agreed.  I've tried to be strong long enough.  The work thing is a tough choice esp if there is a good life ins policy at risk.  My whole life I had a good job with good benefits, but a year before dx I started teaching in a private school with almost no bens.  Figures! Upside is when I went to collect unemployment they were able use my old salary so my unemp check is actually a little more than teaching check.  So I've been ok there. Trying to keep my mind off it all - hard because I can see mine, I try to watch only funny tv or movies, nothing scary or violent, I try to read encouraging things, I try to meditate, but too often dark thoughts come to me so i don't do that as often as I should.  I play video games and am looking forward to my flowers popping up soon.  I thought I was running out of options but my new trial onc gave me a list of around 10 things she thought would be good for me (trip neg/ibc).  So there are more treatments out there than we are aware of.  Just gotta find that right combo.  For me, if it's my time to go to Jesus then so be it.  I hope I can be strong. Hang in there!",
      "MessageIndex": 16,
      "PostDate": "25/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766614",
      "Title": "I WANT MORE TIME! jenn3 AnewBeginning"
    }
  ]
}