{
  "AuthorID": "Linda37",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82004/profile",
  "Posts": [
    {
      "AuthorID": "Linda37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82004/profile",
      "Content": "Linda37 wrote: Hi, I am currently going through radiation; I have 4 treatments and 6 boosts left to go.  I've gotten pretty red in the crook of my arm and under my arm.  Will that start to heal during the boost treatments or will nothing start to heal until I'm completely done?  My boost will be right in the center of my breast where my nipple was (my tumor was right next to the nipple so they took it during surgery.)  Since the boost won't be near my armpit area, I'm hoping that will start to heal right away. Dx 3/19/2009, IDC, 1cm, Stage II, Grade 2, 1/17 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736428",
      "Title": "How long for skin to heal? Linda37 susan13"
    },
    {
      "AuthorID": "Linda37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82004/profile",
      "Content": "Oct 18, 2009 05:17AM Linda37 wrote: I wore a sports bra 24/7 throughout rads.  I am a 34 DD so I needed the support and the breast with the lumpectomy would hurt without the support.  My skin held up well and the bra didn't seem to bother it at all.  My advice would be to wear a bra if you want to.  It sounds like there are some good bra suggestions in the thread here.",
      "MessageIndex": 12,
      "PostDate": "18/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/742200",
      "Title": "Wearing undershirt instead of bra: but need support linn56 desdemona222b"
    },
    {
      "AuthorID": "Linda37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82004/profile",
      "Content": "Jun 3, 2009 03:41AM Linda37 wrote: Hi, Today I had #6 of 31 radiation treatments and I've been using calendula lotion. It's a little early for me to tell if it's working but my understanding is that the best way to care for your skin is to be proactive.  I use it 3 times per day. It seems to me that every woman is very different and what works for one doesn't necessarily work for another.  But all of the ladies that posted before me are recommending things that I've read a lot about and they all seem to be very helpful to people. Best wishes to you! Linda",
      "MessageIndex": 10,
      "PostDate": "03/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/735054",
      "Title": "Creams/lotions for rads Leah_S desdemona222b"
    },
    {
      "AuthorID": "Linda37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82004/profile",
      "Content": "Linda37 wrote: Hi....I just started radiation yesterday so today was my 2nd treatment.  I go right at 8am and today at about 11:30 I suddenly felt drained of energy.  Not completely zapped, but definitely dragging a bit.  I thought the fatigue wouldn't start until a few weeks into treatment?  Has anyone else had the fatigue kick in right away?  I did not have chemo and my surgery (lumpectomy with auxillary lymph node removal) was 8 weeks ago. Dx 3/19/2009, IDC, 1cm, Stage II, Grade 2, 1/17 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/734864",
      "Title": "Fatigue at the beginning of radiation? Linda37 Mary22"
    },
    {
      "AuthorID": "Linda37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82004/profile",
      "Content": "May 27, 2009 02:43PM Linda37 wrote:",
      "MessageIndex": 3,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/734864",
      "Title": "Fatigue at the beginning of radiation? Linda37 Mary22"
    },
    {
      "AuthorID": "Linda37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82004/profile",
      "Content": "Linda37 wrote: Hi, I had my 3rd radiation treatment today and my skin is a little pink and the nipple area is tender.  I've read a lot about calendula on this board so I bought the ointment and I've used it each day after my treatment.  It doesn't seem to be working as well for me as it has for some others on here.  My question is:  I've seen people talk about calendula ointment, cream and oil but I only saw the ointment in the store.  Is there a difference between them? The nurse told me not to put anything on before treatment that isn't absorbed by the skin so I'm afraid to use the ointment before treatment.  Should I be using the cream? Any help is appreciated! Linda Dx 3/19/2009, IDC, 1cm, Stage II, Grade 2, 1/17 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/734949",
      "Title": "Calendula ointment Linda37 twirlgirl"
    }
  ]
}