{
  "AuthorID": "linda505",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
  "Posts": [
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Feb 28, 2014 05:58AM linda505 wrote: Hi Lala1 I am in the venice area - south of sarasota/bradenton.   I am seeing Dr. Melinda Hart in Venice.  I can't give you any results yet but her bedside manner is great and she is very direct and compassionate.  My daughter used to work at the surgery center where Dr. Hart did her lumpectomies and she (my daughter) was thrilled that Dr Hart was my BS.  I do know in her waiting room I talked to women who were coming from Ft Myers and Tampa to see her.",
      "MessageIndex": 3,
      "PostDate": "28/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/818523",
      "Title": "BS recommendation for FL lala1 MsMay"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Mar 12, 2014 02:47PM linda505 wrote: Hi Terri001   Sorry to hear about your diagnosis but you are lucky as I was to find this forum.  I am also recently diagnosed but going the surgery route and then the chemo and herceptin route.  I meet with my oncologist on friday.  Here is a thread that I found interesting about herceptin and how people reacted to it.  https://community.breastcancer.org/forum/80/topic/... and here is one that people are talking about the chemo treatments https://community.breastcancer.org/forum/69/topic/... hope these help you - I have been reading them so that I have some idea what to expect",
      "MessageIndex": 1,
      "PostDate": "12/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/819047",
      "Title": "Whirlwind... Terri001 Rmanmom"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Mar 13, 2014 04:33AM linda505 wrote: Hi Optimistictraveler, You must have been one of the very earlier people to get herceptin - are you still on anything?  Good to see a triple positive almost 10 years out!",
      "MessageIndex": 3,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/819047",
      "Title": "Whirlwind... Terri001 Rmanmom"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 10, 2014 09:07AM linda505 wrote: Hi Curlyq - love your attitude on this - you think you can come sit next to me at chemo and tell all this stuff LOL",
      "MessageIndex": 105,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 17, 2014 12:36PM linda505 wrote: Hi Everforward - I have been trying to get that answer for awhile and what I have currently been told by my cancer treatment center is that I will pay my specialist copay amount each visit.   I still waiting on the final answer reference the cost of the chemo drugs but can't seem to get anyone to give me a straight answer yet.  I have an appointment with my MO tomorrow and will meet with the financial person there to see if she has clarification yet.  ",
      "MessageIndex": 197,
      "PostDate": "17/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 20, 2014 09:52AM linda505 wrote: Ok - my turn - prechemo Pixi cut ",
      "MessageIndex": 260,
      "PostDate": "20/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 1, 2014 02:09PM linda505 wrote: Hey Sharon - I am feeling pretty good today - tingley fingers and toes but in general good.  I still have taste buds and an appetite so that is good but it is only day two lol  Oh too hot for the hat here almost 90 today - I can wear it in the air conditioned cancer center for about 1/2 hour just to get a few smiles. Swissmiss - love your story about the little boy - how sweet.  Before you go out and buy another wig contact the american cancer society and ask where in your area they have a center - i think they will give you a free wig.  Maybe you will find one there that you like better and free is best!!",
      "MessageIndex": 542,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 1, 2014 06:35PM linda505 wrote: Blueberry - it is a flippy hat - I squeeze the little ball thing and his hands go up - so silly LOL -but I must laugh where I can. 48 hours after and starting to feel a little stiff and achy and I have tingling in my toes and fingers - I feel like I aged about 10 years since noon today LOL",
      "MessageIndex": 548,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 7, 2014 01:48PM linda505 wrote: OMG footballnut - another 5 miles - soon you can just walk to florida to visit!!  You go girl.  I did walk this morning for about 30 minutes - but plan on doing another one this evening when the hubby gets home. I feel very good today - virtually side effect free - hope this continues until the next tx.   I worked almost 6 hours today - the most since before my surgery - that also felt good to get so much accomplished. Longisland - good luck with your walk! Everforward - if you do decide to do that business trip to Tampa let me know - i am only about an hour south of there and if I am up to it I would love to drive up and meet you.   We can do this!",
      "MessageIndex": 681,
      "PostDate": "07/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 7, 2014 03:13PM linda505 wrote: so cute lemonade!! Love your wig - looks very natural!!   And you are right - everyones eyes look so beautiful with no hair!!   Think I am gonna have my hubby do mine this weekend.  I will see how it is falling by then",
      "MessageIndex": 686,
      "PostDate": "07/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 14, 2014 02:10PM linda505 wrote: Hey Jen - did you avoid the mouth sores for round two?",
      "MessageIndex": 830,
      "PostDate": "14/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 19, 2014 06:26PM linda505 wrote: Looks just like mine MommyQ - my makeup collection was very nice and we had someone teach us too.  Funny part - I haven't lost any of my eyebrows yet and since I know they are going to go I haven't plucked nor waxed them in the last month and they are very bushy.  So I didn't participate in the fill in the eyebrow part and when they were done one of the volunteers came over to me and said \"Oh honey you have over down the eyebrows\" and proceeded to try to rub them off - I was like STOP those are real LOL.  It was so funny.",
      "MessageIndex": 948,
      "PostDate": "19/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 22, 2014 07:33AM linda505 wrote: so cute Cold!!  Love it - funny when I got my treatment tuesday I was looking through the basket of free stuff they always have there - hats and scarves and things and there was an eye patch in there and I thought of YOU!!! LOL Day 2 and feel pretty good - they cut my carboplatin by 15% and I do think it is helping with the neuropathy  - last time on day two my fingers hurt more when I typed but we will see where this goes by the afternoon - but I am keeping my less achy fingers crossed. I had bald spots and what my hubby called racing stripes and I couldn't take the itchy feeling any longer so hubby shaved me and now I am using coconut  oil on it and it feels so nice - Not a great picture but it is my \"oh is the me look?\"  LOl Hope you all having great SE free days or minimal ones that you can manage - and in everyones pocket who is going in the rest of the week!! ",
      "MessageIndex": 1018,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 29, 2014 06:35PM linda505 wrote: wooo hooo timbuktu!!! and love the tshirt longisland!!",
      "MessageIndex": 1247,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 3, 2014 03:08PM linda505 wrote: Hi boobie - I would make them aware - are you running a temp?   Them may be able to give you something that will prevent you from having to delay treatment.  ",
      "MessageIndex": 1325,
      "PostDate": "03/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 11, 2014 08:50AM linda505 wrote: Footballnut - you both are just too darn cute!!!  Good luck today!!  Here is a somewhat blurry image of me doing round 3   Hubby is a good auto mechanic - not so good photographer - the hat and socks were sent by a friend so I wore them in her honor yesterday.   I am having a CT scan of my liver and abdomen as soon as it is scheduled, to see why my liver function tests continue to rise.  I must say I am scared.  Could be just a result of chemo - which is what my MO \"thinks\" but also could be a sign of liver or bone mets - ughhhhhhh. ",
      "MessageIndex": 1510,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 12, 2014 04:48AM linda505 wrote: MommyQ - I get the tightness in the chest muscles around my TE's after my infusions also.  It usually lasts a few days.  I don't know your feelings on this but my PS gave me a prescription for valium to help with the muscle issues.  So on those days I take one before bed and it really seems to help with that night and the next day - just enough to make it mostly unnoticiable.  He gave me a prescription for 60 pills right after my surgery and I still have enough left that I could take one everyday for 3 weeks - so you can see I don't use them every night.  They also seem to help take the edge off when I am taking the pre chemo steroids.  My MO ok'd this usage.  Makelemonade - how low did you hemo go before they decided to transfuse you?  My red and hemo did not really recover between treatments this time - so I started off a bit low - not transfusion low - but low enough that I have more fatigue.  They told me that fluids may also help with the exhaustion - I might ask if I can go in for one Friday - maybe help me feel a little better this weekend.   I go today at 330 for my CT scan to look at my liver and mid- back - hope they see nothing - or if they see something it is just a normal bad thing not a cancer bad thing.   ughhh stress.",
      "MessageIndex": 1528,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 12, 2014 08:26AM linda505 wrote: thanks for all the positive thoughts I am hoping and praying that this is just one of those SE from chemo - all my test prior to starting chemo were normal so I have that to hang on to.  I don't know when I will get the results I am gonna try to get the radiologist to give me hints LOL - doubt he will but we will see - maybe if I wear fake eyelashes and bat them at him LOL I had bad C first infusion but no D - then lesser C with 2nd infusion but then had 3 days of D.  So far it seems as if I am going to skip the C for the third infusion or at least be minimal as I had a small bowel movement this am.  So lets see if I can skip the D too!   We always seem to go to these conversations LOL - but where else could we talk about this shit - pun intended!!  I did this for my second treatment and for this treatment and it may help with the C - but you got to be patient  Accupressure points for constipation http://www.youtube.com/watch?v=F3OOdpJup-8 Yeah for the Rangers!!!",
      "MessageIndex": 1534,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 12, 2014 05:25PM linda505 wrote: Just home from my CT Scan - will not have the results til Monday ughhh - so a weekend of not knowing",
      "MessageIndex": 1546,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 13, 2014 03:27AM linda505 wrote: Hey Merg - yes the steroids will mess with your sugar big time.  I am type II diabetic and mine goes high for the steroids days.   I have cut my steroid intake way down - with my MO's approval.   ",
      "MessageIndex": 1554,
      "PostDate": "13/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 30, 2014 05:28PM linda505 wrote: Hi mikishelley - that is a tough one - my MO has told me the two most important things that I am or will be doing after the BMX is taking the herceptin for the HER2+ and going on an AI for the ER/PR+ part of my cancers - all preventative.  I will most likely end up on one of the others as I am post menopausal but still have all my parts, but the tamoxifen has an advantage over the other choices in that it helps to build bone strength, where the others will cause the opposite effect.  I haven't talked to my MO on what he will be suggesting I take yet but I have thought about asking him if I could take Tamoxifen for awhile to build the bone and then switch to one of the others.  I know there is a way for premenopausal women to do one of the other drugs and you may find that info in the other threads.   So many hard choices that we have to make!!  Just isn't fair that we have to do such dangerous things to ourselves to treat this horrible disease.",
      "MessageIndex": 1871,
      "PostDate": "30/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 5, 2014 12:22PM linda505 wrote: I agree it is amazing how your physical condition so controls your mental place.  When i don't feel good everything is horrible!!  I hate the C days - they are the worst.  I am mentally in a better place today but Wednesday through yesterday I was in the midst of a dementors convention!!  ughh.   One day at a time - left foot, right foot,.... ",
      "MessageIndex": 1956,
      "PostDate": "05/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 9, 2014 12:54PM linda505 wrote: Howdy all,  Day 8 past chemo 4 and it is kicking my butt big time.   I am just exhausted no energy - just want to sleep - my stomach makes ungodly noises all the time and creates enough gas to launch a zeppelin - ughh.  My MO decided to skip the neulasta shot this go around cause my ANC and WBC were always so high between cycles that he assumed that I would hold up - WRONG.  Had to get nuepogen shot yesterday and now have to get a CBC every day this week ughh.   So instead of paying for one shot I have got to pay for 4 nurse visits and at least one shot.   IF and that is a big IF I do the last two treatments there is no way I am allowing him to skip the shot next time.    I understand why he did it - he thought it was just one less thing to mess with my system - but I had reservations about skipping it and told him so - I guess I should have been more vocal about it.   Next Tuesday I have my liver function blood tests again and if they are any higher or even the same I will have already had my last chemo.  I am just not going to chance destroying my liver when my MO keeps telling me that the most important thing that I am doing is the herceptin.   I have thought this out and wondered if I was using the liver issue as an excuse to quit chemo and decided that I am not.  I would be happy to get results of next weeks blood test that said it was functioning better and then I would do another one and then relook at the tests after. Emotionally I have been in a really bad place this last week.  I find myself crying daily - feeling sorry for myself.  I just have so much stress with issues at work and dealing with the SE.  I am really concerned that my job may not survive for much longer as I don't believe the company can survive for much longer - and I am talking a few months here at best.  Don't know what I will do then - no income, no insurance and cancer UGH.  Sorry for being such a downer - just needed to vent somewhere.    Great to some of us April sisters finishing or getting close to the finish line on chemo.  I wish you all SE free days and littles bits of joy where you can find them.  ",
      "MessageIndex": 2044,
      "PostDate": "09/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 19, 2014 05:50AM linda505 wrote: Ahh clarn  so sorry that you find yourself in the hospital but glad that you have a nice room and a stable potty chair :).    Hopefully this will bring a smile to your face and to others.  ",
      "MessageIndex": 2176,
      "PostDate": "19/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 25, 2014 06:29AM linda505 wrote: Oh Mmtagirl - I also did B12 and B6 for the neuropathy -and am still doing those daily.  Just thought I would mention that as my MO also suggested both of those - hope you have a good weekend too!!",
      "MessageIndex": 2308,
      "PostDate": "25/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Aug 24, 2014 09:30AM linda505 wrote: So happy to hear Jen - especially about he nodes!!  Also - here is something you to need to hear about healing \"Just because you can doesn't mean you should\"   Remember that most of the nerves in the area where you had the bmx are gone and therefore things that would cause pain during healing don't.  So limit your range of motion to a T-rex - don't lift your arms above your head and not more than 5 lbs.  You want the inside to heal nicely.  Also - eat as much protein as you can -helps with the healing!! ",
      "MessageIndex": 2579,
      "PostDate": "24/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Sep 29, 2014 02:16PM linda505 wrote: We all look like we go to the same hair dresser LOL.   At least we are getting some back!!  Mine looks alot like yours Cold - only I think you have a little more length - but we have the same male pattern baldness. I never lost my enjoyment of coffee - but I still can't eat anything that has a smokey flavor - which is ok cause most of that isn't good for us anyway.  Other things still taste a little off or different but not necessary bad.",
      "MessageIndex": 2797,
      "PostDate": "29/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Oct 18, 2014 07:53AM linda505 wrote: btw - here is my latest hair update photo - I am very close to having an \"alfalfa\" and on my way to a buckwheat - or maybe I am just hiding a conehead?   Note the top of my head lol.   ",
      "MessageIndex": 2866,
      "PostDate": "18/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Nov 20, 2014 07:51AM linda505 wrote:  Timbuktu - like this??? lol My Marge Simpson is on its way",
      "MessageIndex": 2915,
      "PostDate": "20/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 23, 2014 06:28PM linda505 wrote: Golfinggirl - you did have a rough day and I send you gentle hugs! Mikishelly - thanks for your inspirational post - I need that today - having a tough one here - just feeling so tired - Day 3 afternoon ughs. Footballnut - my bathroom is dirty - what time you arriving? Latisecannon - welcome Speaking of baldness - went to get the mail today with nothing on my head and my neighbor was outside and said - wow you got a nice head for an old girl LOL   She is about 90 herself and has no idea I have BC  - but she did make me smile.",
      "MessageIndex": 1086,
      "PostDate": "23/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 26, 2014 07:56AM linda505 wrote: Boobiprized!! you rock the bald look big time!!!  Your eyes pop!!  Couple of the ladies at mine had guests too and no one said anything - must be one of those unspoken rules lol.  Glad she got to go anyway and glad you enjoyed it - mine was good and met some nice ladies - one of them is on the same schedule as me so that is nice. Dementors have moved on for another round lol - energy coming back - I also ran a slight fever day 4 between 99 -100   - didn't do that the first time.  I slept most of day 4.  Day 6 and feel much better - a touch of D but I can deal with that.  Days 3-5 definitely have been my worst days for the first two treatments - 1/3 done!! woo hoo. Sharon hope your energy returns and the fever leaves!! Here is to SE free days for all!!",
      "MessageIndex": 1133,
      "PostDate": "26/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 1, 2014 12:55PM linda505 wrote: For neuropathy my MO gave me the go ahead on L-Glutamine powder 30 g a day - I do it 10g at a time mixed in juice - he said only the pure cause some of it is mixed with antioxidants which in his book is a no no during chemo.  He also gave me the go ahead on B6 and B12 - but I think the best thing he did for my neuropathy was reduce the carboplatin by 15% - both taxotere and carboplatin can cause neuropathy and he thought in my case it was the carboplatin - not sure why he thought that - but it was much better the 2nd go.  I also have been doing the b6, b12 and L-glutamin through the whole cycle this time which I was not the first time - so who knows what worked or didn't.",
      "MessageIndex": 1297,
      "PostDate": "01/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 9, 2014 09:27AM linda505 wrote: Good Morning to my April sisters.  Just had my fill at my PS - I am now past puberty and seem to have a little cleavage lol.  I am so not looking forward to tx 3 tomorrow.  This last cycle I never really got back my energy in the last week like I did with the first one - so I am fearing how much fatigue I will have with #3.  I wish I had a life remote control and I could fast forward to August.   In the meantime - I think I do a good gypsy impression ",
      "MessageIndex": 1437,
      "PostDate": "09/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 11, 2014 07:42AM linda505 wrote: Mikishelly - I got neuropathy after round 1 - mine lasted about 6 days - I take B6 100 mg, B12 1000mcg spray, and L- Glutamine powder -- 10 mg of the powder mixed in a little juice 3 times a day to help with it.  Ask your MO if those are ok for you to try.",
      "MessageIndex": 1506,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 13, 2014 02:27AM linda505 wrote: Timbuktu - keeping you in my thoughts and prayers.  My MO only ran those once and will not run them again on me.  I had two active cancers - one in each breast - this is before my BMX and/or any treatment.  My tests were normal.  He said that they are not very dependable and that inflammation anywhere in your body can cause them to rise.   Are you have any symptoms of anything?",
      "MessageIndex": 1552,
      "PostDate": "13/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 19, 2014 01:59PM linda505 wrote: Mompv - any fluid count except ones with caffiene is what the nurses told me - so drink whatever you can - I mix flavored vit water with my water sometimes 1/2 and 1/2 and that seems to help.  Lemon squeezed into my water helps.  Ice chips would be fine.  Anyway you can get fluids is important - also if you think you are dehydrated at all call your MO and see if you can get fluids.  I got a fill up on Friday and even though I was and am drinking alot I think it REALLY helped with the SE's this round. ",
      "MessageIndex": 1697,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 5, 2014 06:04PM linda505 wrote: mrcaruso - while you are asking questions ask your mo why I have a dull mid back ache all the time now LOL.  I just came back from having dinner - actually had an appetite and taste buds so I took advantage and had hubby take me out.  Went to a mexican joint and I had their steak that has a nice ranchero sauce on it - not too spicy but a very nice flavor and I ate the refried beans and left he rice.  I was so good as I avoided the chips and torilla's cause of my diabetes - then the waiter decided to be \"nice\" and brought a complimentary desert.   Sorry but my will power went out the window.  I will pay for this with my counts tonight and in the morning.  But at least I got a little enjoyment out of the high numbers - unlike when I am good and just take my steroids.   Oh well, hope you are starting to feel better footballnut and mrcaruso.  And here is hoping for a week of minimal SE's for all of us going through treatment!",
      "MessageIndex": 1964,
      "PostDate": "05/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 16, 2014 10:21AM linda505 wrote: Hey FBN - glad to see you are feeling better!!  Nose issues - mine runs alot as the hairs are gone - with yours being dry and bloody you might want to ask what your platelets are at.  When they are low they can cause bloody nose and also bleeding elsewhere - definitely let the MO know about the bloody nose.   Tingly/numb foot - sounds like a bit of neuropathy - also let MO know - I had that pretty bad first treatment and very minimally since as they reduced my dosage do to the neuropathy.  Although mine got more intense then what you are describing - it went to burning pain after the tingling/numb phase.  Are you eyes running during the day?  Mine go through stage of being dry or runny - I also wake up with sticky stuff most mornings.  I am going to tell MO about this also as others have said that you can develop tear duct issues that may need attention ",
      "MessageIndex": 2138,
      "PostDate": "16/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 16, 2014 12:16PM linda505 wrote: Congrats Swissmiss one part of your journey is done!!",
      "MessageIndex": 2144,
      "PostDate": "16/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 21, 2014 03:05PM linda505 wrote: Ugh - getting ready for the chair tomorrow for #5 - and taking those ducking steriods.  Have I mentioned how much I hate the steriods??  Don't know if I will really be doing #5 or #6 - will all depend on my liver enzymes, which have been climbing since the first treatment.  If they have climbed further I think I will stop chemo and continue with the herceptin only.  As of my last treatment they were already in the range that the manufacturer of taxotere recommends stopping so I will not go any further if they have increased.  My MO did reduce the dose to see if that helped.  Not sure what kind of a discussion I will have with him if I want to stop and he doesn't want me to but I have to make the best decision for me.  I still feel like I am in the throws of the bad SE days from #4 - never really recovered from that treatment - no energy at all, and all the typical SE's seem to be hanging on in different levels of bad.  Hope everyone is having minimal SE's and those that are having them - hope you are coming out of the dark dementor occupied land.  CONGRATS to all that are finished!!",
      "MessageIndex": 2216,
      "PostDate": "21/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Aug 18, 2014 03:07PM linda505 wrote: Hey Jen - I had surgery at 3 pm and was out of the hospital by 1 pm the next day.  The hardest part of the BMX was the inability to get myself up and out of bed for the first week or so.  I spent that time in an electric recliner - I rented it from rent-a-center and it was the best thing that I could have done - it gave me the ability to get up and go to the bathroom without help in the middle of the night.  Just remember you can barely use your arms - that is the hard part.  Make sure everything that you need to get to is counter height or lower.   Think of T-rex - that is your arm movement range.  Also hard to open jars, bottle etc as that force is more than you can manage.  My pain was very minimal - really very little pain.  I had more muscle spasms than pain and my PS gave me valium which I used at night for a number of nights to help with the muscle spasms in my chest. I only took pain pills for two days I think.  ",
      "MessageIndex": 2537,
      "PostDate": "18/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Aug 19, 2014 10:53AM linda505 wrote: Everforward - the herceptin can cause the drippy nose - I get that after each herceptin and sometimes it lasts a long time and sometimes it is only a few days.  The advice I got was that alot of the SE's were cumulative and lasted longer with each treatment.  ",
      "MessageIndex": 2548,
      "PostDate": "19/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Sep 20, 2014 01:27PM linda505 wrote: Everforward - it gets better with time - the TE's were more painful for me early on and got better as time went on.  You are really still recovering from major surgery.  I didn't have any fills other than what we put in at the surgery for 3 weeks so I think that helped.  How much did you have put in your TE's at surgery?  Do you still have drains?  When do you see your PS next? Just to give you all some encouragement - had my exchange yesterday and only taking tylenol today and just regular strength.  Chest feels tight but not really any pain.  Taking the tylenol for my throat from the tube from surgery lol.    I haven't looked yet.  I can take the ace bandage off today and shower but I think I am going to wait until this evening.  I think the shower might relax me a bit - had a hard time sleeping last night - sure it was the after effects of the anesthetic - but my brain was working overtime.   ",
      "MessageIndex": 2769,
      "PostDate": "20/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Oct 4, 2014 05:22AM linda505 wrote: MommyQ - another person that goes to the same stylist as me.  Last night I was getting ready to go out for dinner and noticed that I actually have a little hair that is lapping over the top of my ears - guess I need a trim LOL",
      "MessageIndex": 2825,
      "PostDate": "04/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Oct 17, 2014 04:17AM linda505 wrote: Everforward - I know exactly what you mean - I had a really hard time starting my armidex.  It was very emotional taking that first pill - but been doing it for a month now - I take it with my other supplements and just think of it like a vitamin now.     Timbuktu - woo hooo - it is great having an almost normal day isn't it?   I love those days and physically most of them are like that now.  I am still not totally physically the same - more aches and pains, not quite as much energy but close to normal.  I am good with that and hopefully it will only improve from here. My hair is still growing straight up on top of my head with all kinds of weird waves and collicks LOL.  My  hair was VERY straight so I am not sure what this means.  I would say the hair on top of my head is almost an inch.  The sides and back are laying down nicely and behaving and playing nice together.  But the top of my head thinks it is a member of a punk rock band.  I think I may need to get some gel.  I think the color is the same as before - maybe slightly darker.  It is not as full but it does seem to be filling in and I see less and less scalp now.",
      "MessageIndex": 2860,
      "PostDate": "17/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 4, 2014 05:39PM linda505 wrote: Got a chemo start schedule - dependent on the healing of my incision - PS doesn't want me to start chemo until I am a little more healed - MO wants me to get going LOL.  Anyway I will be doing 4 rounds of Adriamycin and Cytosan - every two weeks, then I will be doing Taxol and Herceptin every week for 12 weeks and will end up with Herceptin to finish out a year - ughh - not what I wanted to hear was hoping for a kinder/ gentler chemo - but it is what it is...as it stands now start date of April 18th",
      "MessageIndex": 58,
      "PostDate": "04/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 7, 2014 10:34AM linda505 wrote: Getting my port placed April 15th at 445 pm.   Not looking forward to someone cutting me yet again lol",
      "MessageIndex": 75,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 10, 2014 06:42AM linda505 wrote: Hi again Sharon - here is a thread that has a list of things that you might want for chemo http://community.breastcancer.org/forum/69/topic/706846?page=50#idx_1489",
      "MessageIndex": 103,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 15, 2014 08:45AM linda505 wrote: I have fairly short hair now - but plan on getting a pixie cut when I start chemo - then shave it when it starts falling out.  I have a wig which I may wear at times but will most likely wear a scarf or hat instead most times.  Unfortunately I do not have pierced ears as before all this I didn't like holes in my body LOL (isn't that ironic) so I will be looking rather boyish I am sure - oh well .  I hate having a cold head so a coldcap is not for me but I am gonna try to ice my hands and feet - for the neuropothy issue -   I don't really like cold hands or feet either - but I will give it a shot This is me and hubby and my wig ",
      "MessageIndex": 163,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 18, 2014 10:25AM linda505 wrote: Dee-  Yes - I am thrilled with his attitude - he absolutely wants to hear what Moffitt says and gave me a note to give to my MO at Moffit with his contact info on it.   Lakegirl - He earned my total trust today as I see he is someone that I can say anything to now about my treatment and he will hear me.  That was great to find out early on.  ",
      "MessageIndex": 215,
      "PostDate": "18/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 20, 2014 10:02AM linda505 wrote: Clarm - love yours - you have such nice thick hair - mine is already so thin that I am afraid I will be one of those to not get it back",
      "MessageIndex": 261,
      "PostDate": "20/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 30, 2014 06:28AM linda505 wrote: Howdy all - started chemo yesterday and everything went great with that - no reaction to any of the infusions - nurses were great and I got to wear my chemo hat which brought smiles to all the other patients around me and I liked that!!   I feel very good this morning - slept well last night - gonna go to work for a bit today and see how it goes.  It feels very good to finally be starting and not have all the pre anxiety!!  Thanks to all of you for your courage and support - I just don't know how anyone would get through all this without this site!!  Here I am at first chemo ",
      "MessageIndex": 483,
      "PostDate": "30/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 30, 2014 01:38PM linda505 wrote: sent a friend request Jen - what a lovely family!!  It will be from Linda Schaner",
      "MessageIndex": 507,
      "PostDate": "30/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 1, 2014 02:25AM linda505 wrote: dangit makelemonade - thinking about you and sending your bone marrow energy thoughts!",
      "MessageIndex": 522,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 5, 2014 07:45AM linda505 wrote: Hey Sunshine and all other april sisters - I get you with the chemo blues - but you are 1/3 of the way done!!!  2 down !  The big \"C\" was my bad one from the first round - that just cleared up last night -  tingly burning pain in feet and hands are my number 2 ( these scare me the most) - with fatigue a close 3rd.  I feel bad about being so helpless at times for my hubby - he doesn't know what to do to help and I can tell he is aggravated and frustrated and sometimes it is hard not to take it personally -although i know that he isn't upset with me - it feels like it sometimes. We will get through this - we just need to dig deep for that strength.  I am getting ready to go take a shower and hopefully take a small walk - I really think that helps even though I don't feel like doing it.   My scalp is a little sensitive where my reading glasses touch it so I know things are starting to go there - guess I got another week before I really see the shed.  I think I will get my hubby to shave it towards the end of this week. I think I am gonna look for a comedy movie and watch it today  - I am off on Mondays -so I have a day at home and my daughter is coming by to visit.  SMILE and laugh - produces good things!",
      "MessageIndex": 601,
      "PostDate": "05/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 10, 2014 05:27PM linda505 wrote: Everforward you look great with the buzz and the wig looks so natural - although I would like to see a bigger pic of you in it!!",
      "MessageIndex": 737,
      "PostDate": "10/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 12, 2014 06:40AM linda505 wrote: Morning all, Hope all you mothers had  nice mother's day - I did - my daughter came to visit and we had a very nice dinner.  The one thing that I really didn't experience yet was a change in taste or loss of appetitie.  The only thing that has tasted vaguely odd is iced tea - for some reason it tastes like fish LOL.  In general I have felt pretty good so far for the first treatment.  Constipation initially that took 5 days for me to get it resolved, achyness and fatigue that comes and goes.  The worst one, because it scares me, has been the on and off neuropathy in my hands and feet - was worse the first 4 days after treatment but still shows up now and then.  I did have one day - last Friday that I felt  suddenly like the dementors had swooped over me  and sucked all the joy and life out of me.   I believe I had hit nadir with red blood cells.  That resolved the next day.  I have tried to walk everyday and I think it helps.  I am hoping to have a good week this week leading up to tx 2.  Hope you all have many SE days and that the ones you have are manageable. ",
      "MessageIndex": 754,
      "PostDate": "12/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 12, 2014 09:02AM linda505 wrote: Just reread my post LOL  - hope you ALL realize that I was wishing that you all \"have many SE FREE days\"  not many SE days - ughh.  I am blaming that post on chemo brain",
      "MessageIndex": 756,
      "PostDate": "12/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 13, 2014 07:17AM linda505 wrote: We have every right to cry - we are going through a shitty time - no if, ands, or buts about it.  It sucks, plain and simple.   Don't feel guilty about feeling sad - explain to your families that you will be sad sometimes and it is ok - it isn't their fault you are sad and there really is nothing they can do to make you not sad but a hug does help.  I had that conversation with my hubby and daughter again this weekend.   Told them please don't tell me to be strong when I am sad, scared, or crying  - just give me a hug or tell me that you love me.  It is normal to feel like this - just let it happen and then move on to the next thing in life.   We got each other's backs - remember that - we are in each others pockets everyday saying - I get it - I hear ya - it sucks - lets go fight",
      "MessageIndex": 779,
      "PostDate": "13/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 14, 2014 03:31PM - edited May 14, 2014 03:32PM by linda505 footballnut - you can wear Peyton's jersey in my car - inside out though Sorry jamieh - I would be very upset too Mikishelly - I have only had one so I can't comment on that but I have heard that some SE's are cumulative and I have also heard that some had different reactions to each dose - I guess it is just a bit of a guessing game for us on what to expect.  I am hoping to have a similar experience next time as this time but just not sure what will happen. Jen - ask you MO about Mugard for your mouth - they may have a sample they can give you for the next cycle.  My insurance will not cover it but they gave me a sample bottle and I am gonna try to make it last as long as possible.  I iced my mouth the entire infusion of taxotere - at about 16 ounces of ice chips LOL ",
      "MessageIndex": 836,
      "PostDate": "14/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 18, 2014 02:59PM linda505 wrote: Hi Merg - wicking material takes the moisture off of you skin and pushes it to the outside of the material so the clothing next to your body stays dry and that moisture drys.  Really helps me.",
      "MessageIndex": 923,
      "PostDate": "18/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 20, 2014 04:43AM linda505 wrote: Everforward - call the center or ACS that does the LGFB classes and ask them if they can at least get you a bag even though you can't attend.  I don't know how that works but those volunteers that work those are usually all breast cancer survivors and I would bet that they would try to find a way to help you So sorry for all you troubles this week - I think you are getting them all out of the way now and everything will be smooth sailing for you going forward!!",
      "MessageIndex": 958,
      "PostDate": "20/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Nov 3, 2014 11:29AM linda505 wrote: Here is the top view - just for giggles ",
      "MessageIndex": 2880,
      "PostDate": "03/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 26, 2014 11:25AM linda505 wrote: hey teachermom - I have that feeling at least once a week - it is sudden and like \"Oh I do have cancer!!\"   ugh.  Tell the peeps that tell you you must have had a bad radiologist that it happens often that it is not seen in a mammo - I had one in each breast that were not seen in mammo's - my bs said they were most likely there for at least 3 years - so that is three years of mammos not showing them.  And if these peeps are women tell them to ask their docs and radiologist when they have their mammos if they have dense breast tissue.  No one ever told me I did and it is something we should know",
      "MessageIndex": 1,
      "PostDate": "26/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/820549",
      "Title": "Waiting for Oncotype--it all finally hit me teachermom4 cookiegal"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 3, 2014 05:37PM linda505 wrote: Hey Everforward - think we will be shadowing each other for the next year or so LOL - both surgeries in March, both triple positive and both starting chemo in April - aren't we lucky LOL.   Hope you can avoid the mastectomy if that is your desire but I will tell you that other than a few stumbling blocks - with a little healing issue - the mastectomy was not bad at all - wasn't as painful as when i had my appendix out and recovery seems to be about the same.  And you are right - that is all we have to do is be a survivor!",
      "MessageIndex": 41,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 4, 2014 07:06AM linda505 wrote: Good luck and positive thoughts to you all starting chemo today and tomorrow and lovielovie - I must say I am still laughing about the wig in the oven comment!!",
      "MessageIndex": 53,
      "PostDate": "04/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 14, 2014 04:41AM linda505 wrote: Hey Swissmiss - I am on the every two week regime for my AC also - and like clarrn - then to the weekly taxol with a little hercepticin thrown in for good measure.   I am supposed to start on Friday of this week - see my PS today to see if my bad healing area is better enough to start chemo - part of me wants me to say yes the other part says I would like another week of healing.  I get my port tomorrow and my Muga test on wednesday.",
      "MessageIndex": 145,
      "PostDate": "14/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 14, 2014 02:57PM linda505 wrote: Healing issue on my left breast cause my plastic surgeon to remove the dead tissue and resew me back up today - this will delay my chemo start for two weeks.  This gives me time to get a 2nd opinion on the type of chemo that I am getting which I think I will do.  Looks like I will still be an April chemo lady but maybe the very end of April.",
      "MessageIndex": 148,
      "PostDate": "14/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 21, 2014 08:34PM linda505 wrote: Mompv - don't spend time googling prognosis - so much that is out there is out of date as so much is being done and added everyday to help us fight this disease - join the triple negative forum and talk to those that have and are walking in your shoes.  The triple positive women have helped me alot with learning the latest and greatest and have give me comfort. Makelemonade - My real hair looks ok short with the pixie but the pixie wigs look horrible on me lol.  I got a longer wig.  The girl who cut my hair this weekend did it for free.  I told her what I wanted and that I wanted it short short short and she was like you sure you want to go that short?  I told her why and then she told me she lost her mom to lung cancer three years ago - her mom was only 41 and never smoked a day in her life.  When I went to pay my bill - she told me her mom wanted her to cut my hair for free.  It was so sweet and we both cried.  I gave her a hug and said - Your mom sent this hug.",
      "MessageIndex": 292,
      "PostDate": "21/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 28, 2014 12:56PM linda505 wrote: Well my sisters - tomorrow is my first chemo - had to go get the steriods and start taking them today  - they made me cry.   I don't think it is the steriods it is the thought of what that means.  Can't say I am not frightened - I am - but thanks to all of you and all your posts and courage - I know I can do it too!!  ",
      "MessageIndex": 432,
      "PostDate": "28/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 28, 2014 02:57PM linda505 wrote: Thanks you all!!  I am actually looking forward to the day I have to shave my head because that means I will be two weeks into this LOL.  I just started taking the dang steriods today and it made my nose run and my lips feel funny - I don't see those on the known side effects - so I called my MO's office - waiting for the nurse to call me back.  Anyone have that reaction within an hour or so of taking the first dose of dexamethasone?",
      "MessageIndex": 437,
      "PostDate": "28/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 30, 2014 12:54PM linda505 wrote: Hey Sunshine - I will be a FB friend  - I have friended Footballnut already - message me your FB info and I will send a friend request.",
      "MessageIndex": 504,
      "PostDate": "30/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 2, 2014 11:53AM linda505 wrote: WOO HOO Makelemonade - happy happy for you!!",
      "MessageIndex": 564,
      "PostDate": "02/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 7, 2014 04:51AM linda505 wrote: Hey Cold - don't have the eye twitching - yet- but have been told that it is a side effect of taxotere along with tearing eyes which they call Taxotears LOL.   Hoping all of you are having minimal SE and many good hours.   I am feeling good at this point - had a few rough days this weekend but in general doable - most just tired.  I have been walking as often as I can - at least 30 minutes a day but haven't done any other exercise - I am working about 1/2 day a week 4 times a week so I guess that counts as exercise LOL.  I am also taking the Claritin and so far very minimal pain and really no headaches.   Nurses told me yesterday, when I went for my labs, to take B6, B12 and L-glutamine (SP) to help with neuropathy and general nerves issue side effects.  All blood work was good - the important ones all in the normal range.   The nurse told me to expect to be more fatigued in the next few days as my RBC will be dropping a bit which will make me tired - umm - I am already tired LOL.  Gonna eat a bunch of spinach and call myself Popeye for a few days.   Footballnut - 5 miles exhaust me reading it LOL - you go - you are a super hero - Captain America!! ",
      "MessageIndex": 664,
      "PostDate": "07/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 8, 2014 04:20AM linda505 wrote: MommyQ - you can drink too much water and get something called water toxicity - not sure if it can mess with your heart rate but it can drop your blood pressure so I assume it can - you need to mix in some other liquids in your diet - they count toward hydrating.  Add in some gatorade or unsweetned fruit juice or some flavored vitamin waters or broth.  ",
      "MessageIndex": 696,
      "PostDate": "08/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 12, 2014 03:30PM linda505 wrote: MMTagirl - I know some of this is really not funny but you made me Laugh out Loud and I can soooooo relate",
      "MessageIndex": 770,
      "PostDate": "12/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 13, 2014 06:44AM linda505 wrote: Lovebeingnana - I had one of those days yesterday - cried for absolutely no good reason multiple times and I was physically feeling good.  This stuff messes with our hormones and I guess it should be expected but dang.   I know crying releases stress hormones and toxins from our bodies so I really think it is our bodies way to get rid of this negative stuff so I just let them flow when they start.  I do actually feel better after a good cry. Day 14 after my first treatment and headed in for my blood tests today - will be curious to see where my counts are.  Day 7 they were all normal.  Looking forward to having a good week before my next treatment on the 20th.   Here is to few and manageable SE for all - and many many SE days.",
      "MessageIndex": 774,
      "PostDate": "13/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 18, 2014 07:27AM linda505 wrote: Kazzy - I had them really bad for about 3 days after my first treatment - I have been having them somewhat every night since I went into menopause and these wicking danskins have made a world of difference - try one set to see how they work for you.  I bought two initially and went back yesterday and bought three more sets - I wear them as PJ's and also for my walks.   Make sure you look at the tags - some are wicking and some are not - the wicking ones usually have a folded tag versus a single tag.  Hope they help you like they helped me.",
      "MessageIndex": 911,
      "PostDate": "18/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 19, 2014 05:19PM linda505 wrote: Footballnut -Cancer sucks!! Chemo sucks!!! You are allowed to have down days you are allowed to cry and you are most definitely allowed to vent and here is a great place to do all three and you will never bring us down - we are here to support the hard times and cheer the good times.  We are super heros and even they have bad days!!   Blood work through my port didn't hurt at all and I don't have emla - they sprayed it with some freezy stuff. Had my LGFB class today and it was very nice - got some nice makeup and meet 7 women going through this - the youngest was 48 and the oldest was 77 - she sat next to me and we had a blast together - I am 57.  She has treatment tomorrow at 1030 - so I will be there when she comes in.  It will be her third treatment and she is doing great and she hardly had a wrinkle on her face and the biggest bluest eyes I ever saw. Huddling saying \"easy peasy\" LOL",
      "MessageIndex": 945,
      "PostDate": "19/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 22, 2014 01:12PM linda505 wrote: I either see my MO or his PA each treatment.  I only see the nurses on lab and shot days but they go over side effects and report them to the MO if it is something they think he needs to know right away.  Swiss Miss - I get to my appt at 9:15 and am in the chair for infusion by 10:30  - I think it is long too but sometimes their are peeps having issues that the doc is attending too in the infusion room and sometimes the labs just take a little longer.  I have labs the day of treatment. But I am in the chair for about 5 hours ughhh.  So I just know on infusion day no matter what it is gonna be a long long day.",
      "MessageIndex": 1046,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 24, 2014 04:16AM linda505 wrote: Mikishelley-woo hoo - almost done with chemo!! I envy being able to say that - all I can say right now is 1/3 done - sounds better than 4 more lol Just in case you don't know that it exists - here is an \"exchange\" thread   https://community.breastcancer.org/forum/44/topic/... maybe you can find some comfort or help there with your concerns. I wonder if anything will ever really feel normal again?  I think we will all be finding a new normal - maybe a better normal?  I hope so for all of us I have felt not so great the last 24 hours - felt ok in the am yesterday but by the afternoon I had been visited by the dementors from Harry Potter and they are still with me - sucked all the joy and life out of me. I am running a slight temp - only 99 right now but I usually run low so a 99 is more like a 100 to me - keeping an eye on it. I will say on a positive note that my neuropathy does not seem to be as bad this time as the first time - hopefully that 15% reduction on my carbo will hold it at bay. Chemo just sucks ya'll!! Sending you all gentle hugs!",
      "MessageIndex": 1088,
      "PostDate": "24/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 29, 2014 03:06PM linda505 wrote: Mompv  - you just have to trust in your own judgement on these things and not look back - I hate every decision that I have made on BC since day one but I just keep looking forward!",
      "MessageIndex": 1238,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 30, 2014 08:30PM linda505 wrote: Cold -love the wig LOL!!! You can have some real fun with that. Swissmiss  - do you have an urgent care center instead of the ER?  I know that my copays for urgent care are alot less than emergency room and then at least you are being looked at by a doctor who can order a chest xray if deemed needed.  But if you are running a fever and it is 100.5 or above then I agree the ER may be the place to go.  Strep is nothing to mess around with even without our compromised immune systems.",
      "MessageIndex": 1274,
      "PostDate": "30/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 6, 2014 02:54PM linda505 wrote: Sharon- ty ty!! so very nice Everforward - my bone pain was less for round 2 than the first time - but I got the shot in my stomach for round 2 versus the arm.  Debiann had heard from someone that the bone pain was not as bad if you got in the stomach so I decided to try it - not sure if that was the reason but it definetly was less intense this time.  I am going to continue that - I do take the claritan for 10 days and I start the night before the shot - so the night of chemo",
      "MessageIndex": 1388,
      "PostDate": "06/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 11, 2014 01:58PM linda505 wrote: thanks all for the prayers and good wishes - Having the test tomorrow afternoon at 3:30 - glad I didn't have a long wait for the test and hopefully the results will be quick and clear  - the test is done right at the cancer center!!  Golfinggirl - I didn't get my bounce back week after round two - only had a couple good days but my reds never really fully recovered and I got this liver issue that can make you tired.   Only one day after treatment 3 and starting with a little neuropathy - ughhh - hopefully this doesn't get worse - 1st treatment was bad for neuropathy, 2nd was much better - don't want a repeat or worse of number 1. Longisland - so sorry for your loss! Everforward - sorry you are in town on my bad week and for short a time - let me know if you come back this way sometime. Hope everyone has minimal side effects and many good days!! ",
      "MessageIndex": 1516,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 9, 2014 08:29AM linda505 wrote: Hi Shellbell19 - Sorry that you had such a bad day yesterday - I had a bad meeting with my MO last friday - also not what I wanted to hear - but...  You are what we all call a Triple Positive - and we have a category on here just for us   http://community.breastcancer.org/forum/80/topic/... Please come join us - you will learn alot from the wonderful ladies over there - I am here with you as I am starting chemo this month also and am also triple positive so we will be on this journey together.   You are not alone and we DO understand how you feel and you can rant all you want and be scared and cry - my motto is survive and do it one day at a time and know that you are not alone",
      "MessageIndex": 88,
      "PostDate": "09/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 19, 2014 04:49AM linda505 wrote: Clarn - we all need to find our new normal.  It sucks and we have every right to mourn our loss of ourselves.  That is what is feels like sometimes to me, that a big part of me is gone.   My biggest emotional issues right now revolve around not knowing what to do about work.   I have a job that I loved but has gotten very stressful for the last 3 years due to the economy and has been a challenge just to keep the company going.   I don't think I can deal with that stress anymore but I  need a job as I need to be able to pay for insurance and household costs.   My hubby doesn't make enough for me not to work - I am the main bread winner.  Prior to BC the old me wouldn't even consider not working where I am - I have been there for 27 years ughh... Don't give up hope on a child Clarn - there is always that possibility and I hope you have a miracle in that area.   NOW - I am totally jealous of your Boler - I have seen them before online - where on earth did you find it????   My hubby and I want a camper and that is just as cute as can be!!",
      "MessageIndex": 1687,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 12, 2014 12:32PM linda505 wrote: Dang in Coldincanada - hope they find the cause of the infection and get you the heck out of there!!  You are right - you are in isolation but you are sharing a bathroom?  and with a boy??  I hope you are right - you are going to experience everything the first round then sail through the rest.  ",
      "MessageIndex": 120,
      "PostDate": "12/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 18, 2014 02:09PM linda505 wrote: Thanks keepthefaith - drop in on us anytime!  Helps to hear encouraging word when we are all just starting out",
      "MessageIndex": 222,
      "PostDate": "18/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 21, 2014 07:20PM linda505 wrote: Mompv - big cyber hugs your way!!  It is so hard to deal with all this stuff - I have good days and bad days - and  sometimes I just cry and I don't even know what I am crying about.  Sometimes I feel so alone as no one around me really understands how I feel - then I come in here and read a post from someone having the same feelings and then I know I am not alone and you are not alone.  Let us know what your surgery will be and join the Month of surgery thread - it was priceless to me to be able to talk about my surgery with people going through the same thing.  ",
      "MessageIndex": 289,
      "PostDate": "21/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 30, 2014 07:29AM linda505 wrote: Hey everforward - hope your dark place is brightening.  How is your RBC count holding up?  Mine seems to stair step down with every treatment.  My #4 is tomorrow.  So not looking forward to the SE after this round.  SE weren't real bad after 3 but the fatigue is getting really bad.  I just have not energy and the days that I do it is short lived - can function for a few hours then I am just exhausted. Welcome back Footballnut - sounds like you had a good time!!  I haven't gained any weight on TCH - I weight basically the same as when I started chemo.  The energy thing is my longest lasting SE but I am sure that is caused by the RBC counts which should rebound after chemo is done and I am not sure which is the culprit - the carboplatin or the taxotere or both.  I really don't think you should worry too much about the taxotere and you are only getting it a short time right?  ",
      "MessageIndex": 1863,
      "PostDate": "30/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 30, 2014 04:34PM linda505 wrote: Love the pics jbokland!!  I had my last fill with my PS today - one phase done!  I wore my head bling today that I got from jbokland at sassyhead.com.   The girls at the PS's office took pics and wrote down the website.  My PS was fascinated and asked if he could touch it LOL - gotta love him.  Anyway here I am before I went to his office this morning and just got home from going out to dinner and this is all I wore on my head - it was very liberating!!! ",
      "MessageIndex": 1869,
      "PostDate": "30/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 2, 2014 10:03AM linda505 wrote: well day one after treatment 4 - and didn't go to work today - just very tired and feeling icky - I usually feel ok on the first day but not today and has made me weepy - but this is my last steriod day and they seem to make me weepy too.  ughhhh - I really hate all this.   swissmiss - I was the one about the wicking tops from walmart - they are life savers!! specialK is who told me about them from my triple positive group.  Again - anyone who gets intense night sweats that wake you up and make you freeze please go to walmart and look for the wicking Danskins tops and shorts.  They move the moisture away from your body to the outside of the top where it evaporates so you never feel wet and cold.   Hope you have minimal SE's and can enjoy the 4th!   Hope everyone else is doing as good as can be - all we can do is put one foot in front of the other each day and keep each other in our thoughts and prayers!  I am so glad I found this site - I would be so lost if I hadn't.",
      "MessageIndex": 1894,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 2, 2014 12:43PM linda505 wrote: thanks for that article Longisland - glad she is finally saying that the treatments weren't a piece of cake - she made it seem like getting chemo was no biggie when she was on TV which I think hurt women that are going through this as it makes us look like wimps LOL.  I just wish that when people with public voices get struck with something like this that they use that opportunity to really tell it like it is  - don't sugar coat it - be real like we are here.   Now we have Joan Lunden who has come out with the fact that she has bc and is getting chemo.  She says she has the aggressive kind but she never says what kind, stage etc nor what kind of chemo.  I know these things are personal but if I had a opportunity I would be telling it all - the good the bad and the ugly.   ",
      "MessageIndex": 1901,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 28, 2014 06:22PM linda505 wrote: footballnut - you look so darn cute!!  Ugh on the chest pain - maybe reflux or maybe a little anxiety?  I know I am anxious and having a little weird reaction to the steriods that my MO's office hasn't seen before - so I am taking benerdry with my steriods lol.  Thanks all for all the positive thoughts - hope I have a pocketful of sisters tomorrow at chemo.",
      "MessageIndex": 443,
      "PostDate": "28/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 1, 2014 12:24PM linda505 wrote: Krish - welcome to the site - i hope these wonderful women will help you with dealing with this as they have helped me in my short time here.  It is so wonderful to have a place to come and say exactly what we feel like and not be judged and to get ideas and advice and encouragement.  I would be so lost without this place.   To all my sisters having SE and issues - these will pass and we will overcome!! Cause we fight like girls!",
      "MessageIndex": 534,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 1, 2014 04:06PM linda505 wrote: yes Sharon - we were supposed to go to Las Vegas for our one year anniversary in August - it makes me sad not to be going - but oh well - there is always next year",
      "MessageIndex": 544,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 5, 2014 03:44PM linda505 wrote: Hey MommyQ - I had a fill the day before my TCH  - so I have the T and the C of what you had on the 29th and over the next couple of days after the chemo my TE's got less comfortable then  they were right after the fill.  It feels like my muscles contracted a bit due to chemo.  No fever here but lots of fatigue and general achiness the first 3-4 days.  Still tired on day 6 but I can manage about 1/2 of work - I am trying to talk a walk every morning and although I don't feel like doing it when I do it I seem to have more energy afterwards.  I have noticed a little vision issues also - It seems like my right eye will not focus as well as it did - but it comes and goes and I think it is worse when I am tired. Since you are running a low grade temp - I would put a call into your MO's office and see if you need a little antibiotic or something.  Did you have the neupogen shot?",
      "MessageIndex": 626,
      "PostDate": "05/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 6, 2014 07:26AM linda505 wrote: Hi Krish - I would never tell someone not to get a 2nd opinion if they felt they wanted one - I did get one for my chemo regime and it changed based on that opinion.  I am not a doctor but what she has been prescribed sounds pretty much in line with what I have seen here from others with similar diagnosis and it is GREAT news for her not to have to do chemo.  That Ki 67 5%, i believe means that they perdict she has a very low chance of reoccurence and realize that chemo is always an option if that does happen.  If you will find comfort and she will find comfort in a 2nd - then just do it.  I am very happy for her.",
      "MessageIndex": 643,
      "PostDate": "06/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 23, 2014 03:08PM linda505 wrote: Longisland!!! woo hoo - hope the dark place doesn't last long!!!  congrats!! And wow nice way to hang on to the hair!! Swissmiss - ughh on the AC - I know I couldn't take it right now if mine went out!!  I would have to go stay with friends or family.",
      "MessageIndex": 2264,
      "PostDate": "23/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 25, 2014 03:51AM linda505 wrote: mmtagirl - 10 g 3 times a day on the lglutamine.   I used juice - just a small amount mixed it in and downed it.  I did it the day before chemo and for the next week.   If I started feeling any tingling or numbness any other time - I would do it for more days then.  I think some did it every day but once my dose was reduced on my chemo the neuropathy basically stopped for me anyway.  ",
      "MessageIndex": 2306,
      "PostDate": "25/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 14, 2014 06:53AM linda505 wrote: Footballnut - I have a convertible!!! Maybe will will still be hairless enough in December to enjoy it LOL.  But I do NOT allow Saints garb in my car so leave the jersey at home LOL. Everforward - may the fleas of a thousand camels rest in the armpits of the jerk that took your wallet.   Started losing hair last night - not chunks but many strands - think it is buzz time tonight - will post a pic when done.   Developed the Taxotere eye twitch.  i feel like Inspector Dreyfus in \"the return of the pink panther\" when Clouseaus was driving him insane LOL. Looking forward to a good week before next treatment and hoping for minimal SE effects for all when we have them - and many free days!!",
      "MessageIndex": 823,
      "PostDate": "14/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 14, 2014 05:40PM linda505 wrote: Hey all - I am Buzzed and found a 2nd head under my hair LOL ",
      "MessageIndex": 844,
      "PostDate": "14/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 29, 2014 02:46PM linda505 wrote: Don't try to compare yourselves to Footballnut - she is a super hero and has powers that we mere mortals can't even dream of LOL",
      "MessageIndex": 2359,
      "PostDate": "29/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 18, 2014 06:52AM linda505 wrote: Longisland and mmtagirl - we will be sitting together on Tuesday - but me only for round two.  I am doing the same - living it up this weekend lol - had lunch at the beach yesterday and actually drank a beer LOL - haven't had a drink since I found the first lump in January.  It is nice to have some SE free days to enjoy life but it really kind of makes me dread next week even more - oh well it will pass right?   LovebeingNana - you rock that look!!! Makelemonade - thought my leg hair was done growing and noticed yesterday that I had growth on them again - ughhh - took away my silver lining LOL.   Anyone that is having the night sweats and waking up drenched - or it you develope them from either the chemo or hormone theraphy if you gotta have it - I want to pass on this hint that specialk gave me - wicking PJ's.  I just bought some wicking danskins at walmart - about 12 bucks for a top and short - what a difference - I don't wake up due to my sweats anyone as it keeps me dry and I don't get that freeze feel.   ",
      "MessageIndex": 909,
      "PostDate": "18/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Aug 14, 2014 01:21PM linda505 wrote: I think a common misconception of who gets breast cancer is that more of us have the genes that make us more susceptible.  Only about 10% of the women diagnosed with breast cancer are thought to be hereditary.  I thought the same way - why did I get it - until I realized that I am in the 90 %.  The reason that so much is discussed about the brca 1 and 2 genes is that if you have those genes then the odds of you getting breast cancer is 50% and up. I know I would like to know why me - but it seems that this disease is an equal opportunity disease.  ",
      "MessageIndex": 2497,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 22, 2014 02:00PM linda505 wrote: Mommom - I email the pictures to myself from my phone - I have a smart phone or I connect my phone to my computer with a usb and download the pictures - once they are on my computer I just click the little box picture thing in the menu bar above the box that you type in and select where to get the picture from and it puts it on here",
      "MessageIndex": 1048,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Aug 15, 2014 06:06AM linda505 wrote: Timbuktu - any chance you can get a different MO?  You really don't need the kind of stress this doc is putting you through!!.   My GP said that everyone has cancer cells in their body and that there is some kind of trigger that sets them off in some people.  Viruses have been suspect, chemical exposure have been suspect and genetics is definitely suspect among other things.  I believe it is mostly environmental toxins.  I was stationed at Ft McClellan Alabama for basic training.  It is now considered one of the dirtiest places on earth.  Monsanto made the town of Anniston one of their dumping grounds.  There is a fund to provide for care for the people of Anniston by Monsanto for all the cancers that have come out of that area but it does not provide for the soldiers stationed there.  Our government refuses to acknowledge that this is an issue cause then they would have to provide the healthcare.  Ft McClennan was a testing ground for alot of chemical agents including agent orange and worse.   I got really sick when I was there in the late 70's - an unknown virus.  I think that may be my trigger.   But on the other hand I have a friend with BC - she has always been the most health conscience person I know - was eating organic when most didn't even know what that meant, has always been in shape, and no one in her family has ever had it.  When she was diagnosed she was very angry.  She kept telling me that she didn't \"deserve\" it.  This was before I had it.  She stayed angry for about 6 months - she finally accepted it as just bad luck. If they could figure out the triggers for cancer then they could find a cure.  I really think they are starting to get there as they are developing more and more gene therapy drugs that turn triggers off.  We can sure hope. On a whole other subject - I am awaiting a bone scan test.  My alk phos continues to rise even after chemo has been stopped - over 6 weeks ago.  Initially the MO thought it was chemo caused and he still mostly believes that but I also have a nagging back pain since the middle of May so with both of those happening he is a bit concerned with mets to my spine - uggghhh.  Had the test yesterday but will not find out the results until next week.  Keep me in your thoughts and prayers. ",
      "MessageIndex": 2507,
      "PostDate": "15/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 23, 2014 08:53AM linda505 wrote: Ok - clarm - you rock the bald look!!  but...I am sure I am not the only one noticing the placement in the picture of the house decor - I think you are sporting one really cool spike do!!! ",
      "MessageIndex": 1066,
      "PostDate": "23/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Aug 18, 2014 09:36AM linda505 wrote: Thanks all  - so relieved and I got scheduled for my exchange surgery today - will be on Sept 19th!!  MommyQ - scary stuff - hope you are feeling ok now!! timbuktu - make that decision and don't second guess yourself - you know you are making the best one for you!!",
      "MessageIndex": 2531,
      "PostDate": "18/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Aug 19, 2014 10:50AM linda505 wrote: Hey Jen, I had a little nausea after my BMX - gave me something for it and I was fine.  But as MommyQ says if you are prone to nausea - then ask for something before surgery and that will help.   In my opinion the BMX was WAY EASIER than chemo.  You have the surgery and you get a little better every day - you don't have to have it every three weeks lol -so you are always seeing improvement.  You will be fine - you are a super hero!",
      "MessageIndex": 2547,
      "PostDate": "19/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 25, 2014 07:34AM linda505 wrote: Hey Merg,  I am putting Coconut oil on my scalp - seems to make mine feel better.  I feel better today - ran a low grade fever on and off all day yesterday and that seems to have lifted so i think I am on my way back up again - hopefully.  Day 4 seems to be my worst day - at least for two cycles.  If I can just feel 50% for the next couple days that will be better.  ",
      "MessageIndex": 1110,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 25, 2014 10:41AM linda505 wrote: Hey Boobie - go without makeup and I think yes take your daughter - she will learn some tips on applying makeup that I never knew.  Hope you have fun!!",
      "MessageIndex": 1119,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Aug 27, 2014 11:03AM linda505 wrote: Hey Sandra - I understand your stress and I think we all go through it at different times and for different reasons.   I think all we can do is trust that the treatment worked and wait for symptoms to have anything checked out.  That is what my MO has said - that he will explore and do tests as deemed appropriate on symptoms.  I also know that we have to give our bodies time to heal from the chemo so we know if the issues we are having are SE's or something else.  It is scary but you have to go back to prior to BC - if you had a pain or a headache or something we didn't immediately think we were dying - we have to find a place where we can live without constant fear and anxiety.  We will get there - we just gotta be patient.",
      "MessageIndex": 2608,
      "PostDate": "27/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Sep 2, 2014 06:20PM linda505 wrote: Congrats Mscaruso!!!    Footballnut is doing good - i think tomorrow is her last taxol.  she is very busy planning two fundraising events for breast cancer with her band!!  She is a super hero lol.     I have my herceptin treatment today  #7  - I am now 9 weeks PFC and feeling pretty good - RBC and HGB finally back to normal so the muscles have stopped burning.  Stomach is still a little po'd but getting much better and my fuzz is getting more visible  Here it is today  ",
      "MessageIndex": 2645,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Sep 20, 2014 06:44AM linda505 wrote: Mikishelly - I remember you and glad you got a chance to post and say hi.  I hope you are doing well and could care less how often anyone posts - some peeps post alot and some now and then to update or ask a question.  I hope you do feel welcome here cause you are!! Veraann - I had IDC in both breast that were not seen on a mammogram.  That is why I did a BMX - I knew I couldn't trust mammos to find it.  My BS told me the same - that I had about the same odds or recurrence with a lumpectomy or BMX and she would do either one.  I would have most likely had to have radiation with the lumpectomy.  I asked her if she was the one with BC in both breasts and ones that seem to hide what would she do and she said BMX - so that is what I did.  Recovery and the experience is different for everyone.  I stayed out of work for a month because I had some healing issues.  I think had I not had those issues I could have done a desk job after two weeks or so.  My pain was very minimal - I only took pain meds for two days.  The TE's were uncomfortable at times but for me not really painful.  The first couple of weeks after the BMX you are very restricted in your movement due to internal healing so you need to have help at times.   I was pretty self sufficient by the 2nd week but there were things I couldn't do.  When you have made your decision on what you are going to do go to the surgery thread for the month or two before yours and read the experiences and ideas.  The March group was what I was in and Sandra was extremely helpful.   Also feel free to ask me about anything you are concerned about.  I had my exchange surgery yesterday and so happy to have one more part of this journey completed.   ",
      "MessageIndex": 2763,
      "PostDate": "20/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Sep 23, 2014 01:15PM linda505 wrote: Hey Cold - good to see you and hear that things on their way up.   Sounds like you and I have the same hair do lol - below is a pic of m with my \"growth\" on my daughter's 30th birthday last week.  I have lashes and my brows really need to be waxed.  They came back 2rd only to my CHIN HAIR - which would make me extremely happy if it was on top of my head!! lol, and my leg hair which seems to be in a rapid growth pattern - ughhh. ",
      "MessageIndex": 2779,
      "PostDate": "23/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Oct 17, 2014 05:26PM linda505 wrote: Timbuktu - I think we are hair twins - you described it perfectly - the top does feel like fur lol - I couldn't quite describe it and the sides and back feel like hair - it is very odd LOL. Jamieh -you look great!!  Just beautiful!! Mscaruso - good luck and hope you have a great exchange surgery and a quick recovery.   You will enjoy being on the squishy side of this adventure and it will give you a little more closure - at least it will put one more hurdle behind you - but I totally understand the panic - had it too about a week before mine.  Don't know why - but I think it happens to many - some have it after exchange.",
      "MessageIndex": 2865,
      "PostDate": "17/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 10, 2014 02:59AM linda505 wrote: Good morning April sisters!  Today is round three for me and of course the dang steroids have kicked in and so here I am wide awake at 2:45 am lol.   Appt is at 9:15 am.   I hate starting off exhausted.    MMTAgirl - I got alot of scarves at Goodwill and also quite a few at walmart - they were on clearance for 2 bucks a piece.  They also have bandana's there for a buck a piece - many colors.  I wear my wig now and then - always bald at home but mostly scarves or hats when I am just out and about.  I have gotten stopped and asked what kind of cancer and how am I and may I pray for you - it doesn't bother me - it is a part of me now - it isn't who I am but it is changing me.  I have had some small children look at me a laugh - I laugh back - haven't flipped the wig to show them what is under it yet - afraid to traumatize them lol. Football nut - taxol is a cousin to taxotere - I believe they basically work the same and may have similar side effects.   I am doing taxotere and herceptin with my carboplatin right now.  I am not sure what SE come from what - but I really haven't had any serious pain - mostly some muscle aches the first few days and this dull back pain.  I think you will do fine with SE because I believe the taxotere isn't as bad as the FEC and you have done great on that.  From what I have read - the SE are very minimal from the Herceptin - the biggest being heart concerns  but we will be monitored for those issues.",
      "MessageIndex": 1455,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 10, 2014 05:14PM linda505 wrote: Deec and jaimeh your wigs look GREAT - would never think wig! Well treatment 3 is in the books - long day at the center - arrive at 9 am and leave at 230 ughh.  Not looking forward to the next few weeks and the dementor visits!!",
      "MessageIndex": 1483,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 13, 2014 04:45AM linda505 wrote: High blood sugar is relative.  If the test is done and not a fasting test - then normal for a none diabetic could be anywhere between 80 and 120 ish depending on how long it was before the test that you ate.  A non diabetic rarely will get above 120 and will quickly return to normal, no matter what they have eaten and when - unless you are taking steroids - then you can throw that out the window.   In my case, I am a diet controlled diabetic, I don't take any meds - my normal fasting sugar - first thing in the morning is 90 ish.  On my none steroids days if they test my sugar, whether I am fasting or not, I am usually still under 100 as I eat low carb, use no sugar and therefore rarely allow my sugar to get above 120.  On steroid days - even if I am fasting - it has been as high as 200.  I can feel it when I am that high - but I return back to my normal levels a day or two after I am done with the steroids.   Chemo can cause temporary diabetes and can also cause permanent diabetes in those who may have been pre-diabetic prior to chemo.   If you are interested in testing your sugar, - Walmart has an inexpensive tester and inexpensive strips that work quite well - It is there Relion brand.  But in general, unless you are going really high I wouldn't worry about this during chemo but I would monitor it after chemo to make sure that you return to normal.  ",
      "MessageIndex": 1556,
      "PostDate": "13/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 13, 2014 05:58AM linda505 wrote: Thanks Sharon for the well wishes.  I considered going on metformin during treatment but decided I wanted to see how out of control it got and for how long - I really was trying to avoid going on diabetes meds prior to BC - but I may end up on them anyway - there are some studies that metformin MAY be beneficial in preventing a recurrence- but last I read on it wasn't that hopeful that it was actually helping.  I am going to try to see my endo next week and have her run an A1C and a few other blood tests and talk to her about the met and see what she thinks.",
      "MessageIndex": 1558,
      "PostDate": "13/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 3, 2014 10:03AM linda505 wrote: I will be meeting with my MO on Friday to find out what I will be doing...and although I am looking forward to getting this going I know that I will leave his office sad.  I had one appt with him already - before my surgery and it was the ONLY time that I cried at a doctor's office since this all started.  I don't know why - but as soon as the nurse started to take my blood my eyes teared up and I was choked up the whole time I was there.  Something about that place made everything so much more real and so much scarier.   Here is my philosophy at this point.  I will be as strong as I can - I will show up and when I need to I am gonna cry and cry hard.  I had to have that discussion with my daughter last night - she is 28 and everytime I am upset by this BC she says \"you are strong - keep positive etc etc\"  I finally told her that I know she means well but there are only a few people that I feel like I can be weak around - her and my hubby and that on those days at that time please don't say \"be strong, stay positive\"  just say \"I know it feels like shit and I love you and cry if you need to\"   I hope she understood.",
      "MessageIndex": 38,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 7, 2014 05:58AM linda505 wrote: All of you starting today - hope all goes well -Wampuscat - willl be in your footsteps on the 18th - so will be reading yours posts for hints. ChrissyLB - I agree with you in theory on not allowing your insurance company to dictate your treatment - I feel the same way but am not in a position to pay myself.  I wish you luck in getting switched and if you do - let us know how you did that!!",
      "MessageIndex": 73,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 8, 2014 09:35AM linda505 wrote: Hi all - are any of you taking emend?  If so can I ask what your copay is and if you take this just for the AC or with the taxol also?",
      "MessageIndex": 82,
      "PostDate": "08/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Nov 21, 2014 07:32AM linda505 wrote: Everforward - if the people asking you are people you don't want to talk to tell them you had lice. LOL. Seriously - you could say that you always wondered how you would look with that short of hair so you decided to just try it. Or tell them that you are supporting someone who has cancer or that you did it as a fundraising thing. But I think I would go with \"I just wanted to see how it would look and hair grows back\" Timbuktu - I don't wear a hat or anything out and I get some serious stares LOL - I try to comb it down with a hair dryer after I shower and it still goes straight up - that picture is after I tried to tame it. And on the crown it is one huge swirl. My daughter's friend says it looks like a hurricane up there. So weird...",
      "MessageIndex": 2919,
      "PostDate": "21/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 8, 2014 09:41AM linda505 wrote: Thanks wampuscat - appreciate your answer - looks like we have the same treatment except for the herceptin",
      "MessageIndex": 84,
      "PostDate": "08/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 10, 2014 06:27AM linda505 wrote: Hi Sharon, I am in the same spot as you - feel like I am missing information.  I called about that yesterday and they said that my PA will spend time with me the morning I start going over everything.  What part of Florida are you in and where are you doing treatments?  I am in Venice and going to Florida Cancer Specialists.",
      "MessageIndex": 102,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 15, 2014 04:09AM linda505 wrote: ColdinCanada - so glad that you are home and away from the stinky boy!!  Did they let you keep the big girl potty chair?  So glad you kept your sense of humor through that and finally got a good nurse to listen to you.  I think that is the worst thing when we know our bodies and basically know what is going on but no one wants to listen. Footballnut my friend - if we end up with the same start date I am gonna get your telephone number and text you stupid stuff all day long - we are gonna beat this together. Swissmiss and sunshine - hope your rough starts get much better.  I feel like such a heal getting a second opinion on this - I REALLY like my MO but there is this place in my mind that keeps saying - something isn't right about this and I have to deal with that place or it will drive me crazy.  My MO called me (himself) not the nurse or PA after he got the message about the delay due to my healing issue and was SO SWEET - he was concerned that I felt up to getting the port and told me if I needed to to delay that too - I couldn't bring myself to tell him that I am getting a second opinion.  I feel bad - ughhh",
      "MessageIndex": 158,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 15, 2014 11:20AM linda505 wrote: Hi Lovebeingnana, I hear ya!!  You are teary cause you are sad and scared and we have every reason to be sad and scared - I have very teary days and then have a good day and I haven't started chemo yet either.  we have been through alot already but know our road is not short.  You aren't alone - I hear ya and I get you",
      "MessageIndex": 174,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 18, 2014 09:11AM linda505 wrote: Hope my April Chemo sisters are doing well!!  My chemo now starts on april 29th due to my healing issue - which is ALOT better.  Told my MO that I was getting a 2nd opinion next week on the chemo regime and he was VERY HAPPY and I was so nervous to have that conversation with him.  He said he was torn between two plans and have Moffitt Cancer Centers recommendation was great.  I really like him ",
      "MessageIndex": 211,
      "PostDate": "18/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 18, 2014 12:42PM linda505 wrote: lakegirl - that is the shirt I want when I am done with treatment.  ",
      "MessageIndex": 218,
      "PostDate": "18/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 22, 2014 04:11PM linda505 wrote: Thanks for the update makelemonade - one week behind you on the AC so will be watching for your reports.",
      "MessageIndex": 313,
      "PostDate": "22/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Apr 30, 2014 12:39PM linda505 wrote: I have posted everything about my breast cancer on my FB.  First of all - I think I know things now that I want all my friends to know about BC that they may not know - so I kind of look at it as a public service.  Second, I love the support and thoughtful gestures and the strength that my friends and family give me and thirdly and I think most important it gives me a place to express my thoughts and fears.  Kind of like this place but to peeps who knew me pre BC.  We didn't do anything wrong to get this - nothing to be ashamed up - we are strong sisters and in a battle of our lives and I think we should share - HOWEVER - I do understand that some people are not comfortable doing this and I AGREE it is a personal decision.  Love you all!!",
      "MessageIndex": 502,
      "PostDate": "30/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 16, 2014 05:58PM linda505 wrote: Hey all, FInally got a call from my MO about my CT results and Hep blood tests. CT was clear - nothing on liver and abdominal cavity looks fine. Bloods test neg for all types of hepatitis. So he is almost 100 percent certain that my elevated liver tests are just chemo related. Relieved!! Thanks for all your well wishes!!",
      "MessageIndex": 1614,
      "PostDate": "16/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 1, 2014 01:26PM linda505 wrote: You hang in there makelemonade!!  They will get this dose figured out!",
      "MessageIndex": 539,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 2, 2014 06:41AM linda505 wrote: Hi Chinamum and welcome although I am sure this isn't a place you want to be - but everyone here is so helpful that I am sure someone will be along some that has had the same reaction and can shed some light on it.  First of all - if you haven't yet call you MO and let them know about the rash.  One thing I was warned about from the nurses giving me the treatment that sunlight could cause a rash easily for some on chemo - to make sure to wear sunblock all the time - even when just driving.  ",
      "MessageIndex": 553,
      "PostDate": "02/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 18, 2014 08:04PM linda505 wrote: Longisland - Love it!!!!   Strange how our chemo brains work and where we now find humor and irony.",
      "MessageIndex": 1677,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 6, 2014 05:08AM linda505 wrote: Autocorrect drives me nuts but also makes me laugh.  My husband's name is tony and my phone insists on calling him tiny and HE IS NOT TINY lol.  But this is now his name - why fight it?...  Also prior to BC I don't think I had ever texted to someone and used the f'ing word - my phone does not allow that - it is ducking and I really only say that to my daughter and she absolutely knows what I mean.  It is worse when I am tired cause I don't even realize what it has changed and I go back and wonder how anyone even understood my conversation.  My daughter has posted a couple of our conversations on FB - with my ok. I feel good this am - a little achy but otherwise good.  I have my CBC today - see how my blood is behaving.  Gonna go to work this am for a bit too - I stay until I am tired. Will be thinking of you tomorrow SpecialK!  Hope everyone else is well - Thanks all for all the advice and support",
      "MessageIndex": 640,
      "PostDate": "06/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 1, 2014 04:38PM linda505 wrote: Treatment #4 in the books - two more to go.  MO reduced my taxotere since my liver enzymes are still going up.  I told him that if they continue to rise after this reduction that we may call it quits after this one - he says he agrees to an extent as he feels that the most important things I can do is the surgery, which I have done, and the herceptin.  He also is skipping the neulasta shot this go around as my WBC's got very high with the last one and really didn't ever come down to normal so he isn't sure I need it - he said if I start to go low that he will give me a few neupogen shots.  Here I am at tx 4 - wishing you all lots of SE free days!! ",
      "MessageIndex": 1881,
      "PostDate": "01/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 2, 2014 10:38AM linda505 wrote: No Timbuktu - not me - which regime are you on?  And do I remember that you have previously had chemo for another type of cancer or is this a recurrence?   I am contemplating only doing the 4 I have done as my liver enzymes keep going up up up and that scares me - my oncologist will abide with my decision but would prefer I do all six though.    Are you also going to be doing rads?",
      "MessageIndex": 1896,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 2, 2014 12:44PM linda505 wrote: Great picture MommyQ!!",
      "MessageIndex": 1902,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 13, 2014 11:18AM linda505 wrote: Blood test today and all was normal on the RBC and WBC end - feeling pretty good - am at work and will try to stay around for awhile today and get some things done.  Hope you all have a great SE free day.",
      "MessageIndex": 785,
      "PostDate": "13/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 3, 2014 09:40AM linda505 wrote: I agree the article was good about how she dealt with her BC treatment and why work was important to her.  And I applaud her for now telling like it was and reaching out to help others.  Believe me I have no ill feeling for ANYONE with this horrible disease and we all do what we need to do to get through it.  My only concern is that alot of people saw her on TV all the time looking \"normal\"  acting \"normal\"  not talking about the difficulty of all of this and few will read the article.  To me this makes it difficult on all us that are trying to maintain a normal life but needing understanding from our employers, family and friends that everything is not \"normal\" and often we don't feel good and sometimes we can't work, clean, cook, or even stay awake.  I try to stay positive on my FB posts but I also tell it like it is - as we do in here.  I want people who haven't experienced this to understand what a journey this is and I only have 1900 friends on facebook LOL (long story on how I ended up with that many friends) so that is all I can reach - but she and other public personalities have the ability to reach out to millions to let people know what a journey this is and just how difficult it can get.  That is my only complaint - I wish that someone that has that kind of following would just put it all out there.  The ups and the downs - the great things we learn about compassion and friends and family, the deep recesses of our souls where we find courage and strength, the days that all we can do is put one foot in front of the other and hope not to fall, the fact that sometimes everything tastes like cardboard or metal or plastic, and the days that all we can do is try not to cry and can't get off the couch.  It doesn't have to be all about the negatives - it can be a good mix - just like our journey is.  btw - I did send Joan Lundin a message through her blog and asked her to please look at this forum and see what she can gleam from it that she might pass on with her public voice.  ",
      "MessageIndex": 1916,
      "PostDate": "03/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 13, 2014 05:57PM linda505 wrote: Ddkath and babygoose - welcome to the club that none of us wanted to join but we are  ever so grateful to have found this forum.  People here are great and there are lots of ladies around to jump in and help that have been on the forum for many years and stay around to help us newbies find out way.    Things that I have found very useful so far- biotine mouthwash, toothpaste and gel.  I like the gel cause I can carry it around with me and if my mouth starts feeling dry I use it.   Disposable wipes for the bathroom and portable ones to carry with you.  Lip Balm - my lips were dry - I got an all natural beeswax one at the health food store.   I had very bad constipation after round one for 5 days - so stool softner and miralax are a must for me. Un-scented hand and body lotion - my hands got really dry.   i also have b6, b12 and Lglutimane to hopefully help with neuropathy.  I had neuropathy in my hands and feet the first 5 days after my first treatment and this scares me more than anything else- you need to talk to your MO before you take these and make sure it is ok with them.    I also iced my hands and feet for the taxotere part of my treatment to hopefully help with the nail and neuropathy.  I also sucked on ice during my infusion to help with mouth sores. Makelemonade - I have had my last blood test before my 2nd treatment today (other than the one that will be that morning) and all my counts were good.  They were good the week after treatment too.  I am pretty sure I hit nadir - at least RBC nadir last friday = as if felt like the life was sucked out of me - I ate spinach and beets and meat and peanut butter lol and stayed in all weekend and all was good today.     Head is itchy today and am seeing more hairs tonight - think I may have hubby buzz me either tonight or in the am.",
      "MessageIndex": 801,
      "PostDate": "13/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 3, 2014 03:28PM linda505 wrote: Great picture golfinggirl!! Glad your SE are less evil ColdinCanada - and this fatigue is overwhelming.   It sets in earlier and last longer each cycle for me also and I don't seem to get as many nice days at the end either.  Oh well what can we do but do it!! I just got back from getting fluids - although I am able to drink plenty I got them after the last treatment and they really seemed to help with the first 4 days of blah so I am hoping they do the trick again.  Only thing is now I feel bloated LOL.  oh well... A Belated Happy Canada Day to my friends from the great white north and Happy 4th of July to my US comrades.  Mine will be quietly celebrated on my couch or in my bed but at least my hubby is off and I will not be alone.    Have to tell you a very sweet story.  We have season tickets to the Tampa Bay Bucs and my account manager contacted me about a month ago to check to make sure I was getting her emails and invites to all the off season stuff cause we hadn't attended anything - it is only the 2nd year we had had tickets.   I told her what was going on and today I rec'd a package from her and the Bucs with a very nice hand written get well message signed by Joel Glazer - one of the owners and my rep and a Bucs bandanna for my bald head.    There are nice people in this world!",
      "MessageIndex": 1924,
      "PostDate": "03/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 15, 2014 06:07PM linda505 wrote: Sharon!! love it!!",
      "MessageIndex": 874,
      "PostDate": "15/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 16, 2014 07:41AM linda505 wrote: Thanks for the suggestions Janet - will try the first one - the 2nd has too much sugar from the fruits for me due to diabetes.   Here is me with my free wig that I got from the ACS  FOOBS   check Wig   check  Ready for the day    Check  ",
      "MessageIndex": 885,
      "PostDate": "16/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 17, 2014 06:54AM linda505 wrote: Cold I love that picture of you and you have such a great infectious smile!!!  I wanna be your friend  Love that scarf too - such nice long tails on it!",
      "MessageIndex": 900,
      "PostDate": "17/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 19, 2014 10:39AM linda505 wrote: Add me to the Tuesday chair - 2nd TCH - so not looking forward to it - had such a good 3rd week - felt close to normal and now gotta start it again. Oh well ...Just got home from my PS - got a 100 CC fill and no pain from that yet - so YAY!!  Got my LGFG class this afternoon - we shall see how that is.   ",
      "MessageIndex": 936,
      "PostDate": "19/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 20, 2014 04:28AM linda505 wrote: Hi Rosemamma - welcome to the forum - sorry that you are going through this yet again.  You are going to be getting Herceptin for the HER2 part of your BC and that is a long program - a years worth of IV's once every three weeks so the port will become your best friend.  The surgery to put the port in is minimal with just some discomfort for a few days and I do not feel anything when they access it for blood or give me my treatments.   There is a topic on here on cold caps - they are being used to try to save your hair.  I know they are expensive and I am not sure that insurance covers them.  Here is a link to that topic - someone there can help you with questions.  You will also have to ask your MO if he will allow you to use them - some do and some do not.   https://community.breastcancer.org/forum/6/topic/...",
      "MessageIndex": 956,
      "PostDate": "20/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 9, 2014 03:44PM linda505 wrote: Omg timbuktu - that is just crazy about what the internist said - ummmm - is there any chemo without SE's??  I don't think so - maybe some are minimal but I mean it is poison for crying out loud!!  Holy Moly... Some doctors just see patients as numbers - how many in and out in a day - I don't think they started like that but I have had too many like that in my life.  It is so disappointing.  I don't take that treatment anymore - I now speak up when I don't think they are giving me the appropriate time or attention.  Hope your heart is ok - I had to wear one of those monitors for a week a couple of years ago - drove me crazy. sharon - unbelievable and how rude - I really can't complain about my MO or his PA - they are actually both good about listening and spending a good amount of time with me.... and I LOVE my plastic surgeon - seeing him is like seeing a friend and I do feel he cares.  thanks for all your support - just such an emotional and physically draining journey we are on.  ",
      "MessageIndex": 2054,
      "PostDate": "09/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 20, 2014 08:06PM linda505 wrote: Wow lots of activity in here today - 2nd treatment was long but uneventful.  Tired now - hope I can sleep tonight - ughh I hate the steroids.  I was in the chair for 5 hours - longer than my first treatment which was about 4 hours - no one can figure out what longer?  lol - oh well.  get my shot tomorrow even though all the bloodwork has been and was good.   Hope everyone elses was \"easy peasy\" too and good luck on minimal SE to all!!  picture of chemo 2 with my LGFB wig!!  and my bushy REAL eyebrows LOL ",
      "MessageIndex": 993,
      "PostDate": "20/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 25, 2014 09:44AM linda505 wrote: good news mompv!!!",
      "MessageIndex": 1117,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 28, 2014 06:05AM linda505 wrote: Good morning April sisters. Timbuktu - in your pocket today - sending positive thoughts on the scan today - clear clear clear. Brigadoon - I love my port and make them use it for blood draws and tx - so much less pain and less invasive to me.   Swissmiss - good for you on getting a new MO - hopefully you find one that you feel comfortable with and have confidence in.   Feeling better this am - went to MO's yesterday - RBC and HGB were both low - but not horrible - but that explains the extra fatigue.  Bad news is that I have a UTI or start of a kidney infection.  I was pretty sure that was going on but hard to distinguish SE from other symptoms now a days.   I don't think I have had a UTI for over 10 years.  They are sending it out for culture but MO prescribed bactrium for me - UMMMM - I am highly alergic to it - think emergency room can't breath allergic - told them that day one - should be in my charts but no LOL - so then he tries to give me CIPRO - had very bad reaction to that after taking it for one day a few years ago - told them all about that also - apparently also not in my charts - ughh.  Nurse then said well what does work for you for a UTI  - I said ummm - idk - haven't had one in so many years that I have no idea.  Lost a bit of confidence in my team yesterday over this.   I think that at times I am in a cancer factory - going to a cancer center - I watch people go in and out - so many in a day - i think it is sad.  The nurses are wonderful though - so caring - give you whatever time you need - really listen to you.  And I do like my MO - although I really think that he sees way to many people - I know he doesn't remember the details of my case from one appt to the next - although he does remember me as a person - he does reread my chart each time and rehashes everything.  But as in all things medical - we have to be our own champion and guardian in this.   Footballnut - that lady at your LGFB class  - what a jerk - can't believe that someone with BC could say that in a room of women with BC - and she couldn't be more wrong about her statement.  I mean how can a positive be a negaitve??? LMAO.     Anyway - you know and I know that we have a very  good prognosis - and we have magic herceptin too!!  No worries my friend. Wishing you all many SE free days ",
      "MessageIndex": 1194,
      "PostDate": "28/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 28, 2014 02:55PM linda505 wrote: ahh the constipation/diarrhea battle.  This drives me crazy.  I always start with 4 days of constipation which I end up over treating I guess and end up with diarrhea - the first cycle it was really only about 48 hours of the D but this time I had it for 4 days - not really bad D - but there enough to prevent me from going out of the house for much time at all.  Not looking forward to this part getting worse with cycle 3.  I hate all the pills too - drives me crazy as I generally don't take pills.  Now with battling this UTI I am taking and antiboitic and wondering how that is going to mess with my digestion which just finally seemed to get back close to normal.  I too am getting alot of messages from friends on how bad chemo is for you and why am I doing it if they got all the cancer.  I know they have good intentions and just really care but don't they realize that I KNOW how bad chemo is LOL.  We live it.   I have written a paragraph about why I am doing chemo and i just copy and paste it back with the standard \"thanks for your concern\".    I am thankful that they care enough to write to me but it does get annoying. Sending all my wishes for SE free days ",
      "MessageIndex": 1215,
      "PostDate": "28/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "May 29, 2014 02:03PM linda505 wrote: Mompv - i think that decision is one that only you can make.  The only thing I would ask prior to choosing is \"what are the possible long term side effects from the two choices\".  I do know that that adrmycian can be hard on your heart so make sure that they do a echo or muga scan before you start if that is your choice.   Footballnut - yeah for one left on your first course.  I have six of this course - then 12 more herceptin after that.    Go Rangers!!! Clarm!! congrats!!  Feeling pretty good today!!! Hoping for SE free days for all!!",
      "MessageIndex": 1236,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Aug 7, 2014 12:47PM linda505 wrote: Funny - Tuesday went to dinner at a little diner and a lady and her husband came in - I had my baseball cap on and she walked up to me and said \"i had that hair cut two years ago - it gets better - hang in there\"  It meant alot.",
      "MessageIndex": 2434,
      "PostDate": "07/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Aug 17, 2014 01:20PM linda505 wrote: Hey all - thought I was going to have to wait until next week for results but that were posted on my site that the MO posts my info on and ALL CLEARS - NO METS!!!!!!  woo hoo so relieved - thank you all for all your positive thoughts and prayers!!! ",
      "MessageIndex": 2523,
      "PostDate": "17/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 12, 2014 12:30PM linda505 wrote: Smooth Move organic tea - bought mine at the grocery store - link shows you what the box looks like http://www.amazon.com/s/?ie=UTF8&keywords=smooth+m... Also read up to my post a couple of posts up about the accupressure points - that really helped me after my 2nd infusion.",
      "MessageIndex": 1541,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 18, 2014 05:22AM linda505 wrote: Hi Ricanbabe, Your treatment seems the norm for HER2+ type BC .   Do you know what your first course will be?  After that going to weekly taxol and weekly herceptin is used often.   I know there are people here who have used natural products and alternative meds and the choice to do that or not do chemo is totally a personal decision.  But you need to learn about your type of BC first.   HER2+ is an aggressive form of BC and luckily we have a target therapy to utilize.   Before you make any decisions get a couple opinions from doctors on your choices and what difference doing chemo and herceptin will make to your odds of reoccurence and/or survival.  Good luck.",
      "MessageIndex": 1657,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jun 26, 2014 03:33PM linda505 wrote: Howdy april sisters! Sharonde - your picture is great!!  I love your wigs!  I am with you - as I am in a retirement area also I don't seem to get the pity looks either.  I have gotten stopped twice - once in walmart, once in the grocery stores by people who simply asked \"How are you doing?\"  and it was a genuine question.  Then one asked me my first name and asked if she could pray for me.  I appreciate those that care.  I did have little kids laugh at me once when I accidentally went bald somewhere - but they were very young and I laughed with them.  For whatever reason none of what people I don't know think bothers me at all.  I may be getting the pity looks and not even notice them.  I have noticed that some \"friends\" seem scared to visit or call - it is like they don't know what to say.  Oh well - this too shall pass.   Ughh - treatment 4 is next Tuesday - that will make me 2/3rds done with chemo - wish it was the last one.  I am definitely over the chemo adventure.  SE were minimal with #3 - just the usual suspects - \"C\", stomach/bowel distress, taste issues (longer lasting and worse this round) and twitchy eyes and general twitches all over my body lol. The worst SE and the one that hasn't really subsided much is the fatigue. I know this is most likely gonna be worse after 4 and I am not sure how much work I can do - I am mentally and physically exhausted after a couple of hours. I got fluids the friday after the last treatment and that seemed to help with the SE's on days 4-6, so I am going to schedule that for next week also. I know I am drinking plenty of fluids but if it helps then why not?  Hope you are all doing as good as possible and I wish you all minimal SEs!!",
      "MessageIndex": 1832,
      "PostDate": "26/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 22, 2014 04:41PM linda505 wrote: Clarin - so sorry that you are having such a hard time - ughh - hope things make a turn for the good for you soon!! Well - my last chemo was three weeks ago - I managed 4 out of the 6 .  My liver enzymes climbed yet again last blood test and my MO and I agreed that I shouldn't do the last two.  Part of me is relieved and part of me is scared and nervous that I wasn't able to finish.  I will continue with my herceptin for the next nine months and will start taking Anastrozole for the next 5 years.  Now I wait for the enzymes to hopefully return to normal so I can schedule my exchange surgery and start looking for hair growth!!  I will be around and hope you all are on your way up. ",
      "MessageIndex": 2249,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 24, 2014 01:17PM linda505 wrote: Mscaruso - I would definitely get a port - I can't imagine getting stuck so many times for the next year and really I had a couple days of minimal discomfort from the surgery.",
      "MessageIndex": 2289,
      "PostDate": "24/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 27, 2014 07:28AM linda505 wrote: Hot flashes/sweats - hate them!!  Although they do seem to be less often now than they were.  I sleep in wicking danskins exercise shirts and shorts that I bought at walmart.  They really really help me - moves the moisture away from my body to the outside of the garment where it can dry without waking me.  SpecialK suggested wicking PJ's and the danskins is what I found that day at walmart and decided to get them and give them a try - they were about $12 for a set - I now own about 5 sets.  Tuesday it will be 4 weeks since my last chemo - my taste buds seem to be normal.  I still have stomach distress - indigestion etc.  Still extremely tired and muscles still burn and ache with very little exertion.  Hair on top of my head still none existent but I think the legs and chin hairs are returning - oh joy.  Still have twitches in random places in my body.  Mentally I am  depressed - worried about work, worried about starting the Ai's - worried about my liver function, worried I didn't do enough chemo, ugh.  I cry for no reason - went to see my GP on Friday - he is ordering a battery of blood tests including D and my A1C for my diabetes.  Talked to him about how I feel and he said lets get the results of all this and lets see how I can help you through this.  It was the first time I saw him since I went to him about the lump in January so we had a lot to talk about.  He is really good about suggesting supplements and vits etc to help with things.  I can take whatever he suggests to my MO and see what I can do.   makelemonade - I hope everything is ok with your breast and that it doesn't delay your schedule - it is so hard to face delays especially when you have plans.  I will keep you in my thoughts and prayers. FBN - glad that your SE's and minimal - rest as much as needed and don't be hard on yourself if you can't do some things.  I am going to try to take a small walk here in a bit and see how far I can go before the burn is too much - I really need to feel like I am not a 90 year old!!",
      "MessageIndex": 2326,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 27, 2014 01:18PM linda505 wrote: mmtagirl - the runny eyes are a SE of the taxotere.  It is actually cause your eyes are dry and they are over compensating by producing too many tears - make sure you tell your MO about this as it can, in rare cases, lead to a more serious eye condition - at least that is what I was told.  Mine seemed to fluctuate between being really watery and feeling very dry and I hate the twitches.  I also bought some fake eye lashes but haven't used them yet as I haven't had anywhere to go that I thought I needed them.  Do you know someone that has worn them in the past?  Or do you know a beautician?  I bought them and then thought - how in the heck am I going to put these on myself and then decided if I needed to I would ask my DH.  But then had dreams of eyelashes on my forehead LOL",
      "MessageIndex": 2330,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 29, 2014 02:56PM linda505 wrote: ddkath - Congrats!!!!",
      "MessageIndex": 2361,
      "PostDate": "29/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Jul 30, 2014 02:34PM linda505 wrote: Boobieprize - I am also a little over 4 weeks PFC and I also have muscle ache, fatigue and stomach issues (reflux, indigestion, gas) ughhh.  I keep waiting for my energy to come back but it hasn't yet.  I think we have a ways to go yet...",
      "MessageIndex": 2372,
      "PostDate": "30/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Aug 1, 2014 04:40PM linda505 wrote: So sorry makelemonade - I hate insurance issues - we have enough to deal with but then insurance issues on top of all of it can sometimes just push me over the edge.  I hope you find a facility and RO that you like!!  and soon!  And I hope you don't end up in the hospital and things can be back on schedule for you. I had an insurance issue today also.  Had my echo for my herceptin on the 17th of Jul - everything went fine with the facility but they sent it out to be read by a cardiologist who in not in my network UGH.  So insurance denied his billing.  I had no choice or knowledge of what where they sent it to but it is now my problem so I had to file an appeal today.  The lady I filed the appeal with said she doesn't even know why they sent it to a cardiologist that they are usually read by a radiologist - huh??  Anyway - here we go - it seems I have at least one insurance battle a month. ",
      "MessageIndex": 2393,
      "PostDate": "01/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Sep 5, 2014 06:37AM linda505 wrote: congrats clarn and footballnut!!!  you both look great!!",
      "MessageIndex": 2656,
      "PostDate": "05/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Sep 23, 2014 11:30AM linda505 wrote: everforward LOL at the conversation.   I stand in front of the mirror and wonder who that person is then I say \"Hey you talking to me??  you talking to ME???\"  ",
      "MessageIndex": 2777,
      "PostDate": "23/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Oct 10, 2014 05:59AM linda505 wrote: Hair progress update - I think I am developing a faux hawk - hair on top growing faster and straight up LOL ",
      "MessageIndex": 2847,
      "PostDate": "10/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Nov 3, 2014 10:42AM linda505 wrote: Timbuktu - sharing this with you to see if the top of your head looks like this??   ",
      "MessageIndex": 2878,
      "PostDate": "03/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Nov 6, 2014 04:25AM linda505 wrote: Thinking positive thoughts for Clarrn and Timbuktu.   Hate these detours that BC puts us on. Everforward - Herceptin can cause tingling in the feet and hands.  How long is your infusion?  If it isn't over 90 minutes ask to change it to that and see if that helps.",
      "MessageIndex": 2894,
      "PostDate": "06/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "linda505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195710/profile",
      "Content": "Nov 7, 2014 05:00AM linda505 wrote: Woo hoo for muscles and irritating toenails!!!",
      "MessageIndex": 2903,
      "PostDate": "07/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    }
  ]
}