{
  "AuthorID": "LiniWD",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
  "Posts": [
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jul 19, 2010 09:36AM LiniWD wrote: Hi Robin - Good luck with the Gemzar.  It was the drug that knocked back my lung mets for almost a year (even though it didn't work on anything else).  Like you I've been going through this Stage IV joy for over 6 years but did have symptoms - mostloy bone pain, and now SOB. However, I do have that morning throw up for no reason thing going on for the last year or so.  And then I feel fine, get in the car and go to work (at least until 2 weeks ago when I finally went out on full time LTD).  So - my philosophy is to throw up when I feel it coming on, don't fight it, brush my teeth and go on <grin>. May Gemzar be very, very good to you. Lynn from Tampa ",
      "MessageIndex": 143,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755270",
      "Title": "The prognosis in not good RobinWendy BrokenHeart"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Mar 4, 2008 09:44AM LiniWD wrote: I use the ativan for sleep help after the chemo steroids - also as a little extra anti nausea help.  I don't have the 1 mg pills - I have either 1/2 or a 1/4.  They last 6-8 hours which, for me, is fine. I use the Xanax when I need to take the edge off - I only take .25 mgs and they don't put me to sleep. Good luck in finding the combination that works for you! Lynn",
      "MessageIndex": 17,
      "PostDate": "04/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701505",
      "Title": "ativan virgin... AlaskaDeb tooyoungtohavebc"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Nov 9, 2009 08:31AM LiniWD wrote: I am so shocked and saddened to hear this news.  My condolences to Lydia's family. Sympathy & Hugs - Lynn",
      "MessageIndex": 43,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743454",
      "Title": "Luv2Travel is an Angel now LuAnnH BonnieVA"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Dec 21, 2007 02:21PM LiniWD wrote: Hi KariLynn - Just bumping this up to see how you are doing.  Hope the doxil is working and you are getting a break for the holidays. Hugs - Lynn",
      "MessageIndex": 71,
      "PostDate": "21/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693703",
      "Title": "KariLynn-how are you? Bugs 73gr"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Oct 18, 2007 07:23PM LiniWD wrote: Hi KariLynn - Just checking to see how you are doing.  I know your news wasn't good but am hoping you are gathering the strength to fight like mad!! Hugs - Lynn ",
      "MessageIndex": 25,
      "PostDate": "18/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693703",
      "Title": "KariLynn-how are you? Bugs 73gr"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "May 13, 2009 06:54PM LiniWD wrote: Vivo - I think it is an excellent topic as well.  While I don't think my original breast cancer was caused by stress (I go with the environmental theory myself), I think my recurrance to my lung was. I had been NED for 6 months when my father died suddenly and I could feel my lungs \"seize\" up from the stress.  Several months later I started coughing and then several months later the CT Scan came up positive for my BC in my lung.  While it may not be true, in my mind that recurrance was caused by stress. Just my opinion, for me. Lynn ",
      "MessageIndex": 30,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734061",
      "Title": "Has cancer pshycological roots? vivo bygracealone"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Nov 20, 2007 07:07PM LiniWD wrote: KariLynn - Just wondering how you are doing - I haven't seen you post for a while. I hope the treatments are not too hard for you and that you will get to enjoy all the Thanksgiving football. Lynn",
      "MessageIndex": 59,
      "PostDate": "20/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693703",
      "Title": "KariLynn-how are you? Bugs 73gr"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Oct 25, 2007 10:22PM LiniWD wrote: Hi KariLynn - I hope the chemo is treating you gently and yet showing great results.  My neighbor across the street did Doxil and was lucky enough to do very well on it.  I hope you also do well on it.  I presented with bone mets in October 2004 and have had radiation to my back, had a mastectomy and radiation and been on a large assortment of chemos - if you need any info on how to deal with side effects, please PM me and maybe I can help. Good luck to you - Lynn",
      "MessageIndex": 44,
      "PostDate": "25/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693703",
      "Title": "KariLynn-how are you? Bugs 73gr"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Dec 16, 2009 09:44AM LiniWD wrote: My husband always makes sure we have tickets to concerts - his reasoning, is we have a reason to stay married (he's really a doll, so that's just what he says <grin>).  My reasoning for tickets is that I have a goal for staying healthy. Having a wedding to plan and attend is a lot more inspiring. Congratulations! Lynn from Tampa ",
      "MessageIndex": 5,
      "PostDate": "16/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745478",
      "Title": "Youngest son got engaged! Analemma RobinWendy"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Sep 1, 2008 07:07PM LiniWD wrote: Janis - Cancer sucks and chemo sucks!  And even though the premeds and the side effects are so very much better than the chemo of 20-30 years ago, it still sucks.  I've been off and on chemo for 4 years, lost my hair twice, don't see a point to going on a diet to lose the steroid weight  - I understand how you're feeling. I don't have kids so the unknown that you who are mothers go through, I am luckily spared.  Think of the things you have planned and try to be determined to be there for them (my husband always says as long as we have concert tickets, we'll have a reason to stay married <grin>). I am a major Yankee baseball fan and they haven't won a World Series since I was diagnosed - and it doesn't look like they will this year either.  So......I've GOT to make it at least another year! Hugs to you and better thoughts - Lynn ",
      "MessageIndex": 18,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720432",
      "Title": "Depression, Anxiety and Mets oh my! Fitztwins Fitztwins"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jan 15, 2009 07:53PM LiniWD wrote: Bonnie - I just found out (although I knew in my mind) that the Gemzar/Carboplatin combo failed me and I have progression to my lungs as well as some skin mets.  (Really failed - wow). I'm starting on Navelbine/Avastin next week - I was on it last year for 6 months and it worked great - kicked me into NED after 6 months.  The only hard part was the neuropathy and the onc promised me this time he would prescribe Lyrica or Neurontin to help with that.  Other than that, it was a very doable chemo combination and, for me, very successful. I was never as fatigued in 6 months on the Navelbine as I have been in 2 months on the Gemzar. Enjoy the port - once you have it in, you'll wonder why you waited so long.  Mine doesn't show and I only remember it's there when its used for chemo and blood draws (save those veins!). Good luck and hugs - Lynn ",
      "MessageIndex": 14,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727034",
      "Title": "Gemzar failed BonnieVA luvtotravel"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jun 23, 2008 11:08AM LiniWD wrote: I never got the sore throat with Avastin/Taxol - but I sure had a hoarse voice.  I always sounded like I was a couple of steps away from laryngitis.  When I asked the onc, he said it was from the treatment. When I switched to Avastin/Navelbine, the hoarseness got less.  And now that I'm off chemo and back on hormonals (Aromasin), it's gone. Good luck, Deb. Lynn",
      "MessageIndex": 11,
      "PostDate": "23/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704954",
      "Title": "Avastin/Taxol and sore throat AlaskaDeb Roja1955"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Mar 7, 2008 08:27AM LiniWD wrote: I've also been on Navelbine & Avastin for about 6 months - my last PetScan showed \"significant improvement\": everything normal except for 1 nodule (which had an SUV of 2.2 which is almost normal). We also call it navy bean and it's not my favorite chemo - for me, the side effects are low grade but last for 8-10 days and include some low level nausea, loss of appetite, stomach bloating.  The biggest side effect is constipation (severe) - but I was able to counteract that with daily senokot. However, it worked great for me (the previous Avastin/Taxol combo kept me stable but showed no improvement on my recurrance) - just 2 more rounds and we move to something more maintenance for a while.  Just so you have a more positive feel, when I was on Adriamycin, it was like fertilizer for my breast tumor - it grew by about 40%.  The onc switched me to taxotere/carboplatin & it decreased significantly.  Everybody's body responds differently to different drugs - just because one fails, doesn't mean the next one will. Good luck to your mom.  Lynn",
      "MessageIndex": 4,
      "PostDate": "07/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701705",
      "Title": "Navelbine??? liz35 liz35"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Mar 20, 2008 05:20PM LiniWD wrote: Darryl - I am so sorry for your loss - my thoughts and prayers will be with you and your family. Lynn",
      "MessageIndex": 81,
      "PostDate": "20/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702566",
      "Title": "Fare Thee Well Love.... joannes_brother lewisfamily503"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jul 2, 2010 01:46PM LiniWD wrote: I'm in Florida and there were several years when the pathologists (another doctor you can't really choose) were fighting with the insurance companies because they weren't being treated like doctors.  So no pathologists were in-network.  I contacted my HR insurance advocate and even sent her copies of newspaper stories about the problem in Florida.  She was able to get the insurance company to pay.  Then a judge in the Miami/Dade area made a judgement against the insurance companies and for the pathologists and that stupidity stopped. Lynn from Tampa ",
      "MessageIndex": 11,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754866",
      "Title": "A Moment of Rant khartoregon khartoregon"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Aug 30, 2007 03:53PM LiniWD wrote:",
      "MessageIndex": 4,
      "PostDate": "30/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/687841",
      "Title": "TAXOL - WEEKLY OR EVERY THIRD WEEK?? plb2007 boobbuster"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Sep 10, 2007 01:33PM LiniWD wrote: I was diagnosed at presentation with mets to the bones in October 2004 and am also ER+.  I had back surgery and was on chemo until June 2005.  Had a mastectomy and radiation, was on Femara and was NED  until March of 2007 when I had a recurrance.  I have been on Avastin & Taxol for about 3-4 months (my onc tried a different cocktail for a few months with no positive results) and am now stable with some minor improvement (YAY). From the beginning I have been on monthly Zometa as well. The Avastin is a newer drug for breast cancer and is having positive results. As Katie said, there are lots of good drugs out there that can be used to stabilize the mets.  My husband has a cousin who was diagnosed with bone mets over 20 years ago and is still doing well - she's my goal <grin>. Good luck to you -  Lynn",
      "MessageIndex": 6,
      "PostDate": "10/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/691993",
      "Title": "bone mets survivors riverinerabbit mom2acat"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jan 15, 2010 08:50PM LiniWD wrote: Robin - Sounds like a well thought out treatment plan and I always find the mini-denials work.  I'm in the process of trying another chemo combo (Abraxane/Avastin) because I am lucky enough that the taxanes work for me.  My next step will probably be a trial - I've been dealing with this almost as long as you. What is it about Long Island girls anyway? Lynn from Tampa - formerly from Roosevelt in Nassau County, Dix Hills in Suffolk County; then Queens and Staten Island.",
      "MessageIndex": 19,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746778",
      "Title": "Back from Boston with new treatment plan RobinWendy RobinWendy"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Feb 13, 2010 07:32PM LiniWD wrote: Elizabeth - That's sucky news.  Try to make a good trip to DeNile so that you can enjoy your time in Boston. Hugs - Lynn from Tampa",
      "MessageIndex": 89,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Dec 21, 2007 02:16PM LiniWD wrote: I first started having heartburn while on Femara.  I was on a minivacation and had to go into a drug store and speak with a pharmacist.  She recommended Gas-x at that point, which worked all right for the few days. When I got home, I spoke with the nurse practitioner, who asked why I wasn't taking the Protonix I had - so I started taking that daily and refilled the prescription on a regular basis.  It works best when taken every day like clock work - if you stop taking it for a while, it takes a few days to kick back in. I've been on weekly & then biweekly chemo since March and I now make sure I take my Protonix every day.  I really hate heartburn - it comes on so suddenly and makes me very nauseaus. I always have Tums with me - even with the daily Protonix - it kicks in fast for me, but doesn't last a long time.  I use the Tums a lot less when I am taking the Protonix regularly. I had my gall bladder out 10 years ago, and the heartburn started a week after I started the Femara making it easy to identify.  Hope this helps - Lynn",
      "MessageIndex": 21,
      "PostDate": "21/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/697156",
      "Title": "heartburn? badboob67 LiniWD"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Mar 4, 2008 09:38AM LiniWD wrote: I have been on Avastin for a year - first with Taxol, and, for the last 6 months with Navelbine.  The Avastin/Navelbine has my mets almost back in remission (where they were for 20 months on Femara).  Through this, I'm also on monthly Zometa. The cost for each Avastin, according to my onc bill/statement, is $5600 - which my insurance covers (good insurance is wonderful) at their in-network price. Lynn ",
      "MessageIndex": 15,
      "PostDate": "04/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701210",
      "Title": "Avastin Kasey LiniWD"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jan 26, 2010 07:35PM LiniWD wrote: I think it's interesting how when you are waiting in the waiting room at the oncology office, everybody's legs are going even though the rest of their bodies are still. Lynn from Tampa",
      "MessageIndex": 15,
      "PostDate": "26/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747374",
      "Title": "Restless Legs Nanalinda Nanalinda"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Sep 29, 2008 07:45PM LiniWD wrote: For those of you in Central Florida, there's an organization called Gulf Coast Oncology Foundation that provides the same sorts of funding.  They were founded by an Oncology team in St Petersburg and have raised over $200,000 this year to help with cancer patients' financial needs.  Their web site is www.gulfcoastoncologyfoundation.com - their web site just went up and, while it is also a registered non-profit, they haven't yet switched the web site to a \".org\". Good luck to all with financial needs. Lynn ",
      "MessageIndex": 5,
      "PostDate": "29/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722010",
      "Title": "Another Financial Resource Jellydonut Jellydonut"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Sep 30, 2008 10:54PM LiniWD wrote: Janis - The first time I lost my hair I spent between $35 and $70 for my wigs (Ilike to get different ones for different moods <grin>).  This last time, I went to a wig store before my hair went, and bought one wig for work for $400 and a kicky fun wig (blonde with dark roots) for nights and weekends.  The owner of the place has had alopecia for years and her selection and knowledge is awesome.  They made me very comfortable and the wigs, synthetic hair with very light, non-itchy caps, are perfect.  I still wear the work one to work because my grown back hair is hard to style and thin from the aromasin. It's very comfortable and is me now.  I used one of my old, decrepit wigs for swimming in the pool.  It still looks cute and handles the chlorine well.  Then I discovered, at the health club, the ladies use swim caps, so I bought one of those for swimming there - look like all the other ladies! For me and my confidence levels, the wigs are better.  And I love having the variety. Have fun trying them on! Lynn ",
      "MessageIndex": 10,
      "PostDate": "30/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722062",
      "Title": "How much would you pay? Fitztwins LuAnnH"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Dec 18, 2009 07:50PM LiniWD wrote: I did Taxol & Avastin for 6 months and found it very tolerable.  The interesting thing was that, while I lost my hair within 2 weeks at the beginning, it grew back throughout the treatment.  It was like it was the initial shock that took it out.  I've heard that from others as well.  So..don't think you will be bald forever. Good luck - Lynn from Tampa ",
      "MessageIndex": 3,
      "PostDate": "18/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745599",
      "Title": "On to chemo. LC815 LC815"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jan 15, 2010 08:42PM LiniWD wrote: Hugs and prayers coming your way. Eat ice cream!! Lynn from Tampa",
      "MessageIndex": 73,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746762",
      "Title": "Progression in liver and bones :-( konakat dreamwriter"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Apr 10, 2008 08:10PM LiniWD wrote: Hey Robin - I was on Taxol/Avastin for months - remained stable, no progression and very minor improvement.  My onc switched me to Navelbine/Avastin and that is absolutely kicking my cancer's butt - the last PET showed significant improvement - pretty much all the way back to NED. See what your onc thinks of that combination - I've been on it since November and will, hopefully, be done with it in May.  My onc wanted 3 more courses (boy was I upset when I found out that each course was 2 treatments - I was psyched for 3 treatments and instead have 6 <sigh>). Good luck and great results for you! Lynn",
      "MessageIndex": 17,
      "PostDate": "10/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703755",
      "Title": "To coin a phrase from Watson... taxol crapall RobinWendy Maya1"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jan 6, 2010 09:30AM LiniWD wrote: While I find I have the most in common with other Stage IVers, one of the most supportive people I have at work is a \"lower\" stage (not sure which).  She had a double mastectomy and has two young children.  She always checks in and makes sure I'm okay - I never get offended by her asking.  I was there for her during her chemo & mastectomy and even understand that she wants to move on now, so I try not to tell her anything too bad.  But - even when I try to sugar coat it, she knows and asks the right questions.  So - what I am trying to say is, show your concern, bet there for your friend.  Take her out to lunch or shopping or on any kind of outing that will appeal to you both and will not be too hard on her (our local zoo is easy on the walking and has wheelchairs for those who need them). Enjoy your friend and try not to change the friendship just because she is Stage IV. Lynn from Tampa ",
      "MessageIndex": 3,
      "PostDate": "06/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746329",
      "Title": "How do I deal with this???? scrappy_survivor noblegases"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Apr 3, 2009 01:10AM LiniWD wrote: I believe that early detection and aggressive treatment are extremely effective - and, luckily for me, so does my onc.  I was diagnosed 101/04 with bone mets from the get-go.  I had a radiation to my vertebrae and then had two vertebrae replaced.  While I was recovering from that, I had taxotere & carboplatin (Adriamycin didn't work for me) - with PET/CT scans every 3 months to check progress.  Then, in 8/05, I had a mastectomy to get rid of that tumor (which had shrunk from the chemo).  That was followed by radiation.  When the scans after showed NED, I went on Femara for 20 months and scans were only every 6 months.  When a recurrence was seen, back on chemo and every 3 month PET/CT scans. My onc has been amazing with the various cocktail combinations - and I have been very lucky with side effects.  My latest recurrence, to my lung, was not detected by the PET/CTscans in October 08 and I spent several months going to the ENT trying to determine the cause of the cough, with Gemzar because my markers were rising. A chest CT scan in January identified it and back on Navelbine/Avastin I went.  Now my tumor markers are decreasing again (YAY) and I'm set for another PET/CT in April to check progress. It's been 4 1/2 years for me - and I doubt I would have had that long without early detection of the mets. Good luck and hugs to all of us - Lynn ",
      "MessageIndex": 17,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731804",
      "Title": "Early Detection of Mets- Does it Matter? TripleNeg RobinWendy"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jun 23, 2008 11:02AM LiniWD wrote: I had a lot of joint pain when I was on Femara - wrist pain so bad I had to have a cortisone shot.  I also found that weak areas, like one of my knees, hurt more than usual on Femara. But Femara kept the bone mets at bay for a year and a half - hopefully, you will have success as well.  Lynn",
      "MessageIndex": 3,
      "PostDate": "23/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707834",
      "Title": "pain while on Femara riverinerabbit LuAnnH"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jan 6, 2010 09:34AM LiniWD wrote: Oops - just reread your posting and realized this is not an existing friend now - however, same rules apply.  At work, I have met breast cancer people of all stages and we are our own support system.  Lunches and outings still are good ways to get out and have conversations - also ways to continue to be \"normal\". So, I would say, call her and let her know you are there to help.  Lynn from Tampa",
      "MessageIndex": 4,
      "PostDate": "06/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746329",
      "Title": "How do I deal with this???? scrappy_survivor noblegases"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jan 22, 2009 07:53PM LiniWD wrote: I was on chemo from Nov 2004 to July 2005 then went on Femara (hormonal) for 20 months.  When that finally failed me, I went back on chemo (Taxol/Avastin, then Navelbine/Avastin) for 13 months.  When that sent me to NED, the onc put me on Aromasin (hormonal).  I am almost convinced that the Aromasin would have worked for a longer period of time, but my Dad died suddenly in July 2008 and my stress level went straight through the roof.  I wasn't surprised when a recurrance was found in October 2008.  I don't know if he would try a hormonal again, even though the biopsy shows my mets are still ER+. Meanwhile, back on Navelbine/Avastin (and something for the neuropathy if you please).  Good luck and hugs - Lynn",
      "MessageIndex": 1,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727822",
      "Title": "anyone given hormone therapy a second chance after chemo? morgansmom riverinerabbit"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Sep 18, 2009 10:53PM LiniWD wrote: Little Bro - Thank you so much for the update.  I can tell that Heidi is surrounded by the love of her family & friends.   Hopefully, she will be filled with peace as well. My prayers are with you all. Lynn from Tampa",
      "MessageIndex": 450,
      "PostDate": "18/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Oct 17, 2008 06:49PM LiniWD wrote: I also had headaches from chemo - but if they persist, and are really bad, I would do as the doctor suggests and get the scan.  Like Janis says - if it comes back negative, it's one less worry. Lynn",
      "MessageIndex": 7,
      "PostDate": "17/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722834",
      "Title": "headaches mybeautifulsister wishiwere"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Nov 12, 2009 01:57PM LiniWD wrote: I agree with Kellke - I have been Stage IV for 5 years and have had to have 2 root canals in that time.  The point of the root canal is to remove the infection - my dentist and oncologist had a big fight over this on my last root canal. (My dentist won). Having the root canal hasn't cured my cancer nor made it worse. Lynn from Tampa    ",
      "MessageIndex": 4,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742595",
      "Title": "Root Canals and Breast Cancer stan322 33skidoo"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Dec 18, 2008 05:37AM LiniWD wrote: Janis - Good luck with that surgery - you'll be amazed with how quickly they will have you up and walking!  Make sure you get that tool that helps you pull your socks up <grin>. Hugs - Lynn ",
      "MessageIndex": 59,
      "PostDate": "18/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725990",
      "Title": "I will be offline for a few days.. Fitztwins LuAnnH"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Dec 20, 2009 07:57PM LiniWD wrote: I say, be careful with the possible lymphedema side.  Even if you do everything right, you might still get it, but there is less of a chance.  And by being careful, if you get it you will probably catch it earlier (which is good for massage and therapy). My lymphedema side is my right side and I am a very right handed person.  I pull weeds with my right arm, lift with my right arm, do everything righty.  But I don't let them take blood pressure from that arm or take blood (even though the good veins are there). I was careful for 5 years and still got a mild case.  Now I'm going to a lymphedema therapist who is teaching me about massage and the proper exercises for lymph drainage. BC - the gift that keeps on giving. Lynn from Tampa",
      "MessageIndex": 1,
      "PostDate": "20/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/745668",
      "Title": "General risk question sejnboys sejnboys"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Mar 28, 2008 11:51PM LiniWD wrote: Hi - I don't get neupogen shots, but one of the side effects of the Avastin is shortness of breath.  My onc is always checking with me to make sure I am not having a problem with that.  I have also found the Navelbine makes me feel generally icky for longer than the other chemos I have been on - almost like I'm coming down with something for 10 days.  It's been a long time since I've been on carboplatin, so I can't remember what those side effects were. I am the same age as your mother - check with her doctor and see if a cardiologist should be involved for the Avastin. Some of its common side effects are shortness of breath and hypertension - its rarer side effects can be more serious heart problems.  The combination of the Avastin/Navelbine worked wonders for me - but everybody is different.  Also realize that the chemos are cumulative - the more cycles you take, the harder the side effects and the more tired you are.  I remember, with Avastin/Taxotere, being sick and tired of being sick and tired <grin>.   Good luck to mom - Lynn",
      "MessageIndex": 1,
      "PostDate": "28/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702983",
      "Title": "Chemo taking a toll on my mother sarika_for_mama RobinWendy"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "May 31, 2010 12:24PM LiniWD wrote: Lived most of my life in Long Island and the boroughs of NY.  Moved to Tampa, Fl  for my job 8 years ago and love it here. Lynn from Tampa",
      "MessageIndex": 24,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753351",
      "Title": "Where is everyone from? shelbyjane72 BarbaraA"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jan 30, 2010 02:03PM LiniWD wrote: Claygirl - My understanding of Zometa (which I have been on for 5 years) is that a side effect is renal failure - therefore, the monthly creatine testing.  For an oncologist to tell you the creatine test is not important is, in my opinion, irresponsible. Lynn from Tampa ",
      "MessageIndex": 15,
      "PostDate": "30/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747554",
      "Title": "how often do you see your oncologist? rkt Lynn06"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Mar 21, 2009 01:30PM LiniWD wrote: Julia - I spent a year with back pain (pre mets diagnosis) that my primary told me was just a slightly protruding disk - take some tylenol.  My chiropractor finally sent me for a thoracic MRI because I wasn't reacting right to her therapy.  That's when we found out my back was fractured from the tumors and I had breast cancer. As you can see, everybody seems to present differently. As others have said - talk to your onc (I didn't have one then, have a great one now) - and get some scans to check it out. Good luck to you - Lynn ",
      "MessageIndex": 17,
      "PostDate": "21/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731066",
      "Title": "Bone Mets Symptoms jdash mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jan 15, 2010 11:44PM LiniWD wrote: Cool, cool, cool!!!! Lynn from Tampa",
      "MessageIndex": 27,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746785",
      "Title": "some good news 33skidoo LuAnnH"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Apr 27, 2008 09:51PM LiniWD wrote: Linda - I don't think the motorized chairs go fast enough to knock in to anyone - when we were there last weekend it was very crowded and lots of motorized chairs - and no out of control wheelchairs were seen . And no, I don't think it is wrong to go to the front of the lines - you are not getting the wheelchair for the fun of it, you need it.  It's easier to see in the front and loads more comfortable.  And you'd be amazed at how many stairs there are in those show bleachers (not fun walking and sitting on a bench with no back). I got the regular wheelchair and walked and rode, depending on how I felt - so I understand your wanting to walk.  But you have the stroller as well.  If your husband gets tired, he can use the wheelchair and you can push the stroller!! Lynn",
      "MessageIndex": 6,
      "PostDate": "27/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704605",
      "Title": "4 week chemo break LinTol jonimb"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jul 20, 2010 02:11AM LiniWD wrote: My onc also recommended hydrogen peroxide mixed with water as a rinse.  It worked when Biotene didn't.  Worth a try! Lynn from Tampa",
      "MessageIndex": 7,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755545",
      "Title": "ouch, my mouth hurts! stephanief tooyoungtohavebc"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jan 27, 2009 11:34AM LiniWD wrote: My prayers and thoughts go out to Deb's family.  I really thought she was going to be with her family for longer. The pictures are so much the way Deb sounded on the boards. Her family will have many good memories.",
      "MessageIndex": 199,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jul 16, 2007 12:52PM LiniWD wrote:",
      "MessageIndex": 21,
      "PostDate": "16/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/652876",
      "Title": "Not the news I expected... RobinWendy RobinWendy"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Apr 14, 2010 09:52PM LiniWD wrote: My condolences to her children, husband and the rest of her family.  May she live on in their memories. Hugs - Lynn from Tampa",
      "MessageIndex": 12,
      "PostDate": "14/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751290",
      "Title": "BonnieVA is a Angel konakat ChocolateLover"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "May 10, 2008 11:01PM LiniWD wrote: Oz - I've lost my hair twice - and I understand that it's not fun at all.  The first time I had scarves, hats & wigs.  I found that I wore the wigs the most - didn't have the style sense to tie the scarves \"cutely\" - and usually only wore the hats in the house (I was very paranoid about the bald head, even in the house). The second time, I went to a wig store before I lost the hair so they could see what I looked like with my own hair.  I got a conservatve wig for work and a cute wig for \"nights and weekends\".  I used one of my old wigs for swimming until I realized that with swim caps, I looked like everyone else at the gym pool <grin>.  If you have a good wig store nearby, go to it.  Wigs don't have to be itchy, and if you get one that fits your style, you will be much less self conscious. Also - as you are heading into winter, the wig will keep your head warm. I also have a port - have had it for 3 and a half years.  It is wonderful.  When my veins have to be accessed for tests I cringe - chemo really makes them thin and the experience is, to say the least, trying.  The port is very easy. Good luck with the chemo -  and be comfortable! Lynn Lynn",
      "MessageIndex": 5,
      "PostDate": "10/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705323",
      "Title": "HAIR LOSS ozzie2 maggie1984"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jan 25, 2008 10:58PM LiniWD wrote: Hi Kari Lynn - I too hope you are getting better so you can resume chemo and continue your fight .  Take this weekend to recover and get strong so you can enjoy next week's Superbowl (even though the Chiefs are not in it and there are only Northeast teams playing!). From an ex-NYer - GO GIANTS! Lynn",
      "MessageIndex": 20,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698727",
      "Title": "Week of Shots Ends KariLynn cats_love_me"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Apr 11, 2009 05:25PM LiniWD wrote: Lilac - I'm also glad you are going to talk with your onc.  I'm also stage IV and have been off and on chemo for 4 years with bone mets, and now lung mets.  I have been very lucky with side effects - but, when I have had them, my onc has either changed the chemo, rearranged the dosage, or given me something to help with the side effects. He has been talking to me lately about Ixempra, so now I know to make sure I take something for the nausea (Gemzar did the same thing to me) and fatigue, if we go there. Talk to your onc, or one of the nurses there, and see what can help. Good luck and gentle hugs - Lynn    ",
      "MessageIndex": 6,
      "PostDate": "11/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732302",
      "Title": "Thinking about quiting chemo Lilac Godsgal"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Feb 25, 2010 03:33AM LiniWD wrote: I have taken some needed breaks for 2-4 weeks at a time - nothing that long but enough to take a deep breath and get my strength back.  Run it past your onc and see if something like that makes sense for you. Hugs - Lynn from Tampa",
      "MessageIndex": 1,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748906",
      "Title": "chemo break chk8 konakat"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Mar 21, 2008 11:35AM LiniWD wrote: I have been on Zometa for 3 and a half years - and I have lousy teeth.  Anytime I need any work done, my onc goes nuts because he has seen jaw necrosis and it's not fun.  So...I have to have the dentist tell me exactly what he is doing.  Then I have to explain it to the onc.  Then the onc determines whether the work being done will require me to stop Zometa for 3 months.  Whether it stops the Zometa or not, he always writes me a prescription for antibiotics (Levacquin) to take before & after the procedure. My dentist is more laid back about the necrosis (easy for him to be) - but he knows whether the procedure will affect the bone or not (a cavity doesn't usually). But a few months ago, when I had an abcess, the oncology nurses flat out refused to give me Zometa because of the possibility of jaw necrosis. So, I say to err on the side of caution.  A cleaning every 6 months shouldn't be an issue.  More intense dental work may be. Good luck - Lynn",
      "MessageIndex": 18,
      "PostDate": "21/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702433",
      "Title": "How long on Zometa riverinerabbit TingleToes"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Apr 30, 2009 11:47PM LiniWD wrote: Anita - I had a unilateral mastectomy early on in the process (8/2005).  The breast surgeon didn't even mention bilateral and I don't really know how receptive I woud have been.  At this point, however, I wish I had done a bilateral.  I think you have a lot of flexibility afterwords with sizing and choices. Since I am off an on chemo now, it doesn't seem like something I want to address now. However, if I was NED for a while (like I was last year), I might seriously consider it. Good luck and be comfortable in whatever choice you make. Lynn from Tampa ",
      "MessageIndex": 8,
      "PostDate": "30/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733411",
      "Title": "New plan of action anitach rkt"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Feb 25, 2010 04:31AM LiniWD wrote: Diane and family - Hoping for peace for all of you.  I loved reading Diane's posts - your memories and stories of her will help you through this storm. Hugs - Lynn from Tampa",
      "MessageIndex": 44,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748885",
      "Title": "BadBoob67 is in Hospice Now :( LuAnnH Danie"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Mar 13, 2008 11:44PM LiniWD wrote: Great news, KariLynn.  Keep it going!! Lynn",
      "MessageIndex": 25,
      "PostDate": "13/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702118",
      "Title": "Good report KariLynn luckywife"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Feb 12, 2010 10:00AM - edited Feb 12, 2010 10:03AM by LiniWD You have plenty more chemos to try - I am the same diagnosis as you and have been Stage IV for over 5 years.  Navelbine and Avastin worked wonderfully for me twice (1st time 7 months - put me in remission, Aromasin kept me there only 6 months,  & 2nd time 9 months - kept me stable).  Taxotere & Carboplatin originally worked well for me and took me to remission or NED for 20 months (on Femara to keep me there).  Then I was on Taxol/Avastin (followed by Navelbine) I've been on Gemzar (which didn't work well for me). Ixempra/Xeloda knocked it out of my lungs but let it progress in my bones. I am now on Abraxane and Avastin - we'll see how that's doing on my next PET/CT in March. I'm expecting more drugs will come out later and am hoping for more relevant trials and maybe, a vaccine.  I'm also pretty positive because the people I have chemo with are all long term Stage IV survivors (5-13 years). Go Patti!!!! Lynn from Tampa",
      "MessageIndex": 1,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748247",
      "Title": "It is a bad sign that I am in my pj's pattih joaniji"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jul 10, 2010 02:27PM LiniWD wrote: Elaine - stay ahad of the pain!!! (Consider that your yell). If you're not sure whether you need the pills anymore, stop taking them for awhile - you'll either find our real quick you needed them, or be able to slow down. I take oxycodone and am lucky enough to be able to take only 3 or 4 a week for the during the day pain that makes me unable to do stuff.  I don't like taking it at nite, cuz it gives me headaches.  See if a few tylenol will help you in that situation (I have been surprised how well Tylenol can work).  Good luck - I've been dealing with bone mets (and had back surgery for it) for 6 years now.  Pain management with oxycodone has worked well for me and keeps my head clear for work. Lynn from Tampa",
      "MessageIndex": 15,
      "PostDate": "10/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755151",
      "Title": "Shout at me, girls ElaineD leprechaun"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jul 6, 2007 01:49AM LiniWD wrote:",
      "MessageIndex": 3,
      "PostDate": "06/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/648878",
      "Title": "oncologist? ma27 Seabee"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Oct 29, 2009 10:56AM LiniWD wrote: God is Able.  Prayers for Stephanie's family.",
      "MessageIndex": 26,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742956",
      "Title": "Stephanie is an Angel 2timer Britt"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jul 11, 2007 07:18AM LiniWD wrote:",
      "MessageIndex": 1,
      "PostDate": "11/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/651844",
      "Title": "Chemo and dental TerryNY TerryNY"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Feb 11, 2010 04:28PM LiniWD wrote: I've been getting Zometa monthly for about 5 years - the only times I have a reaction at this point is when they infuse it in less than 30 minutes (and I very strongly insist they set it for 30 minutes because one day of \"flu like\" symptoms was enough for me).  When they let it go in slowly, your chance of a reaction is much less.  Lynn from Tampa",
      "MessageIndex": 15,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748090",
      "Title": "zemata patti4511 southsider"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "May 8, 2008 08:55AM LiniWD wrote: Jordan - I spent 6 months on weekly Taxol & biweekly Avastin (with Zometa once a month for diversity <grin>).  It was a lot easier than the Taxotere/Carboplatin every 3 weeks combo I had several years ago. I worked full time through it and it was okay. The hardest side effect for me was leg pain/neuropathy and my onc moved me to Taxol every other week because of it.  This combo kept me stable, minimal improvement.  Since November, I have been on Navelbine/Avastin every other week (and my old reliable Zometa monthly).  I have had significant improvement on this.  Again, I have worked full time on this. In regards to the hair - I knew it was going to fall out with the Taxol, so I went to a wig store before it fell out and found one that was similar to my own hair.  It's quite nice - I don't like wearing scarves to work and the wigs look very natural.  I also have a \"nights &B weekends\" wig which is cute and blonde with dark roots - much more fun than the work wig.  After the initial fall out, the hair will slowly start to grow back on the Taxol (I think it's the initial shock that makes it fall out).  After a year on the taxanes & Navelbine, I have 2-3 inches of hair (a little thin) and can go out without the \"nights & weekends\" wig.  I'm still wearing the work wig - it's a whole lot easier in the morning, no styling necessary . Good luck to you - Lynn",
      "MessageIndex": 12,
      "PostDate": "08/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705203",
      "Title": "so discouraged I need some help jordan jordan"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Mar 8, 2008 12:52PM LiniWD wrote: I had a port put in right from the beginning and I love it - not only is it used for chemo, but also for most of my blood draws. One of the things the chemo affects negatively, even if you have a port, is the vein walls.  When I'm on chemo, it is much harder to get blood from a vein or put in contrast for an MRI, etc because the needles go right through the veins (especially when the technician is not very skilled ).  When I am off chemo, this doesn't happen. For only 4 doses, a port seems extreme - but be careful of those veins. Good luck whatever your choice. Lynn",
      "MessageIndex": 25,
      "PostDate": "08/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/701477",
      "Title": "Using your veins instead of a port for chemo infusions otter joteach"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jun 23, 2010 08:35AM LiniWD wrote: I don't look at the statistics - I did at the beginning (diagnosed directly with Stage IV in 10/2004) and I was horrified.  I vowed never again to go on the Susan Komen site (and I don't) because their statistics were particularly specific and short in time.  I have been on chemo and hormonals for almost 6 years.  I am chemo friends with another woman who is also Stage IV for 6 years.  She's on the TDM1 trial and doing wonderfully.  The last chemo I was on caused severe shortness of breath for me so we are trying to fix that and I am back on Xeloda, which is working again.  I have also been on Avastin for a couple of years.  And, of course, the old standby Zometa for the bones. Don't look at the statistics - check out how you feel and pay attention to scans and if you have progression (and where). I had a cardiologist who asked for my prognosis (bad bedside manner - he wanted to make sure I knew what Stage IV meant, like my onc hadn't explained) and I asked him what HIS expiration date was - that sure shut him up. Heavily pretreated makes your trial option limited (in my experience). Hugs to you - Lynn from Tampa",
      "MessageIndex": 6,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754462",
      "Title": "Am I a Debbie Downer? Lifestooshort pee"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Sep 21, 2009 03:07AM LiniWD wrote: Denisela - I'm so sorry about your news - I haven't been in your situation so I don't have any advice, but I'm sure somebody will help you.  Have you tried brainmets.org yet to see some of your options? Lynn from Tampa",
      "MessageIndex": 1,
      "PostDate": "21/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740688",
      "Title": "Encouragement for Brain Mets denisela DARLENEDENISE"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jun 27, 2008 09:06PM LiniWD wrote: KariLynn - I am so sorry to hear this news. Like the others, I am hoping that a break from chemo may give your liver the strength to regenerate.  Hope and reality can go together as I think you already know. My thoughts and prayers are with you. Enjoy your vacation with your family. Hugs - Lynn ",
      "MessageIndex": 30,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708158",
      "Title": "Very bad report KariLynn roseg"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Apr 26, 2008 06:16PM LiniWD wrote: Linda - Disney has motorized wheelchairs as well as the push ones.  So you could get around by yourself (and carry packages) and your husband can push the stroller.  They're a little more expensive to rent - but worth it. We had friends in last week and we did Epcot, Universal & Seaworld in 3 days.  One of our friends also had leg problems (2 knee replacements and neuropathy from 30 years as a wall paper hanger!) but we were both too stubborn to get a wheelchair.  Everytime I saw someone on a motorized chair, I was jealous . However - I had better pain meds, so I did really well . You also get to go to the front of all the lines when you are in a wheelchair (as does everybody in your group).  I rented one 3 years ago when I had just gotten out of my back brace and it was great! Have a wonderful time - Lynn",
      "MessageIndex": 3,
      "PostDate": "26/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704605",
      "Title": "4 week chemo break LinTol jonimb"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Oct 25, 2007 08:25PM LiniWD wrote: I had a right unilateral in August of 2005 and the thought of reconstruction after thoracic back surgery, chemo, mastectomy & radiation was really too much for me. I went, almost immediately to a small mastectomy store where I received  a lot of information, some bras,soft forms and a camisole and a bathing suit.  They worked with my insurance company. Then I went to Nordstroms where I found a wonderful fitter - a tremendous amount of privacy, and some very well fitting bras.  They also will put pockets in any other bras or swimsuits you pick out.  I bought an excellent breast form (that is still in great shape 2 years later) and a swim form because I live in Florida and have a heated pool.  I also bought those cheap soap sponges that are sold in the drug stores and they are great in the swimsuit pocket  in the pool. Since I am not small - 40C - I am vey uncomfortable without my prosthesis.  But I have a front closing mastectomy bra that is more like a lounger that makes me comfortable at home. Sometimes I feel a prophylactic on my left side would help with symmetry and button down blouses - but, again, I don't want any more surgery, so I spend a lot on my every day work prosthesis (silicone, comfortable, huggable <but not at work>) and at home I play around with cheaper alternatives.  Last month I got a new spare expensive boob and it was SO exciting!! Only people who know me well, know I had a mastectomy.  Others can't tell. Good luck on your decision - Lynn",
      "MessageIndex": 86,
      "PostDate": "25/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Mar 28, 2008 04:50PM LiniWD wrote: Diane - Do you still have the brace you wore after the original surgery?  I know it was 2 years ago - but I still have mine because I seem to be superstitious about getting rid of it. If so, you might want to try putting that on and see if it eases some of the pain if you are sitting up.  If not, I might lobby for a new one - I know I felt a lot better with it on, and a lot more secure. Good luck - Lynn",
      "MessageIndex": 104,
      "PostDate": "28/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702750",
      "Title": "Please pray for me badboob67 katie11"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Mar 9, 2008 10:56PM LiniWD wrote: My voice went hoarse from the combination of Taxol & Avastin - but I never totally lost it.   The oncologist wasn't surprised when I brought it up, so it probably is more common than we think. Lynn",
      "MessageIndex": 1,
      "PostDate": "09/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/701889",
      "Title": "side effects from Taxol and Avastin ejohn LiniWD"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Sep 16, 2009 04:24PM LiniWD wrote: I'm so sorry to hear this - may the memories and joys of Mena live on in her family. Lynn from Tampa",
      "MessageIndex": 51,
      "PostDate": "16/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740382",
      "Title": "mena got her wings... celia088 Irina"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Mar 5, 2008 01:47PM LiniWD wrote: I had an allergic reaction to Taxotere when I was taking it with carboplatin a few years ago.  My onc wasn't giving me benadryl at the time before the taxotere - now I get benadryl as a premed before any taxol or taxotere.  The nurse said several people had allergic reactions to that batch of taxotere that week. Once was really scary, but I never had that reaction again and I stayed on that for several more months. Personally, I'm into the benadyl buzz <grin>. They don't give the benadryl with Navelbine - oh well. Lynn Lynn",
      "MessageIndex": 4,
      "PostDate": "05/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701603",
      "Title": "Allergy to Taxol Jodian72 LinTol"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Feb 11, 2010 04:23PM LiniWD wrote: I had a port infection in December.  My onc sent me to an infectious disease place and I had an IV antibiotic put into my port (attached to a pump) which delivered clyndamiacin (spelling?) every 8 hours for about 20 minutes.  It was a real pain, because the pump had to be constantly carried around in a fanny pack and a new bag put in every day - but it worked.  Twelve days and I was finished - and I didn't have to have the port replaced (YAY!)  Lynn from Tampa",
      "MessageIndex": 6,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748115",
      "Title": "Port infection? nancyh LiniWD"
    },
    {
      "AuthorID": "LiniWD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14628/profile",
      "Content": "Jan 15, 2010 11:56PM LiniWD wrote: Hugs and prayers to River and her family.  Thinking of you all. Lynn from Tampa",
      "MessageIndex": 59,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746352",
      "Title": "A message from River's husband Fitztwins lizws"
    }
  ]
}