{
  "AuthorID": "lipstik101",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207439/profile",
  "Posts": [{
    "AuthorID": "lipstik101",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207439/profile",
    "Content": "lipstik101 wrote: Hello All:   I found my lump in Feb.  I had clear mammas, ultra sound, and CT.  First General Surgeon (don't recommend a General Surgeon.... Specialist for Breast better) said to skip the MRI and do a lumpectomy.  What do I know.  Nothing at that point.  Positive for cancer and recommended a new lumpectomy to create clean margins.  No Chemo, radiation, just pills to block ER and PR... both positive. Easy Breezy right???   Went to the 1st Oncologist opinion: He said, too late for Chemo first... he would have recommended it, however since I already had one lumpectomy it was a mute point.  Still no MRI or a request from anyone... but me.  I was ignored.  Lymph nodes exploded after the lumpectomy.  2 hard rocks... 2 cm. each.  No I am spinning.  2rd opinion (surgeon)  said, \"You need chemo first to try and shrink those lymph nodes and original lump 5.2 cm.  A new lump appeared larger sort of connected.. right breast only.  Surgery after... may be a candidate for nipple conserving./?  But wait, wasn't it a mute point to have chemo first??  More confuse.  I wanted a 3rd opinion to see if someone might agree... 3rd surgeon said... \"Absoulutely not!  There have been trial after trial that proves ILC does not respond to chemo first.  And no you are not a candidate for Nipple Conserving surgery.  Modified radical mastectomy... reconstruct after a year.. plus 4 mos. of chemo and followed up w radiation.  OK people.. can anyone agree??? I decided to go to an out of network oncologist... not associated with a surgeon.   She was wonderful.  Chemo first, surgery (double) and radiation.. reconstruct w expanders first while doing radiation.  What do you think about having radiation wi expanders?  I heard that radiation can melt implants???   I don't want to wait a year.  56 years old and very active and athletic.  So stressed about the up and down opinions.  Now my insurance won't aloo me to use the out of network Doc... oncologist.  The other Drs. failed to notice that I needed an MRI.. this revealed everything.  Still only in r breast... Im opting for both off.  My HER2 was inconclusive and a second test said negative.  Two different types of tests.  My new lovely oncologist said that she wanted a new pathology done at an expert lab for HER2 (USC Dr. Pratt).  I convince my insurance after appeals to approve it.  The original Pathologist had a temp receptionist and she didn't order the block to create a new lab sample... from my frozen biopsy....  I think I may be writing too much and no one will read this script!!  Sorry. Finally, any thought on the Penguin Ice Cap?  I am going for it.  Expensive but would love to not lose my hair. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "05/11/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826039",
    "Title": "4 Drs. and Several Mistakes! HMO Nightmare! lipstik101 vbishop"
  }]
}