{
  "AuthorID": "lisacatq",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/35749/profile",
  "Posts": [
    {
      "AuthorID": "lisacatq",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/35749/profile",
      "Content": "Jun 30, 2008 09:30AM lisacatq wrote: Fantastic news Ozzie. There you go, you wanted some of my luck and you have it. Happy dance along with you from Queensland. Take care, Lisa",
      "MessageIndex": 2,
      "PostDate": "30/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708302",
      "Title": "xeloda kicks butt.. ozzie2 Adnerb"
    },
    {
      "AuthorID": "lisacatq",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/35749/profile",
      "Content": "lisacatq wrote: I havent been around for a while. After my great scan results in March I have been getting on with my life, had a holiday away, bought a new house and have been having fun. Went for my 3 month scan in July and what do you know it is all back in and around my lungs again and I am back where I started. I was quite shocked as I thought I would have more than only 3 months off chemo. My onc said I could start another treatment now or wait until I start having symptoms but I decided I was ready for another treatment and didnt want to wait until everything was worse and harder to treat. So, I started Cisplatin and Navelbine in July, weekly for 2 weeks and then 2 weeks off. I have had 2 cycles and had a scan on Friday which showed \"ALMOST COMPLETE RESOLUTION of multiple pulmonary metastases.....\" Fantastic news isnt it. This is such a rollercoaster and it is amazing how quickly we learn to roll with it all. I didnt dare hope I would have such an outstanding result after just 2 cycles. I already have learnt not to hope when I have a scan, nor to worry it will be bad news. But when you receive the good news you realise even if you dont admit it to yourself you are worrying. May my news give hope to some of you. Take care all. Lisa from Aussie. one joy scatters a hundred griefs Dx 9/18/2006, IDC, 6cm+, Stage IV, Grade 3, 3/27 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/689359",
      "Title": "Navelbine and Cisplaten are working lisacatq Barbaranne"
    },
    {
      "AuthorID": "lisacatq",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/35749/profile",
      "Content": "lisacatq wrote: Hi all. I'm a triple neg with lung mets and as of today, after my first brain scan have been diagnosed with brain mets. The multiple lung mets I was originally diagnosed with 2 years ago yesterday, disappeared after 2 cycles of chemo treatment and have had no treatment since December. I now also have 2 of the lung nodules back and growing. So, my good luck has termporarily run out. My Onc says not to panic yet, to have an MRI next week to find out exactly what the suspicous spot is and come and see him the week after as he will be away next week. He suggests it could be a number of things such as enlarged blood vessels caused by chemo, mini stroke or possibly a bruise?? I was too distraught to question any of this and left in tears. So, what do I do now for the next week with no treatment plan and not much hope. When I read the scan report it says I actually have 3 spots on my brain (Onc was going by scans only) each measuring 5mm. I couldnt find much in the way of treatment on the internet. Only WBR or surgicall removal. From what I can gather surgical removal is usually performed if there is only one tumour, larger than I think it was 3cm, and also dependant on how deep in the brain the tumour is growing. I did find the words \"brain mets is no longer a death sentence\" which gave me a little bit of hope. Can anybody suggest any other options I may have and where I can get information from before I see my Onc. again. I feel like I am back where I started 2 years ago when first diagnosed. Thanks and best wishes to you all. Lisacatq one joy scatters a hundred griefs Dx 9/18/2006, IDC, 6cm+, Stage IV, Grade 3, 3/27 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721459",
      "Title": "Brain Mets - No Plan lisacatq KiminJax"
    },
    {
      "AuthorID": "lisacatq",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/35749/profile",
      "Content": "Sep 22, 2008 08:20PM lisacatq wrote: Thanks for all your replies and the information. It is greatly appreciated. Will let you know what happens next week. Best wishes to all. Lisacatq",
      "MessageIndex": 7,
      "PostDate": "22/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721459",
      "Title": "Brain Mets - No Plan lisacatq KiminJax"
    },
    {
      "AuthorID": "lisacatq",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/35749/profile",
      "Content": "Dec 13, 2007 08:51AM lisacatq wrote: I am so sorry. I can't imagine what her dear family are going through and wish them strength through this tragic twist of fate. Lisa was so kind to me. I feel privileged to know her, even if it was only over the Internet.  Lisa is one of those rare people who had her wings on earth.",
      "MessageIndex": 6,
      "PostDate": "13/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696820",
      "Title": "Update from Lisa40's Husband Kirk TripleNeg LauraGTO"
    },
    {
      "AuthorID": "lisacatq",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/35749/profile",
      "Content": "Dec 18, 2007 09:19AM lisacatq wrote: I too remember when you were very ill and was excited for you just now when I read the word stable. We are so used to looking for the positives and moving on, which is what you have done. Good on you girl.",
      "MessageIndex": 19,
      "PostDate": "18/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696929",
      "Title": "Scan Results: \"Stable - more or less\" joanne1428 lisacatq"
    },
    {
      "AuthorID": "lisacatq",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/35749/profile",
      "Content": "Sep 26, 2007 10:11AM lisacatq wrote: Hi Kenna, I too was where you are exactly 1 year ago but with lung mets. It really is a scary time but you are in the right place as these ladies are the only ones who truly understand what you are going through. They helped get me to where I am today (I suppose my Onc had a bit to do with it too) with there love and support and advice and were the only ones who moved the ever present fear from the pit of my stomach. I am on my second treatment of chemo and am having amazing results to the multiple tumours in my lungs with near complete resolution. I'm sorry you are where you are now but I promise there will be better days. Lots of them. Hugs to all you wonderful people. Lisa",
      "MessageIndex": 3,
      "PostDate": "26/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692741",
      "Title": "Metastatic at presentation Kelolo Annie4"
    }
  ]
}