{
  "AuthorID": "LISAMG",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
  "Posts": [
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "May 25, 2012 08:49PM LISAMG wrote: Blondie. Has anyone suggested genetic testing for your mom and her sister??? They should be tested first for a possible family mutation since both developed BC in the 40's, a red flag for sure. If your mom is negative, there's no reason for you to test....but lots of reasons for close vigilance! Be sure the breast specialist is an oncologist too. Best wishes.",
      "MessageIndex": 10,
      "PostDate": "25/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/788000",
      "Title": "Should I see a breast specialist? blondie0236 blondie0236"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Feb 10, 2010 10:23PM - edited Feb 10, 2010 10:30PM by LISAMG Another Lisa Marie here and I urge you to consider testing, regardless of your mom's results. Why? Do it for your self and your children's sake. PLEASE first seek the advice of a certified genetic counselor, as they are the most up-to-date professionals to guide you.  I do not understand your mom's \" inconclusive\" test results. Positive or negative?? 2005 was not that long ago, either your mom had the gene, she was negative or she tested with a variant of undetermined significance. If she were BRCA positive, you have a 50% chance of testing positive OR negative. Remember, knowledge is power and even if you have the gene, its something you were born with and now know there are steps you can take to be proactive. Very personal decisions, but ignorance can also sometimes be lethal. Two other strong recommendations after genetic counseling/testing, for you. Get a copy of the newly released book, \"Positive Results\", by Joi Morris. Its a comprehensive book with everything you want to know, but afraid to ask!!  Also, visit www.facingourrisk.org for info. and support for high risk women who have a predisposition to hereditary cancer. Explore the web site, visit the messageboards and find a local outreach group in your area where you can meet other women who share your experiences. You will be empowered. We are here for you and please know you are never alone!! Sending you best wishes for totally B9 biopsy results and keep us posted.",
      "MessageIndex": 6,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/748163",
      "Title": "To Test or Not To Test.... squidgee mawhinney"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jun 15, 2012 08:39PM LISAMG wrote: Ditto! Ice packs and wearing a sports bra were my best friends after 2 ductal excisions. Good luck!",
      "MessageIndex": 2,
      "PostDate": "15/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789125",
      "Title": "Duct excision victoriah68 sunedaze-52"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 8, 2011 09:07AM LISAMG wrote: Hi Kat, I am un-informative BRCA negative with multipe bc/ovca cases on both sides of my family. No [2] affected family members have the BRCA gene either. If your test comes back negative, u would then be considered BRCA un-informative negative as well, providing no affected family members have tested to identify a possible mutation. My suggestion to you would be to alternate your mammo with a sono together and the MRI 6 months later.  As a result, u will have a better chance for early detection with every 6 month screenings vs. annual screenings. My genetic testing and risk reducing NSM was approved based on family history alone, using evidenced based criteria by the insur. co. with no problems. It took me 4.5 years to make a decision after seemingly endless agonizing torture, but surgery is not for everyone. I could no longer endure the grueling surveillance with a history of multiple surgical biopsies and dense breast tissue. You are doing all you can at this point. Gather all the facts, take your time and talk to others. Is it possible for any of your aunts to have genetic testing? Did u meet with a genetic counselor or did u have your BRCA testing thru a physician?  Keep us posted. Sending u lots of BRCA negative wishes  :))  Best, Lisa",
      "MessageIndex": 1,
      "PostDate": "08/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/774387",
      "Title": "What to think??? KatMJ KatMJ"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 9, 2011 10:29AM - edited Sep 9, 2011 10:41AM by LISAMG My happiness & relief are simply beyond immeasureable with far better looking breasts now than before my surgery. Undoubtedly i owe thanks to my amazing surgeons for providing me with \"cutting edge reconstruction\". Feeling a huge sense of normalcy and reducing my risks are both priceless. Only wished i hadn't waited so long, but the lengthy \"homework\" process & research was self gratifying. As a result, i made a wise and fully informed personal decision, i feel. Your assumptions are correct in that i had little or no choice...my quality of life was very poor.  Stay vigilant, remain proactive with your breasts and be your own advocate....are my best recommendations. When/if the time is ever right, u will know.",
      "MessageIndex": 3,
      "PostDate": "09/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/774387",
      "Title": "What to think??? KatMJ KatMJ"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jul 16, 2010 07:22PM LISAMG wrote:  Get an MRI for a clearer picture/understanding of whats going on in both breasts since ILC puts you at increased risk for BC in the opposite breast. This will help the surgeon and you decide what the best plan is for YOU!! Did you have a biopsy or a lumpectomy so far??",
      "MessageIndex": 4,
      "PostDate": "16/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/755447",
      "Title": "trying to understand my patholigy report kira1234 kira1234"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 28, 2011 12:47PM LISAMG wrote: MSV. Please visit www.facingourrisk.org for the most info. regarding HBOC/BRCA. We are the only organization devoted to women's hereditary cancers. U will find many women in your shoes, either doing surveillance or risk reducing surgery. Seek the main forum messageboards and ask questions. The other organization i would strongly recommend is www.bebrightpink.org devoted specifically to young women like u. Both groups have outreach support programs at the local level. Where do u live? If u have questions or concerns, jst send me a PM and I will gladly assist u in any way I can.",
      "MessageIndex": 6,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764059",
      "Title": "BRCA1 + and need advice msv1984 CandDsMom"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Oct 2, 2010 01:27PM - edited Aug 20, 2013 02:51AM by LISAMG For financial assistance with BRCA testing, see the link below!! Payment Options and Health Insurance Reimbursement : http://www.myriadtests.com/index.php?page_id=51&usetemplate=pathome&usetype=1",
      "MessageIndex": 3,
      "PostDate": "02/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/758673",
      "Title": "BRCA testing Cu99 lago"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 26, 2010 09:08PM LISAMG wrote: Go to http://www.bebrightpink.org/ where you will find lots of support/knowledge specifically with young women like you  AND also visit http://www.youngsurvival.org/ , another fabulous group for tons of support and friends. These groups are totally deevoted to the under 30 age group. Best wishes.",
      "MessageIndex": 9,
      "PostDate": "26/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/747329",
      "Title": "Is anybody else as young as i am? sumby nmiller"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 4, 2009 09:57AM LISAMG wrote: Remember, 80% of all biopsies are benign. Pretty good stats given to you with 90% too.  Shadows are often benign. Best wishes to you.",
      "MessageIndex": 3,
      "PostDate": "04/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/739951",
      "Title": "HAS ANYONE GETTING A BIOPS BEEN GIVEN A PERCENTAGE? juliarose sheila888"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Aug 27, 2009 08:02PM LISAMG wrote: With a family history of BC, have you considered genetic counseling/testing for the BRCA genes? Has you mom been tested? This may help you with your diagnosis and long term plans. Have you had a breast MRI pre/post diagnosis? If not, this would be highly recommended. Sending you benign wishes!!",
      "MessageIndex": 3,
      "PostDate": "27/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/739376",
      "Title": "Just had 2 lumps removed and found a third lump this morning tovahsmom tovahsmom"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Nov 20, 2011 08:11PM LISAMG wrote: kbeyer, I am sorry for your losses and yes, u have every reason to be concerned for yourself and for your sister, especially given your significant family history. My best advise is to seek genetic counseling to determine if genetic testing is warranted. You could potentially have a BRCA mutation originating from both sides of your family. Anyone else on your Mom's side of the family with BC or OVCA?  Take a look at www.bebrightpink.org an organization devoted specifically for young women at risk for an invaluable resource. Best wishes.",
      "MessageIndex": 5,
      "PostDate": "20/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/777688",
      "Title": "High Risk and with Fibroadenoma at 22 kbeyer30 LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 8, 2009 07:21PM - edited Dec 11, 2009 07:32PM by LISAMG The gold standard of care with breast lumps is a needle biopsy PRIOR to surgery, whether it be stereotactic, core, FNA or image guided biospy.  This may be performed at the radiology center where your ultrasound was done, provided the center does only breast imaging.  If not, the nearest breast imaging center affiliated with a large hospital would be ideal as well. I do not agree with your ob/gyn with immediate removal that may require additional surgery. With a needle biopsy or biopsies, immediate results are provided within 48 hours. A breast surgeon would then know exactly how to proceed. Please discuss this further before consenting with surgery that could potentially be un-necessary for all 3 areas of question. If the areas of question are indeed abnormal, I would then consider a breast MRI to obtain a clearer picture of what is going on with both breasts, if anything. Best wishes and I hope you get answers soon.",
      "MessageIndex": 1,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/745103",
      "Title": "Surgery rather than Biopsy?? nic72806 desdemona222b"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Aug 20, 2011 12:42PM LISAMG wrote: Grab a copy of these 2 books: Previvors, by Dina Roth Port and the other is Positive Results, by Joi Morris & Ora Gordon. Excellent sources for all high risk women with HBOC!!",
      "MessageIndex": 6,
      "PostDate": "20/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773329",
      "Title": "MANY cysts & BRCA testing question KatMJ LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Apr 6, 2010 10:56PM LISAMG wrote: Mammograms post mastectomy is certainly not considered standard of care, especially with implants from my understanding.  A sonogram would be appropriate and/or MRI to detect an abnormality and/or rupture of implants. I am shocked to hear women are having this done, actually. Where is the data and/or rationale to support the value of a mammo?",
      "MessageIndex": 11,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/750565",
      "Title": "This May Sound Silly amlg1 Musical"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "May 23, 2010 09:22PM LISAMG wrote: With your significant family history, have you had genetic counseling/testing?? If not, time to take care of you!! Keep the appointment..you need answers.",
      "MessageIndex": 10,
      "PostDate": "23/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752921",
      "Title": "Nipple discharge--when to worry? slyspyder Moderators"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Oct 30, 2010 09:41PM LISAMG wrote: The MRI results should be known within 48 hours. It will provide you and your docs a clearer picture of whats going on in both breasts. This info. may also guide you with your decision making for surgery. Unfortinately, the MRI can reveal false positives and because of this reason, its not recommended for the general population. Given you have an early staged diagnosis, the MRI will be very beneficial. I would call for your results within 2 -3 business days the most!! Best wishes.",
      "MessageIndex": 7,
      "PostDate": "30/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/760034",
      "Title": "Diagnosed 10/19/10 luvmykids143 meme31"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Oct 11, 2009 10:28PM LISAMG wrote: I was told my MRI needed to be 7-14 days from the first day of cycle due to higher rates of false positives. Since breast tissue changes according to the menstrual cycle and/or hormones, this window period eliminates these chances of having false abnormalities.",
      "MessageIndex": 3,
      "PostDate": "11/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/741958",
      "Title": "Question about MRI...? paris1926 unklezwifeonty"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Oct 2, 2010 01:40PM LISAMG wrote: Nyx, See if you can have your mom tested since she was young at the time of her diagnosis, yes 43 is young to have a possible mutation. I strongly recommend genetic counseling for mom. If she is positive, you would have a 50% chance of being positive OR a 50% chance of being negative too!! Since you have bc/ovca in dad's side, this is important too. If anyone has both cancers, this can be suggestive of a brca mutation, as you indicated with your paternal gm. Best wishes and for being proactive for yourself.",
      "MessageIndex": 14,
      "PostDate": "02/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/758209",
      "Title": "Am I \"high risk\"? Nyx Moderators"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 3, 2009 08:48PM - edited Sep 3, 2009 09:13PM by LISAMG Silverlady, It is my understanding that your cancer may be triple negative. Is this correct? If so, triple negative BC is usually very aggressive and does not respond to many types of conventional chemo. drugs. Only you can decide what is best & you are being very proactive...certainly not radical, if this is the case.  Best wishes, no matter what you personally decide. Wishing you a speedy recovery too. FYI: Coolbreeze, LCIS is considered a tumor marker and not cancer in itself. However, LCIS puts you at a much higher risk for invasive cancer in BOTH breasts. Have your physicians given you info. regarding LCIS and your High grade invasive tumor?  Just my 2 cents and something to think about. I noticed you have a family history of BC with your mom. Any other family history that may indicate a genetic pre-disposition?? Your  Age? Given the [+] family history and if you are under the age of 50, you may also wish to consider genetic counseling. Has anyone suggested this? Take your time, do the research and gather all the facts to make a fully informed decision.  Best wishes to you. LeeMc, Best wishes to you with your upcoming surgery and doing what is best for YOU!!",
      "MessageIndex": 9,
      "PostDate": "03/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/739799",
      "Title": "Just diagnosed silverlady LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 3, 2009 10:01PM - edited Sep 3, 2009 10:02PM by LISAMG  Vegas!!! I miss you too, girlfriend. Nice to see you. Great advice offered from someone who knows the real deal as you...you never cease to amaze me one bit because you're a true warrior. Lisa, just a previvor xoxo",
      "MessageIndex": 11,
      "PostDate": "03/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/739799",
      "Title": "Just diagnosed silverlady LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 11, 2010 10:25PM LISAMG wrote: AboutLori, Congrats to you!!! Be sure you have follow up breast imaging [mammo and/or sonogram] scheduled in 6 months since this is standard of care with any biopsy, especially with a FNA because of the tiny tissue sample tested. Relax and enjoy!",
      "MessageIndex": 18,
      "PostDate": "11/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/746561",
      "Title": "Still waiting AboutLori AboutLori"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 8, 2009 01:08PM - edited Sep 8, 2009 01:09PM by LISAMG Coolbreeze!! Glad to hear you're getting the MRI that may provide you with more conclusive answers in making a fully informed decision. Again, my concerns for you are LCIS making you higher risk and your tumor being high grade [3]. Sending complete benign wishes your way!",
      "MessageIndex": 19,
      "PostDate": "08/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/739799",
      "Title": "Just diagnosed silverlady LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 10, 2010 06:28PM LISAMG wrote: Totally un-acceptable, its not standard of care for a needle biopsy with no results at this time. Perhaps, your specimen was lost?? I would NOT wait another minute and demand answers now. Dont stop till you get what you deserve!!",
      "MessageIndex": 8,
      "PostDate": "10/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/746561",
      "Title": "Still waiting AboutLori AboutLori"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 4, 2013 08:02PM LISAMG wrote: Sent u a PM NYCM :)",
      "MessageIndex": 4,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/798318",
      "Title": "Having Second Thoughts about doing Lumpectomy for ALH NYCMs ballet12"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Apr 20, 2010 09:54PM LISAMG wrote:",
      "MessageIndex": 4,
      "PostDate": "20/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/751485",
      "Title": "ALH is NOT cancer, right? keiko tgood02"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Apr 24, 2010 04:39PM LISAMG wrote: Teachskincare1, Sorry you are dealing with such heavy stuff and you have time to reach a decision, one only you can make thats best for YOU. A few questions I would need answers before any surgery:  Why a bilateral mastectomy? Do you have DCIS in both breasts or just one breast? If its just in one breast, a single mastectomy may also be an option, but some women will opt for a bilateral for symmetry and/or other reasons. What is the grade of your tumor? High grade or grade 3 is often aggressive. Is your DCIS contained in one area or Is it multi-focal?? This would be important to know!!  What is the tumor size?  Do you have a strong family history of BC and/or OVCA?  Your surgeons really need to fully inform you WHY the double mastectomy is being recommended. DCIS can often be an indicator/marker for invasive breast cancer. If you receive satisfactory answers, then you will make a fully informed decision. If you are in doubt at all, please seek another opinion prior to any surgery even if it means waiting a bit longer. Best wishes and keep us posted. Lisa",
      "MessageIndex": 4,
      "PostDate": "24/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/751751",
      "Title": "DCIS at 43 Teachskincare1 SJW1"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 12, 2010 03:02PM - edited Aug 20, 2013 05:23AM by LISAMG",
      "MessageIndex": 7,
      "PostDate": "12/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/761869",
      "Title": "ADH- treatment options momma_of_3 vmudrow"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 24, 2010 08:11PM LISAMG wrote:",
      "MessageIndex": 7,
      "PostDate": "24/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/762394",
      "Title": "Atypical Ductal Hyperplasia 2 years following IDC Stage II eeyore2515 bdavis"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jun 1, 2011 08:47PM LISAMG wrote:",
      "MessageIndex": 3,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/769734",
      "Title": "NYC surgeons sara1970 Hortense"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Mar 30, 2012 03:19AM LISAMG wrote: Hi there, If i understood you correctly, are you having double lumpectomies, one for the IDC and the other for the LCIS?  Do you have any family history of BC? Have you had a breast MRI? I consulted with one of the above surgeons, but chose to have surgery elsewhere. Best wishes to you for a one and done surgery & a complete recovery !",
      "MessageIndex": 1,
      "PostDate": "30/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/784935",
      "Title": "choosing a surgeon in NYC spinner LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jul 9, 2009 02:33PM LISAMG wrote: Mandi, Sorry you are dealing with all this heavy stuff. I agree with simpsojc from above to find out whether or not you carry the BRCA gene. Your family history is very compelling for a genetic pre-disposition.  It would be important in also knowing if you are high risk for ovca as well. If you have children, they would also have a 50% chance of having the mutation. Has your mom been tested? It would be recommended for her to test first, since she was affected, and then you would know whether or not to proceed ahead. Many insurance co's will authorize surgery based on family history alone such as what my case is, but I still have not done any surgery. You have lots of options so, do not rush and decide what YOU want. Skin or nipple sparing, implants or flap procedures,,,there are lots of choices. Best wishes and keep us posted. BTW, what was your pathology from previous surgeries? This may help you too. Lisa",
      "MessageIndex": 4,
      "PostDate": "09/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/737131",
      "Title": "Help...Doc recommends elective mastectomy... Mandi322 Georganne"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 16, 2009 08:50PM LISAMG wrote: A spontaneous clear and/or bloody nipple discharge can be worrisome, but not always. There are many benign reasons, as mentioned above with a papilloma or even with duct ectasia [due to stretching of the ducts]. I had similar symptoms with a benign biopsy done. The odds are in your favor this is benign and glad you are getting this evaluated. Keep us posted.",
      "MessageIndex": 3,
      "PostDate": "16/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/745431",
      "Title": "Worried about nipple discharge.. diva9487 diva9487"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "May 24, 2010 05:16AM LISAMG wrote:",
      "MessageIndex": 6,
      "PostDate": "24/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/752961",
      "Title": "mri result question texasgirl150 MRDRN"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Nov 5, 2011 03:20AM - edited Nov 5, 2011 03:22AM by LISAMG 10 days is definitely not standard of care for any core biopsy results which take 72 hours or less to process. I would demand answers on Monday and dont settle for anything less from the radiologist and/or the ordering physician. Why isnt your doctor pursuing results for u?? Bottom line, this is totally un- acceptable. Good luck!",
      "MessageIndex": 6,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/777545",
      "Title": "It's been ten days now miricurt538 miricurt538"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jul 12, 2009 10:36PM - edited Jul 12, 2009 10:39PM by LISAMG Most insurance co's cannot refuse BRCA testing, especially with a first degree relative testing positive. All you need is a letter of medical necessity by your doctor and/or genetic counselor. The testing will be very simplified and affordable since you already have a family BRCA1 mutation. You need to know if you are increased risk for ovca as well. Myriad will even expedite your results. They will only cover testing for those unemployed and/or without insurance. Seek genetic counseling/testing soon. Best wishes.",
      "MessageIndex": 12,
      "PostDate": "12/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/737131",
      "Title": "Help...Doc recommends elective mastectomy... Mandi322 Georganne"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Nov 3, 2010 06:43PM LISAMG wrote: http://www.cancer.gov/cancertopics/factsheet/Detection/screening-mammograms See above link for all the BIRAD classifications and explanations. Normally, u will not find your BIRAD score unless you inquire. Some radiology facilities will indicate scores on your reports. My facility happens to be one of a few where your results & score are given to u the very same day.",
      "MessageIndex": 4,
      "PostDate": "03/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760266",
      "Title": "BIRADS ??? Rshep9101 LJ13-2"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 20, 2009 10:39PM LISAMG wrote: Who ordered the mammogram? Why not get a 2nd opinion? I agree I would not wait. Seek a breast surgical oncologist's opinion. Get a copy of BOTH reports to find out exactly what this area of interest is and pay close attention to the wordings used in the description of this area.",
      "MessageIndex": 1,
      "PostDate": "20/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/740691",
      "Title": "Found \"area of interest\" mammogram elme2758 Lisa1962"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 15, 2011 09:12PM LISAMG wrote: What abnormal findings do u have that are prompting a possible biopsy? A breast surgeon, and not a general surgeon, would be my best advice. Ask why or why not he/she would recommend an excisional procedure. Have u had a needle biopsy of the questionable area yet, as this is always the 1st step before surgery? Imaging studies? One step at a time and remember 80% of all biopsy findings are benign!! Best wishes.",
      "MessageIndex": 1,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763434",
      "Title": "Any questions I should be asking about an excisional biopsy? Robynmummy Robynmummy"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Feb 19, 2010 07:51PM LISAMG wrote: This definitely requires another EXPERT opinion because of the different interpretations in slides which can also make all the differences in the world for your wife's best treatment plan. If this were myself I would seek the best pathologists in the country located at Vanderbilt University, in my opinion. Having done research and after speaking with many others, they will tell you the same. Unfortunately, I do not have names, but a few phone calls would give you the referrals you need. Here is a link to VU's web site for starters. If no luck, ask for the department of breast pathology and go from there. Best wishes. Kudos to YOU for being the best advocate for your wife. http://www.vanderbilthealth.com/breastcenter/19337#pathology Pathology slides \"If a biopsy has been performed somewhere other than Vanderbilt during your diagnosis, please obtain the glass slides and written pathology report from the facility where your test was done and have them sent to us prior to your first appointment. Vanderbilt pathologists will review these slides and confirm your diagnosis if the original pathology diagnosis was made at another facility.  \"   ",
      "MessageIndex": 9,
      "PostDate": "19/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748557",
      "Title": "Posted the on another forum, 3 pathologists 2 opinions? Lesinindy SeasideMemories"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Aug 8, 2009 07:52PM - edited Aug 8, 2009 10:15PM by LISAMG Having a 3 cm tumor with HIGH grade can be worrisome for recurrence and the first 2 yrs give you highest risk then 5 yrs., Plus, you have pre-malignant findings in opposite breast....gather all the facts, get opinions and you will find whats best for you!!",
      "MessageIndex": 6,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/738657",
      "Title": "Prophylactic bilateral mx after \"successful\" treatment? thegoodfight Daudine"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 25, 2010 07:38PM - edited Aug 20, 2013 02:49AM by LISAMG Send me a PM and I would be happy to share my consult experiences with you. I did not choose this surgeon for my PBM for various reasons. Its important to gather a few opinions to make a fully informed decision, I strongly believe. Are you considering a nipple sparing or skin sparing procedure?? Have you been diagnosed with BC? Are you planning on having immediate reconstruction? The MRI question is a good one. Unfortunately, I have no answers, but i do know of several women who had breast MRIs despite having clips with no problems. The MRI will allow the surgeon to develop the best plan for you prior to surgery and you need to be assured nothing is going on in the opposite breast as well. Best wishes.",
      "MessageIndex": 1,
      "PostDate": "25/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/758283",
      "Title": "Dr. Swistel Cornell Weil MissTW MissTW"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jun 12, 2011 12:03AM LISAMG wrote: Aromatase Inhibitor Reduces Breast Cancer Risk for Postmenopausal Women at High-Risk . http://www.cancer.net/patient/Cancer+News+and+Meetings/ASCO+Annual+Meetings/Research+Summaries/Breast+Cancer/Aromatase+Inhibitor+Reduces+Breast+Cancer+Risk+for+Postmenopausal+Women+at+High-Risk",
      "MessageIndex": 9,
      "PostDate": "12/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/770052",
      "Title": "I really need wisdom on what to do. Elibet AJ251"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Feb 13, 2010 03:32PM - edited Feb 13, 2010 03:37PM by LISAMG Julie, its normal for you to have this shared anxiety before testing especially given your mom's difficult journey which puts you at higher risk too. May I ask how old your mom was at the time of her initial diagnosis?? Do you have any other family history? If she was premenopausal, less than 50 yrs of age with or without any other family history, you may wish to consider genetic counseling that may provide a clearer pic for you.  Keep us posted. Wishing you squeaky clean results! PS- I am high risk and feel you worry/fears every 6 months thinking something will be found each & every time. Its definitely NOT easy, but prevention & early detection are always the ultimate goal. I also sought genetic testing due to a strong family history with a fabulous genetic counselor. Be proactive and vigilant.",
      "MessageIndex": 5,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/748235",
      "Title": "Here I am again, 1 year later Julie_1958 puddingirl84"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jul 9, 2009 06:04PM LISAMG wrote: Hi Mary & others, Sorry to hear about your BRCA2 mutation, but glad you found FORCE, a 10 yr old organization devoted to increasing awareness for families with a hereditary pre-disposition to breast/ovarian cancers. I have belonged to FORCE for 3 yrs now and we are an amazing community. The support and women I have met are immeasurable. We have local outreach programs all over the country, quarterly newletters, messageboards, hotline for help, and an annual 2 day conference held each year in Florida. I am also the outreach coordinator for Long Island and you may reach me anytime thru FORCE email for assistance. I can connect you with other outreach coordinators as well. Breastcancer. org is amazing and I just recently found myself here too. Please visit the messageboards of FORCE where you will find lots of BRCA positive women.. Best wishes to you. Lisag@facingourrisk.org ",
      "MessageIndex": 35,
      "PostDate": "09/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/735571",
      "Title": "Getting BRCA test when no one else in family is tested kibbles Mutd"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 11, 2009 11:33PM - edited Sep 11, 2009 11:37PM by LISAMG Nana, I am so sorry you are dealing with so much all at once with you and your Mom. One step at a time and deep breaths. I noticed you mentioned your Mom's recent diagnosis with pancreatic cancer and with your new diagnosis of BC @ 37, both of these can be red flags for genetic pre-disposition of the BRCA2 gene. With a mastectomy being recommended, you may wish to consider genetic testing that may help you with decisions. Having the gene puts you at higher risk for BC in both breasts, higher risk for ovarian cancer and pancreatic cancer. Will you be having an MRI soon? This will help your decision making process and to make sure nothing is going on with opposite breast. I have no recommendations here on LI, my location as well. I also chosen doctors at NYU Cancer Center and very satisfied. Take your time, gather all the facts and decide what is best for YOU. My prayers for both of you!",
      "MessageIndex": 6,
      "PostDate": "11/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/740256",
      "Title": "just diagnosed...can't believe it!!! nanadada nanadada"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Apr 9, 2012 10:34PM LISAMG wrote: Hi dventi! I assume u r looking for a breast surgeon and not a PS. I would be happy to share my positive experiences of Richard Shapiro, surgical breast oncologist @ NYU Cancer Center. PM me anytime for more details. He is an amazing, compassionate & meticulous surgeon who strives to treat the whole person and not just a disease. If u r looking for the same qualities with a PS, just let me know too. See link below: http://www.med.nyu.edu/biosketch/shapir01",
      "MessageIndex": 4,
      "PostDate": "09/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/785542",
      "Title": "NY Breast Surgeons dventi ashla"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Aug 26, 2009 10:37PM - edited Aug 26, 2009 11:16PM by LISAMG FYI: Shelia & Barb, Yes, it is considered standard of care by the majority within the oncology community for papillomas to be removed since there is a chance of nearby malignancy. I believe your surgeon has your best interest in mind. There is much recent research to support excisional biopsy needed. Any columnar cell changes can sometimes raise a red flag with a papilloma, Barb. I would follow up sooner than 6 months, if it were me. Its all about advocating for YOU and early detection. Why not seek a 2nd opinion with your biopsy results? Excision is indicated for intraductal papilloma of the breast diagnosed on core needle biopsy http://www.ncbi.nlm.nih.gov/pubmed/19402174?ordinalpos=14&itool=EntrezSystem2.PEntrez.Pubmed.Pubmed_ResultsPanel.Pubmed",
      "MessageIndex": 7,
      "PostDate": "26/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/739476",
      "Title": "Biopsy b9 but still excision? sheila1951 barb3246"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Nov 21, 2010 11:30PM - edited Aug 20, 2013 06:14AM by LISAMG From one nurse to another, definitely consider seeking genetic counseling with your family history. Why not? You can always decide afterwards if you wish to proceed with the BRCA testing or not. Knowledge is power!! You should have an affected family member test first. Has your sister been tested?? If not, she should consider doing so for your sake and any children as well. If your sister is positive, you would then have a 50% chance of being positive as well. Good luck.",
      "MessageIndex": 4,
      "PostDate": "21/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761045",
      "Title": "I know the stats but still worried..... rn4babies rn4babies"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 7, 2010 05:11PM - edited Sep 7, 2010 05:27PM by LISAMG Seek a high volume breast imaging center and NOT a radiology facility that performs other tests as well. You want radiologists that interpret breast scans all day long. Ask whether the MRI has CAD capability, or computer aided detection. Not all MRI machines have this added software, an important tool. Many NCI Cancer Centers are using the 3T breast MRI, this features added magnet strength that can detect tumors as small as 4mm!!! I had the 3T MRI done in Manhattan @ NYUCC, an excellent NCI facility.  Are you located near any major cancer center or medical center?? False positives are common with the MRI, but for any high risk woman its also the BEST defense for prevention and/or recurrence.",
      "MessageIndex": 1,
      "PostDate": "07/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/757646",
      "Title": "MRI screening christine1111111 Fearless_One"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 29, 2009 11:27PM LISAMG wrote: How very sad & un-acceptable to know some medical professionals continue to provide WRONG information regarding hereditary cancers to their patients. I would suggest your daughter consider finding another doctor who is knowledgeable and more qualified. Why pap smears every 6 months too? Your daughter & son-in-law both may benefit highly from genetic counseling/testing since they are truly the most up-to-date professionals for proper guidance. Are you and/or your daughter BRCA positive?!  If so, she should be having annual breast MRI as well. Best wishes!!",
      "MessageIndex": 4,
      "PostDate": "29/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/745979",
      "Title": "stage IV concerned for my daughter vivo vivo"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Nov 28, 2009 01:43AM - edited Nov 28, 2009 01:43AM by LISAMG Seek genetic counseling for the BRCA genes, if not done already. Is there a genetic mutation in your family? Has your mom had genetic testing? How old was your mom when she had BC?  If you have dense breasts, you may also be a candidate for the MRI. Consider enrollment in a high risk surveillance program as well, preferably in a major cancer center. Your doc should be grateful that you will not take his ill advice and seek attention elsewhere!! Best wishes.",
      "MessageIndex": 1,
      "PostDate": "28/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/744581",
      "Title": "Next Steps bean421 Lisa1962"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Feb 20, 2010 03:44AM - edited Feb 20, 2010 03:58AM by LISAMG This definitely requires another EXPERT opinion because of the different interpretations in slides which can also make all the differences in the world for your wife's best treatment plan. If this were myself I would seek the best pathologists in the country located at Vanderbilt University, in my opinion, by sending them slides and reports. Lots of women have 2nd opinions performed at VU. Having done research and after speaking with many others, they will tell you the very same. Unfortunately, I do not have names, but a few phone calls would give you the referrals you need. Here is a link to VU's web site for starters. If no luck, ask for the department of breast pathology and go from there. Best wishes. http://www.vanderbilthealth.com/breastcenter/19337#pathology Pathology slides \"If a biopsy has been performed somewhere other than Vanderbilt during your diagnosis, please obtain the glass slides and written pathology report from the facility where your test was done and have them sent to us prior to your first appointment. Vanderbilt pathologists will review these slides and confirm your diagnosis if the original pathology diagnosis was made at another facility.  \"   ",
      "MessageIndex": 1,
      "PostDate": "20/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/748553",
      "Title": "when pahtologists do not agree Lesinindy moogie"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 8, 2011 04:14AM LISAMG wrote: The gold standard for breast biopsies is a needle biopsy to identify an abnormality, performed by a radiologist skilled with breast imaging, whether its sterotactic, core, MRI/mammo/sono guided. If positive, then a breast surgical oncologist would be recommended and not a general surgeon, if possible. BTW, there is a difference between general vs. oncologist surgeons too....whatever makes u most comfortable. Best wishes!",
      "MessageIndex": 12,
      "PostDate": "08/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/774373",
      "Title": "general or breast surgeon for biopsy 1flowergirl1 Gottobme"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "May 2, 2010 07:47PM - edited May 2, 2010 07:48PM by LISAMG JuJu, just curious as to how you were given a copy of your results without speaking to your doctor??!! This really needs to be done soon, so you have a complete understanding of these important findings and the next steps to be taken. Do you have any family history of BC? You are high risk, especially given your very young age & will need follow up surveillance and further interventions. Please let us know what happens, we care.",
      "MessageIndex": 3,
      "PostDate": "02/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/752091",
      "Title": "biopsy results jmsiu Debbie2791"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jun 27, 2010 11:00PM - edited Jun 27, 2010 11:02PM by LISAMG FYI-  There are many NCI Cancer Centers offering nipple sparing so do not be mis-informed that they are not offering this procedure. I will be having a preventative NSM performed soon at an NCI Center. I am confident with my risk reduction being quite satisfactory with the cosmetic outcome outweighing the oncological risks. The chances of developing a carcinoma at the site of the NAC is extremely low, approximately 2-3% risk, acccording to most research. Nipple sparing can also be offered with ALL types of reconstruction, whether it be flaps, direct immediate implants or expanders. Much of the success of nipple sparing is due to the surgeon's experience/ technique,  using scalpel dissection AND placement of incisions. If any surgeon tells you many and/or most nipples become necrotic or lost with this procedure....FIND ANOTHER SURGEON. Surgeons who are against this procedure have no experience and minmal knowledge of the oncological safety. Women simply need to know all their options. Another important factor regarding frozen sections done intra-op during the procedure, all nipples are biopsied during surgery , but frozen sections are not completely reliable and a real biopsy requires a full comprehensive pathology report. Many surgeons do not perform frozen sections for this reason and will remove any nipples AFTER a full pathology is completed. This usually means another surgery a week or later after the mastectomy, but this is extremely RARE!! One top nipple sparing surgeon who has performed over 250 NSM's told me its happened  twice in his career. Below are several great articles for those wanting to learn more information about the viability of nipple sparing option!!!  http://www.diepflap.com/nipple_sparing_mastectomy.html http://www.ncbi.nlm.nih.gov/pubmed/20101646?itool=EntrezSystem2.PEntrez.Pubmed.Pubmed http://www.ncbi.nlm.nih.gov/pubmed/19483564?ordinalpos=1&itool=EntrezSystem2.PEntrez.Pubmed.Pubmed http://www.ncbi.nlm.nih.gov/pubmed/18923874?ordinalpos=2&itool=EntrezSystem2.PEntrez.Pubmed.Pubmed_ResultsPanel.Pubmed_DefaultReportPanel.Pubmed_RVDocSum",
      "MessageIndex": 33,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/754399",
      "Title": "Please Read If You Are Considering a Preventative MX Kate33 daniellephillips"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Mar 18, 2010 11:12PM LISAMG wrote: I also have a strong family history of BC/OVCA with 3 members all testing negative, including myself. Been told there is a definite genetic component with other un-identified genes out there. Get the core biopsy and find out the results before doing the MRI. If your aunt tests positive, you can do genetic testing for the specific identified mutation. Testing for you and others would be far less costly & quicker since the gene would be isolated. If she tests negative, there would be no reason for you to test, but close surveillance is a must. You are doing all you can at this point...deep breaths and one step at a time. Remember, knowledge is power and you will feel much better after speaking with a genetics expert.",
      "MessageIndex": 3,
      "PostDate": "18/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/749900",
      "Title": "high risk worried about metastatic breast cancer alwaysworried03 shadow2356"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Nov 16, 2010 09:39PM - edited Aug 20, 2013 06:12AM by LISAMG I would really question another biopsy in 3 months without more detailed information here. Your findings are benign so why another procedure, especially without atypia??. Are you high risk? If so, Have you considered a breast MRI in 3 months to obtain a baseline study??. MRI's may be very helpful with your situation and provide early detection not found on mammo/sono for the high risk population and for women with non-specific questionable lumps. Relax for now, gather all the facts and perhaps seek another opinion and/or more imaging in 3 months, if needed. Best wishes.",
      "MessageIndex": 1,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760843",
      "Title": "benign results vs repeat biopsy nursing_51 nursing_51"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 4, 2010 03:23PM LISAMG wrote: All benign!! Standard of care with any biopsy is a followup mammo and/or sono at 6 months. Been there and done that myself. What has your doc recommended?",
      "MessageIndex": 1,
      "PostDate": "04/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/761503",
      "Title": "Need help with this path report! rn4babies grammajan627"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Feb 27, 2010 01:35AM LISAMG wrote: Rubybaby, I am so sorry you have a reason for being here, but you will find lots of support. I also STRONGLY recommend you seek assistance from the only organization available for hereditary BC/OVCA , www.facingourrisk.org , as previously mentioned by others. Visit the messageboards where you will meet many women in your shoes, both previvors and survivors. Explore the articles/journal forum for lots of up-to-date research findings. We also have a local NYC Outreach support group with fabulous coordinators who can provide contacts for you and regular meetings/events. I can also point you to several studies with TNBC.  There is much we do not know about basal or triple negative Breast cancers. However, with young women this is often very aggressive with high rates for recurrence and/or a new primary, especially with BRCA 1 carriers. Your surgeon seems very proactive & may have your best interest in mind, especially knowing you had a sister with early age onset aggressive BC too. Any other BC/OVCA in your family? Have you spoken with a certified genetic counselor about your results?? They are the best professionals available to you for guidance. Gather all the facts/opinions and decide what is best for you. I also have some physician recommendations and/or genetic counselors in NYC if you like, both for hereditary breast and ovarian care. Send me a PM anytime and I would be happy to share my experiences with you. Deep breaths, we are here for you! Hugs, Lisa",
      "MessageIndex": 10,
      "PostDate": "27/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/705722",
      "Title": "BRCA1 Positive (Triple Negative) RubyBaby LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "May 30, 2011 01:00PM LISAMG wrote:",
      "MessageIndex": 2,
      "PostDate": "30/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/769536",
      "Title": "B9 biopsy, but now sent to surgeon Icoupontosavemoney Icoupontosavemoney"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Aug 29, 2011 03:21AM LISAMG wrote: Tatiana, standard of care is definitely a 6 month f/u for any woman having a surgical biopsy, this would include imaging as well, usually a mammo. Shame on this surgeon!! Time for another opinion without a doubt. Yes, its possible the area with LCIS found prior was missed with surgery, but didnt u have a marker and/or wire locate done?? Very confusing and i hope u get the answers u need. Good luck!",
      "MessageIndex": 17,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773455",
      "Title": "Has anyone had a nipple-sparing skin sparing mastectomy? ScaredInSnoqualmie momoschki"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Aug 30, 2011 02:53AM LISAMG wrote: Tatiana, be sure to get a copy of your full pathology report !!!",
      "MessageIndex": 24,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773455",
      "Title": "Has anyone had a nipple-sparing skin sparing mastectomy? ScaredInSnoqualmie momoschki"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Apr 15, 2011 09:55PM LISAMG wrote: Have you or any relatives had genetic counseling and/or testing? If not, its highly recommended with a significant family history such as yours. Together, all the combined imaging will give a clearer pic of whats going on with your breasts prior to any biopsy. Hope this is nothing, but glad u  and your doc are being vigilant. Keep us posted.",
      "MessageIndex": 2,
      "PostDate": "15/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/767594",
      "Title": "MRI with inconclusive results Lounursey Lounursey"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Oct 16, 2009 09:54PM - edited Oct 16, 2009 10:01PM by LISAMG I assume this imaging test you had done was an ultrasound. I would recommend you f/u with your gyn doctor and get a referral with a breast [oncology] surgeon. You need all your films and reports for the surgeon's evaluation too. Your BIRAD score of [4] indicates a biopsy is recommended and it seems you may have dense breasts.  I know plenty of women who had BIRAD 4 biopsies and all were benign, including myself. Being pregnant also means lots of breast changes due to constant hormone level fluctuations....all normal. However, you need answers and complete reassurance now. Be proactive. Best wishes & keep us posted.",
      "MessageIndex": 2,
      "PostDate": "16/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742244",
      "Title": "I dont have a PCP,Im trying to figure out the results myself... blackhotflame momzybaby"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Apr 23, 2010 11:15PM - edited Apr 23, 2010 11:19PM by LISAMG I agree with many others here. Too many MRI's with false positives is not a good thing, combined with 6 biopsies as well. Just curious... What type of insurance do you have that would cover such extreme diagnostic testing too? What is your family history like since you mention being high risk? Have you ever considered genetic counseling that may determine your true risk? Lots to consider, but having all your imaging under one high quality roof may be your best option. I agree with the suggestion of Dana Farber too. Judy Garber, MD is director of the BC high risk program and well known thru out the high risk/oncology community. Her contact info. is listed below: Judy E. Garber, MD, MPH Dana-Farber Cancer Institute 44 Binney Street Smith 210 Boston, MA 02115 Office phone: (617) 632-5770 Fax: (617) 632-2649",
      "MessageIndex": 6,
      "PostDate": "23/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/751705",
      "Title": "What Would You Do ? Need Opinions Please barb3246 LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Nov 28, 2009 10:15PM LISAMG wrote: Hi Keh, Sorry you have these worries and your family history seems significant in that a BRCA gene could be present on your Dad's side. This could mean a possible mutation as well. I highly recommend you seek genetic counseling. Where in NY are you located?  I had a fabulous certified genetic counselor at NYU by the name of Elsa Reisch. She is an amazing, intelligent and caring individual. Feel free to send me a PM if you would like the contact information. Best wishes.",
      "MessageIndex": 3,
      "PostDate": "28/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/744638",
      "Title": "I could use a little help/advice Kehjj2009 kreativek"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 17, 2010 11:26PM LISAMG wrote: Manda, Its very understandable for you to be scared, especially given your young age. BC is very rare for 20 yr olds, but can happen. Good news,,,fibroadenomas are very common in young women and can sometimes give the wrong impression of being something more when they are almost always benign. The discharge you are experiencing can also be attributed to a benign papilloma. Seeing a breast surgeon will be helpful, but you also need breast imaging studies to evaluate this lump such as a sonogram and/or MRI. The surgeon will need this information before doing anything. Ask her what she recommends, based on her clinical exam. Is the nipple discharge spontaneous or occur naturally? Do you have any family history on either side? Ask the surgeon more about fibroadenomas or a papilloma too. Best wishes too you. Keep us posted.",
      "MessageIndex": 1,
      "PostDate": "17/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/746925",
      "Title": "Scared and unsure MandaB87 idaho"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 24, 2010 01:32AM LISAMG wrote: Personally, I tend to agree with the oncologist and ps who seem to have your best interest in mind. Think about it... How would you ever know if the re-excision was successful or not in obtaining clean/clear margins...especially if a reduction and/or reconstruction are thrown in the mix at the same time?? This breast surgeon may OR may not not be providing standard of care for you. I recommend another opinion at the very least.  Your diagnosis is now upgraded from ADH to DCIS. You need clean margins to move forward in my unprofessional opinion, since you are inquiring about the critical issue of timing here. Why not consider a breast MRI too? This could also clear the air for you PRIOR to any further surgery. Gather ALL the facts to make a fully informed decision BEST for YOU!!",
      "MessageIndex": 2,
      "PostDate": "24/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746848",
      "Title": "not sure about timing for reexcision and reduction kayceedee LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Oct 9, 2009 02:01PM LISAMG wrote: Ductal carcinoma is the most common form of BC and with the most treatments/cure available. Unfortunately, not much more can be said here, until surgery when staging/size/grade/ hormone status is determined. Your Mom will get thru this and so will you. Knowledge is power. Soon she will have a plan best for her, provided by the surgeon and oncologist. Hang in there. Thoughts and prayers for your Mom.",
      "MessageIndex": 1,
      "PostDate": "09/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/741799",
      "Title": "My mother has just been diagonised with breast cancer rahullahiri LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Oct 12, 2011 02:05AM LISAMG wrote:",
      "MessageIndex": 23,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/774147",
      "Title": "awaiting surgery vamom vmudrow"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Mar 18, 2010 01:06PM LISAMG wrote: With a significant family history as yours, you need to seek genetic counseling for the best advice by a certified genetic counselor. Will your surviving aunt be willing to test for the BRCA gene? Always recommended for an affected family member to test first. You need vigilant surveillance and perhaps a high risk MRI. Do not go where you are traveling with thoughts of cancer at this point. What type of biopsy are you having done? Having a comparison sonogram with the mammo would also be recommended. Depending on your results, the MRI would give an accurate assessment. Wishing you benign results and keep the genetic counseling in mind. Try talking to your aunt or even try suggesting she go along with you to see a genetics expert together, especially if she also has children who may also be at risk...this would help the both of you trememdously by understanding your true hereditary predisposition.",
      "MessageIndex": 1,
      "PostDate": "18/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/749900",
      "Title": "high risk worried about metastatic breast cancer alwaysworried03 shadow2356"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Aug 25, 2011 04:30AM - edited Aug 25, 2011 04:41AM by LISAMG \" My surgeon told me I am not even in a risk factor group for genetic testing, because my Mom had BC after her menapause, and although I do have  Eastern European Ashkenazi background, it is on my father's, not my mother's side?  \" Tatiana, I am shocked by your breast surgeon's statements, quite honestly. BRCA women can develop post menopausal BC, not always, but BRCA 2 is often later aged onset. Is your mom alive? Ideally, she would be the first one to test since she is already affected. However. the biggest red flag is the negative hereditary false assumption by your equally important father's side, especially being that of Ashkenazi descent. What?? Men carry the faulty BRCA gene too, just like women. Please see a genetic counselor for possible testing since either side can be contributory. They are the most informed up-to-date professionals who can guide you thru the process. Are there any BC or OVCA cases on your dad's side?? Keep us posted,  ask lots of questions, do your homework and seek other opinions too. Best wishes, Lisa",
      "MessageIndex": 10,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773455",
      "Title": "Has anyone had a nipple-sparing skin sparing mastectomy? ScaredInSnoqualmie momoschki"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jul 5, 2009 01:06AM LISAMG wrote: FYI: Levine & Greenspun are fabulous! They are considered tops in the field of micro-vascular tissue flaps or DIEP. Both trained under Bob Allen, DIEP pioneer, who has done more DIEP's than any other surgeon. Allen and Levine also work in NYC together at NY Eye & Ear. Greenspun is only at Greenwich.  Allen also works at NYU with top breast surgical oncologists, Shapiro & Guth. ALL are super physicians!!",
      "MessageIndex": 17,
      "PostDate": "05/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/736289",
      "Title": "Prophylactic BLM for ADH? HelloFromCT Daudine"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Aug 14, 2009 05:23AM LISAMG wrote: Clarice, why not seeking genetic counseling? Has your sister been tested for BRCA genes? She should be tested first and then you will know if testing is recommended for you.  Best wishes for B9 findings!!!",
      "MessageIndex": 5,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738864",
      "Title": "Lump, worrisome mammo and u/s clariceak SandiH"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Oct 29, 2009 03:15AM LISAMG wrote: http://www.hemonctoday.com/article.aspx?rid=44574 2009 ASCO Breast Cancer Symposium Researchers in Canada have found that women aged 44 and younger were almost twice as likely to have cancer recurrence following breast conservation surgery and radiation therapy for ductal carcinoma in situ compared with women aged 45 to 50. Results of a retrospective study showed that the rate of recurrence was 20% in women aged 40 and younger (n=70) compared with 19% for women 40 to 44 (n=195) and 12% for women 45 to 50 (n=356). The HR for recurrence in women younger than 40 was 1.83 (95% CI, 1.00-3.36); it was 1.64 for those aged 40 to 44 (95% CI, 1.06-2.53), even after adjusting for the use of boost radiation, nuclear grade-3 and year of diagnosis. \"This is preliminary data and further work is needed to better understand why younger women have higher recurrence rates, as well as to determine the optimal treatment for young women with DCIS,\" said Iwa Kong, MD, a breast radiation oncology research fellow at the Sunnybrook Health Sciences Center, Toronto. She presented the results at the 2009 Breast Cancer Symposium in San Francisco. In a press release, she added that these results do not suggest that all younger women should undergo more aggressive surgery. Researchers evaluated the rate of recurrence among 624 women in Ontario aged 50 or younger. The women were diagnosed with ductal carcinoma in situ from 1994 to 2003. All underwent standard breast conservation surgery followed by radiation. Median follow-up was 7.8 years. Kong said there were 96 recurrences of both in situ and invasive breast cancers in the cohort (15.4%). Five-year OS was excellent and not different between groups at 97% to 99%. However, younger women had lower actuarial recurrence-free survival at five and 10 years. Five-year recurrence-free survival was 84% for women younger than 44 compared with 90% for those 45 to 50. - by Jason Harris",
      "MessageIndex": 1,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/742941",
      "Title": "Tripple + & cancer round 2...what now? amyk4199 LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 15, 2010 10:44PM LISAMG wrote: In a message from Joi, dated 1/14/10 she states: I received confirmation from my publisher today that the book will ship to bookstores who have already placed orders tomorrow. Copies shipped to me today. I will have copies by next Thursday as will many booksellers. I don't know if they will advance the release date once they have copies in stock, but it is possible. Joi",
      "MessageIndex": 3,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/746552",
      "Title": "\"Positive Results\", A Must Read for any woman @ High Risk!! LISAMG SandyinSoCal"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "May 14, 2012 04:25AM LISAMG wrote: I would strongly suggest genetic counseling/testing for your Mom, since she has already been affected by BC and she is the one to get tested. If positive, u have a 50% chance of carrying the mutation as well. One step at a time, gather all the facts and then proceed. If your mom were to test negative, perhaps her BC was sporadic, unless u have more family history with 2 or more members being affected. good luck!",
      "MessageIndex": 8,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/787366",
      "Title": "High risk but doctors won't perform a BMX j2kbbax girlguru"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Nov 18, 2012 11:01PM LISAMG wrote: Hi there ! I also used Richard Shapiro & Nolan Karp, both from NYU. Amazing surgeons with awesome results. If you are considering NSM, they're a dream team for high risk women. Sent u a PM with more details . Best wishes !",
      "MessageIndex": 8,
      "PostDate": "18/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/796338",
      "Title": "NYC Breast Surgeon Recommendation Please NYCMs Zer35"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Nov 28, 2009 10:43PM - edited Nov 28, 2009 10:44PM by LISAMG http://www.nsgc.org/resourcelink.cfm Visit the FORCE web site & message boards, the only organization devoted to hereditary breast/ovarian cancers: http://www.facingourrisk.org/finding_health_care/finding_specialists.html",
      "MessageIndex": 6,
      "PostDate": "28/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/744638",
      "Title": "I could use a little help/advice Kehjj2009 kreativek"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jun 29, 2010 11:47PM - edited Jun 29, 2010 11:58PM by LISAMG Isla, I want to be sure I absolutely understood you correctly so myself and other women here are NOT mis-informed about the viability & safety of nipple sparing for certain candidates when they meet specific criteria. I do not believe you were ever a candidate for nipple sparing based on the preop findings/information you provided. As you mentioned, you had a diagnosis of MULTIFOCAL ILC in your left breast PRIOR to the mastectomy. Is this correct? If so, it is my understanding nipple sparing would not be a possible option for you with this diagnosis, especially given its multifocality which is also characteristic of ILC. This could have resulted in negligence just as your breast surgeon suggested. If indeed this is the case and Pagets Disease of the nipple were found incidentially during surgery, as you also mentioned, then your surgeons provided you with Standard of Care by the skin sparing mastectomy you were given based on your PRE-OP Diagnosis and POST-OP Diagnosis. Women who have other certain pre-op carcinoma findings are eligible for nipple sparing, but this would often NOT include the specific findings you had, unfortunately. The bottom line is knowing what may be oncologically safe for certain diagnosis's may NOT be safe for others to be included for a NSM. I just wanted to clarify this for others so they may seek this possible option if deemed safe by many oncological surgeons. Many small invasive ductal carcinomas located far enough away from the NAC could be quite eligible for NSM, but not many invasive lobular carcinomas, again just as you described. Thanks for sharing your story and glad you are doing well!!!",
      "MessageIndex": 39,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/754399",
      "Title": "Please Read If You Are Considering a Preventative MX Kate33 daniellephillips"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Feb 5, 2010 05:01AM - edited Feb 5, 2010 05:03AM by LISAMG YES, I second the YAHOO very loudly and clearly. I personally know 2 reseachers involved in the plaintiff's case. They are completely devoted to the cause, especially since the ongoing reseach of others is being greatly hindered. They also have LOTS of inquiring genius minds & organizations on board. Will be watching this very closely as it unfolds. Hopefully, unravels too.",
      "MessageIndex": 1,
      "PostDate": "05/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/747766",
      "Title": "Gene patent lawsuit jlazyk leaf"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 14, 2010 01:53PM - edited Sep 14, 2010 01:57PM by LISAMG . This is not so uncommon for BC to be found with breast reduction surgery!! The BC may very well not have been included with the reduction specimen, meaning it was located somewhere where tissue was not removed. Let me ask u this, Did you have a pre-op breast MRI before the reduction?? Any family history? We know mammos can miss 35% of all BC's...not sooo reassuring.",
      "MessageIndex": 5,
      "PostDate": "14/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757919",
      "Title": "Just diagnosed after a successful breast reduction nora_az LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 18, 2010 11:09AM LISAMG wrote: Rebz, Why not consider genetic counseling and testing with your family history?? Especially if you have children and to also find out about your ovca risks, just something to strongly consider by talking to a genetic expert.",
      "MessageIndex": 9,
      "PostDate": "18/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757919",
      "Title": "Just diagnosed after a successful breast reduction nora_az LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 29, 2009 11:41PM LISAMG wrote: Have you had a breast MRI yet? This would be helpful for you and the surgeon in knowing whats going on in both breasts, if anything...especially if you have dense tissue! Mammos are often un-reliable with breast density. B9 wishes for you tomorrow.",
      "MessageIndex": 1,
      "PostDate": "29/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/745989",
      "Title": "Biopsy duct excision zazy LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Oct 15, 2009 12:56AM - edited Oct 15, 2009 01:09AM by LISAMG Niner, The standard of care with any atypical ductal papilloma is excision/removal due to early staged cancer findings nearby approximately 25% of the time. This fact is also supported by research as well. Do you have any nipple discharge? I had an excisional biopsy performed 4 yrs. ago for this very reason and a benign papilloma was found. Your doctors have your BEST interest in mind for a definitive diagnosis.  Sending you B9 wishes!! Management of intraductal papillomas of the breast: an analysis of 129 cases and their outcome. http://www.ncbi.nlm.nih.gov/pubmed/19484312?ordinalpos=17&itool=EntrezSystem2.PEntrez.Pubmed.Pubmed Excision is indicated for intraductal papilloma of the breast diagnosed on core needle biopsy. http://www.ncbi.nlm.nih.gov/pubmed/19402174?ordinalpos=14&itool=EntrezSystem2.PEntrez.Pubmed.Pubmed",
      "MessageIndex": 1,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742147",
      "Title": "Said there is NO cancer but still removing?!? Niner5689 Niner5689"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Aug 6, 2011 11:11PM - edited Aug 6, 2011 11:13PM by LISAMG If your mom's biopsy comes back positive, she may wish to consider genetic counseling/ testing for the BRCA genes for hereditary BC. By doing this, you will have a clearer understanding of your risk since you would have a 50% chance of carrying a mutation ONLY if your mom has the gene. Sending benign wishes to your Mom! Keep us posted.",
      "MessageIndex": 2,
      "PostDate": "06/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/772764",
      "Title": "Scared but hiding it buriedbytheodds buriedbytheodds"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 21, 2010 10:55PM LISAMG wrote: Joulesc, I am so sorry your sister has been dealing with such heavy stress, especially being BRCA1 and having daughters. Please have her visit www.facingourrisk.org, for lots of support, information and increased awareness with hereditary bc/ovca.  She can also meet other high risk women who are dealing with similar problems. Knowing she had prophylactic hysterectomy/BSO for ovca prevention was a very wise decision on her part. Hoping her daughters test negative!  We also have women from United Kingdom and other countries as well. Explore the web site and the messageboards too. Best wishes. Lisa",
      "MessageIndex": 1,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/747130",
      "Title": "BRACA 1 joulesc LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 2, 2011 04:40AM - edited Sep 2, 2011 04:48AM by LISAMG Hi Tatiana!! Yes, high profile silicone gel implants are the most widely used type of implants with a mastectomy because they provide the most projection for a mastectomy skin flap since we are minus any breast tissue. There are 2 makers of implants, Allergan and Mentor, all depends on the PS's preference. To answer your other \"wishy washy\" question, LOL, yes yes yes!!!...its completely normal to have these feelings. Believe it or not, i had these same exact feeling for almost FIVE years before i was able to do risk reducing surgery. OMG, too much wasted time and energy, BUT its a process everyone has to endure, some are shorter than for others. YOU will know when/if the time is right, i promise :))",
      "MessageIndex": 28,
      "PostDate": "02/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773455",
      "Title": "Has anyone had a nipple-sparing skin sparing mastectomy? ScaredInSnoqualmie momoschki"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Oct 15, 2010 09:13PM - edited Aug 20, 2013 05:56AM by LISAMG BTW Suzanne, I just loved your book...fabulous job done by Dina. She captured all of you magnificantly. Along with Previvors, is another excellent \"must read\" book called Positive Results by Joi Morris and Dr. Ora Gordon that was released earlier. Highly recommended for all high risk women too.  http://positiveresultsthebook.com/reviews.html",
      "MessageIndex": 3,
      "PostDate": "15/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/757790",
      "Title": "New Book for those who are High Risk bisous3 bisous3"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jun 21, 2012 10:45PM LISAMG wrote: jenamae, do u have sonograms at all? Mammos are often not the recommended choice for imaging at your young age. Ultrasounds have been more effective along with the MRI. There are lots of great books u may be interested in as well. Positive Results by Joi Morris, Pretty is What Changes, by Jessica Quellar, Previvors by Dina Roth Port are all great reads for you. The Breast Reconstruction Guidebook by Kathy Stilego is wonderful and describes all types of surgery.",
      "MessageIndex": 7,
      "PostDate": "21/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/777722",
      "Title": "23, mom, brca+ now what jenamae denouement"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 24, 2010 12:01AM - edited Jan 24, 2010 12:07AM by LISAMG",
      "MessageIndex": 24,
      "PostDate": "24/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746976",
      "Title": "I JUST WANT THEM OFF JudeMama Delilahbear"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 3, 2010 11:35PM LISAMG wrote: http://www.facebook.com/group.php?gid=138503392845959&v=wall Dr. G. Fenner is a fabulous PS and definitely worth the consult.",
      "MessageIndex": 1,
      "PostDate": "03/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/761490",
      "Title": "University of Chicago recommendations? stressed_about_my_chest LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Oct 16, 2009 09:27PM LISAMG wrote: Fibroadenomas are benign findings, but often show atypical characteristics. The fact you had no rapid washout is good!! With any Rapid washout, suspicious findings are increased. Be vigilant and schedule a f/u screening and appoint., as was recommended for you.",
      "MessageIndex": 2,
      "PostDate": "16/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742171",
      "Title": "MRI results r in please help BabyLemp1 LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Mar 20, 2010 12:05AM LISAMG wrote: Interestingly, Rene Styler and E.D. Hill, a former FOX News journalist are both BRCA negative with strong family histories and each had PBM. Kudos to these women for doing what was best for them. Hill's surgery journey was just recently followed by \"The View\", very poignant and informational.",
      "MessageIndex": 18,
      "PostDate": "20/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/749207",
      "Title": "Stage 0 options ambyrp Kimmie4"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 9, 2009 12:06AM - edited Sep 9, 2009 10:39AM by LISAMG I would also echo getting your biopsy sooner with the nipple discharge & lump!!  Don't wait. Sometimes a bloody discharge can also be a symptom of an intra-ductal papilloma, as was my case, and often benign. May I ask your age? Was a mammo done as well? Hang in there and be proactive by requesting a sooner appointment. Sending you lots of benign wishes!",
      "MessageIndex": 3,
      "PostDate": "09/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740144",
      "Title": "Scared... pretty sure I have cancer... CrunchyPoodleMama KorynH"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Feb 12, 2010 05:42AM - edited Feb 12, 2010 05:48AM by LISAMG Stratification of breast cancer risk in women with atypia: a Mayo cohort study. http://jco.ascopubs.org/cgi/content/full/25/19/2671 A very helpful research article that may assist your decision making. Gather all the facts to decide what is best for you. \"Multi-focal\" ADH is often the key with a higher risk factor for invasive cancer. Do you have any family history?",
      "MessageIndex": 1,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/748231",
      "Title": "ADH Again debbys17 lacey240"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Feb 19, 2012 03:17AM LISAMG wrote: Very powerful message with catastrophic results for this woman!",
      "MessageIndex": 3,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/782516",
      "Title": "A Powerful Precautionary Tale REKoz financegirl"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Mar 17, 2010 10:44PM - edited Mar 17, 2010 10:49PM by LISAMG For those of you who have tested Un-informative Negative, the are other un-identified genes out there, especially when you have multiple BC's that are pre-menopausal too with first line relatives. Beware and be vigilant. Read Steve Narods study below on un-informative negative families for a better understanding of your risks: Breast cancer risks in women with a family history of breast or ovarian cancer who have tested negative for a BRCA1 or BRCA2 mutation. http://www.nature.com/bjc/journal/v100/n2/full/6604830a.html Genetic testing for mutations in BRCA1 and BRCA2 is available in Canada for women with a significant family history of breast cancer. For the majority of tested women, a BRCA1 or BRCA2 mutation is not found, and counselling regarding breast cancer risk is based on the review of the pedigree. In this prospective study, we estimate breast cancer risks in women with a family history of breast cancer and for whom the proband tested negative for a mutation in BRCA1 or BRCA2. Families with two or more breast cancers under the age of 50 years, or with three cases of breast cancer at any age, and who tested negative for a BRCA1 or BRCA2 mutation were identified. Follow-up information on cancer status was collected on all first-degree relatives of breast cancer cases. The standardised incidence ratios (SIRs) for breast cancer were calculated by dividing the observed numbers of breast cancer by the expected numbers of breast cancers, based on the rates in the provincial cancer registries. A total of 1492 women from 365 families were included in the analyses. The 1492 first-degree relatives of breast cancer cases contributed 9109 person-years of follow-up. Sixty-five women developed breast cancer, compared to 15.2 expected number (SIR=4.3). The SIR was highest for women under the age of 40 (SIR=14.9) years and decreased with increasing age. However, the absolute risk was higher for women between the age of 50 and 70 (1% per year) years than for women between 30 and 50 (0.4% per year) years of age. There was no elevated risk for ovarian, colon or any other form of cancer. Women with a significant family history of breast cancer (ie, two or more breast cancers under the age of 50 years, or three or more breast cancers at any age), but who test negative for BRCA mutations have approximately a four-fold risk of breast cancer. Women in these families may be candidates for tamoxifen chemoprevention and/or intensified breast screening with an MRI.",
      "MessageIndex": 9,
      "PostDate": "17/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/749207",
      "Title": "Stage 0 options ambyrp Kimmie4"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Feb 10, 2010 12:59AM LISAMG wrote: OMG, Debbie....u r too funny and how outrageous doing this during a TVU. Imagine? I would be out of there so fast and probably wetting myself on the way out from hysteria",
      "MessageIndex": 7,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/747887",
      "Title": "Had Me HUM during ultrasound msdmckee horsewing"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 14, 2009 03:08AM - edited Sep 14, 2009 03:13AM by LISAMG If you have been taking antibiotics since last Wed. and have no improvement, please see a breast surgeon to get this properly evaluated. Your symptoms need investigating. Do you have redness and firmness? Any nipple discharge?  Best wishes and keep us posted. Feel better soon.",
      "MessageIndex": 2,
      "PostDate": "14/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740313",
      "Title": "Inversion??? msglavan idaho"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jul 11, 2011 12:47AM LISAMG wrote: Sending lots of benign wishes your way and please keep us posted. Just wondering why u or anyone, for that matter, would have to wait 2 months for a biopsy, especially given your strong family history?",
      "MessageIndex": 5,
      "PostDate": "11/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/771352",
      "Title": "I missed the call!!!!!! rn4babies SarahsMom"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Nov 28, 2009 09:22AM LISAMG wrote: http://www.ncbi.nlm.nih.gov/pubmed/19402174?ordinalpos=14&itool=EntrezSystem2.PEntrez.Pubmed.Pubmed_ResultsPanel.Pubmed Excision is indicated for intraductal papilloma of the breast diagnosed on core needle biopsy. I agree with the radiologist's recommendation. Seek the advice of a breast surgical oncologist and not a general surgeon. Papillary lesions warrant further investigation. A single papillary lesion is less worrisome. Get a copy of the core biopsy report as well.",
      "MessageIndex": 1,
      "PostDate": "28/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/744471",
      "Title": "Biopsy results - Papillary Lesion Bencoksp LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Mar 28, 2010 06:20AM LISAMG wrote:",
      "MessageIndex": 2,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750424",
      "Title": "Red, Painful Nipple with Discharge...Cause for Concern? momof2boyz LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 9, 2010 10:44PM LISAMG wrote:",
      "MessageIndex": 3,
      "PostDate": "09/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/746504",
      "Title": "What am I looking at? MsP Lisa1962"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 18, 2009 05:41AM - edited Dec 19, 2009 05:57AM by LISAMG You may wish to request ONLY diagnostic mammos with regular sonograms from now on, being that you have breast density and a family history of BC. Why not suggest an MRI for yourself? How old was your Mom at the time of diagnosis? If she was pre-menopausal and/or under the age of 50, you may wish to consider genetic counseling/testing. Ideally, it would be best for your Mom to test first, especially if there is BC and/or OVCA in her family too.",
      "MessageIndex": 2,
      "PostDate": "18/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/745536",
      "Title": "Scared about mammo results mylee LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Aug 22, 2009 08:05PM - edited Aug 22, 2009 08:20PM by LISAMG Hello Friends, How wonderful to find a forum just for nurses! I am fairly new here to the site and perhaps, a bit of an outsider as well. A former long time critical care nurse, I currently work in a pre-surgical ambulatory unit. I am a seasoned R.N. with 25 yrs. in the profession and I do not have breast cancer...yet, anyways. Rather, I am a Previvor who has a predisposition to hereditary breast/ovarian cancers. Having multiple cases of pre/post menopausal BC/OVCA on both sides of my family, I tested Un-informative Negative for the BRCA genes about 3 years ago. Since then, 2 affected family members also tested negative. Clearly, the genetic cause and/or gene is out there somewhere...over the rainbow, but not identified, or so I am told. I have a personal history of multiple breast biopsies, all benign thus far. I am currently contemplating a BSO to reduce my risk for both cancers. If anyone here thinks they may also have a hereditary predisposition to breast and/or ovarian cancers, I encourage you to visit www.facingourrisk.org for support and/or to seek further information. We are an amazing community that has 24/7 access to hotlines, message boards, newsletters, & local outreach support groups all over the country. I am also the Outreach Coordinator for Long Island. If I can assist anyone at all for available resources in the LI/NYC areas, please do not hesitate to contact me. Any woman under the age of 50 with a BC diagnosis with a weak/strong family history may also have a hereditary pre-disposition, especially if you are triple negative and/or have an aggressive tumor. OVCA at any age may also be a red flag for genetic origin as well. So, I am glad to be here among peers who have walked the path and/or had difficult journeys. You are all heros and I deeply admire your determination, strength & courage. Thanks, Lisag@facingourrisk.org",
      "MessageIndex": 260,
      "PostDate": "22/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jul 4, 2009 05:56PM LISAMG wrote: Lifegoeson, I dis-agree with the notion you are a true negative, since NO one has tested in your family. Rather, you are Un-informative until someone in your family tests!! Such was the case for myself until my maternal aunt with ovca also tested negative. I am still un-informative with lots of BC in the family and also on my Dad's side. You really dont know your risks at this point. I would encourage you to sit down with your GC and discuss this further. Best wishes, from another long Islander to another! Lisa",
      "MessageIndex": 6,
      "PostDate": "04/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/736828",
      "Title": "BRCA testing came back negative! lifegoeson Mutd"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 27, 2009 11:11PM LISAMG wrote: I would question why you are being referred to a surgeon since it seems a bit premature without a real diagnosis. Did you have any other imaging tests since the mammo seems inconclusive and you have breast density which usually requires more imaging? Why not have a sonogram and/or an MRI? I think you definitely need more information before ever consenting to a surgical biopsy. Intra-mammary lymph nodes are almost always benign, especially if they are small. I have had an intra mammary lymph node in my right breast for a long time and its always monitored with no changes. Best wishes and keep us posted. Deep breaths and gather all the facts and/or opinions.",
      "MessageIndex": 2,
      "PostDate": "27/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/745685",
      "Title": "Understanding Report midmichiganmommmy midmichiganmommmy"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "LISAMG wrote: http://www.positiveresultsthebook.com/Positive_Results_The_Book/Home.html About the book:       \"The words \"breast cancer\" and \"ovarian cancer\" strike fear into the hearts of most women.  But for women  whose mothers, sisters, aunts, or grandmothers have faced these diseases, the question \"Will I get it too?\" is a constant companion.  These are the cancers they fear most.  Women who learn that they carry a BRCA mutation have many questions and their health care decisions are complex.  For women with strong families histories of these diseases who do not have BRCA mutations, the decisions are equally difficult.  Positive Results fills a void by distilling the complex information needed to understand breast and ovarian cancer risk in a way that is easy to understand.\"             \"One part memoir, three parts guidebook, Positive Results explains in a clear and steady manner the myths and realities of \"the breast cancer genes.\"  It lays out all of the options in clear, compassionate language.  It will help women decide if they want to pursue genetic testing.  It will help them interpret their genetic test results.  And it will help them make the life-saving decisions required to manage their risks if they discover that they are at high risk of breast or ovarian cancer.  Positive Results covers all of the cutting-edge medical options from genetic and genomic testing for breast cancer risk to the medical and surgical options for managing risk and beating the odds.\"             \"Positive Results is organized for easy reference with chapters on genetics, genetic counseling, interpreting genetic test results, assessing risk, breast cancer surveillance (including cutting edge technologies), mastectomy techniques (with the pros and cons of each), breast reconstruction techniques, ovarian cancer surveillance and detection, ovarian surgery (hysterectomy/oophorectomy), managing menopause, and a full chapter on the cancer risks faced by men with BRCA mutations.  Although designed as a guidebook, Positive Results is far from a dry reference work.  It is more like a travel log to BRCAland than a textbook.  Along the way, it tells the story of Joi and other women (and men) who have made the gut-wrenching decisions required to survive in this world of astronomical risk.  These stories answer the question \"What is it like ...?\"             \" When Joi learned that she carried a mutation on the BRCA2 gene she went searching for a book with answers to her many questions.  She wanted a book that she could read at night, dog ear the pages, and take with her to her medical appointments.  The vast quantity of knowledge needed to understand her risk and the various medical options was both daunting and confusing.  But there was no book to help guide her on her journey.   Positive Results was born out of Joi's desire to create just such a book for other women like her -- women fighting, facing, and fearing breast and ovarian cancer.  But to create a thorough medical guidebook Joi needed the help of a compassionate and experienced doctor.  Dr. Ora Gordon is a genetic counselor, medical geneticist, director of the Cedars-Sinai GenRisk Adult Genetics program, associate professor of medicine at the David Geffen School of Medicine at UCLA, director of cancer genetics at the Disney Family Cancer Center at Providence St. Joseph Medical Center, and Joi's doctor.  Together Joi and Dr. Gordon have created a truly unique resource for families facing the specter of hereditary breast and ovarian cancer.\"             \"Positive Results is Joi's memoir of her journey through the decision-making maze as well as the guidebook she so desperately wanted at the beginning of her journey.  It comprehensively reviews every decision, beginning with genetic testing and genetic counseling, provides history and perspective on breast and ovarian cancer screening, mastectomy, breast reconstruction, and ovarian surgery, and provides information on cutting edge research and potential future advances that may well change the decision-making landscape for women and men facing these hereditary cancers.\" I had the most wonderful opportunity of meeting Joi over a year ago while she was visiting in NYC. We both share a common bond with hereditary cancers in our families. I was immediately struck by her warmth, compassion, and her charming wit as we spoke together about our risks. Both of us share another special bond for our love and dedication to FORCE, the only non-profit organization devoted to breast/ovarian hereditary cancers, through our Outreach coordinatorships as well. I applaud the strength, knowledge and determination of both authors in bringing forward the long awaited and over-due empowerment of knowledge needed for ALL women and men pre-disposed to breast and ovarian cancers. Thank you Joi and Ora for creating heightened awareness to the high risk community, like never before together in this single empowering book. Surely this will help not only previvors and survivors alike, but also to the healthcare providers for which we seek our specialized care! I urge all women at risk to read this amazing book! For more info. on the FORCE organization, please visit www.facingourrisk.org LisaMG High Risk for HBOC, BRCA Un-informative Negative Previvor, Bilateral Nipple Sparing Risk Reducing Mastectomy, August, 2010, Lipo/ Micro fat grafting with high profile implants, Nov.,2010. Risk Reducing Lap. BSO, October, 2011. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/746552",
      "Title": "\"Positive Results\", A Must Read for any woman @ High Risk!! LISAMG SandyinSoCal"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 11, 2010 11:03PM LISAMG wrote: Yes, I am sorry I did forget to add that the book's release will not be until February! I will contact Joi to get more details. Thanks for your interest, much appreciated on her behalf, I am sure.",
      "MessageIndex": 2,
      "PostDate": "11/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/746552",
      "Title": "\"Positive Results\", A Must Read for any woman @ High Risk!! LISAMG SandyinSoCal"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Apr 1, 2010 08:23PM LISAMG wrote: BUMP for any newbies here and for anyone looking for the best information currently out there for high risk women...all in a single book!",
      "MessageIndex": 4,
      "PostDate": "01/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/746552",
      "Title": "\"Positive Results\", A Must Read for any woman @ High Risk!! LISAMG SandyinSoCal"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Mar 17, 2012 02:22PM LISAMG wrote: TeriR, are u BRCA positive? Having a father with BC is a huge red flag for HBOC. Best wishes to you with these difficult decisions.",
      "MessageIndex": 6,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/784234",
      "Title": "Just diagnosed...what about ovaries TeriR Deirdre1"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 8, 2009 10:29PM LISAMG wrote: This may very well be a fibroadenoma, commonly found with younger women. However, no mass is truly benign unless its excised or biopsied despite what a mammo or sono shows!! I know many women who had \"benign\" appearances on imaging, but demanded a biopsy and found otherwise. Why not consider a needle biopsy? This way you will know whether or not to proceed with a breast surgeon and not a general surgeon. Good luck.",
      "MessageIndex": 2,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/745099",
      "Title": "Benign mass found, now what? momto3kites LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Apr 26, 2010 06:20PM LISAMG wrote: Never heard of this being done before, but I must ask: Why is a larger expander an option NOW when it was NOT prior, at the time of the mastectomy??  Surely, there are larger expanders than 400cc and if you were a 44C pre surgery, it seems this was not adequate. Hope you find some answers soon. I would also post this question in the \"Breast Reconstruction\" forum for a better response.",
      "MessageIndex": 2,
      "PostDate": "26/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/751796",
      "Title": "Another Surgery to Put in Larger Expanders? nydeb LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 26, 2010 02:58PM - edited Dec 26, 2010 06:57PM by LISAMG",
      "MessageIndex": 1,
      "PostDate": "26/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/762510",
      "Title": "enough is enough? lightning HelloFromCT"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 5, 2012 09:55PM LISAMG wrote: 1. How long would it roughly take in the operating room to do PBM and reconstruction at the same time? All depends on the type of reconstruction, flap procedures are very long. I had NSM with expanders and my surgery lasted 4.5 hours total. 2. In your experience, did insurance cover this procedure? Yes, my risk reducing surgery was fully covered, based on family hx. alone, using evidence based criteria. 3. How far does the scarring extend? My scars are hidden, LIMF, or inframmary fold. Will the scars be visible when you wear certain types of clothing? What scars?? U cannot see them with or without clothing.  Say a tank top, for example? Never. 4. Are there ways to screen the small amounts of remaining tissue? Clinical breast exams 2x year along with monthly self exams are the recommendations i was given with implants. If anything were to develop, an abnormality would most likely be easily palpable since implants are placed under the muscle. I will not pursue any further screening/imaging unless waranted. Why go thru surgery to be faced with continued worries/fears by unfounded screening methods?",
      "MessageIndex": 5,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/780463",
      "Title": "Q's about prophylactic breast surgery beepbeep klynnz"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 15, 2009 09:39AM LISAMG wrote: Just sent you a PM!! Good luck.",
      "MessageIndex": 3,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/740354",
      "Title": "BREAST SURGEONS ON LONG ISLAND Klawless9 Graciej"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jan 29, 2010 10:22PM LISAMG wrote: Krista, Please get yourself a copy of the newly released book for BRCA women , \"Positive Results\", by Joi Morris. Everything you could possibly want to know or ask, inclusive!!  http://www.positiveresultsthebook.com/Positive_Results_The_Book/Table_of_Contents.html",
      "MessageIndex": 4,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/747524",
      "Title": "BCR1 gene KristaMay sarikasd"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 3, 2009 12:31AM - edited Dec 3, 2009 12:32AM by LISAMG Hi Kimber, I can so relate to your post, being high risk myself. Have you or anyone affected by BC in your family had genetic counseling/testing? This could be the deal breaker for you in knowing your real high risk status. Facing a PBM is huge and contemplating it myself for almost 4yrs. now. You have already been thru so much. I suggest you get a copy of Kathy Stilego's Breast Reconstruction Guide that explains every type of reconstruction. So many choices, skin sparing vs. nipple sparing, implants/expanders vs. flap procedures. My BEST advice is to seek a few different opinions, gather all the facts and remember surgeons will only recommend what they do and NOT necessarily what you want!! You will find breast surgeons telling you its not safe to keep nipples, but only you can decide what is best for YOU. There will be surgeons who tell you immediate implants are complicated and to use expanders first, not true. I have seen all of this thru my consults and the learning experience has been immeasurable. Keep posting and asking questions. Best wishes.",
      "MessageIndex": 2,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/744846",
      "Title": "I also need help, advice.... Kimber Lynn3"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jul 29, 2010 01:19AM LISAMG wrote: Susskins, Sorry to hear about your worries with ADH, considered to be a Pre cancerous finding. However, I would be very concerned with ANY doctor recommending a mastectomy based on palpation of a lump[s]. What did your pathology report reveal with regards to the 5cm excised mass?? Were you told you have BC? Some crucial info. seems missing here.  I am totally confused with the information provided, but want to be sure you understand all of your findings/implications. It just seems very odd to recommend vigilant screenings with Tamoxifen and later recommend a mastectomy based soley on physical exam. Did you have a brest MRI at any point? This test may be in your best interest if you have not already done so. Any family history of BC? Gather ALL the facts beforehand, seek more opinions and do your own research to make a fully informed decision for yourself. Best wishes.",
      "MessageIndex": 1,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/756000",
      "Title": "Atypical Ductal Hyperlasia and double mastectomy susskins CandDsMom"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 18, 2009 09:47PM LISAMG wrote: Was your biopsy done with wire/needle location & imaging prior? Seems like someone may have missed the questionable spot. Sorry you have to deal with another surgery and I would demand better imaging guided technique be used.",
      "MessageIndex": 1,
      "PostDate": "18/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/745596",
      "Title": "New Problem sue2008 sue2008"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jul 9, 2009 04:40PM LISAMG wrote: Breast cancer risks in women with a family history of breast or ovarian cancer who have tested negative for a BRCA1 or BRCA2 mutation!! Very important study done by Steve Narod for those with un-explained breast cancer families and with affected family members also testing negative! http://www.nature.com/bjc/journal/v100/n2/full/6604830a.html",
      "MessageIndex": 9,
      "PostDate": "09/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/736828",
      "Title": "BRCA testing came back negative! lifegoeson Mutd"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Dec 3, 2009 08:07AM LISAMG wrote: Kimber, You can purchase the book at Amazon or any large bookstore. Its a must read. Remember, as I mentioned surgeons will only tell you what to do based on their experiences. Many women have done direct implants, avoiding the expansion process and a second surgery. Only an experienced micro vascular plastic surgeon will recommend flaps. Many women are candidates, despite what you have been told, even if you do not have enough tummy fat. Good luck!",
      "MessageIndex": 4,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/744846",
      "Title": "I also need help, advice.... Kimber Lynn3"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Aug 9, 2009 10:41AM LISAMG wrote: I have papillary apocrine metaplasia. AM is considered a fibrocystic change & totally benign without atypia.  Yes, it can be found near the site of a carcinoma, but so can a lot of things. The key is atypia, or ADH/ALH, both pre-malignant findings.  Since you have aunts with BC, has anyone of them been tested for the BRCA genes? You may wish to consider genetic counseling. How old are you? Any other biopsies?",
      "MessageIndex": 1,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/738669",
      "Title": "apocrine metaplasia dx from biopsy, 2.6 cm/2.4 cm flower12345 awb"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Jul 15, 2009 08:40AM - edited Jul 15, 2009 10:29PM by LISAMG Importance of Advocacy: A Personal Experience I strongly believe these recent research findings by Narod & others [posted above in previous post] are rather important. There seems to be a real need for this new information to be disseminated within the medical community, especially to those directly involved with BRCA and/or high risk patient populations. This includes genetic counselors & medical/surgical oncologists. Briefly, I would like to share my recent personal experiences & why I feel this is crucial awareness targeted for Un-Informative BRCA Negative high risk women. Several months ago, a very BRCA savvy oncologist told me that it was strongly believed I am a \"true\" negative. Subsequently, my risks were quoted to be average & I would ''probably never get breast cancer\" [despite several BC's and OVCA from both sides of my family]. Two years ago this very same physician conveyed no need for breast MRI's because there are \"too many false positives\". It was just assumed [by this physician] there would be a positive BRCA mutation found within my family & because of this, my risks would be equal to that of average women. However, I was un-informative negative THEN & NOW [informed] Un-informative since my maternal aunt with ovca also recently tested negative. During my last [and final] visit, I was told I would be \"just fine\" and asked, \"When would you like to come back?\". Gosh, let me think quickly now,,, Having just been told I am not high risk, Why would I ever return to your office? I am not going back, instead I will move forward. This same physician told me to relay any info. to the office Re: any family members test results and \"keep me posted\". When I received my aunts results in mid December, I did try to reach this physician twice, leaving messages to please contact me Re: my risks and a family members' test results. Am I still waiting by the phone?? NO, I am done with a physician who simply labels patients \"average risk\" in the absence of a positive BRCA mutation. As a result, I want to emphasize the importance in being proactive, if Un-informative BRCA negative, especially when other family member{s} also test negative & to advocate empowerment in seeking proper guidance. Demand annual breast MRI's if you have a significant family history. Maintain vigilant scheduled breast imaging along with regular clinical breast exams. Speak to your physician about possible chemopreventative therapy and whether you may or may not be a candidate. Find a physician who will listen to you and whom you can trust. [Mistakenly, I thought I had the \"best\" of the best.] Unfortunately, this physican will never know how very disappointed I am & how much I depended on their expertise and knowledge. I simply trusted & relied on this physican very much and was ever so let down and ultimately \"written off\". Another physician recently told me I should be getting annual breast MRI's, being high risk with up to a 40% lifetime chance of getting BC. Having multiple biopsies already, it is my understanding this would be a much more accurate personal risk assessment than previously led to believe. Life certainly goes on with surveillance. I attribute much of this ability from seeking knowledge/guidance elsewhere & tolerating my risks. Just venting here. I suppose this wasn't so brief after all, but it feels so good to release all my HUGE disappointments and anger. As Dr. Narod recommends... We will see what patients do with this advice.",
      "MessageIndex": 10,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/736828",
      "Title": "BRCA testing came back negative! lifegoeson Mutd"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Sep 15, 2009 08:08AM LISAMG wrote: Hi Kendall, Would you consider NYC surgeons? I am a firm believer the level of care varies by location and I live/work on LI too. I have an excellent breast surgical oncologist at NYU Cancer Center if you're interested. He is experienced, compassionate and highly skilled and also takes your insurance, I believe. Send me a PM for more details if you like. I would definitely seek a couple of opinions re: lumpectomy vs. mastectomy. Who is your current surgeon? Best wishes, Lisa",
      "MessageIndex": 1,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/740354",
      "Title": "BREAST SURGEONS ON LONG ISLAND Klawless9 Graciej"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Nov 26, 2009 12:29AM - edited Nov 26, 2009 12:36AM by LISAMG Breast surgeons who do NOT perform nipple sparing will deter you away from a viable procedure simply because they are not experienced and do not perform this type of mastectomy. Those that perform NS must be highly skilled, having done lots of these procedures for a successful outcome. NS may be an option for early stage cancers, especially DCIS when its located far enough away from the nipple-areola complex. You need to do your homework and gather ALL the facts to make a fully informed decision best for YOU!! There is research that shows the cosmetic outcome for many, but not all women, out-weighs the oncological risks. The chances of developing a carcinoma of the nipple are extremely rare, equal to or less than 4% according to most of the studies. The bottom line is knowing this minimal risk and knowing what you can tolerate. Everyone is different. Only you can decide, a very personal decision. Do you have any family history of BC? Are you considering a unilateral or bilateral mastectomy?  Please read the following article by a well known nipple sparing breast surgical oncologist who explains the pros/cons of the procedure. This has been found to be helpful for women making these decisions. Best Wishes. http://www.diepflap.com/nipple_sparing_mastectomy.html",
      "MessageIndex": 6,
      "PostDate": "26/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/744489",
      "Title": "question about nipple sparing mastectomy cl00 LISAMG"
    },
    {
      "AuthorID": "LISAMG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86091/profile",
      "Content": "Oct 19, 2011 09:52PM - edited Oct 19, 2011 09:57PM by LISAMG PLEASE visit www.bebrightpink.org , the only organization devoted specifically for young women like U who are BRCA positive. You will find tons of support, knowledge, dating tips, advice and lifelong friendships!!",
      "MessageIndex": 7,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/776682",
      "Title": "How to tell my boyfriend I might have BRCA1? Thegirlinorange purelove5"
    }
  ]
}