{
  "AuthorID": "LisaAnn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62528/profile",
  "Posts": [
    {
      "AuthorID": "LisaAnn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62528/profile",
      "Content": "May 22, 2008 09:48PM LisaAnn wrote: I bought mine on TLC. Bought the monfilimant(Jenna style) and I get nothing but compliments! My kids even say it is nicer than my own hair was. I was mad at first when they said it, but you know what---it is! So many people think it is my own hair and it blows in the wind like hair and has a part. I love it!",
      "MessageIndex": 3,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705965",
      "Title": "wigs and hair loss mizz jdg1"
    },
    {
      "AuthorID": "LisaAnn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62528/profile",
      "Content": "May 22, 2008 09:48PM - edited May 22, 2008 09:49PM by LisaAnn",
      "MessageIndex": 4,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705965",
      "Title": "wigs and hair loss mizz jdg1"
    },
    {
      "AuthorID": "LisaAnn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62528/profile",
      "Content": "May 22, 2008 09:48PM - edited May 22, 2008 09:49PM by LisaAnn",
      "MessageIndex": 5,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705965",
      "Title": "wigs and hair loss mizz jdg1"
    },
    {
      "AuthorID": "LisaAnn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62528/profile",
      "Content": "May 26, 2008 07:40AM LisaAnn wrote: Otter- and all, Otters exerience was very similar to mine. I live in a very small town and the only wig store, without having to go to Chicago, is about 15 minutes away. I called first, woman was so nice on the phone! I got there and the place was okay, kind of dumpy and the people working were not that presentable which I found weird it being a Merle Norman make-up place. The only woman who could \"fit\" me was the owner. She was about 60-65. All the wigs were geared towards the older generation(I am 37). I had shoulder length hair, have no idea what my natural color is but have dyed it to a medium golden brown for 10-15 years. She immediately told me I should go with a very short wig for it willbe cooler in the summer, etc. I have never had short hair and was worried about the drastici change over. She too brushed it to a big bees nest in the back, but now know that part of the bees nest was my own hair gatered at the top. Then she went and told me that auburn was my color(which looks like purple in synthetic) or bright blond! I left in tears as well and told them I would be back with my husband. I never returned. Point of the story is that, in my opinion, no wig is going to look good on you when you don't have an open mind. And who has an open mind when they fear the thought of having to wear a wig at all? I was in denial, thought I might be one of the few who would not loose their hair on treatment. Then after the denial stage was over I thought I could find one my EXACT color and EXACT cut so the transition would not be so bad. It took me a week to get used to my new \"do\". And countless people to tell me they had \"no idea\" and know they meant it. Most people just thought I got my hair cut and colored. My kids told me, and you know how honost kids are, that my wig looks better than my old hair did and when it comes back I should have it cut like the wig! If I were to give any advice I would say stay away from the wig stores. I bought 6 wigs from TLC catalog until I found the perfect one.I waited to return them until after my hair fell out.  I was able to try them on in the privacy of my own bathroom and TLC gave me credit on my credit card the day they received all of them back. I chose a cute bob style, monofilimant, and had my hairdresser trim it to form my face. I love it now ,although I do have my days when I feel like I have a mop on my head. When my hair starts growing back my hairdresser will cut it shorter every month so that the transition again won't be so bad.",
      "MessageIndex": 20,
      "PostDate": "26/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705965",
      "Title": "wigs and hair loss mizz jdg1"
    }
  ]
}