{
  "AuthorID": "Lisazc",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128780/profile",
  "Posts": [
    {
      "AuthorID": "Lisazc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128780/profile",
      "Content": "May 20, 2011 02:39PM Lisazc wrote: Hi I am feeling your \"waiting stages\" pain.  I have an excisional biopsy scheduled for 2 weeks from now (been waiting since early May!).  Several weeks before my \"atypical cyst\" thing showed up, a radiologist noticed a swollen lymph node under my thyroid.  The node was actually found becuase I was having a thryoid ultrasound.  Of course, part of my waiting for weeks is my fault (I'm going on a rock scrambling/hiking trip next week and was not about to miss it for my stupid breast) and partially because my husband had a hard time geting off of work to take me in for the surgery. The breast surgeon said the lymph node was probably because I'm thin.  What is that all about?  I get that nodes buried in a larger person would feel smaller than on small people,  but mine was measured by ultrasound.  I'm confused about this.  I'm glad someone said that to you too.  I thought it sounded like bull-hooey. Maybe you have a low level infection that is causing your lymph nodes to swell?  And, it is a coincidence that you have a breast lump.  That would cause your fatigue.  I had a \"unknown mono-like\" infection last year whose only symptom was swollen nodes in the back of my neck and deathly fatigue.  It eventually went away after about 3 months. Fingers crossed for you!  Happy Friday to you too!  I alternate between terror and \"I'm sure it's nothing\" and exercise definitely helps! ",
      "MessageIndex": 8,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/769152",
      "Title": "Am I crazy or being paranoid? Opinions PLEASE! kookers1 vmudrow"
    },
    {
      "AuthorID": "Lisazc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128780/profile",
      "Content": "May 24, 2011 10:36PM Lisazc wrote: Good thoughts zinging your way!!  And to Divamimi I'm off on my hiking trip to burn off my pre-surgery stress.  The \"no NSAIDS\" for a week before is going to kill me (says the gal with the bum knees who loves to crawl up big rocks). Have a pint of ice cream afterwards!",
      "MessageIndex": 19,
      "PostDate": "24/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/769152",
      "Title": "Am I crazy or being paranoid? Opinions PLEASE! kookers1 vmudrow"
    },
    {
      "AuthorID": "Lisazc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128780/profile",
      "Content": "Lisazc wrote: Hi,  I apologize if this question is too basic, but I have a Paternal Aunt that has had BC (don't know any details other than it started in her 30s and has come back two times since) and was wondering if Paternal Aunt increases my risk of developing cancer. I am currently waiting on an excisional biopsy for an \"atypical cyst\" that is highly vascular in very very dense breasts.  I don't really know my Aunt well (she lives far), but I'm wondering if getting more information from her would help knowing my risk?  Or if it doesn't matter since she's a Paternal aunt? I do take 95% after that side of the family though.  The only thing I outwardly have gotten from my mother is my lip shape.  Thank you! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/769218",
      "Title": "Paternal vs. Maternal Aunt BC Lisazc shells43"
    },
    {
      "AuthorID": "Lisazc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128780/profile",
      "Content": "May 20, 2011 06:07AM Lisazc wrote: Thanks all! I am having a very anxious day today.  I wish I could be easy going and laid back about this!  Lisa",
      "MessageIndex": 5,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/769218",
      "Title": "Paternal vs. Maternal Aunt BC Lisazc shells43"
    }
  ]
}