{
  "AuthorID": "Lisaj514",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
  "Posts": [
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Mar 31, 2014 05:00PM Lisaj514 wrote: septmom- yes 5 mg of biotin Maryfox- that made me laugh",
      "MessageIndex": 20210,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Apr 7, 2014 11:04AM Lisaj514 wrote: maryfox- congrats on ANY hair, but I get the gray stuff, used to color mine before to hide it, now we can't for a while. When did you finish chemo?",
      "MessageIndex": 20236,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "May 14, 2014 10:33AM Lisaj514 wrote: lago, I've seen your hair link before. Thanks for posting again. Your hair grew in fast and dark and you have great earrings and necklaces. I also wear different earrings everyday. The short hair really shows off your great facial features and jewelry! I'm going to keep mine short when it comes in instead of the longer curls I had. I'm just wishing for it to come in quickly. Kind of look like a kiwi now, lol!. Hair is soft fuzzy and sparse and colorless but seems to be growing...I think, hope",
      "MessageIndex": 20287,
      "PostDate": "14/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "May 16, 2014 04:13PM Lisaj514 wrote: I'll be 4 weeks PFC on Monday. I still have no body hair anywhere. Is this usual? My arms, shoulders, back, underarms, pube area, upper legs...nada. (Great not having to shave my legs or underarms now that it's getting warmer.) It feels so weird against clothes. I think I've lost more body hair since finishing chemo. and  the brows and lashes, not so good, although the ones that have stayed seem to be growing longer so I have about 10 or 15 long eyebrow hairs that I've trimmed, and same for lashes (although have not trimmed them). My head now looks like a kiwi with colorless hair but from more than 3feet away I still look completely bald. So long for things to get back to \"normal\"....",
      "MessageIndex": 20294,
      "PostDate": "16/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 2, 2014 09:18PM Lisaj514 wrote: ok,ok,ok, I'm going to try to stop obsessing about my hair and try to be thankful that I got through chemo successfully, I have a good prognosis, I'm feeling pretty good 6 weeks post chemo and that at least something is happening on my head even though it isnt fast enough for me. It's all in the perspective I guess. Got to keep reminding myself that.",
      "MessageIndex": 20406,
      "PostDate": "02/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "May 21, 2014 10:27AM Lisaj514 wrote: yes...my eyebrows and lashes falling out now 4weeks PFC. Maybe will get the model sullpies brow growth. Can you get it in stores? Hair on head is growing thin fuzzy kiwi hair (still look very bald from further than 2feet away) but still no body hair...anywhere. Except some chin hair, go figure! Not minding the lack of leg or underarm hair or bikini area hair but no pubic hair anywhere feels weird as well as the lack of arm hair, back hair (didn't realize I had any there until I lost it and my clothes feel so smooth against my skin). Well that's my hair rant! Feeling sort of normal in the inside but come on outside! I would love the short GI Jane look, even gray",
      "MessageIndex": 20333,
      "PostDate": "21/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 2, 2014 03:30PM Lisaj514 wrote: thanks jojo, I can't wait for that time...a year from now when it all seems like a distant dream..and I have hair to actually run my fingers through. I had curly hair so it will be interesting to see if it comes in curly...or straight Homemom, yes nioxin had been used by some on these boards. I haven't tried it yet. But have looked it up. Busomblues, yes you're right about looking sick without the eyebrows. I have to pencil them in everyday as soon as possible as I hate looking at myself without them. When I look close I see a few short strands, but they are colorless or white, like the head hair ugh! Lorbgoo, I have thin white fuzzy halo of hair (I call kiwi hair) but from further than 3 feet away it still looks totally bald (to me at least)",
      "MessageIndex": 20399,
      "PostDate": "02/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 23, 2014 05:29PM Lisaj514 wrote: look at this wild stripe I have going down the center of my head. 9 wks PFC today, but I'm a slow grower I realized comparing to others. But the dark stripe is crazy! ",
      "MessageIndex": 20489,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 30, 2014 07:38PM Lisaj514 wrote:  I agree with all, diablo, beautiful Here's my photo collage for 10 wks PFC today!. Seems I'm obsessed with taking pictures of my hair recovery. Mine was and is slow so so excited when I see what it now looks like. Yup racing strip is still there and so excited about my eyelashes and eyebrows return. Can even put on mascara and use my eyelash curler now even though they are still short ",
      "MessageIndex": 20540,
      "PostDate": "30/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 1, 2014 08:54PM Lisaj514 wrote: for you girls getting the chemo curl (or if you've always had curly hair like me) I've been using curly hair products for years (devacurl) after finally figuring out how to manage my curly hair. There is also a specific way \"deva\" stylists will cut your hair ( ie cutting it dry).The products have no sulfates in them, that's the stuff that makes the shampoo sudsy and also dries out hair. Curly hair tends to be dry and coarse. I use devachan products, shampoo called \"no poo\", conditioner and gel. Although you're hair may not stay curly while it is, dont brush it, just finger it dry, dont wash it everyday, but use a conditioner every day. It will look shorter than straight hair because the curl will take up length but the worse thing you can do it try and brush it out because it will get frizzy.  I'm only 10 wks PFC so I can't use my techniques yet as I just have a thin covering but look at deborahanne's picture. Her hair looks great curly. And she is embracing it now. Explore around the devachan.com website for techniques and products. There are sulfate products in stores now also but the techniques of how you manage curly hair is important. Treat your new hair like a fine piece of silk. We are all beautiful women, inside and out!",
      "MessageIndex": 20554,
      "PostDate": "01/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 7, 2014 01:51PM Lisaj514 wrote:    Today's picture at 11 wks. I am a slow grower but I'm getting used to my look and actually feel kind of pretty. Loving showing off my earrings and I'll wear different ones every day. My Mohawk/racing stripe is filling in. The top is thicker than the sides for me and still have that high forehead that I always had but my hair was very curly and brown (although colored) before. I'll see how it comes in, I may actually keep it white if it's a nice white/gray. ",
      "MessageIndex": 20564,
      "PostDate": "07/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 14, 2014 08:16AM Lisaj514 wrote: and tell me again...when does the facial hair/fur fall out? I'm very self conscious.  It looks like a very fine soft beard and without a lot of head hair I think it is more noticeable. I guess when hair starts to grow post chemo it grows everywhere! Ugh Here is a picture of my 5k race this weekend. Ran it in 36.14! It is part of a 15k Boilermaker road race in Utica ny. The biggest 15k in the country. As I've said on other threads, it makes me feel like I am back in control of my body. I ran and walked it. I have done this race for 8 years and wasn't sure I would make it this year but I did!  I am 12 wks PFC today! 2 more weeks of radiation!  ",
      "MessageIndex": 20573,
      "PostDate": "14/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 15, 2014 08:22AM Lisaj514 wrote: hollyhope, this is me at 4 wks PFC and then yesterday at 3 months. I was/am a slow grower but it's coming now!! So don't give up hope. At 4-5 wks I was thinking it would never grow but now it's coming and I'm enjoying the process!  ",
      "MessageIndex": 20589,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 15, 2014 08:51AM Lisaj514 wrote: notbuyingit, you've mentioned it before I think. Tell us about it. The biggest question...does it smell oniony?",
      "MessageIndex": 20591,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 17, 2014 02:59PM Lisaj514 wrote: Andrea, your hair looks great. Love the color and I can see those pretty eyebrows and long eyelashes. I'm 3 months PFC and just started going without head covering but it is still thin and fine. I bring a covering when going to the grocery store or restaurant as it overly air conditioned and I get cold. Unlike others mine started growing in the top. The sides and back have been slower with less texture. Many if you gave seen my interesting racing stripe that started growing on the top. It's still there but I'm getting a little more dark hair. It basically looks white in less up close. It kind of glows...lol. See the running pic, That was just this past weekend when I ran a 5 k as part if the Utica boilermaker. Deborahanne, you were here in the past, passing through so you know how big it is. Here's my hair growth from before chemo to current. I was /am a slow grower. I think the last pic on the bottom left counts as some curls coming back...right? I just put this together now, it was fun to do to see the change. Happy hair growing girls! ",
      "MessageIndex": 20628,
      "PostDate": "17/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 21, 2014 01:36PM Lisaj514 wrote: notbuyingit, I too am always running my hand over my head, also so soft, kind of like a very soft stuffed animal. I dont have enough for gel yet and it is firmly laying flat, doesn't want to budge, like running your hand against the grain. Jb, my cow licks are all directions when I look at the top of my head.so funny your changed from one side to the other Bosumblues and naiviv, show pictures of your hair. Hair chalk, never heard of but I get how it would give you  those colorful streaks I've seen in some of the young girls",
      "MessageIndex": 20652,
      "PostDate": "21/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 22, 2014 09:23PM Lisaj514 wrote: eventually I'd like the annie lennox look. I've got aways to go but I bet a lot of us could do this hairstyle  ",
      "MessageIndex": 20662,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 30, 2014 05:25PM - edited Jul 30, 2014 06:40PM by Lisaj514",
      "MessageIndex": 20731,
      "PostDate": "30/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 30, 2014 05:26PM Lisaj514 wrote: momtoirish, look into the abbey cap, easy peasy. The non ruffled ones are thin and easy to put in your purse to take with you in case you want some covering when out...like in overly air conditioned restaurants. Also sometimes I would just drape a bandana over my head at night but not tie it so it wasn't too hot, that way I could easily uncover my head when a hot flash appeared and cool off.  Homemom, I had 4 taxols also. Dose dense, every 2 weeks for 8 wks. (I also had AC before for 4 doses every 2 wks too) It's fairly common but the low dose 12 wks seems more common. It was 4 wks less than the 12 weekly treatments but it a higher dose each time. But my hair didn't start growing until 4-5 wks after finishing taxol. The 12 wk taxol people seem to start growing when on taxol. Have you looked into the May chemo thread? There will be others that are on DD taxol too.",
      "MessageIndex": 20732,
      "PostDate": "30/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Aug 2, 2014 08:30PM Lisaj514 wrote: Jules, but that's actually great for just 2 wks PFC. I didn't start growing until 4 wks. Keep taking pictures, you'll be amazed if the progress in a short time. Lots of women get more growth in the sides than the top. I think that's the norm. Mine was opposite. Top more than sides and still is  Just put this together of my hair progress. (Oops on the 6th pic, ?!) Seems like I'm obsessed with taking pics of my hair growth, especially now that it's finally growing. The first pic is about 4-5wks PFC and you can see no eyelashes and drawn on brows. I was and still am a slow grower lol. But loving having hair now! You'll get there girls!:-)",
      "MessageIndex": 20755,
      "PostDate": "02/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 3, 2014 07:20PM Lisaj514 wrote: hmm I noticed that R eyebrow is coming in but the hair is colorless. As you can see from my avatar my hair was very curly and I wore it natural and used devacurl products for curly hair which gave my hair soft ringlets. Who knows what I'll have now as those with straight hair comes in curly. I remember in the beginning I couldn't even look at myself in the mirror without hair. Now it's ok!",
      "MessageIndex": 20421,
      "PostDate": "03/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 2, 2014 03:25PM - edited Jul 2, 2014 07:55PM by Lisaj514 deeC, omg I was exactly the same way and I think I probably had almost the exact same post maybe 2-3 months ago. I finished chemo on 4/21 and I so wanted hair, any color would do. And it is all coming back now. My taste buds returned almost fully after about 2 weeks PFC, love that!!, my hair was slower than most but now is coming in and it's gray with some dark but that is perfectly ok, it's something. And eyelashes and eyebrows returning was great too, making me look more like myself, actually I feel pretty now and I can't believe I'm saying that because I hated looking at myself in the mirror for a long time. I would say to my husband that I looked like an alien, long face, bald head, pale skin, pale light eyes with no eyelashes and brows...you all know the look. And nose will stop dripping when the nose hairs start coming back. You won't even notice it and then all the sudden realize that your nose isn't so drippy anymore...yea! Vent away...you can do it here and we all know exactly what you are talking about, we get it!",
      "MessageIndex": 20557,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Aug 20, 2014 12:42PM Lisaj514 wrote: lespring, I know...trying to take a selfie of the back of our heads...great for ROM exercise though! And I know, I loved how smooth my legs were without hair and didn't need to shave legs...and other parts. But it all comes back along with the head hair...oh well. Back to normalcy I guess",
      "MessageIndex": 20834,
      "PostDate": "20/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Aug 20, 2014 10:26PM Lisaj514 wrote: and jbokland, your hair color is amazing. Wish mine was white like yours And I just remembered this picture of me at the end of the run to remember 9/11 race on governors island in nyc 3 yrs ago. It was so windy there, and this is curly hair on a windy day, medusa like...lol and I put a current picture next to it. No hair blowing, much neater. I think I like it better this way.  ",
      "MessageIndex": 20842,
      "PostDate": "20/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Aug 23, 2014 03:06PM Lisaj514 wrote: oh lorbgoo, you should definitely go without a wig. Your hair looks great, so even with good scalp coverage. I'm wearing great earrings now that really show up with short hair and you'd look awesome just the way you are. I actually loved my scarves and had so many different ones, but then I was wearing them in the winter so didn't have to worry about being too hot. Really nobody would even think twice about your hair now, it just looks like a short cut and youd look pretty and young and hip and edgy!",
      "MessageIndex": 20867,
      "PostDate": "23/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Aug 28, 2014 04:00PM Lisaj514 wrote: noonrider, henna? Wow! How long will it stay? Love the hairstyle mikesgirl. You look radiant! So cute, pretty, feminine, pretty eyes etc We will all get there some way. I'm white and curly, wish I had dark straight hair. Don't we all want what we don't have. I have about 1 1/2\" but it's curly so it just lays in curls against my head with side wings, kind of feels like a poodle. But it's hair so I'm thankful.  See background..Tried canning tomatoes for the first time today. What a tedious process, mostly with peeling the tomatoes. But here's my hair, curls and wings. 4  months 1wk PFC. Usually wear earrings everyday but had MRI today so no jewelry and didn't felt like putting on for picture. Great earrings really look great with short hair. Due to holiday will have to wait until tues for MRI results as doc that reads breast MRI is not in till tues...ugh",
      "MessageIndex": 20926,
      "PostDate": "28/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 15, 2014 09:47PM Lisaj514 wrote: yes, yes, yes, problems with my contacts now. My eyes were like the saraha desert during chemo (as well as my skin) and without lashes or eyebrows glasses just looked better and then when I did put them in I couldn't see as well as before. I wear bifocal contacts and they at least did the trick for the most part prior, but now my close up vision is worse with the contacts in and I'd have to wear reading glasses most of yhe time over the contacts so I figure what's the point. I wear my contacts only now if I want to wear my good polarized sunglasses (btw polarized sunglasses are great for light sun sensitive eyes) like when walking or running or at the beach. So chemo seems to have made my vision worse...thanks chemo :-( I'd like to try latisse for lashes and brows. I see a PA at the dermatologists office in a month for my yearly skin check. (I'm telling you, there better not be anything suspicious! There hasn't been in the past, better be nothing now as well!) Saw her just before my dx last year. Maybe she can prescribe it if I decide",
      "MessageIndex": 21056,
      "PostDate": "15/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 22, 2014 11:24AM Lisaj514 wrote: anyone have latisse turn light blue eyes darker? I read that could be a side effect. I have light eyes and wouldn't want that to happen. I'm not using latisse but thinking of asking my doc next month.",
      "MessageIndex": 21112,
      "PostDate": "22/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 29, 2014 04:49PM Lisaj514 wrote: jb, I agree, their loss. It would have been a great story, but then we are biased! I was so excited for you. I was telling my family about you and your idea. I love your designs and hoping you do well with it! I hope Joan londen wears it! Your model looks very athletic! And I was in that same limo at the komen race in Albany 2 weeks ago. It must stay in the area for benefits, PR etc (me and my sister below)  Mommom, I'm TN also and I hate hearing that she has a \"rare and difficult to treat cancer\"",
      "MessageIndex": 21156,
      "PostDate": "29/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 29, 2014 07:18PM Lisaj514 wrote: haha! That's great! If someone could photoshop it, it would look like we were together! Ok everyone, find a pink limo and take a pic inside lol! There may be lots around in oct. Ugh...October",
      "MessageIndex": 21158,
      "PostDate": "29/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Oct 13, 2014 11:12PM Lisaj514 wrote: bosumblues, thanks for the gray haired comment. My hair is now white/gray, going from medium brown (colored though). I get a lot of positive comments but when I look in the mirror I'm still surprised. It's just that it was short curly bob length brown hair to very short gray curly hair. Often I feel old ladyish. I think it's that it wasn't a choice that seems to bother me the most. When people say they love my hair I think, but ya, it's this way not by choice but due to chemo (I don't say it though but think it). It was out of my control. I can color it again but that would be so hard now to keep as its sooo gray now (more than before). I like that you say its stylish. I still feel young and want to look young. It's about 2-2 1/2\" and so curly so looks shorter. It's salt and pepper on top and bavk. Kind of wish it was all white like yours jbokland. Who here talked about coloring gray hair and enhancing it while keeping it gray. Few pages back, a month ago? Can you repost? I think you are a hairdresser. Here's a pic from my vacation to Sedona last week. My power pose, full of attitude, strength and don't mess with me cancer look. It was amazing scenery. (Btw 5 1/2 mo pfc and 1trim 2wks ago just to the sides and back to give it some shape and style). Looking for a sassy, youngish style but with curly it's hard. Also any blue eyed ladies using/used latisse and did it change your eye color? Derm doc said she'd prescribe but it could change my light blue eyes dark and not reversible (!) don't want that. Mine are short and sparse. Latisse has done wonders for a lot if you. Light eyed girls? Any experiences?  ",
      "MessageIndex": 21249,
      "PostDate": "13/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Oct 23, 2014 10:50PM Lisaj514 wrote: yes feeling some sense of control helps, whether it's using a shampoo or something else. It's what we need after all that has been done to us. Actually I used coconut oil mixed with castor oil and rubbed it on my head. (Google it, supposed to help hair grow!lol). Hair still grew slow but maybe it would have been even slower. I think some people just grow back fast, some slow, some curly, gray, dark, thick, thin, Mohawks, cowlicks etc.  lorbgoo, your hair looks amazing! Thick, nice color, nice waves. Actually bed head is the new look, tossled etc so your right there. I wouldn't change a thing to it now.  I love seeing everyone's progress and nice that we can show others just starting out. It helped me so much seeing others through their hair stages.  Remember though, we are not our hair. We are beautiful inside and out. Actually I think inner beauty really shines through at the \"short\" stage",
      "MessageIndex": 21318,
      "PostDate": "23/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Oct 28, 2014 12:03AM Lisaj514 wrote: mommom, love the hair, smile, earrings, lipstick, pretty blue eyes. You look awesome. Very hip! Very Cool with the dark roots and light tips. If you get just a teeny trim to get rid of the wispy ends it might look even more awesome. (I mean that in the best way). At least you've got dark roots, not like my gray with dark center strip. So pretty Ya see...do I want to look adorable?! Oh well, it's fun",
      "MessageIndex": 21338,
      "PostDate": "28/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Nov 19, 2014 09:11PM Lisaj514 wrote: lorbgoo, gosh that's beautiful. Love it. If I only had dark hair mine would look something like that and I like that better than my gray. Oh well, the grass is always greener... At least I have hair and it's coming in nicely, sometimes I just feel old with this gray but really don't want to be dependent on coloring every 4 wks so trying to embrace the new color. I hear that gray/silver/white hair is in, very cosmopolitan or something",
      "MessageIndex": 21427,
      "PostDate": "19/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Dec 4, 2014 09:25PM Lisaj514 wrote:  Short and gray...I do t know. Trying to embrace it but sometimes I feel like an old lady. I get lots of compliments though. Below is how I wore it before BC, (6 wks before dx) last sept 2013",
      "MessageIndex": 21501,
      "PostDate": "04/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Dec 7, 2014 08:37PM Lisaj514 wrote: thanks to so many of you for the positive comments on my hair and \"new\" look! It really helps, coming from those that know how it feels. I keep needing the positive reinforcement it seems. Now I was a slow grower so you all will get there too. I never thought I would. I used biotin towards the end of chemo (mo said it was fine) and still do. It didn't help the speed of regrowth but now it seems nice and soft and I don't loose any hair! And it seems stronger. Don't know if it's from that but it can't hurt. Also supposed to be good for skin and nails. Before BC I would shed like crazy. I occasionally use castor oil mixed with coconut oil a few times a week, if I remember, and massage into scalp, and leave it on for an hour or so (on Weekend or non work day) and then wash it out. It's supposed to help stimulate growth and it keeps my hair so soft and shin",
      "MessageIndex": 21517,
      "PostDate": "07/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jan 1, 2015 10:26AM Lisaj514 wrote: these posts make me smile on this morning of a new year. Mommom, youARE beautiful as you are. Puffin, try the conditioner, gel trick. That's so common for it to come in as a Mohawk. Are you talking about In the back though. I think it's cool when it comes to a point in the back. I have a very high hairline in the back so no tail or point for me Slv, that was a beautiful post about your hair. I could feel your joy on that day at the hair salon and how beautiful of that hairdresser. I love to hear about the good spirit and kindness of people we have never met. People are naturally good I believe, we just need a situation to bring it out. I want to hug him now too! Marie, glad you are free! I know what you mean about the sides and flying nun look. One side of my head curls out and the other side curls inward. You either have to get past that stage until it grows longer or trim it (but then you have to keep trimming when it gets like this-that's what I do because I'm keeping it short) or try toshape it with gel. I think gray hair looks good in short style. I'm more gray/white than salt and pepper and short is the way to go for me. Think jamie lee Curtis or annie lenno",
      "MessageIndex": 21636,
      "PostDate": "01/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jan 28, 2015 10:07PM Lisaj514 wrote: haven't posted a hair pic in a while. Here's most recent status. Finished chemo 4/21/15 9 months ago. Had curly hair before and still curly. And all this gray was underneath and covered by coloring , light to med brown (my natural color before gray). I'm liking the gray although sometimes it still surprises me in the mirror. I was a slow grower. Nothing for 5-6 wks. I've had it trimmed 3x just back and sides and tiny tiny bit off top and front to get rid of that fine first hair. It's actually 3-4\" if I pull out the curl. I get lots of compliments on my hair lately. And my family husband and friends love it and even strangers will say they like my hair. It was just 1 yr since I had my head shaved, on 1/27/14 on the morning if my 2nd chemo, 14 days after first chemo. Really thought id never have hair again. Wore 2 hats on some days last winter it was do cold! Had lots of pretty scarves, abbey caps and wore wigs on certain days. Hang in there new hair forum girls. It will grow even if you don't think so and you'll get to try a new short style which looks great and trendy on so many of us ",
      "MessageIndex": 21789,
      "PostDate": "28/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jan 29, 2015 10:23PM - edited Jan 29, 2015 10:27PM by Lisaj514 wow, maybe mine would be that long if I didn't cut it...or it wasn't so curly. Looks great and the color is pretty. When it comes to 6-8mo after pfc no one would even know what we went through by our looks. I am keeping my hair short, that's what I've decided looks best on me with it so gray. We are all beautiful inside and out. I remember coming on this forum often to look at hair pictures. It kept me hopeful and I thought everyone looked so beautiful with their short hair coming in",
      "MessageIndex": 21800,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Feb 17, 2015 08:35PM Lisaj514 wrote: congrats homemom on 1 yr and going natural. Jamie lee Curtis look is awesome. Her name and look has been brought up so many times on this thread. I'm staying gray and no more coloring for me. My hair is a pretty gray people say, more salt than pepper but also say I think I look old. Put some gel in it and get a cool spunky look. Many of us have pulled it off with a great new look. The first mamo (on non cancer side for you?) is nerve wracking for sur",
      "MessageIndex": 21843,
      "PostDate": "17/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Feb 23, 2015 08:50PM Lisaj514 wrote: everyone notice all the short hair on the beautiful women on the oscars last night?! . Faith Hill, of course annie Lennox, scarlet johansson. It's the new \"in\" look. Short hair is in",
      "MessageIndex": 21866,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Apr 3, 2015 08:00AM Lisaj514 wrote: ahh thanks everyone! So nice! Las Vegas bound tomorrow for vacation. Will bring my new curling iron hoping I can reproduce the style again, will still wear it curly head though if I cant! Have a beautiful Easter and Passover everyone! Happy spring and I hear hair grows faster in warmer weather so bring on the warmth!",
      "MessageIndex": 22048,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 21, 2015 07:36PM - edited Jul 21, 2015 07:39PM by Lisaj514 Haven posted a hair pic in a few weeks. tOk here another gray Head!.ive had a few haircuts, at least 4. Im14 mo pfc. Another trim tomorrow. I was brown naturally and colored it to cover the gray for many years but I had no idea of how gray I was until it started growing in. It came in very white which was ok. Now I'm showing some darker strands. I actually prefer the bright white hair but it is very different from my prior color. I'm keeping it gray. No more coloring for me. Maybe it makes me look older but right now I don't care. Just get a \"young funky\"style. You can pull it off  Below is about 1yr ago at 3 mo pfc and then at 6 mo PFC after my first trim. I've come a long way baby!   ",
      "MessageIndex": 22427,
      "PostDate": "21/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 21, 2015 10:08PM Lisaj514 wrote: thanks. I love how everyone looks! We all have our own style and any color, length, curl or no curl is perfect because so are we! And I am \"only\" 55 so being this white is a little early. And my hair TOOK FOREVER to start growing! I had dd taxol every other week for 4 treatments. My hair didn't start growing until about 6 wks pfc. Not much there! Like baby bird hair. See...it'll come back girls even if you think it never will like I did. Have faith. This is 6 wks pfc so trvler if you have 3/4\" that's awesome! You're on the way. (Also note the drawn on eyebrows and I have no eyelashes here. They fell out fully about 4 wks after chemo, just when you think you're done with the hair loss...bam! Your body forgot about the brows and lashes! Lol). I never showed these pics much before, but for some reason I don't mind at all now. I think its kind of cool and now that im on the other side. Ok enough pics of me for a while. Love seeing all of you beautiful ladies! wP",
      "MessageIndex": 22430,
      "PostDate": "21/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Feb 18, 2016 12:58AM Lisaj514 wrote: I actually got the most compliments I've ever gotten when my hair was white and so short. My hair was not very comment worthy before I guess. Here's a hair collage. First picture is before obviously, then 3mo pfc, then 6 months (after first trim) then at 1 yr. yup it came in very gray and I'm keeping it gray. I get compliments on the color. I colored before so didn't know how gray it was until it started coming in natural color and I was like OMG! But I liked it, most days. I'm \"only\" 55 and totally white/silver now. But now gray is the new in thing. I have naturally curly hair and it came in very curly but that was normal for me but now at almost 2yrs pfc (in April) it's getting straight? Never had straight hair before. Surprises at every turn with this diagnosis. \"enjoy the process. You get to try new hairstyles with the wigs and then the rgrowth ",
      "MessageIndex": 23435,
      "PostDate": "18/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Feb 18, 2016 01:06AM Lisaj514 wrote: And here is one of my favorite \"don't mess with me power kick ass chick\" photo at 6 mo pfc and 3 mo after finishing rads on vacation to Sedona. Be the warrior...or at least pretend. There is life after bc",
      "MessageIndex": 23437,
      "PostDate": "18/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Aug 20, 2014 10:05AM Lisaj514 wrote: kite, that's just where I was when I started going topless \"most\" of the time. I found restaurants and grocery stores to be cold so brought a cap. Stick one in your purse and you can put it on if feeling uncomfortable in certain situations, that's what I did. You'll be able to slowly get used to it. You have dark hair so at least it shows. I just looked like I had a white fuzzy halo for a while. You are beautiful, you have great cheekbones and you also have eyebrows (!) and it looks like pretty blue eyes!! Wear some great earrings, some pretty eye makeup to accentuate your pretty eyes, and you'll look gorgeous! You already do!",
      "MessageIndex": 20827,
      "PostDate": "20/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Aug 24, 2014 11:40AM Lisaj514 wrote: yes, everyone accepts the hair loss in their own way and there is no right or wrong way to go about it. If you want to cover with wigs cool scarves or hats that's fine. If you want to go bare that's fine to and no one should make you feel bad about your looks. but there is that transition point when deciding to go topless for so many of us that is hard. Small steps helped me and also positive comments from others as I didn't have a good self concept if what I looked like..was it as bad or obvious as I thought? and I finally realized the answer was no. And then..who cares? I'm kind of loving my short cropped white curly hair. I'm having fun with big interesting earrings, like you lago. And weird to say I'm feeling more \"beautiful\" this way than with all that hair before. Any time I look at a picture of one of us covered, bald or inbetween,, all I see is strength, courage, grace and beauty",
      "MessageIndex": 20872,
      "PostDate": "24/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Aug 26, 2014 07:45PM Lisaj514 wrote: jb, awesome, maybe we will have a tv star amongst us. And I hope they show your sassy head designs. That would be great. Is your BC organization with the ACS? I know you're from Saratoga, did you get married there? Thought it was in fla, didn't realize not legal there. Hey ya, I didn't get an invite either lol! Let me know next time in Saratoga. May have to come meet you! Jules, 5 wks is still so soon to tell how it's all going to grow. I've said it many times, by 5 wks I still had basically nothing. I tried castor oil mixed with cocoa butter (look up castor oil for hair growth, there's all sorts of supposed hair growth benefits, can't hurt). Maybe it helped. But yiu have to have time to leave the oil on. Or ask your hairdresser about nioxin. Haven't used but look at others posts, may help. And noonrider, I've been thinking about you and your comment about having bad hair before. A good hairdresser should work with what you have with the right cut and style and instruct on you on how to take care of it. It took me a long time to do the right thing with my curly hair, the right cut and care techniques and products. Good chance yours will come in thicker, I'm hoping for you. A fresh start and then keep looking until you find the right hairdresser for you. ",
      "MessageIndex": 20900,
      "PostDate": "26/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 8, 2014 04:19PM Lisaj514 wrote: almost 5 months pfc. Tried my hand at bad ass look and hair today, but don't think I quite got it. Lol. The gel I have just wouldn't hold it up straight. Just a pompadour look with my receding hairline and widows peak.  That's why I've always needed hair on my big forehead! But at least it's hair and getting thicker I think. ",
      "MessageIndex": 20994,
      "PostDate": "08/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 15, 2014 02:21PM Lisaj514 wrote: wow, I will bring it back to hair topics...lol. Those using latisse, do you have to use it forever? If not, what about when you stop, will they slow down growing and when they fall out come in short and thin again. I'm 5 mo PFC and my lashes and brows are thinning again. I hate having to fill in brows so much again. I know it's the growth cycle, they all started growing at the same time, now that it's probably time to \"shed\" as normally happens, and it's happening at the same time. My lashes have always been pretty short and thin and thinner since starting menopause (peri menopause before BC). So the long length you get with latisse, does it last. And then what's in it that's making the hair grow long and thicker, could that be harmful too?",
      "MessageIndex": 21045,
      "PostDate": "15/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 15, 2014 08:02PM Lisaj514 wrote: latisse girls, which doc gave you the prescript? And thanks for the responses. Wish my lashes were longer. Long lashes with short pixie hair, I'm thinking twiggy. My hair is getting tighter curls and puffy. Oh well, still better than bald. You do look  adorable, jb.",
      "MessageIndex": 21053,
      "PostDate": "15/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 29, 2014 07:38PM Lisaj514 wrote: There! Lol ",
      "MessageIndex": 21159,
      "PostDate": "29/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Oct 1, 2014 03:48PM Lisaj514 wrote: my first haircut 5 1/2 mo this post chemo! It wasn't very long, maybe 1 1/2-2\" but I wanted a better shape. It was kind of looking like a ball, poodle, top of a bad q-tip, you get the picture. Keeping the color for now. He took a lot off the back and sides and nothing off the top or front. ( I don't know why one pic is so big and the other small??) ",
      "MessageIndex": 21163,
      "PostDate": "01/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Oct 16, 2014 10:31PM Lisaj514 wrote: noonrider, I just looked at your blog. Amazing. I'm going to follow you. It's beautiful, and the pictures, also amazing",
      "MessageIndex": 21276,
      "PostDate": "16/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Oct 27, 2014 07:31PM Lisaj514 wrote: so this is what is happening on top of my head, lol! It can't get any longer if it just keeps curling up in perfect little curlicue circles. This is after just air drying and not touching it after a shower. Sometimes I fluff it up some but then I get the fuzzy q-tip look. Someone asked me recently how I got those perfect curls. She thought maybe I pin curled it. It's crazy how it grows this way right out of my head, haha. I like it about 50% of the time. It is easy though. People pay for this I'm often told (6months post chemo btw) ",
      "MessageIndex": 21333,
      "PostDate": "27/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Dec 10, 2014 09:55PM Lisaj514 wrote: jb, YES! Nice. I'm getting my second trim on Friday. My color is just like yours but with tight curls. Looking for something cool and \"edgy\", if that's possible with these cutie curls, lol Yea, minus two on your first trim, how exciting! I'm going fri too",
      "MessageIndex": 21533,
      "PostDate": "10/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Dec 29, 2014 10:26PM Lisaj514 wrote: candi, I'm also TN. Join us on \"Calling all TN's\" thread. Lots of info and support there. And some of us here on this hair board are also on the TN thread. Go into your profile and add your stats so it wil come up on the bottom of all of your posts. The hair thing is so frustrating especially when it's not coming back as you had thought or were told it would. What does your MO say about lack of hair regrowth? How was your hair before? If it grew slow before it may be even slower now. My hair growth was slow before and now and thankfull for the curls because it covers up the thinness. And over the past 2-3 months it seems to be thickening up a more for which I am grateful. also take biotin but don't know if it's doing anything.",
      "MessageIndex": 21623,
      "PostDate": "29/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jan 2, 2015 01:57PM Lisaj514 wrote: bow, looks great, looks thick and healthy with nice color. You look beautiful, go out there and be bold and confident. I bet you'll get lots of compliments. It's close to jamie lee Curtis or annie Lennox look as I mentioned above, except for being dark. My eyelashes are falling out...again, (8mo pfc)but this time there are new short ones already there. They just need to stagger their growth and shedding phases. Funny how the top lashes have fallen out but not the bottom. IDon't put mascara on the lower ones. So I think the eyelash curler may stress and weaken the lashes on top as well as taking the eye makeup off even though I try to be gentle. I still remember so well not having any lashes, brows or hair so I'm appreciative for what I've got",
      "MessageIndex": 21645,
      "PostDate": "02/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jan 2, 2015 03:32PM Lisaj514 wrote: bow, haha lol, ya why don't you tell jamie next time you meet her! Is this california? Where? And what do you do if I can be nosy, that you've met her",
      "MessageIndex": 21648,
      "PostDate": "02/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Mar 6, 2015 07:46PM Lisaj514 wrote: http://www.dispatch.com/content/stories/life_and_entertainment/2015/02/20/1-gray-hair-becoming-hallmark-of-coolness.html For us gray haired beauties. We are now cool!   ",
      "MessageIndex": 21932,
      "PostDate": "06/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Apr 1, 2015 09:13PM Lisaj514 wrote: my new hairstyle today. Almost 1 yr pfc and about 10 months for hair growth. Have had 2 trims. Today went for another trim and my hairdresser wouldn't cut because he loved the length and just showed me how to use a curling iron!. New experience for me as always wore it in natural curls which were very tight curls. The color is new. colored it brown (my natural color) before BC but it came in a \"nice\" gray color. I'm keeping it gray! No more coloring anymore for me! Gray is the new hip color I hear! ",
      "MessageIndex": 22042,
      "PostDate": "01/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 4, 2015 11:04PM Lisaj514 wrote:    13 1/2 months pfc (but who's counting ...me!)? Stopped coloring when it started coming in and I realized it was going to stay gray. Never thought it would be this gray! Keeping it gray. Would be too hard to color, and the roots would be aweful! Kind of liking it most of the time. Get compliments on it, and I never did before when it was boring brown. It's very white with some darker areas in the back and top.looks pretty in the light, kind of platinum and I was normally medium brown. Cancer let me start with a clean slate. Would have never done this but oh well, thrilled to have hair and be healthyand it's kind of cool looking",
      "MessageIndex": 22305,
      "PostDate": "04/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 4, 2015 05:57PM Lisaj514 wrote: ninja, exactly! I got lots of compliments early on because it was different I think and this very white hair on a young(ish!) person is unusual. Looks chic and edgy I'm sure. I always wore cool earrings with my scarves and when hair was so short. Made me feel better. Now that it's longer I don't get compliments anymore.... Hmmm I also used coconut oil and castor oil. Don't know if it did anything at be it did) but also felt like I was doing something.",
      "MessageIndex": 22544,
      "PostDate": "04/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 21, 2017 08:20PM - edited Jun 21, 2017 08:22PM by Lisaj514 just my 2 cents regarding hair color. I was a regular on this page when going through my treatments. I was definitely hair obsessed during the regrowth phase. I am 3 yrs since hair started growing back. My hair is longer than my avatar pic but same color. My hair was medium brown (dyed) for many years. When my hair came in it came in white/gray. I didn't realize how white I was. It's actually a pretty white/silver color. You may want to consider keeping your natural color and not putting more toxins on/in your body. (We already had enough toxins with chemo!) it's much easier going natural now that it has been done for us. It's hard to grow out when deciding to stop coloring. It's a very popular thing now! Going gray. There are some very beautiful gray haired ladies out there.  I'm leaving mine natural. I second guessed it in the beginning. But No more roots! No more toxins! Look at the \"going gray gracefully\" fb page. Although we are not \"transitioning\" there are some great gray hairstyles and support for being who we are.",
      "MessageIndex": 25457,
      "PostDate": "21/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "May 21, 2014 09:38AM Lisaj514 wrote: radical, love the idea of cancer survivors struttin' their stuff at a fashion show. In their beautiful bald heads and/or any stage of regrowth. One group on this board(dec chemo thread) at one point chatted about needing a calendar of \"baldy beauties\" when we were all posting our bald looks",
      "MessageIndex": 20331,
      "PostDate": "21/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 9, 2014 07:13PM Lisaj514 wrote: notbuyingit! Your hair looks great! I can't wait until mine looks like that. I'm 7 weeks PFC today and I have a soft thin white covering, fur like! you all know what I'm talking about!",
      "MessageIndex": 20438,
      "PostDate": "09/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 12, 2014 11:36AM - edited Jun 12, 2014 11:39AM by Lisaj514 Deborah, your hair looks great. I have naturally curly and always wore it natural although I colored it. I hope mine comes in just like yours. I'd love it! I'm only 7 wks PFC and my hair is coming in but slower than most if the other ladies on my forum. It's white and fine and thin and \"furry\" with the top growing more than the sides and back",
      "MessageIndex": 20446,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 16, 2014 08:56AM Lisaj514 wrote: jb, you are amazing. When given lemons...make lemonade! Awesome lady! Look at that smile. I want to be in your head for just one day lol!",
      "MessageIndex": 20616,
      "PostDate": "16/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 17, 2014 09:53PM Lisaj514 wrote: mommom, yes definitely baby chick fuzz, look at the 4th pic of me above. That was prob 4-5 wks PFC. I had 4ac and 4dd taxol. Mine didn't start growing until about 4 wks post. I took forever to start growing my hair. Was actually worried it would never come back. It's still slow but steady now so I'm confident it will continue. My hair was somewhat thin before but never really noticed because it was always covered by the curls. Barb, the runny nose and omg the tissues in every pocket lol, yup! My brows and lashes fell out fully  just bout the time my head hair started growing. In the 4th pic I had drawn on brows and no eyelashes. It's a crazy process and everyone is different. I loved not having leg hair and bikini area hair. But now I do, darn",
      "MessageIndex": 20633,
      "PostDate": "17/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 23, 2014 04:50PM Lisaj514 wrote: busom, above is my hair before. Don't know what I'll get after. Look above a few posts and you'll see what I've got now. Hope yours comes in as you want. I know, when I finished chemo I thought it would start to grow as usual, like prior to chemo and that it would be much quicker. I thought I'd have much more hair by now. I'm going without any head covering for the past 2-3 wks. I was slow coming to terms with it but now it's ok. Ya maybe I'll have a real hairstyle by the fall(even if it's real short, at least looking like some kind of style)...maybe? That would bring me to 6 months PFC...only 13 wks now. Ok let's see a pictures, before and after...",
      "MessageIndex": 20667,
      "PostDate": "23/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 23, 2014 09:38PM Lisaj514 wrote: mikesgirl, your hair is great and you look so pretty and radiant. Is that your own color?  Notbuyingit, ya my mom also taped my bangs down to trim them. My forehand is so big it will take forever to cover it. Ho humm. Waiting... Sorry kite, you look pretty in the small avatar. I'm sure you will get the confidence soon to go topless. The stubble is the beginning",
      "MessageIndex": 20674,
      "PostDate": "23/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Mar 23, 2014 09:02PM Lisaj514 wrote: slv58-I also wear a cap to bed every night because it is so cold...but then again I live in upstate ny and it has been winter here for like 6 months so far and is not letting up and soooo cold all the time. I can't even think about having a bare head",
      "MessageIndex": 20183,
      "PostDate": "23/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Mar 24, 2014 03:10PM Lisaj514 wrote: Ann and hortense-thank you for the hair info, it was helpful. I don't want to shave anything off now, I'll take blue or orange...as long as its hair",
      "MessageIndex": 20187,
      "PostDate": "24/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Mar 31, 2014 01:10PM Lisaj514 wrote: septmom- I also have 2 more taxols left. I have been taking biotin for about 1 month. My mo said it was fine to take during chemo as well as an Integrative med doctor that I have seen. My nails feel real strong since taking it. I have hair stubble that seems to be growing but very slowly and it's not very thick but it seemed to start growing since taking biotin",
      "MessageIndex": 20207,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "May 21, 2014 10:15PM Lisaj514 wrote: mine started thinning when on chemo but really started to fall out after finished and still falling out now, 4 weeks post chemo. I'm also wondering how long it will continue like this and start growing. Thinking of ordering the model supplies rapid brow growth that mikesgirl mentioned.",
      "MessageIndex": 20337,
      "PostDate": "21/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "May 22, 2014 06:30PM - edited May 23, 2014 07:40AM by Lisaj514 minus two, haha yes buff (chemo brain!), got mine at sahalie.com. Glad you loved it now looking forward to getting mine, I have kind of a weird shaped head, long and narrow but really round in the back.  Mommom, thanks! I use a combination of brow powder from Clinique and Brow Power (got from LGFB)and sometimes bobby brown eyebrow pencil. ",
      "MessageIndex": 20351,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 2, 2014 06:55PM Lisaj514 wrote: lorbgo, last chemo was April 21 so 6 weeks ago today.,everyone's hair growth is so different. I started getting slight fuzz about 3 weeks PFC but still very thin fine hair that is gray or colorless. No hair growth on taxol as some have gotten (I was on dd taxol 4 treatments for 2 months). Hope your hair starts to show up soon, it should! My eyelashes and brows started falling out in earnest after chemo ended, I guess they are on a different growth timeline than head hair. I'm waiting for the growth spurt..,it should be soon!",
      "MessageIndex": 20401,
      "PostDate": "02/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 14, 2014 11:30AM Lisaj514 wrote: I don't want it to come in prickly though. I'm hoping it will eventually fall out.(maybe?) I have a little Remington electric shaver but it feels like soft stubble. There was also mention of \"fuzz off\"  a cream hair remover but I'm concerned about the same thing. I'm getting compliments from my medical staff, family and all I my kids friends (young adults in their 20's) this weekend on my hairstyle, I've heard sleek, edgy, cool etc. I'm starting to buy it! The color kind of glows its so white lol! Notbuyingit, how was the wedding? Did we see pictures?",
      "MessageIndex": 20575,
      "PostDate": "14/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 15, 2014 04:41PM Lisaj514 wrote: hollyhope, I was/(still am) hair obsessed also. That's why we find each other on this forum! I would look carefully and closely in the mirror many times a day to see if there was hair growing, from all angles...you probably know the drill. I did not start growing during chemo, only after stopping and the first 3 wks was basically nothing. Just this past week at 3 months PFC have I started going out without covering...and feeling pretty comfortable about it. It took me a looong time. My natural hair color was medium brown but started coloring my gray many years ago so I've lost track of how gray I was. I believe I was more than 50% gray pre chemo.  I also have naturally curly hair and I wore it curly. Good luck with your regrowth. Take pictures even if you feel you don't want to at this stage, it's helpful to see the change from week to week",
      "MessageIndex": 20604,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 20, 2014 08:13PM Lisaj514 wrote: Busomblues, yes that os the right way to take care of curly hair. Mine was curly prior and I learned not to brush it and not to wash everyday. Use a sulfate free shampoo and conditioner and yes, leave a little conditioner in. I'm hoping mine comes back curly but straight would be a nice change. Always wanted straight hair Funny how mine is coming in with a little curl on the top but the sides are pin straight and very fine and the hair lays so flat on my head. I wish mine would stick up, that way it may look like there is more of it and I could definitely do the spiky hair thing",
      "MessageIndex": 20648,
      "PostDate": "20/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 22, 2014 09:53PM Lisaj514 wrote: yes definitely, Jamie lee Curtis too. My hair won't stick up though. Flat to my head and also barely 1\" now and so thin. I had curly hair before that would always be sticking up in all directions. Will channel Jamie or Annie  ",
      "MessageIndex": 20664,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 24, 2014 11:54AM Lisaj514 wrote: lago, ...but we were talking about the hair I think...lol! Bosum, yes twiggy! Will have to look up pictures now I'm done with radiation tomorrow girls...I'm free! I'm going to embrace the white for a while and see how I feel. I hated when the roots started to show especially on a windy day ",
      "MessageIndex": 20682,
      "PostDate": "24/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Aug 10, 2014 10:03PM Lisaj514 wrote: swissmiss, yes you might love the sassy head by jbokland. Also I was the same way. Slow grower and at 4 wks still had barely peach fuzz (see first pic). I posted here many times just like you. I also,have posted my hair growth progress and here I am at 4 and 7 wks PFC then now at 3 1/2 months. It's so hard to be patient and that is what everyone here kept telling me. I didn't believe it. I thought I might be bald forever also! My hair is still shorter and slower growing than most at this point but once it starts coming you will see a lot of change. It definitely wont be a year. At 1 mo PFC I thought I wouldn't have hair until oct or nov, that's what I was figuring but now I do and loving it! (It is like watching paint dry though...I totally get it) ",
      "MessageIndex": 20779,
      "PostDate": "10/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Aug 23, 2014 10:08AM Lisaj514 wrote: lorbgoo, yes you look great for 3 months. It's coming in beautiful with great color",
      "MessageIndex": 20864,
      "PostDate": "23/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 2, 2014 03:26PM Lisaj514 wrote:  No, not me lol! but this is a model from the chico's catalog that my mom had at home. I saw this models hair and immediately thought, looks like a cool stylish \"post chemo\" hair style. I had to take it home with me. Of course she's gorgeous but this is the look I'd love, and I think some of you already have it. Of course I'm white/gray and curly but this is the shape I want, I think I'm almost there. At this stage we need a really good hairdresser that understands chemo hair and coloring options and cut and style for this short hair. But look at this great pixie hairstyle. PamelaC, I'd love to see a picture. If you feel strongly about not liking the color then maybe it's time to think of coloring, but go gentle and subtle or or sometimes the more you look at yourself the more you'll get used to it. Have you gotten a trim yet? Maybe it's time to shape it up. That may help. Positive feedback from others certainly helps, it did for me because I did not have a concept of what I really looked like. And your old color may return. I've heard to wait a year, then you'll know what you'll have. Any veterans want to chime in? I'm just over 4 months PFC and I'm much grayer than before but I'm kind of liking it. I used to color it before, med to light brown. Here's a recent pic of me and my sisters and mom. I've gotten so many compliments this weekend on my hair. \"Sophisticated\", \"stylish\", and love getting new big earrings. I actually really like how I look in this picture. As you can see my sisters have the naturally curly hair too...not my mom though. My hair was kind of long like my sisters. I hope I can continue to tame it as it grows in but I'll get a trim as soon as it gets unruly and not neat but will keep it very short I think. ",
      "MessageIndex": 20946,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Mar 23, 2014 09:13PM Lisaj514 wrote: after I buzzed my head the little stubble continued to fall out for another 4-5 days and then was done. Now the stubble that decided to hang on is growing so I'm just letting it go although it is sparse and of course the strong ones are the gray ones! I'm on DD taxol and the hair seems to be growing slowly but there is so little of it. My hair seemed to be thinning before BC (damn perimenopause/menopause!) so who knows how it will come in now. The only ones that seem to be hanging on now are the gray ones. I know many women say their hair comes in gray (or grayer).  Why is that I wonder?",
      "MessageIndex": 20184,
      "PostDate": "23/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 15, 2014 10:13PM Lisaj514 wrote: here's a link I found to cute chic short hairstyles, to keep us motivated toward the future. I love most of these but there's nothing for curly hair. May have to continue with my cute poodle look. Some of you already have these hairstyles if your a while out from chemo. Also shows how short hair can be adorable, sexy, chic, sophisticated, modern, edgy. http://www.latest-hairstyles.com/short/haircuts.html",
      "MessageIndex": 21058,
      "PostDate": "15/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Apr 28, 2014 01:44PM Lisaj514 wrote: septmom- ya a quarter if her hair lost, wondering the same thing. And what chemo was she taking? If  adriamycin then no way she could've have gotten away with such little hair loss. I was also thinking she used the cold caps...so say so, right?",
      "MessageIndex": 20250,
      "PostDate": "28/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 25, 2014 10:48AM Lisaj514 wrote: yes, yes, yes Jules! A big difference in the last 3 weeks! And eyebrows too!  Looking great!",
      "MessageIndex": 21132,
      "PostDate": "25/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 26, 2014 03:53PM Lisaj514 wrote: jb, wow, wow, wow! Yes! Did you just see Joan Lunden on the cover of people wigless? She looks awesome. I do t think you should have to shave your head though. It shows the progression from bald to short hair. You have lots of pictures to show of when you were bald as well as others that have used sassy head. Maybe Joan wants to use it and show it off. She can model it for you. Amazing! Congrats. We will all set our dvr's to record it. Let us know how this progresses. They have to use you! ",
      "MessageIndex": 21135,
      "PostDate": "26/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "May 22, 2014 01:39PM Lisaj514 wrote: here's a collage of my eyebrow transition lol. First is a week before starting chemo, figured I should take a picture so when I loose my eyebrows I'd remember how they looked when I have to draw them in, second is current eyebrow status 4 1/2 wks PFC (no makeup), third is also now but with some makeup (eyebrows drawn in and eyeliner) and last is me looking carefully for those little strands of hair that I hope start to grow, lol! I've got the fine kiwi fur now.   Wow picture is so big...a little scary with these crazy eyes looking at you! Also my freckles and age spots have come out so more since chemo. I love my abbey caps and scarves (I have a wig but only wear it in certain situations) and also just ordered a \"duff\" made of moisture wicking and uv protectant material to wear this summer to protect my bare head and absorb the sweat when exercising or working outside",
      "MessageIndex": 20346,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 1, 2014 10:19PM Lisaj514 wrote: ugh I feel like I'm getting obsessed with this hair thing. I'm 6 weeks PFC tomorrow and have now lost all eyebrows and have 2 eyelashes left on each eye. My head looks like a fine white halo when In the right light. It's really thin and colorless or white and maybe 1/8-1/4\" long with some slightly longer strands sticking out. I know you all say it will come but I'm not good at being patient and this is like watching paint dry! I was good at drawing and filling in eyebrows when I had some left to follow, just 2 weeks ago but now it doesn't look so good anymore but the thing is I'm feeling good otherwise so why doesn't my hair just start cooperating. I have light eyes so without eyebrows and eyelashes it looks down right scary. Working on the brow pencil still and eyeliner and wearing my glasses almost full time now as my eyes have seemed to change and can't see well with the contacts. At least the glasses seem to hide the weird looking eyes. Before this I was thinking that the hair grows in like normal hair that has just been shaved and didn't realize that the chemo damages the hair from the follicle and that needs to heal and normalize first before real hair comes back in. I hate this. I dreamt last night that I had a nice covering of dark hair that I was confident in going out in, but woke up bald again. :-( Sorry for the rant, I'm just getting tired of this cancer thing. I thought I'd be bold, bald and brave but I realize that I'm not that bold and brave and way too self conscious of my looks ...damn it! Even at this age I'm a work in progress. Good night ladies, thanks for listening",
      "MessageIndex": 20392,
      "PostDate": "01/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 1, 2014 11:00PM Lisaj514 wrote: Lori, Ive been taking biotin for a while. Nails are great though. I also just got model supplies rapid brow growth recommended by another woman on the December chemo thread. Been using for about a week. Will see how it goes. Also using castor oil and coconut oil combination (1:1) and massaging it into my scalp once a day (google it, you'll find info). Supposed to help so I'm hoping I'll see something more soon. Even if it doesn't help at least I feel I'm doing something",
      "MessageIndex": 20394,
      "PostDate": "01/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 2, 2014 09:38PM Lisaj514 wrote: forgot to add another positive. I'm actually thrilled with the lack of leg hair, underarm hair, bikini area hair etc especially with the summer being here now. I wish that would last, but I'm sure once the head hair starts coming back in force the body hair will too. Oh yea, facial hair/chin hair is coming back. Greaaat! Was hoping chemo permanently killed that hair but I guess not so. ",
      "MessageIndex": 20407,
      "PostDate": "02/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 3, 2014 09:57AM Lisaj514 wrote: look, look!! I didn't realize I had so much hair in the back and sides until I took a picture with my phone after a shower when it was sticking up and \"fluffy\". I'm so exited!  ",
      "MessageIndex": 20416,
      "PostDate": "03/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Oct 25, 2014 09:52PM Lisaj514 wrote: yes, mine too jb! And I've got curls to boot! Real \"Q-tippy\" lol! Still remember so well longing for any hair so this is totally ok. 6 months PFC and 1 trim 3 wks ago. Still getting so many compliments on my stylush, sophisticated hairstyle",
      "MessageIndex": 21329,
      "PostDate": "25/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 19, 2014 05:51PM Lisaj514 wrote: ok so when does this excess facial hair (jaw line, cheeks, chin, side burns etc) start going away. I know I've heard of trimming with little battery operate trimmer, it or using facial hair remover (fuzz off?), but will it eventually thin or fall out on its own? For how long does this continue? I am almost 9 wks PFC (on Monday) and I am so excited to be getting hair back, esp lashes and brows and head hair but wish the other body and facial hair would stay away. Guess we can't have it both ways. The hair on my head is white, oh well, I'll take it, better than nothing! ",
      "MessageIndex": 20472,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Oct 28, 2014 05:58PM Lisaj514 wrote: omg, me too. Still have a picture of her on my kitchen counter. It was my inspiration even though I'm curly and gray, that really short look is great and stylish. I would definitely go there if mine was straight noonrider, I know that book! Have been using curly hair techniques for years and was trying to grow my curly hair a little longer before, it takes so long for curly hair. There's a salon in  nyc (also some other cities) that specializes in curly hair, devashaun salon. Went with my sister a few years ago and had a cut using the curly hair techniques and they also spent a lot of time teaching you how to style and care for your curly hair (keeping it curly). Expensive but good for s special treat for ourselves. Curly hair girls should use a sulfate free shampoo (no suds) because sulfates dries hair out, and not wash everyday, and leave in some conditioner, and not comb or brush just finger dry. My hair is actually curlier now and the white/gray is so different but I don't want to be a slave to coloring anymore and hating the roots after just a few weeks.  It's just when people see me now they know something's up and now I'm always going to have a before and after time line in my photos as we all do",
      "MessageIndex": 21355,
      "PostDate": "28/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Nov 16, 2014 04:29PM Lisaj514 wrote: puffin, love the penny on the head. That's so funny. Soon it won't show because it will be covered up by hair! Here's a recent pic of me. (Sorry it's taking up so much space, don't know how to make it smaller). This is almost 7 months pfc but really only about 5 1/2 months of growth because I didn't start regrowth until about 5-6wks post. I've had 1 trim to the sides and back because it was getting puffy and like a ball on my head. And yes, I had curly hair before but it's tighter curls now. Also the gray is new because I colored it prior (brown), but think I'm going to keep it gray (!)😳",
      "MessageIndex": 21415,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 1, 2014 11:38AM Lisaj514 wrote: wow sunshower, I'm jealous. So fast and dark but I'm ok with what I've got coming in, at least it's something even though it's white, but then again I'm older than you and had lots of gray prior! You are so pretty, you can see your beautiful eyes, \"the windows of the soul\". Gorgeous!",
      "MessageIndex": 20546,
      "PostDate": "01/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 23, 2014 12:38PM Lisaj514 wrote: Birdlady, I dont know if you've seen my before pictures. Here's one of me at my first chemo treatment. I had soft curly hair. (It was colored btw). How you handle curly hair makes all the difference in the world. I'm hoping for curly hair again as I liked it. I am enjoying the carefree hair now that doesn't look wild on a windy day. And I'm starting to embrace the white/silver, I just want it a little longer. My family loves my hair \"short\" like this, but I say that it is not a style yet, just a bald head that is starting to grow hair lol! Look up deborahanne on this board, she has a beautiful short curly hairstyle ",
      "MessageIndex": 20666,
      "PostDate": "23/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Dec 13, 2014 07:59AM - edited Dec 13, 2014 08:07AM by Lisaj514 wow wow wow mikesgirl! You look great, so pretty and your hair length and style are amazing It will be a yr since shaving off my hair on jan 27 and almost 8 months pfc now. My first chemo infusion was jan 13 2014, wow, almost a yr! You've all seen my pictures so if I pull out my curls my hair length is about 3\". That's on top. I'm keeping it short and had my first trim at oct 1 which was 6 mo pfc and another one yesterday. Only getting the sides and back trimmed. Went without head covering by mid July 3 mo pf",
      "MessageIndex": 21552,
      "PostDate": "13/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jul 27, 2014 07:22PM Lisaj514 wrote: deb, I also loved the Abbey caps. I found these about 2 months into my treatment and would have worn them earlier. They are pretty and colors are great.  I have a long thin head so it gave me some fullness in the back also got a ruffled off-white one. I also used the you tube videos on scarf tying. I actually loved tying my scarves and got a lot of compliments on my scarves. The only thing is needing to coordinate your scarf with outfits but it actually felt good to do that as it made me feel a little stylish during this difficult time. The abbey cap I'm wearing in the picture below is actually very thin and would be great for summer. There is a small ruffle like thing in the back and the material is kind of gathered. It's not flat which is nice. And no tying. Just slip it on. Got lots of compliments on it in chemo and rad. Google abbey cap, sold by turban plus.   Btw, I now have nice white hair coming in. 14 wks PFC. I was slow and thought it would never come in. Just finished rad 7/25! Yipee!! Going without any head covering for the past 2 wks!",
      "MessageIndex": 20721,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Aug 19, 2014 09:16PM Lisaj514 wrote: birdlady, glad you're liking the curls. I have learned to accept my hair (always had curly hair) and using a good curly hair gel and just using your fingers to shape it is exactly the right thing to do. I don't have quite enough hair yet to gel and scrunch, but soon! Bow1965, I thought I'd never get hair and now I keep taking pictures and looking in the mirror to make sure I really do have hair, and it's so different in color and length. I had basically no growth for 4 weeks PFC so this is 3 months of growth. You will definitely have a cool hairstyle by christmas, probably before! Homemom, sounds like you will get fast growth as you are seeing some regrowth already. The hair comes in so fine and almost colorless (like the hair on your arms) in the beginning. Iamnancy, thanks, looks like you are a curly hair lady too. Was it always curly? But yours is dark It's still fine and thin but I'm loving having hair. I feel kind of modern and edgy (I'm thinking annie lennox) and it's great for the summer. And I love earrings and now they all show. Big earrings look really good with short hair",
      "MessageIndex": 20818,
      "PostDate": "19/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Feb 8, 2015 10:17PM Lisaj514 wrote: so how about annie lennox's hair on the grammy's! She's still got it and looks awesome with her classic annie Lennox short hair. We all know that hair style don't we? And it looks great. That's who some people said I looked like when my hair was coming in, I was flattered.",
      "MessageIndex": 21818,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 4, 2014 08:31PM Lisaj514 wrote: naiviv and jb, share pictures please! Naiviv, your hair sounds nice. I've decided to leave mine white also but it seems to be darkening up some. I'd rather it be white than salt and pepper but I keep saying at least it's hair. I hated my bald days but loving this short style. I like how you said it looks like a normal short hairstyle and not chemo hair. I like the white/platinum look like yours jb.",
      "MessageIndex": 20959,
      "PostDate": "04/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 10, 2014 08:13PM Lisaj514 wrote: ya noonrider! Lookin good. Join the gray and salt and pepper club. We're stylin'!",
      "MessageIndex": 21009,
      "PostDate": "10/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 19, 2014 06:48PM Lisaj514 wrote: wow mikesgirl, your hair looks great. You would never know that you had little hair a few months ago. It looks great on you and natural. Im a little jealous of those with dark straight hair. I'm getting compliments, but from the little old ladies at the nursing home where I worked for 2days this week. They like my gray short curly hair, oh no, I need a young gray curly style. Mom mom, I had much less hair at 8 wks PFC. Yours is coming in well even though it doesn't seem like it. It's getting darker so it's changing to more \"normal\". Maybe you should have the fine white ends trimmed especially in the back. But I know how self conscious you are, I was similar. You'll see, it'll start coming in now..I bet in a month you'll have enough to go topless. I went topless at about 3 mo and I was a slow grower, I had less than you at 8 wks. I'm 5 months Pfc now and have only trimmed it myself around my ears as well as a few long stragglers that would stick out. I was curly before but now it's even curlier. My curls started to return about 3 months post little by little. ",
      "MessageIndex": 21101,
      "PostDate": "19/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Aug 12, 2014 12:02PM Lisaj514 wrote: My lash-less, browless friends...I totally lost my brows and lashes about 4 wks PFC. It made my face look so alien like and \"blank\". They were thinning before I finished but not totally gone until after. I started wearing my glasses most of the time during chemo instead of contacts as my eyes were so dry. It kind of hid the lash less look and gave some definition to my face and eyes when I didn't have lashes or brows. Glasses are really in now so even get a fake pair in a fun style or color if you don't normally wear them. I also used liquid type eyeliner which I never used before, just pencil. I tired different types but found that Maybeline Master Precise eyeliner, which is liquid but uses a little foam like brush was easier to control and stayed on my lash-less lids and then with my glasses and drawn on brows I had some definition to my eyes and face Looking in the mirror was so hard at this stage...I so get it! But the beauty inside shines through for all women. I have never seen women look so beautiful as they do with no hair. I didn't believe it but when I look at others pictures all I see is strength, grace and beauty",
      "MessageIndex": 20795,
      "PostDate": "12/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Oct 1, 2014 07:08PM Lisaj514 wrote: this is me before. I wore it curly and I colored it. I didn't realize how gray I was until it started coming back in but my hairdresser today said that it looks more gray than it was prior. It's naturally curly  ",
      "MessageIndex": 21167,
      "PostDate": "01/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Aug 19, 2014 02:08PM Lisaj514 wrote: new hair update. 4 months PFC. And I'm liking it! and got my first compliment from a stranger. A young stylish, pretty waitress said she liked my \"haircut\"! I just said thank you, and then got tears in my eyes. And yes, I had curly hair before, so it's normal for me. Just not gray (well I colored it so maybe it was this gray before)and so short. My family says to keep it like this ",
      "MessageIndex": 20811,
      "PostDate": "19/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Aug 20, 2014 09:59PM Lisaj514 wrote: deborahanne, omg, that is going to be my hair exactly! I had curly hair before but now it's coming in mostly gray with darker on the top and back just like yours. Yes windy days and curly hair have never been friends lol! I hated windy days because my hair always looked a mess. My hair is not long enough to blow around yet so it's nice not having to worry about it or styling it. I'm kind io loving the freedom. Your hair is beautiful. Thanks for posting the update. That's definitely going to be me. The \"curly girl handbook\" is the bible for taking care of curly hair. Check it out, those of you that have or are getting curly hair.",
      "MessageIndex": 20840,
      "PostDate": "20/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Oct 15, 2014 09:47PM Lisaj514 wrote: looking great DeeC! Definitely looking like a real hairstyle now",
      "MessageIndex": 21268,
      "PostDate": "15/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Oct 16, 2014 10:17PM Lisaj514 wrote: noon, what special children and a special mom you are. You said you have all special needs children, I'm overcome with emotion of your compassion. I am an OT and the gifts that's these children bring to your life must be amazing as well as challenging. What an amazing, patient, compassionate person you are. I would love to meet you. Oh, and your hair is coming in great. All your hair \"stuff\" seems to be working, congratulations.",
      "MessageIndex": 21274,
      "PostDate": "16/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 4, 2014 10:22PM Lisaj514 wrote: naiviv, I love it! And I also have a darker strip down the center of my head. Initially I called it my racing stripe. Mine is curly and getting longer than my avatar but cropped and close to my head. Can't make it stick up. Just curls in little curlicues! Noonrider, the first compliment I got about my post chemo hair was 2 weeks ago. I told this story I think. This pretty waitress said she loved my haircut! I said thank you then when she left I got teary because she complimented me on my hair when I felt it was still so obvious chemo hair but she didn't know. My husband was so confused, I said they were happy tears. I looked normal I guess!! It felt soooo good. Now I'm so aware of women's hair (almost obsessed, looking at color and all short \"styles\") and will make sure I compliment women on their short hair because maybe that's just what they need, maybe it's chemo hair!",
      "MessageIndex": 20965,
      "PostDate": "04/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 9, 2014 10:33PM Lisaj514 wrote: JB is back!!! Been missing your humor! LOL! You siad you got a haircut...lets see I also used to look carefully at my head multiple times a day looking for those fuzzies. THey started around 4-5 wks for me. I remember looking with a mirror at the sides and the back hoping for something. I really thought id never have hair again especially when others were taking about the hair regrowth and showing pictures. But now im doing that and all you girls that just finished will soon too! You really will but you wont really believe it until it happens. I was the same way. Im loving it now, I still get at thrill when i actually wash my hair, not just my head, and think how good it feels to feel hair there. (I get thrilled easily I guess!)",
      "MessageIndex": 21004,
      "PostDate": "09/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 11, 2014 10:20PM Lisaj514 wrote: ya noonrider! Maybe curls! Mikesgirl, amazing color, I don't see any gray hair. My eyebrows have gotten thinner past few weeks and some eyelashes shedding. I think it's the normal growth cycle though. Cool day here in CNY and my head was cool even with the hair. Realized that my hair is still thin although the curls are good at masking the thinness. ",
      "MessageIndex": 21020,
      "PostDate": "11/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 23, 2014 08:29PM Lisaj514 wrote: anyone try smartbrow from derm store. The ad keeps showing up on my FB page and im almost thinking of ordering. I have brows now but they are very sparse. Any thoughts? Or is it just good advertising",
      "MessageIndex": 21122,
      "PostDate": "23/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 15, 2015 11:04AM Lisaj514 wrote: 14 months PFC and I love when I need a haircut! Every 5-6 wks now as im keeping it short...and gray! A big difference than pre BC but that's ok. Liking this new look so for those of you coming in gray, it's not that bad. Learn to use styling tools lol. I never did before and just always left it curly but now it looks better styled straighter in front. For those if you with new curls the trick is lots of conditioner a good curly hair gel and let it dry naturally if you want a curly look, dont touch it, don't comb or brush it or it will get frizzy. Also use products, conditioner and gel for curly hair. Mine are soft curls when I don't use a curling iron. mine came in white gray that looks cool most of the time. I was so hair obsessed and my hair took 6-7 wks to start really growing and then it was so slow so patience is needed. Here's before bc, then today right from hair dresser with it straighter and then curly, air dry fingering it only   You all look beautiful, short hair, long hair, \"wigged\" hair, brown,gray,curly, straight hair and also bald bold and beautiful! It's so great when it starts coming in and the wig or scarves or hats can come off. Short hair looks awesome. It shows whatever great features you have eyes, smile, skin, cheekbones even cute ears and you can show off great earrings now! Be strong, be confident!",
      "MessageIndex": 22352,
      "PostDate": "15/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Oct 24, 2014 04:04PM Lisaj514 wrote: nycg, yes! I lost my eyelashes and brows officially 4 wks pfc. I drew on brows, wore eyeliner and also wore my glasses instead of contacts to protect my eyes. My glasses kind of hid the lack of eyelashes and gave some definition to my \"blank\" face. I kept saying at this stage that I looked like an alien. Joan lunden recently spoke on today show and said she felt like someone erased her face when she lost eyebrows and lashes, yes, definitely! Keep trying with the eyebrow pencil or brush. When mine started coming in but we're thin and light I went to sephora and a girl there tried some products on me and that helped. I got an Anastasia product, a brow \"pomade\". It's great and lasts all day and won't come off if you rub your eyes. Mine officially all fell out about 4-5 wks pfc and about 2-3 wks after stated to come I  again. Many have had good luck with latisse but I have light blue eyes and my dermatologist said that it could turn light eyes dark. It's a difficult stage, you are done with chemo but look worse due to still no hair and then the brows and lashes pull a disappearing act. Hang in there. You've been through the hardest part on your body. Now it's the appearance that needs to catch up",
      "MessageIndex": 21320,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Dec 29, 2014 04:09PM Lisaj514 wrote: welcome to the hair thread Chrissy and being able to post pics is fun. Well this is curly girls, but yea, I had curly hair before but maybe not this curly and being short it curls more. This is 8 months pfc and I was a very slow grower. Didn't start getting any hair until 6-7 wks. Here's today. Colored it brown prior but I found out what was underneath when it started growing in. Was much whiter early on. Getting darker but I'm keeping it gray and short. Had 2 trims to the sides and none to the top. See how long when I pull it out lol! Mommom, put some gel in it and let air dry and see what happens. Also condition the heck out of it and leave some in, gently towel dry (don't rub harshly) put in sulfate free gel (non drying and good for curly hair) gently finger into some kind of shape. Or just tons of gel and spike it up girl! You'll never have this chance to experiment like this with a totally new loo ",
      "MessageIndex": 21616,
      "PostDate": "29/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Dec 31, 2014 04:44PM Lisaj514 wrote: mommom, you look gorgeous. Really see your beautiful features with your short hair. And hair is looking better! Keep working the conditioner and gel. You look like a spunky trendy lady! Happy new year all",
      "MessageIndex": 21629,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Nov 18, 2014 09:23PM Lisaj514 wrote: Lorbgoo, also have a little over 2\" and it's curly as you see, so looks even shorter, same as you bosumblues. I like my curls as it makes me look younger I think, hard with all this gray but if I blow dry it it gets just puffy and looks like a little ol lady's hair that has been set in curlers. It's an ever evolving process. I've gone topless (mostly wore scarves and caps and my wigs only occasionally) since July, 3 mo pfc. I was a slow grower...thought I'd never have hair...but it really does grow. The top is actually thicker than the sides which is unusual for most. I'm getting used to it and liking it on most days.It's starting to \"grow\" on me...lol",
      "MessageIndex": 21422,
      "PostDate": "18/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jan 13, 2015 10:39PM Lisaj514 wrote: ok girls, question (hope not tmi). The hair on my head is fine, almost 9 mo pic, but what's this with loosing pubic hair, leg hair and under arm hair? both underarms so not just from rads to the L. And also extra facial hair. At dx I was 10 mo since last my period so was in early menopause but my leg hair and pubic hair came back as before after chemo but now pretty much gone. I'm 54 so expected to be in menopause so assuming that's it with the hormone changes and the body hair loss and facial hair gain but hair on my head seems ok now. Also know stress, adrenal fatigue, low cortisol levels can also lead to hair loss. Just wondering if any of you have similar se. Also taking metformin, not for DM but for TNBC will have ro check SE of that but don't think that's it. It's a minor symptom but still wonder why.",
      "MessageIndex": 21722,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jan 14, 2015 07:05PM Lisaj514 wrote: Almost 9 months pfc-had my hair cut short today on the sides and back as was looking very poodle like with my gray curls . Well, told him to cut it short and he did, lol. Curls still there on top but sides and back are straight. Wearing a thin hat inside my house as my head feels cold and my house is working hard to stay warm inside on frigid day. Wow reminding me of last winter and that's weird but this time it was MY choice and it will grow as we all now realize. It's been bitter cold here in upstate ny, high of 8 degrees yesterday. Maybe I should have waited a few weeks to get a cut. But still just so thrilled to be able to get a haircut, and to have enough to cut. Short hair really shows facial features I think like pretty eyes, nice smile, cute ears (lol), and seems to enhance cheekbones. I've used retin A for a few years, also started using the clarsonic Mia2 battery operated facial cleanser. Got it for free after look good feel better class and filling out a questionnaire after finishing, it was sent to me. Maybe it's helping get rid of dry flaky skin. Greta, bosumblues, maybe go for a facial to get rid of all the dead skin left behind from chemo and learn how to care for this skin. Treat yourself. Then ask what moisturizer you should use. I use Olay and also Clinique dramatically different moisturizing lotion You girls just starting treatment, look for a LGFB class from ACS. lots of great free stuff and feels good to pamper yourself and try makeup techniques for this challenging time. During treatment my skin was so dry, like the Sahara desert, no moisture, anywhere, even eye dryness, mouth dryness. I think everyone looks amazing because we are all just amazing women who have powered through a lot and the beauty and strength shines through",
      "MessageIndex": 21728,
      "PostDate": "14/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jan 29, 2015 10:01PM Lisaj514 wrote: lorbgoo, almost the same...so let's see what your style is now. Ok everyone, show and tell your style and how long so the new girls can see all stages and have some hope",
      "MessageIndex": 21797,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Feb 9, 2015 11:55AM Lisaj514 wrote: Re: annie Lennox, lol, I know! The voice, style and that look, amazing! Mommom, you also have her look with your fair skin and clear blue eyes. Wishing everyone fast regrowth and a rockin' pixie hairstyle",
      "MessageIndex": 21821,
      "PostDate": "09/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Feb 23, 2015 09:59PM Lisaj514 wrote: yes yes, Mia farrow! I had a dark streak down the middle when it first started coming in. Called it my racing stripe. Here's then, july- 3 mo pfc and dec 2014(7 1/2 pfc).Came in straight then went curly but I always had curly hair so that's my natural hair. Now gray, colored it before. Kind of messy in second pic but love my curls and color most times.  ",
      "MessageIndex": 21874,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "May 8, 2015 03:15PM Lisaj514 wrote: Why do pictures always seem to come out good in the car for me?. The lighting is right I guess and the light through the sunroof makes my hair look nice and shiny. 1 yr PFC btw. A few haircuts already and a trim today. Naturally curly (this is pulled out by hairdresser with curling iron)and yes once it came in I decided to stop coloring it and this is what I have! And I keeping it gray/white",
      "MessageIndex": 22173,
      "PostDate": "08/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jun 6, 2015 09:18AM Lisaj514 wrote: thanks, thanks, thanks, love coming on here as you girls make me feel GOOD! Even though we've never met we support each other as BFFs! Social media can be great! Have a good weekend",
      "MessageIndex": 22311,
      "PostDate": "06/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 2, 2015 10:14PM Lisaj514 wrote: Hi mommom, yes I still keep track of the us hair obsessed gals! But haven't posted in a while but now time to give encouragement.this is 8 wks pfc(I was a slow grower! Took forever!) Then this about 4mo pfc rthen this at about 8mo pfc and after a haircut . and nowmessy hair day! I don't care! I am 1yr 4 mo pfc. Have had many haircuts to keep it short. I colored it before, now keeping it gray as there is just too much gray to color and I like the white gray...most days. It came it grayer I think. I am 55yo. Sorry to take up so much space but I don't know how to put the pics together in a line although I've figured out how to make them smaller) Happy hair growing girls. It will happen, I was one of those that was so slow I thought it'd never come back but it does even if different. Love the new you. When else can you try out a short hairstyle and it looks fabulous on all of us",
      "MessageIndex": 22531,
      "PostDate": "02/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Sep 5, 2015 08:01PM - edited Sep 5, 2015 08:02PM by Lisaj514 ally, so cute! And mommom, forgot to say...you look stunning!",
      "MessageIndex": 22550,
      "PostDate": "05/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Oct 10, 2015 07:09PM - edited Oct 10, 2015 07:14PM by Lisaj514 Leigh, yes,yes,yes, that's the eyebrows coming back. Won't be long now and you'll see their realreturn! Cholesmom, we are hair twins! Mine was just like yours, see? I'll be 1 1/2 yrs PFC and 2 yrs since dx on October 18! I'm keeping the gray color and short style. Still get compliments... i Top 2 pictures are about 6 or 7 mo PFC (I think...how could I forget! I was sooo hair obsessed!) The bottom picture is with it straightened with a curling iron and how it looks now although I usually wear it curly as I'm still not so good with a curling iron. Bottom pic is how it look after the hairdresser trimmed and styled it. I like it!",
      "MessageIndex": 22598,
      "PostDate": "10/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Oct 11, 2015 09:28AM Lisaj514 wrote: Thinkpos-My hairdresser taught me with a curling iron. I watched carefully while he was doing it. Use lots of conditioner on it and put a dab in at the end and leave it in. I use products made for curly hair, no sulfates, doesn't dry it out. Handle hair gently, don't brush, just finger it. And have your hairdresser teach and show you. I don't use a flat iron, just a 1\" curling iron but I'm not really good at it. My pictures are all after my hairdresser has cut and styled it.... It's hair though, better than when there was none",
      "MessageIndex": 22606,
      "PostDate": "11/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Dec 22, 2015 09:52PM Lisaj514 wrote: haven't posted for a while. I was so hair obsessed for a long time, I took so many pictures. Here's my before, growing stage and now. So different but keeping the gray. Before hair was colored and highlighted but gray underneath I found out once started to grow.curly before...curly now but actually less so. Second pic is 10 wks, then 4 mo and last pic is 1year and 4 mo pfc and multiple haircuts. Still changing and straighter than before chemo! Go figure ",
      "MessageIndex": 22873,
      "PostDate": "22/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Feb 17, 2014 08:52PM Lisaj514 wrote: Been lurking but haven't posted in forever and I'm still a newbie here. It's time for me to share again. I also have (had) curly hair. I just got a curly hair wig from vivica fox wigs. I am not African American but these curly hair wigs are more like my hair and they are not tight curls but soft. I got the oprah 2! take a look for those who are stressing over curly hair issues. i know i was. It was also \"poofy\" but you can have the wig trimmed or thinned and that helped. I've been 3 weeks hairless and a hairdresser that teaches the LGFB classes shaved my head (2weeks after first AC) and also just fixed my wig today. I have been wearing scarves prior and doing a great job fixing them and everyone says I look \"beautiful\" but I still feel like a cancer pt. No one said i looked beautiful before. doesn't  that bother some of you?  I'm going to try wearing my wig more now and see how I feel. I also look at people's heads, and boobs! There's a girl that I know that had a breast enhancement purely for cosmetic reasons, she's in my yoga class and seems to flaunt it. It makes me so mad, right? Some of us need it for real reasons like cancer! Went to LGFB class today and lots of great free makeup and stuff.  Also I have been going to yoga class 1xwk and its been great. The mindfulness, meditation and mind body connection, slow stretching and \"strength\" poses feel so good. Makes me feel in control of something. I have a yoga DVD but the guidance of an instructor is better. I have also ordered dr Weil cd sound mind, sound body, music for healing. Will see if its good. Also warrior ladies who are in to meditation and yoga, try web site www.doyogawithme.com and look at the meditations. There is a 15 min meditation for breastcancer  I'm heading for my 4th and last ac on 2/24, then taxol. First week after ac is crappy but second week is better. Also look at \"warriors in pink\" web site. Some great stories Ok lots to say but felt good to share",
      "MessageIndex": 637,
      "PostDate": "17/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Mar 17, 2014 09:41PM Lisaj514 wrote: my taste buds came back almost normal on Saturday 3/15, 5 days after taxol. Woohoo! I noticed when I had an everything bagel with cream cheese and lox and it tasted soooo good. Appreciating the little things! Liquids are still weird especially water but I'm so grateful for the food tastes. Hate to think about loosing it again and back to \"eating pennies\"! Walked about 1.5  miles today but now my feet are hurting me. The bottoms are sensitive. And noticing my fingertips feel funny. I didn't think I had neuropathy but maybe. My doc only said to take the L-glutamine the day before, day of and day after taxol (3x/day). But I just started taking it 1x/day even now. How often do others take it? Also will start vit b6.  Traveling to Indianapolis tomorrow to watch my daughter in ncaa swim meet! She's a senior in colege and made it to the nationals! Her first time (and last chance). Good it's on my off week. I should be feeling good. But will have to get my afternoon nap in. Traveling by plane. Have my arm sleeve and gauntlet as preventative. Will wear for first time tomorrow during the flight",
      "MessageIndex": 742,
      "PostDate": "17/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Apr 9, 2014 11:19AM Lisaj514 wrote:  I followed mikesgirl for icing technique and have had minimal nerve problems. The staff did not know anyone that iced during taxol but certainly didn't discourage it and were interested in the rationale. My MO didnt siggest it but was fine with me doing it. It constricts the blood vessels in fingers and toes and prevents the chemo drug from I filtrating those areas is what I read. Similar to cold caps to prevent hair loss I think. Here's what I did following mikesgirl advice and reading info on Internet. Use freezer zip lock bags. Use2 bags for each pack. I made 6 packs so I could switch some out if they did not stay cold. I brought them in a small igloo cooler. Mix 1 cup alcohol and 2 cups water. Double bag, squeeze out as much air asyou can. Freeze overnight. It will be like slush. I used an old fleece blanket, cut it up and make little pillow cases for them. Barefoot or with thin socks, I sandwiched my feet between 2 ice packs. For my hands I would grip a pack, or sandwich my hands between 2 packs also or just lay my hands and feet on the ice. Make sure you get all fingers cold. I just iced my fingers (not palms) and toes and ball of foot (not arch or heel). did some of you do whole hand and foot? If you are sitting in a chair with hands in lap make sure you have a blanket in your lap so your legs dont freeze! Here are pictures: ",
      "MessageIndex": 860,
      "PostDate": "09/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Apr 30, 2014 09:37PM Lisaj514 wrote: Stephanie and birdlover-I also just started seeing the fuzzies too...if I look reeeeal close. But they are all white. I'm so impatient now that I'm done with chemo...but only 10 days PFC (dd a/c and dd taxol). This whole this has been a test of my patience! Ugh. I'm am feeling good, now just want to look like my old self. Actually miss my curly hair on windy days! ",
      "MessageIndex": 936,
      "PostDate": "30/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Mar 10, 2014 07:11PM Lisaj514 wrote: had first taxol today. They infused it really slowly- about 3.5 hrs and with the pre meds, blood work and waiting for results and doctor visit prior to starting the infusion (and of course some waiting in between things, I was there about 6 hrs. That's ok, I'm getting good at sitting and waiting. So far so good. I did ice my hands and feet and my feet feel fine so far but my hands feel a little \"prickly\" but I have some carpal tunnel and cubital anyway so it may be this. It was hard to keep my hands cold the whole time between getting something to eat, checking my phone, going to the bathroom etc. I used homemade ice packs in gallon ziplock bags with with a fleece cover. They actually stayed cold the whole time. I made 5 of them and put one under my feet or sandwiched in between 2 and grasped one in my hands and kept moving it around between palm and back of hands and grabbing. They gave me aloxi, emmend, decadron, benedryl and pepsid through iv. Also 2 Tylenol before the taxol. I feel kind of foggy and buzzed now but much better than I felt after the AC. I'm getting neulasta tomorrow. The claritin D has helped.  Lets see what he next few days bring. I was so nervous going in. Wishing everyone a good week!",
      "MessageIndex": 725,
      "PostDate": "10/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "May 1, 2014 02:22PM Lisaj514 wrote: congrats again Barbara, ok so now I see what the flower and streamers were in your other picture, May Day maypole! Nice. And no bell at my facility but thinking of getting one and donating so others have something \"noisy\" to mark the milestone. Welcome to the PFC club. Now onto rads and discussing hair regrowth. This will be soooo much better than discussing SE's from chemo.  Hoping everyone else good days with manageable SE's. ",
      "MessageIndex": 939,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "May 8, 2014 09:18PM Lisaj514 wrote: chipmunk, my taste is mostly back, 2 1/2 weeks pfc. I finished on 4/21. It was terrible on taxol for about 1 week after treatment (I had DD taxol). I hated that as well, but I hate my bald head more lol!",
      "MessageIndex": 974,
      "PostDate": "08/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Feb 23, 2014 08:40PM Lisaj514 wrote: Katiegrey, I have my last AC tomorrow 2/24  and also sch for taxol dose dense, 4 cycles to start next treatment day in 3/10. Also concerned about the neuropathy on taxol and heard that week,y sessions of lower dose were better for this but that extends treatment by 4 weeks. Also want toget it over with sooner.  Does any one know if you can switch to weekly taxol after starting dose dense, I assume you can if SE are bad. Suggestions on managing SE on taxol. Glutamine I heard helps and I ordered some online How long for normal taste buds to return? EVERYTHING tastes weird. ",
      "MessageIndex": 684,
      "PostDate": "23/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Mar 3, 2014 01:57PM Lisaj514 wrote: belleb and megomendy, similar stats also. Also wondering about recurrence rate not just survival rate with lumpectomy and triple neg. Now that I'm half way through chemo I realize I DO NOT WANT TO DO THIS AGAIN... EVER IF POSSIBLE! I did dose dense ac and will do dose dense taxol (every 2weeks, same sch as the ac) including neulasta. That is different from both if you.  Anyone want to share experiences with dd taxol? Ill look on the nov and dec 2013 forums also. Anyone also continuing with neulasta with taxol? My WBC have been great with the neulasta so I'm glad about that so I shouldn't worry about continuing it while on tacol. Right? I was also told that lumpectomy with chemo and rads have same survival rate as mastectomy with chemo (and no rads). But which is the worse of the 2 evils, mast or rads. I'm concerned if I do the rads as planned and there is recurrence, and then have to have mastectomy, then reconstruction after rads is very difficult with poor results.  This is my mind right now, questioning, scared, hating this whole thing. 2more months seems like forever although I know many women do even more and I'm scared about the dd taxol although my mo said I should do fine. This whole experience has not been fine! ",
      "MessageIndex": 718,
      "PostDate": "03/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Mar 12, 2014 10:51AM Lisaj514 wrote: Myra, I'm on dose dense taxol, every 2weeks. I don't mind the neulasta if it keeps my white blood cell count up, which it is. But my rbc count is dropping, a little each time. Now s at 10.2 which is mildly anemic. They say this is normal and nothing I can do about it. Feeling the fatigue.  Once it gets to 8.0 or below they would do a blood transfusion. Anyone actually need a bold transfusion?",
      "MessageIndex": 732,
      "PostDate": "12/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Mar 12, 2014 11:45AM Lisaj514 wrote: and everything tastes terrible, like metal. Im 2 days past first taxol. Worse than when on AC. How long does this last? I know there's trouble when my usual favorite pasta or chocolate brownie doesn't taste good. . And lemonade is the only drink that tastes normal but I still have this constant metal taste in my mouth. I've tried mints and citrus candies and its still there. Ugh",
      "MessageIndex": 733,
      "PostDate": "12/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Mar 27, 2014 02:43PM Lisaj514 wrote: Desimone- you don't have to be positive all the time. You have so much going on right now that's its overwhelming to say the least. Down days and weeks are normal, realize that. Write down your thoughts here, or in a journal, talk to someone, go,outside and take a deep breath of fresh air, scream, cry. I sometimes hate when people tell me to be positive or when I tell myself to be positive because it sounds so cliché. This is the up hardest thing most of us have ever gone through and you have so much else too. Just be in the moment of how you feel now and accept it. Then move on when you are ready.",
      "MessageIndex": 801,
      "PostDate": "27/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Apr 20, 2014 10:39PM Lisaj514 wrote: ok so tomorrow us my last \"effin\" chemo! Trying to keep busy tonight with baking oatmeal cookies to bring to share with staff and patients. Got my kicking cancer's ass tshirt ready. I think I'm going to cry though. Mixed crazy emotions. What's going on? Can't wait but also the usual pre chemo dread. Help me out here girls! Changed my avatar to the way I used to look. So ready for the \"old\" me.   horray! Feel like I've conquered the world! Nothing can get me now! I can do this! As you can see I'm all over the place emotionally",
      "MessageIndex": 912,
      "PostDate": "20/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Mar 31, 2014 01:15PM Lisaj514 wrote: good luck Desimone. {{{hugs}}}. Let us know how it goes.",
      "MessageIndex": 817,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Apr 8, 2014 09:46PM Lisaj514 wrote: to those having taxol, I also am on taxol DD. had my third one this Monday. For neuropathy Docs recommended L glutamine which is a supplement powder that you mix with a liquid and is supposed to help prevent neuropathy. I also have been icing my hands and feet during treatment. Search this on the discussion boards or online for information. i made my own ice packs with fleece covers and bring them to treatment. This is supposed to help prevent as well. I have had minimal problems with neuropathy, of course not sure if it is from doing these things but it can't hurt. There is one facility that one of the ladies said started to supply ice mitts and booties for patients during taxol. My MO said if I started getting neuropathy she would give me meds like neurontin., but who wants more meds when we already take so many, so the icing is worth a try. I get muscle pain after taxol. After the steroids wear off, which is tonight the aching starts. Arms, shoulders, hips, neck, chest. If I press on my muscles it feels like a bad bruise or an overworked muscle from lifting weights. I get neulasta also so that contributes to the joint pain also. My muscle pain lasts for 3-4 days then gradually gets better then my muscles in my legs just feel sort of wobbly. But you're right, walking is good and feels better if you can just get yourself out there, and of course where I live as long as its not snowing lol! Good luck to all of you",
      "MessageIndex": 854,
      "PostDate": "08/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Apr 29, 2014 09:16AM Lisaj514 wrote: any one having trouble with chemo induced neuropathy read this article. Good suggestions or things to bring up and discuss with your doc. I had minimal problems during taxol. I used icing, l glutamine and relaxation/meditation techniques. http://www.integrativeoncology-essentials.com/2013/06/complementary-therapies-for-chemo-neuropathy/",
      "MessageIndex": 924,
      "PostDate": "29/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "May 2, 2014 08:10AM Lisaj514 wrote: congrats carol sue! Happy dance! You look great with short hair",
      "MessageIndex": 944,
      "PostDate": "02/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Jan 13, 2014 09:11AM Lisaj514 wrote: hi, starting A/C 4 cycles today! Nervous but ready to get this started so that its closer to being done. Port was placed on Friday 1/10 so it's still sore but the doc said no problem accessing it today. They said they use lidocaine spray to numb it but may ask for a prescription for the cream to use as well. The port site is very sensitive to touch even lightly over the skin.yukk! They say it will get better and I'm trusting it will. We can do this, we are strong! Lets triumph ladies! My quotes to get me through this day: \"Promise me you'll always remember: you're braver than you believe, stronger than you seem and smarter than you think\" Christopher Robin \"Courage is not the absence of fear but instead the triumph over it\" Nelson Mandela",
      "MessageIndex": 167,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Mar 31, 2014 01:26PM Lisaj514 wrote: worked on this today. Figured I'd share. First pic is before BC, second is one of my scarf looks (I rock the scarf tying but i get tired of the look after a while), third is my curly wig and of course the last is bald me. My head is long and narrow so bald looks funny on me I think.  I love the women with the round heads, they look awesome bald! I have naturally curly hair so it was hard to find a curly wig that didn't look like an old lady hairstyle. This is a vivica fox wig called the \"oprah2\", lol. Had to tame it down and thin it because it was kind of big when i first got it. Don't wear it a lot cause it gets annoying after awhile but the curls are perfect, which mine never were, and everyday it looks the same, which mine never did lol!. I miss my natural, messy curls. Someday  ",
      "MessageIndex": 818,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Apr 9, 2014 03:17PM Lisaj514 wrote: today was my hibernation day. I had taxol on Monday and felt great yesterday (thanks steroids) but today achy with no energy. Feel so much better when I get out also. Will do tomorrow. Supposed to be in the 60s here tomorrow which will be like a heat wave. Signs of real spring evident!",
      "MessageIndex": 864,
      "PostDate": "09/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "May 14, 2014 10:40AM Lisaj514 wrote: sam2u, ask about respiratory gating or deep breath holding technique for protecting the heart during rads. Not done at all places. It's a newer tech to decrease the chance (which is very small) of long term damage, stenosis to the heart with rad to the L side. Mine is L sided and the local oncology center (5 miles away) does not do it but the university hospital 1 hr away does. I will be having a 4d ct scan at univ  hosp thurs and they can see if the heart would come in the line of the rad beam (even if just a little bit)and if the respiratory techniques would be of benefit. If it would be I'm doing it there if not will stay local. ",
      "MessageIndex": 985,
      "PostDate": "14/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Dec 5, 2014 08:32PM Lisaj514 wrote: yes, good point gramma and jb. Write things down, everything when going through treatment. Feelings, dates of tests, treatments, results, people's names (of course doctors but also assistants, nurses). You think you will never forget things but with the chemo brain and just it all being an out of body experience it is all hard to remember. Ask for all test results and office notes. I now have a big binder. I do wish I had written more of my feelings. Thanks for reminding us to be gratful, even with thanksgiving just recently behind us I needed the reminder. I will Enjoy the cold fresh air, the snow, the icicles, the Hanukkah and Christmas lights, the smell of pine, the smell of latkes, the smell of christmas cookies, the feel of a snow ball in my hands, the feel of a warm fire, cozy socks.....",
      "MessageIndex": 29,
      "PostDate": "05/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826508",
      "Title": "A year after the diagnosis....Letter of Advice to Myself jbokland Carol99"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Nov 24, 2014 08:51PM Lisaj514 wrote: jb, beautiful and thoughtful topic. It makes me think. Oh how I so wish we could all get together and talk about this in real time. I have to think... My memory is also getting fuzzy 1 yr after surgery (tomorrow is my year since first lx surgery), 7 months pfc and 4 months pfr...and that is a good thing. Nice to \"meet \" some new sister",
      "MessageIndex": 8,
      "PostDate": "24/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826508",
      "Title": "A year after the diagnosis....Letter of Advice to Myself jbokland Carol99"
    },
    {
      "AuthorID": "Lisaj514",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192831/profile",
      "Content": "Nov 25, 2014 08:36PM Lisaj514 wrote: wow! that was a beautiful article Ruth, thank you. How some people can put thoughts into such beautiful and poignant words is amazing",
      "MessageIndex": 12,
      "PostDate": "25/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826508",
      "Title": "A year after the diagnosis....Letter of Advice to Myself jbokland Carol99"
    }
  ]
}