{
  "AuthorID": "LisaMarie67…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203076/profile",
  "Posts": [
    {
      "AuthorID": "LisaMarie67…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203076/profile",
      "Content": "Oct 5, 2017 09:06AM LisaMarie67 wrote: Thank you hartrish. My onc said he wasn't sure which chemo he was going to use. That is one reason he is sending me to Duke for a second opinion.",
      "MessageIndex": 2222,
      "PostDate": "05/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "LisaMarie67…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203076/profile",
      "Content": "Oct 11, 2017 02:07PM LisaMarie67 wrote: I met with Kimberley Blackwell at Duke University on Monday. She is testing me for gene mutations, scheduling me for another PET and Bone scan, and having all of my prior pathology testing reviewed by the staff at Duke. I have to make a 5 hour drive to see her, but I feel like I am in good hands. She says my cancer doesn't \"act\" right, that triple negative doesn't usually resurface 4 years out, and since my pathology reports and tests have always been inconclusive about whether or not is it indeed breast cancer, she is turning every stone to get a clear answer.",
      "MessageIndex": 2239,
      "PostDate": "11/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "LisaMarie67…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203076/profile",
      "Content": "Oct 4, 2017 10:28AM LisaMarie67 wrote: Hi ladies. The last time I posted, I was still stage I, but now I am joining your exclusive club. I am happy to meet you, and hope to positively contribute to this small TNBC world we are in. I am now stage 4 with mets to spine and lung. I had radiosurgery on both lesions and hopefully they are both gone. I will be having a scan in a couple of weeks to see if the radiosurgery worked. My oncologist is recommending lifetime low dose chemo, but is also sending me to Duke for a second opinion. I am scared, but positive. Any and all advice about treatments, etc are welcome.",
      "MessageIndex": 2219,
      "PostDate": "04/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    }
  ]
}