{
  "AuthorID": "LisaNJ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103740/profile",
  "Posts": [
    {
      "AuthorID": "LisaNJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103740/profile",
      "Content": "Jun 16, 2010 06:42PM - edited Jun 16, 2010 06:43PM by LisaNJ Hi Everyone I'm new to this board a friend of mine sister told me about this site.  I just finished my third chemo treatment.  I have one more to do with these two meds then 4 more to go with just one med then radiation.  So I'm going to be in treatment all summer.  It hasn't been easy.  I do not take the Zofran because it seemed to make me sicker.  So I just take my emmed as required.  I do get sick that fisrt night then nausiated the next day.  I get the thrush like coating on my tongue about four days after as well.  I do suck on icecubes for the first few days after treatment. Well, as much as i can stand.  I couldn't stand my hair when it started to fall out so i buzzed it off.  I still have some fuzz but bald spots as well,  My husband is going to buzz it all off tonight. I'm having an ok day today.  When I get this horrible taste in my mouth I get gaggy.  Well at least I get 7 days before I start this all over again.   God Bless  ",
      "MessageIndex": 725,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "LisaNJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103740/profile",
      "Content": "Jun 16, 2010 06:55PM LisaNJ wrote: HI Everyone, I am new to this site. I was told by a friend of mines sister to check this site out.  I just finsihed my third chemo treatment.  I have one more to go with the 2 meds then 4 more to go with just the one med.  Ill be in treatment all summer then radiation.    I am currently suffering with what i would call thrush.  Ugh! it usually comes like 4 days after chemo.  I do try to suck on icepops for hte first few days after chemo but this still happens.  I hate this.  It makes me have a gaggy feeling as well when I swallow.  The doc did giveme stuff to gargle then swallow but honestly, I never swallow it its just too discusting.  I just brush my tongue until its all off which means my tongue ends up a bit sore.  Well at least i have 7more days until my next treatment.  Oh and  I haven't gotten my period either.  I'm 43 years old and the Doc said I may never get it again. I thought great hot flashes on top of chemo side affects.  but I do notice that I get really bloated for about 2 days, then it seems to level out.  I'm guessing its around the time when I would of gotten it.  IDK?  well thanks for letting me rant. God BLess you all",
      "MessageIndex": 726,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    }
  ]
}