{
  "AuthorID": "Lisa614",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
  "Posts": [
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jun 23, 2012 04:10PM Lisa614 wrote: Hi.  I'm starting July 5th.  4 cycles every 3 weeks of Cytoxan and Taxotere.   I will need to go to my chemo class next week. I was wondering if anyone has tried the shampoos out there to prevent hair loss.   Was just reading about one called, ThymuSkin.  Very expensive but if it prevents hair loss (studies show 88% prevention), it might be worth it.    Good luck to all...let's keep in touch over the next few months? :O)   Lisa ",
      "MessageIndex": 18,
      "PostDate": "23/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jun 24, 2012 02:56AM Lisa614 wrote: teeballmom:  Sounds like something I would notice too...not the beautiful sun set, but rather the dirty windows.  LOL.  that's funny. And I think you definitely should let your kids paint your head!   melrose:  I will be taking the Neulasta on the day after treatment and I already take Clariten daily for allergies.  So, I will let you know if I do get any bone pain.    Thanks for the tip about checking the previous months boards for those already underway.     ",
      "MessageIndex": 24,
      "PostDate": "24/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jul 7, 2012 01:15AM Lisa614 wrote: Well girls, had 1st chemo yesterday and I have to say, so far so good.   I am being vigilant about taking my anti-nausea meds and I have not been sick or very nauseous at all.   Woke up at 4am with a little queasiness but i just ate a few crackers and then fell back asleep.   Went back today for my Neulasta shot.  Not sure when any of those side effects will kick in.  I think nurse said 2-3 days.  But I was told Clariten helps and I've been on that for allergies. I think the thing that is bothering me most right now is the darn steroid medicine.  I was given IV Dexamethasome prior to the chemo infusion.  And around 2 pm today, my face got all flushed, my legs started feeling like that restless leg syndrome feeling, and I just feel an overall uneasy, nervous energy.  I don't like it.  It's like being on speed but not having the energy to do anything with it. I've been good about hydrating for the last 3 days and today.  Hopefully that helps as all of the suggestions on here have been so helpful.",
      "MessageIndex": 135,
      "PostDate": "07/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jul 9, 2012 04:21AM Lisa614 wrote: Teeballmom:  If anything good has come of this, it's to know that my experience has helped someone else in any way possible.  You CAN do it....Just stay in the moment, don't think too far ahead.  Just think about today.    Being prepared with all the meds and various remedies helped me feel in control.  Start hydrating today....drink till your pee is clear.     My doc also put me on Ranitidine 150mg.  (OTC Zantac) for heartburn and acid reflux.   I started that about a week before.   I did have a rather rough day yesterday with body pain, joint pain, and fatigue.  Slept on/off on couch most of the day.  Basically feels like the achy flu without the fever.  Took 3 Advil which did nothing so I had to take one of my Hydrocodone pills.   Felt much better and was able to sleep through the night.   Woke up this morning and still feeling very weak with little appetite.  Am trying to eat some oatmeal so I can take another pill.  Needless to say, i am not going to work today.  I just wish I knew if it's going to get worse as the week goes on.   Don't have the metallic taste in mouth that people talk of. Everyone...hang in there...we will get through this! ",
      "MessageIndex": 159,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jul 1, 2012 05:25AM Lisa614 wrote: Thanks for sharing Fredig2.   So helpful to know what's ahead.  I start TC x 4 on Thursday.   Here's to continued good feelings and manageable SE's!! ",
      "MessageIndex": 88,
      "PostDate": "01/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jul 11, 2012 03:48AM Lisa614 wrote: Hi all, just checking in. Sorry to report that my days 4 and 5 were rough (mon and tues). Just like everyone said, feels like the worst body achy flu ever. Called doc yestereday because i was having very severe sharo pain in lower abdomen (everywhere else too). She said to just continue taking pain meds. All I've done for the last 2 days is sleep. I think i made a big mistake by taking the Lortab (hydrocodone and acetaminaphen) for the pain. It took the pain away but also made me a zombie...sleeping, no appetitie, etc. A friend who is a nurse told me to switch to Tylenol and Alleve. One Alleve every 12 hrs and tylenol for breakthrough pain. I must say i feel so much better this morning. They are controlling the body aches and i feel more human again. Also, this is day 6 so maybe I'm gettingover it as well. Thinking of those starting today! You can do it....",
      "MessageIndex": 177,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jul 13, 2012 06:44AM Lisa614 wrote: Hi again.   Well, last time I wrote I had just gone back to work for a day and was doing ok.   However, the body aches and pains returned that evening along with a fever which started at 100.7 and ran up to 101.   I got real scared.   I called the on-call and he said i might have an infection and it could be viral or bacterial.   He prescribed generic Cipro and so I went out at 10:00 at night to pick it up.   I gotta say that was an emotional low point for me.   Here I thought the worst was behind me with the pain and feeling lousy, then BAM, the fever...and I started feeling sorry for myself that I had to go pick up the prescription.  (My son is out of town till Sunday and quite honestly, I had a hard time calling a friend at that time of night).    Anyway,  had my follow up appt. with doctor yesterday and found out my WBC is very low so I'm neutropenic.   Very suspectible to infection.   She had me take some IV fluids while I was there and I have to say, it made me feel so much better. Lessons learned:   I have to force myself to drink even though I do not feel like it.   Take Alleve a couple of days prior to Neulasta shot to ward off body and bone pain so as not to sleep all day and night.    Go in for IV fluids as soon as I start feeling yucky.  They hydrate the body so much efficiently than just drinking water.   Continue taking Zofran even though the nausea is gone.  It also helps the overall digestive tract.  (Having some loose stools, which only makes the dehydration worse).   I'm on day 8 now...dr. said days 7-10 would be the worst...no, days 3-7 were the worst (for me).   I think with better planning the next round, I won't feel quite as much pain.   ",
      "MessageIndex": 212,
      "PostDate": "13/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jul 17, 2012 09:14PM Lisa614 wrote: Hang in there teeballmom....I am anxiously awaiting the fall out.  Starting to lose nose hairs and the hair on my legs is not growing back as fast.  I've read it could happen on day 14 which will be Thursday for me.  I know it will not be easy.    Wishing you peace",
      "MessageIndex": 286,
      "PostDate": "17/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jul 17, 2012 09:21PM Lisa614 wrote: Hang in there teeballmom....I am anxiously awaiting the fall out.  Starting to lose nose hairs and the hair on my legs is not growing back as fast.  I've read it could happen on day 14 which will be Thursday for me.  I know it will not be easy.    Wishing you peace",
      "MessageIndex": 287,
      "PostDate": "17/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jul 1, 2012 05:22AM Lisa614 wrote: Moonwillow...I also had an Onco score in the medium range and had the \"option\" of chemo.   I chose to do chemo because I want to be as aggressive as I can in fighting a recurrence.   I start TC x 4 on July 5th and it is rapidily approaching.   A friend of mine gave me some meditation tapes which I've downloaded to my iphone.   I think I will plug in during my first treatment and try to use it to keep calm.   Initially I was as frightened as I could be of this but now I feel I am getting the tools I need to make it through.  I think being prepared is helping...finding that staying in THIS moment helps.    I wish you well in your journey.   ",
      "MessageIndex": 87,
      "PostDate": "01/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jul 11, 2012 04:38PM Lisa614 wrote: Way to go teeballmom....just keep hydrating and don't overdo no matter how good you feel. You're right, it's feels good to get it started and feel like you are doing something.",
      "MessageIndex": 190,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jul 18, 2012 01:17AM Lisa614 wrote: Thanks for the link Phillybird. Checked it out and they do have some nice designs for women. I need something tasteful that I can wear to work and all I had been finding was \"biker\" wear.",
      "MessageIndex": 292,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jul 20, 2012 04:35PM Lisa614 wrote: Hi ladies...true to form, my hair started coming otin droves on day 14 after 1st TC treatment (which was yesterday). Since my stylist was out of town, i had m co-worker's wife shave my head after work. She had done this for several of her BC clients so she knew just what to do. She made me feel so at ease and i ended up laughing at my new look, discovering that I've inherited my father's ears! Anyway, it has been an interesting day at work. Even though I'm wearing a sporty Nike Dri-Fit hat, there's no mistaking the fact that my head is as bald as a cue ball. Some of my patients have their own stories to tell, some tell stories of others in their lives. And it made me feel so connected to this new \"group\" i am now a part of...chemo warriors and cancer survivors. There seems to be a bond amongst those past and present and I am feeling that very much now. As for my health, had my one week bloodwork and my wbc's have bounced back up to normal so all systems go for round #2 on Wednesday the 25th. I'm so grateful to have a good week or so before the next round. Hope everyone is doing well. Oh --- Biotene also makes gum...if anyone is interested.",
      "MessageIndex": 362,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jul 8, 2012 04:24PM Lisa614 wrote: Day 3 since first TC treatment, Day 2 since Neulasta.   Yesterday, my gums became so sore I can't use toothbrush anymore.  Using Biotene mouthwash.    No vomiting, very little nausea...I take my meds at first sign of queasiness.  I'm feeling a little achy but not terrible.  Taking Clariten daily.   Just wanted to post so that those waiting to start know that so far it is VERY manageable.   Good luck to all.   Stay strong! Lisa ",
      "MessageIndex": 150,
      "PostDate": "08/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jul 11, 2012 04:35PM Lisa614 wrote: It's ok Moonwillow, i still don't believe i have/had cancer. Best of luck on Friday! I'll be thinking of you...",
      "MessageIndex": 189,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "Lisa614",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154498/profile",
      "Content": "Jul 11, 2012 04:49PM Lisa614 wrote: I made it through my first day back to work but ran out of energy at lunch time. Came home and ate some soup (which tasted really good). Had to take more Tylenol and then another Alleve because the aches were getting to be too much. I work with patients in an outpatient physical therapy practice and I swear Iwas so paranoid about them breathing on me today. I said i was going to wear a mask but find myself apprehensive (don't know why), but I'm wearing gloves when contacting patients' skin. Have my 1 week bloodwork tomorrow and I'm hoping they will tell me how mu immune system is functioning as well as how long I can expect to feel yucky. Wishing everyone well",
      "MessageIndex": 191,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    }
  ]
}