{
  "AuthorID": "LisaM72",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/190733/profile",
  "Posts": [
    {
      "AuthorID": "LisaM72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/190733/profile",
      "Content": "Apr 12, 2014 04:19PM LisaM72 wrote: hi girls...thanks so much for starting this thread. I am happy to say that I am almost 3 months PFC.  I am feeling great and getting back into my \"new\" normal of a routine. WW...I did have thinning of my eyebrows and lost my lower lashes 2 months PFC. That was actually a little traumatic because not experiencing a lot of hair loss.  They are coming back in.  It is actually kind of cool how your body works.  My other body hair probably started growing back a month or so PFC. It is coming in fast.  I am on my 2nd month on Tamoxifen with no side effects. I saw my Onc after a month and don't need to see her for another 3 months.  I have also been asked by the local PCC Rep if they can use my before and after pics. She also interviewed me and is hoping to send it to the local TV stations and see if we can get the word out about PCC. So I guess I am being used as a spokesperson and so happy to help out in any way that I can.  Texas...how was your treatment and how did your hair hold up with 6 treatments?  I have a friend that is starting in about a week and is freaking out. I tried to reassure her but I was not HER2+. This is why she is having chemo. Any insight would be great. Thanks. ",
      "MessageIndex": 12,
      "PostDate": "12/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "LisaM72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/190733/profile",
      "Content": "Apr 23, 2014 10:52AM LisaM72 wrote: Did any of you use any product to color your hair during treatment?  If so, what did you use.  Thx, Lisa",
      "MessageIndex": 20,
      "PostDate": "23/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    }
  ]
}