{
  "AuthorID": "lisa39",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
  "Posts": [
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "lisa39 wrote: finally PM'ed you back.  Sorry for the delay. Lisa  Lisa Dx 11/29/2007, IDC, 1cm, Stage I, Grade 3, 0/4 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707931",
      "Title": "kim 1965 lisa39 lisa39"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Oct 17, 2008 05:46AM lisa39 wrote: Hi Lynette, I don't think cancer is growing elsewhere and causing the weight loss.  From what you told us in your earlier posts, you were so sick from FEC #1 that you probably lost a lot and you are just making up.  Are you still taking steroids? They're often the cause of that hunger you describe.  Try to make sure you're eating enough foods that contain protein and healthy fat.  They will fill you up more than carbs.  Fluids help too.  Good luck on Tuesday.  I hope #2 isn't as bad for you.",
      "MessageIndex": 1,
      "PostDate": "17/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722928",
      "Title": "Losing weight but eating lots is this usual...? Lynette Lynette"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Aug 19, 2008 06:47AM lisa39 wrote: Hey, Jhawks, I just read your posts for the first time.  I'm sorry you've been going through all this.  Biopsies are no fun, that's for sure.  Mine hurt like H**L!  I was shocked by how much, even though they gave me a local anasthetic.  I was black and blue for two weeks.  Try to rest up.  I wish you good luck when you get your results on Friday.  Let us know what's up. Lisa ",
      "MessageIndex": 37,
      "PostDate": "19/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718934",
      "Title": "Misdiagnosed? jhawks67 Shirlann"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Nov 7, 2008 05:31PM lisa39 wrote: I can feel and see mine.  I've had it since April. It's right around the clavicle and it sort of looks like a vein protruding near the spot where the neck and top of chest meet.  Nobody has ever pointed it out to me, so I try to act like it's not there.  But my port-a-cath is a different matter.... this round disc sticking up out of my chest.  It looks like a microchip or something an alien would have to communicate to the Mothership.  I hate it and cannot WAIT until I can get it removed.!",
      "MessageIndex": 5,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723721",
      "Title": "Port question: Catheter from neck to port GointoCarolina bluedasher"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "May 14, 2008 05:47AM lisa39 wrote: Tammy and Therese, I'm really sorry to hear about your diagnosis.  I was where you are last November.  Diagnosed with BC at the age of 38 and terrified for my two sons (ages 7 and 5) and my husband.  I had a lumpectomy one week before Christmas and began chemotherapy on Feb. 8.  Fast-forward to now... I have 3 more chemo treatments to go and then 4 weeks of radiation.  I am also on Herceptin and will be until at least April of '09.  Looking back at the past few months, where you both are now is the WORST TIME.  So much uncertainty and fear - about the future, about how advanced the cancer might be, about the family and how to tell them.  But it DOES get better. Now that my chemo is more than 50% done, I can see light at the end of the tunnel.  I feel more positive about the future and less frightened.  I can see a time in the near future when this will be over and I can get back to my regular life.  If you can try to remember that as you start this terrible journey, maybe it will help you.  I sure hope it does. Best of luck, Lisa  ",
      "MessageIndex": 7,
      "PostDate": "14/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705519",
      "Title": "just found out! tammyj38 Kerry71"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Oct 2, 2008 08:28AM lisa39 wrote: Hey there, Yep, your lashes will come back. The good news is - they grow back fairly quickly.  Same with the brows.  I finished chemo on July 10th and I have a full set of lashes and brows.  Starting to look normal again.  Now... about the weird hair on my head....",
      "MessageIndex": 3,
      "PostDate": "02/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722143",
      "Title": "Eyelashes tomatojuice ksmerrill"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Aug 9, 2008 06:07AM lisa39 wrote: Dear Deb, I'm glad you're home for the weekend, but real sorry there are going to be more gruelling tests and uncertainty for you next week.  However, it does sound like your medical team is on it and I hope you get some relief FAST. Lisa ",
      "MessageIndex": 164,
      "PostDate": "09/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719214",
      "Title": "I'm in the hospital AlaskaDeb spar2"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Jun 24, 2008 12:44PM lisa39 wrote: Hey Jenny, Try not to worry.  It's better to get it looked after now than to sit and worry.  You have a female surgeon...that's a good thing in my book.  The others are right - whatever happens you have this group.  Lots of us in Canada too. Lisa in Toronto",
      "MessageIndex": 6,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707886",
      "Title": "Duct Excison Next Week Starting to Panic BIG TIME QueenK lisa39"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Jun 22, 2008 12:30PM lisa39 wrote: Hi Jude and Amann, To take chemo or not is a tough call.  Nobody wants to do it - who wants to lose their hair, have toxic chemicals injected into them and feel crappy for several months??? NOBODY.  But, Curlylocks and Shirlann are right - you want to make sure you take all the treatment your oncologists recommend based on your tumor pathology, age and probability for recurrence.  In the long run, you'll know you did all you could to attack your cancer and make sure it never comes back.  You're both young - you have a lot of years ahead.  You want to make sure they're healthy ones. As you can see from my profile, I was 38 when diagnosed, and although I wanted to talk myself out of it... I knew I really had to have chemo given the aggressive nature of my tumor (even though no nodes were involved).  I have gone through 7 out 8 chemo treatments.  It has been tough, but definitely do-able.  Looking back, the worst time for me was where you both are now... having to make the tough choices and having no idea what the next few months would bring.  Now that I'm on the other end, I know it was the right choice.  Try not to let fear over chemo influence your decision. The hairloss and other side effects are crappy, but they're only temporary.",
      "MessageIndex": 22,
      "PostDate": "22/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707657",
      "Title": "Lumpectomy/Chemo and Radiation...HELP totaldo artsee"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Sep 2, 2008 02:55PM lisa39 wrote: Deb, A friend had a benign brain tumor and she had tons of nausea before her surgery.  The docs recommended Gravol suppositories because she couldn't keep anything in her stomach.  She said that while it wasn't fun inserting them, they did help a lot with the nausea and helped her get some sleep too. Best, Lisa39",
      "MessageIndex": 34,
      "PostDate": "02/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720421",
      "Title": "Problematic Puking AlaskaDeb DragonladyTina"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Nov 16, 2008 08:52AM lisa39 wrote: ShellyJo...that Groucho Marx comment was too funny!  Your son is very cute. BTW. I have two boys (ages 6 and 8) and they had been telling me to wear my wig because I look like a boy too.  Funny. I am 4 months post-chemo and my hair is short, but it finally looks like I did it on purpose.  Sort of pixie-ish.  Not great, given my hair was past shoulder-length before chemo, but it's hair and I'll take it.  It came in much darker than my natural color (auburn), so I colored it.  A girl's gotta have some fun.  I'm still on Herceptin and will be until next April.  I heard it slows down the hair growth...so trying to be patient. ",
      "MessageIndex": 659,
      "PostDate": "16/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Aug 11, 2008 10:23AM lisa39 wrote: Danyel, I finished rounds of chemo on July 10th.  I did not gain weight either.  I am doing radiation right now and will continue with Herceptin until April '09.  I am 39 and tried to stay active during my treatment.  I also found I had little appetite for the first 4-5 days post-treatment and I totally lost my taste for sweets, as chemo altered my taste buds.  Herceptin is as close to a wonder-drug as it gets for us HER 2+ gals.  I am so glad it exists.  It's good news that your cancer hasn't spread outside the breast and lymph nodes.  I am sure your treatment will clear it up fine.  You are at the scariest part now, but it does get easier. Lisa ",
      "MessageIndex": 12,
      "PostDate": "11/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/719128",
      "Title": "update from doctor Danyel98 Maryiz"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Jun 24, 2008 03:50PM lisa39 wrote: I can't wait till I get eyebrow stubble.  Some bottom lashes would be nice too.  One more Taxol to go in early July... maybe after that.  Sigh.",
      "MessageIndex": 69,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Jul 7, 2008 12:22PM lisa39 wrote: I've noticed this too.  I just got back from a week at a cottage.  I was bitten on the forehead -and it caused the bridge of my nose and eyes to swell up so bad I had to hide behind sunglasses for two days!  Benadryl helped.  I will keep it close too.",
      "MessageIndex": 4,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708567",
      "Title": "Mosquito Bite reaction YUMMY lisa39"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Oct 31, 2008 06:36AM lisa39 wrote: Hi Emma, One more thing you might do to make sure those films get there is call back the office that's sending them and get the tracking number for the package.  Then you can track it with UPS or FedEx or whichever service they're using.  You'll be able to find out exactly when it was sent and who signs for it once it arrives at the breast clinic where you're supposed to go for your new mammo.  And good for you for being so pro-active.  I know it's hard to keep it together, but keep your eyes on what you want... that is to find out what you're dealing with and then get the best treatment you can (if necessary).  I agree with VHQH.  Your doc should not be telling you it's often \"too late\" for treatment by the time lumps are felt.  That is just plain wrong. Also, there are much better treatments now than when your mom was going through this.  You'll be ok.",
      "MessageIndex": 6,
      "PostDate": "31/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723666",
      "Title": "Overwhelmed and terrified Emmabell Towhee"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Oct 28, 2008 08:43AM lisa39 wrote: Hi there,  did she have surgery?  Does she have an open wound on the breast? Or is it discharge coming out of the nipple?  It sounds like there could be an infection.  She should call the chemo department and ask them some questions. ",
      "MessageIndex": 1,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723499",
      "Title": "Yellow Liquid dpumarino bluedasher"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Sep 22, 2008 09:32AM lisa39 wrote: Hang in there Sue!  You can do it.  Your little girl looks adorable.  Re: hairloss -yep it happens about 2 weeks after the first chemo.  You're smart to have your wig all ready and to have your salon on standby for buzz day.  ",
      "MessageIndex": 4,
      "PostDate": "22/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721523",
      "Title": "Day 1 and 2 susan13 susan13"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Nov 11, 2008 11:20PM lisa39 wrote: You can ask your doc for prescription for Effexor.  It's a mood-enhancing drug but it also cuts down on hot flashes a lot.  They will give you a low-dose form of it - so it's not enough to affect your mood, but it is enough to get rid of those hot flashes.  I was like you - having 15 of them a day - Effexor cut it down to about 3 or 4 and they were less severe.",
      "MessageIndex": 2,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724209",
      "Title": "Hot flashes! towens88 Curlylocks"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Jul 18, 2008 09:30AM lisa39 wrote: I haven't had dreams about my hair yet...but I do have hair-envy.  Whenever I see a woman on the street or in a magazine or on tv who has a great head of hair, I get these pangs of longing (maybe jealousy?).  I want mine back!!!!  This weird fuzz ain't cuttin' it!",
      "MessageIndex": 2,
      "PostDate": "18/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/709223",
      "Title": "Anyone else dreaming about their hair? NatsFan Jackster51"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Sep 29, 2008 07:42PM lisa39 wrote: Sincere condolences for your loss Laura.  It's nice of you to tell us how important Val found this site.  We're all in this together. ",
      "MessageIndex": 24,
      "PostDate": "29/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721900",
      "Title": "My Val feeval ozzie2"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Jan 30, 2009 02:02PM lisa39 wrote: Deb helped me when I got shingles from chemo last June.  She took the time to pm me and gave me some heartfelt advice.  It made me feel so much better at a very difficult time. To her daughters - always know how much your mom loved you  - never forget!  To John, my deepest condolences.",
      "MessageIndex": 313,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Jun 25, 2008 01:15PM lisa39 wrote: HI Estepp, I can totally relate to your biopsy experience.  I had no idea it would be as horrific as it was.  The noise that needle made when taking the flesh sample - like a damn staple gun - except inside my boob!  I remember biopsy day as one of my worst days...the doc put a sample under a microscope right in the room and said 'yep, it's definitely cancer' - she could tell just by looking.  The pain of the biopsy coupled with the confirmation that it was BC was horrible.  That was late November and the good thing is, I can tell you it gets better.  You are dealing with the worst part now... diagnosis and the fear of the unknown that goes with it.  But it will get better.  Once you have a treatment plan mapped out and it gets underway, you will feel more in control and start to realize that you can beat this and get better.  Best of luck and keep writing here often...  Lisa (age 39)",
      "MessageIndex": 3,
      "PostDate": "25/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707947",
      "Title": "Didn't have it in me Estepp CathyaMom"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Nov 1, 2008 05:58PM lisa39 wrote: I think there might be something to what you say, Ginnysue re: stress depleting the immune system.  I've read that our bodies are bombarded with carcinogens every day, but that our T-Cells and other parts of the immune system can usually repair the damage.  Cancer happens when they can no longer do so.  I've heard that when we're stressed, out immune systems don't work as well as they should.  Back to the original post by HeatherBlocklear... you know..I had a nagging feeling I had cancer several months before I was diagnosed.  A friend at work came up behind me one day and told me my hair looked nice.  I'd just had it cut and styled and was feeling good. I said thanks.. but later I was in the restroom and I looked at myself and thought: 'don't get too full of yourself about your hair, you could lose it one day'  It was a really strange moment... and a portent of what was to come.  Every last strand fell out during chemo.  But I think about that moment and wonder if I \"knew\" somehow that a cancer diagnosis was coming my way...",
      "MessageIndex": 13,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723726",
      "Title": "Does desperation play a role in developing breast cancer? HeatherBLocklear dlb823"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Apr 3, 2008 01:48PM lisa39 wrote: Hi Noelle, I live in Toronto and am doing a similar round of treatment to yours.  I have done 3 AC - one more to go and will do 4 Taxol after.  I'm getting radiation (had a lumpectomy, not mastectomy) and then a yr of Herceptin. I find that I am pretty out of it for 4-5 days after the AC treatment, but then my energy rebounds and I'm fine.  I am still going to the gym - tho I get out of breath quicker than usual.  My onc. says that's due to lower red blood cells. But it is tolerable and you will be fine!!!  Believe it. Lisa ",
      "MessageIndex": 58,
      "PostDate": "03/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Aug 12, 2008 08:27AM lisa39 wrote: Hi Lainy, I live in Canada and we have a Nat'l Health system here too.  I am just a bit older than you - 39, but was still 38 when I was diagnosed last Nov. 29th.  They told me I'd likely have to wait until after the New Year for my lumpectomy because of the Christmas break.  I was having none of it.  I kept calling and telling my doctor, the surgeons, receptionists - anyone who would listen that I was cracking up.  I told them I was having nightmares of it spreading and sitting around crying all day.  My surgery was moved up to Dec. 18th.  My point is, the old saying 'the squeaky wheel gets the oil' is true.  This is no time to be stoic and keep a stiff upper lip.  Get your doctor to call other hospitals, put some pressure on them!  You may find you get a date in late Aug. rather than Sept. Even if it doesn't work out, at least you'll feel like you're doing something.  Also, I would advise you to do some research on Sentinel Node Biopsy - it's a procedure where they remove fewer lymph nodes and has far fewer side effects, such as lymphedema.  Ask your doctor if you can go to a hospital where they do it.   Good luck, Lisa in Toronto",
      "MessageIndex": 8,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/719274",
      "Title": "Waiting, waiting Lainy lisa39"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Aug 12, 2008 08:28AM lisa39 wrote: p.s. - Actually just re-read your post - we're the same age! Lisa ",
      "MessageIndex": 9,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/719274",
      "Title": "Waiting, waiting Lainy lisa39"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Aug 12, 2008 09:56AM lisa39 wrote: I'm doing much better, thanks.  I finished 8 rounds of chemo on July 10th and have done 5 out of 21 zaps of radiation.  My energy level is improving and I feel less upset and more optimistic now than I did after I was first diagnosed.  Once your treatment begins you will probably feel more in control too.  As someone else said, keep posting and keep in touch with everyone here.  Re: blubbering - I can relate.  It's totally normal. I still have my moments.  It's very scary and a lot to cope with, especially in the early days. Lisa ",
      "MessageIndex": 14,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/719274",
      "Title": "Waiting, waiting Lainy lisa39"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Nov 30, 2008 12:23AM lisa39 wrote: I think Christina Applegate should have thought before she made that off-the-cuff comment about rads. She does influence people, as anyone in the public eye does.  Saying she wouldn't put that \"awful stuff\" in her body might make others who really need it, decline radiation.  As I recall, she had DCIS - her cancer wasn't invasive - so it's very easy for her to decline rads, especially with a full mastectomy.  Try not to feel bad, Tomatojuice.  She's an actor - not a trained oncologist. I don't think she even went to college.  She was also a child actor - she may not have even finished high school. I'm not saying this to be mean, just to point out that she is not in a position to make educated statements about radiation and its pros and cons.  As to the positive attitude... I'm like you - I have one, but don't go to church.  I attribute it to the power within.",
      "MessageIndex": 8,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725120",
      "Title": "Christina Applegate and radiation tomatojuice deadlanguages"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Apr 13, 2008 08:50AM lisa39 wrote: Hi Deirdre, I had a lumpectomy in December.  The surgery itself was not difficult.  They took out 3 sentinel nodes and they were negative, so I did not require a drain.  I was home the same night.  I agree with the other ladies here... try not to worry about chemo/radiation/having babies, etc until you know for sure what your dealing with.  Your lump is probably benign.  Fingers crossed for you.  Good luck on Monday. Lisa  ",
      "MessageIndex": 28,
      "PostDate": "13/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703885",
      "Title": "I have surgery on Monday Deidre flower123"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "May 13, 2008 09:41AM lisa39 wrote: Hi Mary, How are your red blood cell counts?  Maybe they are plummeting starting day 5 and your dizziness is a result of that?   I had dizziness, lightheadedness and shortness of breath due to low red blood count.  20 mg of iron in an over-the-counter supplement has helped me a lot. Lisa  ",
      "MessageIndex": 10,
      "PostDate": "13/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705365",
      "Title": "anti-nausea drugs mary6204 leaf"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Jun 27, 2008 06:34PM lisa39 wrote: I wish I knew when I'm going start feeling better.  I wish I could think about my boys growing up and not be terrified that I won't be around to see it.  I wish this never happened to any of us.",
      "MessageIndex": 49,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/704262",
      "Title": "WISHES (WHAT DO YOU WISH FOR) lizzie5308 lizzie5308"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Mar 26, 2008 09:48AM lisa39 wrote: I'm finding my ability to taste sweet things is diminished.  I was eating one of my son's chocolate easter eggs on Sunday morning and noticed that it barely tasted like anything.  Didn't stop me from finishing it though.  I kept hoping it would improve!  It just feels like my tastebuds are not working at full capacity and everything is somewhat tasteless.  I've had 3 rounds of A/C so far.  One more to go, then 4x Taxol.",
      "MessageIndex": 6,
      "PostDate": "26/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702825",
      "Title": "Taste changes NancyD Tessmerelda"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Sep 22, 2008 02:35PM lisa39 wrote: I had terrible heartburn with the AC part of my chemo, but not with Taxol.  I controlled it by popping Pepcid tablets regularly - I carried them around in my purse!  And I'd add a gravol or two at night.  It was an unpleasant side effect, for sure.",
      "MessageIndex": 5,
      "PostDate": "22/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721449",
      "Title": "Heartburn Deedee79 Sable"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Mar 9, 2009 11:23AM lisa39 wrote: I agree with lexislove... your rad onc would be the best person to ask....",
      "MessageIndex": 2,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730045",
      "Title": "OK....... I admit I'm vain! canadian lisa39"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Feb 12, 2008 09:54AM lisa39 wrote: Hello all, I just started chemo on Feb 8th.  First of 4 rounds of A/C.  Then I'll get 4 rounds of Taxol.  I feel weird.  Head feels flu-like and had unpleasant reactions to the steroid dexamethasone.  Swollen face, red face, bulgy eyes and dizziness.  Anyone else?  I have two young sons ages 5 and 7.  I got my hair cut short too to make it easier when it falls out.  My five year old got very upset when he saw my short hair.  Even though we keep telling him I'll be fine, he's been very worried and that makes it even worse.  ",
      "MessageIndex": 160,
      "PostDate": "12/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "lisa39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63000/profile",
      "Content": "Oct 16, 2008 06:09AM lisa39 wrote: Yes, chemo does target cancer in the lymph nodes.  My understanding of why they remove some during surgery is for staging purposes.  They need to know if your BC has spread to the lymph nodes or not.  It helps them determine what stage of the disease you're at.  This helps them tailor your treatment plan according to your needs.  Re: brain fog - it's very common.  Do a search under 'chemo brain' and you'll find lots of info.  This website has a lot of research on the topic.  Hang in there!",
      "MessageIndex": 4,
      "PostDate": "16/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722833",
      "Title": "Does chemo zap cancer in nodes... Lynette Maryiz"
    }
  ]
}