{
  "AuthorID": "LisaRhodes",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73706/profile",
  "Posts": [
    {
      "AuthorID": "LisaRhodes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73706/profile",
      "Content": "LisaRhodes wrote: Hi all I had my annual mammo yesterday, a month overdue, but that delay couldn't be helped as we had Hurricane Sandy move in the day before my original scheduled appointment. Anyway at the appointment I brought up 2 concerns I had, but wasn't sure if the one obvious visible one was just in my mind. Over the last month or 2 I noticed my left breast is visibly larger and hanging lower than the right. There is an area of pinkness on one part of it. Also in the last few months I have had intermittent insane itching of the breast and the nipple. The radiologist could also see that there is a very visible difference in the breasts, which is new for me. They did have to do more compressed pictures of the left breast after the initial films. I then saw my doctor, and again, she could see that the left breast is visibly different than the right, and having been my doctor for several years, also knew this was a new symptom for me. She said the 2nd set of films on the left side were because of dense areas of tissue. Shockingly she said that she had no idea at all why my left breast would suddenly both appear larger and hang so dramatically different than the right. She also said if it got redder, if I had any leakage or if the nipple changes to call her back. She brought up Pagets disease (sp) but looked at me almost cross eyed when I asked if it could also be a symptom of inflammatory. Googling this morning I found there are really  no specific inflammatory breast cancer specialists in southern NH where I live, but, the Dana Farber Institute in Boston does have specialists. It appears that if you even suspect it, a nurse will call you back within 24 hours and attempt to decide if you should come in. I know I should call them, but I just don't want to look like a hypochondriac. I do know there is a visible and completely new change in my breast. I am 44 years old, and have had numerous issues over the years with cysts, all completey normal thankfully. My doctor even said the one she took care of last year did not grow back. She also said it is something we want to watch, this change. But I am not sure waiting and watching is the way to go. Thankfully she didn't even bring up breast infection, I no without doubt it is not an infection. She did say maybe it had to do with my cycle, but it is impossible to tell as I had a hysterectomy in 1999. I did keep my ovaries, no idea if they actually still work, but if that were the case, this change would have gone back to normal. I am just not sure what to do. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/796941",
      "Title": "Not sure what step to take LisaRhodes Melrosemelrose"
    },
    {
      "AuthorID": "LisaRhodes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73706/profile",
      "Content": "Nov 28, 2012 11:24AM LisaRhodes wrote: Thanks. I feel almost silly. I did just get off the phone with Dana Farber. After speaking with 2 women, both named Judy, they agree that I should be evaluated. After a few calls back and forth, I have an appointment Friday afternoon.",
      "MessageIndex": 2,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/796941",
      "Title": "Not sure what step to take LisaRhodes Melrosemelrose"
    },
    {
      "AuthorID": "LisaRhodes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73706/profile",
      "Content": "Dec 3, 2012 05:21AM LisaRhodes wrote: Thanks for the well wishes everyone. I had my appointment Friday. I was very comfortable with the doctor and feel very good about the results. She is confident that I do not have IBC, but could see changes and differences in the nipples, so she did a punch biopsy of my nipple. It does hurt, I will not kid you, but she is hopeful of the results. She is concerned something is going on, and this is the only way to know for sure. Given that it was Friday afternoon, I doubt I will get my results today, more likely tomorrow or Wednesay. She will give me the results on the phone. Right now I have a follow up visit scheduled for February, but if the results are not good, I will obviously be back in sooner. I am not one to look for \"signs\" in life, but when they slap me in the head, I do see them. The doctor I saw, over an hour drive from my house, in a different state (I live in NH), actually grew up in the tiny town I live in and her parents still live here. One of the first things she actually asked me was where exactly my street was. I admit, I was quite confused, this town is very very small. Then she told me. For me, this has to be a good sign. Thank you again for all of your support! Fingers and other things crossed for a benign result!",
      "MessageIndex": 7,
      "PostDate": "03/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/796941",
      "Title": "Not sure what step to take LisaRhodes Melrosemelrose"
    },
    {
      "AuthorID": "LisaRhodes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73706/profile",
      "Content": "Oct 17, 2008 11:18AM LisaRhodes wrote: Thanks, you guys truly rock. In re-reading my post I must apologize for the length. Like all of you, this is not a place anyone wants to be. 2 things I am going to do between tomorrow and Monday is make an appointment with my GP for about 2 weeks from now, so I can get her take on the results when they come in. Hmmm, I said 2 things, I actually forget the other. I am also, when I go, going to request the report be mailed to me as well, so if I feel uncomfortable with anything, I can get a second opinion on the readings. Luckily I have a PPO, and am pretty free to make my own choices without the hassle of referrals. I also just got done telling my husband that I would not in anyway shape or form allow anything similar to my cervical cancer to take place. The entire 3 years was a fiasco, run around, doctors every 2 weeks to a month, insanity. I learned some very important lessons from that experience, 2 of the biggest being self education, and insistance that I am treated like the educated adult I am, and not a patsy that can be pushed aside. I am praying and hoping for B9 :) but I am also ready to hear and deal with, with all your help of course, anything I am told. Pray for the best, prepare for the other, guess it is something I have learned to do while I have grown up. Chezshoes, B9 for both of us all the way, totally. Wishiwere, I wish I had been more prepared for the phone call, but I can always call tomorrow or Monday to request that. Very good idea. Hollyann, thank you, your post really made me feel comfortable. Again, everyone, thank you so much.",
      "MessageIndex": 4,
      "PostDate": "17/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/722907",
      "Title": "New, and thank you for all your posts LisaRhodes LisaRhodes"
    },
    {
      "AuthorID": "LisaRhodes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73706/profile",
      "Content": "LisaRhodes wrote: Hi everyone Well, I got the dreaded call back today. Lovely.  First, a little history. I am now 40, oh yay ;) and had my first, what I called, big girl mammo last Friday. Given the holiday this past Monday (yes, I am on the east coast), I figured if I got past Wednesday with no call, I was good to go, and would get my see you next year letter in the mail. I was waiting for my daily work to be emailed to me (of course I am caught up and they were late), so I was chit chatting with my girlfriend when the other line beeped. I usually don't answer my other line, I consider it rude, unless necessary, but I always look and it was St. Joes. I told Pam, and we both went crap. So classy I know. The lady said, hi Lisa, we need you to come back for some more films on your left breast, and an ultrasound. I told her okay, but so many days had passed I figured I was in the clear, but they were behind on reading films, because of the holiday, and because so many women, like myself, choose October for their mammos.  I know better, which I will explain, than to ask for information on the phone, they can only say so much, but I asked, well what do they think they saw. There was a moment of silence, and she said, and I quote, Let's remember you are still very young, the surivival rate is very high. My God. She never should have said that. So, I am going next Wednesday the 22nd for the follow mammo and US. It was the earliest they could get me in, and didn't want to do them in 2 separate appointments, which for that I am thankful. Anyway, here is my history. The only maternal history I have is my mom, as she was adopted, and she was DXd in her late 40's with BC. She survived, and is still with us. This is also why I chose October for my annuals, besides being BC awareness month, it was also the month they did her partial. Because of various breast issues, I have been having mammos since I was about 26. I did have a sebacious cysts removed from my underarm area on the right side about 2.5 years ago, but that is all it was, a cyst. My left breast, the one they are examining has been an area of focus for the last several years, however. I have had diagnostic mammos on it several times, as well as ultrasounds, for something my GP thinks she feels, but they never see. Once, a film came back where they thought they saw something, but on the later views assured me that is was just the angle and disappeared on later views. I also have a history of nipple discharge in my left breast, which had been smeared, but came back clear. The nipple discharge was about 10 years ago, about 3 years after my last child was born, and I always associated it with possibly a milk duct that had been clogged when I breast fed that finally had worked its way out, as I had only stopped breast feeding 2.5 years before that. Also, and why I don't trust phone calls, I am a cervical cancer survivor. I was DXd what I was 28, 14 months after my youngest child was born. That first bad PAP call was eeriely similar to my call today. I was told on that call I had atypical cells. I went in, before my bioposy on that, my then GYN brought me into his office, and upside down, I could see that atypical was a lie, the PAP alone showed CIN3. I then went through 3 years of biopsies, a LEEP, cold-knife cone and hysterectomy. One scary factor in all of that is I was put on hormonal therapy to surpress my period, because of the condition of my cervix, before my hysterectomy. My new GYN and myself felt the risk of the hormones at the time was worth it, as it was a temporary solution to try to avoid the hyst, so I was only on them for about 2 months. That was 9 years ago, at age 31. Now, I admit, I have slacked in the last 2.5 years on my mammos. I was just so tired of so many years of something, I wanted nothing. The last few months though, I have had a little voice inside of me telling me something is up. I have been so very very tired. And in the last 2 month, my left breast has actually felt somewhat fuller than my right, something that I again admit I did not tell them last week. I thought it was hormonal. When I had my hyst, I kept my ovaries, but did go into a temp surgical menopause. When the little guys started to kick back in, I only can tell when I have fuller breasts, obviously I don't have my period, but it only happens a few times a year. But my left breast has felt is just heavier. It is hard to describe.  I have also had a few occasions of shooting momentary pain in it, which I sort of thought of as a kick in the butt to get the mammo done. So, now I am here. Luckily I didn't have to wait for a letter in the mail, and I am only 6 days out from getting it done. I also am lucky that I have a busy weekened ahead, as the company I work for will be out here on the east coast for an event in Boston this weekend, that I will be going down (I live in NH) to help out with. So, ladies, I will ask you for some advice. I can ask that the report is sent to me as well, correct? Any questions I should ask while I am there? Also, I should mention that much to my delight, my breast care center since my last mammo, has switched to digital, so I know that is slightly better on younger women. Also, I will research this, but does stress play into possible BC? It is something we have had a lot of in the last 2.5 years. House fire, car accident with our kids, then I broke my ankle last winter. My dad passed away, and well teenagers.  Thank you so much for all your posts, and all your openness. After my cervical cancer and hyst, given my age at that time, the web is where I found the most support. Don't get me wrong, I have an amazing support system around me, I am very very lucky that way. But I think you all now what I mean, you get tired, just bone tired, of telling the same story over and over again. It is so helpful when you can just know that someone understands. By the way, my name is Lisa. Nice to meet you all. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/722907",
      "Title": "New, and thank you for all your posts LisaRhodes LisaRhodes"
    },
    {
      "AuthorID": "LisaRhodes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73706/profile",
      "Content": "Jan 22, 2009 10:34PM LisaRhodes wrote: These ladies are amazing, you and I are lucky to have found this place! I wish I had advice for you, but all I can offer is support, because you are doing the best you can having it checked. I too am a daughter of a survivor. And a survivor of cervical cancer myself.  I am 40, and had my yearly screening (I have been having mammos since I was 28) in October. I did get the call back and had what turned out to be a cluster of cysts, which I had aspirated and they were just cysts. A few weeks ago I started noticing odd things in my right breast (October was my left). I had thickening, some discomfort with intermittent shooting pains, some mild swelling and some skin changes. I went to see my GP, and instead of sending me to my normal breast center, she sent me to hers. I saw them this past Monday, and upon my physical exam, they brought me right into ultrasound, and found an area of something. I am waiting on what exactly it was. It was to say mildly very gross, as they moved directly forward to the fine needle aspiration. The 'stuff' they took out was very gross. And unfortuantly I gather from the doctor, it did end up involving my duct. At first she didn't think so, but while she got prepped for the FNA, the tech kept going and told the doc that it was in my duct as well. I have already had 2 calls from the breast center that it doesn't seem to be infection because the cultures are still not growing bacteria. My GP had given me antibiotics just in case, and they breast center told me to stay on them, just in case.  So, I am still waiting for results. I go back on Tuesday the 27th. I actually have a bit more pain than I did and a fair amount of bruising.  I am trying to be positive, though a week ago, I was completely thinking exactly like you. I couldn't help it. I am feeling more confident, in a way because they did find something, and acted the same day. I do feel, and have felt, it isn't an infection. I have no reason to have one. I haven't been injured or bitten by anything. I haven't breastfed in 13 years. I have not have a fever since this all started. Still don't.  I know it's a something, and it is something that wasn't there on October 10th. Now I just have to be confident that whatever this something is, is being treated. Keep coming back to these boards. What is such a scary subject is made so positive here with these amazing women. Good luck with your visit!",
      "MessageIndex": 8,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727763",
      "Title": "daughter of bc survivor ~ now it's me! kristinabergner TheQu33n"
    }
  ]
}