{
  "AuthorID": "LisaG65",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147314/profile",
  "Posts": [
    {
      "AuthorID": "LisaG65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147314/profile",
      "Content": "LisaG65 wrote: looking to read about \"after chemo, returning to normal, how long does it take, best way to rid ur body of chemo, regain strenght, and mental health\"? fall down seven times, get up eight times. Dx 3/5/2012, IDC, 2cm, Stage II, Grade 2, 0/4 nodes, ER+/PR+, HER2+ Dx 3/5/2012, IDC, 2cm, Stage II, Grade 2, 0/4 nodes, ER+/PR+, HER2+ Surgery 8/8/2012 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/789166",
      "Title": "after chemo, detox, returning to normal. is there a thread? LisaG65 Carolinajoy"
    },
    {
      "AuthorID": "LisaG65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147314/profile",
      "Content": "Jun 18, 2012 07:20AM LisaG65 wrote: wow, i was happy to come here and read so many responses. I want to say that while I may say 4 of 6 TCH is enough for me, I admire all of you who have completed or are on the way to completing ALL of your rounds of chemo. @Karmil710  thanks for the advice to see how I feel post surgery. I dont think I will feel any different, and I will be that much further my from last chemo on 6/5.  I cant wait to my energy to return and my anemia and neuropathy to go away. Now i am working on staying focused and positive while awaiting my surgery. I am going to do my best to flush and eat well. I eat fresh berries (are in season and on sale) several times a week. I enjoy eating meat, but have begun to cut my portions down. I craved meat and pasta once I could eat again after each tx. I upped the veggies and fruit without meat meals. Main thing is trying to drink H20, its been tasting bad, but i still drink it, with lemon, ice cubes, room temp, decafe green tea. whatever it takes, if I look at my glass, I make myself take a drink. I am going to rest as needed and be active when i can. I am anxious for the nueropathy muscle burn and ache to subside. I want to be able to go again, when and where I want. I hope everyone will keep posting and sharing what they experience on their journey! Lisa",
      "MessageIndex": 9,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/789166",
      "Title": "after chemo, detox, returning to normal. is there a thread? LisaG65 Carolinajoy"
    },
    {
      "AuthorID": "LisaG65",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147314/profile",
      "Content": "Jun 17, 2012 01:55AM LisaG65 wrote: i was scheduled for 6 rounds neuoadjuvant TCH, i have had 4. I am getting shots of neupogen. the neuropathy has gotten so bad, the muscle wasting, my gait, and just being able to walk across the room and not feel like a 99 yr old woman. i asked for new imaging, i have a mammo and ultra sound sched. for 6/21. chemo #5 is 6/26 but, i am not going to take it. i will see my dr on that day to get the results of my imaging. i am hoping for a masectomy as soon as i can get it scheduled. my tumors that were visible through my skin, are no longer visible. i am not taking the last 2 rounds of chemo. its just to much poison, i feel when i go to my dr.s office that its like being at a production line, or auto dealership waiting room. what wrong with your car? oh, i need a new car, you? oh, my brakes are bad. my dr has great bed side manner, i just feel its all about the $. and there is no room for natural healing. i went in as a hippie chic, with long dreadlocks, eating well, and taking supplents. the chemo is killing me, IMO.  i have lost all my physical strenght. it is scary to me, i am a personal trainer, weight trained, have danced and am/was physically as strong as any man. but to not be able to move my own body weight across the room has become to much for me to bear, and reading that some of these side effects never go away was enough for me to say hey, your going to take my entire breast regardless, so get it done! i am feeling better since making this decision. i dont believe in the poison. after hearing about robin roberts this week, doing research for months, i say enough already. i am scheduled for the rest of the year for herceptin and then 5 yrs of the pill. i dont think i will be doing any of that. all my pet/cat/mri shows no cancer in any other part of my body except my left breast.. i hear chemo also cause you to get cancer in other parts of ur body. i am going to detox my body and hope to regain my strength enough to start walking, and exercising again, i am 47, i am of strong mind, i do have a say in my treatment, and will not be lured in to the cycle of the what the dr says is always right. i know my body and it has had enough. i thank you all for reading this and possible replies. i am smiling and focused on getting over the poison, surgery and getting my life back.",
      "MessageIndex": 4,
      "PostDate": "17/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/789166",
      "Title": "after chemo, detox, returning to normal. is there a thread? LisaG65 Carolinajoy"
    }
  ]
}