{
  "AuthorID": "lisbet54",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
  "Posts": [
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Sep 25, 2017 10:48AM - edited Sep 25, 2017 10:58AM by lisbet54 Hi again, I need advice. I wrote here a couple of weeks ago - very anxious about liver pains and additional pains in my left side. I am newly diagnosed stage 4 with liver mets (as of May 2017) and have been on Faslodex/Ibrance since July. I have anxiously waited for the results of my first scan after starting treatment. I had the scan last week and have a scheduled appointment with an oncologist (not MY oncologist - as I always see a new one due to the public health care system in DK) this Thursday. I just made the TERRIBLE mistake of going to my electronic medical log where all test-results are stored just to see my blood work results. However, the scan results were already there and accidentally I read them. It turns out that there is a huge progression in the number of liver mets. From several rather small lesions, the metastases have now grown to fill up one third of the right hepatic lobe + additional mets in the left. Besides that it seems that now the bones in my lower back have also been attacked. I'm in chock but not surprised. I have had so terrible pains in my liver – like knives turning around. And though I hoped it was a symptom of 'dying metastases' as some have suggested, I could hardly believe that. I know from this forum that Ibrance can take up to 5-6 cycles to work. However, with this kind of progression on Faslodex/Ibrance would it not be wise to go to another kind of drug - or should I give it more time? What kind of drug could be the next step after Ibrance/Faslodex (Letrozole has already failed me)?",
      "MessageIndex": 5911,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Sep 30, 2017 01:27PM - edited Sep 30, 2017 01:36PM by lisbet54 Bluebird, 50sgirl, Margarita, JFL, Linda - and others that I might have forgotten: Thank you, thank you so much for taking the time to answer me! Unfortunately I cannot get another doctor. I called the hospital and asked for another doctor. The nurse I talked to said that that might not be possible. Decisions about treatments are made collectively by a group of oncologists every week and then one is assigned 'to deliver the message'. The nurse agreed that not all patient/doctor combination might be a success. But unfortunately this cannot be changed. I can only hope for another one next time I'm having an appointment. I asked her about the xeloda. She confirmed that this is used in DK and would ask the doctor why I wasn't offered this drug. She called me back yesterday and said that xeloda would be 'down the line'. Right now taxol or epirubicin would be the standard procedure (which they apparently have to follow). Should I want to discuss the choice of drug I would need a new appointment (which would take some time to get) and I probably would have to sign some documents or something like that. I'm not sure I understand this. Is taxol the stronger one - because the progression is so huge - or is xeloda the stronger one since it's 'down the line'? Or maybe there is a difference in standards in DK and US. I don't know. What's worse - as I read through the papers on the drugs, I discovered that I'm not allowed to drive on the day that I get the taxol. That would make it impossible for me. I live far out in the country, there is no public transportation - and I have animals that need to be taken care of. I have no one to drive me. I really hope I can get a dispensation for this! One question at the moment on taxol. Just read an article that most women gain quite a lot of weight on breast-cancer chemo. Maybe a small problem, but I just find it so scary that after loosing my breast, hair, eyebrows and lashes and all the other SE, I might also gain some kilos. Those of you on taxol or epirubicin - have you gained a lot of weight on the drug? Other scary SE that I have to look forward to? Linda, so sorry to read about your progression. It seems that this is a disease where the good news is absolutely lacking!",
      "MessageIndex": 5995,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Sep 30, 2017 05:01PM - edited Sep 30, 2017 05:23PM by lisbet54 Leftfood - I'm in DK, Europe. So ACS can not help me here. 50sgirl: I'm probably not able to get a second opinion in a very short time. I'm worried that the metastases kind of grew 15-20 times or more from June to Sept 18th. That kind of shows me that I have to act very quickly. This shit seems to be exploding! I was shown the scan-pictures and they definitely didn't look good. Scaring! I don't know what to do about transportation. The nurse insinuated that I might be legible for home transport as I might be drugged by the chemo. But I would have to arrange the transport to the hospital myself or have someone drive me. However, I don't know anybody in the nearby who can drive me. My neighbors are at work and my friends and family are not living in this region. Churches don't do this in DK - and I have never heard of any organizations that do transportation for sick people (except the hospital-transport, but it seems I can only get home-transport). I really don't know what to do. I must find out next week and call the hospital again. However, it sounds less frightening that BLUME did not have too many SE. I guess the onc just mentioned all the SE so I would be prepared, but I got so scared when he said I must be prepared for hospitalization from time to time due to fever - and then heavy antibiotic. Permanent neurological damages to hands and feet, permanent hair loss (because I will have this drug for the rest of my life - or move to another chemo when it stops working, arthralgia, weakness, kidney damage, nausea and vomiting. Coming home I actually was considering - and still am - if it's worth it. If the disease works so quickly I might just die naturally and hopefully have a couple of good months before I get sick. I know it's sounds very depressed, but I really don't know what to think after the conversation with the doctor and the nurses. Everything seem so impossible. I'm not really depressed - just so confused and yes, very sad that everything seems to end this way and so quickly. I was so relieved when I first skimmed through these forums that a lot of stage 4 women seem to live relatively good lives for some years. But of course some also only get a few months. That was before I learned about the progression. I believe I now have to be prepared for a short time when I consider the tumor growth in my liver and try to figure out how best to spend the time.",
      "MessageIndex": 6000,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Oct 2, 2017 04:15PM lisbet54 wrote: Scwilly, don't worry - I would never put other people's lives in danger. I don't know how things will turn out and how drugged I'll be. I think I just meant that if there's heavy frost or snow and I generally felt OK it would be all right to drive 5 km which is a 3 minutes drive on a country road with no traffic at all. Lvin - so sorry for you! I feel your anxiety. I'm sure you'll have good answers and hope from the more competent ladies.",
      "MessageIndex": 6033,
      "PostDate": "02/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Oct 27, 2017 06:52AM lisbet54 wrote: Shetlandpony and Marylark - thanks for the suggestion of ice on hand and feet. I have read info about this. Do you know where I'll be able to get hold of these? (I have looked on Amazon. com - there are not available there - and anyway Amazon doesn't ship to DK. Amazon in UK doesn't have them either) I don't know of any here in DK that has used them and sell them - and the hospital doesn't provide them. I cannot bring ice to the hospital - it will be melted long before I get there.",
      "MessageIndex": 6363,
      "PostDate": "27/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Mar 15, 2019 06:50PM lisbet54 wrote: Thank you so much - all of you who have taken the time to encourage me. Yes, I know that I'm heavily depressed. Usually not a person depression prone, but as none of my treatments so far have worked, I'm scared. I'm in Denmark - and our system here is quite different. I cannot get Y90 - that's for sure. I have asked about it several times. I may be able to get it in Germany - if I pay out of my own pocket. I don't know the price exactly - only that it is heavy! I'll search the matter and call to hear if they think I'm a candidate - and then try to raise the money. Unfortunately my latest treatment, xeloda (capecitabine) hasn't had any effect on me at all. I did have so high expectations to this knowing that it has been a game changer for so many with liver mets + it's very convenient. After my next scan I know I'm going to have one of the \"heavy chemos\" - and I'm almost as scared of them as dying. I know so many who have lost almost all QOL on these chemos. I'll spend the weekend looking at the links. Thank you so much for providing these. I wish you all a wonderful weekend. I'll report back when I know what's coming.",
      "MessageIndex": 10834,
      "PostDate": "15/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Mar 19, 2019 07:15PM lisbet54 wrote: I appreciated the many links I got last week - and I have searched out on Y90. The sad part is that it's definitely not available here in DK. There are some trials on the treatment - but they are reserved for colorectal cancer patients with liver mets. No chance at all to get it as a breast cancer patient! I have tried to find out if it's available anywhere in Europe - but have not been able to find any treatment centers here. Any Europeans on this site that have an idea of where to get it? I would appreciate a direct link as I haven't been able to find one. I have asked in a FB-group, but nobody seemed to be able to help me. 50sgirl I have had some chemotherapy. I did weekly taxol for about 5 month. It halted the liver mets but didn't shrink them. Like you I found it a relatively easy chemo. Not many SE in the beginning. But the fatigue grew as the month went by. Unfortunately after 5 month I became almost numb in my feet and legs - just out of the blue. I couldn't feel the ground beneath me and had trouble walking. It happened within an hour. The doctor stopped the chemo immediately because of the severe reaction. It slowly faded over the months but has not disappeared completely. As most chemos are likely to give neuropathy I'm really scared that I'll get this reaction again. I don't know if you can be neuropathy-prone to one chemo and not another - or that if you get it from one chemo you're sure to get it from all the chemos that affect the nerves?",
      "MessageIndex": 10871,
      "PostDate": "19/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Sep 30, 2017 05:26PM lisbet54 wrote: 50sgirl - where can I get this free guide to MBC?",
      "MessageIndex": 6001,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Sep 30, 2017 06:52PM - edited Sep 30, 2017 06:54PM by lisbet54 Nkb - Thank you for taking the time to answer. Wow - such side effects - it definitely scares me but I appreciate that you're very honest about it. I need honest answers before I can make the decision. As you describe it, I'm not sure I want to do this to my body! I have always been very much opposed to chemo - and fortunately it has never been put on the table until now! I have always taken such good care of my body. If it's going to be destroyed, I don't want to do it myself. Of course I know that cancer destroys it. But that's something else - I have done all that I could to get rid of it and I didn't invite it. I don't smoke, don't drink alcohol, exercise and live very very healthy. Deliberately doing to my body what you're describing taxol did to you: nerve damage, destroyed metabolism etc. That really puts me in doubt.",
      "MessageIndex": 6004,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Oct 2, 2017 07:17PM - edited Oct 2, 2017 07:21PM by lisbet54 Scwilly and Grannax2 - what do I know? Nothing! Right now I'm just plain scared. I never take drugs, I never do alcohol or anything toxic. I have absolutely no idea about how I'll feel when I get the drugs and what they are and what they'll do to me. I just got started on Faslodex/Ibrance - which was a very big thing. And before long I started to feel like a pro on these drugs. And wupti - they didn't work either. I haven't heard of benedryl before - don't think we've met yet. So now a whole new group of toxic stuff to try kill the cancer! I think I just cannot imagine that I will be put that much out by the drug. I mustn't be. I have to get home to work! Maybe I cannot work? It seems that some people have an easy time on taxol but reading through the thread on weekly taxol it was obviously very hard on others. I believe I read in a post that someone didn't have to take the steroids - and hoped I could get there too. These steroids are really scary. I have a very clear and sharp remembrance what they did to my husband and an aunt. The nurse I talked to today was not able to answer all my questions. She said I needed to ask them to the nurses that will administer the drugs. I can get a wig. The hospital already told me so. I even have the telephone number to the center. It's just such a big step for me to call them and I haven't had the guts yet.",
      "MessageIndex": 6040,
      "PostDate": "02/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Oct 27, 2017 07:21PM - edited Oct 27, 2017 07:23PM by lisbet54 Thanks for the kind answers and suggestions. I called the hospital today - and the nurse I talked to said it was quite normal to have a lot of tingling and numbness the first couple of times - it should go away. However, if it's still there the day before the next dose, I'll have to call them and I'll will have to get a new appointment with a doctor to discuss another kind of treatment. If the tingling doesn't go away in a couple of days it is a sign I can't tolerate taxol. I just have to hope it's gone by Thursday next week. I'll keep looking for ice bags, but I don't think they are used in DK - for whatever reason.",
      "MessageIndex": 6375,
      "PostDate": "27/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Jul 16, 2017 09:13AM lisbet54 wrote: I have not written many posts to this forum. I am still new - and still quite overwhelmed by my stage 4 diagnosis. After a CT-scan and following liver biopsy, I was diagnosed with several liver metastases in May/June. Prior to that, I did not have any symptoms. Did however have some sharp pains in my right side several times in January/February - but they stopped and I didn't think more about until after the diagnosis. 2 weeks ago, I started Faslodex/Ibrance. So far not many SE, but before that I had very little tolerance to Letrozole (which obviously failed me). The SE effects continued to grow on me in the years I took it. This last week I have had a continuing (quite strong) pain in my right side just under the ribs (liver I suppose). Can any of you tell me if this could be a side effect of the meds - or is a clear sign that the sickness is worsening and the tumors growing? It is too early for me to have a new scan so I will not get any new scan results before mid-September. Please do not sugarcoat if it is a bad sign!",
      "MessageIndex": 5371,
      "PostDate": "16/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Sep 28, 2017 05:56PM - edited Sep 28, 2017 06:34PM by lisbet54 I had the appointment at the hospital today. Unfortunately I had to face one of the young most un-empathetic doctors. As I had expected I'm finished with faslodex/ibrance. After only 3 cycles. And finished with all hormone-related treatments! Cancer has outsmarted them all in no time! I got the choice between taxol or epirubicin. With taxol I will have to drive the long road to the hospital twice a week, once for the blood work and once for the treatment. If I wanted to come less often I could choose epirubicin - but only 9 cycles as it causes permanent damage to the heart pump. I was heartbroken and chocked that this is going to be my life from now on. I was informed of SE of both treatments, both the temporary and the permanent damages of the treatments. I tried to suggest other treatments, but the doctor dismissed them all. I was not offered xeloda though that would spare me from the much driving. Operation and freezing/heating are not possible because the metastases are all over the liver. Regional chemo is not done in Denmark. Only chemo-treatments left for me - so soon. I have only been stage 4 since June - and already finished with so many treatments! The doctor said I was absolutely welcome and free to opt out of it all - that was my choice! If I wanted I could get a scan in 3 month and I could always come back and choose the treatments should I want to do so. He blabbered all this out even though I had not even insinuated that I had this on my mind. When I started crying he became very irritable! I left without any appointment. Right now I'm in a very dark place!",
      "MessageIndex": 5961,
      "PostDate": "28/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Sep 30, 2017 01:33PM lisbet54 wrote: Oh just another question. When talking about drug choices with the doctor, I said that I was in the understanding that there would be a lot of drugs for me down the line. He answered that unfortunately there wasn't. Because I've done with AI's there are only a few left. It would have been a different matter had I been hormone negative. Then I would have much more choices and the prognosis would also be much better. Is this really true?",
      "MessageIndex": 5996,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Oct 2, 2017 12:33PM lisbet54 wrote: LindaE54: What I wrote about the epirubicin was what was offered me at my point - it might be different for you. I called the hospital again today - the nurse insisted that I can only get the home transport. She called me back later and said that 5 km away I will be able to get public transport if I shift between buses and train 3 times. A 5 km walk should be considered acceptable. I'll have to agree to that and suppose I can manage driving the 5 km when the bad weather sets in. It's a country road with very little traffic so even though I might be a bit drugged, it should be doable. The bad thing about is that it will make the weekly taxol a whole day project and require that they stretch themselves further at my job. I hate to ask! If I'm not allergic to taxol the drug that makes one drowsy will only be administered 2-3 times at the start up. So I hope I'm not - and then the problem will be solved. I also hope to get a dispensation from the steroids. They really scare me. The nurse didn't know if this is possible - but she was kind enough to add that she fully understood that I want to skip this part of the treatment. It's only to make it easier isn't it? I found a another thread here on fasting during chemo-treatment. It seems several have avoided many SE by fasting before and after treatment. Very interesting thread! I still haven't told the hospital the final 'yes' to the treatment. I tried to call the hair center to make an appointment for a wig. However, I couldn't do it. Picked up the phone several times - and put it back again. I don't know if I'll get it done tomorrow. Right now, I think not! To make plans to do this to my body feels like planning to commit a serious sin - best way I can describe it.",
      "MessageIndex": 6030,
      "PostDate": "02/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Oct 26, 2017 01:39PM lisbet54 wrote: Hi again Today I started my first dose of weekly taxol. Next week I'm going to get a port before the 2nd dose. To ease my panic the nurse was kind enough to tell me that there is a risk of collapsing the lung as they make room for the port! The chemo went relatively well. Apart from becoming rather tired of the antihistamine I did not experience anything. However, as soon as I came home I noticed a very strong tingling in my hands and feet - especially in my left arm that also has lymphedema. The nurses said that neuropathy was a risk - but it would build up over time. First times I most certainly wouldn't experience anything. And not everybody gets it. Now already strong reaction after first dose - that's bad news I think. Given that my tumors are very aggressive I have told the doctors that I prefer life quality to life length. And they understand that. I think neuropathy is one of the SE I will not tolerate - most people I've talked to describe this SE as hell on earth. The doctor told me on my consultation a couple of weeks ago, that the neuropathy would be the worse SE (+ loosing the hair). Should I get it, they might take me off taxol because the damages in most cases are permanent. I fear I already have to let go of taxol. Right now my fingers have become so numb I can hardly write on the computer. Anybody knows if this early neuropathy might be just transient and disappear as the treatment continues - or is it a sign that I'm a strong candidate for serious neuropathy as the treatment goes on?",
      "MessageIndex": 6347,
      "PostDate": "26/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Nov 8, 2017 03:10PM lisbet54 wrote: Last Friday I had my second dose of the weekly taxol. After the first dose I had some quite alarming tingling especially in my lymphedema arm - but not much in feet. I asked the nurse about it, and she told me to watch it. It might be that I cannot have the taxol because it could be an early sign of neuropathy. I cannot have cold packs/gloves/socks. I asked at the hospital - they don't do it. They say there is no evidence that this is helping in any way and therefore the hospital will not invest in these things. This makes me doubt too. I have searched to and fro to buy myself - but have given up. They are so difficult to get hold of and the shipping time is so long. Besides I'll not be able to keep them cold until I reach the hospital. It's a long drive and the hospital cannot provide refreezing of the stuff. I did not have many SE after the second dose - but today on the 5th day I had tremendous tingling in my feet. It's been all day and very very alarming. When I stood up after working on my computer, I couldn't feel my feet. When I tried to walk it was like I was floating on air - no feeling in my feet at all. I tried to walk but was so afraid of tipping over. Now a couple of hours later it has diminished a bit, but I'm really scarred. Did anyone on taxol experience this? After how many doses? Did it go away after stopping taxol? Should I say stop already now - the nurse (and before the doctor) have said that I'm the one to say stop? I'm so afraid it might already be time to move on.",
      "MessageIndex": 6498,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Dec 5, 2017 06:46AM lisbet54 wrote: After my heavy neuropathy, my weekly dose of taxol was lowered by 25 % - and since then I've had two doses. Next ( the 5th) is up tomorrow. Neuropathy is now minimal and do-able at the moment. On the full dose I was happy to register that my liver pains disappeared. However now on the lowered dose they are back constantly. I fear that it means that taxol is not working. The pain is quite heavy - caused by an enlarged liver and progressing mets I fear. How long did it take for those of you who've had weekly taxol to know that it was working? Did you have liver pain in the process? I've was told that taxol is a very good chemo - but also that it only works on about 30%. Personally I find that to be a very poor result and doesn't make me hopeful and optimistic at all! Unfortunately I cannot have a new scan before January - and will possibly not be transferred to some other drug before the scan results. What might be the next line of drug? (all hormone-treatment, faslodex/ibrance already failed). And I need a bit of hope. Did anyone else with VERY aggressive liver mets finally get them under control for a period - or is it too much to hope for?",
      "MessageIndex": 6857,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Jul 16, 2017 07:13PM lisbet54 wrote: HI again. I'm so thankful for your kind responses to my question - and a little relieved that some of you did have pains in the beginning of the protocol. Of course it's hilarious if it has already progressed a lot - but at the moment I sometimes feel that I'm already dying....Stupid of course! but anyway..... I'm reading on many threads, but the material is enormous. I must try not to focus too much on the situation. I can feel that this is very unhealthy for me. Thanks again. I'm sure to come back and ask more questions.",
      "MessageIndex": 5383,
      "PostDate": "16/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Jul 17, 2017 07:24PM lisbet54 wrote: Thanks again for all the kinds responses and welcomes. It's overwhelming! ",
      "MessageIndex": 5396,
      "PostDate": "17/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Sep 27, 2017 12:31PM lisbet54 wrote: Hartrish - no, I have the appointment with the doctor tomorrow morning. I just read the scan results for myself. Pretty sure they will give me extra time for the appointment because of the huge progression in such a short time - and really hoping for one of the nice and empathic doctors. (Several of them are so young and besides that they're foreigners and speak a poor Danish). Kayyborg, so sorry to hear about your progression. Heartbreaking to share the news with your children. Praying for you that you will get the right treatment and have years ahead of you!",
      "MessageIndex": 5939,
      "PostDate": "27/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Oct 10, 2017 05:07PM lisbet54 wrote: Thanks for support Nkb, Rosetoeses and Shetlandpony. Dare not order online - as I know that wigs need to be cut and trimmed and don't have a clue what suits me because I cannot get anything like my own hair. I have long curly blonde/grayish hair - which doesn't make it easier I believe. I tried about 50 wigs - most of them too small. Only two fitted - but they were absolutely horrible. It's overwhelming. The girl in the big shop did try to help me, took her time and was reasonably emphatic. However she wasn't helpful in suggesting any solutions for me - just apologized that the brands they had in the shop didn't have standard wigs my size. Made me so disappointed because I know that people travel quite long to get to this shop as they are known to have a large assortment. I have, however, made a new appointment with another store in a couple of days - and the shop keeper said she might have something for me. I hope so much that I get something acceptable or that she will have suggestions to customize it. I work with high school students - none of them and only a few of my colleges know that I'm ill. Now I will show the world. Hate it! I think bald is fine - if you're young and beautiful. But I'm sure they wouldn't appreciate the baldness on my job, and right now I'm not in the mood to make a statement and be bold! The hospital did tell me that it's not possible to use cold caps/gloves/shoes. The reason is that the it takes about an hour longer for the IV with the cold caps - and they don't have time, space or personnel for this. Yes, the pain in my liver does remind me that I need to start treatment soon! ",
      "MessageIndex": 6182,
      "PostDate": "10/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Oct 26, 2017 05:39PM lisbet54 wrote: Hi Wendy Thanks. I know that neuropathy can come after you finished. But I also know that some get neuropathy, others not. Older women (my category) are the ones who most often get it and they also get it more seriously (knowledge from a statistic) My question: If you are rather 'stricken' already after 1. dose - does it indicate that you're a strong candidate for a quite serious neuropathy - or might it just be a coincidence? (because I've been told that neuropathy usually comes later when toxicity has built up)",
      "MessageIndex": 6350,
      "PostDate": "26/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Oct 1, 2017 06:45PM lisbet54 wrote: Thank you for all the replies. It's overwhelming that I meet so much friendliness! I will call the hospital tomorrow (Monday) to see what can be worked out about transportation. The info I got with me home on taxol seems to be lacking some drug names. It says I will have IV prednisolon, Tavegyl (doesn't say what this drug is for?), Zantac (doesn't say what this if for) - then taxol. And drugs against nausea - doesn't state drug names. When I call I will ask the nurse if it's possible to skip the drug that makes me drousy so I can drive myself. It's not really a solution to stay overnight in the city because of my animals. Also it's too time consuming. Right now I'm also scared that I cannot keep my job - that would add financial worries to everything else. I can ask a neighbour once in a while to help me out with small stuff - but as the weekly taxol will be permanent - that would make it 52 days a year (should I be so lucky that it works!). I cannot ask anybody not related to me to do me those kind of favors. I have to make a little room for needing favors if I get really sick and dying. I'll see what can be worked out. I'm glad some of you chimed in that you didn't have that many SE on taxol. Nkb - thank you for clarifying your SE. Your initial post scared me. I'll spend the coming week looking out for transport, talking to the hospital about drugs, looking at wigs/hats and permanent make up for eye brows and eyes. I never thought I would find myself in this situation. Really grieving at the prospect loosing all my hair and afraid I'll be isolating myself due to becoming so ugly. Maybe a small thing - but this disease seems to be all about loosing everything little by little! LindaE54: Yes, I was also offered epirubicin as an alternative to taxol - should it not be possible for me to do the weekly thing. But both doctor and nurses made no secret that the wise choice would be taxol - and then spare epirubicin for the case that taxol doesn't work. Also it will only be possible to do epirubicin for 9 cycles to avoid too much damage on the heart pump. So when you finish the 9 cycles you can never have it again - and then I would be left with taxol anyway. Epirubicin would also have more SE than taxol because the dose would be larger as it administered every 3rd week compared to the weekly smaller dose. However, if it's impossible to solve the transport problem I may have to choose epirubicin - only going every 3rd week would make it easier to ask someone to help me out. I hope the drug works out fine for you - and I will be looking for your coming thread on this drug. LindaE54, you mention you drove yourself to the hospital anyway. I am thinking of doing something like this too - but not sure if it's legal? I have a 45-60 minute drive to the hospital. However, most of the drive is on the highway so I cannot stop if I suddenly get a turn. I'll let you know how everything works out. So glad that so many of you took the time to ease my worries and fear. It's still there but good to know that you have people who understand you back you up! Wendy3 - wishing you all the best news after the scan! ",
      "MessageIndex": 6025,
      "PostDate": "01/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Oct 10, 2017 12:14PM lisbet54 wrote: I'm just kicking in with info where I'm at right now. I'm following the thread, but so many things are going on all the time and I have had friends staying over for some days. I still haven't started my taxol-treatments. I arranged with the hospital that I should get a wig - and then the weekly treatments would start. Shock - I cannot get a wig that easily. Turns out that I apparently have an 'enormous' head. The largest wig shop in the county don't have any usable wigs my size (I have never been able to buy a hat - they were always way too small. But hadn't anticipated that that would go for wigs too). Right now I don't know what to do. Don't want to wear a scarf - it's so ugly! I can have a personally made wig - but it will take 3 months before it's ready for me - besides it's terrible expensive. The doctor said I will be on chemo for the rest of my life - which makes me consider having a real hair wig glued on with surgical glue. The glue is made for skin and there's no risk. You go to the wig shop every month and get the scalp and wig cleansed and it's glued on again. Every 4 month you get a new wig. However, it's also a very expensive solution and I don't know if I'm a candidate as this solution is mainly used by those with alopecia. However if I'm never getting my hair back this might be a very attractive solution as I will also avoid having to look at my bald head mornings and evenings. You wear the wig 24/7 - even in the swimming pool. Has anyone tried this solution? But having this custom made will also take some time! Except for occasional sharp pains in my liver I'm feeling so good at the moment. All medicine is now out of my body - and I don't want to think about becoming sick and tired and all kinds of possible SE when I start taxol.I hope to start treatments in a week - but just don't know what to do about my hair. Sorry to kick in with such small problems right now as I know so many of you have been through this before - but right now it's such a big thing for me. I just never thought getting a hair replacement would be that difficult.",
      "MessageIndex": 6178,
      "PostDate": "10/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Dec 7, 2017 09:06AM lisbet54 wrote: Kaayborg - thanks for responding to my question. I cannot have an early scan because it's still too soon after my latest scan. I so hope for you that you will get the mets under control again - for a very long time! Shetlandpony - yes I hope for dying mets BUT just after being diagnosed I was put on faslodex/ibrance for 2½ month. After one month I had heavy liver pains - and hoped that it meant that they were dying. The next scan showed that the mets had almost exploded from being few and rather small to now filling up the liver and grown together so they couldn't be distinguished anymore. The combination of F/I hadn't been working at all. The pain now feels exactly the same. Hope is such a scary feeling. When crushed it hurts so much! The nurse who gave me the chemo yesterday said I was receiving palliative treatment - and had to weigh carefully between the damages from the treatment and pain from the illness. I was chocked. The doctors didn't use the word 'palliative' to me (though they weren't personal at all or encouraging either). But maybe all MBC-treatment is categorized as 'palliative'? Is that so? Bluebird - I feel for you! Hope you have a solution soon for further treatment. What is the raspberry powder and raw hemp oil good for? What is the theory behind this combination in relation to liver pains?",
      "MessageIndex": 6891,
      "PostDate": "07/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Mar 13, 2019 06:59PM lisbet54 wrote: Hi Xeloda (capecitabine) failed me. Been on it since October last year. Mets didn't shrink at all - and now they are growing again. I only have liver mets. Before xeloda I had taxol (failed me - and too many SE) and faslodex/ibrance (didn't work at all) and letrozol (didn't work). So far nothing has really been able to stop my liver mets from growing and be stable. I'm loosing hope and getting afraid that nothing will work on me as I haven't had any success with anything since diagnosis (May 2017). Liver quite full of \"undefined\" mets - biggest around 7 cm. They seem to be quite aggressive. Anyone in the same situation - and did you find something to help you? If so, which drug?",
      "MessageIndex": 10812,
      "PostDate": "13/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Mar 14, 2019 12:05PM - edited Mar 14, 2019 12:14PM by lisbet54 Hi Thank you for your answers. Grannax and Miaomix: I have asked a couple of oncologist about y90 - they both said that I'm not a candidate for this treatment. My liver numbers have been rising the last 6 months - the naming of these is not the same as in US, so I don't know what they're called in English. I've had quite many liver pains for the last year. Two months ago I started up on tramadol. The mets are pressing on other organs and now the pain is constant. Other than that I don't have any symptoms - I think.....Occasionally I'm very tired, but it may also be a SE from xeloda. From the very start of my diagnosis my mets were \"innumerable and undefined\" - so I have never been a candidate for surgery. This last year they have been very aggressive - latest scan (January) showed that the largest has been growing from 1 cm to 7 and several others growing to around 3-4 cm (since May 2018). There were no growth in the largest mets (from November scan), but several of the smaller mets had been growing. Oncologist said this might indicate mutation, but she wanted to wait until next scan to change my treatment. I'm in for a new scan in April - but I'm quite sure that they have grown since January, as my liver pain is now constant and I have to take tramadol every day. I haven't been explicitly told that there is nothing more to do - but I fear that this day is approaching very fast as so far nothing has been able to stop the growth.",
      "MessageIndex": 10820,
      "PostDate": "14/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "lisbet54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253908/profile",
      "Content": "Mar 14, 2019 06:05PM lisbet54 wrote: Hi Thank you for taking the time to answer. I don't know what options I have. I don't have my own oncologist - but the hospital has a team of doctors, so I never know which one I'll talk to. Unfortunately we don't have the same options here to choose our own treatment. I have looked into trials. I'm Her2- and ER+. Trials available at the moment are for tripleN and HER2+ . *And I don't think I can move my scan at the moment, as there are waiting lists. I'll ask for a new biopsy when I see my doctor again. It does scare me that you, Shetlandpony, think that waiting is risky. And I had hoped that there were people here who had been in my situation and had the picture turned around. This is a terrible disease - and I know that I have read about persons here where things went very quickly. I fear this is my situation. It's really difficult to be hopeful and optimistic.",
      "MessageIndex": 10825,
      "PostDate": "14/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    }
  ]
}