{
  "AuthorID": "lishka",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60129/profile",
  "Posts": [
    {
      "AuthorID": "lishka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60129/profile",
      "Content": "lishka wrote: Hi ladies, Finally my biopsy results are in. I went to the surgeon today and she gave me the good news of my lump being a Fibroadenoma, I just wanted to say thank you to all of the ladies out there that have helped me along the way, I wish you all the best of luck, happiness and love. I will keep coming to this site from time to time to see how you are all doing, once again I thank you for your support Great big hugs and kisses Lishka Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/698918",
      "Title": "My biopsy results are back lishka Germanlady"
    },
    {
      "AuthorID": "lishka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60129/profile",
      "Content": "Jan 22, 2008 07:35AM lishka wrote: Thanks Ladies you are all wonderful, I do have to go back in 6mths but I am not complaining. Lots of love Lishka",
      "MessageIndex": 7,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/698918",
      "Title": "My biopsy results are back lishka Germanlady"
    },
    {
      "AuthorID": "lishka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60129/profile",
      "Content": "Dec 5, 2007 12:03PM lishka wrote: Dear Blackbird, I am so upset for you that the system made you wait for so long, I am also a kiwi but live in Aus, it makes me sad knowing that you didn't have anyone to support you and that the nurse just came out with your results over the phone like that, but you have people here that will atleast be a source of comfort in some way, it may not be face to face support but it's a great listening post, I am waiting for results and this site has been wonderful, best of luck blackbird and please keep in touch Lishka",
      "MessageIndex": 26,
      "PostDate": "05/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/696300",
      "Title": "so scared irishsteph blackbird"
    }
  ]
}