{
  "AuthorID": "lissette",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
  "Posts": [
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Dec 21, 2009 10:37AM lissette wrote: Hey Ladies, Started rads in Dec and finish in Jan. Thanks for posting, it was really good to read info from people who are just a little ahead of me. It helps me know I can get thru this. Congrats on finishing. This is my last step (except for nipple tattoo) and I am sooo looking forward to finishing already!",
      "MessageIndex": 399,
      "PostDate": "21/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/742602",
      "Title": "November Rads 2009 amlg1 EngTchr"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Dec 21, 2009 10:36AM lissette wrote: Hey Ladies, Started rads in Dec and finish in Jan. Thanks for posting, it was really good to read info from people who are just a little ahead of me. It helps me know I can get thru this. Congrats on finishing. This is my last step (except for nipple tattoo) and I am sooo looking forward to finishing already!",
      "MessageIndex": 398,
      "PostDate": "21/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/742602",
      "Title": "November Rads 2009 amlg1 EngTchr"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Apr 22, 2009 07:05PM lissette wrote: Good to hear someone else is going through this.  I am going to start the fertility stuff after chemo.  I am already on my second AC but I couldn't wait to start it.  I also am in a fairly new relationship so the embryo thing is not an option, but the fert spec is suggesting a go to a sperm bank.  Not sure what to do.  She says the egg thing is experimental and didn't offer to have the ovary removed... I'd like to know your thoughts.",
      "MessageIndex": 410,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "May 4, 2009 10:17PM lissette wrote: tulipbebe- My onc said definitely use condoms because the chemo can secrete and burn.  I didn't have the nerve to ask about oral sex.  It doesn't matter since I'm single and the guy I was dating disappeared when I told him about my dx.  But it provided a good laugh!  You should ask your onc about the sex...",
      "MessageIndex": 616,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Dec 21, 2009 02:07PM lissette wrote: Hi Ladies, I am joining late. I have #11 of 25 today. I'm a teacher and have had a hard time keeping up with work (report cards, conferences, holiday stuff) but am off for 2 weeks so I'll have time to check in now. Can you believe the rad tech asked me if I was going away on vacation for these weeks? I said, \"No. Just going tanning everyday.\". He's gotten on my nerves since day 1. The other tech is adorable though. Is it wrong to hit on him? Lol. Looking forward to sharing and learning from you all!",
      "MessageIndex": 135,
      "PostDate": "21/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Dec 30, 2009 01:37PM lissette wrote: Hey ladies! Sorry for the neglect. My computer crashed. Then it took me a while to read everything. But I'm all caught up now! Happy Holidays! Mimi- sorry about the insurance problems. It's an added stress you shouldn't have to deal with. My docs on vacation this week so I have a fill in. We'll see how it goes. I get weighed today. I've been gaining weight despite my healthy eating and working out almost everyday. We'll see what the scale says today. :-( You're all so lucky you have husbands. It's nice you have someone to go through it with you. I am single and my family is far away. I have friends who help out and my family takes shifts visiting but not 1 consistent person who's on the journey with me. No one's visiting for rads since this is the easy part. Chemo and surgeries were where I needed help. I am doing 25 rads but don't know anything about \"grays\". I'll ask the doc today. No boosts because I had reconstruction already and they said it'll mess up the implant. You're so right about doctors not telling you anything. I switched oncologists because of that early on. Ugh. So frustrating. Why do they keep us in the dark? I've done 16 (9 to go!) And am a little red and a little sore. Been using calendula and aquaphor religiously. My doc says aloe doesn't do anything. We'll see how my skin holds out.",
      "MessageIndex": 196,
      "PostDate": "30/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Dec 31, 2009 05:35PM lissette wrote: Hey Renee- that's awesome you have such a big family so young! You get to actually enjoy them. Maybe I'll meet an older man with kids. Keep your fingers crossed! Somanywomen- I deliberately took the ink off a few times because I wanted to wear low cut tops and the techs got upset. I just said it washed off. Whatever- it's part of their job. Let us know how the emu oil and the calendula work. I'll try anything that helps! I'm sorry about the pain. I don't really feel much after the mastectomy so who knows? Happy new year lovely ladies! 2010 is gonna be a good one now that 2009 is behind us. :-)",
      "MessageIndex": 216,
      "PostDate": "31/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Jan 29, 2010 10:39PM lissette wrote: Hey ladies! This past week has been crazy! Sooo tired. The silverdene creme is great. My doc gave me 3 refills and I've been slathering it on with aquaphor. My skin is peeling and looks good under! My scars are even looking good (from mastectomy and fipple). Sorry to hear about all the bills. It sucks to deal with money on top of everything else. Hope it works out for you all. Angel- it's crazy when docs don't know much about a particular group. Are you part of YSC? I've loved learning with, from and leaning on the wonderful women in the group.",
      "MessageIndex": 500,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Dec 31, 2009 03:01PM lissette wrote: Hey Ladies- 18 down 7 to go! Yay! I had a 645 appt today. Ugh! But I made it. I'm glad to have 3 days off to allow my skin to recover. Renee? Mimi?- I'm all red in the radiated area, up to the collarbone. It's not terribly noticeable but I see it. Just like a slight suntan. I had my port removed Nov 5 when I had exchange surgery. You can still see the scar. I could lift things about 2 or 3 days later on that side. It's the lump side that's uncomfortable. :-(",
      "MessageIndex": 212,
      "PostDate": "31/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Dec 31, 2009 03:05PM - edited Dec 31, 2009 03:46PM by lissette",
      "MessageIndex": 213,
      "PostDate": "31/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Jan 10, 2010 05:04PM lissette wrote: The problem with being triple negative is that you can't take anything to help keep the cancer away. It's basically like the cancer literally comes from nowhere and is always aggressive. The prognosis is poor in the first 5 years compared to positive women because they are taking something so of course they're chances are lower for recurrence while on hormone therapy. But honestly, the risk of it coming back is not significantly higher. I think I read it's about 10%. The good news is that after 3 years the risk drops significantly. After 5 years, the risk of recurrence diminishes to almost 0; whereas, hormone positive women always have a risk of recurrence. My doctor says you're basically \"cured\" after 5 years with no recurrence.",
      "MessageIndex": 305,
      "PostDate": "10/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Jan 3, 2010 02:30PM lissette wrote: Hey Renee, enjoy your Christmas dinner. That's nice! I'm in northern Cali. A bit chilly here but not bad. It's really sunny. About to go for a run then go into work to prepare for the kiddos tomorrow. 2 weeks flew by which is great because it's 2 weeks down of rads. :-) I'm getting a little red and patchy in spots. I think it's because I switched to calendula oil instead of cream. It has olive oil. Apparently not good on my skin! Awful! I'm back to calendula lotion and aquaphor. :-( How's the emu oil? Worth trying? Let me know. I'm down to the last 7. Does anyone know how badly the last ones burn? Ugh!",
      "MessageIndex": 238,
      "PostDate": "03/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Jan 12, 2010 11:52PM lissette wrote: I'm finished!!! I can't believe it. It feels like forever but at the same time I can't believe I'm already done. I'm pretty burnt and my fipple's withered but I made it and worked through it all! Wow! I just hope my implant holds up and I don't get scar tissue. Nurse told me to put on tons of aquafor and I will. Thank you, thank you, thank you for getting me through. I'll stay on here, of course, until we're all done. You can all do it! Whew! About cording: I had it bad. Did phys therapy and it helped. But then I had my exchange surgery and it was gone! Funny thing was docs all told me they didn't know what it could be. BTW- I got my period today! So excited since I don't have kids and doc said I may or may not get my period again. 12 weeks after chemo and it's back! Guess I need to start looking for a sperm donor. Lol. Really, I'm just hoping the facial hair'll thin. ;-) One more down ladies! You can do it!",
      "MessageIndex": 328,
      "PostDate": "12/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Jan 14, 2010 07:50AM lissette wrote: Hi ladies. It was so odd to not have to go to radiation yesterday! My skin is super tight, very dark with black spots. Ick! It hurts and is itchy. The nurse told me to lather on the aguaphor. I'm using that and the burn cream. I'll keep you posted. I went to the eye doctor yesterday because I've been having trouble with my contacts since chemo. Turns out my astigmatism got worse and I have some other minor issues. Nothing had changed for 7 years- it has to be the chemo! Sorry to hear about the peeling and blistering. Ouch! I'm sending you all good, healing vibes! One less to go- hang in there.",
      "MessageIndex": 340,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Jun 13, 2010 07:54PM lissette wrote: You should have it checked.  I found my first lumps when I was 16.  THey were nothing.  Found more when I was 25.  Again nothing.  Then another one when I was 32.  That one was cancer and it took a while before they even realized it- because I had small, dense breasts.  Anyway, it doesn't hurt to have these things checked and monitored. ",
      "MessageIndex": 3,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754064",
      "Title": "Normal? Or should I be worried.. ggirl1159 barbe1958"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Jan 4, 2010 09:59AM lissette wrote: Ugh back to work today and #19... Bonnie- glad you enjoyed the weather. It was beautiful in Oakland too. Supposed to be a great day today as well. Yay! I have been working out as much as possible through treatment. During chemo I walked 3-6 miles every day. I still gained weight but not too bad. I live near lake merritt so it's easy to get out and exercise daily. Adrienne- thanks for the hug. I'll let you know how it goes. Maybe my skin was just ready to burn and had nothing to do with the oil. Who knows? Renee- it's interesting your doc said you'll feel the difference in your lungs. Mine said I won't even though 2 parts of my lung are exposed. I swear I had trouble breathing during my run, hmm... And my doc doesn't even look at me, let alone touch me. He looked at my skin last week because I asked him to. All doctors are different though. My reg onc would do a breast exam every time I saw her. When I switched to a male, he said there was no need to. I wonder what other people's experience is. Have a great day everyone!",
      "MessageIndex": 243,
      "PostDate": "04/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Jan 9, 2010 01:49PM lissette wrote: Hey Ladies! Just 2 more to go! Yay! I'm not doing any hormones because my cancer is hormone negative so it doesn't make sense to take anything that inhibits hormones. Here's a place where negative is really a bad thing. Lol. It's pretty unique being a triple negative. We're a separate group. Jules- I'm pretty sure that's why you're not getting hormone therapy. Adrienne- I'm glad your burns seem to get better. My burns get worse each day. Congratulations on being 1/3 of the way through. Somanywomen- your description of your experience is quite interesting. Lightning bolts... Is that painful? Hot? Glad the itching isn't too bad. The doc gave me hydracortizone but I haven't been using it since it's not too itchy for me either and I'm using burn cream. Ok ladies. Hope this 2 day break gives your skin time to heal!",
      "MessageIndex": 299,
      "PostDate": "09/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Jan 17, 2010 09:53PM lissette wrote: Hi ladies. Thanks for all the great info and the laughs. I had heard that low levels of vitamin d are also responsible for depression and insomnia (as well as cancer). I read low fat, 30 min a day of exercise, no chemicals and lots of fruits and veggies. I can't believe we have more to deal with after this. I celebrated this weekend with friends in ny. I got my first swedish massage. Was worried about lying on my stomach but just propped it with a towel. It was awesome. My skin is starting to peel and there's dark skin under but at least it's soft. Good thing it's winter because I've had to wear a turtle neck or scarf to cover the burning on the neck. Hope everyone enjoyed the weekend. Renee, I had never heard about rads taking 30 days to leave the body and I read your post and was shocked. Thanks for clearing that up.",
      "MessageIndex": 385,
      "PostDate": "17/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Dec 21, 2009 02:08PM lissette wrote: Hi Ladies, I am joining late. I have #11 of 25 today. I'm a teacher and have had a hard time keeping up with work (report cards, conferences, holiday stuff) but am off for 2 weeks so I'll have time to check in now. Can you believe the rad tech asked me if I was going away on vacation for these weeks? I said, \"No. Just going tanning everyday.\". He's gotten on my nerves since day 1. The other tech is adorable though. Is it wrong to hit on him? Lol. Looking forward to sharing and learning from you all!",
      "MessageIndex": 136,
      "PostDate": "21/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Dec 30, 2009 04:06PM lissette wrote: I don't know about zometa but I had my port removed right away. It heals pretty quickly. I'm sure ypou can do it during rads but it's so annoying to go everyday you'll probably want to limit your apptsduring radiation. Good luck!",
      "MessageIndex": 198,
      "PostDate": "30/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Jan 1, 2010 02:54PM lissette wrote: Happy New Year ladies! Renee- Thanks for the confidence boost! Lol Jules- it's interesting that your tumor was sore. Mine was too and the docs told me that was a good thing because cancer \"doesn't hurt.\" Sure! Somanywomen- I heard about holding your breath during rads to protect your heart. My doc said I don't have to because they were able to shield my heart during treatment. He showed me the plan. Pretty cool. I guess last night was pizza night. That's what I had for dinner too. I wish the doctors would just tell us what to do. It's so frustrating trying all these remedies and not knowing what the effect will be.",
      "MessageIndex": 228,
      "PostDate": "01/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Jan 6, 2010 10:55PM lissette wrote: Hi everyone. Veggy- glad you had it taken care of. Sorry about the delay. It's amazing you were able to drive- you're so strong! Good thing for your husband. The gauze changing must be tough! My skin's pretty bad today. It started to burn badly yesterday #20 and now #21 really hurts. I saw my doc and he gave me a prescriptiuon which I pick up tomorrow. :-( I was really hoping it wouldn't get bad, but boy does it hurt! Only 4 left. Wish me luck and not too much worse burning.",
      "MessageIndex": 273,
      "PostDate": "06/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Jan 8, 2010 06:59AM lissette wrote: Can't sleep. Ouch! Ouch! Ouch! My doctor gave me silver sulfadiazine. He originally told me it shouldn't get bad and then when I saw him, he said it all looked about right. One of the techs told me she's seen way worse and that I was only a 6 on a 10 scale. Looks and feels like a 10 to me. I'm not wearing a bra at all, but it doesn't seem to help. Only 3 to go, but they said it continues to burn for up to a week after. No boosts and no hormones for me so I'm all done after this. It's actually a bit scary. Nothing to do but sit and wait afterwards. Hope no one's feeling any worse- only better!",
      "MessageIndex": 289,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Jan 10, 2010 11:27PM lissette wrote: Renee, I'm sorry to hear about everything you've been through. After all that bc must be a breeze! I think you're right about the stress though. I think for me it was more the unhealthy eating. But who knows? My onc is great. I had one I didn't like. She treated me like she felt sorry for me, gave me wrong info on several occassions and let my surgeons boss her around. I had to ask for things over and over. I complained and they set me up with this guy. He's very straight forward, opinionated and follows through. A much better fit for me. :-)",
      "MessageIndex": 307,
      "PostDate": "10/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "lissette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80901/profile",
      "Content": "Jan 21, 2010 04:57PM lissette wrote: Hi Ladies!  Veggy- Don't worry about rads.  Of course you can do it.  It''s really not so bad.  We just complain to each other on here- but it's totally doable.  Just annoying more than anything. Mimi- So sorry about your grandma.  It must be tough and uncomfortable- hang in there! So far, I'm healing ok.  Skin is peeling and the silverdene cream the doc gave me is great.  I've already gone through 2 bottles.  lol  I have one refill left but I think I'll just ask for another if needed. Did anyone else do radiation with an implant?  Mine is holding up great and just wondering what other people's experiences are???",
      "MessageIndex": 423,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    }
  ]
}