{
  "AuthorID": "listmaker",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99777/profile",
  "Posts": [
    {
      "AuthorID": "listmaker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99777/profile",
      "Content": "Aug 22, 2010 12:40PM listmaker wrote: heartnsoul7- as my name says I make lots of lists, I started reading these boards as soon as I was diagnosed and began my lists. For radiation I learned about 100% Aloe Vera Gel from Fruit of the Earth, got it at Wal-mart. It's clear and says no alcohol. Took that with me to every treatment and put it on in the changing room after. Also used it at night after my shower. It was very cooling and as I said I didn't burn at all. You will stick to your bra though if you don't let it dry before dressing - ha. The yearly body check is a piece of cake, sign in-donate your co-pay and you're out in 15 min. Stress is definitely our enemy but staying calm is so hard to do. Aloha!",
      "MessageIndex": 32,
      "PostDate": "22/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754362",
      "Title": "anyone out there with auto-immune/chronic pain issues before dx? jessamine SuzyBlue"
    },
    {
      "AuthorID": "listmaker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99777/profile",
      "Content": "Aug 21, 2010 09:07PM - edited Aug 21, 2010 09:08PM by listmaker Squidwitch42: My doctor is at the University of Louisville medical facility in Louisville, Kentucky. I live out of the city and thought about switching to a rheumatologist nearer to home but the other options were not as approachable or helpful. I haven't seen him since my diagnosis in January but he did call me back when I was worried about radiation and the auto-immune disease. He was very comforting and put my mind at ease about possible burning and it turned out I had absolutely no problems with radiation, not even pink. I think I'm going to tell him about our discussion and see if he knows of studies in this area or if he might be interested in further investigation. I'll keep you posted, I\"m hoping to get an appointment the first of September. ",
      "MessageIndex": 29,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754362",
      "Title": "anyone out there with auto-immune/chronic pain issues before dx? jessamine SuzyBlue"
    },
    {
      "AuthorID": "listmaker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99777/profile",
      "Content": "Aug 21, 2010 12:38PM listmaker wrote: Hi all, I just found this thread. I too have an auto immune disease, \"mixed connective tissue disease\", I think it's called that because they aren't really sure what I have but I have a positive ANA with a myriad of joint pain related symptoms. I have been seeing a rheumatologist for 10 years or so and \"soulswithin\" I had Melanoma in 1996, mole involvement only, no margins, no treatment other than surgery. I've been on Arimidex for 4 months and all the pain I've been treating with Plaquenil (200mg/day) has returned but worse. So I'm with you guys that there is an added concern for us because the medication we take to control the joint troubles and then we add in the BC meds and they have to conflict with the joint meds. I'm not due to see my rheumatologist for another couple of months but I think I'm going to make an appointment to discuss this with him. He's at a teaching hospital and is very open to my suggestions for certain blood tests or my needing to look deeper into something. \"jessamine\" thanks for starting the post. ",
      "MessageIndex": 26,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754362",
      "Title": "anyone out there with auto-immune/chronic pain issues before dx? jessamine SuzyBlue"
    },
    {
      "AuthorID": "listmaker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99777/profile",
      "Content": "Sep 9, 2010 10:12AM listmaker wrote: I had my annual appointment yesterday with my rheumatologist. This was the first time I had seen him since my BC diagnosis. He is so great and talked to me for a half an hour. We are staying with my current medication, Plaquenil, which he feels strongly is helping me keep some of the SE's of A at bay rignt now. We also discussed the people of this forum who seem to have both and he was honestly surprised and said he is going to do some informal research and get back to me.  heartnsoul7: so sorry about your shingles but for the rest of us there is a vaccine that we need to take and it has to be taken before your first outbreak of shingles. It is a live virus which means that you will have to be off your auto-immune medication for enough time for it to get out of your system before taking the vaccination. For me with Plaquenil this would be around 3 months. I think I can do that so I'm planning now for when. Again heartnsoul7, so so sorry for your pain with this, my mother-in-law has had it many times over the last 30 years and it is awful pain for her.  ",
      "MessageIndex": 58,
      "PostDate": "09/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754362",
      "Title": "anyone out there with auto-immune/chronic pain issues before dx? jessamine SuzyBlue"
    },
    {
      "AuthorID": "listmaker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99777/profile",
      "Content": "Sep 9, 2010 02:12PM listmaker wrote: ICanDoThis--Thanks for that information, my mother-in-laws doctor told her this several years ago after one of many outbreaks and she has not asked again for it. Even at 91 I am sure she will want to get it rather than have another outbreak. I am however baffled that my doctor didn't mention this to me yesterday. I had said that I knew I needed to get the vaccine before I had an outbreak and he said yes, however, we were talking about so much at once he may have just misunderstood me in conversation. My mother-in-law thanks you for the information and I am sure it will be totally paid for under her medicare and insurance.",
      "MessageIndex": 61,
      "PostDate": "09/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754362",
      "Title": "anyone out there with auto-immune/chronic pain issues before dx? jessamine SuzyBlue"
    }
  ]
}