{
  "AuthorID": "LittleC",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
  "Posts": [
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Jun 27, 2008 01:57PM LittleC wrote: Saw your story and I keep checking back & will till you let everyone know how you are doing! My prayers to you! ",
      "MessageIndex": 173,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/706997",
      "Title": "not good you guys Fitztwins Lindaip"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "LittleC wrote: I've had this happen a couple of times, and I'm left just sitting there with my head spinning... People have told me \"you are over treated\" to my face.... When I hear that it just boils my blood. They don't even ask my DX and just assume breast cancer isn't serious especially if it's caught early. (I'm 3C possibly 4, I had lung tumors, and other places). It's still carcinoma.  They just assume they are the end all, know all and don't let me get a word in edgewise, rather talk all about themselves and end the conversation by walking away. Of the people that were \"under treated\" and lower stages, I wonder if the reoccurrence rate is higher? Or the same? ~carol~ Dx 2/2008, IDC, Stage IIIC, Grade 3, 27/30 nodes, mets, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743553",
      "Title": "Stage 3 and 4 over treated? RANT LittleC lorieg"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Nov 11, 2009 09:36AM LittleC wrote: Diana / kim / sherri - AMEN. Hit me with your best shot doc and don't stop till we've done it all! Sherrypl: good one. I like that. Very diplomatic. Bev - don't be sorry! I agree with you on every point. I'm sorry you have to deal with anti-chemo people. I had one like that. she kept telling me the chemo will kill me. It's poison. It's like, what the hell? You want me to just lay down and die instead? I had to get away from that one till I was finished with tx. Even though she was my best friend. She wanted to help the only way she could, but I wasn't about to go along with an \"underground plan\" we don't know who some of the nut-jobs are out there claiming they can cure cancer. The best we can do is the best we can do! Clariceak - ouch on the wbc. But I can certainly understand wanting to press ahead and not miss any doses! Wow, I think I just became thankful that I don't have to travel as far as you do!!!! That has got to be beyond hard! Keep your chin up! When are your treatments going to be finished? Leah - totally! Don't cut the dose! Just help manage the pain! Brenda - hee hee I like that one. I'm not usually that kind of person, but in that instance, I was ticked and deeply hurt. That could have made me feel better. Barbara /BMac - I'm so sorry you've gone through this twice already!",
      "MessageIndex": 29,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743553",
      "Title": "Stage 3 and 4 over treated? RANT LittleC lorieg"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Nov 9, 2009 05:52PM LittleC wrote: Yes, amazing aren't they?  And believe it or not, one of the one's that made this statment, that huffed away from me after being so bold as to make assumptions, had breast cancer herself.  I'm guessing a stage 0 or 1.  She didn't have chemo, and was proud of her new boobs and didn't give a damn that some people really only have 2 choices.  Chemo, or less time.  Which is why I wonder, if lesser stage people have more reoccurance, if they didn't have full blown dose dence tx and long term pills etc....",
      "MessageIndex": 7,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743553",
      "Title": "Stage 3 and 4 over treated? RANT LittleC lorieg"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "LittleC wrote: I've had this happen a couple of times, and I'm left just sitting there with my head spinning... People have told me \"you are over treated\" to my face.... When I hear that it just boils my blood. They don't even ask my DX and just assume breast cancer isn't serious especially if it's caught early. (I'm 3C possibly 4, I had lung tumors, and other places). It's still carcinoma.  They just assume they are the end all, know all and don't let me get a word in edgewise, rather talk all about themselves and end the conversation by walking away. Of the people that were \"under treated\" and lower stages, I wonder if the reoccurrence rate is higher? Or the same? ~carol~ Dx 2/2008, IDC, Stage IIIC, Grade 3, 27/30 nodes, mets, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743553",
      "Title": "Stage 3 and 4 over treated? RANT LittleC lorieg"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Nov 9, 2009 09:58AM LittleC wrote: normally I do.  But for some reason it is really getting under my skin.  Thanks Helena.",
      "MessageIndex": 2,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743553",
      "Title": "Stage 3 and 4 over treated? RANT LittleC lorieg"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Nov 9, 2009 10:21AM LittleC wrote: Thanks you guys!   ha ha  \"I see stupid people\"   ha ha ha ha",
      "MessageIndex": 4,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743553",
      "Title": "Stage 3 and 4 over treated? RANT LittleC lorieg"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Nov 10, 2009 08:24AM - edited Nov 10, 2009 08:43AM by LittleC Jacqueline - Thank you for your comment. I agree. I wouldn't have had it any other way either. There will be no \"what if's\" when you've done everything you could.  Brenda - I would have loved to tell her to talk to my Onc. But alas, she had no interest. It drove me nuts too. I'm not the type to back down, and am rather a control freak. She had control of me at that moment and I really didn't like it one bit. TammyLou - I really didn't get the impression that she felt guilt. My impression was \"one for all and all for me\" no sisterhood there at all. I was even going to ask her more about her... try to bond... but I guess she wanted nothing to do with it. Which I can understand. Sometimes I stay away from the bc boards when I want to ignore reality. And I agree, my tombstone won't read that either! Kerry - I agree with you too. I'm always wondering what else I can do, even though I'm doing it all!",
      "MessageIndex": 13,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743553",
      "Title": "Stage 3 and 4 over treated? RANT LittleC lorieg"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Nov 11, 2009 10:25AM - edited Nov 11, 2009 10:27AM by LittleC Sherri - I find myself with similar feeling. Me, If they didn't have chemo, I really can't identify with them. I know they have the same fears, but the beating our bodies take on that crap, and all the downs that go with it, long term effects that may never go away... but again, glad to be alive.",
      "MessageIndex": 32,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743553",
      "Title": "Stage 3 and 4 over treated? RANT LittleC lorieg"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Jun 27, 2008 01:42PM - edited Jun 27, 2008 01:47PM by LittleC Hi Passenger 54, I had an auxiliary -  30 nodes removed.  The first night was difficult, but once they got the pain under control I felt better. The next day I was much better just to go home! And I agree with  SherryG, most of it is the nerves. Just remember to tell them you need pain control!  Keep nagging until you get it managed.  Don't let up & don't try to tough it out.  Tell them if you need something stronger.  You don't need to tough it out with all that you have on your mind right now! They wanted to send me home with Vicodin, but that does nothing but give me nightmares.  I went home with Darvocet.  I took those & advil.  Propped my arm... Prayers to you on the upcoming biopsy. P.S. I had a drain tube for 3 weeks.  I didn't wear a bra for those 3 weeks.  Walked around with my daughter's stuffed animal under my arm pit which helped to cushion the arm.   ~carol~ Dx 2/2008, IDC, , Stage IIIc, Grade 3, 27/30 nodes, ER+/PR+, HER2-",
      "MessageIndex": 2,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/708156",
      "Title": "more surgery Passenger59 sue_m"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Jul 15, 2008 07:35PM LittleC wrote: That is so many surgeries in such a short time.  You poor thing! I've had quite  few myself, but at least they were spread out over a longer time period!  I'll be getting my ovaries out as well, but I've had problems with them since I was 18.and I am ER+.  I'm sorry, you didn't want to hear that really. Is it possible that they are swollen from being pre-menopausal? I know it is a scary thing. I've heard that is a much easier surgery to recover from then what you've already been through.   I'll be with you in spirit.  Breath.",
      "MessageIndex": 1,
      "PostDate": "15/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709126",
      "Title": "ER- and mets to ovaries?? mason204 mimi1030"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Nov 9, 2009 10:59AM LittleC wrote: One month after my 40th birthday. I'd felt a lump about 3 years earlier in my armpit/breast area. Gyn said, it's nothing. Turned out to be the location of tumor in the lymph node bigger then the tumor in the breast. First Chemo, on April Fool's Day.",
      "MessageIndex": 329,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Nov 13, 2009 11:54AM - edited Nov 13, 2009 12:06PM by LittleC I don't find this offencive at all.  I found it quite amuzing actually!  I think they are stabbing at media and all the crap that doesn't work.   Thing is, if you're going to get it you're going to get it.  Standing on your head chanting \"not me, not me\" isn't going to avoid it. Freedom of speach should be for all.  Not just some.  If you find it funny, keep reading it.  If you don't, simply, don't read it. And maybe I wouldn't have found this funny 2 years ago newly diagnosed. Would have been way too raw then. But, now, to me, it is humerous. That doesn't mean I'm not sorry about your wife.  Because I truly am.  I wish this on NO ONE. Marie317 - very good  & valid point!",
      "MessageIndex": 43,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/743602",
      "Title": "Upsetting satire on 'The Onion' about breast cancer kevinjennings Pat634"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Nov 13, 2009 12:15PM - edited Nov 13, 2009 12:18PM by LittleC I'd also like to add to the fact that this guy might be trying to just upset everyone....  if his wife has cancer, wouldn't he encourage her to be on this board?  and if she's 2 years out...  why would he post under \"newly diagnosed\" ?  To hurt the ones it would hurt the most. Maybe this whole thread should be removed.  BC.ORG you hear that?  don't ya think?",
      "MessageIndex": 44,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/743602",
      "Title": "Upsetting satire on 'The Onion' about breast cancer kevinjennings Pat634"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Jun 19, 2008 12:39PM - edited Jun 19, 2008 12:47PM by LittleC JULIE49 I know it's hard to keep from getting discouraged, you sound like you are working hard to keep a good attitude!  You do have good humor! Keep it up! I found a site with a slew of stage4 women, lots of bone mets... They've done really well for many years... If I come across it again, I'll let you know. BETTER YET - Maybe you could get them to start a Stage IV right here - next to stage III!",
      "MessageIndex": 22,
      "PostDate": "19/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/706653",
      "Title": "needing some hope ekenny315 Maryiz"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Jun 19, 2008 12:27PM LittleC wrote: It's getting even smaller. (I'm new to board today)  I'm in NW suburbs of Chicago as well.  I also went to University of Chicago for my surgery & a slew of tests.  I'm impressed as heck with that place!    It is so so important to be comfortable with your oncologist & surgeons. A doctor's positive & caring attitude helps US to maintain a positive attitude!   Diagnosed 1/08 Invasive Stage III/grade III Comedo - 27/30 node positive.  ER+HER2-  Getting ACT x 6 chemo closer to home, will get radiation & ovaries removed. I will be going back to UofC for all my check ups when the time comes.  The chemo is hitting me rather hard (I clotted & went through a medi port & 2 picc lines w/ 2 treatments left) & I'm hoping this is the hardest part.  It is very scary.  There are days I cry in the shower so hard the snot runs down my face (thank god for the shower water, hides the snot) because I worry, what will my daughter do without me? and there are days when I say, I'll be a part of changing the statistics of outcome for the better. ",
      "MessageIndex": 21,
      "PostDate": "19/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/706653",
      "Title": "needing some hope ekenny315 Maryiz"
    },
    {
      "AuthorID": "LittleC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68412/profile",
      "Content": "Nov 9, 2009 06:09PM LittleC wrote: Might I also suggest if they are checking... a CellSearch test (a simple blood test) which works differently then a tumor marker. It's been around quite some time, can be helpful, but we never heard about it until they developed it for prostrate cancer.  There's more I dug up on it here....  cellsearch-testing-cancer-cells.htm    I had theCellSearch twice.  It helped me. I did dose dense T & AC at the same time x 6 every 3 weeks. Good luck in the rest of your treatments!  ",
      "MessageIndex": 10,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743484",
      "Title": "Thoughts on taking break between Taxol and AC AnacortesGirl LittleC"
    }
  ]
}