{
  "AuthorID": "LittleSun",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192667/profile",
  "Posts": [
    {
      "AuthorID": "LittleSun",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192667/profile",
      "Content": "Oct 1, 2014 04:51PM LittleSun wrote: One more thing: getting someone else to cook for me was KEY. I could not take the smells of ANY foods at all and did not have the energy to stand long enough to cook anything. I put chairs all over the apartment so I could sit when I got dizzy or tired. One in shower too. And I'm in my twenties! Pls see if someone can make you light meals or at least do some grocery runs. Hugs, Littlesun",
      "MessageIndex": 24,
      "PostDate": "01/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824966",
      "Title": "So depressed, ready to quit! reader123 blondiex46"
    },
    {
      "AuthorID": "LittleSun",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192667/profile",
      "Content": "Oct 1, 2014 04:42PM LittleSun wrote: Hi Reader, I don't post a lot here but I read a lot, and I just wanted to respond to you. Sweetie, please don't give up. As others have said, AC chemo is hard, it is the big guns. But know that although it hits the body hard, sometimes it also works really, really well. I would warn you about constipation as others have said. For me, it got really really bad. I had the worst hemmorhoids of my life - but - eating smooth, soft foods like applesauce saved my life. Grains, meats, and nuts were a huge problem. In my case, all the anti nausea meds I tried did not touch my nausea, or increased my headaches & constipation and made me feel dehydrated. I never got Emend though, because honestly I decided to ignore the anti-N pills as they did nothing for me & made things worse. I would get dizzy on the train to work, lived in bed as much as I could, and could only sit next to my 3 year old son while he played with his dad ( & that was on the better days). It is normal to feel this way on AC. I truly believe that it affects your mind chemically and brings on depression, & your mood plummets. This happened to me. Eventually I literally took it 1 hour at a time and just kept saying to myself \"just keep on keeping on... Keep on keeping on.\" Oh yeah you will come to hate the red stuff, but after it is done, you will feel better. You will. Just take it one day at a time when you're in the valley. As hard as it is to remember, try to remember that this is being done to try to benefit and help you. It helped me and it may very well have good results for you. And it will be over one day! PS: I have a personal preference about not putting my condition down in writing but the stage etc - same as you. Love, Littlesun",
      "MessageIndex": 23,
      "PostDate": "01/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824966",
      "Title": "So depressed, ready to quit! reader123 blondiex46"
    },
    {
      "AuthorID": "LittleSun",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192667/profile",
      "Content": "Mar 18, 2015 05:28PM LittleSun wrote: Hi Patti, I don't post a lot but I'm st. 4, in the same boat with you ladies. I agree with the previous notes about not stopping xanax cold turkey, and not skipping doses because when you do that you are really throwing your body for a loop. A few things that might help: - In addition to the antidepressants, see if you can actually talk to someone - a counselor, social worker, psychiatrist, etc - on a set, regular basis. Just make sure you choose somebody who has experience with cancer specifically, because it brings its own unique set of challenges and emotions. Its totally okay for you to experience these emotions, but they need to be channeled in a way that doesn't make you feel like you're losing control. I think a lot of your (and our) anxiety is coming from fear - fear of the unknown future and things careening out of control - and if we don't get a handle on that emotion it can of course burst out inpanic attacks. - if a medication is not helping you, KEEP BUGGING YOUR DOCTORS until they find something that works. This is for your wellbeing and you are fully, fully entitled to be taken care of until the symptoms are much improved or resolved. - in addition to sorting out a regular medication that works for you, see if you can find a quiet place where you can sit and feel safe each day, like a garden, park, or a church. I had a full blown panic attack before my first chemo and the only place I could calm down was in the waiting room of the urgent care center of my hospital (I think I felt that no matter what happens right there, they could take care of me). I'm not that religious but having been diagnosed as st 4 at 27 I realized that to a certain extent, this is not up to me. I can do all the treatments I think that will help, but the final outcome is beyond me - and the result may actually be better than what I've been expecting or dreading. If you are religious at all (I'm not too much in the conventional sense), give this burden over. You can only do your best, step by step, in this current moment - and your best is O.K. My sweet, seasoned onc at a respected cancer center says, with all sincerity - \"Anything is possible.\" GOOD or bad. - I find listening to a meditation CD daily very helpful - and I never did this before bc - Melatonin taken before bed will help with sleep and has been shown to have a positive effect with BC, esp. in bone mets - Taking fish oil regularly helps stabilize moods and is once again, a positive thing you can do for the body. - As others have mentioned, the change in receptors may end up working to your benefit. Herceptin especially is a HIGHLY targeted treatment aimed at a specific protein. It is even more targeted than a broad hormone suppressant. H & P have been effective for many ladies. It may very well work great for you - Some people feel like doing naturopathic treatments in addition to conventional helps them feel better and also more in control of their treatment path. It doesn't have to be expensive - even tiny food changes can help. Foodforbreastcancer (or something like that) is a great, gentle place to start and provides research backing their recommendations. - Lastly, you are not alone. We are with you. You can do this. L.S.",
      "MessageIndex": 6,
      "PostDate": "18/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829616",
      "Title": "Feel like I am really loosing control patti4511 stagefree"
    },
    {
      "AuthorID": "LittleSun",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192667/profile",
      "Content": "Mar 25, 2015 05:48PM LittleSun wrote: Hi Ally, I know how you feel. I can't take it one day at a time either if I believe that whatever power had been watching over me \"allowed\" this to happen. I've done a lot of introspection and I have a really complex philosophy about this. It is a little difficult for me to explain here, but I'll give you two quotes for thought. \"God will always try to take the negative for you and turn it into positive\" \"Everything that is seeming to happen externally is happening to trigger something within you: to expand you, and take you back to who you truly are.\" Hugs, LittleSun",
      "MessageIndex": 1,
      "PostDate": "25/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829909",
      "Title": "A rant about life Allyme Allyme"
    },
    {
      "AuthorID": "LittleSun",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192667/profile",
      "Content": "Mar 26, 2015 06:33AM LittleSun wrote: Ally, I just want to add, that if you would like to PM me please feel free to. I was dx at 26, almost 27, with a little tyke at home and a relatively new marriage. It took a while to get to a different mindset, but it is very important to addrees your feelings (and keep addressing them, because they will repeat) so you can continue on your path in the best way possible. When I say address I don't mean dismiss - I mean deal with them in a positive way that will allow you to be strong in this situation. You have a strong faith and that will help you. You are young and this is a lot to grapple with. Don't put yourself in the ground because you are not there yet. There is hope both clinically (I believe there was a lady who posted just recently who was NED on femara for 13 years or something like this) and spiritually. To you and everyone here: there is so much love and support here; just that in itself is tremendously healing. It is hard not to calculate our life and think that we are are hanging on by a thread. It's hard not to forget the good in our lives and focus on the bad. I went through the wringer with treatment, including a liver resection because of something that was aggravated by the chemo (and I'm Her-). My onc had tears in her eyes when she first saw me: I had an \"oh sh\"t\" feeling for quite some time. Fast forward to today. All liver function is normal, 1 year NED on tamoxifen alone. I'm kind of like that band, \"five for fighting.\" Except I'm \"1 for fighting\" on my own. Or, if you count my hubby and little one, 3 for fighting...  ",
      "MessageIndex": 16,
      "PostDate": "26/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829909",
      "Title": "A rant about life Allyme Allyme"
    }
  ]
}