{
  "AuthorID": "Littlewhite…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252015/profile",
  "Posts": [
    {
      "AuthorID": "Littlewhite…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252015/profile",
      "Content": "May 11, 2017 05:17PM Littlewhite wrote: MTwoman, thank you so much for the reply. I feel so supported. I attached my mammogram and ultrasound report at the end. Interestingly, they found nothing in my painful left breast. They found calcification in my right one and Did biopsy. It is fibroadenoma. I even don't feel anything uncomfortable up to now in the right one.  The breasts are composed of heterogeneously dense fibroglandular tissue and fat. Mammography is less sensitive in areas of dense fibroglandular tissue. Calcifications are noted in the right lateral breast. Magnification CC and ML view and true lateral view were obtained. The calcifications are in a 4 mm distribution. They're indeterminate. Tissue sampling is recommended. They are amenable to stereotactic core biopsy. No other suspicious masses, calcifications or areas of distortion are seen. Spot compression views were obtained in the subareolar left breast in area of fullness indicated by the patient. No focal mammographic abnormality seen. Ultrasound was performed in area of fullness indicated by the patient in the periareola left breast 9:00 position and no focal sonographic abnormalities seen.",
      "MessageIndex": 4,
      "PostDate": "11/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855045",
      "Title": "Breast pain, puffy areola, no lump, scared Littlewhite MTwoman"
    },
    {
      "AuthorID": "Littlewhite…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252015/profile",
      "Content": "May 11, 2017 01:40PM Littlewhite wrote: Thank you so much, MTwoman. I read that post and finally found someone has the same concern as me. It seems that my doctor doesn't understand why I am so concerned. My OB/gyn did not want toorder another ultrasound as my last one two month ago was clear and she did not feel any lump. I will ask the breast surgeon if she can order one. I don't know if I am overreact, but I am the kind of person who what to know exactly why. What cause the pain if there is nothing wrong.",
      "MessageIndex": 2,
      "PostDate": "11/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855045",
      "Title": "Breast pain, puffy areola, no lump, scared Littlewhite MTwoman"
    },
    {
      "AuthorID": "Littlewhite",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252015/profile",
      "Content": "Littlewhite wrote: I am 34. I always have pain in both breasts before my period. Four month ago, I started to have shooting pain in my left breast even after the period. It is mostly in the areola area, sometimes radiate to my armpit. At first it is only a few times a week. It gets intense. I also noticed my left areola was swelling, became large than the right one. I went to see my OB/Gyn in March. Had mammogram and ultrasound, all clear, but I have dense breast. She said it is just hormone issue. I found I got pregnant last month. The pain gets even worse, almost all the time. When I change a position, I feel my nipple and areola is tearing. My left breast is so painful I don't want my DH to touch. The areola is even more swelling. I also have some pain in the right breast which I contribute to hormone change. But my left one is 100 times more painful than the right one. I checked with my OB/gyn twice after got pregnant, she cannot feel any lump. She says it is the pregnancy. She referred me to a breast surgeon, but it is another 2 week wait. This is my 2nd pregnancy, I don't remember that pain in my last one. What concerned me more is the left breast started to have pain even before the pregnancy. I am afraid if something is wrong, the pregnancy will make it even worse. I am so concerned, feelingsomething is really wrong. So stressful, cannot sleep at night. What can I do now? What shall I talk to the breast surgeon if she also think there is nothing wrong? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855045",
      "Title": "Breast pain, puffy areola, no lump, scared Littlewhite MTwoman"
    },
    {
      "AuthorID": "Littlewhite…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252015/profile",
      "Content": "Jun 20, 2017 08:52PM Littlewhite wrote: Follow-up of my post a month ago. The pain get much better in my left breast. The areola is still puffy. A new symptom started last week, I found an indentation line in the areola. When the areola shrinks when it is cold or I touch it, the indentation disappears. I saw a breast specialist who is a nurse practitioner two weeks ago, before the indentation appeared, she did a breast exam, said everything is normal, not concerned. Today, I finally got to see a breast surgeon,she saw the indentation. When she did breast exam, the areola shrunk, not puffy, no indentation. She said the indentation line doesn't look like that of breast cancer and disappears when the areola shrinks, she is not concerned. She did not found anything abnormal. I still feel anxious about the indentation. Very change in my breast drives me nuts now",
      "MessageIndex": 5,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855045",
      "Title": "Breast pain, puffy areola, no lump, scared Littlewhite MTwoman"
    }
  ]
}