{
  "AuthorID": "littletatas",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212997/profile",
  "Posts": [
    {
      "AuthorID": "littletatas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212997/profile",
      "Content": "littletatas wrote: Not sure if this is the right forum for this.. I am scheduled for a MX and SNB next Wed 4/22. I called my surgeon's office today to see about what I need to get for the drain care (belt thingy, special bra, etc) to wear home. They said I may not need drains... huh? could this be right? Anyone go home without drains? Age 43 at Dx Dx 3/26/2015, IDC, Right, 6cm+, Stage IIIA, Grade 1, ER+/PR+, HER2- (FISH) Surgery 4/21/2015 Lymph node removal: Sentinel; Mastectomy: Right Chemotherapy 6/18/2015 AC + T (Taxol) Radiation Therapy 10/25/2015 Whole-breast: Breast, Lymph nodes, Chest wall Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830474",
      "Title": "no drains? littletatas hummingbirdlover"
    },
    {
      "AuthorID": "littletatas…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212997/profile",
      "Content": "Apr 16, 2015 09:18PM littletatas wrote: Thanks ladies! I'm planning on no reconstruction. My natural \"girls\" are a little mis-matched. Lefty is a small C cup but the right one (loser one) is a small B so maybe it is small enough for no drain. I'm okay with having the drain as I know it serves a good purpose but have not seen anyone on the forums without drains. Surgery in 6 days... have never been in the hospital so I'm nervous. They said Home Health care workers will be coming to my house to check the drain (if necessary), giving me sponge baths, etc. I told my friend I hope I get a Channing Tatum look-a-like!! ha ha But honestly I was just diagnosed less than a month ago so everything is a little surreal right now. My husband has been a rock for me. He says he doesn't care if I have boobs or not, just that he has me around for a long time. That's my plan!!",
      "MessageIndex": 8,
      "PostDate": "16/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830474",
      "Title": "no drains? littletatas hummingbirdlover"
    },
    {
      "AuthorID": "littletatas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212997/profile",
      "Content": "littletatas wrote: Quick Poll: How long were you out of work after unilateral mastectomy without reconstruction? Which breast : left or right? Are you right or left handed? What type of work do you do? desk job, waitress, etc What country are you in? Thank you for your insight!! Age 43 at Dx Dx 3/26/2015, IDC, Right, 6cm+, Stage IIIA, Grade 1, ER+/PR+, HER2- (FISH) Surgery 4/21/2015 Lymph node removal: Sentinel; Mastectomy: Right Chemotherapy 6/18/2015 AC + T (Taxol) Radiation Therapy 10/25/2015 Whole-breast: Breast, Lymph nodes, Chest wall Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/831307",
      "Title": "Poll: non-reconstruct Mx return to work? littletatas MizMimi"
    },
    {
      "AuthorID": "littletatas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212997/profile",
      "Content": "littletatas wrote: I was just diagnosed Thursday with a 3cm malignant lump in my right breast from my stereopathic biopsy results. I see the oncologist Friday. The biopsy surgeon said to expect a chemo port soon. My question is does anyone else feel exhausted at this point?? I haven't even started chemo and I've felt so tired for weeks especially in early afternoon. I would love a siesta.. Age 43 at Dx Dx 3/26/2015, IDC, Right, 6cm+, Stage IIIA, Grade 1, ER+/PR+, HER2- (FISH) Surgery 4/21/2015 Lymph node removal: Sentinel; Mastectomy: Right Chemotherapy 6/18/2015 AC + T (Taxol) Radiation Therapy 10/25/2015 Whole-breast: Breast, Lymph nodes, Chest wall Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/830036",
      "Title": "Exhausted before chemo ?? littletatas WinningSoFar"
    },
    {
      "AuthorID": "littletatas…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212997/profile",
      "Content": "Sep 10, 2015 04:20AM - edited Sep 10, 2015 04:33AM by littletatas Starting DD Taxol # 3 of 4 tomorrow. My experience with Taxol #1 was awful. Severe bone pain on Days 4-7 and Dr had to double my pain meds. I couldn't walk! I had to use a wheelchair. The pain in my knees and hips was excrutiating to the point I called MO and asked to stop chemo altogether, this is the first time I considered stopping. My main complaint on A/C was acid reflux. On Taxol, my knees felt like basketballs filled with broken glass that was rubbing together. For dose #2, he dropped my Neulasta shot from 6mg to 4mg. This helped so much! I had some bone pain from Neulasta on A/C #1-4 but nothing like that. They were just achy sore feeling then but I could walk at least. So lesson learned was don't give up, call your MO! I should have done that on day 4 and not suffered like that. Dose 2 I felt better, no nausea on Taxol at all for me but also no appetite, even with the steroids. I lose 8 lbs in 2 weeks, which I am kind of happy about..Buddha belly is shrinking! With the dropped Neulasta, my WBC did not drop much as I was worried it would. It went from 10 to 6. He told me yesterday I was borderline ready for a blood transfusion if I didn't eat more red meat. Ick I hate most red meat. A burger is ok.. Guess I'm eating at Red Robin tomorrow. My finger neuropathy has become worse on Taxol. MO asked if it was bad at beginning and tapers off, no mine is gradually worse. During the first treatment I didn't have any problems until about a week later. Started in left hand pinky and now is all fingers and thumbs. Sometimes feet go to sleep or get really cold for no reason. MO said take B complex to help with fatigue and nerve function. I found some chewable gummies on Amazon that are good made by Nutrition Now and have strawberry flavor for $8.80 for 70. Good luck to all the chemo-sabe sisters in the chair this week! I have my coloring books and Kindle ready for tomorrow. xoxo ",
      "MessageIndex": 427,
      "PostDate": "10/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "littletatas…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212997/profile",
      "Content": "Jun 12, 2015 06:54PM littletatas wrote: Joining you wonderful June ladies. I hate for any of us to be here, but glad to know I'm not alone. My port placement will be Tuesday June 16, cocktail of A/C starts June 18, Neulasta shot June 19. Then two weeks later rinse and repeat.. 4 treatments with A/C then 4 of Taxol. 8 total to end in October. Then radiation. Hopefully I will be able to see my stepson play high school football some this fall. I have two wigs ready to go and a friend has provided me with many beautiful scarves and caps. Going to try and work as much as I can muster the energy to do so. Fighting a sinus/ear crud now so already started some steroids that have me amped up and certainly irritable, to my poor husband's dismay. Good luck ladies, look forward to reading your posts.",
      "MessageIndex": 58,
      "PostDate": "12/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "littletatas…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212997/profile",
      "Content": "Jun 30, 2015 01:12PM littletatas wrote: Hello fellow warriors, I enjoy reading all your posts, the good, bad, and ugly so I know I'm not alone and what to expect. I had AC #1 on June 18. #2 is tomorrow, a day early due to the holiday, they are closed Friday. The SE's have not been so rough as I built it up in my head... mostly fatigue, bone pain, and mild nausea, usually in the mornings. I was able to work all last week. I notice I have a headache when I take Zofran so I asked MO and he gave me a script for Phenergan today. My mom gave me Ginger Root capsules and they helped the nausea yesterday so I'm going to stick to that when I can. I've written in a journal daily just quick notes of how I feel, what SE is, and what I took to help. My MO said the next rounds (4 total A/C every 2 weeks, then Taxol for another 8 weeks) will be the same dose, so I'm hoping same side effects and not cumulative. Does anyone know? My hair is hanging on upstairs but starting to go \"down there\". Just a little shedding on my brush, from my head -- thought I should clarify lol. MO said I should cut it shorter (already have had the pixie for over a year) because it will go in the next week. It is a little tingly around the edges. I think I will have DH to cut it down to 1\" tonight as I'm tired of waiting and watching to see when it goes. This will be ONE thing I can control. I want to add my info to the SE log that a member started on the site but I can't find it. If anybody knows where it is, please put a link on here. Thanks and have a great week, we CAN do this!!",
      "MessageIndex": 229,
      "PostDate": "30/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "littletatas…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212997/profile",
      "Content": "Jul 2, 2015 06:55PM littletatas wrote: here's some pics of my buzz.. before pic . pink Mohawk funwith hubby. and finally finished product .. I kind of dig it. ",
      "MessageIndex": 250,
      "PostDate": "02/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "littletatas…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212997/profile",
      "Content": "Jul 7, 2015 09:02PM littletatas wrote: here's my smiley face port placement scars. or more like :/ I think my BS did this on purpose ! lol oh well finally starting to come back to the life of theliving after AC #2 last week. fatigue has thrown me for a loop. switched me from Zofran to Phenergan for nausea. I think it has worked better for me but sleepy. tingly fingers too. mouth sores are better. I sucked on ice chips this time during infusion. will plan to do that from now on..",
      "MessageIndex": 285,
      "PostDate": "07/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "littletatas…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212997/profile",
      "Content": "Aug 5, 2015 02:47PM littletatas wrote: man these mood swings stink! angry and irritated one minute, frustrated and crying the next. chemopause sucks!! finished AC#4 last Thurs. I start Taxol every other week on 8/13. hoping its side effects are better. I read on here everyone is different. My MO said there should be less nausea (yay!), but more bone pain and infusion will take 4 hrs. I will take 5 steroid pills the day before infusion and 5 the morning of. I hope I can sleep and not rip anyone's head off! I've been trying to work during therapy. I take off the day of blood work (Wed), chemo day, and Neulasta day. these are all out of town 3 hrs round trip. last week I stayed in a hotel after chemo because my sweet uncle donated me some free nights. then I basically sleep through the next Monday. I try to move around more on tues and work wed-tues. I'm a manager at a 500 person manufacturing plant which is a challenge in itself. people complain they want to go home because of things liketheir contact itches. I want to say but do you have cancer? it's hard to stay strong and positive. looking for that light at end of tunnel and hoping its not a train!",
      "MessageIndex": 377,
      "PostDate": "05/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "littletatas…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212997/profile",
      "Content": "Jun 19, 2015 07:51PM littletatas wrote: Had A/C #1 yesterday (June 18), Neulasta shot today. So far, so good. Was really tired after infusion yesterday. Had a touch of nausea last night but Zofran and Ativan helped. Was told to get up several times during the night to urinate out the chemicals. So I set an alarm for every 3 hours and drank water when I was up. Took a Zyrtec this morning and will take another tonight. My MO said Zyrtec works best for bone pain from the Neulasta and to take two a day. Today has been good, no nausea or pain, just a slight dull headache.",
      "MessageIndex": 114,
      "PostDate": "19/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "littletatas…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212997/profile",
      "Content": "Jul 16, 2015 10:41AM littletatas wrote: in the chair now getting my #3 cocktail. coloring in my adult coloring book. lol it's pretty relaxing when I can get the neuropathy to give me a break.",
      "MessageIndex": 337,
      "PostDate": "16/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    }
  ]
}