{
  "AuthorID": "LittleLori",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267049/profile",
  "Posts": [
    {
      "AuthorID": "LittleLori",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267049/profile",
      "Content": "LittleLori wrote: Has anyone experienced swelling after beginning radiation? I had a lumpectomy on January 2nd, and all swelling was gone by the first week of February, leaving me with a concave area in the upper outer quadrant of my breast where tissue was removed. Monday night (after my 3rd treatment) I noticed that my breast no longer looked concave, and there was a bit of swelling/puffiness along my ribcage and under my arm. My breast also fell tender by yesterday morning. I asked the techs if this is normal and they said no, but added that it wouldn't be caused by radiation. The nurse agreed with them and said the only side effect I would get from rads is skin irritation. I feel no fluid in my breast and show no redness, or other signs of infection. The ONLY change since last week was beginning radiation. I see the RO after this afternoon's treatment, but have a feeling he will say it's not related. I also left a message for my SO to get her thoughts. Feeling frustrated... Dx 11/9/2017, DCIS, Left, <1cm, Stage 0, Grade 1, ER+/PR+, HER2- Surgery 1/2/2018 Lumpectomy: Left Radiation Therapy 2/15/2018 Whole-breast: Breast Hormonal Therapy 3/18/2018 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862692",
      "Title": "Swelling of surgical site and underarm since beginning rads? LittleLori LittleLori"
    },
    {
      "AuthorID": "LittleLori",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267049/profile",
      "Content": "Feb 22, 2018 08:59AM LittleLori wrote: gb2115--I hope your 1 year visit goes well! I've resigned myself to the fact that my left breast will be permanently wonky in way or another.  KatieJane77--thank you for sharing your experience, It's good that you found someone to help with lymphodema. Hope everything starts to settle down for your.",
      "MessageIndex": 5,
      "PostDate": "22/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862692",
      "Title": "Swelling of surgical site and underarm since beginning rads? LittleLori LittleLori"
    },
    {
      "AuthorID": "LittleLori",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267049/profile",
      "Content": "Feb 21, 2018 02:36PM LittleLori wrote: Thanks so much, gb2115. I thought I was going crazy. Sorry to hear your collarbone is still tender. Other than that, I hope you are doing well. Today's nurse said it's not common, but the rads could cause swelling. When the RO came in, he said it was most likely left over swelling from surgery that became more inflamed. He said it can take months for all the fluid to be absorbed by your body and under your arm is often the last place to resolve itself. He added that the amount of swelling I have isn't concerning. A coworker got back to me and said her breast had swelling and stayed bigger than the other one (she is two years post radiation). She, like me, was told by her RO to expect shrinkage, but her surgeon said sometimes the opposite happens. I wish they gave a more comprehensive list of possibilities with the headings, \"This is normal for some people, DON'T FREAK OUT!\" or \"This is NOT normal, call the office.\"",
      "MessageIndex": 2,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862692",
      "Title": "Swelling of surgical site and underarm since beginning rads? LittleLori LittleLori"
    }
  ]
}