{
  "AuthorID": "LiveLoveBel…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73321/profile",
  "Posts": [
    {
      "AuthorID": "LiveLoveBel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73321/profile",
      "Content": "Nov 20, 2008 03:30AM LiveLoveBelieve wrote: Hi - My biopsy showed no necrosis;  post-mastectomy the tumor was found to have necrosis.",
      "MessageIndex": 15,
      "PostDate": "20/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724213",
      "Title": "Pathology results different from biopsy results. Please help! havehope ZEKE"
    },
    {
      "AuthorID": "LiveLoveBel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73321/profile",
      "Content": "Nov 3, 2008 11:29AM LiveLoveBelieve wrote:  Thank you so very much, everyone who responded.  Believe it or not I work for the Federal govt. - we have quite a bit of protection - but expectations are another thing.  I do feel better, I do; just knowing that I am not crazy thinking that I should be all dressed and ready to go! Thanks again; I so appreciate this Board.  This is my first day posting and I have been going a bit crazy w/ questions - but I hope to \"give back\" to others, once things have calmed down. Enjoy the day, llb",
      "MessageIndex": 8,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/723810",
      "Title": "Mastectomy last week - expected to return to work! LiveLoveBelieve Rovergirl"
    },
    {
      "AuthorID": "LiveLoveBel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73321/profile",
      "Content": "Nov 19, 2008 11:52PM LiveLoveBelieve wrote: KatieJane - Thank you for your quick reply.  I am sorry to hear that you are going through this. I have a friend who developed LE in her leg, requiring daily attention. My PT seems to not want to scare me - as I had expressed my concerns fairly strongly.  That being said, she has asked a LE specialist to meet with me tomorrow. So I am pleased that she is so proactive (confirming what you said). Thanks again for your response (and support!)  Your LE sounds like it started in your arm;  mine is in my chest and back.  I wonder if mine will then move to my arm.  Remains to be seen.  I need to stop worrying!  It is not a negative path. result, eh?  LiveLoveBelieve",
      "MessageIndex": 4,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/724749",
      "Title": "Lymphedema in chest wall??? Compression vest? LiveLoveBelieve Katiejane"
    },
    {
      "AuthorID": "LiveLoveBel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73321/profile",
      "Content": "Nov 19, 2008 11:17PM LiveLoveBelieve wrote: Hi Katiejane - Thank you for your post.  I don't know what to expect. Did your edema resolve itself?  and did you have it under your scar in the front and/or in the back of the underarm? LiveLoveBelieve",
      "MessageIndex": 2,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/724749",
      "Title": "Lymphedema in chest wall??? Compression vest? LiveLoveBelieve Katiejane"
    }
  ]
}