{
  "AuthorID": "livin",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242425/profile",
  "Posts": [
    {
      "AuthorID": "livin-on-a-…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242425/profile",
      "Content": "Dec 5, 2016 08:08PM livin-on-a-prayer wrote: PMevans50 - Thanks for responding to my question regarding estrogen positive pathology. Also thank you to everyone who contributed to the sleep question. Sorry so many of us are having trouble sleeping. It helps me to know my problems are typical with chemo. So now I am getting up and journaling since I have been out of chemo fog for a couple of days, instead of laying in bed wishing I could sleep. It helps to get the feelings of this unique time of in my life out in print. I getrmy second round for AC tomorrow, if my white blood count is high enough tomorrow. I haven't lost my hair yet and value so many of you sharing your journey. It is something I am really dreading and it helps to hear what is ahead so I am prepared. BG46TN - I am glad you are feeling better. Getting sick with a fever at this point sounds like a scary aspect.",
      "MessageIndex": 890,
      "PostDate": "05/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "livin-on-a-…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242425/profile",
      "Content": "Dec 6, 2016 12:24PM livin-on-a-prayer wrote: fromtritoa -Kelly - Have you tried prune juice? I used that later on instead of the scenekot, because it made so gassy and it seemed to work well and didn't taste so bad.",
      "MessageIndex": 906,
      "PostDate": "06/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "livin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140124/profile",
      "Content": "Jun 14, 2014 09:17PM livin wrote: 60",
      "MessageIndex": 286,
      "PostDate": "14/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "livin-on-a-…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242425/profile",
      "Content": "Nov 13, 2016 08:05AM livin-on-a-prayer wrote: Hi I think I will be joining the chemo team soon. I am very nervous about this and didn't expect the recommendation from my MO and really needed time to process. Currently waiting for my onco test score, but onc believes it will for sure be intermediate to high. Pmevans50 your pathology seems similar to mine ER+,Pr-, HEr2- ; I haven't seen anyone else like that so far on these posts. Do you know if this is a more unique pathology? I think it seems this pathlogy as well as a grade 3 tumor is why chemo before radiation is being recommended. Also does anyone know about a suggested window of chemo therapy starting after surgery? Thanks, didn't want to join the team, but now that I am here glad for the support from ladies like all of you ",
      "MessageIndex": 281,
      "PostDate": "13/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "livin-on-a-…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242425/profile",
      "Content": "Nov 20, 2016 06:41PM - edited Nov 20, 2016 08:49PM by livin-on-a-prayer So I believe I will be joining your group of starting chemo in Nov. My onco-type score came back super high. My MO is trying to get me on the schedule to start chemo on Tues. and get my first dose intravenously, as there were no openings the following week:( I will be getting my port put in on Wed. and also am getting my hair cut short. Thanksgiving will be a little tricky probably with how I feel physically, but I am trying to stay positive and full of gratitude for my many blessings. I can't say I am not filled with apprehension, but reading all of what you wonderful women have shared so far regarding your personal journey has helped me prepare to start mine. I have gone wig shopping, but really am not thrilled with this aspect and may have to stay with hats and scarfs for awhile. Nothing looks quite right to me, even though my dear husband said that he thought a couple of them looked nice. There have been lots of tears and I am trying to lean on my faith to lead me through. One of my favorite bible verses is Jeremiah 29:11 \"For I know the plans I have for you,\" declares the Lord, \"plans to prosper you and not to harm you, plans to give you hope and a future. I think being able to communicate with others that are making this same journey will help me deal with this most unexpected time of my life. The encouragement and support you have shown for each other is contagious. So thanks for letting me join the team.",
      "MessageIndex": 537,
      "PostDate": "20/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "livin-on-a-…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242425/profile",
      "Content": "Dec 3, 2016 03:45PM livin-on-a-prayer wrote: Hi Ladies, I haven't posted a comment since Nov. 22 and just finished reading through all of your great discussion points. There are so many important ideas and remedies shared here. My brother in-law is a head pharmacist and intrigued with some of the discussion points - especially the neulasta ideas. BG46TN- I am scheduled for another echo after my third treatment. After my first echo I met with a cardiologist that stated my heart was functioning at 53% (normal range is 55-60%), plus they diagnosed me with a leaky valve - who knew? I have always been very active and thought very heart healthy with a lower healthy blood pressure. However, I have a rapid heart rate, especially for a petite woman (I'm calling it a humming bird heart), which means my heart is working too hard. So now they have me on a beta blocker to protect my heart from the damage of chemo. The problem is that this also lowers my already low blood pressure. Did a cardiologist meet with you and let you know if there are any unusual features of your heart that they want to watch? Nfullblume - I love your energy and positive nature. Your picture of your shaved head gives me hope. It is so funny to be fearing to lose your hair and in the next breath just wishing you could get the inevitable over with! I am also intrigued with the juicing ideas. PMevan50 - We are both only estrogen positive. Do you mind if I ask if you know what percent estrogen you are? I am only 23% estrogen and my onco score came back off the charts high. Some of the themes in so many of the messages have been about neulasta placement. I only have had one round of AC and I also had the Neulasta patch placed on my stomach and had little to no problem with pain. As far as water with electrolytes SMART water has been a good choice for me. For some reason it seems to go down easier than regular water when I am getting dehydrated. So 3 questions for the group - Like many of you I experienced the chemo fog significantly and slept quite a bit from day 2-5. Did any of you have problems with focusing your eyes during this time or ongoing with chemo? Then once out of the fog I am having difficult sleeping days 6-10 unless I take my lorazepam -even though I don't need it for nausea. Has anyone dealt with significant insomnia? Lastly, I had a blood port draw a week after my 1st chemo and Ne# (Neutophil) level was critically low at 0.1, so I was told to avoid public places because I was very susceptible to catch other peoples' germs. Glad I took a leave from my elementary teaching position. So now I feel great and can't go anywhere hoping my levels rise by Dec. 6 so I can get my next round. Has anyone else experienced low counts? I feel so thankful for this forum so we can learn and support each other!",
      "MessageIndex": 841,
      "PostDate": "03/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "livin-on-a-…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242425/profile",
      "Content": "Dec 6, 2016 10:13AM livin-on-a-prayer wrote: I too would be interested in a private Facebook group - do we use Facebook messenger or something else. It would of been good last night/morning when I was awake from 3:45 a.m. on. Javamama - good luck today. I am feeling so well and like myself again it is hard to go back into the fog of chemo. By the way my name is Jennifer Miller on Facebook. We will initially need to put our aliases by our real names so we can remember who everyone is.",
      "MessageIndex": 901,
      "PostDate": "06/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "livin-on-a-…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242425/profile",
      "Content": "Dec 3, 2016 04:52PM livin-on-a-prayer wrote: Pamela 23 thanks for responding. My nurse said that the Lorazepam could be used for in between nausea as well as help me sleep. I also am afraid of getting too hooked on sleep meds and tried to skip it a couple nights and had 2 horrible nights of insomnia and strange dreams with waking up very anxious and teary.",
      "MessageIndex": 844,
      "PostDate": "03/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "livin-on-a-…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242425/profile",
      "Content": "Dec 6, 2016 12:20PM livin-on-a-prayer wrote: BG46TN I have Jennifer Kaiser in parenthesis. There is a picture of my husband and I at my daughter's wedding in a navy blue dress. It is difficult having such a common name.",
      "MessageIndex": 905,
      "PostDate": "06/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    }
  ]
}