{
  "AuthorID": "Livsmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131734/profile",
  "Posts": [
    {
      "AuthorID": "Livsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131734/profile",
      "Content": "Livsmom wrote: This Post was deleted by Livsmom. Dx 6/6/2011, DCIS, 1cm, Stage 0 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/771594",
      "Title": "Bruising after surgery Livsmom Livsmom"
    },
    {
      "AuthorID": "Livsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131734/profile",
      "Content": "Jul 8, 2011 01:38PM Livsmom wrote: Thanks katonine and lifelover- I am having a rough time with stomach issues since surgery since the fibro diagnosis the Dr says irritable bowel syndrome made worse by stress. Do any of you suffer with stomach problems. I just wish I could get some energy and the heal faster without eating good it has slowed my progress. I have my first fill on Monday and I'm still very sore on the MX side my other side which had a MX 10 yrs ago is doing well. I am lucky no treatments they wanted me to take tamoxifen but I couldn't tolerate it 10 years ago so I'm hoping for the best. My oncologist told my I'm at a much higher risk for developing other rumors because of the radiation and chemo almost 30 yrs ago but even though it scares me I have to try and be positive. I was told I couldn't have children back then and I went on to have 3 so I feel that my reason for being here is them I also have two grand babies that I adore. But when the fear creeps in I pray and pray and bargain with God to let me see them grow up even though my sons are grown my daughter just turned 6 and I can't bear the thoughts of leaving her. My husband has talked with me numerous times about us deciding who would care for her if we couldnt and I just can't go there. My husband has had some heart problems and we were older when we had her he is 53 no and I am 44. I know many of you probably share in my fears it helps to talk to someone who understands.",
      "MessageIndex": 27,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "Livsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131734/profile",
      "Content": "Jul 7, 2011 08:49PM Livsmom wrote: I to have had Hodgkins lymphoma in 1982 at the age of 15. In 2001 lobular carcinoma of the left breast with mastectomy no treatment due to all the treatments I had with the HL so here I am again with a right mastectomy for non invasive ductal no further treatments. I am doing implants this time at age 44 I decided to try and see how it goes. So far not to many problems. I am on disability for fibromyalgia and heart and blood pressure issues related to the past treatments but I try and stay positive. It is nice to hear from others that are going throug the same thing. I also have been having basal cell carcinoma skin cancers popping up and a lot of thoracic ( upper back problems) with my discs does anyone else have these problems. And of course anxiety and panic attacks over the past few years have been very hard to deal with.",
      "MessageIndex": 24,
      "PostDate": "07/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    }
  ]
}