{
  "AuthorID": "Lmflynn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88563/profile",
  "Posts": [
    {
      "AuthorID": "Lmflynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88563/profile",
      "Content": "Feb 23, 2011 01:11PM Lmflynn wrote: Hi there~  I did use the Penguin Cold Caps throughout my chemo -- Taxotere and Cytoxan *4 every three weeks -- and did not lose my hair.  I am 6 weeks PFC and my hair is starting to get back to \"normal\" -- you shed  a lot of hair -- but nonoe could tell or notice.  I know the success depends on the chemo protocol and other things.  It is a big commitment and like anything nothing is without its own risks... but I am very happy that I used the caps.  I live in Houston and received chemo at a large university hospital. There is a thread on this site -- Cold Cap Users Past and Present to Save Hair.  Just use the search at the top and you'll find it -- A lot of information and success on the thread.",
      "MessageIndex": 3,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/765276",
      "Title": "ice on head or ice cap geocachelinda Lmflynn"
    },
    {
      "AuthorID": "Lmflynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88563/profile",
      "Content": "May 10, 2012 09:29AM Lmflynn wrote: Ladies ....how or can I stop fear...I meditate, I believe intellectually don't worry about things that aren't actually happening ....but I am in a loop right now. I hurt my back on Easter, so afraid of mets ....went to my Internist and got my MO in the loop....did blood tests and X-rays ...all came out Ok...said arthritis....then I went to OB-GYN ..while there said lets do a DEXA scan.... Came back osteopenia in my hip and osteoporosis in my spine .... I'm 46, a runner, and this diagnosis flipped me out ...could it actually be cancer ...since then all I think about is spine mets .... But I am too afraid to find out .... The pain goes from lower back, then my tail bone, then tingling in my upper hip, then my upper back, then my neck, etc.... I took a Xanax tonight and seems like pain isn't there ....AM I GOING CRAZY? ... I keep thinking I don't want to know ....and realize I'm not living life being in anxiety attacks constantly..... Advice?, encouragement?, does it sound like mets?... I read so many strong women on here and I feel so small and weak right now .. Thx for listening.....",
      "MessageIndex": 278,
      "PostDate": "10/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Lmflynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88563/profile",
      "Content": "May 20, 2012 05:01AM Lmflynn wrote: Ditto.....a mean sneaky sometimes unrelenting Big B.....of a disease....",
      "MessageIndex": 335,
      "PostDate": "20/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Lmflynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88563/profile",
      "Content": "May 9, 2012 08:33PM Lmflynn wrote: Thanks Chrissy and Sue...it helps to hear from you. I really don't know myself right now. They told me they would order an MRI if I want one....which I'm sure I'll do ... For the osteo ...just calcium and Vit D... My Vit D level was low normal, and I'm lactose intolerant .... Lack of calcium in my life, chemo and early chemo- pause has caught up no doubt ...but of course in the very back of my mind ...I'm thinking thin bones could be cancerous bones.... Like I said I am a crazy person right now. :-) .. Hugs back, Lisa",
      "MessageIndex": 282,
      "PostDate": "09/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Lmflynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88563/profile",
      "Content": "Feb 1, 2011 06:20PM - edited Feb 1, 2011 06:21PM by Lmflynn Thanks for the info ladies, I ordered a bilat sleeve today. I haven't experienced lymphedema as yet, but about to go back to work and travel extensively so thought I should do my best at prevention. The service was wonderful..ordered online and already shipped. Will let everyone know how it works/feels when I receive it.",
      "MessageIndex": 45,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/764107",
      "Title": "New type of LE Garment Journey purple32"
    }
  ]
}