{
  "AuthorID": "lmixon",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133840/profile",
  "Posts": [
    {
      "AuthorID": "lmixon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133840/profile",
      "Content": "Aug 8, 2011 01:07AM lmixon wrote: Thanks for the welcomes and the resources.  I'll be looking into them later.  We drive to Houston each weekend for Chemo and it's 5 hours each way.  The trip is pretty tiring, so I'll get my brain back in sync before investigating. The hardest thing is finding anyone who has come through this and can tell us what happened.  My wife of course questions, ok, if I do get it into stasis, where am I then?  She was 5'8\" and is now 5'1\".  She questions if her body can ever be any type of normal again. Thanks again.",
      "MessageIndex": 6,
      "PostDate": "08/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772782",
      "Title": "Intro and Call for info Stg4 Bone Mets, very advanced lmixon justjudie"
    },
    {
      "AuthorID": "lmixon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133840/profile",
      "Content": "lmixon wrote: I just discovered the forum while seeking more information on the latest side effect.  I want to make sure that everyone understands that I am a full time caregiver for my wife.  She made the decision early on that she was not going to dwell on the diagnosis or obsessivly study it.  I would do the research and advise her based on what I found.  She would only see herself a healing and recovering.  She took a path that seems to be more and more common.  She had fibrocystic issues with her breasts for most of her life.  Seemingly overnight a baseball sized lump appeared in her right breast.  She started taking some herbals for fibrocystic issues and largely ignored it.  She felt that \"Cancer\" wouldn't have appeared so suddenly. A few months later she started having back pain that was greater than usual.  Her work is done on the computer a great deal so pain in the middle back was pretty common.  But her normal chiropractic treatment didn't make a difference and seemed to make it worse.  We finally saw a doctor in November of 2010 who first found a compression fractured vert, and then ordered an thorasic MRI.  It showed multiple lesions and fractures in her spine.  She had been asking if I had done something to the rear view mirror in the car since she seemed to be adjusting it more and more.  We had no idea at the time. This of course sent us to an oncologist.  They discovered advanced stg 4 triple negative breast cancer with metastasis to lymph nodes and bone.  Lesions were present on her entire spine, all ribs,pelvis, upper arms, upper legs (femur) and one on her upper jaw.  She has lost 7 inches in height, and now has a severe kyphosic curve to her thorasic spine.  C-2 has suffered complete bony destruction and many of her verts are \"Pancaked\".  Quite a few spinus processes have ceased to exist. The first oncologist offered a clinical trial that was not \"Parp\" related and we would have to decide that day.  We bid farewell to him and changed treatment to MD Anderson in Houston.  We have a primary oncologist who is a specialist in triple negative BC.  Treatment has been going on since march, with a shift in May for emergency radiation.    So far she is on a 3 weeks on one week off course of Taxol (Pacitaxel) and once a month Zometa.  When severe pain struck in late April Chemo was suspended and they did 10 radiation treatments.  This helped the pain, and chemo resumed.  She was hospitalized again in early July for PE in her right lung. Bone Scan, MRI and CT are done monthly.  So far the primary says she is not happy with the progress she is seeing.  We are doing new scans around the 20th of this month and she says we will make decision for future treament based on the results. She is on a large set of pain meds, anti nausea meds, etc.   We also do twice daily doses of Lovenox and Oxygen to treat the PE.  She is experiencing hair loss, neuropathy and of course a great deal of pain.  Most recently she has started noticing loose teeth.  She is in a CTLSO brace 24  hrs a day,  rigid during the day, softer version for sleep.  She is still working 40 hrs per week and feels that is essential to getting better.  I have not come across anyone with a similar DX or anyone I could talk to about it.  I am hoping to find people with similar experiences to see what they have found.  Thank you for taking the time to read this and respond if you can. Thanks L. Christian Mixon Dx 1/20/2011, ILC, 6cm+, Stage IV, Grade 3, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772782",
      "Title": "Intro and Call for info Stg4 Bone Mets, very advanced lmixon justjudie"
    }
  ]
}