{
  "AuthorID": "LMVerna",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
  "Posts": [
    {
      "AuthorID": "LMVerna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
      "Content": "Nov 14, 2014 06:04AM LMVerna wrote: I see that some people say they are getting tender at the site of radiation. Is anyone doing the radiation with a tissue expander in place? My tissue expander is already a little uncomfortable and I am wondering how it will feel. I have also found now that since I am about 5 months out of my mastectomy, some of the nerves are regenerating and I am having more senstivity/discomfort on my mastectomy side. It's nice that some of the numbness is going away but it is sometimes uncomfortable and I am wondering how the radiation will affect it all.",
      "MessageIndex": 79,
      "PostDate": "14/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "LMVerna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
      "Content": "Dec 31, 2014 09:19AM LMVerna wrote: mean mom--I opted for the mastectomy and was originally told if I did that then no chemo or radiation. Of course they then found more on pathology so then I still had to do radiation and chemo and still have to finish reconstructive surgery. There are no easy options. Jlynn--I also did have to do a bolus. I did it for every treatment except the boosts. Mine was like a wet pillowcase. It seems like it is used sometimes following mastectomy. The bad part for me was that I have pretty sever skin reactions--blistering peeling and quite a bit of discomfort. I finished Monday and am still waiting to start feeling better.",
      "MessageIndex": 617,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "LMVerna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
      "Content": "Nov 13, 2014 06:30PM LMVerna wrote: CoyoteNV, I like the idea of posting the group at the top. I am new to posting, but it seems like a new idea. CAS4, I hope that I will start sleeping through the night. I hate how I am so tired but can't get a good night sleep. I did feel a bond with some of my chemo buddies. There were a couple other women dealing with breast cancer and we did share some of our stories and issues with each other. However, it seemed like they were at different points in their lives than me (one was very young and the other was much older) so we didn't really have some of the same issues outside of chemo, etc. I did find a few other ladies in my community who I knew but didn't realize they had been through breast cancer that I am trying to connect with. It is good to be able to talk with others, commiserate, and share tips for things that help.",
      "MessageIndex": 76,
      "PostDate": "13/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "LMVerna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
      "Content": "Dec 10, 2014 03:54PM LMVerna wrote: Hi All, Finished #16 today. I am red and tan/brown especially under my arm. Feeling a lot of burning there too. Itchy rash on my chest. I also had to do my Herceptin infusion today so it was a long day at the hospital. Feeling really fatigued and down today too. I guess it is also my day for a pity party but this too shall pass. Looking forward to being done before the new year!",
      "MessageIndex": 355,
      "PostDate": "10/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "LMVerna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
      "Content": "Dec 18, 2014 02:48PM LMVerna wrote: Hi Poppy, I have medium skin. I am fair but I tend to tan more than burn. I did well but have recently started having skin reactions now. I just finished dose 22. My RO recommends not using any skin care products until you start showing reactions. I did well for very long but recently have gotten red across the treated area, a few red bumps in the cleavage area with a little itching. My worst area is my side/armpit which has turned dark tan with a little brown patch. It is uncomfortable at times. I have used aquaphor when my skin started getting pink and have just started silvadene in the armpit area. Just today I started with rib pain and feeling tired. My doctor did expect me to show more skin reactions since I have had a mastectomy and have tissue expander in place. She explained that since I don't have breast tissue to radiate, they need to concentrate on the little bit of tissue that is very close to the skin so sometimes the skin gets hit harder. I started radiation just 1 week out of taxol so I was tired when I started and then got energy back but now tired again. Can't tell if the tired is from radiation or just doing too much getting ready for the holidays plus having my mother in the hospital. Probably just running myself too much and now I am feeling it. Its hard to concentrate on yourself when you have to be a caretaker for another too. It is helpful reading everything here and commiserating with people going through the same thing as you. I will be finishing before the new year which will be nice--wish it wasn't over the holidays when two of my kids are home from college but what can you do. It will be over soon and then just have to finish taking Herceptin until August and undergo my reconstruction surgeries. This too shall pass.",
      "MessageIndex": 457,
      "PostDate": "18/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "LMVerna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
      "Content": "Dec 29, 2014 05:33PM LMVerna wrote: I did it! I am done with radiation. I cried today when I got to ring the bell-partly happy tears and partly tears because I have been feeling so lousy lately. One step closer to being done but it still seems so far away--still on Herceptin until end of August, will start on my AI drug soon, and still need to finish with reconstructive surgeries. But I think the worst parts of it are over. Past week has been really tough with a lot of skin irritation/blisters/peeling and quite a bit of pain. Also some fatigue. RO said she expected the skin issues since we were targeting my chest wall area and also since my skin is fair. I have been taking ibuprofen all during the day and percocet at night so that I can sleep. Also applying lotion several times a day. I felt like I have been being overdramatic with how I feel but even the techs today told me that my skin issues are very bad and that I have been a trooper through it all. Don't know if they were just being nice but it did help me feel a little better. Can't wait until it starts feeling better. How long did it take other people's skin to clear up after you were done with treatments? ",
      "MessageIndex": 593,
      "PostDate": "29/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "LMVerna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
      "Content": "Nov 13, 2014 06:26AM LMVerna wrote: Hi All, Just finished my weekly taxol yesterday. I will continue to receive Herceptin every three weeks for the year. I am starting radiation on Tuesday. I had my simulation earlier this week. I am still feeling run down from the taxol and am a little worried about starting right in on the radiation without much recovery time. However, I am also anxious to just keep the process moving along so I can get it all done. I think I will be looking at 27-30 treatments. Not sure exact number yet.",
      "MessageIndex": 67,
      "PostDate": "13/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "LMVerna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
      "Content": "Jan 9, 2015 02:57PM LMVerna wrote: Hi Salty, I was also in the gray area and had a hard time deciding to do radiation. I had a big mental block about doing the radiation, but I did it and i am done. It sucked, not as much as chemo, but it was no picnic. I'm 2 1/2 weeks out and am starting to feel better now. My skin is still not pretty--still peeling but at least the blisters have heeled over. However, it is better than a recurrence. I talked with my oncology nurse practitioner about trying to decide and she said even if it only gives you a 1% less chance of recurrence, that can make a big difference. I made the decision that no matter what, I wanted to do whatever I could. I have 3 kids and I want to see them graduate, get married, have kids, etc. There are no guarantees with any of this treatment stuff but I think we are all a lot stronger than we even know and we just get through it. We have our meltdowns and rants but there is a lot of support to get through it. Good luck with whatever you decide.",
      "MessageIndex": 832,
      "PostDate": "09/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "LMVerna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
      "Content": "Jan 14, 2015 06:44PM LMVerna wrote: Sandy I agree. I am watchful of the signs of depression. It is hard when everyone is so happy for me because I am \"done\" but I'm really not. Herceptin continues until August. Still looking at two more reconstruction surgeries. Feels like I am still so far from the finish line and this has been going on since June. Most days I can look and be grateful to have made it past the radiation hurdle but some days it is very hard.",
      "MessageIndex": 955,
      "PostDate": "14/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "LMVerna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
      "Content": "Dec 2, 2014 03:01PM LMVerna wrote: Hi Sandy, I also got a little teary my first couple of times. I finished #10 today and that aspect of it has gotten easier. I think we all have our \"poor me\" moments. I don't think it would be normal if we never did. As long as they go away and we have our more \"normal\" days it is fine. Of course, my \"normal' days now are not what they used to be. Hopefully when treatments are done, hair grows back and reconstruction is done, I will again have my new normal! I have been doing pretty good. My skin is starting to get a little pink. It is very tender under my \"breastlet\" (what I call my mastectomy with tissue expander that is much smaller than my other breast). I am also tender under my arm and it is starting to hurt when I raise my arm which was not a problem before surgery. I saw my RO today and she is happy with how things look. I am also having joint/bone pain. Don't know if that is leftover from chemo or if it could be related to radiation. On a positive note, I have had a little more energy lately. I think chemo is washing out of my system and fatigue hasn't hit from the radiation. It was perfect timing so I could enjoy my two college kids who were home last week. Lets see how long the energy lasts! ",
      "MessageIndex": 245,
      "PostDate": "02/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "LMVerna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
      "Content": "Dec 26, 2014 05:43PM LMVerna wrote: Hope50: I finished chemo (Taxol) 11/12 and then started right into radiation. I have one more radiation treatment to go and am continuing on herceptin. I was getting very depressed because my hair didn't seem to be growing at all other than a couple very fine hairs. To make it worse, i hadn't lost my eyebrows or eyelashes during chemo but then they fell out during radiation. I kept joking with my daughter that all i wanted for Christmas was my hair to grow back. The day before Christmas, I could actually see some hair growth starting. It no longer feels prickly and is starting to get soft. I guess it is my Christmas miracle. I can't wait for the day I don't need the head scarf or wig...",
      "MessageIndex": 552,
      "PostDate": "26/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "LMVerna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
      "Content": "Jan 14, 2015 05:47PM LMVerna wrote: Hope, I finished my rads 2 weeks ago and instead of joy, I have also had the blues. I blamed it on my skin irritation but that has cleared up immensely but still feeling blah. I actually went a whole week without a treatment or doctors appointment! Of course my son had his wisdom teeth out during that week so I took him to two appointments! I think the extremely cold weather hasn't helped either. Still feeling very fatigued. On the upside, my skin is much better and my reaction had been pretty severe. Even the techs had said it was one of the worst they had seen. I had my follow up appt with my RO and she thought I looked good. She gave me a big hug and said she was very relieved because she had been worried about me. It's nice to feel like your doctor cares. It was weird when she said she didn't need to see me for 4-5 months.",
      "MessageIndex": 953,
      "PostDate": "14/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "LMVerna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
      "Content": "Nov 18, 2014 10:29AM LMVerna wrote: Just had my first treatment. Everything went fine. Worst part was laying with hands up over head which makes my shoulders hurt. Also got more tattoos. They say that was the worst of it as far as the treatments go. All the others will be quicker than this one. The staff was so nice which is very helpful. They really try to make it as nice an experience as possible. I feel better knowing now what the treatments will be like. Fear of the unknown is always hard for me. Hopefully, I will be finishing up between Christmas and New Year's depending on the exact number of treatments.",
      "MessageIndex": 114,
      "PostDate": "18/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "LMVerna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207182/profile",
      "Content": "Nov 23, 2014 01:05PM LMVerna wrote: Hi Perfectly, I have had my first 4 treatments. I also have had a mastectomy on the right side with tissue expanders and nothing on the left breast. I will also be getting a reduction and lift on that side when I have my implants done. For my radiation, they do remove my gown. I have tattoos on both sides. They do try to cover the breast area on the left side but need to be able to see all the tattoos for alignment. In addition, since my radiation is aimed more at my chest wall since I don't have a breast, they cover me with a wet pillowcase for my treatments to bring the radiation closer to the skin. When they do this, it covers both breasts. I was also a little hesitant at first about being exposed, especially since at the first treatment,one of the techs was male. There usually are two techs lining me up. They have been so kind and respectful, that after the first day where I was a little uncomfortable, it is much more routine now. They really try to make it as comfortable as possible. I do close my eyes during the treatment and try to think of other things but I have not found it to be a bad experience at all. I do ask them questions too and they are very helpful in answering them. Good luck!",
      "MessageIndex": 172,
      "PostDate": "23/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    }
  ]
}