{
  "AuthorID": "Lnf",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
  "Posts": [
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "Lnf wrote: I had a visit with my oncologists today. After 3 months on ibrance and letrozole I had stable breast tumor with shrinking lymph nodes. I also had a newly enlarged left hilar lymph node and two enlarged right hilar lymph nodes. Also numerous new and enlarging pulmonary nodules through both lungs now. My oncologist had asked me if I had smoked. Then he went on to mention possibility of lymphoma. When I mentioned the possibility of the nodes in the chest having a different hormone receptor, he didn't say much. I came home and I went online and was reading about breast metastasis to the hilar lymph nodes. I was unable to find much information. I will have another lung biopsy in about 3 weeks. The waiting is really hard to find out whether this is breast metastasis or possibly a different type of cancer. I was just wondering if there's anyone else out there who's had breast metastasis to the hilar lymph nodes. Dx 2/5/2018, IDC, Right, 4cm, Stage IV, metastasized to lungs, Grade 2, ER+/PR+, HER2- (FISH) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864800",
      "Title": "Mets to mediastinum and hila Lnf Ashlyn"
    },
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "May 17, 2018 07:42PM Lnf wrote: Just had my first 3 month scan. I have numerous new and enlarging pulmonary nodules through out both lungs now. Newly enlarged left and right hilar lymph nodes. Also possible L4 vertebrate metastases. I was hoping for at least stable. If ibrance is not working for me, what's next chemo. So scared.",
      "MessageIndex": 1965,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "May 18, 2018 06:08AM Lnf wrote: MissMonty, may I ask how bad your progression was on your first treatment? Mine is a little good with some bad. My breast tumor is stable and unchanged and the under arm lymph nodes have shrunk. But the rest sounds like a lot of progression. So I wonder if she will want to try to stay the course. I did call the office, but she's out until the 29. They are supposed to have another doctor give me a call. I guess I just want them to give me some reassurance that this can be treated. I feel like all this waotong is just letting the cancer grow. Ive never been so scared.",
      "MessageIndex": 1967,
      "PostDate": "18/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "May 13, 2018 05:58AM Lnf wrote: Ashlyn, thank you for the positive thoughts. I hope in 6 months I can mentally be feeling better. Bright55, thank you for the good tips. No ibrance for you?",
      "MessageIndex": 1960,
      "PostDate": "13/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "May 18, 2018 11:19AM Lnf wrote: MissMonty, when I reread your message it about your first scan it sounds quite a bit like mine reads. No change in breast tumor underarm lymph nodes smaller but lung nodes increased in size and number. Thanks for that, it does make me feel a little better. This doctor also said that there's a possibility that I just have not been on the medication long enough for it just really start working on the lung nodes. So for the time being I'm staying on the ibrance and letrozole and just waiting for my appointment for the second lung biopsy.",
      "MessageIndex": 1970,
      "PostDate": "18/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "Jul 12, 2018 02:13PM Lnf wrote: Hello eveyone, its been a while since I've checked in. Hope everyone is doing well. I went into the hospital for two days to have a lung resection biopsy because my ct scan showed mix results. The ibrance and letrozole were not working on the nodes in my lungs. The lab in trying to determine the type of cancer in my lungs ran a test for neuro endocrine cells. The results were positive. They determined that the cancer in my lungs is breast cancer and like my breast tumor is ER/PR positive her2 negative, but is also a highly neuro endocrine type. My oncologist ask the lab to pull my breast biopsy specimens from January and test them. They also came back positive for neuroendocrine. Now my doctor tells me that I have a a rare form of breast cancer. I will no longer be on letrozole and ibrance. So I'm waiting for approval on a chemo that's generally used on lung cancers and other cancers that have neural endocrine cells, Etoposide. I will also be on Cisplatin. She says after they shrink the tumors down then I will be on two maintenance drugs. I can't remember the names. It's all been a bit much for me to take in but I'm adjusting.",
      "MessageIndex": 1989,
      "PostDate": "12/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "May 10, 2018 11:40AM - edited May 10, 2018 02:15PM by Lnf I have looked at a couple other cancer sites and this is the first one I found where there's much conversation about lung Mets. I was diagnosed stage 4 from the start with lung Mets to my left lung in early February 2018. I have 10 to 20 nodes in my left lung the largest being 9mm which was biopsied. I am er, pr+, her2- and on letrozole and ibrance. I just finished my third cycle and I've had issues after the second and third Cycles with low neutrophils. I had to take a second week off. When I start back up I will be starting on a lower dose, 100 mg. I will have my first scan after starting medication next Tuesday. I'm so frightened and depressed by this disease. All I can think about is how much time do I have. When I go online and read I see where women who have bone Mets can live several years but the prognosis for anyone with cancer in their soft tissues is not good. Is there anyone who's lived several years with it in their lung? ",
      "MessageIndex": 1951,
      "PostDate": "10/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "May 10, 2018 06:11PM Lnf wrote: singlemom1, thank you for responding to me. I was having a bit of a meltdown today and needed some reassurance. Glad to hear you are doing well. This is all so new and unbelievable for me. I keep telling myself that I feel good and not to let this get me down. Hopefully I will have a good response to the ibrance.",
      "MessageIndex": 1957,
      "PostDate": "10/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "May 18, 2018 11:15AM Lnf wrote: MissMonty, I received a call back from one of the doctors I seen on two other occasions. He said there is some concern about what's going on with my lungs but not to worry because they would figure it out. I'm now waiting for a call back from the office on a appointment for another lung biopsy. Before I guess the node was only 9 mm and so there was difficulty getting a good sample. So this doctor wants to have them biopsy the same node which is now at one centimeter. He said that they would be able determine the hormone receptors on this sample and decide as to whether it's really breast cancer or possibly lung cancer.",
      "MessageIndex": 1969,
      "PostDate": "18/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "Jun 13, 2018 10:06AM Lnf wrote: I'm off work for a week because neutrophils are at .4. So I'm unable to start cycle 5 of my 100 mg ibrance. I will continue to be off of it because on the 27th of June I'm going to go into the hospital for 2 days. I will be having a lung resection where they will remove at least two nodes. To test for the type of cancer. If it's breast cancer, to check for hormone status change. They decided that if they try to use a bronchial scope procedure on the enlarged hilar lymph nodes that they could end up with inconclusive results. I've been told that once they remove the drainage tubes from the procedure they will send me home and I will be suffering extreme fatigue for a few weeks and unable to lift more than 10 lbs for 6 weeks. Not real happy about that but at least I'll have some answers. I have a feeling my oncologist is going to take me off the ibrance and put me on a chemo.",
      "MessageIndex": 1983,
      "PostDate": "13/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "Jul 12, 2018 02:20PM Lnf wrote: MY oncologist told me that she's going to take my case before the tumor board at my hospital for input from other oncologist. She said it would also be a learning experience for all the doctors. I did Google neuroendocrine breast cancer and find that most of the Articles say only 1% of all breast cancers are of that type. Such a lucky girl.",
      "MessageIndex": 1990,
      "PostDate": "12/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "Jul 14, 2018 07:48AM Lnf wrote: My oncologists scheduled a hearing test, bone and ct scans on Thursday. Got the result back on Friday. No suprises with the ct scan because we already knew the nodes in the lungs were increasing. The bone scan show in 6 months i went from nothing to mets in scapula, femur, upper spine, and ten spots on the skull. My hearing test came back with ringing in the ears and Mild to moderate hearing loss. Which was no surprise to me. So I had a phone conversation with Dr. She said she is going to change up the chemo. Because of my hearing she changing the crisplatin to Carboplatin and instead of v-16 to taxo. She said 3 cycles then a ct scan and if it's working 3 more cycles. After that hormone inhibitors for maintenance.",
      "MessageIndex": 1992,
      "PostDate": "14/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "May 10, 2018 06:28PM Lnf wrote: Jylea, you're right I am mourning my old life. I hope that eventually I will adjust because right now I feel like I'm going crazy. It's a bit distressing to think that I'm going to have to take a lower dose of the ibrance but I've been assured that it will still be as effective. Thank you for telling me that it took three sets of scans before you saw results. I'm just hoping that I will see stable results on this first scan. At times I can forget about the lung nodes because I can't feel them and they aren't causing any breathing issues. The breast tumor is a constant reminder and there's been no change there. Thank you",
      "MessageIndex": 1958,
      "PostDate": "10/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "May 15, 2018 09:46AM Lnf wrote: mirryp, 7 years. That definitely gives me hope for a future. Thank you for sharing. Good luck with your bone issues",
      "MessageIndex": 1964,
      "PostDate": "15/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Lnf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273800/profile",
      "Content": "May 18, 2018 06:46PM Lnf wrote: Kaylee, by mixed results on your first scan, do you mean you had some progression and some stable? I originally had 10 to 20 nodes in my left lung. Now according this CT I have numerous new nodes in both lungs. With increase in existing nodes. Increase in hilar lymph nodes. It seems like a lot of progression. I'm hoping when I see my oncologist that she's not as concerned by the results of the CT.",
      "MessageIndex": 1972,
      "PostDate": "18/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    }
  ]
}