{
  "AuthorID": "lobelia",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102628/profile",
  "Posts": [
    {
      "AuthorID": "lobelia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102628/profile",
      "Content": "lobelia wrote: Hi, I am 65 and previously had a total hysterectomy due to severe endometriosis 8 years ago.  Recently, after annual & diagnostic mammograms, I had a stereotactic biopsy with conflicting opinions.  First path opinion diagnosis was \"severe epithelial hyperplasia\".  Second opinion at a Comprehensive Breast Center was \"Focal atyical ductal hyperplasia with cribriform pattern, Fibrocystic & columnar cell change, ductal microcalfications present.\"  Just underwent wire placement with surgical excision biopsy of that area in left breast.  Path report found no evidence of cancer or ADH.  Had second opinion on path done at Vanderbilt by Dr. David Page and they concurred with the first.  Breast surgeon says the stereotactic biopsy must have removed all the ADH.  Now he is meeting with his entire \"team\" to discuss possible recommendation of partial breast radiation.  I am a former runner and now a walker.  Is this overkill? What about diet, or other non-traditional more healthy options?  My husband is currently undergoing proton beam radiation for prostate cancer (former marathon runner).  I am very aware of the dangers of regular radiation on left breast and not eager to consider it.  Has anyone in my position had this recommended? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/753151",
      "Title": "ADH, family history unavailable (adopted) lobelia awb"
    },
    {
      "AuthorID": "lobelia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102628/profile",
      "Content": "Aug 3, 2010 03:00PM lobelia wrote: Thanks for all the replies.  My breast surgeon and I have agreed upon close surveillance at this time.  Since the ADH was only found in the core biopsy and not the surgical biopsy, radiation has been removed as an option at this time.  I will return for examination on Sept 7, 2010 (3mo after surgical biopsy).  I am still on low dose estrogen (Vivelle dot) because of osteoporosis and prior total hysterectomy.  I am seeking info on bio-identical hormones as an option.",
      "MessageIndex": 12,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/753151",
      "Title": "ADH, family history unavailable (adopted) lobelia awb"
    }
  ]
}