{
  "AuthorID": "LoisAnn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77067/profile",
  "Posts": [{
    "AuthorID": "LoisAnn",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77067/profile",
    "Content": "Dec 30, 2008 01:02AM LoisAnn wrote: Tuesday I will be 6 wks post op from my bilateral mastectomy with expanders. I also am feeling frustration with my recovery. I have experienced extreme fatigue.  Two weeks ago when I  expressed my extreme tiredness to the Dr he said I needed to cut back/ stop my pain relievers. I was prescribed percocet. Trying to be the good patient I cut back to just 2 in the morning. By Friday I called and talked to the nurse. I wasn't sleeping well and couldn't function. She told me to take what I needed and when I met with the Dr on Monday he agreed I needed to continue with my meds in the morning and in the evening to help sleep.  I have been expanded 4 times with one more to come on Jan 7. My discomfort has increased as my expansions have increased. I have sought some care from my chiropractor to help deal with the pain, fatigue, and sleep issues.  I can get to sleep, but getting comfortable is a challenge. When I move at night I wake up. If I wake up and need to go to the bathroom it is hard for me to get up because I am so tired. In the morning it takes everything I have to get out of bed. My body aches from the lack of physical activiy.  My pain meds help me tremendously in the morning, they do not make me sleepy. My system doesn't really react to them with sleepiness. I expected to be farther along and feeling better than I do. I am to start radiation the end of January and from what I hear that makes you tired too. I can't imagine being more tired than I am now. Fran I empathize with you. I think I know how you feel. I try to stay focused on the final results and know that this is a season and this too shall pass. I would love to stay in touch and encourage each other. Be Blessed, LoisAnn",
    "MessageIndex": 3,
    "PostDate": "30/12/2008",
    "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726524",
    "Title": "Frustrated With Recovery flb1011 2Hands4me"
  }]
}