{
  "AuthorID": "Lola123",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144220/profile",
  "Posts": [
    {
      "AuthorID": "Lola123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144220/profile",
      "Content": "Jan 31, 2012 04:19PM Lola123 wrote: Hello everyone! I hope you don't mind me barging in... I'm 22 and have hodgkin's disease. I have finished my 8 long months of chemo but my doctors still want me doing rads afterwards for 20 days as I had extensive chest disease. This whole experience has been so overwhelming. I don't think my life will ever be the same. I'm scared of skipping rads and relapsing...but also terrified of the secondary cancer risks. I have just recently started researching prophylactic mastectomies. Not immediately, but having it done in 3 or 4 years from now. Or maybe I should have children first? I'm not sure. What do you guys think of my approach? I have seen some pics and they look incredible, so I'm not so worried aesthetically. Seems like plastic surgeons can do miracles! I'm interested in the skin sparing type. Would I be able to keep my nipples? I'm so sorry, I don't know anything about this topic so I'll keep on researching, but my jaw dropped when I saw a hodgkins survivor topic so I instantly had to post. Thank for your time, you're all a great inspiration and I hope everyone is doing well!",
      "MessageIndex": 89,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "Lola123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144220/profile",
      "Content": "Feb 1, 2012 04:33PM Lola123 wrote: Thanks Lifelover! This really seems like a great place for support. While it did scare me a little to see so many secondary cancers, it also cheered me up that all of you lived past Hodgkins. So that gives me hope that I'll be able to go back to a \"normal\" life too. I am very interested in prophylactic mastectomies, so this is a very good place for information. It's not in my immediate future, but I would like to get one in a few years. I figured having children first would be better so I could breastfeed. I'm always reading how important it is for babies to be breastfed for at least a few months...so I might wait a little for the mastectomy. Im a member on a lymphoma board and just by glancing can understand everyone's signature over there and what it means. I read all of yours...and it's Greek to me lol. But I will keep on researching here on the board. Information is power! Hope you're all doing well =)",
      "MessageIndex": 91,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    }
  ]
}