{
  "AuthorID": "Lolalee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159049/profile",
  "Posts": [
    {
      "AuthorID": "Lolalee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159049/profile",
      "Content": "Feb 27, 2013 05:12AM - edited Feb 27, 2013 05:46AM by Lolalee I would be asking for an MRI with contrast.  I would be wanting a definite answer, sometimes the only way to get a conclusive answer is to do a surgical biopsy.  The tissue can then be examined under a microscope.  A mammo in 2002 showed I had micro calcification, subsequent mammos did not show anything suspicious...fast forward to 2012 and DCIS was discovered in the exact same spots that showed micro calcification in 2002. In hindsight I should have insisted on a lumpectomy and I would now not be missing a breast. Go with you gut instincts and keep questioning the breast surgeons. I should add that I would ask to see the doctor reporting on your scans and have him look at the MRI, ultrasound and mammogram at the one time.  Quite often scans are reported on by different doctors.  Ask for an appointment with the reporting doctor (unusual but gets their attention). You need to establish a personal approach with the doctor reporting on your scans as his opinion is so important.  Best wishes, Lola. ",
      "MessageIndex": 6,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801097",
      "Title": "End of my tether don't know which way to turn fenella fenella"
    },
    {
      "AuthorID": "Lolalee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159049/profile",
      "Content": "Mar 13, 2013 08:24PM Lolalee wrote: Dear Bella, thinking of you today and hope you get some answers and have a good outcome. Best wishes Lola.",
      "MessageIndex": 15,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/801587",
      "Title": "DCIS diagnosis bella42771 sjd2012"
    },
    {
      "AuthorID": "Lolalee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159049/profile",
      "Content": "Mar 21, 2013 10:08PM - edited Mar 21, 2013 10:09PM by Lolalee Hello Sara,  I am sorry you are having to go through this and that your DCIS was discovered in such a way.  My DCIS was discovered through annual mammo and was very easily seen on the mammogram. I have not heard of many ladies having their DCIS discovered during breast reduction but as it is DCIS it is very treatable. DCIS is usually treated with lumpectomy and radiotherapy.  Sometimes a mastectomy may be recommended if the lesion is large and widespread. Your doctors will know more once the scans are complete.  Please do not panic as treatment is very doable. I am sure Beesie, our resident DCIS specialist will be able to give you more help and information and allay your fears. Hang in there and know you have come to the right place for support and information from those who have also been treated for DCIS. Best wishes, Lola. ",
      "MessageIndex": 20,
      "PostDate": "21/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/801587",
      "Title": "DCIS diagnosis bella42771 sjd2012"
    },
    {
      "AuthorID": "Lolalee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159049/profile",
      "Content": "Jan 12, 2013 08:49PM Lolalee wrote: Hi NSJ2, I would like to add my experience.  I had lumpectomy for 11mm DCIS and was recommended to have radiotherapy.  I had the simulation and planning and went along for first treatment.  I asked that they draw on my chest exactly where the radiation was to hit. Imagine my surprise when the markings included a huge area, up to clavicle bone, along the sternum, down to abdomen and under arm.  I immediately stopped treatment and asked to see the RO to discuss this plan.  The RO said that this was standard procedure for my left side DCIS even though I had small area and no node involvement. As Varod said the sternum was not the actual target but it was hit anyway, probably with a lower dose because the breast tissue does extend to that area. I am sorry this does not answer Hello 12's question however.  The radiation pain may settle down after a while. I am surprised the MO or RO could not answer your questions exactly. I hope your Mom does get some relief and quickly having such pain is a terrible way to live. My best wishes to you both.",
      "MessageIndex": 8,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/763131",
      "Title": "Radiation to the Sternum Hello12 Lolalee"
    },
    {
      "AuthorID": "Lolalee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159049/profile",
      "Content": "Mar 9, 2013 09:31AM Lolalee wrote: Bella, it is a huge shock to receive a diagnosis of breast cancer, however  DCIS is very treatable and you will feel better once a plan of treatment is formulated for you. There are many of us on these boards with the same diagnosis and have successfully completed treatment or still in the midst of treatment so please ask any questions as the lovely ladies here will be happy to answer. Just know you are not alone! Best wishes, Lola.",
      "MessageIndex": 10,
      "PostDate": "09/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/801587",
      "Title": "DCIS diagnosis bella42771 sjd2012"
    }
  ]
}