{
  "AuthorID": "Lolly",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60038/profile",
  "Posts": [
    {
      "AuthorID": "Lolly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60038/profile",
      "Content": "Dec 3, 2007 05:44AM Lolly wrote: I just got my results from my core biopsy.  Evidentally, the fine needle biopsy can appear to have atypical cells when it is really just due to hormonal changes. So not only do I not have cancer, but I do not even have ADH as previously thought.  I know I am one of the lucky ones.  I wish all of you were too.  It is a true measure of character to reach out, support, and encourage others when you are going through your own personal Hell.  You are all truly remarkable women and I will never forget the kindness and support I have received.  Leaf, you especially took so much time to help me and explain things to me.  Thank you, thank you, thank you!  Cyber hugs to all of you!",
      "MessageIndex": 12,
      "PostDate": "03/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/696253",
      "Title": "What does having atypical cell really mean? Lolly BBJJBB"
    },
    {
      "AuthorID": "Lolly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60038/profile",
      "Content": "Dec 1, 2007 11:43PM Lolly wrote: I really appreciate everyone's help on this.  I am the first in my family to face breast cancer issues- which is great-but also it means I have no background knowledge in it.  Also, my family (DH and 4 little ones) and I live overseas in a developing country where there is not good medical care, so I am on my own in London for testing.  Because we are on assignment with the US Gov., I have lost my medical clearance and cannot join my family again until this is taken care of...so I am so grateful for all the support!",
      "MessageIndex": 6,
      "PostDate": "01/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/696253",
      "Title": "What does having atypical cell really mean? Lolly BBJJBB"
    },
    {
      "AuthorID": "Lolly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60038/profile",
      "Content": "Dec 2, 2007 04:06AM Lolly wrote: I have to admit that some of the numbers and pecentages really worried me!  Thanks for clearing them up a little.  Tomorrow I will get the results from my core.  I know so much more of what to ask.  I do have one more question.  Certainly I will get the pathology report, but since I will be in a different country, I am wondering if I should try to get either my biopsy specimens  (I heard they save them in wax) or my slides in case my docs in the USA want them reread?  I am at a very good facility in London and I am assuming they can send things that a doctor back home might need, but it might be easier if I have these things in my possesion.  Do they ever give those things up or are they afraid of lawsuits???  Or does it sound like a crazy idea?",
      "MessageIndex": 8,
      "PostDate": "02/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/696253",
      "Title": "What does having atypical cell really mean? Lolly BBJJBB"
    },
    {
      "AuthorID": "Lolly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60038/profile",
      "Content": "Dec 2, 2007 06:18AM Lolly wrote: I will ask for them.  I already have my mammos and sonograms, though believe it or not, neither showed any lump- but the doctors and I could all feel it.  And to think some women think they are in the clear just by their mammos!",
      "MessageIndex": 10,
      "PostDate": "02/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/696253",
      "Title": "What does having atypical cell really mean? Lolly BBJJBB"
    },
    {
      "AuthorID": "Lolly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60038/profile",
      "Content": "Lolly wrote: My fine needle biopsy came back with atypical cells.  I was under the impression that before the biopsy, my chances were 80% that it is not cancer.  I went back for a core biopsy, but need to wait several days for the results.  What exactly does having atypical cells mean?  What is the likelihood of them being cancerous- 20%, 50%, 100%?  Every test I have at the docs they say there is nothing to worry about but I keep finding myself deeper into this.  I would just like a realistic opinion.  If any of you know, I would appreciate a response. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/696253",
      "Title": "What does having atypical cell really mean? Lolly BBJJBB"
    },
    {
      "AuthorID": "Lolly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60038/profile",
      "Content": "Dec 1, 2007 10:16AM - edited Dec 1, 2007 10:17AM by Lolly Thank you, Leaf, for your information.  I really want to be able to walk in the doctor's office with a little knowledge of what might be going on so I can ask the right questions.  You have been SO helpful.  -Lolly",
      "MessageIndex": 2,
      "PostDate": "01/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/696253",
      "Title": "What does having atypical cell really mean? Lolly BBJJBB"
    }
  ]
}