{
  "AuthorID": "LoneStarGirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159674/profile",
  "Posts": [{
    "AuthorID": "LoneStarGirl",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159674/profile",
    "Content": "LoneStarGirl wrote: Hello all - I have lurked on the boards before but have never posted. I go in tomorrow for an ultrasound to look at 3 new lumps, but before I get into that I would like to share a little of my history. Firstly, my family has no history of cancer that I am aware of other than my grandfather passing of lung/throat cancer (he was a smoker). About a year and a half ago I noticed a lump during a self exam which I ended up getting a biopsy of. They couldn't distinguish whether it was a phyllodes tumor or not, and recommended I get the marble size lump excised for biopsy. I did, they said it was a benign fibroadenoma afterall, and I was good to go. Around May this year, I noticed a new lump in my opposite breast. Again, got a biopsy, and they said it was another fibroadenoma. Given the option, I opted to leave it in as it was 1.5cm and monitor for growth. Now a few months later I believe it is growing and feel a new lump right next to it. I have also found two additional lumps in my original affected breast, one feels fairly large and directly below the original excision sight, and one more lateral as well. My doctor felt these, and ordered an ultrasound for tomorrow. She said if the confirmed fibroadenoma does indeed show growth, she recommends it be taken out. If that is the case, I told her I want the 3 new lumps taken out of both breasts at the same time if they are confirmed solid. I want to avoid biopsy on 3 additional lumps. I don't want them in even if they are just fibroadenomas as I don't want to give them the chance to grow too. My doctor told me she has a similar patient who has a history of multiple fibroadenomas, who just last week insisted they be removed even though they were fairly confident it was just another fibroadenoma. It wasn't, and it was an eye opening experience for my doctor to always remain vigilant in getting these new lumps diagnosed regardless of your history. I am of course a little nervous about what they find tomorrow. But I guess what I am looking to get out of posting here is for input from woman who have maybe had, or know somebody who has had, similar experiences and how they coped. I feel like my breasts are going to keep spitting these out, and I feel like I have a future of poking/proding and anxious waiting to look forward to. I have already decideed if any lump comes back as anything other than benign, with the level of activity in my ladies, I am saying dueces and will gladly part ways. I can deal with surgery, I can deal with treatment if need be, but this third go of waiting and seeing is trying on my nerves!  Any words of encouragement or insight would be much appreciated. Thank you all for your inspiration and words of wisdom!!! Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "30/08/2012",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/792775",
    "Title": "26 y/o - history of fibroadenomas / 3 new lumps LoneStarGirl Sommer43"
  }]
}