{
  "AuthorID": "looking4answers",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12276/profile",
  "Posts": [
    {
      "AuthorID": "looking4answers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12276/profile",
      "Content": "looking4answers wrote: Hi Ladies, I don't honestly know if this is out there or not.  But from my experience with what my mom is going through BC 2001 - METS in bone 2005 - with all of the chemo treatments, rads, meds for pain & neuropathy & shots for blood count boosts & blood transfusions & the list can go on and on.  Is there a \"service\" or \"person\" other than her oncologist who can help with tracking and making good informed decisions as to diet, meds, new and upcoming trx, pain meds, etc...  I guess what I'm trying to see if is there a person in the hospital or cancer treatment facility that can be like a personal liason to the patient?  Maybe like a Cancer social worker?  Someone who knows the cancer patients situation thoroughly.  Does anyone have someone like this or a program setup at their hospital?  I try to know as much as I possibly can about my moms situation, but I don't have the inside knowledge & training. Any information would be appreciated.  Gentle Hugs, Gloria Never look down upon someone unless you’re helping them up Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726022",
      "Title": "Gathering all the facts looking4answers Judiiiii"
    },
    {
      "AuthorID": "looking4answers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12276/profile",
      "Content": "looking4answers wrote: It's been a while since I've posted.  I had such a hard time coming back to the site with everything going on with my mom (I stress myself out), but she really needs help. To refresh:  Mom was diagnosed Feb 2001 w/ Stage II breast carcinoma, positive Estrogen Receptor and weak positive HER2.  She underwent an excisional biopsy and they found extensive invasive lobular cancer extending to the ink resection margins.  She underwent a right radical modified mastectomy and axillary nodal dissection, which revealed invasive lobular carcinoma of a large size.  Three out of 14 lymph nodes were positive.  She started w/Cytoxan and Adriamycin (4 cycles) then Taxol (4 cycles) Then Tamoxifen for approx 4 years.  (Sorry for the medical terms, I don't even completely understand them all, I copied the info. from her doctors letter to get a second opinion). THEN in June 2005 she complained about pain in her right shoulder - Doctor later requested PET scan that showed mets (with extensive skeletal mets) - they stopped Tamoxifen.  She then started Zometa and Faslodex. NOW: She has been changing from one chemo to another ever since JUNE OF 2005  (over TWO years of chemo treatments along w/radiation at certain times).  Ondansetron HCL & TX/PROPH/DG ADDL SEQ IV & Desamethasone Sodium // Cyclophosphamide 500 MG & Epirubicin HCL 2 MG // Epoetin Alfa, Non-ESRD & Filgrastim 480 MCG & Zoledronic // Nothing is really getting better - if anything it most likely has gotten worse. She is currently in the hospital (for the past week and a half) in severe pain.  We thought it might have been \"Breakthrough Pain\", but it has been constant for the whole time she's been in the hospital.  They have tried so many different pain meds (my dad has a list but unfortunately, he's not here right now for me to list them), but all of them have been making her sick to her stomach.  The current pain meds she is on right now: Oxycontin along w/the Duragesic Patch.  She is tolerating this somewhat, but still has the \"butterfly\" feelings in her stomach. Is there anyone that might have any suggestions as to help her?  Either with suggestions of chemo, pain meds, etc...  I don't know what else to do.  I have suggested to my parents that they should consider looking into a different hospital/doctor - they aren't too keen on the current doctor/hospital (metro Detroit area - Michigan),  I have suggested Karmanos & University of MI, but they like how close St. John's is to their home (approx. 5 minute drive).  Any ideas or thoughts are deeply appreciated. Thank you, Gloria Never look down upon someone unless you’re helping them up Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693871",
      "Title": "Pain Management - need help looking4answers LuAnnH"
    }
  ]
}