{
  "AuthorID": "lopsided_blogger",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68807/profile",
  "Posts": [
    {
      "AuthorID": "lopsided_blogger",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68807/profile",
      "Content": "lopsided_blogger wrote: I finished chemo, ACT, in August 07 and a year of Herceptin in April 08. My wbc and absolute neutriphil count has been coming up steadily since April 08, but now it has gone down again (considered low). Has this happened to anyone else, and is it just a fluke or at least something that can happen? It seems odd that this would happen unless something is going on. Thanks for any help you can offer. beyond-breast-cancer.blogspot.com Dx 1/18/2007, IDC, 2cm, Stage IIB, Grade 3, 3/12 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/726010",
      "Title": "wbc drop several months after chemo lopsided_blogger DianeE"
    },
    {
      "AuthorID": "lopsided_blogger",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68807/profile",
      "Content": "lopsided_blogger wrote: I posted this on another thread, then realized you ladies are the ones I really want to hear from. My first mammogram at 37 because I felt two 2.5 cm. lumps came back all clear. The mammogram saw nothing because I have dense breasts. So, now I know a mammogram alone is never enough for me. My insurance company makes me have a mammogram before letting me get to the MRI, though. So I want a yearly screening program that includes mammogram followed by MRI. My problem is finding a doctor that wants to do this. I thought ob/gyns usually take care of breasts, and since I'm past treatment and NED, it would make sense to ask her to schedule and follow up with both the mammo and mri. She ordered mammo but deferred back to onc to order MRI. What I don't want is having to deal with two doctors every year for this. My onc has never seemed interested in ordering mammos so I just don't feel he's where I want to go with this. Now I feel my ob/gyn isn't getting what I need, and I don't want a doctor who can't get it. So, did anyone else have trouble finding a home for a screening program that wasn't just mammogram and that's it. What did you do about it and how is that working? Thanks, Lopsided blogger beyond-breast-cancer.blogspot.com Dx 1/18/2007, IDC, 2cm, Stage IIB, Grade 3, 3/12 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743110",
      "Title": "Shammogram Responders--Another ? for You lopsided_blogger KerryMac"
    }
  ]
}