{
  "AuthorID": "LoriCA",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
  "Posts": [
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "May 16, 2018 03:11PM LoriCA wrote: Jeff I think I can relate a little bit to what your Mom is going through. My IBC spread so quickly that I was knocked completely off my feet in a matter of days after my DX; one day I was perfectly fine and the next I was in the hospital fighting for my life (my family was told I probably wouldn't last two months because it was growing so fast). Although I wasn't completely bed-ridden like your Mom, I slept most of time, needed help with most activities and I considered it a good day when I was able to wash up and change my clothes before laying back down. Then I lost complete use of my right arm when it spread to the brachial nerves. I too was on very heavy pain killers (fentanyl and morphine, plus gabapentin and something else for breakthrough pain) so I was in a complete fog, and I was so miserable that I didn't even want to be around anyone, especially before we got my pain meds dialed in and I was dealing with breakthrough pain. It was a long six+ months before I was back on my feet and felt anything close to somewhat living. The isolation is so very hard and adds to the depression. Both of our families are on the opposite coast, very few friends reached out to help, and it's such a tremendous strain on the primary care giver, especially if he's still working like my husband is. Thankfully my SIL flew out here to help nurse me through those first critical months and keep my household going because my husband was about to have a breakdown and I was too sick and drugged up to see it. I'm so glad that your parents have you to help out, they really need it. And as much as your Mom's health is the priority right now, please don't forget that your Dad is going through a lot too, he's watching his wife fight for her life and he can't fix it. I honestly believe that it was much harder on my husband than it was on me. If you haven't yet, taking him out to lunch or his favorite activity (and hopefully giving him a chance to talk about it) might be a good idea. There are also support groups for Stage IV caregivers. You have a new baby on the way (congratulations!), you have a lot on your hands too! To your original questions - I stopped a chemo drug even though it was working well (and saved my life) before I was stable when I developed an SE that got so bad I was telling my husband and MO that I would rather die than live that way. It's a break from chemo, but my MO said it can't be a \"break\" from that specific drug because when I restart we'll need to try to find another drug that works. It took 2 months for the SE to wear off enough for me to be functional again, and now my super-aggressive cancer will be resistant to that drug. My MO was very much against stopping for that reason. In the meantime I'm still on targeted therapy and keeping my fingers crossed until later this month. If we find out that H&P hasn't been holding the line these past couple months I still won't regret it. I know it was a big risk but I feel so much better and now I'm physically and emotionally ready to go back on chemo if/when I need to. I put weight on, am off the anti-depressant, have made a drastic reduction in my pain meds, getting my exercise, am finally back to living a somewhat normal life after six+ months of hell, and most importantly I'm happy and feel good. I needed to do it because for me, quality of life is everything and I would rather have three good months than a year of being miserable (and making everyone around me miserable) if it can be avoided, so I was willing to take the risk. Other people are willing to go through anything to extend their life, and that's okay too. The most important thing is, how does your Mom feel about taking a break? If treatment is affecting her mentally and emotionally too and it's been going on for an extended period of time, that interferes with the healing process. The whole family needs to be willing to support her decisions about her treatment, and it's important to talk about it. The one thing that meant the most to me is that every single person in my family let me know repeatedly that they will support whatever decisions I make about my treatment. And I also agree with the Ensure milkshakes! I was under orders to gain weight and I had at least one every day. No matter how bad my appetite is I can never resist ice cream. Chocolate Ensure with coffee ice cream was a favorite, and vanilla Ensure with strawberry ice cream is great too. My MO told my family to feed me all the cookies, cake and pasta I would eat. I was concerned about the sugar/cancer connection, but my scan showed that the chemo was working well despite all of the sugar I was ingesting. I think the most important thing is to let her eat whatever she's in the mood for, and indulge any cravings, even if it means eating ice cream all day every day. Now is not the time to worry about healthy foods and a balanced diet. Hugs and prayers to all of you!",
      "MessageIndex": 14,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864580",
      "Title": "What's Next? ThunderJeff ThunderJeff"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Nov 18, 2018 04:53PM LoriCA wrote: IBC symptoms do not come and go, once they present they only get worse, usually very very quickly. A person may not have all of the symptoms (although in my case I literally woke up with every textbook symptom in the extreme), but there will typically be several symptoms such as heat and orange peel/thickening skin along with a rash-like spot(s) or skin areas that look inflamed.",
      "MessageIndex": 1,
      "PostDate": "18/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868425",
      "Title": "Ibc Wintercex Jmll1202Ga"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Sep 27, 2018 11:59AM LoriCA wrote: Not abraxane but taxol, which is just a different form of paclitaxel. It trashed my gastrointestinal system. I was fine for the first 2 months of weekly infusions but then I started having an atypical response - excruciating stomach cramps and non-stop diarrhea that lasted for days after every infusion. I started weekly taxol in September of last year, and the first time I had the severe abdominal pain and diarrhea was in December. At first we thought I picked up some kind of bug or virus because my immune system was compromised and my MO insisted that paclitaxel didn't cause that SE. Did a 10-day course of heavy antibiotics coinciding with my week off, it seemed to resolve, but then it started right up again after my next infusion, and it got worse and lasted longer after each subsequent infusion. Stomach pain was so bad that I spent several days each week curled in a fetal position and crying - when I wasn't running to the bathroom, I was on fentanyl and morphine at the time but they didn't put a dent in the abdominal pain. Diarrhea become uncontrollable and explosive lasting for days. Immodium etc did nothing to slow it down. I couldn't leave the house because I didn't dare step more than a few feet away from the bathroom and the pain was so bad. After several weeks of the symptoms getting progressively worse I was convinced the taxol was causing it because of the timing - just when I started feeling better, it was time for my next infusion and then it started all over again. My MO kept insisting it wasn't a side effect of paclitaxel and we continued to look for other causes while I toughed it out. When I switched from weekly to 3-week dosage it damn near killed me - I couldn't eat or even take a tiny sip of water for 8 days straight, explosive diarrhea every 15-20 minutes for over a week (and then only 20x a day for the next two weeks), stomach pain was so intense that I wanted to die. My life was pure hell. I finally told my MO that I'd rather die than live that way. He finally believed that it might be from the taxol and agreed to let me try skipping a dose. Said he had never heard of anyone having that kind of reaction to paclitaxel. I don't know why I tolerated it so well in the beginning, but I guess one day my body decided it had enough. When I finally started improving after skipping a dose, he took me off it completely. Took me over two months to get back to \"normal\" after my last infusion. I'm not really much help to you because we never found anything that would relieve any of my symptoms, just wanted you to know that you're not alone in getting intense stomach pain from paclitaxel, though yours may be due to a different reason. My MO kept telling me that paclitaxel doesn't cause that kind of reaction and I was getting so frustrated. The only thing that worked me was stopping paclitaxel. I tried to tough it out best I could but when I couldn't eat or drink for 8 days straight I knew the next round would land me in the hospital. Nothing we tried was helping and it was only getting drastically worse each time, I had to draw the line after being on it for 5 months. Everyone will tell you that it's not due to the abraxane because it doesn't cause that SE and you definitely do need to rule out other causes, but in my case it most certainly was from the taxol, and both are paclitaxel. At first my symptoms didn't start until a couple days after my infusion so it was hard to pin down the cause, but after several more infusions it was starting within hours and eventually it never let up. I never had the problem again once I stopped taxol.",
      "MessageIndex": 2,
      "PostDate": "27/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867421",
      "Title": "Stomach pains Tychad blainejennifer"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Apr 16, 2019 12:59PM LoriCA wrote: I agree with Kim, you should see a doctor immediately. If it were me I would've headed straight to the emergency room after what you described. A grand mal seizure could be due to something as simple as an electrolyte imbalance or extremely low blood sugar, or something more serious like a stroke or brain tumor. I wouldn't waste any time in getting checked out.",
      "MessageIndex": 2,
      "PostDate": "16/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/871037",
      "Title": "Seizure? (After finishing Chemo) Each_day_2018 SpecialK"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Apr 12, 2018 02:29PM - edited Apr 12, 2018 02:29PM by LoriCA Hbee93 I know it is very scary to suspect IBC but hope it helps to ease your mind to know that IBC doesn't usually grow as a lump, it grows in sheets or layers and that is why it's usually not detected by a mammogram. If you have a lump and the ultrasound didn't find anything concerning, including the thickening of the skin that is typical with IBC, I wouldn't worry about IBC. The lump and bruising may have just been from banging into something or some other physical trauma, especially since you said that the original bruise has faded. If the lump remains, it could make sense to get a second opinion but I would not worry about IBC. My IBC \"bruise\"/purple discoloration wasn't small multiple bruises. My entire breast looked bruised and the discoloration grew until it covered most of my right torso, from my collar bone down to my waist. It didn't fade until after I began chemo. The symptoms increased dramatically every day while we waited for the results of the biopsy and then multiple scans to confirm staging. My only \"lumps\" were the visibly swollen lymph nodes under my arm and above my collar bone. The skin of your breast would usually feel hot to the touch and swelling of the breast and lymph nodes are usually dramatic because IBC blocks the lymph vessels. There are usually visible signs of inflammation, hence the name Inflammatory Breast Cancer. When IBC is misdiagnosed, it is usually diagnosed as mastitis.If no one has mentioned the possibility of mastitis to you it likely means that your doctors are not seeing symptoms of either. A second opinion might give you peace of mind, but it honestly doesn't sound anything like my experience of IBC. Hope it turns out okay for you.",
      "MessageIndex": 10,
      "PostDate": "12/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863836",
      "Title": "New symptoms, IBC seems way too likely now Hbee93 Hbee93"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Nov 5, 2017 11:12AM LoriCA wrote: Hello everyone Stage IV de novo September 2017 (liver and bones)",
      "MessageIndex": 439,
      "PostDate": "05/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Feb 13, 2019 03:31PM LoriCA wrote: Coolrunnings your state has a program to provide free breast exams, mammograms and related diagnostic services to women who qualify. I urge you to please take advantage of this program as you've been posting about your symptoms for months and there is nothing else we can do to help you until you see a doctor. South Carolina Best Chance Network has an 800 number for you to call - https://scdhec.gov/health/diseases-conditions/canc... You can also call the American Cancer Society at 1-800-ACS-2345 and ask about the South Carolina Best Chance Network.",
      "MessageIndex": 5,
      "PostDate": "13/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869331",
      "Title": "Cutaneous lumps Coolrunnings Coolrunnings"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Apr 22, 2018 11:41AM LoriCA wrote: Since I'm pretty sure this was prompted by a recent conversation in the Steam Room, I'm sorry the discussion made you feel like you are supposed to keep it to yourself that you are doing well exbrnxgirl. Stories like yours give hope and motivation to people like me and you should talk about it. Yes I curse at Julie and Alice every time I see those commercials, but only because IBC hit me hard and fast and it's been a long uphill struggle just to get back on my feet. I do know that my situation isn't typical (and I know that many others have it even worse than I do). I still have so many days when I wonder if where I am now is the best I can hope for before I die. It does help to know that there are people who are managing MBC well, it motivates me to keep going to get over this hump. But I'm probably still going to curse at Julie and Alice until I'm one of them hahaha! :)",
      "MessageIndex": 5,
      "PostDate": "22/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864149",
      "Title": "Opening a small can of worms, regarding Ibrance advertising... exbrnxgrl exbrnxgrl"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Nov 2, 2018 01:40PM LoriCA wrote: angelica, a few things that should help ease your mind about IBC - the fact that your skin on that breast is cold because IBC typically radiates heat. Also the fact that the mottling comes and go and changes location. In my experience, the redness only spreads and gets worse, often quite fast. It doesn't come and go. Also the fact that your sonogram didn't show the typical thickening, and that IBC doesn't typically present as a lump. With two doctors leaning toward a vascular issue I'd be inclined to investigate in that direction. All that being said and since you asked, my IBC symptoms were unmistakable and they did three punch biopsies to make sure they didn't miss it. I wish you the best of luck in finding out what is causing your symptoms. Although I'm not a doctor I honestly believe you can put IBC out of your mind unless your symptoms get drastically worse in a short period of time.",
      "MessageIndex": 5,
      "PostDate": "02/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/868080",
      "Title": "Waiting on Punch Biopsy - Worried About IBC angelica_schuyler Arianalr93_"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Jan 5, 2019 06:05PM LoriCA wrote: When I first learned that my MO wasn't going to do scans every 3 months I worried, why did it seem like everyone was being scanned every 3 months and I wouldn't be? He explained that he doesn't want to scan unless there is a reason to scan - after completing chemo, when I have concerning symptoms, etc. - because he thinks that scanning too often only increases anxiety and doesn't truly help. If I don't have any worrisome symptoms we're good with that, our focus is entirely on my quality of life. He also said that he thinks it is lazy (his word, not mine) for doctors to scan every three months, that they really should be spending more time talking with their patients haha! In fairness I've had a consult (and lab work) at least every 3 weeks since my Dx and he spends as much time with me as I need, I know that others don't get to consult with their MO nearly as often, especially if they are on oral meds. Eventually I learned how to relax about my situation, if I don't have any troublesome symptoms I just want to enjoy life, and when I did have signs of progression I knew it and we scanned. No scanxiety because it was only to confirm what I already knew & determine the extent. A friend posted an interesting comment on social media - that her first MO scanned every three months and would change her treatment every time a scan showed the slightest progression. As a result she has run through almost every option in a very short time and now regrets it. Even with things like radiation when a small spot shows up, my RO explained that since there is a limit as to how many times you can radiate a spot, why use that treatment before you have any symptoms and really need it, and risk loosing that option when you may really need it for palliative reasons in the future? I think it all depends on individual situations, but for now I'm glad I'm not on the 3-month scan schedule.",
      "MessageIndex": 3,
      "PostDate": "05/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869169",
      "Title": "An Interesting Perspective on MBC Progression Monitoring Bestbird Heidihill"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Sep 5, 2018 12:20AM LoriCA wrote: Rosiegirl so sorry to hear what you're going through. I see that you have HER2+ Inflammatory Breast Cancer, same as me and I'm sure you know how aggressive IBC can be. Although I was Stage IV de novo it was scary how fast mine spread through my body, into my left breast, then brachial nerves and chest wall and skin, right before our eyes while I was in the hospital for a week, and I had noticeable difference in scans of my skeleton just two weeks apart. Only my liver mets were unchanged during those two weeks. My tumor had very high ki67, which is a measure of how aggressive it is. Seeing the cancer growing right before my eyes was horrifying. My doctor didn't think I would last 60 days. Just wanted you to know that you're not alone with super-fast progression and I think the commonality is the HER2+ IBC. Chemo did a good job of knocking mine back and I've been stable on H&P, but in the back of my mind I figure that when I stop responding to H&P we'll have to move fast to find something else that works and it honestly scares me. Hope you have good results with your new treatment.",
      "MessageIndex": 6,
      "PostDate": "05/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867005",
      "Title": "Where did all these mets come from??? rosiesgirl Daniel86"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Dec 6, 2018 01:35PM LoriCA wrote: +1 on the Champion sports bras from Target that Nancy recommended, the \"Power Shape\" series specifically but they aren't seamless & might not always look good under clothes. I haven't tried the seamless Power Core yet, but am going to take a look at them next time I'm in a Target because I've been so impressed with the Power Shape (comes in Medium - Max support) . Like Nancy said they are \"bulletproof\" but I find them incredibly comfortable too, and priced right.",
      "MessageIndex": 4,
      "PostDate": "06/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/868714",
      "Title": "I need a sports bra with under armour support exercise_guru LoriCA"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Sep 18, 2018 06:09PM LoriCA wrote: Andrea I'm in south OC but I try to spend as much time as possible in the Eastern Sierra. I love the combination of desert, forest, and snow-covered mountains all in one beautiful spot. I was pretty bummed that I wasn't selected for a Little Pink Houses retreat at Lake Tahoe this month, it would've been the perfect excuse for me to make that long drive because I don't usually get that far north. Great photos, you look fantastic! I'm getting frustrated by intercostal spasms making some of my workouts difficult. My MO says they are due to bone healing and I just need to deal with it, that one day they should just stop. That doesn't help me with the blinding pain now. I'm okay with things that keep my torso straight - walking/hiking, strength training, etc. but anything that twists my torso like swimming and Qigong usually sets them off, and it's a pain that stops me dead in my tracks. I modified the way I swim (so I don't drown haha) but I don't want to give up Qigong so I've been \"playing through the pain\". Anyone have experience with intercostal spasms and have any suggestions? Lori",
      "MessageIndex": 1908,
      "PostDate": "18/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Sep 26, 2018 01:40PM LoriCA wrote: Andrea that must have been frightening (not to mention painful). That kind of random break is one of my fears. It's even more impressive that you feel up to doing a ten day backpacking trip after healing from a broken hip! Interested to hear what your doctor has to say about the intercostal spasms. Struggling with fatigue this round, have only been doing 30 minutes on treadmill every other day but still making sure I go to my 1,5 hour Qigong class no matter how tired I am. Lori",
      "MessageIndex": 1930,
      "PostDate": "26/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Oct 22, 2018 11:22AM LoriCA wrote: I didn't know Paula, but that is very sad to hear. There have been too many :(",
      "MessageIndex": 1963,
      "PostDate": "22/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Nov 26, 2018 03:38PM LoriCA wrote: Went primitive dry camping in the Mojave high desert for three days. Did some short hikes every day, but it was super windy (and chilly) which really sapped my already depleted stamina. We hunkered down in the tent early each night to escape the cold wind, and I was asleep by 8pm every night haha!! Felt great to get out in nature for a few days. Looks like I'm going back on chemo tomorrow and wondering how it's going to affect my Qigong class since the class will coincide with my \"crash\" day from the pre-meds based on previous experience. Just going to take things one day at a time.",
      "MessageIndex": 2005,
      "PostDate": "26/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Dec 3, 2018 05:35PM LoriCA wrote: I live in the land of perpetual summer so weather isn't usually much of a factor here. It can be too hot in July/August for outdoor activities, even here on the coast, but that's the time for water sports or heading up to the mountains. Andi I'm a slacker with the echos too, although it's been less than a year for me. I know that Genentech wants an echo or MUGA every 3 months, but when I first saw my cardiologist after starting Herceptin he punched some numbers into a computer and said I had only a 1.8% chance of having any problems with it. He did an EKG and an echo and said my heart is so strong and in such good shape that he has absolutely no worries about me at all, there's no reason to see me every 3 months, recommended every 6 months unless I experienced problems. Neither my MO nor my cardiologist has followed up for another one since, I haven't experienced any symptoms that would cause concern, I've been so doctored out these past couple months that I haven't bothered to push for it, then we stopped Herceptin for a month+ while trying to decide on a new treatment plan so I figured there was no need. Now that I'm back on H&P I have been wondering if I should try to fit it in before the end of the year. I think that staying physically active goes a long way toward keeping our hearts healthy and strong (absent any other problems). But if I remember correctly you are currently NED and I am most definitely not, so perhaps I should take it more seriously. Started a 3-week dose of Taxol last week and between the fatigue and a storm I used that as an excuse to skip my Qigong class because I just wasn't up to driving in the pouring rain after dark with chemo running through my body. The class coincides with my \"crash day\" from the pre-meds so it's going to be a challenge to push through the fatigue to drag myself out of the house. The tumor in my axilla is quite large and painful right now, it's growing very fast and I really need the Taxol to kick it in butt soon (it will blow your mind how fast IBC can spread right before your eyes). Still staying physically active but not doing strenuous activities that require using my arms because I'm already losing mobility & the pain is pretty rough. So things like strength training and swimming are out right now, but doing as much walking as I can and this week I'll be back to Qigong with some major modifications. I want to stick with it because I believe that the mind/body connection has been beneficial for me. Staying physically active is just as much about the mental/emotional benefits, maybe even more so than the physical benefits. Lori",
      "MessageIndex": 2020,
      "PostDate": "03/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Feb 8, 2019 04:18PM LoriCA wrote: Popping in to say hello to everyone. I really miss this thread and the inspiring people but I haven't been physically active in several months (besides dragging myself to treatment, scans, consults, and taking care of things around the house) so I haven't posted. Things have been going in the wrong direction for me since October and we're having a hard time getting it under control. I'm tired, cranky, in pain, and so frustrated that I want to break down and cry (but I won't let myself). I keep an eye on this thread for the inspiration and hope and I love hearing what everyone has been up to. I'm looking forward to finding a treatment that works and giving my body a good workout again soon because I'm getting fat and lazy haha! Philly you look awesome! Katy I'm so happy to hear your good news. Brrr Andi, I don't blame you for wanting to stay inside with those temps! Sorry about the fall, but glad that only your pride was hurt. Waving hello to everyone else!",
      "MessageIndex": 2116,
      "PostDate": "08/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Sep 21, 2018 03:23PM LoriCA wrote: Andrea I'm so jealous and impressed that you can do a ten day backpacking trip! I can't even imagine trying to hike carrying that much weight these days. I'm still working on being able to carry all of my gear again! It doesn't help mentally that when I talked to my doctor about doing strength training again and how much weight was safe for me to use, he said there's no real way to tell how well my weight-bearing bones have healed and how much weight and stress they can handle except to just try haha! I guess that means I'll find out the hard way if I put too much stress on my bones. I've already lost close to an inch in height from spinal compression. My trip was nothing that would impress an outdoorswoman like yourself. I usually primitive (dry) camp in the backcountry of the Mojave, but for this trip I wussed out and rented an RV so I could be comfortable in case I had a bad day and needed to crash. Since it was my first time back out I wanted to keep things as stress-free and comfortable as possible so I could ease back into it and see how I handled everything. We have a friend who lives at the base of the Tetons and we used his property as basecamp for a couple days, then moved to the Colter Bay Campground (not RV park) which was the perfect location for spending time in both Grand Teton NP and Yellowstone. As far as campgrounds go, I was impressed because the sites are large and well spread out with good privacy so it was a good compromise. So many organized campgrounds here in California have small sites that are right on top of each other, crowded and noisy, and I avoid them like the plague. We had driven my Jeep 1000+ miles to get there, and we had fun exploring a few jeep trails far away from the crowds. Hikes were short, never more than 3-4 miles on flat terrain. It was our first time in Wyoming so we did the tourist thing in Yellowstone but spent most of our time exploring Grand Teton NP and Bridger-Teton National Forest. About 4 days in I crashed hard one night in so much pain that I couldn't even see straight or tell my husband why I was going straight to bed, and I realized I just needed to do a better job pacing myself instead of getting frustrated that I couldn't do as much as I used to do, especially since I'm sure the altitude played a role. Still managed to be up and out at 5am every morning and didn't get back to camp until well after sunset each night, but I've been going through a period of getting very frustrated with myself whenever I hit a wall. Camped a bit further down there was an older man with a Jeep. One night he stopped by to ask about some of the modifications on my Jeep and we got to talking. Turns out his wife had recently died of breast cancer, now he takes his RV, Jeep, boat and dog and spends most of his time out in nature. We bonded over Jeeps and breast cancer and talked for hours, there's a certain peace in talking with someone who truly understands what you are going through. Found myself hoping that my husband will be like him after I'm gone, I'm so afraid that he'll spend all his time at home sitting in front of the TV without me. Qigong class last night was painful, d*mn spasms didn't help. Woke up stiff & sore so will do just some light stretching today (Qigong warmup exercises) to try to loosen things up. I can definitely see a difference in how I handle physical activity depending on where I am in my treatment cycle. As we were leaving class my 80 year old teacher said \"Just wait until you're my age\" and I wanted to cry. One can hope, right? The class is hosted by my hospital's Women's Center and almost everyone there is a cancer \"survivor\" but I'm the only Stage IV person and the only one still in active treatment. She's a retired RN and I thought she understood when we talked about the bone mets throughout my skeleton and how that might affect my ability to do certain movements, but I guess she doesn't understand the bigger Stage IV picture.  You all inspire me so much with the things you are doing. Hope everyone has a wonderful weekend and can get outside and enjoy some beautiful fall weather! Lori",
      "MessageIndex": 1924,
      "PostDate": "21/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Sep 12, 2018 10:07PM LoriCA wrote: For anyone hiking at altitude and having problems with shortness of breath and fatigue, you might want to give Boost Oxygen a try to see if it helps. I'm a slow adjuster, even got altitude sickness twice when I went hiking above 10,500 straight off the bat without giving myself a few days to adjust, and there is nothing more miserable (the only thing that helps is go back down the mountain). I was worried how altitude would affect me during a recent camping trip to Wyoming, afraid I would ruin my first trip since DX by being too sick and miserable to hike. I was skeptical about the Boost, but for $15 for the large can I figured it couldn't hurt to give it a try. Any time I felt the tell-tale altitude headache start to sneak up or I found myself a little short of breath, I took a couple of hits of the Boost and it was amazing how much it helped. I had absolutely zero problems with the altitude and was able to hike as much I wanted. It's sold almost everywhere at high altitude locations - gas stations, grocery stores, sporting goods shops, even the gift shops in National Parks.",
      "MessageIndex": 1902,
      "PostDate": "12/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Sep 19, 2018 05:40PM LoriCA wrote: Andrea yes that's exactly what they do to me! During one Qigong class a spasm hit every single time I tried to move, just picture me cursing up a storm the entire session when we are supposed to be practicing mindfulness haha! I really suspect it is due to neuropathy like your MO said, maybe in combination with healing. I had no problem with neuropathy during taxol but since being on targeted therapy which isn't supposed to cause neuropathy it has been getting worse every month. Gabapentin helps with the burning in my feet but I'm plagued with cramps in my feet, shins and hands and thought the intercostal spasms were \"rib cramps\" until a nurse told me what they were. Even though I knew I wasn't dehydrated I tried adding potassium and magnesium supplements and upping my salt intake, but it didn't help. Oh well, was hoping somebody knew a secret trick but I'm not going to let it slow me down. I'm still working on regaining strength and stamina after 7 months off my feet so I need to push through it. Yesterday treadmill and strength training, today is treadmill, crunches and some Qigong practice, tomorrow is Qigong class. You ladies are making me jealous with the beautiful photos of your hiking and backpacking trips. Other than the pool most of my workouts are indoors for now until the weather cools down a bit more, then will be spending as much time as possible camping in the desert. KatyK I can truly relate to the emotions you describe - my 10-day camping trip to Wyoming in July was the first time since my DX that my husband and I were back out doing what we love so much, after being told I probably would never be able to do it again. It was an incredibly emotional experience for both of us. Spending time in nature is so good for the soul. Lori",
      "MessageIndex": 1914,
      "PostDate": "19/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Sep 20, 2018 05:07PM LoriCA wrote: DGHoff I'm on Perjeta too, so maybe that is the cause. All of the cramping and spasms started shortly after I started H&P. and it seems to happen in cycles. You've been on H&P longer than I have, are yours getting worse over time or better? Last night the intercostal spasms started at 2am while I was sleeping and continued for half an hour, as soon as one let up the next one started, even while I was just lying flat on my back holding still. First time that's happened and worst pain ever! Qigong class tonight is going to be interesting haha. Lori",
      "MessageIndex": 1920,
      "PostDate": "20/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Sep 21, 2018 07:28PM LoriCA wrote: KatyK that sounds like heaven to me! I did spend a couple evenings on the banks of the Snake River watching for wildlife and it was sooo peaceful and relaxing, but in the mornings I was always in a rush to get somewhere and beat the crowds to the parking lots. There wasn't enough time to see everything I wanted to see, which is a perfect excuse for a return trip. ;) Since my 20s I've always kept a small gym in my house so I never have the excuse that I don't feel like going to the gym. It's a godsend now, I wouldn't get nearly as much exercise if I had to motivate myself to leave the house for a daily workout, especially during the summer when it's often too hot even for walking outdoors.",
      "MessageIndex": 1926,
      "PostDate": "21/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Sep 30, 2018 08:33PM LoriCA wrote: Have been out of commission since last week with serious back issues. I can barely hobble around the house, let alone get any kind of real exercise. I was fine when I woke up the first morning, but when I tried to stand up after my first cup of coffee the pain hit. I started having occasional back problems a few years ago, thought it was due to getting old but in hindsight it may have actually been caused by the mets growing in my spine. I see my MO Tuesday before my infusion and see what he thinks about it. Until then I'm going to continue to tell myself it's just from getting old. Disappointed to be sidelined just when I felt that I was making good progress, but the pain is easing up a little today so hope to be back to my old routine soon. Hope the rest of you got outside and enjoyed some beautiful fall weather!",
      "MessageIndex": 1932,
      "PostDate": "30/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Nov 8, 2018 02:51PM LoriCA wrote: I was wondering the same thing illimae. I had 5(!) new biopsies this morning, so I guess we'll see if the pathology has changed. Strange that some parts of me are resolving beyond expectations, but it exploded in other areas. It's so frustrating. Feeling a little beat up today and anesthesia is starting to wear off. Might end up skipping my qigong class tonight. Not sure I'm going to feel like flapping my wings after having multiple biopsies in the axilla. Good for you on the Silver Sneakers class. I've also looked into some of the free senior classes in the area. Friends from my qigong class have assured me that no one will care if I'm technically too young.",
      "MessageIndex": 1982,
      "PostDate": "08/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Nov 9, 2018 01:04PM LoriCA wrote: KatyK so good to hear that you had good scans and are doing well. Hope you have a fantastic time camping and hiking in Utah, it's such a beautiful state. I was hoping to start camping in the desert again this month, but the Santa Ana winds have been fierce, we're still getting ill-timed heat waves, and now everything is on fire again so I'm not sure it's worth the risk until the weather settles down. I'm not in the mood to try to set up a tent in 60mph winds. LoveFromPhilly I took your advice and decided to snuggle up with a blanket and read a book yesterday. I let my husband pick up a pizza for dinner and we watched some TV together. Not much pain at all today so after yesterday's self-indulgent day I think I'm good to go again. :)",
      "MessageIndex": 1986,
      "PostDate": "09/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Oct 18, 2018 02:02PM - edited Oct 18, 2018 02:03PM by LoriCA I admit to being a slacker, still doing my weekly qigong class but lost my groove on the rest of it ever since I had that back problem. Need to get my head back in the game. I think I'm going through a rough patch emotionally and I know that those endorphins will help pull me out of it.",
      "MessageIndex": 1957,
      "PostDate": "18/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Nov 7, 2018 03:09PM LoriCA wrote: Thanks for the good thoughts illimae and LoveFromPhilly. Scan results were strange, my liver has resolved completely and my skeleton looks great with even more healing, but the primary mass is growing again, there's still skin involvement (IBC) and now I have many lymph nodes throughout my body showing metabolic activity. Have biopsy scheduled for first thing tomorrow morning to determine if lymph nodes are really cancerous or if there's something else going on. I'm officially off H&P and he's strongly recommending radiation (over a very large area) right now, but we'll see what biopsy shows before making any decisions. In between all these appointments and stressing about the appointments it's been tough to fit in regular exercise. I have no other excuse when I have a treadmill, bowflex and free weights right here at home. Looking forward to my Qigong class tomorrow, we always end with meditation and it helps to center my mind. At least I'm still honoring my commitment to a formal, scheduled class, self-motivation is hard. Philly I hope the antidepressants work well for you. I think the time change and the seasons also make it harder to stay motivated this time of year. I always want to nap when it's gray outside. :)",
      "MessageIndex": 1980,
      "PostDate": "07/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Dec 17, 2018 07:00PM LoriCA wrote: Andi glad to hear you are doing well and thanks for asking about me. I think the abdominal cramps you asked about are intercostal spasms. I have a really tough time with them, Qigong makes them go crazy and at first I was embarrassed in class, but I explained to everyone what was going on and they were very understanding. When a bad one hits I usually walk to the side of the room and quietly curse under my breath until it releases, and then I rejoin the class. Some days I've had to walk away 10-12 times during a class. So far this round of Taxol seems to be going easier than it was the first time, mainly just major fatigue, but I've only had one infusion so far, second is tomorrow. I expected the SEs to be worse since it's the 3x the dose I was on the first time, but I'm going into it healthier and stronger than I was the first time and if this is as bad as it gets this round I'll be happy but I know that the effects are cumulative. Embarrassed to say that I haven't done any real exercising the past several weeks. The Taxol isn't working yet, the cancer is growing fast and my pain level has increased drastically over the past several weeks, so I'm cranky and miserable. It's been all I can do to get through decorating for Christmas and attending some holiday parties. Social events in particular really wipe me out. Telling myself I'm going to Qigong on Thursday, but with infusion on Tuesday, my husband's Christmas party on Wednesday, and then crash day on Thursday it's going to be hard to find the energy and motivation to do it while I'm in so much pain. Also plan to do a 1.5 mile walk along the harbor to see the Christmas lights this week, I think it will help with my mood. I'm back to taking baby steps again. :( Hoping this next infusion starts working not just because I need the pain relief but because I really need the emotional boost of knowing that treatment is working. *%&# IBC grows so fast that it can really mess with your mind. Both of our families are on the East Coast and I hate to travel during the holidays (and I refuse to deal with an over-crowded airport while on chemo anyway), so Christmas is a quiet time for us. Some years we go camping, but this year will probably just go for a walk on the beach, then snuggle together while watching sappy Christmas movies haha. :) My husband said his best Christmas gift is that I'm still here this year and we're just going to enjoy being together. Hope everyone is doing well and not getting too stressed over the holidays. Illimae hope your scan results bring good news!",
      "MessageIndex": 2032,
      "PostDate": "17/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Jul 11, 2018 01:49PM LoriCA wrote: Saextro I'm so sorry about your mother but glad to hear that it seems like the treatments are working. If her doctor isn't addressing her palliative needs she should ask for a referral to a palliative specialist/team. They can help her balance the symptoms of the cancer and the side effects of treatment and meds to make her quality of life as good as possible. I won't promise you that it gets easier because each of our cases are different and we all respond differently to treatment but don't give up hope, my cancer spread so fast & did so much damage that for six months it was all I could do to get washed up and changed every day, and there were many days I couldn't even do that. I thought that was how the rest of my life was going to be. Then I slowly started getting stronger & set little goals for myself, began with walking, and now ten months later I'm in the gym lifting weights, walking/hiking, swimming, and leading an active lifestyle again. I still have some pain, but it's being well-managed and I can honestly say that my life is good. My husband is also a small business owner who works 6 days a week and we have no family in the area. He missed so much time the first two months taking care of me until we realized that we needed help handling things. Self-employed people understand the reality that too much time away from the business can mean not being able to afford your mortgage payments, health insurance/medical expenses, and putting food on the table. My husband attends all of the important appointments with me and he does things like stop by the infusion center to bring me coffee and a donut, but I know that it's not realistic for him to be at all of my routine appointments if we want to keep eating and keep a roof over heads (not to mention pay for my treatment). At the same time, you can't spend all of your free time doing it because you are going to burn out! You need help. If you can't find some of her friends who are willing to help take her to appointments, the American Cancer Society offers free rides to treatments via their Road to Recovery Program https://www.cancer.org/treatment/support-programs-... and many hospitals and clinics are participating in Uber Health to get patients to treatment https://www.uberhealth.com/ You can't do it all by yourself and you should take advantage of all the available resources that are offered for cancer patients. My best wishes to both of you!",
      "MessageIndex": 4,
      "PostDate": "11/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/865788",
      "Title": "Does it get any easier? Saextro DivineMrsM"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Mar 9, 2019 04:16PM LoriCA wrote: Hi Dreamcatcher, IBC is a clinical diagnosis that can only be confirmed with a punch biopsy. If you have IBC, your skin WILL show it because with IBC the cancer blocks the lymph vessels in the skin, which is what causes the skin to look inflamed. You may not have all of the symptoms, but you would have some of them, and the symptoms do progress very quickly. Absent any skin symptoms, your doctor would have little reason to do a punch biopsy - if your skin doesn't appear to be affected, there is no reason to biopsy your skin, not to mention if there is no specific area showing signs of it they wouldn't even begin to know where to biopsy. An inverted nipple shouldn't be ignored, but I believe you are doing the right thing by starting with the standard tests and imaging and taking things from there. If you do suddenly develop IBC symptoms - specifically redness and heat (not just warmth), by all means push for a punch biopsy. I wish you the best of luck with your tests and hopefully you'll find that the inverted nipple is due to some benign reason.",
      "MessageIndex": 1,
      "PostDate": "09/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870253",
      "Title": "Is IBC diagnosis possible with minimal symptoms? Dreamcatcherr LoriCA"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Feb 2, 2019 06:12PM LoriCA wrote: Crissy do you have IBC or IDC? IBC is Inflammatory Breast Cancer, it's rare and very aggressive. All of my mets have now resolved completely on H&P. Unfortunately my IBC recurrence turned out to be not only resistant to H&P but also resistant to chemo this time. It's spreading fast, so now we're trying to kill it with radiation. One week in and we've already had to twice expand the area being treated, that's how fast it grows. There are many women who drop the Perjeta, take a look at the H&P thread here. The SEs of Perjeta seem to be harder to tolerate, and many decide it's not worth it. For the first several months H&P would make me feel like I was hit by a truck, and I would sometimes get the cough, but my hands never turned red. It's strange that you would have a bad reaction after being on it for over a year. Were you possibly dehydrated or not well rested? The SEs always seem much harder if I'm not at my best (well rested and well hydrated) when I get my infusion.",
      "MessageIndex": 5,
      "PostDate": "02/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868924",
      "Title": "Pain during PET scan? thecatlady LoriCA"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Sep 15, 2018 12:55AM LoriCA wrote: Andi since you live in Denver I wonder if it will work as well for you as it did for me coming from sea level. I really feel it anytime I get above about 7,000 feet but above 8,500 I have problems with AMS. With the Sierras practically in my backyard I'm looking forward trying 10,500+ again to see how well the Boost works instead of having to stick to the baby mountains haha. If you can't find it locally, they also ship direct or you can get through Amazon, although that wouldn't get to you in time for your MT trip. I'm interested in hearing how well it works for you. I bet Montana is beautiful this time of year, enjoy it and on't even think about those scans until you get back! Lori",
      "MessageIndex": 1906,
      "PostDate": "15/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Sep 19, 2018 07:24PM LoriCA wrote: Kar I'm also an outdoor photographer and writer, or at least I was until my DX. That's been my motivation for working hard on getting back in shape, it feels like my entire identity has been taken from me and I don't know who to be if that's not what I am. I tried camping a few months back but the physical labor of setting up camp and hauling gear was too much for me and I had to head home after the first breakfast because I was so miserable. In hindsight it probably wasn't the best idea to try it while I was still doing chemo haha! I'm really hoping to get back to doing some paid work next month, if my clients are still willing to work with me, although I'm sure it will be at a much slower pace than before my DX. And if I can't do it for work, at least I can do it for me. Good for you on getting out there solo! That's huge. Can't wait to hear about your next adventure. I'm not quite ready to take that step just yet, still working on seeing how well my bones have been healing & how much stress they can handle before I venture out of cell phone range alone. If you don't already, I wear a RoadID bracelet with a medical alert badge and pertinent info of my DX (no IV/BP on right arm) plus MO and husband's phone numbers \"just in case\" something happens when I'm out alone. Lori",
      "MessageIndex": 1916,
      "PostDate": "19/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Oct 2, 2018 06:35PM LoriCA wrote: Thanks all, back is finally easing up a bit today. At least I can finally walk without being hunched over while gasping in pain, just getting small twinges now. Geez back pain is the worst! I'm pretty sure it's musculature, not bone. My MO thinks the cramps, intercostal spasms and back pain are all related and we're giving a muscle relaxant a try to see if that helps calm things down. The cramps and spasms were increasing in severity and frequency over the past couple months and I was starting to get very cranky, so hopefully this works. A spasm hit while I was sitting in his office and I thought his eyes were going to pop out of his head when he saw how painful it was haha! KatyK so glad that you got to watch wildlife on the river at sunrise and sunset. Sounds like a fantastic trip! Andrea I responded in another thread but again I'm so happy to hear that you are still NED after six years on Herceptin and after that scare. You give me hope! I am sorry about how all of that went down though. What a rollercoaster of emotions you went through! LoveFromPhilly I can only dream about being able to do kick boxing right now! Where do you get that energy?? That's fantastic! Hoping my back is ready for Qigong by Thursday night so I can start stretching things out again. Still taking it easy until then. Lori",
      "MessageIndex": 1937,
      "PostDate": "02/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Nov 6, 2018 12:45PM LoriCA wrote: Looks like KatyK hasn't logged in since October 20, I hope she's just taking some time for herself. These boards can be so stressful every time someone dies, but I know she was also waiting for test results and worried. :( Herceptin is failing so I've been wrapped up in my head the past couple weeks and slacking off. Meet with my MO tomorrow to review results of PET/CT scan to see just how bad it is. I'll feel better once we decide on a new course of action because I'm confident that we can kick it back again, I'm still strong and healthy (besides the damn cancer & fatigue) but going on to my 3rd line of treatment in a year doesn't exactly give me warm fuzzies. In the meantime, my weekly Qigong class is the only real exercise I've been getting (besides cleaning the house). My husband told me how proud he was of me that I was sticking with it even though he knew I haven't really felt like going. It really helps to have that kind of motivation. Yay for no more mice!! Lori",
      "MessageIndex": 1976,
      "PostDate": "06/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Dec 23, 2018 06:09PM LoriCA wrote: KatyK what is skate skiing?? Never heard of that before but sounds like fun! I'm so jealous of the hikes you are taking because I'm sure it's breath-taking beautiful up there right now. There's a lot to be said for living at the beach but I miss the snow this time of year. Forecast here is for rain on Christmas Day, we need it, but boo. I think the chemo has started working, pain seems to be decreasing & I haven't taken pain meds past few days, so hopefully will be fully active again and doing more than just walking this week. Going to take it slowly with some light gym work and see how it goes.",
      "MessageIndex": 2036,
      "PostDate": "23/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Dec 24, 2018 06:22PM LoriCA wrote: KatyK I envy you for having enough energy to even think about attempting it haha, especially at altitude I can imagine how intense it would be. I'm sure I'd be sucking wind in less than half a mile! So frustrating what this disease has done to me (but still grateful to be doing better than I was a year ago). Merry Christmas everyone!",
      "MessageIndex": 2038,
      "PostDate": "24/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Mar 25, 2019 10:44AM - edited Mar 25, 2019 10:44AM by LoriCA Hi Maggie, the typical locations for bone mets are the ribs, spine, pelvis, skull and the long (upper) bones in the arms and legs, although it is possible to find mets in unusual locations such as lower legs, wrists, etc. The fact that your pain is in your joints, not the actual bones themselves, and that the pain is relieved with Aleve, is likely why your PCP believes it is due to arthritis. The Aleve is likely reducing the inflammation that arthritis can cause in the joints.",
      "MessageIndex": 4764,
      "PostDate": "25/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Dec 16, 2018 04:21AM LoriCA wrote: I'm so sorry to hear that they suspect lung mets dya, keeping my fingers crossed that the spots turn out to be something benign. There are several women here who have been on only Herceptin or Herceptin & Perjeta long term, 7-10 years. As my MO says, it's a maintenance treatment and as long as your mets are stable and not causing any problems (or you are NED) you can stay on it as long as it works. If your mets are growing and causing trouble, then it's time to consider other treatment. That doesn't always mean systemic treatment (chemo), if the rest of you is responding well to targeted therapy there are usually options for localized treatment of mets if they are causing problems. As a general rule of thumb, if the mets are small and not causing any symptoms, there's no need to rush into a change of treatment. At Stage IV it's all about quality of life. You might want to look into Kadcyla (f not now, for the future), which is a targeted therapy that combines Herceptin with emtansine. It seems to be fairly easy to tolerate, more so than a harsher chemo. I'll be moving to that next when I finish this round of Taxol. I seem to be the opposite of you - my mets respond very well to H&P (my liver mets have completely resolved on H&P) but when I stopped chemo I had a primary recurrence. Kadcyla seems to be the best of both worlds (hopefully).",
      "MessageIndex": 4710,
      "PostDate": "16/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Jan 17, 2019 02:38AM LoriCA wrote: I don't put any weight in lab results as an indicator of cancer status (unless you mean tumor markers, which can be a good predictor for some but not all people). My labs have never wavered - when I had my first go with IBC with fast-growing tumors, extensive mets throughout my skeleton, liver, chest wall, skin and lymph nodes, my labs were perfect. Throughout multiple rounds of chemo, not a blip in my labs, always perfect. IBC is raging again and still my labs are perfect. The only thing I think they are good for is watching for adverse affects of treatment, or watching for things like a problem with liver function. Lower back pain doesn't necessarily mean that the cancer has returned or progressed, especially for those of us over 50. Since I've had extensive mets throughout my skeleton I recently had a scare when I had lower back pain that lasted a couple weeks. Turns out it was just age-related back pain due to muscles not bone, my MO prescribed a muscle relaxer and in a couple days I was good as new. Any pain is scary when you're dealing with cancer, and it's a good idea to get it checked out if it persists for a few weeks. It's hard to teach ourselves not to immediately think of cancer every time we have some pain, we forget that we used to get aches and pains prior to our diagnosis and hardly gave it a thought, after cancer our minds immediately jump to worse case scenario. It's good that her MO is taking it seriously, but hopefully it's something minor for your Mom too.",
      "MessageIndex": 4739,
      "PostDate": "17/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Jan 5, 2019 01:58PM LoriCA wrote: Physical trauma doesn't cause cancer, but it can take a while to heal. You didn't mention how long ago this has happened, but getting the second opinion from the new doctor should be good for your peace of mind. More importantly, I hope you give some serious thought about your intention to marry a man who thinks it is okay to physically harm you to prove a point. You are a young girl with your whole life ahead of you, you should not tolerate that kind of abuse.",
      "MessageIndex": 1,
      "PostDate": "05/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869159",
      "Title": "21 years Old and worried mhite226 mhite226"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "May 6, 2019 01:27PM LoriCA wrote: It's a common reaction Elderberry and definitely not hives - although if you think it looks like measles, with the current epidemic in the US you would want to get it checked if it starts spreading over your body and you've been in contact with anyone who has traveled here. Anytime I've had hives in the past it's been large raised areas (quarter size and larger) and incredibly itchy, like super-sized mosquito bites. Yours sounds like the typical rash from HER2-targeted drugs, mine was just small red dots too but sometimes it looks like acne, and the forehead is one of common locations for it. If it's not itching and causing you distress, I wouldn't worry unless it covers a large area of your body or itches enough to drive you crazy. It might clear up in a few days, and then show up again after your next infusion. You'll probably get a drippy nose that never stops too. Take out stock in Kleenex now haha!",
      "MessageIndex": 5,
      "PostDate": "06/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/871393",
      "Title": "Rashes and Other Skin Issues From Chemo Elderberry Elderberry"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "May 6, 2019 11:51AM LoriCA wrote: Herceptin and Perjeta both can cause a rash on the face and upper body. Mine was very mild on my forehead, just a few spots that didn't itch, and it stopped occurring after a few months on H&P. I still get intense itching on my upper arms that drives me nuts,especially when I'm trying to sleep. There's no visible rash on my arms, but many women here have problems with upper arm itching while on H&P so it definitely seems related.Topical benadryl helps with the itching. I figure that as far as SEs go, as long as it's just a mild rash it's a small price to pay for the benefit of H&P. If your rash is really bad, some women drop Perjeta and only do Herceptin. You could always try that and see if it's the one causing the rash, but there's strong likelihood that Herceptin is causing it. If it's mild, try waiting it out and you might stop having that reaction like I did.",
      "MessageIndex": 3,
      "PostDate": "06/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/871393",
      "Title": "Rashes and Other Skin Issues From Chemo Elderberry Elderberry"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "May 27, 2018 10:30PM - edited May 27, 2018 10:30PM by LoriCA Duckmomma you are right to be worried and don't need to apologize. IBC is often misdiagnosed as mastitis, but as mustlovepoodles said, IBC is very rare and the chances of it are slim. If your symptoms continue to get noticeably worse while you are taking the antibiotics or if the lymph nodes under your arm or above your collar bone swell, don't wait the full two weeks before seeing your doctor and getting the ultrasound (IBC often doesn't show on a mammogram). If your symptoms stay the same or improve while taking the antiobiotics, take a deep breath and know that even if it's not mastitis, it is probably something else that has nothing to do with cancer.",
      "MessageIndex": 4,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864821",
      "Title": "Diagnosed mastitis, worried it’s ibc Duckmomma JoE777"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "May 28, 2018 02:57PM LoriCA wrote: Duckmomma, nah we don't get sick of seeing the posts - only when people continue to insist that it is IBC after no worsening of symptoms for several months and a negaive biopsy lol. We know how scary it is to think that you could possibly have IBC and we're happy to reassure anyone when their symptoms don't sound like IBC to those of us who have been diagnosed with it, or share our thoughts when something sounds concerning. Although mine spread much faster than usual even for IBC and got worse by the hour (there was no mistaking it for mastitis haha!), symptoms typically worsen daily, often dramatically. Any time symptoms stay stable or improve with antibiotics or creams, it's a very strong indication that it is not IBC. If all of a sudden your breast swells to twice it's size and is radiating intense heat, you have a massive purple bruise from your collarbone to your waist, the rash starts oozing and your lymph nodes are the size of golfballs, get thee back to the doctor ASAP whether or not you've finished the antibiotics. Best of luck to you Duckmomma, hope it turns out to be something minor and clears up quickly!",
      "MessageIndex": 15,
      "PostDate": "28/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864821",
      "Title": "Diagnosed mastitis, worried it’s ibc Duckmomma JoE777"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Dec 19, 2018 11:29PM LoriCA wrote: Just throwing this out there Crissey, a few months after starting Herceptin and Perjeta I started getting severe intercostal spasms in my ribs, front and back. Just putting your arms into position over your head for the scan could be enough to trigger one. The pain from the intercostal spasms is enough to take my breath away and they can last several minutes. Hopefully it is something that simple, although it's still no fun to deal with. Bone mets are usually (but not always) more of a dull achy pain. I'm surprised that the tech would say something to frighten you like that, without any additional basis for saying so.",
      "MessageIndex": 1,
      "PostDate": "19/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868924",
      "Title": "Pain during PET scan? thecatlady LoriCA"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "May 10, 2019 08:46PM LoriCA wrote: I'm not sure she'll be back to answer you JanWeb. She had multiple biopsies, first skin punch then MRI-guided core, and all came back benign.",
      "MessageIndex": 9,
      "PostDate": "10/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870560",
      "Title": "I think I have IBC, Please Help suzy2618 Ninagflo"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Oct 24, 2018 03:40PM - edited Oct 24, 2018 03:41PM by LoriCA ocicat I'm so sorry about all of the symptoms you are experiencing. IBC symptoms do not typically come and go over the course of a year without getting drastically worse, usually very quickly. If an abscess or infection heals on its own, that's also a very strong sign that it's not IBC. You haven't mentioned if you've had a mammogram, but that you've seen multiple doctors and none have seen a reason to be concerned? Your sleepless nights could be due to anxiety, but the fact that you were seeing patterns and were nauseous sounds indicative of a migraine. If you had IBC you would have much worse signs of it on your breast after a year (and likely ulceration because IBC involves the skin) that would be impossible to ignore, IBC moves fast, when I was diagnosed I was told I had 60 days if it didn't respond to chemo; I would've been dead well inside of a year. I wish you all the best in determining what is causing your symptoms, but I sincerely think you don't need to be concerned about IBC.",
      "MessageIndex": 2,
      "PostDate": "24/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867964",
      "Title": "Worried about IBC, ignored it for too long ocicat2 ocicat2"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Feb 22, 2019 06:37PM LoriCA wrote: What illimae said. Are her other mets stable or growing, and are they causing her any trouble? I have mets in the same places plus a few more so I understand what she - and you - are going through mentally. If the mets are stable and aren't causing trouble, I'd want to stay on H&P until progression. If they are growing or causing problems, truthfully I'd prefer to try Kadcyla (TDM-1) first, which is Herceptin plus a chemo, before going back to Taxol for a few reasons, especially if her other mets are responding to the H&P (some of mine respond well to H&P and some of mine just keep growing as if H&P is a fertilizer). Kadcyla is the standard next line of treatment for HER2+ when there's progression. She may already be resistant to Taxol (which is what happened to me 2nd time around after it worked so well the first time), she wouldn't lose her hair on Kadcyla, Kadcyla doesn't have the neuropathy risk of Taxol, most women find it fairly easy to tolerate, and it would let her save Taxol to try again when she really needs it. Staying on Herceptin and adding Xeloda (oral chemo) is another alternative that wouldn't be as drastic as Taxol. Unless her mets are growing fast or causing her problems, I would hold off as long as possible before retrying Taxol. But that's just my personal feelings.",
      "MessageIndex": 3,
      "PostDate": "22/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869929",
      "Title": "Daughter’s Scans Birchbark26 LoriCA"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Sep 21, 2018 06:58PM LoriCA wrote: Tristaan I'm so sorry, praying for love, peace and strength to help and your family through this difficult time. Princess will be dearly missed.",
      "MessageIndex": 9789,
      "PostDate": "21/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Dec 20, 2018 05:01PM LoriCA wrote: Crissey H&P has been doing a great job on my mets - my liver has completely resolved, my skin had completely healed and my skeleton still shows good signs of continued healing. Unfortunately my primary doesn't seem to respond to H&P only - shortly after I stopped chemo I had a full-blown recurrence of IBC. Since it's IBC the first sign is usually skin changes, nothing of concern showed on MRI so MO didn't think I could have recurrence so soon when the rest of me was doing so well, so I tried not to worry about it. Couple months later it was undeniable & it gets bad really fast (and painful), so we're trying the Taxol again since I had a great response the first time, along with H&P since it's still working on my mets. I think the average is 18 months with no progression on H&P (don't quote me on that) but there are several women here who have been on it for 7-10 years and still NED or at least stable. There's a big difference between having 1-2 small bone mets, and having more extensive mets in organs. None of your DX or treatments are showing, not sure if you're keeping them private or haven't entered them - do you have IBC too? It can be really stubborn. Lori",
      "MessageIndex": 3,
      "PostDate": "20/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868924",
      "Title": "Pain during PET scan? thecatlady LoriCA"
    },
    {
      "AuthorID": "LoriCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262616/profile",
      "Content": "Feb 8, 2019 02:00AM LoriCA wrote: Beneath your collar bone (and not actually on a breast) would be an unusual location for a \"rash\" due to IBC, and you don't mention any of the symptoms that would typically indicate IBC - affected breast appearing inflamed (hence the name) with redness, swelling, radiating heat, skin thickening, and peau d'orange (orange peel) appearance to the affected breast. IBC infiltrates the lymph vessels of the breast which is what causes the symptoms. It would also be unusual to have pain in a breast that has no other symptoms. You could request a skin punch biopsy for peace of mind, but sometimes a rash is just a rash or it could be something altogether different. Pain in your left chest that radiates down your left arm is serious and should be checked out because that's the warning sign of a heart attack.",
      "MessageIndex": 1,
      "PostDate": "08/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869747",
      "Title": "Worried it is IBC!! TealJay TealJay"
    }
  ]
}