{
  "AuthorID": "Lories",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
  "Posts": [
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 9, 2009 09:51PM Lories wrote: Hi Joann, I would not wait to see a dermatologist, I would go to one now.  I actually see a Physician's Assistant, who does skin stuff (almost a dermatologist) but he is amazing at figuring odd skin reactions out.  I have had wierd stuff from soap from surgery, from drugs during a colonscopy and also a wierd outbreak on my face that was from lack of hormones (my general physician was trying to give me face creams). Every odd thing I have ever had he knew exactly what it was.  If you do not have a dermatologist, ask around for ideas or get a referral.  It could be something simple that he can give you something for, but if it is getting larger, it is harder to get rid of as it sounds like it is spreading not going away. Best of luck.  Lori",
      "MessageIndex": 3,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728767",
      "Title": "Weird Skin Reaction Post-Radiation Jo_Ann_K LindaSuz"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 23, 2009 07:13PM Lories wrote: Hi Carol, it sounds like you are in good hands as far as referrals and getting things moving.  Sounds like you have a good attitude, a funny movie always helps out too. Wishing you my best.  Lori",
      "MessageIndex": 4,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727852",
      "Title": "Moving Up to the Big Board IowaDiva webwriter"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 27, 2009 11:00AM Lories wrote: Go to a funny movie and treat yourself to some popcorn and laugh and laugh and laugh.  I saw Yes man with my 13 year old, that really helped. best wishes to you!! ",
      "MessageIndex": 6,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/728042",
      "Title": "OK on the outside, YIKES on inside! ghety Mykidsmom"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 10, 2009 07:20AM - edited Mar 10, 2009 08:10AM by Lories Ok, so I am not a doctor, but the benign is a good thing, but they are flagging the enlarged lymph node.  A breast surgeon may send you for some more tests so she can check to make sure that nothing else shows up, or perhaps she may wait.  I would breathe a sigh of relief until you hear more.  best of luck.  someone else may write with lots more info.   ",
      "MessageIndex": 1,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/730434",
      "Title": "Need help understanding test results...please! amypat Ina"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 10, 2009 07:26AM Lories wrote: Amypat - that is good.  When I had my return mammogram because something looked fishy - and then I looked at it, I just knew. I was also really calm.  I had a couple of other panicky false reads before so this time for me was really different. ",
      "MessageIndex": 3,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/730434",
      "Title": "Need help understanding test results...please! amypat Ina"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Anyone else out there planning a January lumpectomy?  I see there is a Jan Mas. site so thought we could do another. Mine is scheduled for January 5.  Looking forward to meeting others.  Lori Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726593",
      "Title": "January Lumpectomy Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 2, 2009 04:22AM Lories wrote: Hi Paula, I have heard of a few people that went back a few days after a lumpectomy, my sister was one.  She was working as a consultant and so needed to get paid, but she did say she worked more limited hours, and was tired.  I had surgery on a lipoma in my abdomen in November, before I even knew about the BC.  Between the soreness and the recovery from surgery, I went back to work a week later, but did not feel up to par until the week after that, so I worked less hours.  I figure if I can relax at home and feel better, I will do that, why push it.  BC seems to happen to people under a lot of stress, so i am going to do what I can to lay back and try and relax.  But I am lucky, my boss said to take as much time as I needed. ",
      "MessageIndex": 7,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726593",
      "Title": "January Lumpectomy Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 7, 2009 03:26AM Lories wrote: Hi all, just wanted to report in.  Yesterday went pretty smoothly, but I had a rough time last night and today. The wire insertion was not that bad, even though the doc kind of missed with the first one, and had to put in another.  But it was relatively easy and so was the radioactive gunk going in.  Like Katherine, I thought the mapping was interesting, although the room was so cold they routinely tent the patients with a blanket, so I was starting to get a little claustrophobic.  I was wondering how they would map the node and found it interesting with two sets of hands one with a radioactive pen the other with a sharpie in there making the big black X. My surgery was about an hour and a quarter late, so I was beginning to get anxious.  I got to the hospital at 7 and they did not operate until 12:30, so it was a rather long wait. Got home about 5 - I have a drain that I have to empty.  He believes he got clear margins and they took out 6 nodes. Three they tested clear right away, the others will get tested later. I have not read today, but hopefully tomorrow. But somehow or other I got every known side effect from the pain meds, hydrocdone pap, or Vicoden.  Even though I have taken it before, I was dizzy, nauseous and vomited.  I was not even taking a full dose of two pills.  My doc called in an anti-nausea medicine which I took about noon, and this is the first time I have been out of bed all day besides teetering to the bathroom.  So I am finally beginning to feel better now. As always my fingers are crossed for all of us from yesterday, Katherine and Amalija.  thanks for all the good thoughts and we will be waiting to hear from you all. Some things to get - a small pillow, you can put it on your hip and rest your arm on it.  Saltine crackers and ginger ale to settle your stomach.",
      "MessageIndex": 23,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726593",
      "Title": "January Lumpectomy Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 2, 2009 05:07PM Lories wrote: Hi Katherine, so I just counted the time zones out on my fingers (geesh at 52 and I still can't count backwards well) and you and I will be in there at about the same time.  My dye and wires are scheduled at 8 - and we are 4 hours behind you, so I will be getting mine an hour after yours - I will think good thoughts across the country to you. I cannot tell why they have those things schedueld at the same time, when it sounds like they will be wheeling me around from dept to dept to get the different items.  The wire placement is at imaging and the radioactive goop is in another area.  Why not do it all in the op room while we are under.  sigh.... I see the radiation onc. today, so I can expect they will chat about hormone receptors too.  Thanks for the tip, I will read up a bit on that before my appointment. Your tests have really dragged out sweetie, it will be good to have the surgery over.  Lori",
      "MessageIndex": 9,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726593",
      "Title": "January Lumpectomy Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 22, 2009 07:02AM - edited Jan 22, 2009 07:04AM by Lories Hi jdeking - I am so, so sorry to hear you have to go back in to surgery.  I also find you amazing that you went back to work so fast -  I ended up having two weeks off (not on purpose, snow days for school, but I took them too) and ended up feeling really rested.  In my mind I am comparing cancer treatment to a marathon, not a sprint - we have a lot of taxing, rough treatment on our body ahead of us, so take your time getting better if you can. You don't want to hit the wall early. I alo had a lot of stomach upset with the pain meds - my doc gave me an anti-nausea to combat the side effects.  That really helped relieve the dizziness, nausea and vomiting for me.  You may want to ask for that, it sure made me feel 100% more able to deal with recovering. I will be thinking of you - post when you can after surgery.  I wish you clean margins on round #2!  Lori",
      "MessageIndex": 54,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726593",
      "Title": "January Lumpectomy Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 14, 2009 01:36PM Lories wrote: Hi Laurie, I had my lumpectomy and SNB a week ago Monday.  I ended up staying in bed most of last week simply to get my fluids down so the drain could be removed on Monday.  I went in to work yesterday and only lasted a few hours.  I just decided not to push it and my boss is cool with me taking it slow. Luckily we had an ice storm today so they closed the schools and I thought I may as well not tackle the weather either.  So, 10 days later I am relaxing at home, and taking it slow.  I am 52, and my job is mostly sitting at a desk.  I did not have any instructions not to drive, I know Britt did, but I figure I need to rest up for the rest of the onslaught - radiation at a minimum. One thing is my husband has been really helpful and my friends bought us Super Suppers, so making meals has not been an issue. Surgery stuff - My scar is on the bottom portion of my breast, basically from the nipple down, looking at me you cannot see it.  What is rather annoying is I have a hole in my side from the drain output and then a small crescent above my breast, maybe it was to insert the drain.  That kind of hits and rubs at the cotton bra I got, so today I skipped the bra for an undershirt.  The numbness under my arm is annoying as well, but I have heard it will go away. Here are some sage words I have read here and from friends: - be gentle with yourself and give yourself time to heal - you don't have to be brave you just have to show up  Thinking of you.  Lori",
      "MessageIndex": 40,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726593",
      "Title": "January Lumpectomy Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 15, 2009 01:29PM Lories wrote: Hi Laurie, thinking good thoughts for you, clear margins, no nodes involved. Britt, hope you are doing well, one more sleep. Katherine, one and a half more days and you are done with rads.  Well done, you sound good. Anchorage is a balmy almost 50 degrees today. School was cancelled again, so I stayed home.  It appears as if it is meant to be to stay home and rest. ",
      "MessageIndex": 44,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726593",
      "Title": "January Lumpectomy Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Anyone else out there planning a January lumpectomy?  I see there is a Jan Mas. site so thought we could do another. Mine is scheduled for January 5.  Looking forward to meeting others.  Lori Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "31/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726593",
      "Title": "January Lumpectomy Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 2, 2009 03:09AM - edited Jan 2, 2009 03:11AM by Lories Hi Katherine, melmedic and Paula - I got my receptor status with my biopsy as well - could be they just wanted to hold on the whole test until they had more to examine, who knows. I am having SNB and possibly the axillary dissection.  I just met someone today who described more fully the wire marker insertion and I am not looking forward to that at all.  The radiologist, who has done my tests also, told her it would hurt a lot since she had to place a needle directly into her nipple.  Great.  argggg.  So Katherine and I will have to come back and chat and share notes since we both have our surgery on Monday.  I have surgery at 11 and have been asked to show up at 7 so they can shoot the radioactive glob at 8 (takes 3 hours) and for the wire markers.  I am in Alaska, so you all may be before me timewise. Best luck to us all on clear margins and smooth sailing.  Lori",
      "MessageIndex": 5,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726593",
      "Title": "January Lumpectomy Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 11, 2009 04:03AM Lories wrote: Hi, well I am now on day 2 of staying in bed.  I was really pouting about this dang drain and so my husband told me to stay in bed and rest to reduce the flow.  The flow has reduced some but still not down at the right level, so I am hoping I will have met the correct measures by Monday (my doc is so strict). I am also trying to lessen the pain meds which gives me a good feel for the two areas they worked in.  I have decided not to go back to work until the drain is out -I can just see me dropping it - already have a couple of times and yeowch, or exposing it or my drain lines and freaking someone out.  So will try and hang tough. My boss was pretty cool about it. I am so lucky my husband is taking care of everything.  Our dryer is even broken, I was stressing about getting out to buy a new one, my teenage daughter was stressing about clean underwear - husband said not to worry we could just buy new underwear for now.  ha ha. how is everyone else doing?",
      "MessageIndex": 26,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726593",
      "Title": "January Lumpectomy Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 3, 2009 06:35AM Lories wrote: Hey Katherine, I had to go for pre-op today and I asked the nurse.  She said they usually locate the wires based on how they did the biopsy - mine was done with a sonogram too  Sounds pretty much what Tay explained - thanks so much for that Tay. She said that usually (at least in our hospital) they have you in imaging and locate the wires, then they also inject the radioactive goop, then possibly a mammogram to get a photo then they whisk you over to the area where they monitor how the radioactive goop is traveling.  Thanks also Tay for the thought of keeping up with pain meds.  I understand that if you get behind on the meds it is hard to catch up. I do not have any xanax, I sure wish I did!  Is that a find it on the street kind of thing? ha ha.  I really enjoyed the article Brit found from the NYT about the wire locates.  She posted it on this forum, it is worth a read - here it is since we are on the brink.  http://www.nytimes.com/2008/12/28/fashion/28love.html?_r=1&partner=rss&emc=rss we will do great!  Lori",
      "MessageIndex": 13,
      "PostDate": "03/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726593",
      "Title": "January Lumpectomy Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 11, 2009 10:39PM Lories wrote: Hi Katherine, Wow, they talked to me about the mammo site radiation but I just said no to that.  That will be interesting to hear how that goes. That is amazing they are starting radiation so much earlier.  I go in on Wednesday for the set up. I had a lower drainage amount this morning and I am going to beg them to take the drain out tomorrow.  I think I am close - my last reading was 7cc (supposed to have 5).  Sounds like at least mine is contained since you are having oozing and no drain, so I will not complain so much.  Even so, I am hanging on the couch today, to keep my dainage amount down.  I think tomorrow I will likely not go to work, but do need to go buy a new dryer.  ha ha. Since I have been all wrapped up since the surgery I have not had a glimpse at how anything under the bandages, like my breast or node site looks.  One thing, I can tell that my underarm is numb, which feels really odd, hopefully it will get better over time. I also noticed that I think they adjusted my numbers of postings because I emailed this site to complain about being locked off after 5 posts per day, I did not realize I had reached over 40.  Hopefully I am clear to post at will.  cool. Let me know how the radiation goes.  Lori",
      "MessageIndex": 30,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726593",
      "Title": "January Lumpectomy Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Anyone else out there planning a January lumpectomy?  I see there is a Jan Mas. site so thought we could do another. Mine is scheduled for January 5.  Looking forward to meeting others.  Lori Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "31/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726593",
      "Title": "January Lumpectomy Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 27, 2009 11:07AM Lories wrote: Hi Ricki13 - I too was so sick of the dang drain, my husband made me stay in bed and that cut the flow dramatically.  You are lucky to have to get to 30mls, I had to have 5mls in 3-12 hour periods.  So try not moving around too much, sit still and chill baby.  Enlist the troops to help out.  It felt so good to get it out. The nurse told me that one woman had hers in for weeks since she kept going to the gym! I got my drain out in a week, and then went into work the next day (like you who wants icky drains at work. I kept dropping mine, OUCH) and I was worthless at work.  The weather gods were with me, and we had three snow days so I stayed home.  Stay home if you can, or work shorter hours until you feel up to par.  Remember this is a marathon not a sprint, take your time.   Lori",
      "MessageIndex": 71,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726593",
      "Title": "January Lumpectomy Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 16, 2009 04:16AM Lories wrote: Hi all, I see my oncologist next week and a research nurse will also attend to talk about this trial.  Since my tumor was less than 1cm I am hoping the grade will push me through to be part of the trial and get tested.  Ha, just read what I wrote, don't get me wrong, I am not happy with a grade 2, but really would like to get the oncotype test and like glendag do everything possible. Glad to find this thread.  Lori",
      "MessageIndex": 10,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726067",
      "Title": "TailorX Trial InfoSeeker2008 Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 3, 2009 04:30PM Lories wrote: Hi all, I was planning to do the trial and then after talking to the oncologist decided to wait and see what my score was. it was 19 - still trying to decide, chemo or no or do the trial and let it decide for me.  arggggg",
      "MessageIndex": 13,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726067",
      "Title": "TailorX Trial InfoSeeker2008 Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 13, 2009 01:39PM Lories wrote: My simulation just got pushed back until the 29th, giving me a couple of weeks between surgery and radiation and I was hoping they could turn my upcoming tatts into something creative, I saw someone else mention Brad Pitt.  Probably not likely I guess? Torch Song, care to share what you have tattooed already? ",
      "MessageIndex": 2,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/727280",
      "Title": "\"Elective\" tattoos and rads TorchSong TorchSong"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 3, 2009 06:41PM Lories wrote: Hi nopink - thank you so much for your thoughts and your story and your support.  I work with a woman who had another type of cancer and she said she would do the chemo as well.  So, I just asked the nurse to tell the oncologist I need to speak to him about my options.  thanks so much......Lori",
      "MessageIndex": 15,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726067",
      "Title": "TailorX Trial InfoSeeker2008 Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Apr 12, 2009 04:04PM Lories wrote: Hi Idaho, when I had my first meeting with my rads onc I told him I was not sleeping.  He suggested I pop a benadryl, it helps you sleep and is not habit forming or an anti-oxident.  Hope that helps.",
      "MessageIndex": 1,
      "PostDate": "12/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/732358",
      "Title": "I AM SO CONFUSED! idaho terrilee"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 18, 2009 01:59PM Lories wrote: Hi Joan - leaf is right.  Since your gyn got you started they can order up the biopsy. The other thing they can do is to recommend a BS or surgeon who is familiar with breast cancer surgery and treatment.  In my town there are only 2 BS so the surgeon I had recommended by my OBgyn years ago (when I had a small cyst) had done a lot of breast surgeries. He is also one of the main supporters of BC fundraising in town and I routinely send all my mammograms and test results to him. His nurses were right on the stick and ordered my biopsy immediately. He called me on the phone with the diagnosis and when I saw him a few days later to discuss it all, he ordered up an MRI.  He wanted to be sure the cancer had not spread anywhere which can show up on MRI.  His staff got me in the very next day (Christmas Eve) which was incredible. So, get that biopsy scheduled asap and also get some recommendations on a surgeon, and have your obgyn get you in for an appointment - these docs have the power to move us up in lines and get us seen soon.   Or if you know someone who knows someone get help to weasal in (remember I said I was impatient :)) My obgyn was very good and called me as well to ensure I was good with a surgeon as well when he realized I needed a biopsy.  I am so lucky to have good people, and there are a lot of them out there. Your signature does not say where you live, but you may get some advice from this forum. If you lived in Anchorage I could help.  Thinking of you.  Lori",
      "MessageIndex": 9,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/727544",
      "Title": "Spiculated Mass joanmac52 Moderators"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 17, 2009 09:13PM Lories wrote: Hi joanmac - first I am sorry you had to join the club, I was just diagnosed a month ago today, right before Christmas, so am fresh in the mix.  Luckily, for me, because I am so impatient, I was able to be diagnosed quickly and had the surgery a few weeks later. The first procedure will be a biopsy, so do encourage your doc to set one up soon.  That is the worst part, waiting for the biopsy, then waiting for results, then waiting for the next step. There are a number of different techniques for doing a biopsy, one, if you can feel the lump, the doc can take a sample with a needle.  If not they will either locate it on a sonogram or with a mammogram or with an MRI to locate the mass and then take a sample.  Once you know what kind of biopsy you are having, there are a lot of different threads on this forum that can explain the technique.  It could be a day or two later that you get pathology results, then your doc can offer different choices and can recommend what comes next.  When it comes to surgery, if it is indeed cancer, then chose what you feel is the best way to go.  Most treatment options have similar outcomes and your doc can help with his thoughts as well.  Much depends on the type of cancer and the location and the size and the size of your breasts as well. This is not a fun time for you, but this site is an excellent place to find answers and ask questions.  I hope things turn out well - there are many, many caring people here who are a fabulous resource, and we are with you!  Keep us posted.  Lori",
      "MessageIndex": 3,
      "PostDate": "17/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/727544",
      "Title": "Spiculated Mass joanmac52 Moderators"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 1, 2009 08:31PM Lories wrote: Hi souad - my rads oncologist told me about the Canadian and British studies that do fewer treatments - so he is following that (which is cool, I live in Alaska, so I am thankful he is up on his research). However, most of our sisters being treated in the US are still on the 6-7 week program.  He told me if my margins were close I would need more rads, but I had 8mm - 1 cm margins. My sister had treatment in Mississauga and had the 16 days of rads too.  I have no idea the differences, they must have a secret decoder ring to figure these things out, or someone on here knows.  Just curious, but how large was your tumor, it is not on your signature line?  Maybe that makes a difference.",
      "MessageIndex": 11,
      "PostDate": "01/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 2, 2009 09:10AM - edited Feb 2, 2009 09:11AM by Lories Hi Penny, thanks so much for the best wishes.  I sure appreciate the hints. hmmm and the Brad Pitt idea has me thinking... cheers, Lori",
      "MessageIndex": 16,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 2, 2009 09:23AM Lories wrote: Hey Maria, welcome to our thread.  Even though your rads are in different areas, you are still fighting the same fight. I am so sorry you are having to go through this again, but we sure appreciate you sharing your experiences.  Now, I need to go and find some camis with shelf bras.  hmm in Anchorage in winter, yeah sure...... hope today goes well for you and mary and bradswife.  Lori",
      "MessageIndex": 18,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 4, 2009 01:26AM Lories wrote: Hi bradswife, sounds like your ride is a little clunky right now. Have you not gotten your tatts yet?  I did but one seems to have disappeared, guess I will see what they say about that tomorrow. I did read on another thread that we cannot have them removed in case our other breast gets involved and they know where they radiated  (ok, I admit, I went out for dinner with drinks, trust me I am not a doctor, merely a messed up CANCER patient, and this is my feeble interpretation of what they do) ha ha so you are stuck with the tatts baby, we all are.  I asked for different colors but they could not oblige.  I also heard someone was hoping for Brad Pitt.  sweet!!! I will be thinking of you all tomorrow. Lori",
      "MessageIndex": 37,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 4, 2009 11:43PM Lories wrote: Hi momtobe - my oncologist told me I would start hormones once rads were done as well - I think that is pretty standard, one treatment at a time.  Pre-menopausal women are typically given tamoxifen, or a derivitave.  I am post menopausal, I will get femara.",
      "MessageIndex": 48,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 8, 2009 05:18PM Lories wrote: Hi Pam, welcome.  We are pretty close time wise, I had my surgery done Jan 5. I read some other posts, some folks talk about emu oil, and aloe vera - I ordered some Jean's radiation cream.  I had to order it online, no vendors in Alaska, but they may sell it in Georgia!  Jean even emailed me personally and it seems like a gret cream, she developed it after radiation. Glad you are aboard.  My main complaint has been feeling tired, very tired, but decided I need to exercise, so I am doing that.  check out the Jean's web site.  Lori",
      "MessageIndex": 101,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 8, 2009 08:58PM - edited Feb 8, 2009 08:59PM by Lories Hi Denni, thats me, guilty as charged. I just have three treatments,  but your comment makes me feel better about slowing down, perhaps i should just take it easy and cut back my hours.  I was so drained on Friday I could barely stand.  I am going to keep up the treadmill and elliptical.  I finally am at the point where I realize I need the exercise to be healthy and fight this thing. Glad you are aboard the train Denni, there is nothing like sharing our experiences.  How many more days do you have?  Lori",
      "MessageIndex": 108,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 9, 2009 08:01PM Lories wrote: Hi Heather, welcome, it's good to have you on board. Mandy - one down - good job.  I got to see the doc today, I guess every Monday you go to chat with him, I also had my arm measured, make sure there is no lymphedema starting and the just want to make sure all is fine.  My breast is starting to hurt a bit, especially my nipple is kind of sore, that is with only 4 down, hope it does not get worse. Jane - tomorrow sounds like your simulation, for me they did it all on one bed type thing, just slid me in and out a bunch of times.  It actually went faster, it all just depends on their calculations and figuring it all out.  I visited the oncology therapy room today and am going to go in Friday and get evaluated - sounds like you can exercise too much while on rads so they are going to figure that out for me.  I am looking forward to that. ",
      "MessageIndex": 125,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 10, 2009 11:24PM Lories wrote: Hi Debra - welcome.  I think you have it together.  I carry my aloe vera cream in my purse so it does not get all cold in the car then slather it on after treatment.  Drink lots of water, we were all chatting about that earlier.  Jane, what a novel idea, pain in another area of our body....hmmm.  Hope you feel better soon, glad you got rid of it now. ",
      "MessageIndex": 140,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 12, 2009 12:09AM Lories wrote: Hey welcome aboard Lindy and Jeanne.  Glad to have you both. Jeanne - You may want to also have some undershirts handy, that is what I am wearing it is softer without anything rubbing on me.  The spray sounds great, where did you find it?  I am getting some relief from the Gold's cream. Lindy, I have heard this is easier than chemo, welcome.  Mamie, I put you down for 5 days on our passenger list, that is what my buddy Katherine had, are you done in a week?  cheers, Lori",
      "MessageIndex": 157,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 13, 2009 01:20PM Lories wrote: INCHOCO - I think it was a guy I work with that put the chocolate bars on my car - of course in Alaska where it really never gets past 70 it can work, i wouldn't want to try it in Hawaii, it would be more maliciious, ha ha. Oh forgot to tell you about the cookies yesterday.  I made a huge batch, dropped some off with the valet parking guys(they have a free service and the guys sometimes even sing for the patients) so left some for them, the front rads staff, the nurses and then when I went into rads, one of the techs said \"I would kill for a chocolate Krispy Kream donut\" which is tricky because we do not even have Krispy Kreams here in Alaska - so I said, how about a chocolate chip cookie?  I made their day- I am glad I baked them and took them in. I am getting ready to go to #8 which will be 1/2 way for me.  My husband and i are going out to lunch to celebrate.  And then the weekend off, yeahhhh.  happy weekend to you all, and happy V day.",
      "MessageIndex": 179,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 14, 2009 09:51AM - edited Feb 14, 2009 09:55AM by Lories Hi and welcome to Caren and Keryl - glad to meet you both - Keryl - it is not hard at all, just lay there.  Setup takes longer than treatment, and you will be on the road longer than any of it.  Sorry you have to drive so far to the center, but sounds like a good opportunity to squeeze some shopping in, anytime is a good time to shop!!! Happy Valentines Day to you all, now mosey on down to the dining car - special today is strawberry tarts, yumm, with travel sized aloe vera.  Enjoy your days off!!! souad - I was able to read your post on an email (I get alerts when people post), you can edit instead of just deleting, not sure if you knew that.  I thought ET was cute:) Lori",
      "MessageIndex": 191,
      "PostDate": "14/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 17, 2009 09:21AM Lories wrote: Hi all, just an update. Yesterday I saw the onc doc and nurse for my weekly review.  I am half way through on the short course of treatment (16 total) - I believe my doses are higher.  My skin is very pink for the whole radiated area - in fact on Monday before going in I was suprised to see it very pink (before it had faded) I have had some swelling of the nipple and in my armpit that is noticeable and a bit painful, I am taking aleve or advil for that.  Both the doc and the nurse said I looked pretty normal for this time of the radiation.  He also told me that four or five days after I am done with my treatments I will have the peak of the side effects - which is odd but glad I know.  I have been using Jean's cream immediately after radiation, then Gold Bond cream with aloe when I get home (5ish) and at bedtime.  The nurse said my skin looks really good and asked the name of the creams so she could tell others. I just wanted to give you an update so you know what may be coming your way.  I think with the shortened course I may be on the fast track.  I hope everyone has a pleasant treatment today.  all my best, Lori",
      "MessageIndex": 258,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 18, 2009 09:11AM - edited Feb 18, 2009 09:31AM by Lories Mandy - please do not imply that I said my techs were afraid to touch me.  That is not the case.  I am very impressed with their pleasant demeanor, and they have never, never made me feel that I was untouchable.  so much for my bogus theory, found this online You don't have to worry that you'll glow in the dark after radiation treatment: People who receive external radiation are not radioactive. You'll be able to have normal contact with family and friends after you leave the treatment room. But some people do not appreciate contact with others either, and I would not want to force anyone to touch me.  Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2-",
      "MessageIndex": 273,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 18, 2009 10:50PM - edited Feb 18, 2009 10:55PM by Lories Hi all, I am just over half way done on the short treatment (16 sessions) and today I was just bowled over from exhaustion.  It did not help I had to meet with a couple of obnoxious idiots from another agency and they took the entire afternoon up, I kept thinking about bed - I am totally wiped out.  I thought I was going to pass out at work.  Time to definately slow down.  welcome to Rainy and Ingrid (a recurrence is truly a bummer, sorry:(() ! Hope I did not miss anyone.  Lori",
      "MessageIndex": 290,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 20, 2009 06:29PM Lories wrote: Hi cupcake, the tech told me today that the end of the week seems to be most tiring for people because the radiation does accumulate during the week.  Not sure if that helps, but I have noticed my fatique seems to hit later in the week, but this week i think it hit earlier because of the number of treatments I have done and the dosage.  I have13 down, 3 to go, so that may be it.  Rest up this weekend all. ",
      "MessageIndex": 334,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 25, 2009 09:59PM Lories wrote: Hi Mom,  Sorry about the tatts, I think that is something you need to accept. BUT - and this is a big but - your rads setup does not sound right at all.  Can you speak to your rads onc about it?  They really need to provide you a place to change, or ask for a cape thingy to cover yourself or a gown.  That would make me feel uncomfortable too, and they really should keep the other person out until you are dressed and done, and you should not have to rush. this may be a case of the techs taking over for their ease, you should voice your concerns.  It is your right to have some privacy.  let us know how it goes.  Lori",
      "MessageIndex": 425,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 434,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 1, 2009 09:04PM Lories wrote: Hi Mary, congrats on being half way done. My skin is still pink, but I do not think it is worse.  They seemed to think it would get redder by the time I visit there next Wednesday, we shall see.  :)",
      "MessageIndex": 471,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 9, 2009 11:08PM Lories wrote: Hey Souad - my daughter rented me the dvd Crazy, Sexy Cancer - it is interesting to see her firsthand since we both have the book. I would go insane having the kind of cancer she has where you can't do anything!!  She sure went to extreme diet lengths too.  take care.  Lori",
      "MessageIndex": 537,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 620,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 20, 2009 11:00AM Lories wrote: Pottergal - congrats!  I want to tell you there is life after rads. It has been just over 3 weeks for me since I have been done, my energy level is getting better, the redness peaked at about 2 weeks post rads.  I am feeling better.  Of course now my Femara SE's are kicking in, yesterday I could hardly use my right hand, but that is antoher thread. Hang in there guys! Kari - yeah 2 more, with a weekend to relax.  congrats all.  Lori",
      "MessageIndex": 631,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 682,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 713,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 744,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 775,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 806,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 30, 2009 05:13PM Lories wrote: bump, still waiting for others......its almost February.",
      "MessageIndex": 1,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 1, 2009 06:28PM Lories wrote: Hi Sue-Ann - No sense rushing into it if you are not yet healed, it could be harder.  Keep us posted. :)",
      "MessageIndex": 7,
      "PostDate": "01/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 1, 2009 08:57PM Lories wrote: all right ladies - grab your aloe vera, pack up your tank tops  - I am going to try and think of these rads as a tanning bed - heck we need the same stuff, now all we need is a nice cool drink..... champagne? cosmos? margaritas? ",
      "MessageIndex": 12,
      "PostDate": "01/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 2, 2009 08:55PM Lories wrote: Hi mary - NBC news just did a story on the reduced radiation, so that is very cool.  I am glad I am on board the express train.  Best of luck tomorrow.  Lori",
      "MessageIndex": 22,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 4, 2009 11:52PM Lories wrote: Well I had my first rad today.  They said it would take a bit longer with x-rays and it really only took about half an hour total with all that. It took me longer to wipe off all the sharpie than it took for the rads. Momtob - I had tatts last week, I got three and I could not even see them, but somehow they found them.  I am sorry your facility is set up that way with the cameras, that is not very sensitively designed.  I go to a brand new cancer center too, but they have a short wall set up where they are sitting with the cameras.  They have separate seating areas for men and women.  I really have to say that whoever designed the facility did a really nice job.  The room is huge, the ceiling is rather low, but it is all wood paneled squares - the fluorescent lights have nice wood frames around the edges and the lights are artfully placed and have inserts of the blue sky, clouds and cherry blossoms, and they are not all the same view - it is like laying under trees.  I was impressed they really tried and i am so lucky to be able to drive there in less than 5 minutes from my office.  There is a huge, thick door like a bank vault, but because it is down a hallway you do not get the feeling that you are locked in.  Someone really paid attention to how vulnerable you feel as a patient. That was probably the best thing about today - after seeing my oncologist I feel totally down.  Tomorrow will be better.",
      "MessageIndex": 49,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 5, 2009 09:10AM Lories wrote: Hi Mandy, welcome to our rads train.  Try not to be too nervous, although I was.  But in reality this is the least painful thing of all the stuff we have been through, biopsies, wire insertion, surgeries, man this is relatively easy.  Let us know how it goes.  best of luck.  Lori",
      "MessageIndex": 55,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 7, 2009 12:34PM Lories wrote: Hi and welcome to Talk2me and Sittintrot Sittintrot - The way I hear it radiation has changed and it is much more simpler and easier now, and you should be face up this time.  I hope it goes easy for you. Try and think of this as a whole new thing. At my first treatment I had to ask them if it was done.  I was expecting a sun lamp kind of experience, but its just a hum, then the machine moves over to another spot.  I can only really tell it's on if my peripheral vision picks up the lights on the far wall signaling it is on.  I have not had any discomfort and I usually wear fun shoes so that starts the conversation going. The techs have all been very nice.  They all introduced themselves to me and chat while they are setting me up.  I have these painted danskos so that gets them going, where did you buy them? etc.  I am thinking of bringing in some cookies next week for them. Jane I got totally tired yesterday, man it was a different kind of tired.  Souad- I did read on one of the other boards that a woman walked every day after her treatment.  I need to get to the gym, it is too icy to walk outside here, but that could really help, to get those endorphins rolling.  Now to just do it. Talk2me - your appointment on the 17th may be your simulation - did they say it could take over an hour or so?  They line you up on the table, did a cat-scan on me and give you little dots - mine were tattoos which did not hurt, I got three of them,  and I can barely see them.  Don't be nervous. the worst part was holding your arms over your head for a long time.  The method of making the mold was very cool as well, it just inflated under me.  Of cours I am a geek and get impressed with technology. Souad and others - re creams, the techs do not want you having anything on before treatment, after you can do what you want.  You may want to get something, I have read of a leather like resultant on your radiated area.  I am using the Jeans cream, which is like aloe Vera.  I carry a tube in my purse and right after treatment slather it on then put regular aloe Vera cream on at bedtime.  The next morning I wash it all off in the shower, but their instructions were not to let hot water directly hit the radiation area, so I stand off to the side and lather up.  I also bought some Dove's bath wash (unscented) in a bottle and that is fine as well for my soap.  They don't want us using anything with aluminum (deodorants) before treatment.  Tom's natural deodorant is fine as well, or the cornstarch.  I will check out this Sween Cream. Let me review the list of vitamins I got off another thread and post them here.  cheers and welcome to a couple of days off, we deserve it.  Lori",
      "MessageIndex": 86,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 7, 2009 12:55PM Lories wrote: Souad - can you list the author's name for the cookbook and other book please?  Full title would be good - I looked online and could only find one by a Barnard - that would help lots thanks. That talk of chocolate got me thinking.....",
      "MessageIndex": 87,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 8, 2009 09:02PM - edited Feb 8, 2009 09:06PM by Lories Hi Ter, it is natural to be nervous but its really over very very fast.  I am glad you got good vibes from your team.  I sure have with mine.  They are there to help and they sure do work hard.  Their poor arms must get tired in a day pushing and pulling our weight around on the table.  (oh, what they do, at least for me, is you lay on a sheet and they tell you to just lay heavy, then they tug the sheet you are on to get you in the right position.)  I mean if you really think about it, how lazy we can be to just lay there like queens while they move us.  ha ha. I will be thinking of you tomorrow on our #1!",
      "MessageIndex": 109,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 124,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 9, 2009 10:18PM Lories wrote: Hi Jane, I met with the rads oncologist before I even had surgery, then after surgery I met with him again briefly, he examined me and then they did all the measurements, cat-scan, tattoos, etc.   But, I did not begin treatments until a few days later - they did all the setup on a Thursday, first day of rads was not until the next Wednesday.   They needed time to do calculations, calibrating the machine or whatever technical mumbo jumbo they had to do before they had me in.  I think they were really busy with a lot of folks that were hurting as well. The first actual day of rads took a little longer because they took x-rays as well, so it was more like an hour in there.  Each time after has been really brief.  Once a week they have you speak to the doctor, I guess they have us set up for Mondays, so after my rads, I got weighed and my arms measured and talked to the doc. So, you may not start for a day or two, depends how busy they are.  I keep forgetting to ask if they are going to be open next Monday, since it is President's Day.  Have to remember to ask tomorrow.  L",
      "MessageIndex": 127,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 11, 2009 10:50PM - edited Feb 11, 2009 11:33PM by Lories Hi Mamie, welcome.  Rads are rads, and yours will be much faster!  A friend of mine on this board (no have never met her) but they did have a thread on the mammo site rads, just to get info on that one, but welcome welcome to our rads train. Hi Seabee, glad you are joining us.  Sorry your arms are so sore, the simulation is the hardest, longest time you have to hold your arms up.  I hope it gets easier for you. Jane, my personal theory is that rads oncologists are rather geeky and not perhaps the most personable folks.  Mine is a bit of a goofball, but he comes and chats with me and explains things very well, so see them as the geeks they are.  I am so sorry that she said that, rather uncaring, I don't think she thought at all, I think she should have said, smaller rather than larger, and be clinical about it. I am baking cookies for my rads guys now.....I hope you all have a good day - only 2 more this week.  Lori",
      "MessageIndex": 149,
      "PostDate": "11/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 155,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 12, 2009 09:07AM Lories wrote: Hi Slm, I think Tom's is available just about anywhere - I got one at the local supermarket and then one at a health food store (put one in my gym bag).  I thought we needed unscented, but someone had a flavored one.  They are rather pricey, but I like the idea of smooth and easy to put on.  Also, I was not really into cornstarch, but I found a baby powder that is pure cornstarch, so that is quite soothing, especially under my breast where it gets kind of redder. Heather- I was using straight aloe Vera, but I think I needed something else with it.  I have used Jean's radiation cream (had to mail order it, not available everywhere) and then Gold Label,which is a white cream with aloe Vera.  It seemed to really help my red sore nipple.  Ouch, worse than breast feeding. Have a great day everyone!  Lets knock those rads down!!!  Lori",
      "MessageIndex": 165,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 13, 2009 06:48PM Lories wrote: Hi Joy, I am so glad you are doing well. that is great news about the dogsitter, I am sure that you feel so much better going that route.  And I am glad you get to come home and reassure your dog on the weekends, this way he knows you are not leaving him.  Your step kids sound very mature and caring to be keeping in touch with you, that is very cool.  Enjoy the weekend.  Lori",
      "MessageIndex": 184,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 15, 2009 07:52PM Lories wrote: Hi, I was not aware there were rads trials, interesting. Has anyone done oncology physical therapy?  I went and got tested the other day, our cancer center has a nutritionist/counsellor and physical therapist, who is also a lymphedema pt - so I went and got checked out for their exercise program - 2 hours twice a week. I am going to go tomorrow.  I was worried about doing too much and wearing myself out at the gym, but I realize I really need to exercise for the femara routine, sounds like keeping bones moving might help.  Lori",
      "MessageIndex": 231,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 16, 2009 09:29PM Lories wrote: Hi Soprano, I too wondered why I was in there longer some days.  They told me I get x-rays after every 5th treatment and then see the doc once a week. The x-rays are all in the same machine.  I hope she can chat with the doc about it so she can feel better. Welcome DebiSongbird.  The simuation is the hardest, you have to lay in one spot while they complete all their calculations.  Hope it goes well.  Kari is correct, Aromasin and Femara are both for post menopausel women.  My sister is taking Aromasin and has not had any side effects, so hopefully it will be good for you.  Lori",
      "MessageIndex": 254,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 19, 2009 09:49AM - edited Feb 19, 2009 09:55AM by Lories Hi cupcake, the rads train always has room, welcome.  Rainy - you are very welcome here, but may want to check some other threads to see if you can find answers to your questions on the different rads. Hi to riverinrabbit, hope you enjoy being on board for your next journey.  According to my rads techs, these treatments can ease a lot of pain for you, I hope it does. Souad - Obama, sweet - hope you got involved in the excitement.  How cool is that?  I guess Hillary flew threw our aiport the other day, but we don't get much political action up here, unless you count Sarah, but don't make me go there!!!!!! I do have crazy sexy cancer tips, I sort of pick it up and put it down.  I did realize yesteday that I had been taking an antioxident, melatonin, so now will have to fess up to the doc, hope I am not in big trouble.  I figure I took 9 pills, some before, some during.  doubt it made a difference, but a little worried. I am only going to work half a day today.Yesterday I was just a mess and it seemed to happen about an hour after rads, so heading home to bed today to rest.  I went to bed at 8:30 woke up about 10 and was so uncomfortable and then worrying about that stupid meeting I had yesterday, it is just not worth it to go to work.  I don't think I will quite phrase it that way for my boss.  :)))) Have a good day, and yes Denni, the weekend is almost here.  Yeahhhhh cheers, Lori",
      "MessageIndex": 296,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 19, 2009 04:46PM Lories wrote: Hi number lady - I finish just 2 days before you. I put on Jeans radiation cream immediately after and then gold bond aloe vera a few hours later and then at bedtime.  I have not really had any itching at all.  Are you using any creams?",
      "MessageIndex": 309,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 19, 2009 08:21PM - edited Feb 19, 2009 08:22PM by Lories Annie - I was feeling really down, no energy and depressed and you know what I did???? i took a nap and just laid in bed all afternoon.  It was great.  I am now sitting here with my laptop, all charged up writing funny emails to my buddy Britt the warrier princess.  So take a load off, relax.  Send in to netflix for a funny movie, or its must see tv tonight, Grey's Anatomy.  cheers.  Lori",
      "MessageIndex": 319,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 341,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 21, 2009 02:48PM Lories wrote: Souad, I have not really gotten into the diet things yet.  I really hate reading non-fiction books- so I have been flipping through some of the pages until the recipe book arrives. But, my husband gave me a box of Godiva chocolates (dang him) for Valentine's day. So I have that hidden from my teen daughter and have been having those.  The finely sliced brussels sprouts sounds yummy.:)",
      "MessageIndex": 350,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 23, 2009 12:59PM Lories wrote: Cathie, I sent you a PM describing the simulation.  Hope it helps.  Lori",
      "MessageIndex": 381,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 24, 2009 08:57AM Lories wrote: Hey Annie, happy birthday - I hope you have a wonderful day!  Lori",
      "MessageIndex": 393,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 24, 2009 09:28PM Lories wrote: Hi pottergal, a book I read said that the 2nd or 3rd week is the charm for feeling tired, so I think you are there. As far as dinner for friends - I have two words for you - Take Out.  Don't stress yourself gal, take it easy.  Call up the colonel for a bucket.  :))) we have a thing here called Super Suppers.  My knitting buddies gifted me with a weeks worth of meals after my surgery, it sure was wonderful. I too am totally tired, and I walked a marathon a year or two ago and I am (only) 52 - but now I slide into work at 7:30ish, then go until 10:30, go to rads then come home and lay in bed and sometimes nap all afternoon.  Around 4 I usually feel better.  Even though tomorrow is my last day, i am going to not rush getting myself back in the groove.  I think now is when we are at our most vulnerable, lots of good and bad cells radiated and only rest will help the good ones recover.  Tomorrow is my LAST RADS!!! whoo hooo.  I am not sure if there will be confetti coming out of the ET machine or not, but it will be in my mind.  have a great night.  Lori",
      "MessageIndex": 404,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 25, 2009 07:35PM Lories wrote: Hi all, I am very glad to be done. Today after the session I had to go for a photo shoot - the nurse took digital photos of my reddish breast and told me that when i come back in 2 weeks it will likely be redder.  She also went through all kinds of other info, like I could have more trots, so take immodium.  If I have skin issues to call and I should have no pain.  They also said that tiredness issues should go away in 4 weeks - yes you read that right - 4 WEEKS.  youza.....",
      "MessageIndex": 416,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 1, 2009 12:45PM - edited Mar 1, 2009 12:47PM by Lories Hi Diane - good luck on your rads - you maybe want to join the March rads thread too (I see there is one)- it helps to find others going through the same thing at the same time.  This thread will be a good one to review our experiences, but most folks are just finishing up.  cheers,  Lori",
      "MessageIndex": 464,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 1, 2009 12:46PM Lories wrote: Souad - congrats sister to being done!! Great idea on the chocolates.  I am going to take a treat when I go back on the 11th for my comparison look - they are expecting me to get redder.  Lori",
      "MessageIndex": 466,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 20, 2009 01:37PM Lories wrote: Hi Mary, there are several Femara threads running that you can check out.  Get some glucosamine. Yesterday's pain puts things into perspective for me.  I would rate the pain as an 8 or 9 on the scale, it was terrible.  Today things have evened out and having the various aches and pains on my hips, my knees, my feet and my hand is much more tolerable than the full blown debilitating pain from yesterday.  Femara does say arthritis is a side effect, but this medication is supposed to be really really effective at killing all those extra cancer cells that may be floating around.  I am going to tough it out as long as I can.  I figure if I have many pain days of 9 in a row, then that is when I should be asking my oncologist for something else because I will likely be going insane.",
      "MessageIndex": 633,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Apr 3, 2009 12:20PM Lories wrote: Hi Jane, I originally asked the rads onc about skin cancer since my brother had melanoma and I have my moles checked every year.  He said that the rads would not affect the skin that way.  Lori",
      "MessageIndex": 736,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 1, 2009 07:03PM Lories wrote: Hi souad - greetings.  do you know how many treatments you are having? Short since you are fron Ontario? or longer since you had Chemo?  I start the same day.  Love your pic.  Lori (born in Windsor)",
      "MessageIndex": 9,
      "PostDate": "01/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 2, 2009 10:48PM Lories wrote: Hi Sue-Ann Did you see the NYTimes article that talked about the study?  It was a little more informative.  It is here http://www.nytimes.com/2008/09/23/health/research/23canc.html?_r=2&ref=science The article also talked about the face down method and i did ask my rads. oncologist about it.  He said that when he was at a previous hospital (it was some big name, but do not remember it) that they ordered the machine to do the rads that way, but hardly used it.  He said it was very useful for women with very large breasts where the breast could hang down. But,he said it was also difficult because the other breast has to be pushed down out of the way and can be uncomfortable. That is odd that your breast is under your armpit, but if it is your left side (where heart is) maybe they are trying to expose an area.  They do a lot of measurements to try and hit the correct area.  Make sure you ask about that, and ask again why you are having the longer treatment.  I was told that if my margins were close then i would not be eligible, but I see now that your tumor was larger, so that may be the reason. I hope that helps.  Let me know when you start and welcome to the Feb rads thread.  Lori",
      "MessageIndex": 25,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 3, 2009 09:02PM Lories wrote: Hi souad - I cannot tell you what your oncotype score is, it is a test done on your tissue. Hi mary - I am glad to hear it went smoothly and fast.  I got bumped up to tomorrow morning.  I will be glad to have the first one under my belt.   thanks for the chemo info.  I am allergic to a lot of stuff, I could see me breaking out in hives all over.  I will know more tomorrow.  Hey bradswife and jerseymaria, how are you two doing?  everything go smoothly, were there switches in the tracks or was it a smooth ride?  cheers.  Lori",
      "MessageIndex": 33,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 4, 2009 01:14AM Lories wrote: Hi jane, the test is relatively new.  Your oncologist (or BS) needs to order it for you.  I am terrible at details, but it tests 21 markers and gives you a recurrence score.  It is usually routinely ordered for node negative, ER+/PR+ women.",
      "MessageIndex": 36,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 6, 2009 01:20AM Lories wrote: Hey jobu, welcome to our rads train.  Sounds like you have been through a lot.  I noticed the simulation did take awhile and both my arms were aching too. The actual rads go really quickly, when the machine is working. I had a 6pm appointment and they forgot to tell me that the elevator got turned off at 5.  So there we are, my husband and my son came with and we got stuck in the elevator.  Nothing would open it up - I was concerned because i did not want to be late, then here I was stuck on the elevator.  My son who is 15 and 6'3 started getting kind of claustrophobic, so we just kept talking about anything to distract him.  The whole thing was actually fine and my son got over it really quickly.  Nothing like keeping the family entertained. Mandy, they probably had to restaff the rads section to find you female techs!!!  Glad they can make you comfortable.  :)",
      "MessageIndex": 69,
      "PostDate": "06/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 8, 2009 11:11AM Lories wrote: Souad - thanks so much for the book names.  I check out barnes and noble and borders and neither were available locally so I too ordered from amazon. Man what did we do before the internet. I just finished reading Lance Armstrong's book, Its not about the Bike.  Man, that guy had cancer everywhere and went on to win the Tour de France multiple times, so there is hope, just in surviving even. Talk2Me, that is great that you can get out on your horse, you have combined therapy, exercise plus being with an animal, which is proven to be soothing.  I know both my cats like to hang with me now, they just know, so does my sweet dog. Alright, so today I am going to the gym. Has anyone had any chest pain?  I am just feeling a little achy, perhaps its just cancer creepies (thinking there is something wrong when there is not).  cheers ready for a smooth coasting soothing ride today with our little weekend holiday. ",
      "MessageIndex": 97,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 12, 2009 11:01PM - edited Feb 13, 2009 09:24AM by Lories Hi Annie, I got a rads shirt on ebay - type in Radiation camisole and it will come up.  I am 5'6 and ordered a large, but it is kind of short in the body, so wish I had gotten an XL - it has pockets at the breast area and is really super soft and under $10.  My only complaint is that it really reeked of smoke.  I asked the seller and she said she heats with a stove, so that explains it.  Once I washed it was fine, I am going to re-sew the straps to make it longer. Lori",
      "MessageIndex": 175,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 13, 2009 04:11PM Lories wrote: Hey Mandy, mmmm lemon tea bread - how sweet - good for you!  and now with 5 down, well done. They will likely have you chat with him next week, I see my rads onc on Monday.  I thought by the time you hit rads chemo was done....you should be close to be done. I thought the woman ahead of me had her last one today, but today she said they just told her she has another week.  I felt bad for her, but she was happy, gotta keep a good attitude like that. Have a great weekend - we have 2 days of rest, and I have Monday off.  yeahhhh",
      "MessageIndex": 181,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 16, 2009 10:48PM Lories wrote: Debi - there is also some new research that with some women the tamoxifen does not work, their bodies cannot break it down properly.  Again, I am not good with all the info, but there was a discussion on one of the threads following an article.  http://www.nytimes.com/2008/12/30/business/30gene.html?_r=4&pagewanted=1&%2359;adxnnlx=1230620505-qRUDZxD1Oss%20lOxUBb1vkA&%2359&%2359;adxnnl=1&%2359;pagewanted=al I also have read that the A1's are pretty new so that is why the switch, plus some women with the BRCA1/2 gene have had their ovaries removed and that prompted the switch.  again, I am generalizing here, big time. My sister is 67 and just calls it her cancer pill and has not had any problems. She lives in Canada.  My doc said he was chosing Femera for me.  Me, I am not in a rush to start.......",
      "MessageIndex": 256,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 17, 2009 09:36PM Lories wrote: Hi Debi, sorry it was a rough day.  I am not sure where your incision is or where your cancer was, but they are not near my throat, so hopefully you will be okay. I would ask if they could see you at another time, that sure sounds like a good solution.  I do not think they rushed through things, some folks just take longer and some cases are more complicated.  I was about the same time as you and I considered it lucky they got done with me early so I did not have to have my arms up for as long.  They usually take some time afterwards to review and calculate things (when we are not there) prior to the actual start. I hope it gets better for you - attitude is a big part of dealing with this disease.  Every once in awhile it gets to me too and then it just seems like everything is so much harder.  I hope you have a good support group around you.  I realize it is hard not being with your sister, but she is probably worried about you. Sending you my best.  Lori",
      "MessageIndex": 265,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 19, 2009 08:01PM - edited Feb 19, 2009 08:02PM by Lories Hi Katie, bonjour and welcome (didn't remember welcome from francais class, or the flight of the Conchords song, maybe Souad can help - she sees french all the time) .  There are a lot of us on board.  Make sure you stop at Ace hardware for some udderly smooth cream. Mary, I think the way I have felt the last couple of days I would be a total chemo wuss.  Man I feel like &H#$ - sorry hate to swear on here.  but gosh, wiped out, fevery (that is hot with no big fever) sore, swollen, wah wah wah wah - yes please send the waiter over with some cheese to go with my whine.  I think maybe because my doses are higher, or I am trying to do too much.  So I am cutting stress out as much as possible, now can someone please tell my kids that for me? ",
      "MessageIndex": 316,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 19, 2009 10:38PM - edited Feb 19, 2009 10:54PM by Lories Prayers also to JerseyMaria, if you are reading this I am praying for you sweetie. There is another thread for her, under Prayers - JerseyMaria is on our rads train.  I wish I lived closer and could help somehow, we are here if you want to vent, or chat or anything.  thinking of you!!! Lori Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2-",
      "MessageIndex": 321,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 23, 2009 09:04AM - edited Feb 23, 2009 09:06AM by Lories souad and seabee - I was trying to find your discussion (but could not), there is another bone strenghtening drug that has been effective with mets in European studies, Zometa.  You may want to look under hormones category, there are a couple of threads there on this.  My oncologist is planning to put me on this drug along with Femara (which is an AI - for us old folks post menopause :) ). ",
      "MessageIndex": 375,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 527,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 22, 2009 06:53PM Lories wrote: The rads onc wants to see your skin 2 weeks later to make sure you are healing all right. My rads onc also told me they would be working with my surgeon for the next year or so.  They booked me a mammogram in June (6 months after my last one in Dec.). I think there are sometimes changes in the breast tissue that both the surgeon and the rads onc want to see to examine.  My onc is on sort of a separate schedule.",
      "MessageIndex": 653,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 26, 2009 09:18AM Lories wrote: Hi all, it is exciting that most of you are finishing up rads. Congrats.  I am a month out now. I was go go going yesterday then crashed which just shows me I need to give it time. On another front, today I woke up with an odd lump between my breasts.  It is about 2\" long and noticeable, but I really had never noticed it before.  I am not sure which doc to call but I think I will start with my rads onc. He has the most photos and most recent data - please let it just be paranoia......or odd swelling.....",
      "MessageIndex": 680,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 2, 2009 11:25AM Lories wrote: Hi maria, good info.  I was going to get some camis with shelf bras but will hold off.  Hmm, that is kind of a bummer not wearing a bra, only because my incision area still feels tender without one - but I guess the tradeoff is better. I did order and get some Jean's radiation cream, it is not sticky and the nurse said it was good to use.  thinking of you.  L",
      "MessageIndex": 20,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 4, 2009 09:09AM Lories wrote: Hi Claudia, welcome.  I hope it is going well.  any side effects anyone?  ter, how are you doing, did you start yet?",
      "MessageIndex": 39,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 5, 2009 12:06AM Lories wrote: Hi saraand and Sue-Ann - welcome aboard bradswife -   I am using Jean's radiation cream, it is mostly aloe vera but feels very soothing. I put it on right after and at bedtime.  time will tell how it works.",
      "MessageIndex": 51,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 5, 2009 07:22PM - edited Feb 5, 2009 07:24PM by Lories Hi all, wow 16 of us (plus Unique - I left you off per request) on our rads board.  Welcome all. I am set for #2 today.  The only time they had was 6 pm - kind of late, they were so apologetic, but they have to be there too.  I have noticed so far that my breast feels hot today, and a little pink, but I have only had one test. You know I appreciate Sue-Anne's take on the photos, and do not mind at all. Whatever they need to do to get the job done right and radiate the correct area works for me. Mary, thanks - I feel a little better today about my onocologist visit.  I was sort of psyching myself up to do chemo and he was working really hard to convince me he is going to cure me, and not to do chemo.  There just does not seem to be any easy answers in this cancer game.  I am just glad that everyone I have been meeting is so sweet and kind.  I am thankful for that. On one of the other threads people were counting their blessings when they were doing rads. There is also a thread about creams to use.  I am using Jeans Radiation cream, I had to order it in from MA, it seems soothing.  Mary I will be so interested to hear about how you feel about femara.  There is a whole thread on that too.  A lot of people take it in the evening.  My sister takes the one that starts with a  - I forget the name, and she has not had any side effects, but my onc. thinks femara is the best. Pottergirl, love your attitude.  Glad to meet you.  cheers all, laying down with my laptop until I have to head out for rads.  L",
      "MessageIndex": 66,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 6, 2009 08:20PM Lories wrote: Hi Mary, I know what you mean about that femara thread.  Yikes. every side effect you can imagine.  But what I did do was go and copy all the vitamins and stuff that one of the members was posting, and she said she is not having any troubles.  I wrote it down, if you are interested let me know and I will PM the list to you. I showed the list to my oncologist and he was cool with everything on it.  He even told me about a place that has other naturopahty stuff here in town I could check out.  I asked them yesterday what my daily zap was and they told me, if anyone wants to compare. This morning I hit the wall.  I literally was so tired and exhausted.  I guess it does not help I am back at work full time now either, but I was just spent, and even used the valet parking at the cancer center (it is free and sometimes the guys sing even).  I went to rads and then had a whole bunch of vegetables at lunch and that really helped perk me up.  Congrats ladies, we have the weekend to recover.  Three down for me!!! cheers!!!  Lori",
      "MessageIndex": 72,
      "PostDate": "06/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 8, 2009 07:26PM Lories wrote: Hi Sob, I think Laura has a great idea, can you take a laptop, or maybe your library would be a place to keep in touch.  Write when you can, we will be thinking of you!",
      "MessageIndex": 105,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 11, 2009 09:06AM - edited Feb 11, 2009 09:07AM by Lories Hi Mimi, glad to have you on board.  Annie and Debbie, have a good day, since its number 1 for you both! Well its hump day and the bar car is mixing up those pink drinks.  the week is half done - yeahhhh.......",
      "MessageIndex": 143,
      "PostDate": "11/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 11, 2009 11:35PM Lories wrote: Hi Mamie, chocolate chip - I made a double batch. I figure for valentines day -  I need a bunch of bags, I notice the techs do not really talk to the nurses much, then there are the front people and my neighbors who made me a superbowl dish.  that should take care of a few. Hi bradswife, I hope your arm is ok.  I am glad you reported it so they can keep an eye on it. ",
      "MessageIndex": 152,
      "PostDate": "11/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 12, 2009 12:31PM Lories wrote: Hey Annie, it may just take them awhile to figure everything out right.  One of the techs always marks my dots just so he can find them easily, the others do not.  the first day they gave me alcohol swabs to get the stuff off - so it may not happen every day.  that is nice you have buddies to call, definately go out!  I think the only thing you can't do is hot tubs and saunas right now......:)",
      "MessageIndex": 167,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 12, 2009 09:15PM Lories wrote: Hi ineedchocolate - welcome to the board.  I should tell you my license plate is CHOCL8 - I have had people put chocolate bars on my windshield....",
      "MessageIndex": 171,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 15, 2009 02:36PM Lories wrote: Hi Kari, welcome - glad you finally joined in. what do you mean by your trial was unblinded?  Does that mean they told you what you are on?  what kind of trial is it?  I have been considering a trial, but think I will go with the regular drug so I am sure I am getting it. A few folks have had some rough simulations, but hopefully the real treatment will be much gentler than you imagined. I was really nervous the first day, but that was a waste of energy. The dining car is mixing up a batch of cosmos for this week and fresh yellow roses for all the cars.  Lori",
      "MessageIndex": 215,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 217,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 16, 2009 09:53AM - edited Feb 16, 2009 09:56AM by Lories Hi souad - well your pleasant post came at a good time and cheered me up somewhat.    I woke up this morning in a terrible funk full of questions to myself -  guess I need to find a thread of what if's.I am questioning everything in this fight for cancer.  I do have crazy sexy cancer, will go look at that again. Hi gibby, welcome aboard the rads train where we are chugging along with treatments. Lori",
      "MessageIndex": 236,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 248,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 279,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 19, 2009 03:31PM - edited Feb 19, 2009 03:35PM by Lories Hi all, normally the fatique was hitting about an hour after rads, but today I got hit with major fatique this morning before even going in to rads.  It is accompanied by light headedness, paleness, and feeling like I am going to pass out.  Lovely in a meeting with a department director.  Based on how totally lousy I felt last night, I have decided to only work mornings this week and next.  I only have 4 more treatments left, but due to the reduced # of times I am going I am receiving larger doses of radiation every day. (but less overall if that makes sense) A friend at work gave me some advice today, if you are starting to feel the least bit bad to go and rest - so I am going to do that.  I have also had a slightly metallic taste in my mouth.  Cupcake, it is my understanding that they only offer shortened version of rads to smaller cancers/no nodes, so that may be why they told you no on the shortened version.    Have a good day all, I am headed over to the dining car for a double cosmo!!!! Lori",
      "MessageIndex": 306,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 19, 2009 07:45PM Lories wrote: I looked up the \"udder/utter\"cream online, since we do not have a lot of those stores (no CVS) here in Alaska, and they advertised Ace hardware.  Hmmm, that sounds kind of odd - Hey honey, i am heading down to Ace hardware to stock up on some breast cream and nails.  It is unlikely I will find any here in Anchorage, since we do not have any cows, maybe our buddy Sarah Palin has some out in the valley, ha ha ha (they have cows there)",
      "MessageIndex": 313,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 20, 2009 12:33AM - edited Feb 20, 2009 12:34AM by Lories Hi Denise, the huge, gigantic total drain of energy, enough to make me go Stop, slow down, began on day 12.  (I had a mild episode on day 6 or so to give me a taste of it) But remember, I am getting bigger doses and 16 total treatments, so you are probably good for awhile. I would think by week 3 it may hit you, I have heard others comment on that.  Can you plan to get time off work? From what other posts have mentioned the radiation seems to keep working in our bodies a week or so after our last radiation, so that is why I am planning ahead and keeping my afternoons open for next week and probably the week after.  I usually work 7-5 but have gone in late (7:30-8) and left early (3:30-4:30) since surgery and doing rads.  But today and tomorrow I work 7:30-10:30 then calling it quits for the day. ",
      "MessageIndex": 324,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 24, 2009 08:15AM Lories wrote: Hi Jeanne, the docs keep a close eye on things and I have heard of patients getting a few days off due to very sensitive skin, but it is natural to get red, and I think stopping for breaks does not usully happen.  Remember to have your cream ready to apply after your rads (I put some on at bedtime too) and if you take care of yourself you should be fine. I have 2 more treatments left, I am slightly reddish and the doc says I look normal for this time.  I also take an over the counter advil or aleve if swelling gets to be an issue, under my arm has been a bit sore and swollen - the doc suggested that too. Good luck today, it sounds like you have a good attitude about it.  Lori",
      "MessageIndex": 391,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 25, 2009 09:23PM Lories wrote: Hey thanks so much all of you.  It goes fast once it starts going. Pascal, I am going to be in Chicago in September!  sweet! As far as sciatica goes, I have had back problems for years (ruptured disc at one point) don't let it linger, since the hormones will cause joint pain, so get fixed up in preparation.  For example, I ran out of my pill I take every day, Relafen - so I am not ashamed to say i pulled the cancer card - I called up the doc's nurse and left a message, Hi, I know I am due in to renew my scrip, but I was diagnosed with Bc and have really seen enough docs to last a lifetime. Can you please help? She left me two messages back, one that she would explain to the doc about my condition, and the next, she called the pharmacy with my scrip.  double sweet.  People can be so nice...... So, don't wait, ask.  L  :)",
      "MessageIndex": 423,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 2, 2009 09:13PM Lories wrote: Hi Laura I have had some pains due to swelling and an occasional shooting pain - I am attributing it mostly due to swelling since that does occur with rads.  I have been taking Advil when I can feel the swelling coming in.  I would think that everyone reacts with different pains due to the swelling and rads. My rads onc had the same reaction. I finished last week, and am still healing and pinkish, still having swelling, I hear it can be up to a month to recover.  My handout they gave me at completion did note that some patients experience pain or discomfort.  I hope the rest of the treatment goes smoothly for you - I hear this is the easiest.  :)  Lori ",
      "MessageIndex": 482,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 496,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 5, 2009 12:34AM Lories wrote: Hi Denise, I went round and round trying on different camis, tanks and bras (that I had and in stores) to find a top that would not be too tight (on my pink skin) and that did not rub on my SNB scar. (Scar is in a spot that rubs) I found a couple that work and even a week after rads is done I am still wearing just a tank top with layers, so I don't look too floppy.  I am also keeping up on taking advil to keep the swelling down.  I worked out the other day and wore my pre-cancer sports bra - it kind of bugged me after a half hour, which just convinces me to not push it and just be gentle to myself.  I think trial and error, lots of aloe vera or your creams and try not to wear anything that rubs the rug burn.  I share your ouchiness. :)  Lori",
      "MessageIndex": 511,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 651,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 31, 2009 08:38PM Lories wrote: Hi bradswife - I am glad to have some company.  I knew someone would show up soon.  I also got some Tom's deodorant and some corn starch, not sure I can go all day without some form of deodorant, I have terrible hot flashes already.  I also got some dove unscented shower gel - and some Jean's radiation cream that I read about on here.  I have some of the walmart bras that I bought extra big so they don't rub, but may just go with the undershirt. I am making a little 'post it' countdown calendar so I can rip off after each treatment.  Do you know yet how long each of your sessions will be?  I forgot to ask.",
      "MessageIndex": 3,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 2, 2009 09:02AM Lories wrote: Hi mary, please let us know how it goes today. You and bradswife are the first to begin. Can I ask where you are located?  I am just curious due to your shortened rads.  Wal-mart has a wireless 'workout' type bra for $7.  It fastens in the front (but I hear they shrink when you wash them).  I bought a few much larger than I need on account of swelling and where my SNB scar is - everything rubbed.  I am also going to look for some tanks with shelf bras.",
      "MessageIndex": 14,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 3, 2009 09:11AM - edited Feb 3, 2009 09:22AM by Lories SOUAD!!!!!!- 4 inches.  criminy!!!  That is a whopper and I am sorry to say you probably do win the booby prize. 4\" in one year - your doctors must be just amazed (for lack of a better word).  Also, I do share your black humour, I think it is a Canadian thing. Ever since I got up I can't stop thinking about that 4\".  I am so glad you are on board our rads train, you inspire me.  Thank you for sharing.  Ok, I have to ask, did they ever do your Oncotype score?  I just got mine and unlike you I am in the middle of the road slot where you have to figure it out for yourself. cheers honey!!!  and good luck to you too tomorrow.  Lori",
      "MessageIndex": 28,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 7, 2009 12:02AM Lories wrote: Hi Alicia, welcome.  We are all just starting so looking for hints and sharing how its going.....",
      "MessageIndex": 74,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 7, 2009 03:03PM Lories wrote: Hi Denni, hey jet lag is very similar.  That is how I felt yesterday after only 3 - that is the best description I have heard.  I am going to start walking too, maybe tomorrow, yawn....:))))",
      "MessageIndex": 91,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 7, 2009 08:15PM Lories wrote: Hi souad - thanks so much for the book names, I went to a bookstore today, but it was a used bookstore and they did not have too much.  I will take a look on amazon.com I used to drink a lot of red wine, but get headaches from it now.  So I wonder if martinis are in the book....hmmmm I think the Rads Train should be serving up a big blender or two of margaritas right about now......:)",
      "MessageIndex": 95,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 8, 2009 09:52PM - edited Feb 8, 2009 09:53PM by Lories Mandy and Ter - I will be thinking of you both tomorrow, the train will be waiting for you, don't forget to tell us how it goes...... sweet dreams all, I think I am the furthest west, just making dinner.  cheers!",
      "MessageIndex": 110,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 8, 2009 11:55PM - edited Feb 8, 2009 11:59PM by Lories Hi Izzy and welcome, we love rambling, or at least I do.  Great suggestions on the MP3 player.  I am always too busy chatting with everyone that I am not coordinated enough to pull that one off. I like the Advil hints too and the gold bond lotion.  That was suggested for my son for stretch marks, he grew so fast. Mandy, I sent you a PM - Courage My Love - you will do great. Our rads train is chugging away and before you know it our rads journey will be done.  We have quite the party trail of riders - so all aboard for another week - this week the dining car is serving cosmos- pink for Valentine's Day!!!  Or for you non-imaginary drinkers, strawberry Quick (anyone remember that??) ok I am really dating myself now.  the conductor is telling me to shut up and get on board.....",
      "MessageIndex": 113,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 10, 2009 12:32PM Lories wrote: Hi Carolyn and Gayleeeeeeeeee - hey welcome aboard.  Rads is so much easier than the other stuff. Gaylee - the doc will make sure your scar looks good before you start.  I did not put a start date on since you may begin a few days after your simulation. Hi Soprano - tell your mom to keep a full glass of water, and carry a water bottle around.  It is healthy to be hydrated anyways, no one has told me a number, but water is also really good for filling you up if you are trying to lose weight!",
      "MessageIndex": 134,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 10, 2009 08:31PM Lories wrote: Hi Pam, I read somewhere that skin type does not matter, but who knows. I tend to burn then tan, but right now with 5 down, my nipple hurts!!  Dang thing rubs of course, and just hurts.  It is a relief to add aloe after work and just change clothes - even though I am just wearing camis. Annie, glad you have some good entertainment. Hope all are doing well.  I get x-rays tomorrow, every 5 days I guess.  Lori",
      "MessageIndex": 137,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 12, 2009 12:17AM - edited Feb 12, 2009 12:18AM by Lories Hey Annie, not sure what the circles are, except maybe your rads place uses the circles instead of tattoos.  I have 3 teeny tiny pinhead sized dots on me, where they line the lights up so they know they have me in the right place.   You should ask them what the marks are, I asked today about the x-rays and got a very long explanation - they were happy to share (those techs are major geeks, but that's ok, they are totally into it). You can put the Tom's on in the morning, but no creams until after.  I know with my setup I am laying in a special mold, from where my head and arms go, they do put a pillow under my knees to help on backaches, do they do that for you - that should help.   I am not doing any lymphedema PT. I am going to be starting Femara - that is an Aromatose Inhibitor (spelling?) same as the Arimidex - that is for women who are post menopausal - I am hoping they let me start after rads are done, one thing at a time is enough for me, thank you very much.  Tamoxifen is for pre-menopausal women.",
      "MessageIndex": 158,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 186,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 14, 2009 12:51AM Lories wrote: Hi Annie, I know what you mean about it being kind of spooky.  I can almost feel the rays, sounds wierd I know. I have three dots as well, one middle of my chest, and one on either side.  I just finished my first full week, feel kind of tired and a little down, but glad I have this week under my belt.  Lori",
      "MessageIndex": 189,
      "PostDate": "14/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 14, 2009 10:13PM - edited Feb 14, 2009 10:18PM by Lories Hey Mamie, sounds like you need a bra expert.  I went in to Nordstrom before my surgery and there was a lovely woman there who is a breast cancer survivor and she told me to come in after if I needed help, she told me they have 'shells' to balance you out and know bras to get. Up here in Alaska we do not have a lot of sources,  I think Penney's have special bras too.  I have this book called Crazy, Sexy Cancer and the website they recommend does not work.  sorry. :)  Lori",
      "MessageIndex": 204,
      "PostDate": "14/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 14, 2009 11:50PM Lories wrote: Hi See, I know what you mean about them drawing all over, but they were really into their calculations so it was obviously need to work things out.  i don't really care. I too had a chest x-ray prior to surgery and then had a dexa scan (bone scan) last week.  It is my understanding that they do the bone scan to get a baseline of how your bones look because the drugs we take later, for 5 years, can decrease bone density.  That is my non-medical take on things.  I am about the same situation as you size wise etc.  I am not doing chemo either.  welcome.  Lori",
      "MessageIndex": 206,
      "PostDate": "14/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 15, 2009 12:11PM - edited Feb 15, 2009 12:13PM by Lories Hi Joy, I bet it is warmer there than in Anchorage, but we are having a chinook, it has been windy all night and about 40.  H Street in Anchorage is downtown.  Denise, we have similar stuff, my husband meets me there every day and has ice water, graham crachers and works on the crossword puzzle they have set up at the cancer center.  Welcome to everyone, the train is chugging along, no one getting out yet, except probably Cloud will be our first passenger leaving.  I had to reorganize the boarding list, it was getting longer than the postings..... have a great day off everyone, looks like osme of you have tomorrow off, I don't.  Lori",
      "MessageIndex": 213,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 16, 2009 04:21PM Lories wrote: Hi Caren, I think you are having the normal cancer patient reaction.  I find myself checking every little thing on me, then I realize, oh the pain is in the wrong arm.  I even dream that I have swollen fingers.  I think it is totally natural, of course someone else may be able to provide lots of psychological stuff with this, but I think you are normal. today I asked the rads doc and nurse about my swollen armpit.  I just noticed yesterday it is swollen.  They told me swelling was normal and to expect it.  I took some advil for it.  I would defiantly mention it on Friday, but it could be something similar.  rest easy I empathize for sure, not sure if that means you are not crazy, or maybe we all are.......:)",
      "MessageIndex": 243,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 16, 2009 04:22PM Lories wrote: Soprano - what was your mom's negative experience? ",
      "MessageIndex": 244,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 18, 2009 08:31AM - edited Feb 18, 2009 08:31AM by Lories Denise - I am sorry the one tech was stand-offish, that is uncomfortable, I agree. I have a theory, but let me say that in no way am I trying to give them a pass for odd behavior because this is a scary thing, weird rays bouncing onto our bare skin.  But that is kind of part of my theory, I read somewhere (ok airhead that I am, do not remember where) but some folks are very very cautious of recently radiated skin.  So this tech maybe had that phobia about you, fresh out of the rays so to speak.  I have heard that many do not want to offer massages to folks who have just had radiation, because there is a danger of them picking up radiation.  Just a thought I would pass along. Maybe this tech was a little rade-phobe (instead of germ phobe) None of the techs touch me, they are very nice and chat about weekend plans, etc.  but none of them touch any part of me.  In fact, they have me lay on a sheet to move me around easily (thought that was pretty standard).  Also, both the doc and the nurse do not wear protective gloves when I go in for my once a week look see with them, and they make a point of washing their hands very well immediately.  So I think there may be something to my theory of radiation picking up from us. Just a thought to try and make you feel better. I hope it helped........Lori",
      "MessageIndex": 270,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 310,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 21, 2009 02:00PM Lories wrote: Mary- AI's are Aramatose Inhibitors - it is the 5 year pill that is given to estrogen and progesterone positive women after chemo and or radiation.  It has been found better for post menopausal women than Tamoxifen.  Has your oncologist talked with you about this yet?  I see you are ER and PR positive. Diane- deodorants with aluminum are a problem during radiation. Tom's deoderant or cornstarch (I even found baby powder made of corn starch) are the only things to be used.  Lori",
      "MessageIndex": 347,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 372,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 403,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Feb 27, 2009 10:51AM Lories wrote: Hey Denni, congrats for finishing.  Have a wonderful, restful weekend everyone.  Lori",
      "MessageIndex": 442,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 465,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 558,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Greetings and welcome! I would love to have some February Rads buddies.  I start February 4 and have a shortened treatment plan - so most of you will outrun me, but I would love to get to know a few others going through the same dang thing. I had my simulation today, and got 3 small dots. The whole thing was quite quick, even though both arms were really stiff afterward. I was really hoping to get my time slot identified and my schedule figured out so that the rest of life could go on, but whatever. Anyways, anyone else riding this February Radiation Train??? Roll Call so far (I feel like Murray from the Conchords.....) by start date Passenger    Start       # of Tx Denni            1/14          33    done          Caren            1/26          35 AlwaysRed    1/28          28                     Donna           1/30          33 bradswife      2/2           33                      qqclaudia       2/2          33 Saraand45     2/2           35                      jerseymaria   2/2           20  mary              2/3           20                      Lories            2/4           16 done souad            2/4            18                      Ladyleen       2/4           26 momtob         2/4            30                      Izzy               2/4           33 pottergal        2/5           28                      Cupcake        2/5           30 Sue-Ann         2/5           34 Talk2me        2/6            30                      mandy            2/9           28                 rzxcd             2/9            33                      ter417             2/9           33   PamB            2/10          33                      Joy                 2/10          16 Annie            2/11           33                      I need choc    2/11          33 Debra            2/11          36                      Onehalf          2/12          30 jobu               2/12          33                      Mimi              2/16  Alicia             2/16                                   Carolyn          2/16          33 Seabee          2/16          30                     CalifCloud      2/16           5 Sittintrot         2/17                                   Kari                2/17          25 PascalRose    2/17          30                    Heather            2/18          25  Mary L           2/18          21                     Keryl                2/18         30 DebiSong       2/18         33                     Diane                2/19          Lindy             2/23           ?                      Laura               2/23         28     Jane              2/23          33                     Ingrid                2/23         30 Jeanne           2/25         30                     Riverinrabbit      2/?         15 mfgibby         2/26           35                    Katie                  2/26        30 Gayleee             2/?          25  Rainy             2/?    Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 589,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 16, 2009 09:22AM Lories wrote: Hi all, I wanted to let you know I have not deserted you!  I still read your posts every day.  I have been post rads just over 2 weeks now, and starting my 3rd week of Femera.  We celebrated no rads/spring break last week and went south to Homer, a little fishing town for 2 days.  It was my pre-Zometa infusion celebration, because I was down for the count over the weekend on that stuff.  Luckily these are just every 6 months. I saw my rads onc. on Friday and my tanned skin looks normal, although around my scar (which is on the underside of my breast) is still quite reddish.  The redness is gone from my back. He told me that the clavicle pain was his fault and that can be a side effect.  Mary - I am still having some swelling, but not as much, and I continue to take Advil so that helps relieve the discomfort. I am happy to report that my energy levels feel better, I am still leaving work early when I am tired, but overall feeling so much better.  I even left my breast for a couple of days with no cream, but wound up with a very dry nipple, so will keep up on the moisturizing. Cheers to you all.  It is getting lighter longer here souad, but still pretty cold.  I hope you can get some exercise in. cheers!  Lori",
      "MessageIndex": 600,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 28, 2013 10:55PM Lories wrote: Robin, I am headed to my surgeon tomorrow to have a look see at suspicious breast changes, wishing the best for both of us. Lori",
      "MessageIndex": 7,
      "PostDate": "28/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789766",
      "Title": "Scar tissue look like cancer on ultrasound? michellesharii LMS"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 29, 2013 09:33PM Lories wrote: Robin, it's cold and dark right now. Where is Roy? I will have to look it up. How was your biopsy? I am going in to hopefully have one tomorrow-if that doesn't work I have to have a surgical biopsy. ((Hugs)) 2 u too",
      "MessageIndex": 9,
      "PostDate": "29/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789766",
      "Title": "Scar tissue look like cancer on ultrasound? michellesharii LMS"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 24, 2013 07:16PM Lories wrote: Hi Shelby Hopefully your oncologist put your tissue in for the Oncotype test.  This test gives your cancer a number score that shows the aggressiveness of your cancer and the chances of cancer recurring.  I am sure someone will chime in with more info, my explanation is pretty basic.  That score will give you and the oncologist an idea whether you should have chemo or not.  A score usually over 20+ is a yes to chemo typically, although you have the final say.   The BRCA test will tell if you have the cancer gene.  If you do, and you have a daughter you may want to have her tested, or at least she can be aware that she may be more susceptible to breast cancer.  My mother and my sister both had breast cancer, but I do not have the gene. It could also affect if you decide you may want to have other surgeries. You did not say if they are planning on doing radiation, so that is another issue that could come up.  That involves a whole other doctor.   Tamoxifen or one of the Aramatose Inhibitors are pills that most of us take after treatment (surgery, radiation and chemo are done).  Usually you take these for 5 years.   I would recommend getting Dr. Susan Love's breast book, it will describe all the procedures and will help you get good questions together for your doctors. It is always handy to take someone with you when you go to the docs as well. Remember you have a lot of say in your treatment.  Best of luck.",
      "MessageIndex": 1,
      "PostDate": "24/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/799386",
      "Title": "Help with results shelbyz Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 28, 2009 10:12PM Lories wrote: Hi SisterPeace - I am so glad you got there and got it done with.  Doing it all in one day was quite a lot, but it sounds like everyone was very gentle with you.  I have noticed that for the most part I have gotten very tender care during my diagnosis. I am sorry there was not someone there with you, but I am so glad you should know more as soon as tomorrow. Thinking of you.  Lori",
      "MessageIndex": 2,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/728156",
      "Title": "I'll know tomorrow afternoon SisterPeace Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 6, 2018 07:10PM Lories wrote: I totally agree I like cats. Just had my first MRI today (dense breasts, previous bc) and waiting to hear..... has your biopsy been done yet?",
      "MessageIndex": 26,
      "PostDate": "06/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/861268",
      "Title": "MRI Results: Completely the Last Thing I Expected! ILikeCats ILikeCats"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 30, 2009 02:58PM Lories wrote: Hi SisterPeace, that is such wonderful news.  I am thrilled and so relieved for your outcome.  I also am so happy the doctor was able to get you results before the weekend. congrats.  Lori",
      "MessageIndex": 8,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/728156",
      "Title": "I'll know tomorrow afternoon SisterPeace Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 18, 2009 12:27PM - edited Jan 18, 2009 12:28PM by Lories Hi Agnes - I have not heard of that study, I figured the sooner to get it out and move on with surgery and start treatment the better.  However, I am menopausal, so does not work for me. But whatever makes you happy - to me the waiting and worry would drive me insane.  Lori",
      "MessageIndex": 4,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727505",
      "Title": "Timing your surgery - did your doctors talk to you about that? agnes121 mocame"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 7, 2018 12:44PM Lories wrote: Thanks I Like Cats! fingers crossed. and Irwells50 - I've heard about the false positives. I guess that throws things into biopsies? I totally understand going BMX, every 6 months is too worrisome.",
      "MessageIndex": 29,
      "PostDate": "07/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/861268",
      "Title": "MRI Results: Completely the Last Thing I Expected! ILikeCats ILikeCats"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 7, 2018 12:46PM - edited Jan 7, 2018 12:46PM by Lories",
      "MessageIndex": 30,
      "PostDate": "07/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/861268",
      "Title": "MRI Results: Completely the Last Thing I Expected! ILikeCats ILikeCats"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 18, 2009 02:27PM Lories wrote: Hi all, thanks so much for the responses.  I am feeling much better hearing everyone's stories.  I see the onc this week and will have a research nurse there too, she thinks I may qualify for the TailorX  trial, otherwise my surgeon and radonc. both think it is doubtful I could get an oncotype score.  So it will be interesting to hear from the oncologist himself. Scores of 19 and no chemo are very hopeful.  thanks much.  Lori",
      "MessageIndex": 10,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726981",
      "Title": "Grade change Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 8, 2009 11:48PM Lories wrote: Hi Jule, my rad oncologist said it was unlikely I could get the oncotype test since my tumor was smaller than 1 cm.  I see him again next Wed. and I meet my oncologist on the 22nd.  Kind of bad timing, but I will try and coordinate the whole thing and make it work.  I would really like my oncotype score but not sure it will work for me to get it and have insurance pay.  I also called our cancer center and left a message regarding a potential clinical trial, now that I have all my info they may be able to find something to help me get it.  thanks for the thoughts, I am making lists and taking someone with. L",
      "MessageIndex": 5,
      "PostDate": "08/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726981",
      "Title": "Grade change Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Lories wrote: Hi, my pathology report from surgery upgraded me from Grade 1 to 2 (no nodes affected) - the most I can understand is that this is growing more quickly.  Any other thoughts with regard to treatment changes?  I do not see the oncologist until the 22nd.  Dx 12/19/2008, IDC, <1cm, Stage I, Grade 2, 0/10 nodes, ER+/PR+, HER2- Surgery 1/5/2009 Lumpectomy: Right Radiation Therapy 2/1/2009 Whole-breast: Breast Hormonal Therapy 3/1/2009 Femara (letrozole) Hormonal Therapy 10/15/2011 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726981",
      "Title": "Grade change Lories Lories"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 11, 2009 04:48PM Lories wrote: Hi Nancy - I saw some tubetops online, I even ordered a couple - they have surgical ones. You may want to check them out. google tube tops.  Maybe that will be more comfortable. ",
      "MessageIndex": 3,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727077",
      "Title": "When Can I get My life Back? NancyNJ nobleanna007"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 5, 2009 12:49AM Lories wrote: 52",
      "MessageIndex": 168,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 6, 2009 01:16PM Lories wrote: Hi Biancca - if you find a lump the best thing is to get it checked out.  Make an appointment and don't wonder. BC can hit those of us with relatives that have had it as well as those that have clear relatives.  My mother and sister both had BC.  Call your gynecologist or your doctor, make an appointment, get looked at - they you don't have to worry - breast cancer is treatable, but it may not even be cancer.  Good luck.",
      "MessageIndex": 1,
      "PostDate": "06/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/730229",
      "Title": "Worried Biancca_B cjacks"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 16, 2009 07:43AM Lories wrote: totally missed this announcement earlier today, but that is such wonderful news.  hee haw!!",
      "MessageIndex": 15,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/727412",
      "Title": "PET Results are In! webwriter apple"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 6, 2009 08:29AM Lories wrote: Hey Michelle - ((((((big hug))))) thinking of you.  I think 'harrassing' those you work with is sooo positive.  Praying or good results from your scan.  Lori",
      "MessageIndex": 3,
      "PostDate": "06/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/730241",
      "Title": "Biopsy results should be back tomorrow.. michele54 michele54"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Dec 30, 2008 05:06AM - edited Dec 30, 2008 06:36PM by Lories I got a verbal the next day, the written report took a little longer.  But, when I asked the radiologist who was doing the test if the test would tell what type of cancer it was, if it was cancer, she launched into a really detailed explanation of everything the test would show.  That is when my suspicions were confirmed.",
      "MessageIndex": 6,
      "PostDate": "30/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/726506",
      "Title": "Biopsy mommycjk leaf"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 12, 2009 07:29PM Lories wrote: Hi BTG - I also just had a lumpectomy last Monday, and today got to see the results because i had my drain and bandages removed for the first time.  I am so happy I have gone with a lumpectomy, the scars are not that visible and I will likely be just a little smaller, which is okay by me.  Should the cancer come back, or more come, there is still some of me left to cut off.  I think reconstruction sounds painful and i have heard a few folks that are very unhappy with how they look.  Again, it is your decision, do what feels most comfortable for you.  Best wishes. ",
      "MessageIndex": 17,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727067",
      "Title": "Masectomy vs Lumpectomy Decision BTG koshka1"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Nov 15, 2009 05:45PM - edited Nov 15, 2009 05:45PM by Lories Hi all, I have not been on the boards for some time, trying to get my life back to normal, but I am quickly approaching my one year DX anniversary and my 1 year full mammo and of course feeling a tad apprehensive.  I could not sleep last night so read all your postings on my iphone, but could not write in from there for some reason. I had an 8mm IDC, no nodes oncotype score of 18 but no chemo and one month of rads - the intense shortened version.  I have been on Femara since March and wonder sometimes, are my hips just sore from the pills or is it mets???  I had one Zometa infusion, since they are using that in Austria, but since not approved here looks like I will be footing that bill. I enjoyed reading all about you all.  I too sometimes share your frustration, that my cancer was 'run of the mill' (as someone told me) and very small(others told me) but heck its still cancer!!!! Here is my question - what type of tests are typical at the 1 year anniversary? I am guessing a full mammo (scheduled mine) since at 6 months they only did my affected girl, but what else? I read about MRIs and Pets and bone scans and ......what should I be asking for?  I had a blood test in August for my onc, not sure what that was for, is that the cancer marker test? looking for feedback please. ",
      "MessageIndex": 343,
      "PostDate": "15/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Dec 29, 2008 09:16AM Lories wrote: Hi Sheri, best of luck, mine is scheduled for the 5th.  I too am having difficulty sleeping.  I just had surgery a month ago for a wierd lipoma, that turned out to be nothing, but I was glad to be rid of it.  I was impressed with the hospital and the drugs(too early to spell anesth....) - everyone there was very caring an kind, I went right under and woke up and it was done.  Try not to worry, they do this all the time, and for us it is our first step to getting better.  cheers.  Lori",
      "MessageIndex": 3,
      "PostDate": "29/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726484",
      "Title": "got syrgery date sheri47 bethr"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Nov 5, 2012 04:08PM Lories wrote: best of luck on your surgery today Mafe, and hoping for no node involvement for you.",
      "MessageIndex": 8,
      "PostDate": "05/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/795882",
      "Title": "New and Scared mafe marie5890"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 21, 2009 10:49AM Lories wrote: Hi Denali, so glad to hear surgery went okay and you have some good active supporters with your family.  I think we all need to laugh now and then, that's for sure. One thing my doc's nurse said, the more you rest, the more the flow to the drains is.  My husband made me stay in bed for a few days just to rest and reduce the fluid levels (I hated my drain) and that sure helped me a lot.  So don't push yourself too hard.  Lori",
      "MessageIndex": 6,
      "PostDate": "21/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727662",
      "Title": "3 days after surgery Denali barbe1958"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Jan 30, 2013 08:22AM Lories wrote: Hey jojo thinking of you. I have a biopsy tomorrow, I hope via sonogram/needle. If they have trouble locating it I may have to have a surgical biopsy. Hoping for good news. Hang in there!",
      "MessageIndex": 3,
      "PostDate": "30/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/799643",
      "Title": "The \"Waiting Game\" Begins jojo38 april485"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Nov 15, 2009 10:17PM Lories wrote: Hi thanks Sheila and Francine.  that helps.  I initially had an MRI, and our geneticist recommends it, so will push to keep up with those.  talk to you later.  Lori",
      "MessageIndex": 350,
      "PostDate": "15/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 14, 2009 01:33PM Lories wrote: Hi, I had my first infusion on Thursday and although my onc had said he was going to have it go in over a half hour the nurses insisted on half that time.  I will make sure it is toned down next time, I have been wiped out pretty bad, aches and just wanting to sleep. I will also plan to drink more water next time.",
      "MessageIndex": 15,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730656",
      "Title": "What´s the scoop on Zometa? pitanga HeleneS"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Dec 29, 2008 11:41PM Lories wrote: Hi Ladyjane - I too am waiting, waiting first to talk with the radiation oncologist and then to have surgery,  Friday (the RO) and Monday (surgery) are both coming up fast. I am glad you are at the stage of waiting for your oncotype tests.  How long after surgery do they take?  I am still waiting to ask, no beg,  about having them, I won't know I am eligible until after surgery of course.  I am still new enough to this cancer thing to be foolish and going on gut instinct, but right now I feel like I would like to blast every part of cancer out of my body.  Reading the chemo posts does not encourage me, yet here are people actively ridding themselves of the disease.  Perhaps I will change my mind, or not even get to that point.  I look forward to hearing about your test results.  Did they hazard a guess?  all my best.  Lori",
      "MessageIndex": 11,
      "PostDate": "29/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/726399",
      "Title": "waiting for results luckycb BarbDwyer"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Dec 28, 2008 07:57PM Lories wrote: Hi Donna, I am kind of on the same schedule as you. I got the news on Dec 19 and had an MRI on the 24th.  You should get your MRI results back and that should notify you and the doc if they see anything else odd and you need any more biopsies.  I got my results back on Friday, so they shoud have them for you.  If you have not been in to the doc you should go in, then with me he did a physical exam, talked about surgery, let me schedule surgery and then booked me with a radiation oncologist. Have you been to see your doc yet? After that it is what I have been hearing about from others.  I am opting for a lumpectomy and sentinal node biopsy on January 5.  If they get clean margins, and no nodes are involved, I am hoping to have them run an oncotype testing - that will determine if I may get recurrent cancer.  If so then possibly chemo, if not radiation. I had a couple of books referred to me - Dr. Love's Breast Book and Living Through Breast Cancer by Kaelin (I think I spelled it right).  and Linny is right, you can get a lot of good info on this site.  Ask lots of questions and you can also send personal messages (PM) to people Lori",
      "MessageIndex": 8,
      "PostDate": "28/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/726399",
      "Title": "waiting for results luckycb BarbDwyer"
    },
    {
      "AuthorID": "Lories",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76677/profile",
      "Content": "Mar 20, 2009 10:03AM Lories wrote: I was scheduled for = the dentist the other day and told them about my Zometa.  The nurse who cleans my teeth said to be sure and call them if I develop any kind of mouth sores.  I asked them what they would do and she said they would put me on antibiotics and keep an eye on things.  So there you go, a hint.  Lori",
      "MessageIndex": 19,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730656",
      "Title": "What´s the scoop on Zometa? pitanga HeleneS"
    }
  ]
}