{
  "AuthorID": "Lottanodes",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197933/profile",
  "Posts": [
    {
      "AuthorID": "Lottanodes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197933/profile",
      "Content": "Oct 11, 2018 12:59AM Lottanodes wrote: I had manual breast exam along with my annual pap in the Spring of 1995 with normal results . The lab results from my November 25, 1995 post mastectomy pathology exam indicated a 7 X 6 cm tumor with \"metastatic poorly differentiated ductal carcinoma involving 22 out of 23 axillary lymph nodes with foci of extra nodal tumor extension\". Going on 23 years disease free. I got it into my unscientific mind back then that my cancer was fast growing so it should also be fast dying. After re-reading the report today I decided that I'm NOT going to mow the lawn, do any laundry, or cook today. Best wishes to all.",
      "MessageIndex": 33,
      "PostDate": "11/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/845339",
      "Title": "Large tumour survivors LM070917 Mumoftwo416"
    },
    {
      "AuthorID": "Lottanodes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197933/profile",
      "Content": "Jul 1, 2018 05:23PM Lottanodes wrote: Hello, I haven't posted on this site in a very long time. My life is pretty busy. I'm still working at age 68 and in pretty good health despite my decadent lifestyle and non compliance with healthcare guidelines. I eat and drink whatever I want and get very little exercise except for gardening and shopping. I get a mammogram about every 18 months and have never had a colonoscopy. Prior to my diagnosis in 1995 I ate a plant based diet, exercised regularly (normal weight), and kept up with the tests that my doctor suggested. I got stage III breast cancer anyway. No one knows why. Just as no one can say why I got it, no one can say why the treatment worked for me. Luck, I suppose. I have lived without my left breast and with mild lymphedema for years. A young newly diagnosed woman asked me the other day how long it takes for the constant anxiety to subside. I told her that there is no timetable but it is possible to reach a point where the shadow of breast cancer is not omnipresent in your life. Worry over breast cancer has been supplanted by worry over outliving my money, cataract surgery, impending knee replacement and having to deal with crabby old people (I'm one of them). My hope is that all of you will live to embrace the \"joys\" of senior citizenship as I do. One last note regarding \"chemo brain\". I have not met one single person who did not recover (or gain) all of their mental abilities after completing chemo. ",
      "MessageIndex": 133,
      "PostDate": "01/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/836950",
      "Title": "Stage III Cancer Survivors...15+ years and out weesa lexi4"
    }
  ]
}