{
  "AuthorID": "Lotusconnie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
  "Posts": [
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 10, 2017 11:50PM Lotusconnie wrote: djmammo had it all as above. Ultrasound is very common and it is also ordered to cover the doctor's liability no matter what he or she thinks. No one wants to take the chance and blow it off. It is hard to manage stress/anxiety like this. Especially for a 20s year old. No matter what it is, Now is the earliest time to get it dealt with. Things with small probability will not happen. Like to go to Vegas and win 100k. Try to manage your stress as much as you can. If it helps, do some good deeds, like to take care of a pet, give money to a homeless, to have some peace in mind. It is a ritual form to make us a better person. No matter what that can bring you peace and comfort in mind.",
      "MessageIndex": 3,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853337",
      "Title": "Testing Questions sunshineplz purple32"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Apr 28, 2017 08:01AM Lotusconnie wrote: Why diagnostic mammo takes almost 20 days? Call your PCP and ask him to please call the center to speed it up, or maybe send you to another facility to get it. Not because concerned or not, just because waiting this long is hard",
      "MessageIndex": 2,
      "PostDate": "28/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854528",
      "Title": "Found a lump in right armpit Coco69 Coco69"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Feb 10, 2015 09:01AM Lotusconnie wrote: I am thinking of you smaysings...",
      "MessageIndex": 6,
      "PostDate": "10/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/828108",
      "Title": "indent in breast and High risk due to family HX smaysings1 Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Jul 21, 2016 03:54AM - edited Jul 21, 2016 03:54AM by Lotusconnie I wouldn't be super worried. I sounds like a skin related issue, with skin accessory glands. Not the Breast. Even if you need excisional biopsy, it is unlikely to be related to the breast, I think. Hope it gets better soon",
      "MessageIndex": 4,
      "PostDate": "21/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/845942",
      "Title": "Hard pea sized lump near surface of skin Angellestinnett Denise-G"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 10, 2017 07:59AM Lotusconnie wrote: Good luck Anna! Most 4B is benign. You helped yourself to get it checked out on the left side. Hope it is just a fibroadenoma. Hugs",
      "MessageIndex": 10,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853041",
      "Title": "Diagnostic US and mammogram small pebble lump AnnaK05 AnnaK05"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 10, 2017 05:52AM Lotusconnie wrote: It is very rare. Good luck with everything!",
      "MessageIndex": 7,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853323",
      "Title": "Could it be Paget's Disease?! Wiggles Audora143"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 19, 2017 06:27PM Lotusconnie wrote: I can imagine your anxiety. I hope the lump could be cyst, the lymph node is benign. The dizzy is due to pregnancy. Good luck and enjoy your pregnancy",
      "MessageIndex": 3,
      "PostDate": "19/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853510",
      "Title": "Pregnant and Terrified faithstaton Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Feb 10, 2009 09:33AM Lotusconnie wrote: Thank you so much, Dear Leaf. I hope everything goes well with your treatment and hopefully you will be disease free and worry free very shortly and for a long time. I really appreciate your help a lot. I will read your post carefully later today. It's very informative.  Actually I meant LCIS, and that is what the pathologist warned me of . I will go on to seen 2nd opinion towards the ADH and mucocele-like lesion. The pathologist that I know is concerned that whether my pathologist has missed any area of LCIS since she feels that mucocele-like lesion is highly related with LCIS. I really need to clarify this up before I try to conceive again, but I don't know how difficult it is and how long I should wait...I know I should have some patience. By the way, I have access to the full text of that paper on Pubmed. If you need, I would like to send it to your emailbox.",
      "MessageIndex": 4,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/728770",
      "Title": "ADH + mucocele-like lesion Lotusconnie Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Feb 12, 2009 03:37PM Lotusconnie wrote: Hi, Leaf, desdemona222b, awb, I went to see my PCP yesterday and now I am going on to seek 2nd opinion. I also wanted to make an appointment with a medical oncologist to help me to monitor my disease and they asked me to call my surgeon instead. I think they work in a team so I left a message to the NP of my surgeon and expressed my concern. Hopefully she could call me back soon. As for seeking 2nd opinion, I am going to but a little bit hesitant now - My primary pathologist is the director and a internationally recognized authority as my surgeon said. He is also a consultant at the place that I am going to seek 2nd opinion. I heard that ADH and DCIS really depends on individual doctors and if the doctor I am seeking is even weaker than my pathologist, or if he or she does not want to challenge the authority to lose face, then I will end up with waste my time and get the same result anyway. Dr. Rosen in Cornell is the one who described Mucocele-like lesion for the first time, and as a benign disease, so I'm not sure whether he will tend to be biased as well... Maybe I am concerned too much. But sometimes doctors' attitude could be really hurting... Yesterday when I went to see my PCP with a prepared whole sheet of questions. She just responded that, I quote here - \"Do whatever you want (to seek a 2nd opinion)\", \"you know more than me\", \"you are the teacher and I am the student\", \"I am just a PCP and I know nothing (about what is said on the pathology report)\". It is just too professional, too cold to say these words. And I was proned to apologize and said that \"I know that I am over concerned\" \"Maybe it seems crazy (to have so many questions)...sorry about that\". I don't want to complain. And I don't have much energy to change my PCP right away. At least she is willing to refer. That's enough. I also called the pathology department to see whether they have any microscopic pictures that they could release to me. And when I go on to seek 2nd opinion, I will ask them to release the slides as well.",
      "MessageIndex": 12,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/728770",
      "Title": "ADH + mucocele-like lesion Lotusconnie Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 11, 2009 08:45AM Lotusconnie wrote: Still worrying a lot, especially today...I went to see an Oncologist last Friday. The 2nd opinion of pathology slides went back as ADH + mucocele-like lesion again. HOWEVER, yesterday I went for a mammogram and after taking the pictures, the staff said that there seems to be some microcalcification in some places...and she said that the radiologist will read the pictures today and call me...I am so panic and worried again...It seems to be an endless painful road.",
      "MessageIndex": 16,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/728770",
      "Title": "ADH + mucocele-like lesion Lotusconnie Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 11, 2009 03:39PM Lotusconnie wrote: Waiting anxiously. Trying to relax but cannot.",
      "MessageIndex": 17,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/728770",
      "Title": "ADH + mucocele-like lesion Lotusconnie Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 12, 2009 12:19PM Lotusconnie wrote: RIGHT BREAST -  CATEGORY 0 Grouped punctate and amorphous calcifications in the upper outer quadrant. Additional projections and Magnification views are recommended at this time. It is highly suspicious...",
      "MessageIndex": 19,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/728770",
      "Title": "ADH + mucocele-like lesion Lotusconnie Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Feb 10, 2009 06:00AM Lotusconnie wrote: Dear Leaf; Thank you very much! Yes, now I am going to see my PCP and seek a 2nd opinion to see whether there is any area of lobular or ductal carcinoma in-situ...no matter how complicated the process will be. I have to struggle through all of some people's unwillingness to refer to get things done. My husband and I decided that we will stop trying for 1-2 months till we get the 2nd opinion. We are all very disappointed and feel upset now. If I really have LCIS/DCIS, then I will go on to go through a long treatment and I don't know when I could consider to have a child... And also my career plan... Should I take the risk to get pregnant anyway? OR only with ADH, is it safe to be pregnant? I know nobody could ganrantee anything, but I just want to know how people decide these things... Thanks a lot and look forward to hearing from you and others here.",
      "MessageIndex": 2,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/728770",
      "Title": "ADH + mucocele-like lesion Lotusconnie Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 16, 2009 10:23AM Lotusconnie wrote: I had another mammogram last Friday. The radiologist did more projections with magnification views. She gave me the BiRADs category as 3/4a. She suggested me to have a surgical biopsy. I will talk to my surgeon this Thursday and try to get the biopsy as soon as possible.",
      "MessageIndex": 20,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/728770",
      "Title": "ADH + mucocele-like lesion Lotusconnie Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Feb 11, 2009 09:21AM Lotusconnie wrote: Hi, Dear Leaf and Desdemona222b, Thank you very much! Hi, Leaf, I understand from your post that DCIS is more severe than LCIS, and DCIS is easier to become malignant in the future. Am I correct? That is what I am worring about - whether my pathologist has missed the diagnosis of DCIS since there is mucocele-like lesion (MLL) already in my tissue. I read that MLL could vary from simple MLL to MLL with ductal hyperplasia, MLL with ADH, MLL with DCIS, and to mucinous carcinoma finally. Although I might be too optimistic - now I am kind of doubtful about the statement of \"Presence of mucocele-like lesion is always accompanied in lobular carcinoma in-situ\" that the pathologist abroad gave to me. Yes of course I should be very cautious about any possibility of missed LCIS in my diagnosis, and I am going on to seek 2nd opinion about my pathology report. However, now I am concerned more about DCIS since another pathologist in USA told me that there is obvious difference in the structure between lobular changes and ductal changes. So I guess my pathologist might not have missed LCIS in my diagnosis. But he said that ADH and DCIS is very hard to tell, depending on each individual pathologist's judge. Some pathologist abroad also asked whether my pathologist gave a \"Degree Classification\" towards my ADH, whether it is mild, moderate or severe. And they all believe that severe ADH is very close to DCIS. But my surgeon said that they don''t gave degree classification here toward ADH. Is that correct?",
      "MessageIndex": 8,
      "PostDate": "11/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/728770",
      "Title": "ADH + mucocele-like lesion Lotusconnie Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 19, 2017 06:02PM Lotusconnie wrote: I can understand how worried and anxious you are. Waiting is hard. Can you call your OB to report the lump and ask for an ultrasound and mammogram of right breast next week? Did you have any mammogram after 2013?",
      "MessageIndex": 1,
      "PostDate": "19/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853548",
      "Title": "Worried Nicstone Nicstone"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 10, 2017 09:03AM - edited Mar 10, 2017 09:04AM by Lotusconnie If a new referral is needed, call your GP's office to get it sent. If you have to wait longer to see your oncologist, that sounds unacceptable. Just try to get the follow up appointment to sarcoma sooner, and tell the oncologist about the breast concern too. Good luck",
      "MessageIndex": 23,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853297",
      "Title": "Could this be breast cancer? Papeski Freya"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Feb 10, 2009 01:23PM Lotusconnie wrote: I got a comment from another pathologist in Asia that I know. He said that I have pre-cancerous changes, and I should consider prophylatic mastectomy to avoid future trouble. I even dare not to ask him whether I could consider to have a baby right now...I'm so worried and confused. Here is my pathology report: 1) Atypical ductal hyperplasia, flat epithelial atypia and associated mucocele-like lesion, see note. 2) Fibroadenoma. 3) Fibroadenomatous change. 4) Cysts. 5) Apocrine metaplasia. 6) Margins inked and evaluated. I have no family history. My fibroadenoma and 2X2X2cm of tissue around it has been removed last year and the above ones are main conclusions in my report. Is that surgery that I had called a lumptectomy already? I'm seeking 2nd opinion about the ADH and mucocele-like lesion I have now. What worries me is whether I have DCIS or LCIS now. Leaf, do you have any idea that anyone ever considered pregnancy with only \"lumptectomy + monitoring\" under a similar situation, like ADH, DCIS or LCIS? Or always have lumptectomy+chemo or +radiology first, and then after some years consider pregnancy again? Thanks a lot!",
      "MessageIndex": 5,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/728770",
      "Title": "ADH + mucocele-like lesion Lotusconnie Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Feb 12, 2009 04:50PM Lotusconnie wrote: Big hugs to all of you. Thanks a lot. I've called the 2nd opinion place to make an appointment and it went quite smoothly :-) The coordinator kindly helped me to make an appointment with a medical oncologist at the high risk clinic of breast care. It will be in March. I will keep my fingers crossed and wait for it... Thanks a lot again!",
      "MessageIndex": 15,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/728770",
      "Title": "ADH + mucocele-like lesion Lotusconnie Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Feb 10, 2015 04:05PM Lotusconnie wrote: Approach to the patient following treatment for breast cancer. Authors Kathryn J Ruddy, MD, MPH Ann H Partridge, MD, MPH Section Editors Larissa Nekhlyudov, MD, MPH Daniel F Hayes, MD Deputy Editor Don S Dizon, MD, FACP Disclosures: Kathryn J Ruddy, MD, MPH Nothing to disclose. Ann H Partridge, MD, MPH Nothing to disclose. Larissa Nekhlyudov, MD, MPH Nothing to disclose. Daniel F Hayes, MD Clinical Research Support: Janssen [Circulating Tumor Cell (Circulating Tumor Cell Kit)], Breast cancer (abiraterone)]. Patent Holder: Circulating tumor cells (Circulating Tumor Cell Kit). Equity Ownership/Stock Options: Inbiomotion; OncImmune. Don S Dizon, MD, FACP Employee of UpToDate, Inc. Contributor disclosures are reviewed for conflicts of interest by the editorial group. When found, these are addressed by vetting through a multi-level review process, and through requirements for references to be provided to support the content. Appropriately referenced content is required of all authors and must conform to UpToDate standards of evidence. Conflict of interest policy All topics are updated as new evidence becomes available and our peer review process is complete. Literature review current through: Jan 2015. | This topic last updated: Jun 15, 2014. INTRODUCTION — According to statistics from the International Agency for Research on Cancer (IARC), there are approximately 29 million cancer survivors worldwide as of 2008 [1]. In the United States, there are an estimated 14 million cancer survivors as of 2014, a figure that is expected to increase to approximately 18 million in the next 10 years [2]. Over three million women have a history of breast cancer, which constitutes 41 percent of the population of female cancer survivors [2]. Although the vast majority of breast cancer survivors are women, approximately 2000 men are diagnosed with breast cancer annually in the United States alone, and most will achieve long-term disease-free survival [3]. (See \"Breast cancer in men\".) Patients who are living for decades beyond cancer experience the normal issues of aging, which are often compounded by the long-term effects of having had cancer and cancer therapy. These patients are at risk for a breast cancer recurrence (which is most common in the first five years but may occur even decades following treatment), a new primary breast cancer, other cancers, and short-term and long-term adverse effects of treatment. Additional issues for cancer survivors relate to psychological, genetic, reproductive, social, and employment concerns. Unfortunately, there is a lack of clear evidence for what constitutes best practices in caring for patients with a history of cancer, and this contributes to wide variation in care [4]. Recommendations for posttreatment surveillance after primary therapy of breast cancer will be reviewed here. A detailed discussion of the patterns of relapse (ie, locoregional recurrence, second primary breast tumor, metastatic disease) and long-term complications of breast cancer therapy are presented separately. (See \"Patterns of relapse and long-term complications of therapy in breast cancer survivors\".) A general overview of cancer survivorship is covered separately. (See \"Overview of cancer survivorship care for primary care and oncology providers\".) DEFINING A CANCER SURVIVOR — There are many definitions and phases of cancer survivorship. We define a cancer survivor as any person with cancer, starting from the moment of diagnosis. This is consistent with definitions from the National Coalition for Cancer Survivorship [5] and the National Cancer Institute [6]. This overview addresses breast cancer survivors who have completed initial treatment for breast cancer (ie, surgery, chemotherapy and/or radiation therapy) and who are without evidence of disease. GUIDELINES FOR POSTTREATMENT FOLLOW-UP — Guidelines from American Society of Clinical Oncology (ASCO) suggest that patients with early stage breast cancer (tumor <5 cm and fewer than four positive nodes) may follow up exclusively with a primary care provider (PCP); for patients and clinicians who agree with this plan, care may be transferred approximately one year after diagnosis [7]. In such cases, both the patient and the PCP should be advised of the appropriate follow-up and management strategy. Data are sparse to inform optimal follow-up of male breast cancer survivors; recommendations for women are usually applied to men, with modification as appropriate. Additional guidelines for posttreatment follow-up were made by the Institute of Medicine; these are discussed separately. (See \"Overview of cancer survivorship care for primary care and oncology providers\", section on 'Guidelines for posttreatment follow-up'.) For patients receiving adjuvant hormonal therapy, informed decisions regarding long-term options may necessitate periodic referral for oncology assessment since treatment strategies are evolving over time. Furthermore, input from an oncology specialist is warranted if there is suspicion or evidence of disease recurrence, or if questions arise regarding the safety of certain interventions (eg, vaginal estrogen in a patient who has severe atrophic vaginitis). Breast cancer survivors should receive ongoing age-appropriate screening studies and preventive care, consistent with recommendations for the general population, for conditions other than those related to breast cancer and its treatment. (See \"Preventive care in adults: Recommendations\".) COMPONENTS OF FOLLOW-UP History and physical examination — History and physical examination have been the principal means of detecting a breast cancer recurrence [8-10]. We suggest that patients be seen every three to six months during the first three years after primary therapy, every 6 to 12 months for the next two years, and then annually (table 1), consistent with American Society of Clinical Oncology (ASCO) 2012 guidelines [7]. However, this schedule is arbitrary; no studies have evaluated the benefit of less frequent clinical visits in patients with low-risk disease or more frequent visits in those with higher-risk disease [11]. History — In addition to the general components of a medical history, the breast cancer survivor should be screened for symptoms of local recurrence as well as metastatic disease. Any changes in the family history should be obtained, which may be important to discussions regarding genetic counseling. (See 'Genetic counseling' below.) The history should include any interval changes in the patient’s social environment (including partner status, life events, living arrangements, and occupational issues) that may have arisen since the end of treatment. A review of systems should not only screen for metastatic disease but also may identify issues related to prior treatment. We suggest that the review of systems include the following [12,13]: ●Constitutional symptoms – Anorexia, weight loss, malaise, fatigue, insomnia. ●Bone health – Presence of pain and its characteristics (ie, location, character of pain [dull or aching], chronic or intermittent, associated symptoms, exacerbating factors and what provides relief). ●Pulmonary symptoms – Persistent cough or dyspnea (at rest or with exertion). ●Neurologic symptoms – Headache, nausea, vomiting, confusion, weakness, numbness or tingling. ●Gastrointestinal symptoms – Right upper quadrant pain, change in bowel habits, presence of bloody or tarry stools. ●Genitourinary symptoms – Vaginal bleeding, pelvic pain, difficulty urinating. ●Psychologic symptoms – Depression, anxiety.  ●Reproductive/Endocrine symptoms – Hot flashes, dyspareunia, vaginal dryness, sexual dysfunction, fertility concerns (in women with intact ovarian function) Physical examination — We suggest that a complete physical examination be performed at each visit, which is consistent with ASCO guidelines [7]. At a minimum, the examination should include [12,13]: ●Examination of the breast, chest wall, and axilla – Thorough examination should be performed of the affected breast (if preserved) or chest wall, the contralateral side, the bilateral axillary regions, and the supraclavicular fossas. For those patients who underwent breast conserving treatment, providers should be comfortable examining the previously irradiated breast. The breast examination in patients who underwent adjuvant RT may not be helpful. In a review summarizing the results of seven randomized clinical trials, the sensitivity and specificity ranged from 29 to 74 percent and 17 to 30 percent, respectively [14]. (See \"Patterns of relapse and long-term complications of therapy in breast cancer survivors\".) Diagrams of the affected breast, including postoperative and postradiotherapy changes, can be helpful in documenting and following the examination over time. Evidence of local recurrence includes newly discovered lumps (on the skin, within the breast or the nodal regions). Other worrisome findings may include skin changes in the breast (table 2). For women who have undergone mastectomy with or without breast reconstruction, the incision site and surrounding skin of the chest wall should be examined visually and palpated for abnormalities. ●Musculoskeletal examination – If lymphedema is suspected, examination of the arms should include circumferential measurement of the upper extremities bilaterally. (See \"Clinical manifestations and diagnosis of lymphedema\".). In addition, palpation of the spine, sternum, ribs, and pelvis for bone tenderness should be routinely performed. ●Lung examination – Evaluation for breath sounds and percussion changes. ●Abdominal examination – Evaluation for right upper quadrant tenderness and/or organomegaly. ●Cardiac examination – Evaluation for of heart failure. (See \"Evaluation of the patient with heart failure or cardiomyopathy\", section on 'Physical examination'.) ●Neurologic examination – Evaluation of balance, gait, and sensory and motor function. (See \"The detailed neurologic examination in adults\".) ●Gynecologic examination – Regular gynecologic follow-up should be performed for women who have not undergone total hysterectomy (table 1) [7]. This is particularly important in women who are receiving tamoxifen because of the increased risk for endometrial tumors. (See \"Managing the side effects of tamoxifen\".) Breast imaging Mammography — Although the evidence is limited, surveillance mammography appears to be associated with a reduction in mortality among women of all ages [15-17]. This was illustrated best in a 2008 case-control study that compared mammographic utilization in women over 65 years who died or did not die of breast cancer and who lived at least 30 months following breast cancer diagnosis [16]. Women who had undergone a surveillance mammogram within one year were less likely to die of breast cancer (odds ratio [OR] 0.83, 95% CI 0.72-0.95).  The purpose of posttreatment mammographic surveillance is to detect ipsilateral local recurrences after breast conserving therapy (BCT), which develops in up to four percent of women treated for early breast cancer [18]. In addition, mammography is performed as surveillance for a contralateral breast cancer. There is a lack of high-quality evidence to inform the optimal timing and survival benefit of mammographic surveillance for detecting ipsilateral recurrence or a contralateral breast cancer [15,19]. For women in long-term follow-up, mammographic surveillance should be obtained annually. Local recurrence — There are no prospective trials that address the utility of mammography in the detection of local recurrence. Data from retrospective series suggest that mammography detects earlier lesions with a more favorable prognosis and that survival is improved in women whose lesions are detected mammographically as compared with those detected by other means [20-22]. However, other data suggest that mammographic screening in women with a personal history of breast cancer performs less well (lower sensitivity and slightly lower specificity) than in women without such a history [23]. In one study, women with a personal history of breast cancer had a higher rate of interval cancers compared with women without a history of breast cancer [23]. Fortunately, the majority of both screen-detected and interval cancers were early stage. (See \"Management of locoregional recurrence of breast cancer after breast conserving therapy\".) Contralateral breast cancer — There are no randomized trials that address the role of mammography or its impact on survival in detecting contralateral breast cancers. However, recommendations for mammographic surveillance are based upon the benefits seen in the general population without a history of breast cancer. In general, breast cancer survivors are higher-risk women than the general population, and it would seem reasonable to infer that they derive as much or even more benefit from mammography of the contralateral breast. (See \"Screening for breast cancer: Strategies and recommendations\".) There is indirect evidence from retrospective series that supports a beneficial impact for mammography of the contralateral breast [24-26]. One study compared outcomes among a cohort of breast cancer survivors in which both physical examination and mammography were performed for posttreatment follow-up versus a separate cohort of women who were followed only by physical examination [24]. Although the frequency of contralateral breast cancer was similar in both groups, more recurrences were node-negative in the women with utilization of routine mammography (75 versus 57 percent, respectively). Furthermore, the contralateral tumors were more often smaller than 10 mm or in situ (noninvasive) (35 versus 7 percent, respectively). Breast MRI — Breast MRI is not routinely recommended for breast cancer survivors because of a lack of evidence to inform its role in this population. This was demonstrated in a 2012 systematic review that included 10 case series (n = 494) on the role of MRI in the detection of a recurrence [27]. The sensitivity and specificity of MRI to detect recurrent breast cancer was no better than for mammography historically. However, breast MRI can be useful for patients suspected of a breast cancer recurrence when mammography (with or without breast ultrasound) is inconclusive [28].  Breast MRI is indicated in the follow-up of women at high risk for recurrent disease based on a known BRCA-mutation or strongly positive family history. However, this practice is extrapolated from the indications for breast MRI as a screening tool in high risk women. (See \"Management of hereditary breast and ovarian cancer syndrome patients with BRCA mutations\", section on 'Breast MRI'.) Ultrasound — Routine use of breast ultrasound as part of surveillance is not recommended. The addition of breast ultrasound (US) to screening mammography was evaluated in a trial in which 2809 women with an elevated risk for breast cancer who were undergoing routine screening mammography were randomly assigned to mammography alone or with breast US [29]. Compared with mammography alone, ultrasound plus mammography increased the diagnostic yield (from 8 to 12 per 1000 women, 95% CI 1.1 to 7.2) but also increased the rate of false positive results (4.4 versus 10.4 percent) and therefore lowered the positive predictive value. Surveillance of reconstructed breasts — For women who have undergone mastectomy, surveillance is usually performed by physical examination. Routine mammographic imaging is technically limited in patients who have prosthetic implants and is generally not advocated. However, mammography is technically feasible following autogenous myocutaneous flap reconstruction, particularly following TRAM (transverse rectus abdominis musculocutaneous) or perforator flap reconstruction, because abdominal adipose tissue forms the bulk of the reconstructed breast [30]. Although the available data are sparse, and there is no consensus on this issue, some institutions image TRAM-reconstructed breasts using mammography since even after mastectomy, some normal tissue may be left on the chest wall from which a new breast cancer may on occasion arise. (See \"Breast reconstruction: Preoperative assessment\" and \"Management of locoregional recurrence of breast cancer after mastectomy\", section on 'Findings on imaging'.) The only place where cancer can occur is either right below the skin in the subcutaneous tissue or just over the pectoralis muscle. Physical examination remains the cornerstone of detection of recurrent breast cancer after reconstruction, and other modalities such as MRI should be used only as adjuncts to clarify any physical findings. (See \"Breast reconstruction: Preoperative assessment\", section on 'Posttreatment surveillance of the reconstructed breast'.) Discontinuing breast imaging — Continued screening mammography is warranted for older survivors with reasonable functional status and life expectancy [31]. The available data suggest that surveillance mammography reduces the risk of death from breast cancer, even among older women [15,16]. One prospective study evaluated over 1800 women 65 years and older with stage I and II breast cancer and reported that each additional mammogram was associated with a significant reduction in the risk of dying from breast cancer (odds ratio 0.69, 95% CI 0.52-0.92) [15]. A similar conclusion was reached in a study from the Surveillance, Epidemiology and End Results (SEER)-Medicare database [16].  Evaluation of bone density — Women with a history of breast cancer may be at increased risk of osteoporosis as a result of prior cancer treatment. Therefore, ASCO guidelines include performing a baseline screening evaluation (typically with dual energy x-ray absorptiometry) in the following patients [32]: ●Women over age 65 years ●Women ages 60 to 64 years in the presence of any of the following: a family history of osteoporosis, body weight <70 kg, a history of a non-traumatic fracture, or other risk factors for osteoporosis (eg, smoking, a sedentary lifestyle, alcohol use) ●Postmenopausal women taking an aromatase inhibitor (AI), including those in whom an AI has been recommended but not yet initiated ●Premenopausal women who develop treatment-related premature menopause It is not clear what role vitamin D supplementation should play in women treated for breast cancer, nor whether or not levels should be checked routinely. In the absence of prospective data to inform the benefits specifically in these patients, the assessment of vitamin D levels and the role of vitamin D supplementation for women with low vitamin D levels should follow similar guidance as for women without a prior history of breast cancer. (See \"Vitamin D deficiency in adults: Definition, clinical manifestations, and treatment\" and \"Calcium and vitamin D supplementation in osteoporosis\".) Further discussion related to bone health, including the screening, treatment, and surveillance of osteoporosis, for women treated for breast cancer is discussed separately. (See \"Screening for osteoporosis\" and \"Overview of the use of osteoclast inhibitors in early breast cancer\" and \"Evaluation and management of aromatase inhibitor-induced bone loss\".) Genetic counseling — Breast cancer survivors who have not already pursued genetic testing may be appropriate candidates for testing. BRCA testing is an especially important consideration for men, and for women diagnosed under the age of 40, or with Ashkenazi heritage, and/or a strong family history of breast or ovarian cancer [31]. Prior to testing, it is important that patients be counseled about the potential ramifications of test results for themselves and their families, both medically and psychosocially. (See \"Genetic testing for hereditary breast and ovarian cancer syndrome\" and \"Breast cancer in men\".) Other rarer genetic syndromes that predispose to breast cancer and for which testing can be performed, depending on family and personal history of a variety of cancers, include Li Fraumeni and Cowden syndromes. A genetic counselor can help to discern whether such testing might be in order. (See \"Li-Fraumeni syndrome\" and \"PTEN hamartoma tumor syndrome, including Cowden syndrome\".) Genetic testing of the breast cancer survivor is important, particularly in order to facilitate testing in other family members. Once a particular mutation has been identified, testing other family members is technically straightforward. While it is possible to begin the genetic testing process in an unaffected individual, there is a greater chance that these results will be inconclusive. Therefore, the breast cancer survivor should be tested, particularly if her own children and first-degree relatives are also interested in their personal genetic susceptibility. (See \"Genetic counseling and testing\", section on 'Practical issues in genetic testing'.) Role of laboratory evaluation and other imaging — Intensive laboratory and/or radiologic surveillance is not indicated for asymptomatic breast cancer survivors. This was demonstrated in a 2005 meta-analysis of two randomized trials that compared routine follow-up (regular physical examination and mammography) versus intensive surveillance (including radiological and laboratory testing) [33]. There was no difference between groups in overall survival (hazard ratio [HR] 0.96, 95% CI 0.80-1.15) or disease-free survival (HR 0.84, 95% CI 0.71-1.00). Early diagnosis of metastatic disease, based on imaging alone and prior to onset of clinical signs or symptoms, may result in earlier intervention, with associated toxicities, but does not improve survival. Although a small percentage of patients with limited metastatic disease (eg, isolated pulmonary or liver metastases) may be treated with a multimodality approach, whether such patients are best identified by intensive posttreatment surveillance is unknown. Furthermore, laboratory and imaging tests used for surveillance have significant false positive and false negative rates. The unnecessary additional testing generated by a false positive result and the misleading reassurance generated by a false negative test can adversely affect the breast cancer survivor. Therefore, we recommend against performing the following tests in asymptomatic women including (table 1) [7]: ●Liver function tests – Routine liver function tests are falsely elevated in up to 80 percent of women without liver metastases [34-36].  ●Serum tumor markers – A number of serum markers are available that can detect early breast cancer recurrence, including CA 15-3, CEA (carcinoembryonic antigen), and CA 27.29 [37-40]. These biochemical markers of breast cancer increase in conjunction with advancing primary disease stage and reflect the total body burden of disease (table 3) [41-44]. However, they are neither sensitive nor specific for breast cancer relapse [40,41]. Therefore, measurement of serum tumor markers should only be used to monitor treatment response of patients with metastatic breast cancer, in the absence of readily measurable advanced disease [45]. ●Chest imaging – Neither chest X-rays nor computed tomography (CT) is recommended to screen for lung metastases in the asymptomatic patient [46-48]. In one series of 416 patients who were undergoing surveillance with routine chest imaging after completing primary treatment for breast cancer, only nine patients had isolated pulmonary metastases. [49]. ●Bone scan and serum alkaline phosphatase – There is no evidence that early detection of bone metastases changes the clinical course of the disease. Metastases to bone are almost always diagnosed by symptoms, even when patients undergo routine surveillance with bone scans [50-53]. Bone scans have an estimated sensitivity and specificity for detecting bone metastases of approximately 86 and 81 percent, respectively [54]. Alkaline phosphatase is neither sensitive nor specific for bone metastases. In a series of 1601 patients with node-positive breast cancer, alkaline phosphatase was only elevated in one-half of those patients who had known skeletal metastases, while the test was abnormal in 28 percent of those without bone metastases [53]. ●Abdominopelvic imaging – Neither liver ultrasound nor abdominopelvic CT scans is recommended as a routine component of posttreatment surveillance [55-57]. In one large series of over 2400 patients that included 6628 pelvic CT scans performed over a nine-year period, pelvic metastases were the only site of metastatic disease in 13 (0.5 percent) [56]. However, the findings led to over 200 additional radiographic and 50 surgical procedures, of which 84 percent yielded benign or negative results. ●PET scanning – There is no role for positron emission tomography (PET) scan in posttreatment follow-up. In retrospective cohort studies and a meta-analysis of 16 studies, PET scanning has been consistently more sensitive than conventional imaging and serum tumor markers for early diagnosis of recurrent disease [58-60]. However, the impact on survival and quality of life has not been addressed, and it seems unlikely that this approach would provide a survival or quality of life benefit. PROMOTING A HEALTHY LIFESTYLE — Patients often ask what they can do to improve their overall outcome from breast cancer. Lifestyle modification can be an empowering and effective way to boost physical and mental health in breast cancer survivors, and possibly to improve outcomes. Observational data suggest that exercise, avoidance of obesity, and minimization of alcohol intake are associated with a decreased risk of breast cancer recurrence and death in survivors [61-64]. Physical activity, diet, and body weight — Diet, physical activity, and weight are collectively considered energy balance factors because they describe the relationship between energy consumed (diet), energy expended (physical activity), and energy stored (adiposity). They have each been linked to cancer outcomes, particularly in survivors of breast cancer. (See \"The roles of diet, physical activity, and body weight in cancer survivorship\".) Soy and other complementary therapies — One nutritional issue of interest to breast cancer survivors is the impact of soy products (which contain phytoestrogens) on breast cancer recurrence rates. Although there is no convincing evidence that soy affects the risk of recurrence, the theoretical risk that phytoestrogens could stimulate the growth of hormonally sensitive cancers raises the concern that high soy intake could be dangerous. Thus, moderation of soy intake is generally suggested. (See \"Factors that modify breast cancer risk in women\".) Similarly, the safety and efficacy of many other complementary therapies including mistletoe, high doses of vitamins, and trace elements like selenium, zinc, and copper remains uncertain [65]. (See \"Complementary and alternative therapies for cancer\".) Alcohol intake — The evidence that alcohol is associated with an increase in the risk of recurrence is limited [64,66-68]. In the largest study, 1897 female breast cancer survivors (on average two years post diagnosis) participated in the Life After Cancer Epidemiology (LACE) study [64]. Those who drank ≥6 grams of alcohol daily (equivalent to at least three to four alcoholic drinks per week) had significantly higher rates of recurrence (hazard ratio [HR] 1.35, 95% CI 1.0 to 1.83) and death due to breast cancer (HR 1.51, 95% CI 1.0 to 2.29) than those who drank <0.5 grams daily. Overweight and postmenopausal women seemed to experience the greatest harm from alcohol intake as measured by breast cancer recurrence risk. (See \"Overview of the risks and benefits of alcohol consumption\", section on 'Breast cancer'.) SEXUAL AND REPRODUCTIVE ISSUES Sexual health — Menopausal symptoms that result from chemotherapy (in premenopausal women) and hormonal therapy (regardless of menopausal status) may make sexual activity less enjoyable and even painful. The psychological sequelae of a breast cancer diagnosis can include strains on relationships and changes in body image, both of which can be detrimental to sexual functioning [69]. Sexual dysfunction is associated with depression in breast cancer survivors [70]. It is important for physicians to routinely ask breast cancer survivors about their sexual functioning. Referral to a sexual health and/or mental health expert may be helpful. Interventions for women who report dyspareunia or difficulty reaching orgasm may benefit from one or more of the following: local hormonal therapy, vaginal dilators, lubricants, and counseling [71]. Local estrogen therapy — Local estrogen therapy comes in the form of creams and tablets, and it may provide relief of symptoms, but its use is controversial, particularly among women with a history of hormone receptor-positive breast cancer. Although one study demonstrated that vaginal estrogen results in a detectable increase in circulating estradiol levels among women taking an aromatase inhibitor [72], another study suggests that vaginal estrogen therapy does not result in an increased risk of recurrence in women taking endocrine therapy. The impact of vaginal estrogen on recurrence risk was evaluated among 917 women with a breast cancer recurrence (cases) who were compared with 8885 women with breast cancer in remission (controls, matched for age and initial endocrine treatment) [73]. The proportion of patients who used vaginal estrogen was low (less than three percent), and it was predominantly used in those women taking tamoxifen. The main finding was that the use of vaginal estrogen was not associated with an increased risk of recurrence (recurrence risk [RR] 0.78, 95% CI 0.48-1.25). In light of this low quality evidence, a decision to use vaginal estrogens must be individualized, taking into account tumor characteristics, current symptoms, and the risks and potential benefits of therapy, with input from both the primary oncologist and primary care provider (PCP). Topical lidocaine — For women with dyspareunia that appears to be isolated to tenderness at the vulvar vestibule, data from a prospective, randomized, double-blind trial suggest that topical lidocaine may provide relief [74]. In this study, 49 women with postmenopausal breast cancer and dyspareunia were randomly assigned to local application of topical aqueous 4% lidocaine or normal saline applied for three minutes to the areas of tenderness. All patients had tenderness at the vulvar vestibule confirmed on physical examination and evidence of significant coital pain. Treatment with topical lidocaine resulted in: ●Significant reduction in their worst pain score with intercourse (from a median of 5 to 0 versus 6 to 4 with normal saline)  ●No tenderness with speculum placement (after application) in 47 women (96 percent) Of note, very few women who participated in this study had evidence of dyspareunia associated with vaginal tenderness (n = 1) or pelvic floor myalgia (n = 2). Therefore, the data suggest that this intervention may be specific to women who have pain with penetration localized to the vulvar vestibule. Vaginal dehydroepiandrosterone — Dehydroepiandrosterone (DHEA) is a steroid hormone produced by the adrenal glands. It is an indirect precursor to both estrogen and testosterone, and levels decline with age (see \"Dehydroepiandrosterone and its sulfate\"). Vaginal DHEA preparations have been reported to improve vaginal health and sexual function in postmenopausal women. However, their safety and effectiveness in women treated for breast cancer has not been clear. (See \"Dehydroepiandrosterone and its sulfate\", section on 'Vaginal atrophy'.) One trial presented at the 2014 American Society of Clinical Oncology Annual Meeting suggests that women previously treated for breast cancer may derive benefits from vaginal DHEA. In the Alliance N10C1 trial, 441 postmenopausal women with a history of breast or a gynecologic cancer and at least moderately severe vaginal complaints for at least two months were randomly assigned to a vaginal preparation consisting of a placebo preparation or vaginal DHEA (dosed at 3.25 or 6.5 mg) [75]. All patients were instructed to apply treatment to the vaginal vault on a daily basis. At 12 weeks, women treated in all three treatment arms reported improvements in sexual function and symptoms associated with vaginal atrophy. However, DHEA was associated with statistically significant improvements in sexual satisfaction as measured using standardized questionnaires. Compared with placebo, vaginal DHEA (at the 6.5 mg dose level) was associated with a higher incidence of voice changes and headaches, but appeared to be well tolerated otherwise. Although estradiol levels were slightly increased by the vaginal DHEA in the study overall, this was not true in women receiving aromatase inhibitors. Although we await publication of the final results of this study, these data support the use of vaginal DHEA as an option for postmenopausal breast cancer survivors who suffer substantial vaginal complaints. Fertility and pregnancy after breast cancer — Young breast cancer survivors may experience infertility after breast cancer due to chemotherapy-related gonadotoxicity and the delay in childbearing required when women are taking the recommended five years of hormonal therapy [76]. (See \"Ovarian failure due to anticancer drugs and radiation\".) For women with a history of breast cancer, a subsequent pregnancy does not appear to compromise survival [77-79]. This was demonstrated in a 2011 meta-analysis of 14 case-control studies that evaluated the impact of pregnancy on the overall survival of women with breast cancer [77]. Compared with women who did not get pregnant, those who became pregnant had a 40 percent reduction in the risk of death (pooled risk ratio [PRR] 0.59, 90% CI 0.50-0.70). This outcome is likely explained by a selection bias known as the “healthy mother effect”, such that only healthy breast cancer survivors were able to conceive and carry a pregnancy [80]. In addition, a study presented at the 2012 European Breast Cancer Conference suggests that pregnancy after breast cancer is safe regardless of estrogen receptor status [79]. (See \"Overview of infertility and pregnancy outcome in cancer survivors\" and \"Gestational breast cancer: Treatment\", section on 'Pregnancy after breast cancer'.) While some experts recommend that patients wait two years after completing adjuvant therapy before attempting conception in order to avoid pregnancy during the time of highest relapse risk, limited data suggest that pregnancy sooner is safe [80,81]. Reassuringly, prior breast cancer treatments do not appear to increase the risk of congenital malformation [82]. (See \"Gestational breast cancer: Treatment\", section on 'Pregnancy after breast cancer'.) Contraception after breast cancer — While women with a history of breast cancer may wish to preserve fertility, they may not have an imminent desire to become pregnant. Potential options for contraception include barrier methods (eg, diaphragms, condoms) and the copper intrauterine device (IUD). A more extensive discussion of the topic of contraception is covered separately. (See \"Overview of contraception\", section on 'Women with medical issues and disabilities'.)  The safety and efficacy of hormonal contraception has not been well studied in women with breast cancer, as these women have traditionally been excluded from studies of hormonal contraceptives. The levonorgestrel-releasing intrauterine contraception device (LNG-IUD) has been evaluated in women with a history of breast cancer, although primarily as a method of endometrial protection from the effects of tamoxifen rather than as a contraceptive modality. Data are limited and inconclusive, but suggest an increased risk of cancer recurrence despite a low rate of systemic hormone absorption. This was shown in one retrospective cohort study of breast cancer survivors that evaluated the risk of cancer recurrence among cases (LNG-IUD users, n = 79) and controls (those who did not use LNG-IUD, n = 120) [83]. The rate of breast cancer recurrence was higher in cases compared with matched controls (22 versus 17 percent, OR 1.86, 95% CI 0.86-4.00), although the difference was not statistically significant. (See \"Managing the side effects of tamoxifen\", section on 'Endometrial protection'.) In the absence of prospective data, we agree with the World Health Organization guidelines for medical eligibility for contraceptive use and suggest avoiding hormonal contraception in women with a current or past history of breast cancer (particularly in those with hormone receptor-positive disease) (table 4). Clinicians should discuss the use of a nonhormonal contraceptive method (condom, diaphragm, copper IUD) and help the woman choose the method most consistent with her lifestyle and beliefs. QUALITY OF LIFE — Quality of life is a multidimensional construct that takes into account the physical, mental, social, economic, and spiritual aspects of life. Limited data suggest that patients treated for breast cancer have good quality of life, particularly as they move beyond the treatment period [4,11,84-86]. However, they may continue to have some lingering concerns. For example, in one study that included over 280 long-term survivors (without evidence of a recurrence >7 years) compared with almost 170 controls (without a history of breast cancer), self-reported deficits appeared to be limited to issues related to cognitive functioning and finances [84]. Multiple studies have shown that exercise improves quality of life in breast cancer survivors. Therefore, patients should be encouraged to adopt a physically active lifestyle following treatment for breast cancer. Further discussion on the role of physical activity in breast cancer survivors is discussed separately. (See \"The roles of diet, physical activity, and body weight in cancer survivorship\".) COORDINATION OF CARE — If agreed upon by the patient, the treating oncologist, and the PCP, shared care would provide treatment summary information and a plan for follow-up care to both the patient and the PCP. The level of shared follow-up by the oncology specialist and PCP could depend upon patient and provider preferences. Communication between the PCP and subspecialist is vital given that uncertainties about physician roles and responsibilities can lead to deficiencies in care [4]. (See \"Overview of cancer survivorship care for primary care and oncology providers\", section on 'Coordination of care' and \"Assuring quality of care for cancer survivors: The survivorship care plan\".) INFORMATION FOR PATIENTS — UpToDate offers two types of patient education materials, \"The Basics\" and \"Beyond the Basics.\" The Basics patient education pieces are written in plain language, at the 5th to 6th grade reading level, and they answer the four or five key questions a patient might have about a given condition. These articles are best for patients who want a general overview and who prefer short, easy-to-read materials. Beyond the Basics patient education pieces are longer, more sophisticated, and more detailed. These articles are written at the 10th to 12th grade reading level and are best for patients who want in-depth information and are comfortable with some medical jargon. Here are the patient education articles that are relevant to this topic. We encourage you to print or e-mail these topics to your patients. (You can also locate patient education articles on a variety of subjects by searching on \"patient info\" and the keyword(s) of interest.) ●Beyond the Basics topics (see \"Patient information: Lymphedema after cancer surgery (Beyond the Basics)\") SUMMARY AND RECOMMENDATIONS ●Essential elements of management for breast cancer survivors who have completed active treatment and have no evidence of disease are cancer surveillance, encouragement of adherence with ongoing treatment and lifestyle recommendations, treatment of medical and psychosocial consequences of cancer and its therapy, and care coordination between specialists and primary care providers. (See 'Introduction' above.) ●Survivor follow-up should include updated history, regular physical examination, and breast imaging (ie, mammography). The follow-up should not only focus on cancer surveillance, but also on any late-treatment related complications, psychosocial issues, and occupational problems. (See 'Components of follow-up' above.) ●All women with breast cancer should be counselled about the role of genetic testing and counseling. (See 'Genetic counseling' above.) ●Laboratory studies or radiologic imaging to screen for distant recurrence in asymptomatic patients should not be performed. (See 'Role of laboratory evaluation and other imaging' above.) ●Diet and exercise can promote well-being and may improve survival. All breast cancer survivors should pursue a healthy lifestyle that includes following a prudent diet, pursuing or maintaining an active exercise program, minimizing alcohol intake, and refraining from smoking. (See 'Promoting a healthy lifestyle' above.) ●Treatment may affect many aspects of sexuality, and breast cancer survivors should be routinely questioned about concerns related to sexual health and counseled or referred as needed. (See 'Sexual health' above.) ●Although data are limited, studies do not indicate increased risk of recurrence for survivors who become pregnant or an impact on pregnancy outcomes. (See 'Sexual and reproductive issues' above.) ●For women with breast cancer who wish to preserve fertility but delay pregnancy, we suggest not administering hormonal contraception (Grade 2C). Physicians should counsel women about methods most consistent with their lifestyle and beliefs. Alternative forms of contraception include copper IUD and barrier methods. (See 'Contraception after breast cancer' above.)  ●A variety of clinicians may adequately follow women after their primary therapy for breast cancer. Clinicians should be experienced in the surveillance of these patients, the complications that may arise from treatment, and in breast examination, including the examination of irradiated breasts. A shared care model that integrates both specialists and primary care providers on ongoing follow-up care may provide the best adherence to guidelines for recommended care; but communication and coordination of care is required. (See 'Coordination of care' above.) ",
      "MessageIndex": 7,
      "PostDate": "10/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/827636",
      "Title": "Advice Please! NickiDanny NickiDanny"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Jul 21, 2016 06:34AM Lotusconnie wrote: I am sorry that things are moving a little slow over there. It makes the waiting so hard. Here is something to read about calcifications too. Thanks for the above post about comparison between amorphous and pleomorphic. Hope you get a good result soon https://subrad.com/the-breast-center/breast-educat...",
      "MessageIndex": 7,
      "PostDate": "21/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/846080",
      "Title": "Just waiting and trying not to worry Armyfam5 Armyfam5"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Feb 10, 2015 11:59AM Lotusconnie wrote: NickiDanny, I think to see a breast surgeon alternating with a medical oncologist who focuses on breast cancer is a good plan for follow up. To have MRI alternating with mammogram every 6 month is a good plan for imaging screening. For your question about how to follow up the side of mastectomy, I think the MRI with IV contrast will be a good way to follow up, since you will only have mammogram on the other side. Self-exam and bring it up to your doctor from time to time, so that an ultrasound or additional MRI could be done, is a second-line defense. I do not believe in doctor's clinical exam. But do find a medical oncologist who does breast exam on you. That is odd that yours did not do that. I hope my answers could be of use.",
      "MessageIndex": 4,
      "PostDate": "10/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/827636",
      "Title": "Advice Please! NickiDanny NickiDanny"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Feb 10, 2015 03:55PM Lotusconnie wrote: I did not realize that MRI is not approved for follow up after diagnosis and treatment. Sorry. Hope someone else has some input. How do you follow up after mastectomy?",
      "MessageIndex": 6,
      "PostDate": "10/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/827636",
      "Title": "Advice Please! NickiDanny NickiDanny"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Feb 12, 2015 03:11AM - edited Feb 12, 2015 03:13AM by Lotusconnie NickiDanny, I will be thinking of you and pray for you! Hang in there. Try not to think of the worst scenario yet. Is it on your breast? More likely it could be a fibroadenoma or something. If on mastectomy side, it could be scar tissue etc. It could be very manageable even if it is something (which is much less likely).Best of luck!",
      "MessageIndex": 9,
      "PostDate": "12/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/827636",
      "Title": "Advice Please! NickiDanny NickiDanny"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Apr 28, 2017 10:40AM Lotusconnie wrote: also ask your doctor to calculate your lifetime risk Gail model and see if your insurance approve you for a MRI",
      "MessageIndex": 2,
      "PostDate": "28/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854564",
      "Title": "Confused about Mammogram/ mavelard Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 9, 2017 02:21PM - edited Mar 9, 2017 02:26PM by Lotusconnie I am so sorry to read this post. Apparently there was anchoring mistake-that they thought it was due to inflammation because of recent biopsy. Thankfully you advocated yourself and went to see a breast surgeon. Good luck with everything!",
      "MessageIndex": 3,
      "PostDate": "09/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/850262",
      "Title": "Enlarged axillary lymph node after breast core needle biopsy Mahsa_sh akayb"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 10, 2017 08:37AM Lotusconnie wrote: Angi, can you push to have the MRI now instead of May? Just to have peace of mind. If you continue to tell the breast surgeon about the lymph node, he may agree to do it now",
      "MessageIndex": 5,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/850262",
      "Title": "Enlarged axillary lymph node after breast core needle biopsy Mahsa_sh akayb"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 19, 2017 06:48PM Lotusconnie wrote: I totally understand. Here are some thoughts I use to try to calm myself down. See if it helps you. 1. NOW is the earliest time I can find out the issue and deal with it, instead of waiting or not finding it out until later. 2. Anything found early is quite treatable. I believe so. To detect early is the key. 3. If there is anything I can do for the breast problem (like calling doctor), do it. If not, do other things in life now, that I won't want to do if I have to deal with a bigger issue next week. 4. Things could be worse (this is a hard thought to accept). I mean comparing with harder situations. Let me know what you think about it",
      "MessageIndex": 3,
      "PostDate": "19/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853548",
      "Title": "Worried Nicstone Nicstone"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 9, 2017 12:58PM Lotusconnie wrote: great",
      "MessageIndex": 51,
      "PostDate": "09/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Lotusconnie wrote: I'm 30 now and dignosed with atypical ductal hyperplasia (ADH), flat epithelial atypia and associated mucocele-like lesion in a fibroadenoma that was removed (lumpectomy) Nov 2008. Doctors here in Boston just ask me to regularly follow it up by physical check-up, not even ultrasound. And no medicine or other treatment. However, recently I heard back that \"mucocele-like lesion is very rare in benign disease. Presence of mucocele-like lesion is always accompanied in lobular carcinoma in-situ, and lobular carcinoma in-situ is usually mistaken as benign disease.\"- Opinions from an expert pathologist abroad who focuses on breast cancer diagnosis and gave a comment towards mucocele-like lesion when I asked her. Adding to the fact that ADH itself is a precancerous change... I'm wondering whether there is anyone here who has had a similiar situation before and could share some thoughts with me kindly - 1) Whether or not should I seek a 2nd opinion about the pathological changes I have on the slides, to decide if there is any area of lobular carcinoma in-situ... 2) I have no child yet and I am trying to conceive. I had a miscarriage last June before the surgery. Should I stop trying now? It is kind of unacceptable to me mentally to stop to try. But I am also really worried about the possibility that when I could get pregnant, and after some time I will find myself end up with invasive ductal cancer due to pregnancy induced hormone changes. On the other hand, even if I stop trying, I don't know/plan to have any treatment now. So what is the reason for waiting then? 3) Seek more doctors' opinion about treatment choice. My surgeon seems not caring at all. And who else should I ask? OB? Is it proper? I even don't know who to ask besides my PCP and surgeon... Please help me...Thanks for your wisdom toward this situation. Connie Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/728770",
      "Title": "ADH + mucocele-like lesion Lotusconnie Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 9, 2017 02:12PM - edited Mar 9, 2017 02:13PM by Lotusconnie I had bloody discharge when I was pregnant. It was said to be related to hormone changes. Background: I have ADH, fairly widespread.",
      "MessageIndex": 6,
      "PostDate": "09/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853316",
      "Title": "Trying to not worry, but it's proving difficult. samiiwaters Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Apr 1, 2017 12:46PM Lotusconnie wrote: good luck and hope it is benign",
      "MessageIndex": 6,
      "PostDate": "01/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853754",
      "Title": "Not Diagnosed but worried 2016cats MelissaDallas"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 4, 2017 06:44AM Lotusconnie wrote: The waiting game is so hard...please do not think too much of it. It also could be sabeceous cyst. It could be told from an ultrasound with a duct connecting to the skin. I doubt the mammogram will help much. However, they do not want doctors to order only an ultrasound. So mammogram is ordered too. I am pretty sure it is a diagnostic mammogram with an option to do an ultrasound. For you it is not a screening mammogram. Therefore, you will know the result on Wed. You did not describe how far the lump is to your nipple. If you look at the anatomy structure, I believe introductal papilloma is only close to the skin where it is close to the nipple. It is rare that you have not noticed it while it has grown out of the duct to be close to the skin. It is rare that it does not have nipple discharge because it is in the duct. And i believe your OB and NP said abscess because it is felt attached to the skin. I agree your GP is being cautious and I think he did the right thing to give you an evidence to have peace of mind. I agree about colonoscopy. Start at your Mom's diagnosis age minus 10, or 40 years old, whichever earlier. Or whenever there is concern of iron deficiency anemia PLUS guaiac positive stool. To woman, heavy period is more often to cause anemia. If you don't have anemia, wait till as above. If you have, work it out. And also start screening mammogram from age 40 every year. I myself have to do mammogram alternating with breast MRI every 6 month for precancerous breast changes and high life risk. I know the anxiety waiting for tests. Even if it is not necessary for your case, tell yourself, \"no matter what it is, NOW is the earliest time to deal with it\". Also \" rare things unlikely happen ( large papilloma without nipple bloody or other color discharge)\" . Hugs. We are here for you.",
      "MessageIndex": 44,
      "PostDate": "04/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Mar 4, 2017 04:12PM Lotusconnie wrote: hopeful 1025, good luck next Wed. Hope it will be all fine.",
      "MessageIndex": 46,
      "PostDate": "04/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852904",
      "Title": "If You All Got a Dollar Each of These.. But I'm VERY WORRIED! hopeful1025 Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Apr 7, 2009 02:31PM Lotusconnie wrote: Hi WBTS I also support you to get it checked out, but don't get too stressed out. For young women it is really common for you to be able to see a superficial vein on your breast. Sometimes it is due to the estrogen level. If your doctor feels confident that you have fibroadenomas, you may want to confirm it with ultrasounds too. I suppose you have that done as well. If these procedures are all done, then you could be in relief while still cautious. Go get your symtoms checked, but not very alarmed though. I totally understand your feeling of fear. I myself is very scared since I am waiting for the biopsy result for a BiRADS 4 clustered microcalcifications.",
      "MessageIndex": 3,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732068",
      "Title": "Vein and soreness wbts wbts"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Apr 28, 2017 08:35AM - edited May 3, 2017 09:50AM by Lotusconnie",
      "MessageIndex": 16,
      "PostDate": "28/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854449",
      "Title": "Really looking for hope Adelozier purple32"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "May 5, 2017 09:17AM - edited May 5, 2017 09:19AM by Lotusconnie Scillamfo, get an ultrasound of armpits and mammo at your breast which you felt lump.Breast exam once a year only applies to regular checkup. New finding of lumps should be checked now and the once a year policy does not apply. Since you have seen a breast clinic before, you may be able to schedule an appointment to see the doctor for follow up directly. You may need to call your primary care physician to send a referral via phone. It depends on your insurance. I agree that you should get a report of all test results. Good luck. It could be skin infection only. Don't stress out but do get it checked",
      "MessageIndex": 3,
      "PostDate": "05/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854855",
      "Title": "Worried and gut feeling Scillamflo Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "May 3, 2017 10:26AM - edited May 3, 2017 10:28AM by Lotusconnie Adelozier, I am sorry for the news and sorry if what I wrote caused any uneasy feeling. I did not want to dis-legitimize or minimize your concern. I felt for you and I was going through your report to pick up all possible positive signs or words... I am sorry that it is BC. It is good that it is early stage. I hope you have a smooth treatment and recovery. Again, my apologies. ",
      "MessageIndex": 26,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854449",
      "Title": "Really looking for hope Adelozier purple32"
    },
    {
      "AuthorID": "Lotusconnie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Jul 22, 2016 09:08AM - edited Jul 22, 2016 09:08AM by Lotusconnie Thanks for letting me know.",
      "MessageIndex": 2,
      "PostDate": "22/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/846200",
      "Title": "The every 6 month monitoring for high risk women like me Lotusconnie Lotusconnie"
    },
    {
      "AuthorID": "Lotusconnie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79168/profile",
      "Content": "Lotusconnie wrote: This Post was deleted by Lotusconnie. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/846200",
      "Title": "The every 6 month monitoring for high risk women like me Lotusconnie Lotusconnie"
    }
  ]
}