{
  "AuthorID": "LouiseIndig…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
  "Posts": [
    {
      "AuthorID": "LouiseIndig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
      "Content": "Feb 17, 2011 10:21AM LouiseIndigo wrote: Dr Keith Block at the Block Integrative Cancer Centre in Evanston, Illinois seems to be very good in situations such as yours. You can google him and check out his webpage at LifeOverCancer. If you can't get to see him his book of the same name contains some very good suggestions for building up the system for further treatment. I wish you the very best, Louise",
      "MessageIndex": 15,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765027",
      "Title": "Outlived all my treatments. Drs. Don't know what to do with me! j1gilbe Lowrider54"
    },
    {
      "AuthorID": "LouiseIndig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
      "Content": "Sep 17, 2008 01:59PM LouiseIndigo wrote: Hi Juniper Thanks for your response. Not on either herceptin or hormonals. I know i probably should discuss it with the doc but it's fear that keeps putting me off. I suppose i just want to know that it's all a \"normal\" side effect of chemo and rads. I hope your own pain isn't too bad. It's a different reality isn't it, having to adjust to constant pain, and, at least in my case, not wanting to take anything for it as pain killers wreak havoc with my stomach. The joys! Louise",
      "MessageIndex": 2,
      "PostDate": "17/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/721360",
      "Title": "Hand, foot and back pain LouiseIndigo LouiseIndigo"
    },
    {
      "AuthorID": "LouiseIndig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
      "Content": "Sep 18, 2008 08:15AM LouiseIndigo wrote: Bobbie ........ your message is a gift. I did have a course of Taxol (after adriamycin and cyclophosamide -- can't spell!) and everything in your message sounds right. My heart has bounced a few octaves! Thank you so much -- side effects i can live with, it's the fear that's irrational and awful. Louise",
      "MessageIndex": 4,
      "PostDate": "18/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/721360",
      "Title": "Hand, foot and back pain LouiseIndigo LouiseIndigo"
    },
    {
      "AuthorID": "LouiseIndig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
      "Content": "Sep 19, 2008 11:33AM LouiseIndigo wrote: Kerry, I hope the taxotere gets easier for you. It is the weidest sensation, falling over especially first thing out of bed in the morning. Also, i do a 4 mile walk twice a week with some friends and it really embarasses me when i sometimes head sideways into one of them. My feet just kinda of keel over. Thankfully though that doesn't happen all the time. It's a kind of mad aging of the body -- I'm 43 this year and this thing can make me feel like I'm 83. I agree so much with you not wanting to spend the rest of your life jumping at shadows. I was so determined not to do that at all and now i'm trying to stop -- I will get over it -- honest!  The support here is just great. Love your hair in the pic by the way!  Louise",
      "MessageIndex": 7,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/721360",
      "Title": "Hand, foot and back pain LouiseIndigo LouiseIndigo"
    },
    {
      "AuthorID": "LouiseIndig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
      "Content": "Sep 17, 2008 08:02AM LouiseIndigo wrote: Hi all Marylou, my diagnosis in May 2007 was very similar to your own. I finished treatment in March of this year and along with the dreaded hand and foot neuropathy, there are so many times when i could just crawl under a rock i get so exhausted. What i do find however (this on the advice of a nutritionist) is that when i stay off sugar (difficult i know!) and eat a high protein diet my energy levels are so very much better. It means ensuring i eat protein with every meal, which seems to balance my blood sugar. for what it's worth ....... Louise",
      "MessageIndex": 73,
      "PostDate": "17/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/719657",
      "Title": "Still have the fatigue after 2 years. Mary-Lou Molly2013"
    },
    {
      "AuthorID": "LouiseIndig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
      "Content": "Feb 17, 2009 09:45AM LouiseIndigo wrote: You know i can't believe how relatively young everyone here seems to have been at diagnosis and with mets, expecially considering that only about 20% of people diagnosed with breast cancer are under 45. I was 41 with original stage 3 diagnosis; and 42 when diagnosed with bone mets (i am now 43). I wonder if it is down to the profile of people online often tending to be younger or if it is that the disease in younger people tends to be more aggressive? Just a thought! Louise",
      "MessageIndex": 69,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "LouiseIndig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
      "Content": "Jan 21, 2009 10:52PM LouiseIndigo wrote: Debra, that's just it isn't it -- the idea that exercise makes you \"feel alive\" as you put it so perfectly. At the risk of sounding like a dreaded conspiracy theorist, the bulk of the money for cancer research is coming from the drug companies and hence it is drug oriented along very defined research lines. Believe me, I give thanks every day for the same drugs but also get deeply upset that after all this time and all the money spent that all the same drugs offer us is containment at best -- and more drugs to deal with their side effects. Who knows what would happen if the profit motive were taken out of the drive to a cure? Somehow i think we'd be much nearer the holy grail. Even if just a little more time, effort and money were to be put into disseminating and clinically applying the research that has already proven \"significant\" benefit -- such as exercise -- we could have more empowered survivors out there living longer, healthier, happier, more energised lives. It is back to the question of why a drug that demonstrates \"significant\" benefit will be clinically fostered but much less so a non-drug therapy? Enough of the soap box! Louise",
      "MessageIndex": 12,
      "PostDate": "21/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727376",
      "Title": "Exercise and mets LouiseIndigo LouiseIndigo"
    },
    {
      "AuthorID": "LouiseIndig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
      "Content": "Jan 16, 2009 03:14AM LouiseIndigo wrote: Trina, your story is so inspiring. It really is about starting from where we are and just doing as much as we can. (I kept walking my four mile stint during chemo but would be flat our for at least one week of the three when i couldn't put a foot outside the door).  You say and i have read similarly that \"oncologists are supposed to start recommending exercise\" and it's wonderful to hear from you Luvtotravel that your doctor is doing just that. But why do so many doctors appear to ignore exercise altogether? If a new drug had shown similar \"significant\" benefit in terms of survival, there would be wall to wall coverage on every news media and we'd be demanding access to it. Hope treatment is going well for both of you. I still quite don't believe it refers to me when i write \"bone mets\". This wasn't ever part of the dream of the future.  Louise",
      "MessageIndex": 3,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727376",
      "Title": "Exercise and mets LouiseIndigo LouiseIndigo"
    },
    {
      "AuthorID": "LouiseIndig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
      "Content": "Oct 7, 2010 04:37PM LouiseIndigo wrote: LuAnn THANK YOU SO MUCH for taking the time to write such a detailed reply -- I appreciate hugely. Your reply is really very reassuring. I have been so reluctant to do this but started today into a four week daily dose as I felt I had no choice. In terms of the type of radiation, all i know is that it is electron-radiation as opposed to the deeper photon-radiation that as you say they certainly blasted me with first time around in 2007. I have been told to expect permanant skin deterioration as a result but that i can live with! My thanks again -- and for the other kind messages too. Louise",
      "MessageIndex": 6,
      "PostDate": "07/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758874",
      "Title": "Reirradiation for chest wall recurrence LouiseIndigo LouiseIndigo"
    },
    {
      "AuthorID": "LouiseIndig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
      "Content": "Jan 27, 2008 11:59AM LouiseIndigo wrote: I'm starting radiation on 18 February -- would also like to join. Haven't had treatment since mastectomy with nodal clearance in mid November (had chemo before surgery) so hate having to go back into it but so looking forward to being finally finished treatment. Also told best to go without wearing bra. I'm still looking for the right support top with bra effect for the duration -- something to give some shape but without the pressure. Louise",
      "MessageIndex": 10,
      "PostDate": "27/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "LouiseIndig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
      "Content": "Sep 4, 2011 02:33PM LouiseIndigo wrote: Hi I had really good sucess with electrochemotherapy treatment for skin mets. I don't know how widely available it is though -- the treatment centre i attended was spun-off from a previous clinical trial there. If you google it, you will get info on it. Also there's a trial at Tufts in Mass on photodynamic therapy for skin mets, about which i have also heard good reports and as far as i know they are still recruiting. Treatment under the trial is free, you just pay for travel, and a marginal cost for accommodation if you live in the USA. Details on this will also come up if you google. Hope this helps. Best wishes, Louise",
      "MessageIndex": 4,
      "PostDate": "04/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/773433",
      "Title": "Skin Mets TNBC-er LouiseIndigo"
    },
    {
      "AuthorID": "LouiseIndig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
      "Content": "Feb 25, 2011 01:58PM LouiseIndigo wrote: Hi again .......... just had ECT treatment today. Feeling a bit weird, exhausted but wired, bit sore with restricted arm movement because of the wound, and i remember very clearly the litle electrical shocks with the treatment -- which i was told, with the sedation, that i wouldn't! Overall though i am fine and looking forward to being completely back to normal shortly. Definitely very doable. It's just one treatment per lesion if it clears completely. I will know in about 4 weeks. Otherwise, they do it a second time in about 6 weeks. I am definitely going to err on the optimistic side and believe they won't need to! Best, Louise",
      "MessageIndex": 7,
      "PostDate": "25/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765060",
      "Title": "Electrochemotherapy LouiseIndigo mthomp2020"
    },
    {
      "AuthorID": "LouiseIndig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
      "Content": "Jan 5, 2009 11:37AM LouiseIndigo wrote: Angie I don't wish to alarm you (as our individual situations can be so hugely varying) but I had severe pain in my affected breast before diagnosis. Because i had this pain i thought i actually thought i had a breast abscess when i went to see my doctor. I have since met quite a few women who had varying degrees of pain before diagnosis. As far as i can recollect mine was as a result of the cancer affecting nerve endings. If i were in your situation i would try to push your appointment forward. You may well be perfectly fine and this may simply be a scare but you do need to know. Thinking of you  Louise",
      "MessageIndex": 3,
      "PostDate": "05/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/726764",
      "Title": "severe breast pain in left breast aljlbl Beesie"
    },
    {
      "AuthorID": "LouiseIndig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52322/profile",
      "Content": "Feb 20, 2011 12:18PM LouiseIndigo wrote: Hi again -- thanks for feedback. Chainsawz your description is spot on n it seems to be used mainly for tumours in skin but it is at least also being developed for use for in bone, liver among others i think. My current spot due to be treated with ECT is subcutaneous.",
      "MessageIndex": 4,
      "PostDate": "20/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765060",
      "Title": "Electrochemotherapy LouiseIndigo mthomp2020"
    }
  ]
}