{
  "AuthorID": "loulousgal",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144748/profile",
  "Posts": [{
    "AuthorID": "loulousgal",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144748/profile",
    "Content": "Feb 8, 2012 11:03PM loulousgal wrote: I just found a holistic dentist and had my first appointment a couple of weeks ago. I have been looking for a practice like this for years and am thrilled to have finally found it. I've been pregnant or nursing for years and have delayed having a tooth pulled, and I suspected that the troublesome tooth was behind various symptoms. As I understand it, holistic dentistry is primarily differentiated from traditional dentistry in that hd focuses on how oral health impacts the rest of the body. For instance, it is already well documented that oral health significantly impacts the heart. As for the impact of root canals, my dentist explained the concept to me by sketching the cross-section of a tooth. He showed me that root canals can leave behind MILES of infected vessels, which, as explained by posters above, impacts the overall immune system. I'm having two teeth pulled in a couple of weeks; one is a previously root canaled tooth on the same side as the one that I knew to be an issue. Having that tooth pulled won't drastically effect my bite, so I didn't even ask about alternatives to pulling it (the infection sketch really resonated with me and I just want it out), but I did find this note on root canal therapy on a quick google search.  This is my first post here; I was just doing some research on my options as a higher risk woman and the topic caught my eye. I definitely think holistic dentistry is legitimate, and I hope you all are able to find good providers near you. The link above is for an integrative dentist in New Jersey. I'm in North Carolina and happy to share mine if any of you are looking to travel. :)",
    "MessageIndex": 4,
    "PostDate": "08/02/2012",
    "ThreadURL": "https://community.breastcancer.org/forum/47/topics/781843",
    "Title": "Root canal? momoschki loulousgal"
  }]
}