{
  "AuthorID": "Loveandligh…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210859/profile",
  "Posts": [
    {
      "AuthorID": "Loveandligh…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210859/profile",
      "Content": "Feb 3, 2015 12:22AM Loveandlight1977 wrote: Dirtybird, I had two biopsies this morning. I had so very little pain. I felt a small pinch and sting from the Lidocaine. That was it. So you know, one of my lumps is 6 cm from the nipple the other was 1 cm from the nipple. That one was a little more tender getting numb. I had some wierd tingling as she was probably very close to a nerve but nothing I would describe as pain. If you just stay still and give the anesthetic a few seconds it kicks in so you dont really feel most of the injection. I didn't feel the biopsy part at all. I dental assisted for years. A mandibular block injection hurts for a few seconds before getting numb. This is NOTHING like that. It's really not bad at all. Remember the needle length means nothing. It has to be long enough to reach your suspicious areas. What you need to know is that the needle is super skinny, small like a dental needle. Keep your eyes closed, remember to breathe. I will get my results Thursday or Friday so I would suppose a few days is the norm. Try and relax. I know it is excruciatingly difficult. I'm here and willing to listen if you just need an ear. Wishing you love and light and B9 results!",
      "MessageIndex": 1,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828114",
      "Title": "Needle Biopsy of Breast questions DirtyBird101 DirtyBird101"
    },
    {
      "AuthorID": "Loveandligh…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210859/profile",
      "Content": "Feb 3, 2015 01:42AM - edited Feb 3, 2015 01:47AM by Loveandlight1977 Dirtybird, Glad you feel a little better now. If you are overly anxious...ask for some meds. There isnt any reason that your doctor shouldn't give it to you. For most women, this is a terrible experience.I would hope doctors would be compassionate. I was on my back for about 45 minutes. I had two ultrasound guided core biopsies. I wasn't uncomfortable at any point during the procedure. I am a tiny bit sore like I have a bruise but that's about all. If you can take giving blood, trust me, this needle is nothing. Honestly, closing your eyes and taking nice slow breaths will really help. :) Edited to add.....yes, I would think you would be fine to go to work after. Ask the radiologist. She will tell you what she recommends. Keeping your brain busy is best lest it wander to dark, scary places and no one needs that. Xoxo",
      "MessageIndex": 12,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828114",
      "Title": "Needle Biopsy of Breast questions DirtyBird101 DirtyBird101"
    },
    {
      "AuthorID": "LoveandLigh…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243837/profile",
      "Content": "Feb 4, 2017 11:13PM LoveandLightinLA wrote: Hi ladies, I just had surgery yesterday - a nipple delay procedure and sentinel node biopsy. It was a long day at the hospital. So glad to be home and resting. I'm hoping I have a quick recovery. I will also have a nipple sparing mx with direct implant reconstruction on 2/13. And yes, I too felt like I had to wait forever to get surgery... I was diagnosed on 12/9/16. The waiting and the build up of anxiety and stress is the worst! Wishing you all the best with your surgeries!!! :)",
      "MessageIndex": 15,
      "PostDate": "04/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    }
  ]
}