{
  "AuthorID": "LoveLee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138065/profile",
  "Posts": [
    {
      "AuthorID": "LoveLee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138065/profile",
      "Content": "Feb 4, 2014 04:02PM LoveLee wrote:  Im so glad you went to get it checked again.  This was exactly me when I was diagnosed.  I knew they didnt get the right cyst (as they called it).  Mine was under my breast and they went in from the top saying that it was a better angle.  Stupid doctors!!!!!  When I asked they said that this was a better angle. One year later....on a mamo, there it was, right where I told them \"lump\" was.  Keep us updated.  ",
      "MessageIndex": 12,
      "PostDate": "04/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/817435",
      "Title": "Lump still the same after cyst aspiration? scared-mammy AZ85048"
    },
    {
      "AuthorID": "LoveLee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138065/profile",
      "Content": "Feb 5, 2014 04:40PM LoveLee wrote: I ask the dr. why I could still feel it after it was aspirated and he said that it was just irritated and that it might get bigger (It never went down). Ohhh how I wish I would of known then what I know now about bc.  No family history so I really wasn't super concerned....  Love those Seahawks but i'm glad football is over.  The Seahawk parade is on my soap channel  today :-(  Of all days, it was going to be a good!!!!",
      "MessageIndex": 14,
      "PostDate": "05/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/817435",
      "Title": "Lump still the same after cyst aspiration? scared-mammy AZ85048"
    },
    {
      "AuthorID": "LoveLee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138065/profile",
      "Content": "Nov 23, 2011 07:06PM LoveLee wrote: This post just got me thinking about last year.  Lets see...last year this time i was in the hospital getting my DMX.  I was sent home on a snowing like crazy Thanksgiving day!  I think the 100 mile ride home was the scariest part of the whole surgery lol. Last years holidays was the toughest one.  We had lost our dear granddaughter Summer, Dec.28 the year before of SIDS.  I remember thinking how hard it was going to be. I made it through surgery and the holidays. I am so thankful for my 3 Grandsons that since have been added to my family. Life does change. Happy Thanksgiving to all Vicky",
      "MessageIndex": 6,
      "PostDate": "23/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778576",
      "Title": "Happy Thanksgiving everyminute dood"
    },
    {
      "AuthorID": "LoveLee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138065/profile",
      "Content": "Feb 25, 2014 04:00PM LoveLee wrote: Scared-mammy...Just wondering how your appointment went.  I hope all is well.",
      "MessageIndex": 15,
      "PostDate": "25/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/817435",
      "Title": "Lump still the same after cyst aspiration? scared-mammy AZ85048"
    },
    {
      "AuthorID": "LoveLee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138065/profile",
      "Content": "Nov 23, 2011 08:59PM LoveLee wrote:        Cookiemonster, thanks for recommending this!!! I will be having DIEP surgery December 19th.  Merry Christmas to me in a strange way lol. I have always wanted to get my shopping done early, I'm just about done, should finish up on Black Friday (wrapped and all).  It seems like i have been waiting for such a long time for this, and now its here. I must be nesting or something because all i want to do is clean and grocery shop and cook!!! I already cleaned my car for the 100 mile ride home. I pray the roads will be good!!! I have more energy now than i have had in a long time. I guess i need to enjoy it while I can.   Karirn--How was the healing on the tummy tuck around the holidays? I will have my grandbabies home and its going to be so hard not to hold them!!!!  I'm sooo nervous---at the same time sooo ready!!  Happy Thanksgiving to all",
      "MessageIndex": 36,
      "PostDate": "23/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "LoveLee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138065/profile",
      "Content": "Dec 8, 2011 09:54PM LoveLee wrote: Hi everyone...Just got home from work, grandbaby is fed (I get him on Thursdays :-) and he just fell asleep.  I have been thinking about everyone ALL day, i couldnt wait to get home and check to see how everyone is doing. Lots of surgeries today!!!  Sending positive thoughts to everyone who will be in the boat tomorrow... Vicky",
      "MessageIndex": 287,
      "PostDate": "08/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    }
  ]
}