{
  "AuthorID": "Lovestorun333",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200213/profile",
  "Posts": [
    {
      "AuthorID": "Lovestorun333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200213/profile",
      "Content": "Lovestorun333 wrote: Hi ladies, I just had a stereotactic biopsy done on May 8, with benign results given on May 9.  Over the last few days I've noticed a small dimple / dent / indentation / pucker at the incision site, as well as a small lump under/near the site.  I also have some breast pain near the site (enough to be annoying).  Since I only really knew what to expect after the first 5 days, I'm wondering is this is normal for the healing process as well.  I'm slightly freaked out by the lump, but am guessing it could be scar tissue.  Probably didn't help that I spent 3 hours mountain biking 2 days after the procedure, but I felt good then (not such a good decision, I know). Anyways, thank you in advance for any and all insight.  This is such a valuable website with some of the strongest women I have ever \"met\". Good health to all, Jen Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821408",
      "Title": "After the stereotactic Lovestorun333 Lovestorun333"
    },
    {
      "AuthorID": "Lovestorun333",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200213/profile",
      "Content": "Lovestorun333 wrote: Hello everyone! I've been lurking here for the past 3 weeks, after receiving the call from my ob/gyn that my initial mammogram showed something suspicious in my left breast.  As a 43-year-old mother of 2 young girls who analyzes everything, I searched everywhere for information on calcifications.  Many times I came to this site and found amazing stories of courage and survival, and I think the least I can do is give back to you all who may be going through similar difficult times. I had a follow up diagnostic mammogram about 3 weeks after my initial test.  It would have been sooner but I was out of town.  This one showed a small area of calcifications.  The technician was able to show me the pictures - amazing how these small things cause so much stress.  The radiologist reviewed the films and told me that while it didn't look like cancer, it couldn't be ruled out because my maternal grandmother had breast cancer.  That meant a stereotactic biopsy was to follow. I scheduled the biopsy for the following week (May 8) and planned to take a full sick day from work.  Although my appointment was at 9:30, I didn't go back until almost noon due to a mix up at the desk.  They thought I was a NO SHOW!  I had only been sitting there for an hour...really?!   The table had a big hole in the middle, and I was wondering if they could dial it down enough to hold my tiny left boob.  I didn't receive a pillow either, since it would raise my chest too much.  So the radiologist explained the biopsy procedure and then left the room while the assistant got me situated.  I couldn't move at all.  That was the worst part!  I had to look right the entire time!  My neck was hurting so much!  The radiologist numbed me up, took pictures, put the needle in and then proceeded to remove tissue.  Because my boob was so small, he had to use 2 different positions and it took twice as long.  I didn't feel a thing, though.  Lidocaine works well! The biopsy was yesterday and I was told to expect results today or Monday.  I missed the call from the hospital, and after what seemed like eternity, I finally got through to the nurse.  My results were benign and it was some sort of fibrocystic thing.  She wanted to let me before the weekend...it was nice. So, while I realize this is a long post, I just thought I'd share.  I'm now on the warpath to inform anyone and everyone to get their annual mammograms.  I always thought a lump was the first sign of possible cancer, but now I know better.  It's very scary to go through, and I will be very vigilant from this day on. I wish you all good health and happiness! Jen Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/820949",
      "Title": "Benign results after indeterminate microcalcifications found Lovestorun333 Lovestorun333"
    }
  ]
}