{
  "AuthorID": "lpost3698",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165449/profile",
  "Posts": [
    {
      "AuthorID": "lpost3698",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165449/profile",
      "Content": "Jan 8, 2013 09:28AM lpost3698 wrote: Thanks, Jessica749.  Your insight is helpful.  I'm so happy they were able to help you.  Hopefully you're in good health now. I couldn't find the requirements for getting into the program, but I think I'm high risk b/c mom had breast cancer at 50, I'm 38 with no kids, Jewish background and have a history of breast diseases... multiple fibroadenomas (which I've read multiples increases risk) and phyllodes tumors. Not sure I qualify based on these criteria (and in a way, I hope I don't.  I'd feel better knowing I'm at a lower risk). Were you always treated by Dr. Mangino?  What does the program entail?  The website is limited to a single brief page.",
      "MessageIndex": 9,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/798382",
      "Title": "MSK's Special Surveillance Breast Program? lpost3698 lpost3698"
    },
    {
      "AuthorID": "lpost3698",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165449/profile",
      "Content": "Jan 6, 2013 11:35AM - edited Jan 6, 2013 10:31PM by lpost3698 I only spoke to the appointment booker-- I couldn't get past her.  I never thought about sending paperwork.  Good idea.  I'm going to try that.  I'm also going to make an appt with the group to check it out.  I still want to see a surgeon and I always get worried my insurance is going to deny coverage for seeing multiple doctors, hence my question, but it's my health. I have an appt with Dr. Freya Schnabel at NYU. Do you know her?  My PCP is part of NYU and recommended her. She's rated highly but I haven't been happy with NYU thus far.  The equipment looks state of the art but neither my PCP nor the two radiologists provided much direction about follow up treatment.  I was only suggested I see a breast surgeon a month after the biopsies because I asked my PCP another question in passing.  And even then she was lackadaisical about it.  Do you have the name of someone in Dr. Van Zee's office I can ask for?  It might make it easier for me to get through.  Also, I'm assuming you like Dr. Van Zee if you recommended her to a friend.  What else can you tell me about her? THANKS!!! L",
      "MessageIndex": 2,
      "PostDate": "06/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/798382",
      "Title": "MSK's Special Surveillance Breast Program? lpost3698 lpost3698"
    },
    {
      "AuthorID": "lpost3698",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165449/profile",
      "Content": "Jan 6, 2013 10:41PM lpost3698 wrote: Thanks, Ladies!  I feel better about Dr. Schnabel.  I didn't know that about Hoda.  I didn't even know she was sick.  I guess at Schnabel's and Van Zee's level I should be in excellent care regardless of who I go to.   My appt with Schnabel is on the 23rd.  I'll let you know how it goes.  I plan to follow up with Van Zee or the program after that.  I'm having knee surgery this coming Friday (and shoulder surgery in February) for an injury so I don't think I'll be able to get in anywhere before then.  Now I just have to wait and try not to obsessively think about it.",
      "MessageIndex": 7,
      "PostDate": "06/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/798382",
      "Title": "MSK's Special Surveillance Breast Program? lpost3698 lpost3698"
    },
    {
      "AuthorID": "lpost3698",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165449/profile",
      "Content": "Jan 10, 2013 07:39PM lpost3698 wrote: Thanks!",
      "MessageIndex": 11,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/798382",
      "Title": "MSK's Special Surveillance Breast Program? lpost3698 lpost3698"
    },
    {
      "AuthorID": "lpost3698",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165449/profile",
      "Content": "lpost3698 wrote: I'm at extremely high risk for breast cancer and was diagnosed with fibroadenoma last month (3 palatable lumps in my right breast).  My PCP suggested I see a breast surgeon given my history.  I wanted to see Dr. Van Zee but she only sees patients diagnosed with BC.  I was referred to the Surveillance Progam. Does anyone have any experience with it?  I don't know what to expect.  I'm interested in long term monitoring but I'm most concerned that my current diagnosis is correct so I'm trying to decide if I should go to the program or find another breast surgeon. Thanks for your help! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/798382",
      "Title": "MSK's Special Surveillance Breast Program? lpost3698 lpost3698"
    },
    {
      "AuthorID": "lpost3698",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165449/profile",
      "Content": "Dec 4, 2012 09:24PM - edited Dec 4, 2012 09:26PM by lpost3698 Are you able to get in sooner?  I know how you feel. I found a lump in my breast last week and my dr found 2 more today in the same breast. She didn't say anything about what it could be but told me I need a mammogram and ultra sound as soon as I can with the radiologist present for diagnosis.  That's not a good sign.   I'm freaking out.  I have very high risk factors- 38, never had kids, mom had breast cancer at 49 and I had a benign lump removed when I was 18.  I keep telling myself that a lump can't be diagnosed based on feel alone so I shouldn't be concerned with the doctor's reaction.   My appts are tomorrow.  It's going to be a long night!",
      "MessageIndex": 2,
      "PostDate": "04/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797236",
      "Title": "Anxious newbie Starlight23 Starlight23"
    }
  ]
}