{
  "AuthorID": "LPR",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150253/profile",
  "Posts": [
    {
      "AuthorID": "LPR",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150253/profile",
      "Content": "Jun 6, 2012 03:50PM LPR wrote: Linda2222 - I totally understand the Xanax it was my best friend when I was first dx. I cried just like you did everyday. That was a dx you never want to hear. I too was HER2 positive and my onc said this was not going to kill me and my life would return to normal in time. As of today it pretty much has. I had an MRI, CT scan and a PET scan was so scared just as your are. They are very standard test and are excellent in verifying that the cancer is not located any place else. The anticipation is worse than the tests. It's so overwhelming and very difficult to comprehend it helps to write down your questions and try to take someone with you who can be your ears. I had a difficult time comprehending everything that I was being told, I even went for a second opinion. I had a lumpectomy and the tumor turned out to be half the size was originally thought which luckily change the course of treatment. The margins were clean the first time out and SNB was clean. I was 51 and scared to death asking why me, I found no answers. I had 33 rad treatments and for now that's it. My onc said all the studies showed with the size, grade and stage the chemo would only lower my reoccurrence rate by 2% and felt it was not worth the side effects. Stay strong there are so many of us who have experienced those 3 awful words that change your life forever. I did a lot of reading and finding out as much as I can about this disease and how to be proactive in my treatments. Be your own advocate. Hugs to you and I found out they go a long way in making it through. Your in my thoughts and good luck moving forward past this bump in the road to the rest of your life.",
      "MessageIndex": 26,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/788278",
      "Title": "Recently Diagnosed floridatworeds rita65"
    },
    {
      "AuthorID": "LPR",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150253/profile",
      "Content": "May 30, 2012 06:18PM LPR wrote: I felt exactly as you did..after I heard the word cancer I could not comprehend anything else. I first saw a surgeon highly recommended by my gyn and after waiting almost 2 hours to see him and hearing everything he said I still needed more answers. I sought out a second opinion met with an oconoglist who was very compassionet and began to feel I could deal with this. Then the journey began. Alll different tests to check if the cancer was anywhere else, blood work and a breast MRI. After all the test results were in a surgery was set it became less and less like an awful dream and more of a reality. Please make sure you feel that your doctors are compassionet and caring. It makes a huge difference. Stay strong and always ask for help when you feel like you can't do it alone. Fortunately your not alone there are many of us.",
      "MessageIndex": 12,
      "PostDate": "30/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/788278",
      "Title": "Recently Diagnosed floridatworeds rita65"
    },
    {
      "AuthorID": "LPR",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150253/profile",
      "Content": "Jul 6, 2012 04:12PM LPR wrote: I'm not a newbie I've had my lumpectomy and completed my 33 rads back in May. After my mom was just diagnosed in late June I began second guessing the choices I made. One this I am going to do is the BRCA test, it won't change the course I took with my reast cancer but it will allow me to be proactive pertaining to ovarian cancer. I have also sought a second opinion to a Dr at UM Sylvester specializing in Herceptin. He agreed to administer it solo and he forwarded his recommendation on to my oncologist. I certainly hope he will be receptive to it. This has been a very difficult road first my diagnosis, then my mom less than 5 months later (thankfully she's not HER2+) as I am, and if that isn't enough now my brother diagnosed with stage IV lung cancer prognosis few months. All this is to much for my to wrap my arms around. I guess I just need to vent and say I'm so scared.i feel right now like I felt the day I found out I had cancer. The tears never stop flowing and Xanax is my best friend right now. Omeggo-I'm in So. Florida where in Florida are you?",
      "MessageIndex": 43,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789853",
      "Title": "Any other newbies? cpp christina0001"
    },
    {
      "AuthorID": "LPR",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150253/profile",
      "Content": "Jun 18, 2012 06:27PM LPR wrote: I'm hoping someone can help me understand. I myself was diagnosed Feb 2012, and was very lucky. My tumor was 6 mm and ER / PR- and HER2 + but given all the numbers the onc did not believe that chemo had that much influence on the diminishing percentage on the reoccurrence that he opted to only have me do 33 rads. I completed that May 24 and for all this I'm thankful. As life would have it Friday my mom had her yearly mamo and the discovered a mass in her left breast 2.5 cm, that was classified as \"highly likely to be malignant \" She is going to be 80 and has many other health issues including hypertrophic cardio myopathy which in itself is a lot to deal with. I'm am taking her on Wednesday to the bs and hopefully get some more answers. I'm so frazzled it's not even a month since I finished my treatments and now this. Does anyone have any insight as to developing BC this late in life with so many other healt issues already.",
      "MessageIndex": 16,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789227",
      "Title": "Overwhelmed Lettiegonz LittleMelons"
    },
    {
      "AuthorID": "LPR",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150253/profile",
      "Content": "Jun 18, 2012 07:57PM LPR wrote: GrandmaV, Thank you so much for the links you provided and I googled and got a few articals that were insightful as well. I'm just keeping my fingers crossed and hoping for the best. I will know more on Wednesday after the bs appointment.",
      "MessageIndex": 18,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789227",
      "Title": "Overwhelmed Lettiegonz LittleMelons"
    }
  ]
}